{
    "id": "11i5pie",
    "score": 5,
    "title": "Vets using CH 31 who asked for a laptop, what did you get?",
    "author": "SignsandSquares",
    "date": 1677948732.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/11i5pie",
    "media_urls": [],
    "other_urls": [],
    "postText": "My dell is on its last leg and I'm considering asking for a laptop, but heard that it's up to the VA rep's discretion as to what I would get. Just hoping for a touchscreen laptop like a surface studio laptop or something similar.",
    "comments": [
        {
            "level": 0,
            "comment": "They gave me an Levono ideapad. Later on I found out you are able to get whatever you want and they’ll cover it, I wish I would have that route.",
            "score": 5,
            "author": "A_Student_In_Golden",
            "replies": [
                {
                    "level": 1,
                    "comment": "I heard IdeaPads are pretty solid, so at least it isn't a total loss. Thanks for sharing the info.",
                    "score": 1,
                    "author": "SignsandSquares",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t really complain with mine. Towards the end it started to struggle due to all the things I had to have like SolidWorks, MATLAB, MathCad, etc. I would ask if you can get your own and get one built to handle all of that. I was also given a printer so that was a huge plus.",
                            "score": 2,
                            "author": "A_Student_In_Golden"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got the latest MacBook Pro. I enjoy it a lot and ended up purchasing an iPad for notes notability has the ability to transfer via iCloud and record audio so its nice to seamlessly ‘watch’ my notes on my laptop whenever I feel like I need a review",
            "score": 2,
            "author": "Qwertycurator"
        }
    ]
}