{
    "id": "123p1s5",
    "score": 0,
    "title": "Gpa",
    "author": "KanojoOkarishimasu",
    "date": 1679928451.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/123p1s5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just wondering how hard it is to maintain a decent gpa (3.8+) before I commit to mines!",
    "comments": [
        {
            "level": 0,
            "comment": "Depends on so many factors - which major you are, how many credits you take each semester, how studious your are, etc. It’s not impossible by any means but it’s different for everyone",
            "score": 15,
            "author": "LevitarDoom"
        },
        {
            "level": 0,
            "comment": "Easiest way is to lower your expectations. Realistically 2.8+ is a decent GPA at Mines.",
            "score": 13,
            "author": "gogoyogert",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": -5,
                    "author": "KanojoOkarishimasu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotcha, I don't have any info on Chem or Bio, my degree was Applied Math. Best of luck to you, if you got a full ride and keep working hard you will do great at Mines.",
                            "score": 3,
                            "author": "gogoyogert"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The workforce largely does not care too much about GPA and the fear mongering saying otherwise is wrong.",
            "score": 6,
            "author": "Qwertycurator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": -5,
                    "author": "KanojoOkarishimasu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "3.8+ is considered a stellar GPA here, not a decent one.\n\nOver 3.0 is good, and over 2.5 is decent.\n\nI had a 4.58 in high school and graduated Mines with just over 2.5",
            "score": 3,
            "author": "Crashbrennan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": -3,
                    "author": "KanojoOkarishimasu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If their reputation is accurate, Chem classes are some of the hardest classes at Mines. I don't know much about the bio classes unfortunately.",
                            "score": 2,
                            "author": "Crashbrennan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "'decent gpa (3.8+)' \nHA!",
            "score": 3,
            "author": "CoolVibranium"
        },
        {
            "level": 0,
            "comment": "You focus too much on transferring man, just bang it out and have a good time. Who knows maybe you’ll find something else you like besides being a DoCtOr",
            "score": 3,
            "author": "dhskeogo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also expect to work harder than you ever have to maintain close to a 4, sometimes it’s just not fair and you have to take an L",
                    "score": 3,
                    "author": "dhskeogo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Forget gpa the only number that matters is starting salary.  I have 2.7 GPA and have 2 90k+ job offers right now.",
            "score": 4,
            "author": "Ore-igger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": 1,
                    "author": "KanojoOkarishimasu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Harvey Scholar?",
                            "score": 1,
                            "author": "Ore-igger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, Colorado scholar, my fin aid covers the entire rest!",
                                    "score": 1,
                                    "author": "KanojoOkarishimasu"
                                },
                                {
                                    "level": 3,
                                    "comment": "But know anything about the Chem and bio?",
                                    "score": 1,
                                    "author": "KanojoOkarishimasu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, the chemical engineering department has a 95% acceptance rate as a premed. Quantitative bio-science is a new and strong program, very stellar professors.  If you can take organic chemistry at a community college you should, it will save you a lot of stress. I would look into an chemical engineering degree with bio specialty from what your interest are and then you have a very productive option if you find that medical school is not what you want after a few years.",
                                            "score": 2,
                                            "author": "Ore-igger"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not",
            "score": 2,
            "author": "Aromaticboy"
        },
        {
            "level": 0,
            "comment": "It's fairly reasonable if you start at that GPA. I finished my freshman year with a 2.8, but finished my degree with a 3.439 before pursuing my M.S. in another field.\n\n It was reasonable to get a 3.7 + each semester as an EE (one of the 3 hardest on campus - one of the factors mentioned above is degree choice), but since I started with a low GPA I was unable to finish with a higher GPA. \n\nMind you, this was attending classes and doing homework and test prep with my \"squad\" (me + 2 EE colleagues who built the same schedule for 2.5 years) from 8am - 7pm M-Thurs, 8a - 3pm Fri, 12p - 3pm Sat, 12p - 5p Sun (again EE is one of the 3 most difficult degrees on campus). \n\nIf you start high and keep the work consistent, it isn't too bad! You'll get your groove down over time, just don't drop your GPA while getting your groove down.\n\nEDIT: I was able to start my career at P&amp;G as a manager making $92k annually with 3.44 BS in EE and 3.67 MS in ETM from Mines if that provides any information for outcomes with a certain GPA out of Mines ⚡👍",
            "score": 2,
            "author": "SMITTYfootking31",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": 2,
                    "author": "KanojoOkarishimasu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know the Biochem scene is definitely getting more popular on campus. I'm unsure if it's a specialty within chem or chemE or if its own degree. I do have a colleague who just got into San Diego State Med School (among a few others) who did work within the Biochem course path at Mines, however I'm unsure what her degree was formally within. ChemE is one of the other big 3 along with Petro for difficulty (note - Mining Engineering is its own tier/beast as it is the #1 Mining Engineering program in the world). \n\nI'd reach out to the Biochem people on campus and get a better understanding of their course path, course work, and the opportunities that arise for that degree path.\n\nVery Important Information - your career path is going to be defined primarily by your internship choices and activities that you become involved in (undergrad research, etc.). Anyone within a Chem field (Chem, ChemE, Biochem, etc.) can work within a Biochem field and realistically a ChemE degree may better prepare you than a pure Biochemistry degree. \n\nBest recommendation is to understand the industry (do your own research) and touch base with Biochem peeps at Mines (both undergrad and grad since all you're looking for is information - departments and students if you can find them) and ask them questions you've determined to be important for your decision.",
                            "score": 1,
                            "author": "SMITTYfootking31"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends, adjusting to college classes and lifestyle hits everyone different. I graduated with a 3.1 and had no trouble getting a good job. If you're looking ahead at selective grad programs I guess then you'd want to keep your GPA up for that - but most employers don't actually care.",
            "score": 1,
            "author": "HelluvaEnginerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for late reply, I was busy with a class, but never less, I won’t be doing any sort of cs or engineering classes, I will be on a pre-med track majoring in Biochemistry, (yes I know mines is mainly a only for cs and engineering, but this is the only school that gave me a full ride so far, I can’t afford really anything) any info on the Chem, bio classes and stuff like that?",
                    "score": 1,
                    "author": "KanojoOkarishimasu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was Chemical Engineering and took a lot of classes with a few people that were BioChemical Engineering  and intending to use that major combo Pre-Med. I would see if you can dig up any info on that track, as being Bio/ChemE you might stand out a bit on medical apps? I am definitely not an expert on that, but it’s worth checking out. The Chem and Bio classes at Mines are fine, but obviously the engineering classes are where the focus is. \n\nIf you go Bio/ChemE and then later decide you don’t want to head to Med School you’d also have much more marketable skills in the general job search. Plans and majors change often, even when it feels like you’re 100% decided on &lt;insert career&gt;. Also congrats on the full ride, no matter what you decide to study I’d definitely take advantage of that. The burden of student loans can’t be overstated.",
                            "score": 2,
                            "author": "HelluvaEnginerd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Without a full ride (I had the best academic scholarship out of state for $15k outside of Harvey) and out of state, I have ~ $280k from parent plus loans (which as a good engineer I'm going to be paying) and personal loans between my B.S. and M.S. at Mines (M.S. there were no scholarships/funding for). \n\nThis looks like ~ $1600 a month for the rest of my life unless I get mega money via progressing in my career. My mortgage for my first home is $1,017 for reference (Georgia has great cost of living lolz)",
                                    "score": 2,
                                    "author": "SMITTYfootking31",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought you were OP for a second and got super confused haha - yeah, Student Loans suck but that mortgage is LOW! I'm still in CO north of Denver and our 3bed/3bath suburban home mortgage is ~$2,500/mo. Georgia not looking so bad now",
                                            "score": 2,
                                            "author": "HelluvaEnginerd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My coined term is \"Effective Salary\" because my buddy in Santa Barbara making $130k fresh out has an effective salary which is only ~ 70% of my $92k salary in Georgia due to the cost of living. I got super lucky by getting such an awesome offer (the only one I got actually) in an \"awesome\" place (in relation to cost of living). Hopefully I can pay some. Debts down before my career takes me back into the big city aha 😄",
                                                    "score": 1,
                                                    "author": "SMITTYfootking31",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Effective Salary is definitely a thing, this calculator is fun to play with to compare https://www.bestplaces.net/cost-of-living/. \n\nAnd your salary will grow much more quickly than you'd think if you can be the go-between Engineers &lt;-&gt; Management and switch jobs when you hit the arbitrary ceilings that big companies seem to have.",
                                                            "score": 2,
                                                            "author": "HelluvaEnginerd"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mine is okay and its taking me extra time to graduate.",
            "score": 1,
            "author": "atempel2000"
        }
    ]
}