{
    "id": "13yhtly",
    "score": 17,
    "title": "Thoughts on trying to hold a job while in school?",
    "author": "Ok_Journalist_5008",
    "date": 1685724342.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/13yhtly",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m wondering if the workload will allow me to hold a waiting job in addition to school. I’m an incoming freshman and am worried that I need to fully focus on school. I am going to try and be as involved in school as possible, and money is nice, but school is my top priority. Do you think it’s worth it/possible to keep a job while in school?",
    "comments": [
        {
            "level": 0,
            "comment": "there are a lot of easy on campus jobs where you can do homework/study during working hours. and the pay is decent, especially if you keep the same job for multiple semesters (most on campus jobs will give you a raise each semester)",
            "score": 26,
            "author": "beekeeper-of-secrets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like what if you don’t mind me asking? I’m very interested, I’ve had people say that I should get a job at a library or something so I’m open to ideas.",
                    "score": 2,
                    "author": "Ok_Journalist_5008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you can get a job as a desk assistant at a dorm building; you sit at the desk and help people when they ask for things. same with rec center front desk, library, student center, etc.",
                            "score": 2,
                            "author": "beekeeper-of-secrets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked 2 jobs, ~20 hours a week through undergrad, and then worked full time through grad school. It’s doable, you just have to make sacrifices, and most of the time that was my social life and involvement in clubs/activities that got cut. \n\nIf I could go back I would absolutely dial back the amount of time I spent working. You are paying a significant amount of money to go to school, and that includes the social aspect of it as well, so get your moneys worth. There is plenty of time to be working after you graduate.",
            "score": 19,
            "author": "jdlikefood"
        },
        {
            "level": 0,
            "comment": "Its possible, question is - is it needed? If you can make it without working IMO you should. You'll work the rest of your life, if you don't _need_ to work then you should focus on studies and try to have fun.\n\nOf course if you need to work then this is all out the window, it just sounds like its not a requirement for your situation",
            "score": 13,
            "author": "HelluvaEnginerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I’m a Harvey scholar so it isn’t totally needed, I’m trying to pack my extracurriculars in to get into med school",
                    "score": 4,
                    "author": "Ok_Journalist_5008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I personally wouldn't work. Or if you're going to, do something super part-time on campus or research that interests you etc. I worked on the bottling line for AC Golden Brewery in the Coors building once a week - work for a few hours, go home with a free 6 or 12 pack of decent beer, find something like that. After school you'll be way overworked in the medical field and will be glad you didn't work needlessly during undergrad.",
                            "score": 10,
                            "author": "HelluvaEnginerd"
                        },
                        {
                            "level": 2,
                            "comment": "As HelluvaEnginerd eluded to, I would definitely do undergrad research. It can count towards tech electives, or you could apply for MURF so you can get paid a little bit through the semester. During the summer professors themselves will often pay for undergrad researchers. Just go to faculty page for your major (or whatever department you seek opportunities) and click around on professors to see what research they’re doing and then reach out to them. Guarantee you’ll get a position, professors are required to serve students, it’s part of their tenure. Good luck!",
                            "score": 2,
                            "author": "Ultronomy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was fortunate to be able to make it through school with loans for tuition + work study for additional funds. \n\nHowever, I had quite a few friends who worked part time and some even full time to be able to pay rent. It’s definitely possible, it’ll just require a very strong work ethic and discipline.",
            "score": 8,
            "author": "c_tello"
        },
        {
            "level": 0,
            "comment": "Not to be that person but can I know what GPAs the people who worked during school had?",
            "score": 4,
            "author": "susanxo97",
            "replies": [
                {
                    "level": 1,
                    "comment": "I worked all through my 4 years there. 3.13 with a 3.71 major/minor specific but yeah having to work and go to mines was not easy and shouldn’t be taken lightly.",
                    "score": 7,
                    "author": "UncomfyNoises",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for responding!!",
                            "score": 2,
                            "author": "susanxo97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course, I am curious myself. Id bet there are few 4.0ers that worked while accomplishing that",
                                    "score": 3,
                                    "author": "UncomfyNoises"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "3.56 undergrad, 3.76 grad",
                    "score": 3,
                    "author": "jdlikefood"
                },
                {
                    "level": 1,
                    "comment": "3.7 undergrad, 4.0 grad. I only worked part time, at most 20 hours a week. For the most part I worked on campus jobs that i was able to do a lot of studying at.",
                    "score": 2,
                    "author": "MyNameIsMurphy2"
                },
                {
                    "level": 1,
                    "comment": "3.25 undergrad finishing in 4 years working 6-12h/week junior and senior year while also an athlete. I'm in hindsight, I was overloaded and burnt out but the job gave me time to study most/all of my shifts.",
                    "score": 2,
                    "author": "brafits14"
                },
                {
                    "level": 1,
                    "comment": "3.8ish working ~10 hours a week (undergrad).",
                    "score": 2,
                    "author": "djp_hydro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Med School is Hard to get into, but the school work doesn't compare to Mines. Yes, I was a Chem Eng. For 5 years after Mines and then went back to Med School and have had 25 +year career. \nMed Sch.-Memorization \nMines-much harder\nYou all are killing it!",
            "score": 3,
            "author": "AMGgj"
        },
        {
            "level": 0,
            "comment": "I worked 40 hours a week through 4 of the 4 1/2 years it took to graduate. I graduated with a bachelor's in mechanical engineering, 3.0 GPA and had an internship senior year. \n\nI essentially participated in 0 clubs and extracurriculars, but I took classes very seriously. I think I took 12-15 credit hours a semester, and took some summer classes to keep up. I even took a 500 level graduate class and passed with an A, while working.\n\nI don't consider myself overly smart but I have a great memory and didn't study much (didnt have much time to). I pay attention in class, learn, and remember. \n\nIt's certainly possible to hold a job, even full time. Probably depends on how you work and how you learn. Hope this helps.",
            "score": 1,
            "author": "Background-Unit1026"
        },
        {
            "level": 0,
            "comment": "I delivered pizza 20 hours a week all of my freshman and sophomore years. I studied while I worked. Find a job like that and you’re set. Better yet, find a paid internship like I did junior year and was able to quit delivering pizza thankfully",
            "score": 1,
            "author": "UncomfyNoises"
        },
        {
            "level": 0,
            "comment": "With good time management it's not bad. I'm very active in extracurriculars, have a great GPA, and worked for work study, worked for undergrad research, and worked a part time job.",
            "score": 1,
            "author": "xdpug"
        },
        {
            "level": 0,
            "comment": "I worked full time we'll trying to take a full time class load and I'll be honest it affected my GPA but I still ended up with a 3.2.. I just know it could have been better if I wasn't working all the time",
            "score": 1,
            "author": "East-Reference4343"
        },
        {
            "level": 0,
            "comment": "I went to an online school through middle and high school. And due to the flexibility of school, I was actually able to both work and do school full-time. I still got mostly As and Bs, but my social life and grades definitely suffered, and I was stressed.\n\nI'm taking some time off before attending college, but from my experience, I would say to test the waters with an easy, flexible, part-time job. If it feels doable after a month or two (or whatever feels natural), you can adjust your job/schedule to have a good balance without too much stress. So it's definitely possible, depending on your work ethic, scheduling skills, and stress management.\n\nAlso, an important note: don't back yourself into a major commitment to your job, where you can't easily quit if you need to. My old job relied too much on me and made it difficult to leave. That was partially my fault. \n\nWork hard, but make it clear that the job isn't a priority in your life. Not unless you want it to be your career.",
            "score": 1,
            "author": "HippocratesII_of_Kos"
        },
        {
            "level": 0,
            "comment": "I work 40 hrs/ week and do just fine, so it is possible!",
            "score": -2,
            "author": "MattThePhatt"
        },
        {
            "level": 0,
            "comment": "I worked 2 jobs and played varsity football. It’s definitely is possible, you just have to manage your time very well",
            "score": 0,
            "author": "OgreTrax71"
        }
    ]
}