{
    "id": "loa7eu",
    "score": 9,
    "title": "Scholarship Opportunities for International Students",
    "author": "angryb-09",
    "date": 1613837265.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/loa7eu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all,\nI am prospective international student and currently have an offer to join Colorado School of Mines. I am willing to take Electrical Engineering as my major. As CSM doesn't provide any financial aid to international students for first year, I want to know if the college provides any scholarships to international students on 2nd, 3rd and 4th year based on academic performance. \nMy family might have a hard time paying my tuition for all 4 years in full so its the only thing that is keeping me from accepting the offer and confirming my place. Other than that Mines is my dream college and i am eagerly waiting to be a part of it.\nThank You.",
    "comments": [
        {
            "level": 0,
            "comment": "I am not sure if mines offers financial aid for international students at all, and so far (2 semesters), I couldn’t get an on-campus job or a scholarship at mines. Not being eligible for work study really makes things hard. Even more so if you’re not good at networking. Most scholarships I heard about are for green card holders too, and the ones that international students are eligible for are competitive I feel like. Or maybe it’s hard because I’m dumb.\nIf I remember correctly, I believe you need to show that you or your parents can support you financially for school to get the visa. Mines international office checks it too, so be careful about that one. They ask for a bank statement and pay stubs.",
            "score": 2,
            "author": "Biscuick"
        },
        {
            "level": 0,
            "comment": "When I was there years ago, Mines provided scholarships to international students (annually). I don't know about your major/college, but IIRC, civil department didn't have one.",
            "score": 1,
            "author": "yoohoooos"
        }
    ]
}