{
    "id": "ly0kpm",
    "score": 6,
    "title": "Early Graduation?",
    "author": "thatsaspicyyeetball",
    "date": 1614907210.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/ly0kpm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a freshman here, and I’m going to major in Stats. I have a ton of transfer credits, so I talked to my advisor and it would be entirely possible to graduate in 3 years without over stressing myself. Has anyone here done it, and what was your experience with graduating early?",
    "comments": [
        {
            "level": 0,
            "comment": "Currently a Computational and Applied math major graduating in december (1 semester early), and I only averaged 14 credits each semester. Definitely possible, especially since math is one of the more flexible majors.",
            "score": 3,
            "author": "gogoyogert"
        },
        {
            "level": 0,
            "comment": "Im a current freshman planing to try to graduate in 3 years. I’m also planning to join the accelerated masters program which should only take me an extra year. Most people in the work force encouraged it since money is an issue for me, and its the same education in a few less years. I’ll only be 20 when i graduate with the undergrad and 21 with the Masters. My computer science teacher from hs did the same thing and she said it actually looked better for her when applying for jobs.",
            "score": 5,
            "author": "melinasmith"
        },
        {
            "level": 0,
            "comment": "I'll successfully graduate in 3 years (transferred in 80ish credits)\n\nI took 12-15 creds a semester and was still stressed",
            "score": 5,
            "author": "vickyswaggo",
            "replies": [
                {
                    "level": 1,
                    "comment": "What were the most stressful for you? I’m obviously a different major, but what do you think is the hardest part about balancing it?",
                    "score": 2,
                    "author": "thatsaspicyyeetball",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I could never double major, lol. The classes that stress me out the most are physics and Chem- this is my last semester of physics and I take Chem 1 next semester. I’m taking some classes over the summer and 15 credits/semester for the rest of it. Right now I’m at 16, and it’s not stressful for me despite how much I hate phys 2",
                                    "score": 2,
                                    "author": "thatsaspicyyeetball"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It honestly varied by year:\n\nFreshman year (which for me was just my first semester) adjusting to large class sizes and inexperienced team members (I had previously gone to a CC for 4 years, in which my team members had much practical experience).\n\nSophomore year (which was also really just a single semester) was adjusting to the ChemE specific ways (quizzes every X day, homework required to follow a specific format, no EC, a week for regrades, hit or miss exams and quizzes). \n\nJunior year was adjusting to the faculty: Barankin is fond of memes but a stickler for proper data explanation. Jechura likes English units and emphasizes process safety in things. Wu and Gomez have weird handwriting. Gardner is fond of \"make up your own problems\" for fluids. And so it goes on and on\n\nSenior year (in which I am now) is adjusting to how stupid my exams and classes are. Granted, it's all remote so I can't interrupt the professor non stop. Ever since COVID started, collaborating on assignments has been the norm for most of us, and not being allowed (formally allowed) to do so on exams is very difficult. Open note/book/google doesn't really apply to niche topics like process (you can't just google how to make the entire model of a system in 5 minutes). Also timing is a big issue, I think we need more time for exams.\n\n\n\nThe hardest part about balancing it is knowing that because of circumstance, getting a job/internship is difficult. I've gone to career fair every time for 3 years and have only gotten 1 interview. I've applied online, but my lack of internships (ironic, to get an internship, i need to have already had experience) has prevented me from really getting one",
                            "score": 2,
                            "author": "vickyswaggo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, that's what I did! I graduate this semester and I didn't find it all that bad honestly. Summer classes filled in a semeseter, and 1 extra class a semester was all it took. Think of it like getting a minor, except instead of a minor, you're getting an extra year to make money, gain experience, and not pay tuition.",
            "score": 2,
            "author": "JeIIyman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd like to also point out that school comes a little easier for me than most, and I didn't have a particularly demanding social or dating life for the first 2 years, when I was taking all those extra classes.",
                    "score": 2,
                    "author": "JeIIyman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean as long as your credits count in the right places, it's totally doable. I had to take a class over last summer that was a prereq for another but I'm in my way to graduate in 3.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm graduating with a chemical engineering degree this semester after only 3 years. I only brought in 28 credits (a little under whats considered a full year at Mines) so I had some heavy semesters (took 19.5 credits one semester). The biggest advice I can give though is to plan out your classes early. I planned my whole schedule my freshman year and confirmed it with my advisor to iron out any issues early. You don't want to end up missing prerequisites later on delaying your graduation.",
            "score": 1,
            "author": "Parrotnoe"
        }
    ]
}