{
    "id": "mkxa6a",
    "score": 2,
    "title": "How is mines aerospace program?",
    "author": "depressedknicksfan9",
    "date": 1617663449.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/mkxa6a",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m currently choosing between CSM and CU Boulder and I’m having trouble deciding between studying an aerospace major at Boulder as opposed to a MechE major and Mines with a minor in aerospace, since I recently read that it will be offered this fall. I feel like I would value the education at Mines more but the aerospace program at Boulder is really good as well from what I can tell, so I was wondering if anyone could provide some insight as to how the programs in Mines are in comparison? Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Tour the LASP ( Laboratory for Atmospheric and Space Physics ) first and then make up your mind. Personally, I would go CU for that specific major. As for the \"party school\" scene, that area has a niche more similar to Mines. That campus is slightly split from main campus. Go to both in person and tour. Get a feel for it.",
            "score": 3,
            "author": "atempel2000"
        },
        {
            "level": 0,
            "comment": "Academically aside, they are such different schools.",
            "score": 1,
            "author": "tpm319",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I know, I’ve visited both and I kinda like them both even though their so different lmao, I just know that the aerospace program is pretty good at boulder or else I’d probably go with Mines for sure. I think I’m leaning towards CSM anyway unless I hear anything else that would change my mind but I’m not 100% sure yet as you can see haha",
                    "score": 1,
                    "author": "depressedknicksfan9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just saw you toured both. whoops. go with your gut then.",
                            "score": 1,
                            "author": "atempel2000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you know you want to do aerospace then you should go to boulder. They have a Tier 1 program and direct industry connections that we just dont have yet. With that being said it’s still fairly common for mines graduates to wind up in that industry.",
            "score": 1,
            "author": "c_tello"
        }
    ]
}