{
    "id": "mqhlsz",
    "score": 7,
    "title": "How do I find a roommate as an incoming freshman?",
    "author": "JohnnyBoy4100",
    "date": 1618368267.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/mqhlsz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I filled out my housing application and whatnot but there was no section about finding my roommate. Is anyone else experiencing this? Has anyone found the solution?",
    "comments": [
        {
            "level": 0,
            "comment": "One thing that I did is just email the potential matches (through the housing portal) and talked to them for a bit to get a feel. Idk, worked for me. \nThere's also social media esk things that others have brought up. \n\nAlso, make sure you and your potential roommate are somewhat solid on the same things\n\nSleep schedule\nAlcohol or whatever ur gonna do in ur rooms\nNumber of people who hangout there/ atmosphere of the room\n\nI've seen a lot of people hate each other over these things. Communication is key.\n\nBest of luck! And welcome to Mines",
            "score": 8,
            "author": "Father_Dan"
        },
        {
            "level": 0,
            "comment": "Join the discord there are places to talk to other people who post profiles and then you can find one",
            "score": 4,
            "author": "cheffy213",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will you post or dm discord link?",
                    "score": 1,
                    "author": "Maxwax47"
                },
                {
                    "level": 1,
                    "comment": "Can you send me the discord link? I've been looking for one but can't find one.",
                    "score": 1,
                    "author": "Scithiryx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://discord.com/invite/TthpRFy7Rh",
                            "score": 1,
                            "author": "cheffy213"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last year there was a sort of roommate tinder where it has a list of people with their similarity to you. Maybe it’s just not open yet?",
            "score": 5,
            "author": "Xenxeva"
        },
        {
            "level": 0,
            "comment": "spin a roulette",
            "score": 13,
            "author": "LCD202021"
        },
        {
            "level": 0,
            "comment": "I’d say check out the incoming class Facebook group or Instagram and use the matches on the housing portal. gl",
            "score": 3,
            "author": "jkalmon08"
        },
        {
            "level": 0,
            "comment": "I believe I posted a picture to an incoming freshmen instagram page and my roommate messaged me and we're still good friends now",
            "score": 3,
            "author": "thousand56"
        },
        {
            "level": 0,
            "comment": "Hey! Make sure to go to search by profile from the group dorm tab on the application. You can just search by filter by inserting one change and a whole list of similar roommates will appear on your screen.\n\nI'm as well looking for roommates so DM me if you wanna chat! \n\nInstagram: \\_michael.maggiore\\_\n\nSnapchat: mike3840192",
            "score": 2,
            "author": "Ok-Abbreviations-917",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’ll dm you on Instagram",
                    "score": 1,
                    "author": "JohnnyBoy4100"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a senior, and freshman year I didn’t even fill out the housing application and I got a room",
            "score": 1,
            "author": "bigolbinchito"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not lol",
                    "score": 1,
                    "author": "JohnnyBoy4100"
                }
            ]
        }
    ]
}