{
    "id": "n2ajn1",
    "score": 14,
    "title": "I’m a grad student with an uncertain housing situation...anywhere to park (live) in a van near campus?",
    "author": "SenseKnown",
    "date": 1619840836.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/n2ajn1",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Methodist church at 1500 Jackson (across from Safeway) has partnered with an organization called HomeInGolden to provide for exactly this situation. You need to register but then you can park in their parking lot overnight. Free WiFi is provided with the help of a local ISP and there are showers and storage in the building you can access. While not monitored Golden PD does say they keep an extra eye on the space.\n\nhttps://goldenfirstumc.org/news-more/home-in-golden/",
            "score": 11,
            "author": "nic1902"
        },
        {
            "level": 0,
            "comment": "I usually see a van or two on 18th street by safeway. I don't know rules in Golden about that but I've seen vans there parked for multiple weeks with people constantly near/in them. Mines doesn't allow camping in campus parking lots but I honestly don't know how strictly they enforce that over the summer.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The parking space on the road behind Safeway isn't time limited and doesn't require a city permit",
            "score": 3,
            "author": "Xenathode"
        },
        {
            "level": 0,
            "comment": "As long as you move by 7 you can literally park on campus over night. I did that my entire freshman year",
            "score": 3,
            "author": "yeetermcdoink"
        },
        {
            "level": 0,
            "comment": "I know I've heard of 2 different people living in busses during the spring and fall semesters so it is absolutely doable. I believe one of the people made some kind of deal with a homeowner and the other made a deal with various businesses and just moves the bus around every few days.",
            "score": 2,
            "author": "Axelzero1"
        },
        {
            "level": 0,
            "comment": "My friend lives in a van and he just bought a parking pass and parks in the lots. Not sure if that’s allowed cause he has a Ford transit with is the same vans that the maintenance crew at mines uses",
            "score": 2,
            "author": "Helpme-jkimdumb"
        },
        {
            "level": 0,
            "comment": "You could work in the safeway and pay for a room.",
            "score": -2,
            "author": "c-blocking"
        }
    ]
}