{
    "id": "o5azb9",
    "score": 23,
    "title": "First time living in the US - tips for housing",
    "author": "[deleted]",
    "date": 1624325409.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/o5azb9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys!!!\nI will be working as a postdoc at Mines from November onwards. I am coming from Spain so I'm actually super lost about housing (especially since I'm not used to being car dependent all the time and looking for apartments based on that). \nI would like not to be super far from the university, 20-30 min by car work for me. Also, I am 26 and would like to make friends, so I don't want to be super isolated, I would like to be relatively close to an area where I can have fun, grab a beer and socialize too. \nBasically I am looking for recommendations for affordable areas to live where I can get both those things. Would anybody recommend living in Golden? Is there anything to do over there? Or would it be better to move to Lakewood or Denver and commute? \nThank you for your help, it's hard to move from Europe and know nothing about the city/country 😂",
    "comments": [
        {
            "level": 0,
            "comment": "Staying on the west side of Denver is the bare minimum. For some of the best housing options go to Mines List on Facebook. That is the main way housing in the golden area is  up for rent. \n\nListed prices for a 1 or 2 bedroom is around 1000-2000 USD/mouth but again look at mines list for better deals. \n\nRock Rest Lodge is a bar in south Golden that is everything you would think a stereotypical US bar is like and it has great food for a decent price. \n\nThe Colorado Mills Mall is also nearby for all your shopping needs including a Target. \n\nYou can get by using public transportation but a car is a major step up. \n\nHope this helps a bit 👍",
            "score": 12,
            "author": "LordEndride",
            "replies": [
                {
                    "level": 1,
                    "comment": "It really helps!! thanks about the info on the FB group, I had searched for something similar and had not found it! \n\nI don't mind driving but I just wanted to know if it is common for students to stay in Golden or if they usually go somewhere else and commute. Even though I will arrive a couple of weeks earlier to check the area, it's better to hear the opinion from locals",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Being close to Golden, will be expensive but you won't need a car, and plenty of places to grab a beer.",
            "score": 6,
            "author": "tpm319"
        },
        {
            "level": 0,
            "comment": "&gt; Would anybody recommend living in Golden? Is there anything to do over there?\n\nGreat hiking in the hills and a good number of bars and restaurants downtown.  Golden is very much a beer town.  Plus it's very walkable and you can catch a bus to Denver (it's about an hour from downtown Golden to downtown Denver by bus).  Living in Golden is more expensive, but you don't strictly need a car.",
            "score": 3,
            "author": "djp_hydro"
        },
        {
            "level": 0,
            "comment": "Living in Golden will be kind of expensive and everyone who lives here laments that everything closes at 9pm (i.e. no nightlife). As other people have said, look to live somewhere west of Denver if not in Golden. Lots of people live in Lakewood (including me) and I have about a 12 minute commute.\n\nGenerally there are more outdoor activity opportunities the further west you go and more indoor activities the closer you get to Denver. Lots of stuff to do, just gotta find out what you like. Good luck!",
            "score": 3,
            "author": "ABillionStinkyButts"
        },
        {
            "level": 0,
            "comment": "If you find yourself in Golden, you'll enjoy yourself.  If you want to get into the Mine's culture it become easy and campus amenities are at your fingertips tips (your paying for it).  You're close to everything, I walk to campus only a few miles,  biking is also a great option.  Golden is a person sized town, and just hilly enough to be fun.  There's 2 major grocery stores a health food store in town, so what ever side of town getting stuff is a mile or 2 away. Cars are a pain, and are a huge cost, and for the most part a luxury.  You'll make friends easy and getting rides won't be hard if you need to got anywhere a bus can't take you.  Our bus system is decent to get all over Golden and Denver.  Golden has fun bars and a fun feel at night.  You might have to find a roommate, but there's plenty and it keeps costs down and helps to have people in the trenches with you.  Also there is something breathtaking about living in such a beautiful town.\n\nLakewood and the surrounding area can be nice, and you still wouldn't need a car, but would be recommended.  Did I mention cars are expensive used car prices are at an all time high,  save money on your car and live close to campus.",
            "score": 2,
            "author": "ElkWarmer"
        }
    ]
}