{
    "id": "ojp8cv",
    "score": 14,
    "title": "College Schedule Question",
    "author": "The_Construction_Guy",
    "date": 1626211084.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/ojp8cv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all, I'm gonna be attending in the fall and I was wondering how college schedules differ from highschool schedules. How long are classes, what time do they usually start, how many do you have a day? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "The two most common class durations are ~50 minutes for classes held three times a week (say, Monday, Wednesday, and Friday), and ~1.25 hours for those held twice a week (e.g Tuesday and Thursday).\n\nMost courses will have options that meet 3x a week and 2x a week, so you can choose whichever you prefer. Some courses are only available in 2x/week sessions; notably, most courses in the design sequence.\n\nThe number of classes per day depends on your course load and preference. I reeeeeaaaally prefer 3x/week classes, so usually Mondays, Wednesdays, and Fridays I'll have 3-4 classes. Then on Tuesdays and Thursdays, I'll only have 1 class (again, usually from the design sequence). Some people like to spread them out more evenly; just preference.\n\nMost courses have options available throughout the day, so if you're an early-riser you can enroll in like 7:00am classes, or you can enroll in later classes if you want (which end at 8:00pm I believe, but don't quote me on that). \n\nWhen it comes time to schedule, I recommend you hit up ratemyprofessor to read reviews of the different profs for your class. Pick allllll the best ones you can.\n\nEdit: 2x/week classes are usually 1 hour and 15 minutes",
            "score": 15,
            "author": "MDFornia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aren't twice a week classes usually 1 hr 15 min",
                    "score": 6,
                    "author": "TwentySevenSeconds",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah you're right, now that I think about it. Just feels suuuuuper long to me 😬",
                            "score": 2,
                            "author": "MDFornia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "just pray you dont have any 8 am classes",
            "score": 6,
            "author": "LCD202021",
            "replies": [
                {
                    "level": 1,
                    "comment": "8 ams are the best. Smaller sizes, more time in the afternoon to get work done",
                    "score": 12,
                    "author": "on_a_dime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "had 8 am labs\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nsleep walked through the whole thing",
                            "score": 5,
                            "author": "LCD202021"
                        },
                        {
                            "level": 2,
                            "comment": "I find it harder to focus in the morning, especially in one of those classes where they don't teach and just give you an in class assignment",
                            "score": 1,
                            "author": "TwentySevenSeconds"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had two 7pm class in one semester, that was even worse.",
                    "score": 2,
                    "author": "TryingHappy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a 15 credit semester (pretty standard), you will have 4-6 classes. Labs are often 1 credit, most classes are 3, but some classes are 4+. MWF classes are 50 minutes, while TR classes are 75 minutes. Labs that occur once a week are usually 3-4 hours long. I had about 3 classes max a day. One in the morning, one right after or an hour later, and then a class in the early afternoon after lunch. There is much flexibility in making schedules in college, but I suggest you consider your preferences. I liked having some classes back to back and then going home, as I could just do all the hw then. I also liked having a gap for lunch and going to the gym before a class.",
            "score": 5,
            "author": "vickyswaggo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info! I was really wanting a gym schedule like that so I'll make sure my class times are set right for that.",
                    "score": 3,
                    "author": "The_Construction_Guy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aside from the typical scheduling that's already been covered (3x 50 min, 2x 1h15), I'll just add that some classes (especially labs) can get up to 3 hours long.\n\nA typical courseload is around 15-19 credits, or about 5-6 classes, so you'd average around 3-4 classes/day if they're mostly MWF.",
            "score": 3,
            "author": "djp_hydro"
        }
    ]
}