{
    "id": "onlowj",
    "score": 34,
    "title": "Anecdotal fatality rate?",
    "author": "vickyswaggo",
    "date": 1626724123.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/onlowj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just graduated, but with the recent email from Dean Morgan, I'm a bit curious as to approximately what the death/suicide rate at Mines is. I know I've received a \"loss to the community\" email basically every semester and peers from other unis (Boulder, Anschutz, CSU, DU) jest about the high fatality of Mines. I would definitely see Mines having a higher rate than elsewhere, but is it actually \\*that\\* high?",
    "comments": [
        {
            "level": 0,
            "comment": "The recent loss email was regarding a student with a preexisting condition who unfortunately passed.  I don’t think anyone but the school really knows that number….",
            "score": 34,
            "author": "Pommau",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah.  This one rattled me a bit.  And it’s sad that the email has the connotation amongst our community.  \n\nIn another note, maybe this is the wrong forum for this, but Sam was a blessing to the Mines community. She had the pre existing stuff, but she didn’t let that stop her from the college experience. She brought joy to the people around her.  She was bright and inquisitive.  She knew how to tease you and make you feel right at home.  I’m definitely going to cherish the memories I had with her, and it was a reminder to me how fragile life is, even at college age.  Tell people you love them and care about them.  You never know who you’re going to impact.",
                    "score": 34,
                    "author": "KolaFreak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it's part bad past (like having to hire a PR firm) and bad reputation/myth because of how depressing the culture and atmosphere is. I can assure you the school have the numbers but they don't release them.",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Some quick Wikipedia and googling: with ~1100 successful suicides among college students nationwide a year, and ~20000000 total students. That goes to about a third of a person per year at mine's enrollment of 6600. \n\nAntecdotally it seems as though while I've been here it has probably been closer to one-ish suicide a year, which, 3x is a pretty decent amount higher than expected, but probably not quite as much as it seems is sometimes joked about",
            "score": 8,
            "author": "scarrytornato",
            "replies": [
                {
                    "level": 1,
                    "comment": "At least one suicide (I think one semester I was there peaked at like 3 depending on how you would count the ones that happen during the summer) and every once in a while a natural death. I have a buddy who worked in housing and he said that it has gotten so bad that they stopped reporting some of the off campus stuff and the deaths that are happening all the time in Mines Park (non-student related).",
                    "score": 3,
                    "author": "FNNStudios",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What has happened in Mines Park?",
                            "score": 1,
                            "author": "sunshinedayhere"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mines is a culture of suffering.",
            "score": 3,
            "author": "Bad_Ju_Jew"
        },
        {
            "level": 0,
            "comment": "The worst semester was something like 6(?) in 2015? Due to HIPPA, some of them aren't announced because CSM needs the family's permission. It is high, and the school understandably doesn't want to make that info public on their website. \n\nI will also say that there are several new initiatives started by the school in 2019. They are still gaining momentum and the university is really bad at sharing what's happening around campus in my opinion. \n\nShameless plug, but if you'd like to see all the school resources in one document (or as many as I could find) check out my book pinned at the top of the subreddit.  \n\n&amp;#x200B;\n\nHere's an archived post on the subject. \n\nhttps://www.reddit.com/r/ColoradoSchoolOfMines/comments/9qxkc8/suicide\\_at\\_mines/.",
            "score": 2,
            "author": "atempel2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's HIPAA!",
                    "score": 3,
                    "author": "HIPPAbot"
                }
            ]
        }
    ]
}