{
    "id": "p3fgyf",
    "score": 0,
    "title": "Application Help",
    "author": "daddydav69",
    "date": 1628825530.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/p3fgyf",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello prospective student here. i’m kinda stuck on my personal essay about why i would be a good fit at mines. any buzzwords that would help me out?",
    "comments": [
        {
            "level": 0,
            "comment": "Since it's August, I assume you are working on the Golden application? I know a ton of people that just straight up didn't do the essay and got in. I don't remember what I wrote for mine but I do know it wasn't that great. If you get the Golden application, Mines already had you essentially on priority. If your gpa and test scores are decently good and you show you want to do engineering, it's pretty likely for you to get in.\n\nThat being said, I think that a good thing to say would be something along the lines of: your personal experiences give you a unique perspective and a unique way of approaching problems",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i think i did get a golden app but i have no idea, i received an email saying i was part of a select group of students but i figured it was just one of those “inviting u to apply” things because there was no links or codes or anything. but otherwise thanks for help!",
                    "score": 2,
                    "author": "daddydav69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "alright thanks man best of luck to u",
                    "score": 3,
                    "author": "daddydav69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[get all of your books from here](https://z-lib.org/)\n\nThey push ethics pretty hard here, so talk about that.",
            "score": 1,
            "author": "Bad_Ju_Jew"
        }
    ]
}