{
    "id": "r7qeh7",
    "score": 9,
    "title": "Mechanical Engineering class load",
    "author": "Maleficent-Ad-7095",
    "date": 1638505677.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/r7qeh7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello guys. \nI am making a plan on which classes I should take but I don't want to take the most difficult classes in the same semester. I think that it would be helpful if some of you guys can describe how difficult the schedule is and let me know of possible alternatives. By difficult I mean: how much time I have to put? Is the class difficult or is it somewhat easy but time consuming? \n\nThe schedule:\n\nEENG 281 (Circuits)\nMTGN 202 (Engineered materials)\nMEGN 300 (Instrumentation and automation)\nMATH 307 (Intro to scientific computing)\nMEGN 315 (Dynamics)\n\n\nAny input is greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "MATH307 is easy and not much work, MTGN202 isn't that bad, MEGN300 sucks because the professor is horrible, circuits also sucks because its hard, dynamics sucks for that reason too. Its doable though, I did that schedule pretty much. Also if you want to graduate in 4 years you basically have to take at least 5 classes",
            "score": 5,
            "author": "charlieseeese",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotta dispute that MEGN 300 claim. It totally depends on prof. Nilsson sucks but wheeler makes it a walk in the park",
                    "score": 6,
                    "author": "Zero_Vi_Britania",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had Nilsen so",
                            "score": 3,
                            "author": "charlieseeese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would be the problem. I was asking some upper classmen friends and they labeled Nilsen as one of the worst profs at mines and a “avoid at all costs even if it means pushing it back a semester”",
                                    "score": 3,
                                    "author": "Zero_Vi_Britania"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would second all of this. Be careful of Dynamics…that class was the worst in all of Mines, in my opinion. Besides Chem 1 of course",
                    "score": 3,
                    "author": "TylerC52",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As long as you get csvina dynamics can be a pretty good time.",
                            "score": 1,
                            "author": "hattori_54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I took it one of the semesters she wasn’t teaching it :/",
                                    "score": 1,
                                    "author": "TylerC52"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "in my personal experience this semester dynamics was no where near as bad as i had heard, but after the first quiz our entire grading structure got changed to solely be about quizes and exams which made it pretty easy to get a good grade",
                            "score": 1,
                            "author": "Jtmkungfu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Understood. Thanks for your input.",
                    "score": 0,
                    "author": "Maleficent-Ad-7095"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I second what other's have said about Nilsen....he's the worst instructor I've ever had at any school. I honestly don't know how he's even still employed at Mines. I had Ciobanu for Dynamics and he was absolutely awesome....he teaches it a little differently than some of the other instructors but he boils it down to what you actually need to know to solve the problems and the methods he teaches ALWAYS work. I had Hadi for Circuits and it was rough. He's a knowledgeable and thorough instructor, but the subject matter just isn't my cup of tea. That class convinced me that I should never try to go EE. Math 307 wasn't too bad...make sure you take advantage of working with your group and stay on top of assignments, though.\n\n&amp;#x200B;\n\n Looking back, if I had to rank these classes by the difficulty I encountered when I took them it would go (in order of descending difficulty): Circuits &gt; Dynamics &gt; Instrumentation &amp; Automation &gt; Sci Comp &gt; Engineered Materials \n\n&amp;#x200B;\n\nHope this helps!",
            "score": 2,
            "author": "EvanescentPoster"
        },
        {
            "level": 0,
            "comment": "Circuits is ridiculously hard, especially the labs. I’m barely passing 282, my roommate last year took 281 and also said it was really complicated. If the mechE labs are anything like the EE labs, you will be spending the full 3 hours and longer for every lab and asking TAs constantly for help. And if you don’t know complex numbers, the second half of the semester is absolutely brutal.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "EE circuits and ME circuits are different classes. 281 for Meche doesn’t even have lab.",
                    "score": 4,
                    "author": "Helpme-jkimdumb"
                }
            ]
        }
    ]
}