{
    "id": "rn06bw",
    "score": 14,
    "title": "Mines ice hockey",
    "author": "chimpguyman",
    "date": 1640279233.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/rn06bw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was accepted to Mines, and I’m wondering if there is an ice hockey team. If so, how competitive is it? I have been playing for 7 years, but only club and JV, so I’m not the best. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t personally play on the team but I know a bunch of people who do. The team isn’t super\nCompetitive I know they have tryouts and there is always a few who don’t make the team. The games  are a ton of fun and recently the school has been showing up to support.",
            "score": 12,
            "author": "probablylost-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately some dickheads caused students to be banned from the arena this year. Hopefully that changes they were a good time.",
                    "score": 8,
                    "author": "PapaPast"
                },
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "chimpguyman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Former Mines Hockey Team player and Treasurer here! \n\nTeam is part of ACHA DIII which is better than high school hockey but not by much. The team trys to qualify for regionals and nationals every year, but know that academics come first. \n\nMy recommendation would be to go to tryouts to see if the vibe is for you. At least while I was there, and the guys who coached the team the last couple years were those I played with, the expectation was to show up to practice and try to win as many games as possible. However, every player knew they weren't NHL bound so we just tried to have as much fun as possible. I still talk to most of the guys I played with on a weekly basis. If you love hockey and want to use it as a break from the academic challenges at Mines, then this is the team for you!",
            "score": 5,
            "author": "kiss53",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!!",
                    "score": 1,
                    "author": "chimpguyman"
                }
            ]
        }
    ]
}