{
    "id": "t3wgn8",
    "score": 56,
    "title": "Fuck Russia, Fuck Putin, Free Ukraine",
    "author": "Crashbrennan",
    "date": 1646100460.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/t3wgn8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recognize that this subreddit has a no-politics rule.  To my eye, a madman threatening nuclear war while invading other nations for his own ego, goes beyond politics. It transcended politics when it became an active threat to the survival of the human race.\n\nI do not represent the school's opinion, etc.",
    "comments": [
        {
            "level": 0,
            "comment": "Puck Footin. Slava Ukrani!",
            "score": 13,
            "author": "Zero_Vi_Britania"
        },
        {
            "level": 0,
            "comment": "NHV explicitly taught us not to be nazis and to not repeat mistakes of the past. You're right, it's not about politics, but about ethics.",
            "score": 28,
            "author": "fireflynightlight"
        },
        {
            "level": 0,
            "comment": "Zelensky is my new favorite main character for life",
            "score": 13,
            "author": "Skulldr3n"
        },
        {
            "level": 0,
            "comment": "No chance for Russia with Zelenskyy out there battling it up. Shits about to get real",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow, so brave",
            "score": -10,
            "author": "kendyllspelledwithay",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I was brave I'd be on a flight to Ukraine right now, they're taking volunteers.",
                    "score": 4,
                    "author": "Crashbrennan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Foreign wars are politics, yes. A madman threatening to end the human race goes past politics.\n\nThis falls into the same category as talking about solutions to climate change.",
                    "score": 0,
                    "author": "Crashbrennan"
                },
                {
                    "level": 1,
                    "comment": "Oh fun, you can still edit your comment even though you were banned for trying to force us to dox ourselves. I was going to leave it for the sake of transparency, but now it has to go.",
                    "score": 1,
                    "author": "Crashbrennan"
                }
            ]
        }
    ]
}