{
    "id": "tbx6sn",
    "score": 7,
    "title": "Mines Park to campus carpooling",
    "author": "[deleted]",
    "date": 1647024566.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/tbx6sn",
    "media_urls": [],
    "other_urls": [],
    "postText": "With freezing temps and slick ice everywhere, most mornings I’ve decided to just take the L and drive to campus for my 8ams. With some strategy and speculation I can usually avoid a ticket 3/5 days per week, but occasionally costs will get high if parking is on their A game. \n\nBut I was thinking what if we can get a carpool of 4-8 people every morning from digger/infinity to ford or ctlm. Tickets are never more than $30 so absolute worse case would be ~$20 per person per week. And we could switch it up- different vehicles, different lots, different spots. By avoiding 1/3 of the tickets, it could get down to $5/person/week. Plus the drive back up would be kinda nice if its dark and snowing\n\nObviously timing might be an issue, but on MWF I have to leave by 7:30 and T/Th by 10:40 so maybe this works for a few others? I’m driving most days anyways so I could take a few people to start and we could go from there?...",
    "comments": [
        {
            "level": 0,
            "comment": "or... mines stops fucking around with toy cars and gets us a well justified bus that drives in a circle every 20 minutes. Even a half sized one would be better than the rovers.",
            "score": 8,
            "author": "atempel2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Significantly better, because it would move faster than ~10 mph and not cause traffic jams.",
                    "score": 1,
                    "author": "djp_hydro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol y'all have fun burning your money on unnecessary parking tickets in order to avoid a walk that's less than a mile",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If it’s really that hard to walk from mines park is it not just worth it to get a parking pass? You are paying 60 dollars a week, and the pass is only like 3x that. Am I missing something?",
            "score": 8,
            "author": "john-el-gato",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mines Park residents are not allowed to purchase a campus parking pass.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn’t know that, just invest in a balaclava and some boots",
                            "score": 4,
                            "author": "john-el-gato"
                        },
                        {
                            "level": 2,
                            "comment": "Really??",
                            "score": 3,
                            "author": "LokalPineapple",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I asked and they said no",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That makes no sense",
                                            "score": 3,
                                            "author": "LokalPineapple",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's because we live a 15 minute walk away.  Doesn't make sense for us to use scarce parking when it's totally unnecessary.",
                                                    "score": 5,
                                                    "author": "djp_hydro"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's like 5 dollars to pay for the day to park in the commuter lots. Probably cheaper than the parking tickets. 8 bucks for the general lots.",
            "score": 2,
            "author": "Ok-Lawyer9218",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plus you get to park in the good guest only spots",
                    "score": 1,
                    "author": "Ok-Lawyer9218"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Park in the 2hr parking if u need too along Washington.",
            "score": 2,
            "author": "Helpme-jkimdumb"
        }
    ]
}