{
    "id": "uedpm4",
    "score": 8,
    "title": "Help please I’m begging",
    "author": "Amazing-Orange-9703",
    "date": 1651205908.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/uedpm4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Please anybody help. My idle is not responding and I have written over 253 lines of code for my final project. How would you get idle to respond without having to force quit the application? Or even how could I do an emergency save in a Mac? \nPlease help",
    "comments": [
        {
            "level": 0,
            "comment": "Enable auto save for next time is honestly the only bit of advice I can give you. Look up potential recovery options that ur IDE has as well. Also ur IDE might already have an autosave feature.",
            "score": 17,
            "author": "Tunafiesh"
        },
        {
            "level": 0,
            "comment": "Screenshot if you can  for proof!?   also might be able to OCR part of the image to save re-entry time?   \n\nSo 😔 sorry",
            "score": 8,
            "author": "honemastert"
        },
        {
            "level": 0,
            "comment": "I'm honestly impressed you've tolerated IDLE this long without switching to something less awful.",
            "score": 7,
            "author": "Pengualope",
            "replies": [
                {
                    "level": 1,
                    "comment": "To my knowledge they either require it in CS 101 or don't actually mention any better editors. A shame because IDLE first convinced me python was a horrible experience for about 6 months back in my freshman year. (Had never used Python before)",
                    "score": 2,
                    "author": "PearUhDox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can use vscode, much better. They have you use IDLE as the default as it installs with python but they don't care.",
                            "score": 2,
                            "author": "Pengualope"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ctrl+C?",
            "score": 5,
            "author": "Kyle_Butler_135"
        },
        {
            "level": 0,
            "comment": "My guy if you’re turning in your CS project. Just take that L. Should’ve started sooner",
            "score": 7,
            "author": "Ok-Abbreviations-917",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did I literally ran it once more through before submitting and this is what currently is happening",
                    "score": 13,
                    "author": "Amazing-Orange-9703",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh if you ran it once before then Everything should be saved. Check you have the file wherever you stored idle. Just exit out and go back in?",
                            "score": 12,
                            "author": "Ok-Abbreviations-917"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sure your resolved this, but next time something like this happens make sure you shamelessly reach out to the prof to ask for more time. They've always been helpful when I've asked.",
            "score": 5,
            "author": "MDFornia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Didn't work for me lol",
                    "score": 3,
                    "author": "Haopojai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oof, rip 🙏",
                            "score": 2,
                            "author": "MDFornia"
                        }
                    ]
                }
            ]
        }
    ]
}