{
    "id": "ulxjv9",
    "score": 47,
    "title": "Mines Park renovation has been postponed.",
    "author": "Pommau",
    "date": 1652120247.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/ulxjv9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I gotta say, I do wonder often how Mines manages our money.  F in the chat to all of y’all who got kicked out to see this development, y’all deserve better.",
    "comments": [
        {
            "level": 0,
            "comment": "And all of the first years who had to scramble to find other housing.",
            "score": 25,
            "author": "MrTryhardington"
        },
        {
            "level": 0,
            "comment": "Yup seems about right for the mines admin",
            "score": 14,
            "author": "Smitty5825"
        },
        {
            "level": 0,
            "comment": "I mean at least they are saying it's stopped because it wouldn't make it affordable for students. I of course don't understand how dorms are considered affordable but I guess.",
            "score": 12,
            "author": "wonderhams",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is definitely a good take, but I think a lot of students main concern is the general lack of housing in and around Golden.  Some people need that walking distances housing or they don’t want to live 4+ to a house.  Hopefully this delay wont be for many, many years cause things are definitely feeling more and more claustrophobic for students.",
                    "score": 12,
                    "author": "Pommau"
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP to everyone who scrambled to find a lease just because of Mines Park, only to now be locked into a lease you didn't need because the Mines Admin give 0 Fucks about the students",
            "score": 20,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Blame the insane building costs right now rather than the admin, still unfortunate though",
            "score": -4,
            "author": "school_night",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really don’t think this is the main reason, if it was they should’ve canceled the project sooner and not made it a mess for the students living there.",
                    "score": 7,
                    "author": "Pommau"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The email suggests so unfortunately.",
                    "score": 2,
                    "author": "Pommau",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you post a copy of the email?",
                            "score": 2,
                            "author": "cjpeltz"
                        }
                    ]
                }
            ]
        }
    ]
}