{
    "id": "vbu9wj",
    "score": 6,
    "title": "Internship question for civil/environmental engineers",
    "author": "[deleted]",
    "date": 1655177902.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/vbu9wj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I recently started working at an internship for Ground Engineering consultants. Is this a good place that if stuck with will help me get a great engineering job? or should I make more money this summer. So far I feel like I am an underpaid construction worker who just copies measurements onto an iPad all day, which is a little bit of a letdown. I was making considerably more money installing solar panels and if I decided to go back to working for them I could save up a few months rent for the next semester. I'm not too sure what would benefit me more right now.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there, I know Ground and their industry and competitors very well. I started in that field, doing concrete and soil and asphalt testing. It's a dirty and hard job for sure. It is good to get that kind of experience. Nothing is worse than a young engineer who never worked a field job and doesn't know what RCP is. You learn lingo and technical terms by working on construction sites.\n\nBut yes I also felt like an underpaid construction worker, who didn't actually build things, just watched other people build things. I ended up quitting that field, to go pursue my dream in the solar power business. Ended up doing a crappy sales job for sunrun, not what I wanted. Then I went back to Mines to get a second degree in materials to work at NREL but it was going to take so much time and money to get a masters, so I said fuck it and went back to the geotech consulting world.\n\nI got promoted a few times, ended up working as an actual engineer in the office for a couple years. That was very interesting work, but still underpaid. Geotech consulting gets weirdly low profits, because the builders and contractors get better money. The \"testers\" are just a weird middle man. Only the bosses made good money.\n\nBut it all changed once it got my PE license about 2 years ago. Suddenly I got several job offers, all with big raises, and took one of those. I still sometimes test concrete when my staff needs help but mostly I'm an engineer now. I work exclusively with soil/concrete/asphalt, so not exactly what I wanted to do as a geologist.\n\nSo my point is, look at the upward mobility prospects. Ground is a big company and yes they will promote you into a staff engineer role within 2 years of full time work. And doing the field work for a summer will teach you lots. But if you want to have a career in solar, that's a good place to keep working. Or if you don't know where you want a career, the solar summer gig at least pays better.",
            "score": 7,
            "author": "WastingTimesOnReddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice! I’m going to stick it out for the summer I finally got done with a pier job and they had me do some soil tests which where way more interesting. I think I will keep installing solar panels on the weekends.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good deal :D my last advice is it's an interesting and very practical industry, and the real money is made by the developers and the contractors. So the crew installing those piers definitely makes more money than your team doing the inspections and testing. Same goes for the mid-level project managers (where you could be after a couple years if you stay in that field), the contractors always make more money. Just an FYI, I think I'd go that way if I could do it all over. But this field is not for everyone, do what you're interested in and it's ok to change field or careers even a few more times since you're young and just starting out. I do hiring sometimes and it's useful to have real skills and experience on your resume, that's more important than almost anything else!",
                            "score": 1,
                            "author": "WastingTimesOnReddit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People get overly focused on “internships” IHMO. What is important is that you have experience that you can talk about to a prospective employer in a job interview. Whether you get those skills at a job that helps you pay the bills or at an internship, what is important is that you have the skills and that you can talk about them when you’re looking for a “real” job. Good luck!",
            "score": 5,
            "author": "somanyprobs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!! This really help put things in perspective.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t speak to civil/environmental engineers, however I can say at least based on what you’ve said so far that it may be worth going to the solar. While it is good to have an internship for the experience if what you will end up adding to your resumé amounts to took measurements and made copies it isn’t going to nearly be as helpful as the solar where you can talk about how you worked with a team installing solar panels.",
            "score": 3,
            "author": "Grizwald200",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it is a nice gig, I think I will still be working with solar on the weekends. solar panels are one of those jobs where you do plumbing, electrical, and mechanical, it will hopefully make for a killer resume.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Ground does all of the training and certificates for soils asphalt and concrete, I’m going to stick it out, they just started me out supervising piers.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}