{
    "id": "vyiztg",
    "score": 10,
    "title": "Feasibility/possibility of taking Mineralogy (GEOL 321) as an elective?",
    "author": "JackTheRealOne",
    "date": 1657760288.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/vyiztg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, incoming Mines freshman studying Mining Engineering. Mineralogy really interests me but is not part of the mining engineering curriculum, I wondered if it would be possible to take this as an elective down the road or not because of the pre-requisites needed? Any info appreciated. If you have taken the class, any info about the class itself is welcome too!",
    "comments": [
        {
            "level": 0,
            "comment": "You can take any class you want so long as you meet the prerequisites. So while you can't take it your first semester, you certainly can later on. I'm sure your degree has some elective requirements so you could potentially use it to fulfill those.",
            "score": 3,
            "author": "Crusher_of_Doom"
        },
        {
            "level": 0,
            "comment": "From the catalog, it looks like you'd need GEGN212 and GEGN217 (petrology and geologic field methods) as prerequisites aside from the core. You get three free electives, so it's just about exactly doable as long as it doesn't screw up your schedule.",
            "score": 1,
            "author": "djp_hydro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I graduated in Geological Engineering where GEGN212 and GEGN217 were required for my curriculum - I will say that (1) field methods was pretty demanding course physically (lots of hiking) as well as academically (poured hours of work into my beautiful maps) and (2) both 212 and 217 have their own prereqs. However, I didn't end up taking mineralogy.\n\nLike these other users recommended, just make sure you know the prereqs for mineralogy and its prereqs, and it's up to you if you think that you can handle that in your semester courseload and if it fits in to your degree plan. If you haven't yet checked out the class in the course catalog, it was a godsend for me as I navigated course registration in my time at mines!",
                    "score": 1,
                    "author": "Artistic-Abrocoma120"
                }
            ]
        }
    ]
}