{
    "id": "x6s7yk",
    "score": 20,
    "title": "As a freshman, what should my goals be for the upcoming career fair?",
    "author": "JackTheRealOne",
    "date": 1662414177.0,
    "url": "https://www.reddit.com/r/ColoradoSchoolOfMines/comments/x6s7yk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Should I just get comfortable talking to employers, mostly focus on resume feedback, etc? What is most important for freshmen who go to the career fair?\n\nMajor is mining engineering if that changes anything",
    "comments": [
        {
            "level": 0,
            "comment": "There will be a few opportunities to get resume feedback over the next week, so I'd take advantage of those before the career fair. Also, you're right that your first goal as a freshman should be getting comfortable talking to employers. It's pretty unusual for freshmen to get an internship, but mining engineering students have a better chance than any other major.",
            "score": 19,
            "author": "Snookers114"
        },
        {
            "level": 0,
            "comment": "6 figure salary or you've failed as a freshmen",
            "score": 56,
            "author": "Ore-igger"
        },
        {
            "level": 0,
            "comment": "Just focus on networking, getting an internship, etc. I’m in grad school in a somewhat similar field. There’s a few informal mining business/engineering groups that meet, if you’d like to be connected.",
            "score": 5,
            "author": "avmaco"
        },
        {
            "level": 0,
            "comment": "Get familiar with the process and environment more than anything. It's practice for the upcoming years.",
            "score": 3,
            "author": "TryingHappy"
        },
        {
            "level": 0,
            "comment": "Get an internship for next summer if possible. Easier to do that in the spring but still you should ask. The #1 most helpful thing to getting a good job when I graduated, were the internships I had each summer. \n\nSo for now it's ok to just dress up and walk around and talk to recruiters and ask about summer internships. If they don't have any yet (too early for summer), it's just good practice. Then at the spring career fair you'll be ready to actually interview and all that.",
            "score": 2,
            "author": "WastingTimesOnReddit"
        },
        {
            "level": 0,
            "comment": "as a freshman, just collect business cards of hiring reps for those companies. start developing some relationships.",
            "score": 2,
            "author": "arcticblizzardchill"
        },
        {
            "level": 0,
            "comment": "Don’t listen to anyone who says freshman internships are hard to come by or the fall is a bad time to get an internship. Not everyone gets one, but it’s not an impossible feat. Find something in mining that will set you apart- your personal connection to mining, a mine you’re interested in, or a problem in mining you want to learn more about. Find a way to show recruiters your ambitious, motivated, and passionate. Internships are a way for companies to cultivate talent. They, in no way, expect you to know the answers. But they’re looking for someone who they can easily mold into a good employee when the time comes. \n\nThere’s definitely going to be a learning curve when it comes to talking to recruiters. I would suggest not going to your first choice, or even a mining company, to get your legs under you and understand how the conversations go.",
            "score": 1,
            "author": "on_a_dime",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's the point of talking to recruiters if they're just going to tell you to apply online?",
                    "score": 2,
                    "author": "EducatedEarth43",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not always the case, but applying online is a formality dictated by HR. I’ve gotten invites to dinners while at the booth, got to establish a connection with the recruiter that went on to interview me, and just generally show my personality. Face time makes a difference. \n\nDon’t be discouraged though!",
                            "score": 2,
                            "author": "on_a_dime"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d at least try to look for an internship you could do over summer. I really regret not doing this, a lot of the inters I was with last summer were able to find one and it’s really helpful if you’re unsure of what you really want to do. Plus some companies offer scholarships that you wouldn’t know about if you haven’t worked for them",
            "score": 1,
            "author": "GELND"
        }
    ]
}