{
    "id": "10j0gdp",
    "score": 0,
    "title": "What to do if you don’t join a fraternity?",
    "author": "EATINGCOBRA1414",
    "date": 1674437960.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/10j0gdp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Be normal, ig? There's tons of stuff to do all over, it all depends what you're into",
            "score": 68,
            "author": "Alpha150"
        },
        {
            "level": 0,
            "comment": "Pretty much anything. There’s academic clubs and organizations as well as club and intramural sports. There’s also normal interest based clubs (for example I think I heard about a bee keeping club a while back). You can probably find a group on campus that fits your interests",
            "score": 21,
            "author": "EntertainmentKey4830"
        },
        {
            "level": 0,
            "comment": "You will be just fine. I felt this way my freshman year. Thought I was weird or something but I’m just as good as they are. Realized it was the biggest blessing in disguise not being apart of Greek life. There are so many people you will meet in classes, through your hobbies, and other events in Bloomington. Keep your head up and work on some social skills. You’ll find your true friends quick sorry you’re going through this",
            "score": 37,
            "author": "Old_Dragonfruit_3221",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the only good answer to this post. A lot of people are being rude here.",
                    "score": 6,
                    "author": "Sourmilkgum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re getting some sarcastic replies here (all of which are based in truth imo) but I’ll try to give you a serious answer. If your goal is to go to multiple parties every week and get wasted, there’s no more convenient path than joining a frat. As far as what to do if you don’t join a frat — literally anything else. Don’t pigeon-hole yourself into adopting other people’s interests to fit in — find people who are interested in some of the same things as you and talk to them. \n\nI’m an older graduate student, but I certainly remember feeling lonely as a freshman at a big school, and how difficult it seemed (at times) to meet people and make friends. As you get older, you start to realize that as intimidating as it can be, everyone wants to make friends and connect with other people, but not everyone is brave enough to put themselves out there. My advice is to be brave and try to talk to as many people as you can — in your classes, in your dorm, waiting for the bus, whatever. Some people won’t want to open up, but you’d be surprised how many friends you make just by being friendly.",
            "score": 7,
            "author": "Hill_People"
        },
        {
            "level": 0,
            "comment": "literally anything else",
            "score": 13,
            "author": "mayolizard"
        },
        {
            "level": 0,
            "comment": "the music scene",
            "score": 6,
            "author": "CombinationGlad2628"
        },
        {
            "level": 0,
            "comment": "Do what interests you and not what a dozen other dumbasses hype each other up into pretending to enjoy",
            "score": 8,
            "author": "Softpretzelsandrose"
        },
        {
            "level": 0,
            "comment": "Maybe make friends the normal way? Throw house parties? Not get hazed?",
            "score": 17,
            "author": "Easymmk"
        },
        {
            "level": 0,
            "comment": "Join a club or club sport. Some of them make you feel like you don't need a frat",
            "score": 5,
            "author": "WillingList0"
        },
        {
            "level": 0,
            "comment": "Get involved in some shit that you really like and you’ll end up making friends. Find shit to do around bloomington. There are hella quarries you can go to which are fun in warm weather. Literally anything tho bro. Frats are bogus anyway so props to you for going to normal route",
            "score": 2,
            "author": "BigSips4"
        },
        {
            "level": 0,
            "comment": "Do you ski and/or snowboard and/or like to tailgate and/or want friends who do those things? Join ski club!",
            "score": 2,
            "author": "TheNuclearNewt"
        },
        {
            "level": 0,
            "comment": "What do you like to do? If you want to compete in the Little 500, there are independent teams. Join clubs. Meet people, there's lots to do.",
            "score": 2,
            "author": "PROfessorShred"
        },
        {
            "level": 0,
            "comment": "Enjoy saving money to hang out with people in your major who actually want to hang out with you because of who you are rather than what house you pledge at.",
            "score": 5,
            "author": "fliccolo"
        },
        {
            "level": 0,
            "comment": "Not be classified as a racist/sexist/rapist 🤷‍♂️",
            "score": 5,
            "author": "btown4389"
        },
        {
            "level": 0,
            "comment": "You’re fucked",
            "score": -1,
            "author": "lilpumps_cousin"
        }
    ]
}