{
    "id": "10lfswq",
    "score": 3,
    "title": "Help with my MSW Writing Sample and Statement?",
    "author": "audriannadew",
    "date": 1674696464.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/10lfswq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am applying to the MSW Program at Indiana University's School of Social Work, and am writing my \"Writing Sample and Statement.\" I want to make sure I am doing it correctly. This is all the application instructions state:\n\n\"Your writing sample and statement should be one double-spaced, five-page (maximum) document that is in 12-point font. In-text citations, a title page, and a reference page are required, and they do not count towards the five-page maximum. A citation style is required; American Psychological Association (APA) is preferred. Your writing sample and statement must address ALL of the following topics:\n\nDescribe a social problem. Assuming you have the power and resources at your disposal, what would you recommend for intervention and/or social change to address this social problem?\n\nDescribe how your personal and intellectual qualifications, past human service experience, and/or future goals are relevant to assisting the most economically and socially disadvantaged groups in our society. Please provide specific examples.\n\nRecount an ethical dilemma you have had in your personal, professional, or volunteer experience. Discuss your decision-making process and the factors that contributed to the ultimate outcome. Please protect confidentiality and do NOT reveal the names of people or organizations.\n\nHow will your decision to pursue an MSW help you reach your personal and professional goals?\n\nNote: Please use headings or numbers to separate each response in your statement.\"\n\nAm I to ONLY address the four points with headings above each, or do I include an introduction or a personal statement? Additionally, the instructions state that a citation style is required, and that APA is preferred. Does this mean that, if my citations are in QPQ, that my paper must also be? Or do they want the essay to not be in any specific style, but just the citations to be? Any experiences or examples others have had would be great. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Current MSW student here. Literally answer the questions and use the prompt as your section heading. Don’t think too much into it. Be sure to be concise and answer the questions. You can incorporate what you would like to say for a personal statement in the section about your personal and professional goals. Write the whole thing in APA, if you have a BSW you should be familiar in that. Pm me and I can share mine with you if you’d like.",
            "score": 3,
            "author": "bepp98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I am just wondering if I should include an introduction to briefly discuss the cohesive message that each of my answers will touch on parts of. I'll PM you!",
                    "score": 1,
                    "author": "audriannadew"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’m applying for the same program! did you submit?? i have questions",
            "score": 1,
            "author": "throwawayrandoms7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! So sorry, I just saw this! Yes, I submitted and was accepted. I think the deadline has passed, but I'm happy to answer your questions!",
                    "score": 1,
                    "author": "audriannadew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh no worries i applied too i was accepted as well!!!",
                            "score": 1,
                            "author": "throwawayrandoms7"
                        }
                    ]
                }
            ]
        }
    ]
}