{
    "id": "10umbwj",
    "score": 3,
    "title": "When to Apply for Freshman Housing?",
    "author": "Loud-List2960",
    "date": 1675628382.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/10umbwj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have been accepted into IU and will probably attend, but am still waiting on a few things to decide for sure. I was wondering if I could apply for housing prior to actually accepting the schools offer. I’ve seen resources implying both that you can and that you cannot. Input from anyone who knows more about this would be greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Apply now. You will have to pay the $200 housing deposit, but you don’t have to commit to IU. Doing it now will give you best chance at your desired neighborhood and room type (standard vs enhanced).",
            "score": 3,
            "author": "GTObets",
            "replies": [
                {
                    "level": 1,
                    "comment": "my fault if this is a dumb question but what does a deposit mean? Can I get my money back if i later decide i dont want to attend",
                    "score": 1,
                    "author": "Affectionate_Rub4838",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t believe so, but I am not 100% certain. Think of it like paying to process your application (and from their perspective they can’t have some % of their rooms locked up by people who ultimately don’t attend).  Although, if you do choose to attend, that $200 goes to your room/board bill.",
                            "score": 1,
                            "author": "GTObets"
                        },
                        {
                            "level": 2,
                            "comment": "See 12 at this link (and it is an application fee and not a deposit.  So I don’t think it does get applied to your room/board bill).\n\nhttps://housing.indiana.edu/housing/contract/2023-2024ResHallFurnApartContract/index.html",
                            "score": 1,
                            "author": "GTObets"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Loud-List2960"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends on when you are legible to do so. Here is the dates listedhttps://housing.indiana.edu/housing/apply/first-time-applicants/index.html\nDo it right when you can don't wait as you will get less of a priority",
            "score": 1,
            "author": "WillingList0"
        },
        {
            "level": 0,
            "comment": "Before may1st",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If you apply now and put down a deposit, you won’t get it back, if you go elsewhere",
            "score": 1,
            "author": "lolsup1"
        }
    ]
}