{
    "id": "11d2gu0",
    "score": 7,
    "title": "Involvement (Business/ Student organizations)",
    "author": "Scared-Geologist-782",
    "date": 1677471498.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/11d2gu0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im a freshman guy right now and im not involved in anything. I am looking to be in kelley and im struggling finding organizations I could be apart of. Is there any recommendations for me? Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "To be candid, If you really wanted to join an org you would have done so at the beginning of this semester. There were many opportunities such as the Kelley fair, the IU fair, alongside Beinvolved where you could have searched up clubs that suited your interests. \n\nMost clubs apps opened in January and are closed now. \n\nHowever, if your still looking to join clubs this semester, a few finance ones I recommend are \n\n1. Financial Services Club\n2. Undergraduate Research association \n3. Sales and trading association \n4. Real Estate \n\nThese are all great intro clubs with no interviews and will expose you to finance if that’s what you want to do .\n\nIf your planning on joining some of the more competitive clubs next semester, some I suggest are \n\n1. Envision Capital Management Group\n2. Scholars of Finance \n3. Portfolio Management Club\n4. Financial Investment Review \n5. Capital markets club \n\nThese all cover different areas of finance but are extremely helpful to help connect you with upperclassmen\n\n\nOverall, good luck and don’t feel pressured to join any.",
            "score": 5,
            "author": "imdone145",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed with the above. Some other non-finance clubs I could recommend that are not selective/open are:\n\n1. Corporate Strategy Club\n2. Collegiate Entrepreneurs Organization\n3. Retail Innovation Organization\n4. 812 Consulting\n5. Student Accounting Society\n\nSome other selective clubs would be:\n1. Most of the business frats \n2. 180 Degrees Consulting\n3. Hoosier Consulting Network\n4. TAMID\n\nHope this helps",
                    "score": 2,
                    "author": "Efficient_Topic_1436"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IUDM! they have accounting and corporate relations committees and raise money for Riley Hospital for Children",
            "score": 2,
            "author": "z5142oe"
        },
        {
            "level": 0,
            "comment": "This may sound stupid, but are these organizations something you’re truly interested in? I, also being a freshman at kelley, sometimes see how many other business related organizations people are in and feel pressured to join one. However, I don’t truly think they’ll be interesting to me so I don’t.",
            "score": 2,
            "author": "Extension-Balance161"
        },
        {
            "level": 0,
            "comment": "https://cdc.indiana.edu/career-guides/business-finance-management.html",
            "score": 1,
            "author": "clinton2209"
        }
    ]
}