{
    "id": "12vamjn",
    "score": 8,
    "title": "McNutt Mold",
    "author": "Loud-List2960",
    "date": 1682179785.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/12vamjn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is mold still an issue at McNutt? I know they were supposed to have renovated, but I have heard that it is still an issue.",
    "comments": [
        {
            "level": 0,
            "comment": "No, but if you have concerns they'll come do a test in your room right away. You just gotta tell the front desk.",
            "score": 6,
            "author": "the-garnet-witch"
        },
        {
            "level": 0,
            "comment": "Ugh, as a former left Nutt resident, I’d like to know more about this!",
            "score": 5,
            "author": "sciotomile"
        },
        {
            "level": 0,
            "comment": "Be wary of any dorm quad named in the 2018 mold class action lawsuits if you have health issues that may be triggered by mold exposure. Even after they shut those buildings down for a year, mold came back in some buildings according to news outlets. Also, bathrooms were not part of the renovations in some of those mold impacted buildings. The bathrooms in McNutt look the same today as when my kid was a freshman there in 2012. I’ve seen pix of mold in buildings not involved in that 2018 crisis. I think they do what they can to address issues as they learn of them. Unlike real estate or traditional landlord rental transactions, universities are not legally obligated to reveal past or current mold/water damage in residential units. Lower level laundry rooms in dorms as shown on student social media can have maintenance issues and malfunctions. Avoiding rooms on those levels would be a wise choice. Being short staffed in maintenance and other support divisions since Covid makes it more of a challenge for some universities to stay on top of things along with budget woes.",
            "score": 2,
            "author": "Mbird324"
        },
        {
            "level": 0,
            "comment": "Not currently they fix the issue",
            "score": 1,
            "author": "Jacknghia"
        },
        {
            "level": 0,
            "comment": "My floormates did a mold test last year in their rooms and bathrooms. Came out neg",
            "score": 1,
            "author": "Flimsy_Tourist4066"
        }
    ]
}