{
    "id": "1324fvc",
    "score": 2,
    "title": "Double majoring in Finance and CS",
    "author": "jasonghor",
    "date": 1682703587.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/1324fvc",
    "media_urls": [],
    "other_urls": [],
    "postText": "My son (a high school junior) is considering a double major in Finance and CS. We visited and liked the campus. He was advised to apply to Kelley because that's the harder school to get into. With his current record, he should be admitted.\n\n&amp;#x200B;\n\nIs this combination doable in four years? How many students do this every year? Disadvantages? Any other advice?\n\n&amp;#x200B;\n\nThank you.",
    "comments": [
        {
            "level": 0,
            "comment": "This combination is definitely doable with ample planning and extra effort. Applying to Kelly first is definitely the right decision. The biggest concern about doing two majors in different schools (in this case Kelly and Luddy) is that the general education requirements don’t always carry over, and so on top of taking additional major courses your son will likely have to take additional gen Ed courses as well. This can cause any number of problems from scheduling conflicts, financial concerns, and extra time taken. \n\nYour best bet is to have your son sit down and speak with an advisor from each department about his wants, goals, etc. He might find out for any number of reasons that such a plan is not his best option, but that’s what the advisors are for. Has your son considered doing a minor in one and a major in the other? That would make things much easier. If that’s not what he wants, definitely speak to an advisor about the double major sooner rather than later and they’ll provide you with the info you need to make an informed decision.\n\nEdit:\nForgot about this at first, but the College of Arts and Sciences also has a Computer Science BA program. Normally I would advise against this, as it’s not as technically rigorous as the Luddy BS is, but it’s designed to be paired with other degrees. My knowledge of this program is extremely limited. Might be worth looking into.",
            "score": 2,
            "author": "DaRealWamos",
            "replies": [
                {
                    "level": 1,
                    "comment": "CS BA and BS makes no difference in terms of finding cs jobs. highly recommend doing CS BA and finance because it gives you comprehensive CS and other stuff",
                    "score": 2,
                    "author": "Leo-110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A Bachelor's degree in Computer Science offers excellent job prospects, so there's no need to worry about that aspect. If a company discriminates based solely on whether you have a BA or a BS, it might be a good indicator that it's not a company you would want to work for anyway. Plus, you'll develop soft skills which are important.",
                            "score": 1,
                            "author": "mOOn_b0y"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is doable but very difficult as you have two different colleges that you have to negotiate. Easier path to negotiate would be Economics/CS or Finance/Information Systems.   This would keep the majors in the same school making it easier to negotiate classes.  \n\nEven more so because, from my experience Kelley operates on a trimester system and everyone else at IU operates on a semester system.",
            "score": 2,
            "author": "Hausmannlife_Schweiz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this.  I'd say the choice depends on whether your son is more inclined toward Math (go for CS/Econ) or Business generally (including Accounting, Marketing, and Operations).  He might have an easier time finding his first job coming out of Kelley, but CS/Econ is a powerful combo.  Incidentally, I think combining CS with another area is a smart move.  I am anticipating a glut of CS workers in the coming years with the layoffs happening in tech, and the fact that CS seems to be the \"hot\" major right now.  I am having these same discussion with my son.\n\nEdit: I'd also include the fact that many technical roles are being offshored to India as a reason for a coming glut of CS workers.  Working in consulting, I have seen this at both my previous and current (Big 4) firms.",
                    "score": 1,
                    "author": "Due_Feedback_1870"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the pointers. We are going to talk to a Kelley advisor. \n\nCS is his primary interest, but he would like to study finance as well. Kelley does not offer a finance minor - hence the question.",
            "score": 1,
            "author": "jasonghor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im going to be blunt here, your minor does not matter at all to employers or grad schools and he has plenty of opportunities to learn about finance without pursuing the minor requirements.",
                    "score": 2,
                    "author": "Chihoe275",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree, focusing and honing your CS skills is more important in my opinion. Then if he’s tired of his developer role or whatever he wants to do, go get a masters in finance and become a manager or something like that lol. But do whatever, I think a double major is doable. Would be very hard and I feel like a social life would be hard doing Kelley and Luddy.",
                            "score": 1,
                            "author": "BahBahBooey1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know a couple people who pulled off the Finance &amp; CS double major, but they were nerdy geniuses and probably didn’t socialize much. If he’s super serious about going for it, I guess give it a try but if he’s not a 4.0 type it’s probably not a good idea.",
                                    "score": 1,
                                    "author": "Chihoe275"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}