{
    "id": "1363jju",
    "score": 0,
    "title": "Freshie Courses and IBW questions",
    "author": "MRKRABBYPABBY",
    "date": 1683069163.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/1363jju",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m an incoming DA to Kelley and I saw on the one.IU portal that some classes have been almost completely filled up. Am I supposed to be choosing courses now or doing it at NSO? Also, should I be taking a specific course in order to be on the radar for IBW?",
    "comments": [
        {
            "level": 0,
            "comment": "As far as I know, you can’t enroll in classes before NSO. Definitely make a class “wishlist” but be ready for that plan to change for any number of reasons",
            "score": 8,
            "author": "DaRealWamos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconding this, also your NSO date plays somewhat a role as to how many classes / class times are available",
                    "score": 3,
                    "author": "SilverSword2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No courses can help with workshops until sophomore year, everything u need to do is outside of classes",
            "score": 3,
            "author": "lilpumps_cousin"
        },
        {
            "level": 0,
            "comment": "You’ll choose your classes at NSO.",
            "score": 1,
            "author": "Novel_Abroad5211"
        },
        {
            "level": 0,
            "comment": "As others have said you choose at NSO. The classes are filling up because current students have done their enrollment for the fall.",
            "score": 1,
            "author": "Floating_carp12"
        },
        {
            "level": 0,
            "comment": "Also, some programs will pre-enroll students in a course or two before NSO so that you won't miss out on important courses.",
            "score": 1,
            "author": "Pattycakes74"
        },
        {
            "level": 0,
            "comment": "If you are interested in the IBW I recommend taking F-100 sometime during your freshman year. It gives an overview of all the workshops and the industries they cover. It's not required for the workshop but I believe they \"highly recommend\" it, so better to take it than not.",
            "score": 1,
            "author": "Prior_Lengthiness_34"
        }
    ]
}