{
    "id": "13860uo",
    "score": 69,
    "title": "ALL CLASS OF '27 HOOSIERS AND FUTURE KELLEY STUDENTS PLEASE READ! I'M TRYING TO SAVE YOU!",
    "author": "BackgroundAd9056",
    "date": 1683248759.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/13860uo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello future Hoosiers and Kelley students! Please read this!\n\nOverall, my professor for finite, Professor Neese, is a good professor, and cares about his students and genuinely enjoys what he teaches and I will recommend him as a professor. What I will NOT do is recommend anyone take finite at IU. I repeat, DO NOT TAKE FINITE AT IU. TAKE IT AT IVY TECH. I have never tried so hard in a class, only to receive an 85%, which I am still ok with. I probably spent an average of 16 hours a week on this class and had countless all nighters and headaches due to it. Professor Neese's lectures are great, but he does not write the midterm and final, which make up 50% of your grade. The tests and scoring for this class are simply unfair. To put this into perspective, I did every single homework assignment to 100%, this homework is worth 15% of your grade, and I received 100% of that. I scored a 84% on the first exam, which professor Neese wrote. I scored a 60% on the midterm, which he did not write. I scored a 100% on the third exam, which he did write, and I scored a 54% on the final worth 27% of my grade, which he did not write. I put in around 30 hours of studying for that final, just to get a 54%. The class average for the final was a 49%.  At the end of the semester, out of the 175 kids who were in the class at the start of the semester, only 60 or so of us remained at the end. Everyone else dropped it, do to the difficulty and absolute nightmare that was the exams. If that isn't a wake up call for the mathematics department at IU, then I don't know what will be. Please save yourself, and take finite at ivy tech. This class is fucking ridiculous and has ruined countless students GPA's and admissions to Kelley. Please, for fucks sake, DO NOT TAKE FINITE HERE. Please upvote this to help save incoming freshman.\n\n\\-A class of '26 Kelley finite survivor, and finite PTSD victim",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;if that isn’t a wake up call for the mathematics department, I don’t know what will be.\n\nThey’re called weed out classes. They know exactly what they’re doing.",
            "score": 68,
            "author": "charoygbiv",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, big on this. As a graduating senior there are some classes that you are going to take that you are really going to give it your all and might barely stumble out with a low B high C. Some classes are designed with the expectation that some of yall are going to fail it or that an exam average is going to be a 60%. Learn to be OK with just passing a class, and accept that sometimes you are going to spend 10 hours studying for an exam and eat shit anyways. It will save you a lot a grief in the long run.",
                    "score": 2,
                    "author": "Sh0tgunLlama"
                },
                {
                    "level": 1,
                    "comment": "To add to this, the University has a specific grade distribution in mind. If too many people get As, then they'll tell the math department to make it harder.",
                    "score": 2,
                    "author": "poopyheadthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got an A in finite at IU. The concepts are difficult to understand at first but if you genuinely take the time to sit down and learn it by doing the homeworks etc it starts to make sense. Though based on what my fiends told me, finite at IU is either “it clicks” or “it didn’t click.”",
            "score": 31,
            "author": "inrusswetrust12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Surprisingly enough, I did bad in Calculus. Got a C+ 💀",
                    "score": 8,
                    "author": "inrusswetrust12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was the exact same way. I had to retake calc but didn't have nearly as much trouble understanding finite. I could've gotten a better grade in finite if I didn't find the webwork assignments so repetitive that I didn't care about them anymore.",
                            "score": 2,
                            "author": "atjolley98"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took finite in high school and it was the iu class but though through the high school and had more than twice as many classe seasons as the iu class.",
            "score": 6,
            "author": "WillingList0"
        },
        {
            "level": 0,
            "comment": "Prospective Luddy student, HS junior here. This post kind of scares me. Are instructors at IU something of a mixed bag? What's the quality of instruction here? And lecturers vs professors?",
            "score": 8,
            "author": "MixerBlaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Professors are a mixed bad everywhere.  Biggest cheat code for IU though is the Grade Distribution Reports.  Look for Profs with the highest Class GPAs.  Doesn't necessarily mean you'll have the best learning experience, but you'll know what you're getting into, at least.  For a class with standardized tests, like Finite, it should be correlated with the Professors teaching ability.",
                    "score": 13,
                    "author": "Due_Feedback_1870"
                },
                {
                    "level": 1,
                    "comment": "Graduating Luddy student here, my experience with prof/lecturers has been pretty positive overall, but that doesn't mean there haven't been bad apples. The worst ones were actually in elective CS courses (Jeff Whitmer &amp; Dan Friedman specifically) and the best were in required CS courses (Eric Wennstrom &amp; Amr Sabry). My gen-eds were a bit above average because there's some good ways to see which professors are sketchy or not before signing up for their class. IU has grade distributions from previous semesters that you can search and RateMyProfessor can be unreliable at times but still informative.",
                    "score": 6,
                    "author": "SovietMario"
                },
                {
                    "level": 1,
                    "comment": "Don’t let it scare you, because you can just save yourself and take it at ivy tech, which I 100% recommend. I had no problem with my professor for finite and really liked him, just the way tests are different from what’s taught in class and how the exams make up 85% of your grade is what’s ridiculous.",
                    "score": 2,
                    "author": "BackgroundAd9056"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take it at Ivy Tech. PLEASE for your own good do that. I did it online and asynchronous over the summer after my freshman year, only did the work on Sunday nights when they were due and was fine because, best part, it’s pass/fail since it’s a transfer credit and doesn’t impact your IU GPA at all. All you have to do is pass.",
            "score": 7,
            "author": "Smash-Bros-Melee"
        },
        {
            "level": 0,
            "comment": "People on other discussions have said its not available anymore, or that its only available for in-state people. Does anyone have a clear answer on how it works for class of ‘27?",
            "score": 5,
            "author": "Derekk2k"
        },
        {
            "level": 0,
            "comment": "I’m so glad I took it through ACP at my high school.",
            "score": 10,
            "author": "KaiserCorn"
        },
        {
            "level": 0,
            "comment": "100% agree with OP and want to add that I recommend the same thing for calculus. Even if you have questions, the classes are so big that you’ll never get questions answered in class. Take it at Ivy Tech. Smaller classes and more time for questions. \n\nJust to give you an idea. I dropped it at IUB when it was a regular semester (barely scraping a C), took it at Ivy Tech over a summer, spent the two weeks leading up to the final in Colorado (studies while I was there but also did fun things), came back, took the final, and got a B+.",
            "score": 9,
            "author": "Shalarean"
        },
        {
            "level": 0,
            "comment": "Listen to OP. IU MATH PROFESSORS ARE AWFUL",
            "score": 19,
            "author": "Schneeder7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the people who teach finite are not professors. They are lecturers. These aren't the same thing. Lecturers are paid less, worked more, and generally don't have the credentials professors have. If they have anything at all, it's that they've taught a class like this many times. Practice doesn't make perfect though, only perfect practice makes perfect.",
                    "score": 5,
                    "author": "birdandsheep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Math can’t keep their good lecturers because they treat them terribly. The chair of the dept and the faculty do not believe in education at all. The university’s rewarding their dismal passing rates with a million dollars to improve things. But they won’t, because they don’t believe in teaching.",
                            "score": 5,
                            "author": "mmilthomasn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The pay is garbage, the workload is unreasonable,  the list goes on.",
                                    "score": 6,
                                    "author": "birdandsheep"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They do have the same credentials; they are PHDs (or should be).",
                            "score": 1,
                            "author": "mmilthomasn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hoosier link student here, thanks a lot!",
            "score": 3,
            "author": "Combatpigeon96"
        },
        {
            "level": 0,
            "comment": "if you don’t need to take finite and just need a math cred: take calculus for the life sciences, it’s  the same brief survey of calculus but with a smaller class size (my class was ~60 people compared to the 200+ lectures my friends had)",
            "score": 3,
            "author": "honkaru"
        },
        {
            "level": 0,
            "comment": "Take all ur gen eds at Ivy Tech. Save ur wallet. Student loans are a scam. Don't fall victim to them.",
            "score": 3,
            "author": "Volt_Princess"
        },
        {
            "level": 0,
            "comment": "Is there a similar issue with calculus at IU? As a CS major I require a math higher than calc I, so I want to know if it’s worth getting this down in the summer",
            "score": 2,
            "author": "Academic-Competition"
        },
        {
            "level": 0,
            "comment": "100% co-sign this. Signed up a week before move in for finite at ivytech. Mondays-Thursday for a regular 75 minute session and it only ran over the first half of the semester. Just try for like the first few weeks and you can pretty just do jackshit the rest of the way. Had a 98 after the midterm and didn’t attend or do any of the homeworks. Got a 13% on my final and still finished with an 83 when all you need is a 70. Seriously it’s about as close to a no brained as you’ll get",
            "score": 2,
            "author": "stankdaddy69420"
        },
        {
            "level": 0,
            "comment": "When I was a student, they gave you the option to split the class into two semesters. If you can afford the time, I recommend it. Got an A both terms, but you sacrifice a class—if you drop or fail then it works out in the end.",
            "score": 2,
            "author": "Griffolian"
        },
        {
            "level": 0,
            "comment": "Is finite a required perquisite? No matter what you get on math placement exam or if you have ap calculus credit?",
            "score": 2,
            "author": "Brief-Commercial7314"
        },
        {
            "level": 0,
            "comment": "I bet Wheeler wrote those exams in like the 70s on his old punchcard computer that he still fucking uses.",
            "score": 2,
            "author": "Punchee"
        },
        {
            "level": 0,
            "comment": "If you spent so much time only to get such bad scores on the exams it’s likely you did not study effectively or understand the concepts. You can’t pass a math class through memorization. Learning how to use your time more effectively will be better for you than shopping around for the easiest way to not learn the material yet pass. It’s a vital skill across many classes.",
            "score": 2,
            "author": "juanpabl0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wrong. I didn’t struggle with any of the homework’s. I understood the material very well. The exams are just that ridiculous and have different material than what’s taught in lecture. Me getting an 85% in the class and acing the third exam is proof of this. I studied very effectively and put my absolute best into preparing for all exams, only to get bent over and fucked by them anyways because of how stupidly hard the midterm and final were",
                    "score": 1,
                    "author": "BackgroundAd9056"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had never failed a class before. It took me 3 times to pass this class. Was I hungover a lot during the first 2? Sure. But still….",
            "score": 1,
            "author": "S1nlow"
        },
        {
            "level": 0,
            "comment": "The entire point is to weed out ppl who can’t take it lol.  I had Neese and he’s just as good as all the others except he doesn’t drop 1 test for the final",
            "score": 1,
            "author": "AnythingElectrical93"
        },
        {
            "level": 0,
            "comment": "I got an A and my teacher was a Romanian chick who I could barely understand. You just gotta study on your own",
            "score": 1,
            "author": "Spinax_52"
        },
        {
            "level": 0,
            "comment": "Getting an A is very doable. Get good at math?",
            "score": -1,
            "author": "rossisd",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok we’ll just make math easier for you then",
                            "score": 0,
                            "author": "rossisd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t need to make it easier. I still finished with an 85, even after getting a 54 on the final",
                                    "score": 0,
                                    "author": "BackgroundAd9056"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard a rumor that they were making it harder to take at ivy tech? Has anyone else heard anything about this?",
            "score": 1,
            "author": "Roxeteatotaler"
        },
        {
            "level": 0,
            "comment": "Do u have to take finite as an informatics major ?? And possible minor in business",
            "score": 1,
            "author": "00a86b-color",
            "replies": [
                {
                    "level": 1,
                    "comment": "Info requires finite",
                    "score": 1,
                    "author": "chaotic_dancer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where ?",
                            "score": 1,
                            "author": "00a86b-color",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bloomington for sure, I don't know about the other campuses. Check major requirements online in the bulletins",
                                    "score": 1,
                                    "author": "chaotic_dancer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn’t say I have to take finite",
                                            "score": 1,
                                            "author": "00a86b-color",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hmmm thats what the recruiting presentation said about the math requirements for the majors, but maybe it's been changed or the presentation was wrong",
                                                    "score": 1,
                                                    "author": "chaotic_dancer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m in incoming freshman but I can ask my advisor",
                                                            "score": 1,
                                                            "author": "00a86b-color",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It was a requirement for INFO in 2020-2021, but the bulletin has changed since then so it seems to not be a requirement anymore",
                                                                    "score": 1,
                                                                    "author": "chaotic_dancer"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sophomore Informatics major here! The general informatics plan is to take finite or a better math class first semester, which allows you to take more informatics courses second semester. I failed my math class first semester and therefore was not able to take an informatics class at the right time, so I had to push it down a semester and it screwed with my plan for the next couple years. Take it at Ivy Tech! I did and it was so worth it.",
                                                                    "score": 1,
                                                                    "author": "notgabeus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "But it doesn’t say it’s a requirement",
                                                                            "score": 1,
                                                                            "author": "00a86b-color"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "https://bulletins.iu.edu/iub/sice/2022-2023/undergraduate/degree-programs/bs-informatics/luddy-degree-major-req.shtml",
                                            "score": 1,
                                            "author": "00a86b-color"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just FYI- It’s been like this since at least the early 2000’s",
            "score": 1,
            "author": "hashtagqueenb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. I took it in the early 2000s and it was the same thing. Took it at Ivy Tech and did well.",
                    "score": 1,
                    "author": "sunangel803"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So sad this is still going on for 30+ years. You'd think IU would revise this course for the better. \nBut as a previous poster said, \"It's a weed-out class. They know exactly what they are doing.\"",
            "score": 1,
            "author": "LazyPension9123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably a huge money maker for the university as well since it is a weed out class.",
                    "score": 2,
                    "author": "sunangel803"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated in ‘99 and it was a bitch back then",
            "score": 1,
            "author": "mayday_mayday23"
        },
        {
            "level": 0,
            "comment": "I also took finite at Ivy Tech. It was difficult because I’m not great at math but farrrr easier than when I took it through IU. It was the smartest decision I’ve made as a student so far.",
            "score": 1,
            "author": "notgabeus"
        },
        {
            "level": 0,
            "comment": "You’re so right. And the fact that you can’t use a calculator makes it even more unnecessarily hard for a freshman class.\n\nAbsolutely bombed this class but in Calc? Did absolutely fine.",
            "score": 1,
            "author": "Delightful_Churro"
        },
        {
            "level": 0,
            "comment": "Just graduated and did the same thing freshman year. Totally worth it. I took calc first semester and I used the free space in my schedule second semester to take A201 (financial accounting) and get ahead of my meanings I-Core Prerequisites.",
            "score": 1,
            "author": "WhereIsCharlesLee"
        },
        {
            "level": 0,
            "comment": "Pfft I've been a rideshare driver in Bloomington for about 3 years now &amp; this is literally one of the only classes that I hear students gripe about/struggle with. As for the math professor commentary.... I met my first IU math professor this evening, and, WELL.......I am strongly inclined to agree with the comment I read about being tough/mean. But I did also mistake her for someone on the janitorial staff, as well 🤦‍♀️🤷‍♀️😄",
            "score": 1,
            "author": "RealFionaGallagher"
        },
        {
            "level": 0,
            "comment": "Ditto this OPs advice. May I add, don’t take any Gen Ed pre/req math at IUB if you can have other options. No idea why the teaching is so abysmal, but take them elsewhere if you are able to. Wyzant online tutoring is a great resource to use over Summer for supper w these classes. Ask yourself, unless a math major, when are you going to use these concepts going forward.  Meet the requirements in the most cost effective way you can.",
            "score": 1,
            "author": "Mbird324"
        },
        {
            "level": 0,
            "comment": "My hubby sat in on a freshman Calc class during parents weekend with other parents in town.  Huge class, sitting w our kid. He noticed the professor was teaching the concept wrong. Didn’t want to speak up. Eventually a student did. The professor didn’t take it well, but admitted the kid was correct. \n\nI heard from another parent that year whose kid got real sick from the moldy dorm crisis. The student was DA Kelley, had to retake Calc because they missed the passing grade by a smidge. But rules are Rules. When they met with the then math chair, the chairperson said there wasn’t a professor they’d recommend for retaking, so take it online instead. Which they did, took it in compressed 8 weeks and passed without issue.",
            "score": 1,
            "author": "Mbird324"
        }
    ]
}