{
    "id": "13v1hq4",
    "score": 2,
    "title": "Zip Car",
    "author": "Sleet451",
    "date": 1685382335.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/13v1hq4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I’m an incoming freshman with a license but I not want to bring my car on campus. I started looking into zip car and I wanted to see if anyone has had any experience with it. Mainly looking to see if it’s actually practical and convenient in Bloomington. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "It is practical, but might be expensive for everyday use.\n\nSo you can rent it on the weekends, like if wanna tour around Bloomington. If you're asking for the daily use, you don't really need a car if you live on campus, because there are buses around.\n\nMake sure to download the IU Mobile app, and turn your location on for this app, in the app specific settings, if you use an iphone (a lot of freshman do not know to do this)",
            "score": 5,
            "author": "Extension_Ad_9344"
        },
        {
            "level": 0,
            "comment": "The gap in cost between a Zipcar for a half day of errands or a weekend VS a Hertz “dealers choice” rental is pretty small - I just get the Hertz",
            "score": 2,
            "author": "Beacon114",
            "replies": [
                {
                    "level": 1,
                    "comment": "The thing with Hertz is that you have to be at least 25 years old to rent a car but with Zipcar you only have to be 18.",
                    "score": 1,
                    "author": "goofyhelper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can rent under 25, but there are extra fees. They won’t let you rent speciality vehicles (the Tesla out front).\n\nSource: I did it.",
                            "score": 2,
                            "author": "Beacon114"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've used it three times and had nothing but positive experiences :)",
            "score": 2,
            "author": "puregrace62"
        }
    ]
}