{
    "id": "1421zs0",
    "score": 3,
    "title": "Incoming Freshman Attending NSO: Schedule Advice",
    "author": "Accomplished-Act3160",
    "date": 1686021716.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/1421zs0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nI am an incoming DA to Kelley for the class of '27 and will be a Finance major. I am attending NSO next week, and had questions regarding course selection.\n\nWhat courses are recommended that I should take for my first-semester schedule at IU to put me on a good track? Is there advice you can give me about this, and how would a sample schedule for a Semester 1 Finance major look like?\n\nAlso, any general advice that I should have going into NSO? Thank You!!",
    "comments": [
        {
            "level": 0,
            "comment": "NSO isn’t a big deal, don’t worry about it. \n\nFor classes, knock out your I-CORE pre reqs and general education requirements. You don’t take classes for your respective major until you’ve taken most of these classes. As well as I-CORE. \n\nLink to all the requirements: https://bulletin.kelley.iu.edu/Undergrad/Degree?_gl=1*1aj8fcv*_ga*NTA4Mjk4NDAuMTY4NjAyMzUzNg..*_ga_61CH0D2DQW*MTY4NjAyMzUzNi4xLjEuMTY4NjAyMzk0My4yOS4wLjA.\n\niGPS will help you map out your classes: https://one.iu.edu/task/iu/igps-plan?_gl=1*sdyjrr*_ga*NTA4Mjk4NDAuMTY4NjAyMzUzNg..*_ga_61CH0D2DQW*MTY4NjAyMzUzNi4xLjEuMTY4NjAyMzk0OS4yMy4wLjA.\n\n\nGeneral rule of thumb, 15 credits a semester will more or less get you through college if you only have one major.",
            "score": 4,
            "author": "inrusswetrust12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure wtf happened to the links but they should still work.",
                    "score": 1,
                    "author": "inrusswetrust12"
                },
                {
                    "level": 1,
                    "comment": "What would be the best I-CORE pre reqs to start with and do you know which ones are auto assigned to freshman schedules? Any prof recs? Thanks",
                    "score": 1,
                    "author": "Accomplished-Act3160",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DM me for the specific classes I took. I recommend taking Finite and calc in separate semesters freshman year. Econ and Accounting in separate semesters. Business presentations is a lot of public speaking, with some research/preparation during your own time. Either semester works. English W 131 I didn’t have to take because my SAT score was high, but if you have to take it I recommend taking it in a separate semester of Business presentations. Kelley Compass (for years 1-3) is just busy work that helps you prepare for resumes, cover letters, interviews etc. Take it during whichever semester you have less classes freshman year. \n\n^These are all your I-core pre reqs you should take freshman year. You also have your IU Gen ed requirements that you have to fulfill, so just add those classes on for each semester for your first two years. I can recommend some of the classes I took as well as professors (for both gen ed and  and i core pre reqs).",
                            "score": 1,
                            "author": "inrusswetrust12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the reply! Just sent you a message",
                                    "score": 1,
                                    "author": "Accomplished-Act3160"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s really sad how misinformed people in this thread are.\n\nGo to I GPS, and degree maps. \n\nKelley expects you to take more than two BUS courses BOTH semesters of your first year. You will fall behind if you don’t.",
            "score": 1,
            "author": "Successful_Rabbit710",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I remember correctly, the BUS courses we weren't allowed to add anymore than what we were pre-enrolled in unless we were in JLLC for which we took an additional class, and I know some students took BUS-F 100. We weren't allowed to add on Accounting or business presentations for example if we were assigned k201 and compass for that semester. That being said, I may be wrong, so definitely reach out to an advisor or check the website.",
                    "score": 1,
                    "author": "Fabulous_Astronomer2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t know when you were there, but this past year, you could take as many courses as you could fit and get into (aka space left). I took 3 or 4 BUS classes my first semester, and a few second as well.",
                            "score": 1,
                            "author": "Successful_Rabbit710",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was a freshman this past year. I suppose my memory might be a bit iffy about the specifics. Thanks for the info!",
                                    "score": 1,
                                    "author": "Fabulous_Astronomer2"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}