{
    "id": "142xkcp",
    "score": 0,
    "title": "wanted northwest, assigned southeast",
    "author": "z0mbshell",
    "date": 1686095995.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/142xkcp",
    "media_urls": [],
    "other_urls": [],
    "postText": "my roommate and i requested to be in the northwest neighborhood and were just assigned forest quadrangle, which is in the southeast neighborhood. this isn’t bad but it’s not ideal because it’s likely farther from most of our classes and from all the people we know who are going to iu. essentially i have two questions: is there any way we can request to switch rooms (such as with a roommate pair who requested southeast and were assigned to northwest, if one exists)? and if this isn’t possible, to any current residents, what is forest quadrangle like and about how far is it on average from most buildings on campus, so we can prepare ourselves for living there?",
    "comments": [
        {
            "level": 0,
            "comment": "Forest has the best dining hall by far. It's about a 20-25 minute walk to the other side of campus with most buildings being 15 minutes.",
            "score": 5,
            "author": "letsgetropical17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not by far lol. Northwest got their brand new multi million dollar McNutt Dining Hall a year ago. Essentially the same thing 🤷🏻‍♂️.",
                    "score": 1,
                    "author": "Successful_Rabbit710"
                }
            ]
        },
        {
            "level": 0,
            "comment": "can't answer your switch q and recommend contacting rps, but: i lived in/next to forest all four years and loved it. all my classes and downtown were within a 10-15 minute walk and it's pretty easy to catch the E/F campus buses or the 3/9 local buses to get around. i'll tell you now to learn the buses and not fear them because they really do make your life easier. getting back to forest from the rest of campus by bus, however, is a hassle and a half but doable if you have some time to kill. forest isn't the capital B best dining hall anymore but still pretty good, you're a short walk from goodbody which has always been my favorite, and they serve starbucks in read which is right behind forest. you're across the street from some restaurants/coffee shops beloved by students, and there's a 24 hour (overpriced) convenience store. as for the building itself, it's not a palace but it's pretty good by college dorm standards. each floor has several private bathrooms (all with showers), laundry in the basement, nice center lounge for watching movies/playing games, etc etc. i lived in an llc my first year and we all kept our doors open during the day to be social. overall, i'd say that while it may be a slightly longer trek to class if you're an incoming/aspiring kelley student, it's still pretty close to the majority of campus and downtown, plus there's way more to do nearby than there is in the northwest neighborhood — then again, i was never in that part of campus so there may be a whole world up there i missed out on. hope this spiel was at least 50% helpful",
            "score": 2,
            "author": "yeIIowcurtains"
        },
        {
            "level": 0,
            "comment": "Forest is a great dorm! It’s not a far walk from classes, and the bathrooms are all separate rooms, so you can shower in peace (a huge luxury, lmao). While not the newest, the rooms are all fairly spacious and you can get a nice view on the upper floors of the towers. And also, it’s pretty convenient! There are actually 2 nearby coffee shops, a poke restaurant, and a convenience store (although it’s kinda sketchy lol) all down the street. It’s also got a dining hall, which is extremely nice to not have to walk to. It’s about 10-15 minutes walk from Kirkwood Avenue too, which is really fun!",
            "score": 2,
            "author": "Delightful_Churro"
        },
        {
            "level": 0,
            "comment": "forrest is one of the best dorms, sure you might not know a lot of people there but it gives you a good opportunity to meet even more people",
            "score": 2,
            "author": "godzillacraft"
        },
        {
            "level": 0,
            "comment": "In the email I received today they said that they wouldn’t be offering room swaps this year",
            "score": 1,
            "author": "cqvt2"
        },
        {
            "level": 0,
            "comment": "They won't switch your room at this point. You are kind of stuck with what you have. \n\nForest is really nice! Has dining right there in the building. It's right across the street from Ami Sushi, Dragon Express, Mother Bears Pizza, and Soma Coffee. Honestly, I loved living on south campus because of proximity to stuff (like Target up the road)",
            "score": 1,
            "author": "the-garnet-witch"
        }
    ]
}