{
    "id": "148vity",
    "score": 1,
    "title": "finite for informatics major??",
    "author": "00a86b-color",
    "date": 1686707624.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/148vity",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi IU Reddit community!!\n\nAre there any alternatives to fulfill the prerequisite for INFO-201 Mathematical Foundations of Informatics for informatics majors in Luddy without having to take MATH-M 118 (Finite Math) or a similar course? I'm curious if there are any other pathways or substitutions available that would satisfy the requirement for INFO-201 without the need for a finite math course.\n\nThanks !!",
    "comments": [
        {
            "level": 0,
            "comment": "Nope, gotta take finite before u take i201 (there’s no other way around this). I’m currently taking it through ivy tech online and I’m an informatics major. I’ll be taking i201 in the fall.",
            "score": 3,
            "author": "dcg808",
            "replies": [
                {
                    "level": 1,
                    "comment": "How much?  Was it at ivy tech",
                    "score": 1,
                    "author": "00a86b-color",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m doing it all online and the total I believe is somewhere around $600 (not sure if the price is different if u decide to take the course in person)",
                            "score": 2,
                            "author": "dcg808",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would you currently be on course to take it in spring",
                                    "score": 1,
                                    "author": "00a86b-color",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not sure what ur asking here? Go ahead and pm me with anymore questions u need answered!",
                                            "score": 1,
                                            "author": "dcg808"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check with your advisor. The I201 prerequisites have recently changed (like, a few weeks ago). Still need Math Modeling, but if you're more of a calculus fan, that might be an option.",
            "score": 1,
            "author": "Pattycakes74"
        }
    ]
}