{
    "id": "qg7yby",
    "score": 92,
    "title": "Any foreseeable issues with creating a email spam filter to delete all emails containing the name 'Whitten'?",
    "author": "I_BombAtomically",
    "date": 1635259497.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/qg7yby",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I get one more Written By Whitten email my morale may sink so slow that l jump from that ridiculous bell tower. What's the worst that could happen if I block all her correspondence? Asking for a friend",
    "comments": [
        {
            "level": 0,
            "comment": "Here is my filter for IU email: \n\nFrom matches: indianauniversity@iu.edu OR president@iu.edu OR divrsed@iu.edu OR iudegree@iu.edu OR iupresbn@iu.edu OR provost@indiana.edu OR indiana@iu.edu OR vpr@iu.edu OR ovpr@indiana.edu OR ooe@iu.edu OR bdot@iu.edu OR ufcsecs@iu.edu OR [swp@indiana.edu](mailto:swp@indiana.edu)\n\nMark as read -&gt; Skip the inbox  \n\n&amp;#x200B;\n\nHope this helps.",
            "score": 26,
            "author": "TankAttack",
            "replies": [
                {
                    "level": 1,
                    "comment": "This does not help, this changes my life!\n\nYou are a legend. Thank you!!!",
                    "score": 22,
                    "author": "I_BombAtomically"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't see any issues with doing it. If there is important campus or covid news or anything, another person will likely inform you through email. If not I bet you'd hear about it here or through word of mouth. However you might want to filter out her actual email and not just the name.",
            "score": 8,
            "author": "JubilantFire"
        },
        {
            "level": 0,
            "comment": "Why such sensitivity regarding our new president? Does she offend you? She is just trying to keep us informed on issues.",
            "score": -19,
            "author": "LazyPension9123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know what the emails are about but if it isn’t about getting the dining situation fixed then it isn’t that important.",
                    "score": 23,
                    "author": "PeterThatNerdGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From your perspective (as a student, I think), I understand. But please at least read the emails before you down her.",
                            "score": -11,
                            "author": "LazyPension9123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it has absolutely nothing to do with her tbh. She’s been cool with what she has done on and off campus they really just spam our emails with unimportant stuff from her and other university accounts when we have all kinds of actually important school info coming in from teachers and stuff.",
                                    "score": 4,
                                    "author": "Osukid2811",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What has she been up to? So far I've only heard a lot about what she isn't doing, I'm interested in the other side of the story.",
                                            "score": 1,
                                            "author": "saryl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh I have absolutely no clue I was just referencing her like handing out glizzys at the game. Sadly I have very little hope that anyone will actually fix the problems we as a student body have, it’s clearly not a priority for the school.",
                                                    "score": 0,
                                                    "author": "Osukid2811",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "lol - well dang, you almost made me optimistic for a minute there!",
                                                            "score": 3,
                                                            "author": "saryl"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Found the presidents burner account",
                    "score": 20,
                    "author": "they_were_roommates",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah I’ve met Pam even she isn’t this fucking lame",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}