{
    "id": "zq8zzt",
    "score": 7,
    "title": "will I be able to find a group at IU? are there lots of different types of people?",
    "author": "Ok-Vermicelli-3446",
    "date": 1671496789.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/zq8zzt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi I’m a possible student next year and i was wondering if there’s a diverse group of students at IU? Not only demographics wise but interest wise. I really don’t enjoy the company of frat/sorority types. Are there plenty of more offbeat people who are into more worldly/cultural stuff and can actually keep a good conversation?? also would you recommend LLCs? thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "It’s somewhat diverse. The main demographic seems to be white people and South Asian people, but it’s not like there are no other races or ethnicities. I’ve had trouble meeting ppl even though I’m in an LLC. Met and befriended people but I don’t really have a “group” I hang with. I’ve also had trouble meeting people of my race.\n\nTbh, you can’t know till you get here. Some people will meet others in a week and immediately form a close friend group with them. Others will be like me and not fully click with anyone for a while, or possibly not at all. You’ll just have to see.",
            "score": 9,
            "author": "briscill"
        },
        {
            "level": 0,
            "comment": "Check out Collins LLC for a dorm.  I have a feeling that’s what you’re looking for.  Generally speaking, there are clubs for just about anything on campus.  The cultural clubs are awesome and always welcoming.",
            "score": 8,
            "author": "crookmaestro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes if you want to hang w the alt crowd, live in Collins.  They also have lots of clubs and organizations you can get involved with to meet people.  I believe theres a separate application to get admitted. But also Bloomington has always been an alternative hub w a cool indie music scene in the midwest. You'll love it!",
                    "score": 3,
                    "author": "annalikessnacks"
                },
                {
                    "level": 1,
                    "comment": "oooh thank you. i think my friend lives there i will definitely check it out",
                    "score": 2,
                    "author": "Ok-Vermicelli-3446"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IU is probably one of the best school you could possibly choose for this. Try getting to know some music students.",
            "score": 7,
            "author": "Thirstymonster"
        },
        {
            "level": 0,
            "comment": "Yes there are. You can stay away from the frats/sororities, there are plenty of people that you won’t have to deal with them if you don’t want to.",
            "score": 3,
            "author": "DepressedMusician8"
        },
        {
            "level": 0,
            "comment": "I don’t party or drink at all. Greek life isn’t my thing and I love IU. None of my friends party but we have plenty to do each weekend and plenty of people to hang out with. With Greek life it’s worth noting you will run into it frequently but personally, I think it keeps things interesting and it doesn’t interrupt my thing. I live in an LLC and I literally can’t recommend it more. I’ve meant majority of my friends on my floor.",
            "score": 3,
            "author": "rew773",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much!! i’m thinking of joining the education one or the leadership one. i only looked at them once so those might not even be things haha",
                    "score": 1,
                    "author": "Ok-Vermicelli-3446",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah anytime!! If you have more IU question you can always dm me",
                            "score": 2,
                            "author": "rew773"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh absolutely. You’ll be fine.",
            "score": 7,
            "author": "Due-Cell1312"
        },
        {
            "level": 0,
            "comment": "There's like 40,000 students. I'm sure you will find someone to vibe with.",
            "score": 1,
            "author": "bouncingpaperwad"
        }
    ]
}