{
    "id": "zshc2q",
    "score": 0,
    "title": "grading system",
    "author": "PoopyWoopyDoopy69",
    "date": 1671699416.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/zshc2q",
    "media_urls": [],
    "other_urls": [],
    "postText": "What's the percentage score for an A or B in Indiana University? I'm an international student so I am not really familiar with the grading system. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Here are the defaults in Canvas. Most faculty use these (because they don’t know how to change). But not all (myself included).[Canvas grades (IU default)](https://drive.google.com/file/d/1pS4HAUjvz0-E9ZrCoZSkGPXXi9Ri38eH/view?usp=sharing)",
            "score": 4,
            "author": "antillesarch"
        },
        {
            "level": 0,
            "comment": "This should be easily Googleable but I looked and it isn’t. I will let the people at student central know. This archived information that comes up in Google is old but I know the system hasn’t changed since when this was published, so these should be the right numbers: https://kb.iu.edu/d/azij \n\nYou can email questions like this to Student Central through their website in the future, btw.",
            "score": 3,
            "author": "clinton2209",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s because IIRC there’s no standard percentage for grades. Professors can make 60%s Bs if they want.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not exactly, they can curve grades or manipulate them to other percentages than the ones you see in the grade book, but the final grade should always map to the letter grade indicated in the table on that KB article",
                            "score": 0,
                            "author": "clinton2209",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not true.  Only if using default grading scheme.  This can be easily changed in Canvas by going to settings --&gt; enable grading scheme.\n\nThis is very nice when copying grades to the faculty center.",
                                    "score": 4,
                                    "author": "rgranger"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Standard minimums for each grade are A+ 98, A 93, A- 90, B+ 87, B 83, B- 80, etc.",
            "score": 2,
            "author": "Background-Chapter80"
        },
        {
            "level": 0,
            "comment": "Hm I guess it can be more complicated than I realized. FWIW I believe the university expects instructors to clearly outline this in each course’s syllabus, so for any one course you should be able to find the grading scheme in the syllabus. Good luck!",
            "score": 1,
            "author": "clinton2209"
        }
    ]
}