{
    "id": "ztwoih",
    "score": 3,
    "title": "Can you double major at IU",
    "author": "Beast_J_9",
    "date": 1671840541.0,
    "url": "https://www.reddit.com/r/IndianaUniversity/comments/ztwoih",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys,\n\nI was wondering if I could double major at IU from two different schools at IU, as I am a Kelley DA, is it possible for me to major in finance from Kelley and Data Science from Luddy?",
    "comments": [
        {
            "level": 0,
            "comment": "I would talk to an advisor. I know of a couple people who did something similar, but it was a lot of work.",
            "score": 13,
            "author": "Iripol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded. Your best bet would be an academic advisor so y’all can make a sample schedule, talk about your goals, and see if its feasible. Personally, I would double major within a school if possible. Kelley has a good information science/other data programs you could look at or you could do the MSIS program!",
                    "score": 5,
                    "author": "superjrtrash"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It technically wouldn't be a double major but a dual degree. It's difficult but doable",
            "score": 5,
            "author": "chaotic_dancer"
        },
        {
            "level": 0,
            "comment": "Yes but it is painful to do so and I don’t recommend it. Because of the way GenEd classes work, you’ll have to take a LOT more classes than the average person, even more than someone who double majors inside of the same school. \n\nDouble majoring is totally cool and doable, almost 50% of the people I know are double majoring, myself included. But out of everyone I know, not one is doing a double major where one is in a different school. It’s just too difficult for almost 99% of people.\n\nIf you’re dead set on doing it, have a conversation with an academic advisor ASAP. They will be able to tell you what is possible or doable better than I can. Best of luck.",
            "score": 2,
            "author": "DaRealWamos"
        },
        {
            "level": 0,
            "comment": "Hey, I'm also a Kelley DA thinking about doing DS from Luddy. Lmk if you wanna talk!",
            "score": 2,
            "author": "SaberTooth_02"
        },
        {
            "level": 0,
            "comment": "You definitely can. I would talk to advisor as they can really help you figure out whats best for you. Just note that it’ll be a lot of work.",
            "score": 1,
            "author": "DepressedMusician8"
        },
        {
            "level": 0,
            "comment": "It is but it’s a fair amount of work. If you’re taking CS and can take AP CS, I’d highly recommend doing so, as you can skip the first 2 CS courses (C211/C212)",
            "score": 1,
            "author": "Salmon117",
            "replies": [
                {
                    "level": 1,
                    "comment": "this ties into an important point, how many pre-reqs you already have credit for will play a big role. If you are coming in with 30 relevant credits that’s a huge difference compared to coming in with 0 or even 6",
                    "score": 2,
                    "author": "cubbsfann1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know a couple kelley and computer science dual majors. Its really difficult. I think both got jobs at Microsoft.\n\nIt really depends on what you want to do though. Because depending on what direction you want to go on its possible with just the one.",
            "score": 1,
            "author": "javaHoosier"
        },
        {
            "level": 0,
            "comment": "Yes but its gonna be a ridiculous course load",
            "score": 1,
            "author": "therobbinman123"
        },
        {
            "level": 0,
            "comment": "I would look into the technology co-majors and information systems major within kelley! I was a IS business analytics co major and held a minor within luddy and still had access to all of the luddy career fairs and could take extra classes in luddy for things that interested me (like cybersecurity for example). Good luck!",
            "score": 1,
            "author": "Maximum-Internet-871"
        },
        {
            "level": 0,
            "comment": "I’m finishing up a dual degree with CAS + Kelley. Not Luddy but I have experience with managing my schedule and talking to advisors. Lmk if you have any questions.",
            "score": 1,
            "author": "Ok-Afternoon4712"
        },
        {
            "level": 0,
            "comment": "No you can not",
            "score": -3,
            "author": "4est_fire2063"
        }
    ]
}