{
    "id": "10drfbg",
    "score": 3,
    "title": "ACCT 215",
    "author": "Dmoe515",
    "date": 1673902340.0,
    "url": "https://www.reddit.com/r/iastate/comments/10drfbg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone have any tips to succeed in ACCT 215? I’ve talked to a few people that have taken it and they said just to study terms mostly, I’ll be taking my exams in the testing center.",
    "comments": [
        {
            "level": 0,
            "comment": "Mike does everything he can to make sure students succeed in his 215 class. Talk to him if you have any concerns and you’ll be fine.",
            "score": 3,
            "author": "firstaccountwasdumb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mike is the goat. Super entertaining lectures. I couldn't care less about law but he made it fun.",
                    "score": 3,
                    "author": "o_opc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whether you’re taking it with Bootsma or Gartin, trust me when I say you’re in good hands! Go to class and try your best to understand the material. It’s not hard at all (got an A and really didn’t do much outside of class except exam study), once you understand a lot of the terms, the MC on the test can be self explanatory, because you can rule out 2 or 3 answers per question even when you don’t know the question. In conclusion, know the terms, (for example “what are the 4 things needed to prove intentional infliction of emotional distress?”) and also know the cases that you discuss in class to the level of being able to explain the two sides, the key issue, and the verdict. If you have any questions at all, let me know!",
            "score": 1,
            "author": "Jmoney1542",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awsome thank you!",
                    "score": 1,
                    "author": "Dmoe515"
                }
            ]
        }
    ]
}