{
    "id": "10hh5ep",
    "score": 14,
    "title": "Any fpv club/group for ISU?",
    "author": "CyberSnope",
    "date": 1674270524.0,
    "url": "https://www.reddit.com/r/iastate/comments/10hh5ep",
    "media_urls": [
        "https://i.redd.it/8wpibj9vtcda1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I'm not aware of any, but what does a setup like that cost? I'm vaguely interested and if the price was right I'd likely get one. Seems like fun!",
            "score": 3,
            "author": "TrippyAcidCats",
            "replies": [
                {
                    "level": 1,
                    "comment": "$1k is the ballpark for an intermediate FPV setup.",
                    "score": 5,
                    "author": "Tevedeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any recommendations on good brands to research?",
                            "score": 1,
                            "author": "TrippyAcidCats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've been out of the game for too long to recommend anything. /r/fpv, /r/fpvracing, /r/multicopter have good info. Expect around $200 on a controller, $250 on quad kit, and $500+ for FPV gear if you want decent stuff new (at least from what I remember). I used to fly around Carroll Marty in my college days but living in downtown MPLS now so I'm not flying much.\n\nJust to be clear, when I say decent I really mean not garbage. You can spend a lot more, but if you spend less you may have a bad time. Also have no idea if flying at Carroll Marty is legal.",
                                    "score": 3,
                                    "author": "Tevedeh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "$1k is a good estimate for a mid tier setup. If you’re interested feel free to reach out! \n\nI started with just a controller and flew on a simulator for ≈50hrs.",
                    "score": 2,
                    "author": "CyberSnope"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn’t it illegal to fly drone on campus? I’m not sure but is it’s not I would definitely buy one",
            "score": 3,
            "author": "chotta_bheem",
            "replies": [
                {
                    "level": 1,
                    "comment": "FAA says most of campus is a no-fly zone due to the proximity of the airport. See [this map](https://arcg.is/1TW08r0). Non-part 107 operators aren't getting an altitude waiver. As for those that magically do get a waiver, you need permission from ISU to land/take off from university property. If you get the FAA waiver but not the ISU waiver, you could take off and land outside of ISU property and they couldn't do anything about it\\*.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*assuming you're not violating [Iowa Code 328.41](https://www.legis.iowa.gov/docs/code/328.41.pdf) or any of the various federal laws/state laws.",
                    "score": 4,
                    "author": "EspeciallyMundane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've flown in ISU campus several times, every time I put in a request they have said yes. One time I just said: flying in the month of October to get shots of the fall colors. And just approved it. \n\nI think common sense here applies. Don't fly when there's too many people around, don't fly over 100 ft (for ISU campus) try to stay away from people, etc.",
                            "score": 5,
                            "author": "Knights_Ferry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey! What do you fly?",
                                    "score": 1,
                                    "author": "Exotic_Potential1034",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's a 5\" 6S with the DJI air unit, a dead cat frame so great for filming. \n\nI'd say, let's go fly, unfortunately, I left Iowa in December. But I will say if you're looking for something fun, I used to chase deer all the time in the Pammel woods. \n\nThere's a place near the graveyard where you can launch the drone and because it's up high, you can fly the whole trail through the woods (using DJI video transmitter).",
                                            "score": 1,
                                            "author": "Knights_Ferry"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have never flown on campus. I only fly in places where there are no people because I crash a lot :)",
                    "score": 2,
                    "author": "CyberSnope"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well I do FPV, I was looking for a group, however, I just graduated in December 😞. I didn't know anyone at ISU doing FPV.",
            "score": 1,
            "author": "Knights_Ferry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you still in the area? I’m really just looking for people to fly with.",
                    "score": 1,
                    "author": "CyberSnope",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am looking into people in RC planes, are you into it?",
                            "score": 1,
                            "author": "PotentialEnergy_qq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not anymore, had to downsize my rc hobby. Just doing drones now. \n\nIf you want to fly sometime don’t hesitate to reach out though. I could probably get some good footage of your airplane.",
                                    "score": 1,
                                    "author": "CyberSnope",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ohh, I wish I had a plane! 😆😆 I am looking to build 1 completely from a scratch, if someone has an idea or spare parts to sell, that would help😅",
                                            "score": 1,
                                            "author": "PotentialEnergy_qq",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have an rx that you can have, I switched to elrs.",
                                                    "score": 1,
                                                    "author": "CyberSnope",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Is it fine if I DM you?",
                                                            "score": 1,
                                                            "author": "PotentialEnergy_qq",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yup ofc",
                                                                    "score": 1,
                                                                    "author": "CyberSnope"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Chasing a fixed wind with my quad is always something I wanted to do",
                                            "score": 1,
                                            "author": "Knights_Ferry"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I left last month :(\n\nTotally, I was also looking for other students, didn't think to try Reddit 😂",
                            "score": 1,
                            "author": "Knights_Ferry"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice! I am big into RC as well, and thinking of building a RC plane",
            "score": 1,
            "author": "Exotic_Potential1034",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do it, or better yet build a drone. Totally down to help ya out!",
                    "score": 1,
                    "author": "CyberSnope"
                }
            ]
        }
    ]
}