{
    "id": "10nzevo",
    "score": 44,
    "title": "Accidentally got a SpaceX internship",
    "author": "DarthNagaSadow",
    "date": 1674968412.0,
    "url": "https://www.reddit.com/r/iastate/comments/10nzevo",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was at a career fair last fall and SpaceX was there, so I threw in my resume because why not? Had a handful of super discombobulated phone interviews and after not hearing from them for over a month they offered me a job for this summer. I was planning on studying abroad this summer, but I'm wondering if this is an offer I shouldn't pass up. Is anyone else in here planning on working for them this summer or has worked there before that would be willing to answer some questions I have?",
    "comments": [
        {
            "level": 0,
            "comment": "Without you providing any context on the position, or your education, it's hard to say. However, the value of SpaceX alone on your resume will give you an edge for many years. But if you don't really want to do it, then don't and study abroad, since you won't really get another chance to that. Let them offer the internship to someone who wants it more than you, if that's the case.",
            "score": 62,
            "author": "nickfs442",
            "replies": [
                {
                    "level": 1,
                    "comment": "For context, I am a EE, and the position (assistant engineer) is for high power work at Starbase in Texas. I would be working with the power systems and microgrid SpaceX has that powers their production facilities, launchpad, offices, etc. I can always study abroad next summer after I graduate with my masters in may of 24, but I won't be eligible for the scholarship that would pay for it next summer, as I will no longer be an undergrad student then. So the choice between mostly free study abroad this semester or making a lot of money at SpaceX is difficult.",
                    "score": 13,
                    "author": "DarthNagaSadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do the internship",
                            "score": 12,
                            "author": "ChadMagic1"
                        },
                        {
                            "level": 2,
                            "comment": "Is the work you’d be doing there something you want to be doing after you graduate?",
                            "score": 6,
                            "author": "redroseswiththorns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Generally yes. I want to work with renewable energy, but I don't know if I want to do so through power systems (grid stuff) or semiconductors (solar cell and specialized energy equipment). I am currently doing research with solar cells and would like a work experience with semiconductors, which this job is not.",
                                    "score": 10,
                                    "author": "DarthNagaSadow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do the internship. Stuff like this on your resume will set you apart from your competition when it comes to applying for jobs in the future.",
                                            "score": 7,
                                            "author": "trainer95"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;making a lot of money at SpaceX is difficult.\n\nDid they give you info as to what your salary would actually be? From what I've heard from others at SpaceX, the pay can be good but you're usually expected to work like 60 hours a week. Don't just see the pay and think it's good, make sure the workload they're going to give you is something you're comfortable with.",
                            "score": 5,
                            "author": "Dogestronaut1"
                        },
                        {
                            "level": 2,
                            "comment": "Do SpaceX. I mean having that on your resume is amazing. Most interviewers will take experience like that over education. Plus it gets your foot into the door of spaceX and you could have future opportunities there.",
                            "score": 3,
                            "author": "SweetSauce24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Europe has been around for awhile. Do the internship. \n\n&amp;#x200B;\n\nSPACE! THE ENGINEERS FAVORITE PLACE! \n\n&amp;#x200B;\n\nYou'll finally be doing things in a frictionless environment! Take that free body diagrams!",
            "score": 9,
            "author": "Mysteriousdeer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Physics I flashbacks intensify...",
                    "score": 2,
                    "author": "DarthNagaSadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you are a mechanical engineer, the fbd flashbacks are not flashbacks. I guess you are a EE.",
                            "score": 1,
                            "author": "Mysteriousdeer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which field would this be in?",
            "score": 7,
            "author": "cloneconz"
        },
        {
            "level": 0,
            "comment": "You can always go abroad another semester right?",
            "score": 15,
            "author": "ChineseCartman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some programs might only offered once a year..",
                    "score": 2,
                    "author": "someonenewtoknow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh no, i get that. i’m just saying, it’s a lot easier to plan for another semester than getting a job at SpaceX. large corporations are very fickle in their hiring processes. at one point in time, they’d want you and in the next, you’ll miss the opportunity.",
                            "score": 6,
                            "author": "ChineseCartman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "try /r/engineeringstudents",
            "score": 6,
            "author": "rake-fan"
        },
        {
            "level": 0,
            "comment": "Do they still have interns do 60+ hour weeks?",
            "score": 4,
            "author": "Fearfighter2",
            "replies": [
                {
                    "level": 1,
                    "comment": "No idea. Obviously 60 hours a week is a double edge sword here: no overtime pay but extra experience for a 12 week period",
                    "score": 3,
                    "author": "DarthNagaSadow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Delayed response like that would be a red flag to me. But I can see how it’s a big enough name that having it in your resume may be worth it",
            "score": 5,
            "author": "beerandfishtanks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, for one of my interviews, the interviewer didn't even call, too. I ended up rescheduling it.",
                    "score": 2,
                    "author": "DarthNagaSadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yikes. That’s a free preview of how that HR group or hiring manager operates.",
                            "score": 7,
                            "author": "beerandfishtanks"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like  you have a once in a lifetime opportunity to learn from a fantastic company. To study abroad would be a massive mistake. Sorry not sorry this shouldn’t even be a question.",
            "score": 6,
            "author": "Intelligent-Body1109"
        },
        {
            "level": 0,
            "comment": "It will look great on a resume but from friends I’ve heard that worked there they demand insane hours.  Probably worth it for just a summer though",
            "score": 4,
            "author": "JJ-Bittenbinder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, at first I thought it was cool that I would be on salary, then I realized that means no overtime pay",
                    "score": 3,
                    "author": "DarthNagaSadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear it's been a bit better since Elon got distracted by his Twitter purchase",
                            "score": 1,
                            "author": "MrRoundJr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brother works for SpaceX on the structural design side of things and he loves it.  Hours can be long but the food they have on site is top notch and cheap.\n\nEdit:  I’d say go for it.  Could lead to a job down the road with them and the pay/benefits are great.\n\nEdit 2:  should also say you may be more comfortable working there as a lot of their employees tend to be younger than what you would find at other engineering based companies.  That was big for my brother when he started after working for a couple other companies that did contract work for NASA:  Easier to relate to 20-40 year olds then it is 40-70 year olds.",
            "score": 2,
            "author": "curbstomp4jesus",
            "replies": [
                {
                    "level": 1,
                    "comment": "The point about the age is something I have never thought about. Thank you",
                    "score": 3,
                    "author": "DarthNagaSadow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Def do the internship",
            "score": 2,
            "author": "IS-2-OP"
        },
        {
            "level": 0,
            "comment": "I say do it. FWIW the engineering director for the dragon capsule is an ISU alum. My wife knew him while she was finishing up her undergrad degree.",
            "score": 1,
            "author": "mramseyISU"
        },
        {
            "level": 0,
            "comment": "I'm jealous on you :(",
            "score": 1,
            "author": "IRSiscommingforyou",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe in you :)",
                    "score": 1,
                    "author": "DarthNagaSadow"
                }
            ]
        }
    ]
}