{
    "id": "10okpbs",
    "score": 0,
    "title": "ISU VPN",
    "author": "Realistic_Plant9830",
    "date": 1675031347.0,
    "url": "https://www.reddit.com/r/iastate/comments/10okpbs",
    "media_urls": [],
    "other_urls": [
        "https://it.engineering.iastate.edu/how-to/install-and-connect-to-vpn-pc/](https://it.engineering.iastate.edu/how-to/install-and-connect-to-vpn-pc/)"
    ],
    "postText": "Hey Folks, \n\nISU provides a VPN for all students. I downloaded it today. It is great and beneficial. \n\n[https://it.engineering.iastate.edu/how-to/install-and-connect-to-vpn-pc/](https://it.engineering.iastate.edu/how-to/install-and-connect-to-vpn-pc/)",
    "comments": [
        {
            "level": 0,
            "comment": "To be clear, the point of this vpn is NOT security. It may provide a tiny bit of security, but it has no promises and it's well within the university's rights to see all that you do. Also, you don't get the main benefit of a normal vpn - location spoofing (unless you're out of state and want to spoof as Iowa I guess). Its intended use is to be able to access on-campus only resources. I think a lot of the things that you used to need it for, like the remote computer lab access, don't need it anymore either.",
            "score": 25,
            "author": "nebman227",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah honestly they don’t want you to use it if you don’t need for the access to on-campus stuff. I only use it for some files for labs in my SE classes.",
                    "score": 3,
                    "author": "libertybelle08"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I used it because SolidWorks requires you to be on-campus to use it’s license for the application. So I panicked when I tried to finish my project while visiting my parents for thanksgiving, because i could not open SolidWorks. I then remembered I could use the VPN and was able to finish my project.",
                    "score": 3,
                    "author": "SweetSauce24"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you look at the configuration, it’s only routing ISU traffic through the VPN, not everything. Besides this, do you really want the university to know all of what you’re doing outside of the campus network?",
            "score": 9,
            "author": "rslarson147",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is one of the reasons Zwhy it is a “split tunnel” (ie only your traffic to ISU goes through the VPN), we don’t care where else you are going on the Internet and we don’t want to know.",
                    "score": 3,
                    "author": "john_hascall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My second part was really more reinforcing the point of maybe not using a university provided VPN for day to day things.",
                            "score": 3,
                            "author": "rslarson147"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve always wondered, does ISU still get the info/search history from using the VPN since they own it?",
            "score": 2,
            "author": "OrangeFortress",
            "replies": [
                {
                    "level": 1,
                    "comment": "No. Since no non-ISU traffic traverses the VPN, we do not have any visibility into what you do that's off the Iowa State network.",
                    "score": 3,
                    "author": "EspeciallyMundane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what you want us to think",
                            "score": 1,
                            "author": "Jmoney1542",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Source: trust bro",
                                    "score": 1,
                                    "author": "EspeciallyMundane"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, because ISU is just dying to know who goes to SexyFerrets.com or RadishWorship.net or whatever.  Nope.  We just don’t care.",
                                    "score": 1,
                                    "author": "john_hascall"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think they use it to collect info",
                    "score": -6,
                    "author": "Realistic_Plant9830"
                }
            ]
        }
    ]
}