{
    "id": "10q2ebb",
    "score": 23,
    "title": "has the isu cafes raised prices ?",
    "author": "AcanthaceaeFair2985",
    "date": 1675180107.0,
    "url": "https://www.reddit.com/r/iastate/comments/10q2ebb",
    "media_urls": [],
    "other_urls": [],
    "postText": "i went to bookends the other day and got an iced medium (16) vanilla latte with alt milk. it ended up being $7.00 + some. it just seems outrageous lol. i got the same thing at the Starbucks in clyde’s for almost $.50 cheaper. kinda niche and kinda dumb question but i’m curious lol.",
    "comments": [
        {
            "level": 0,
            "comment": "A pump of vanilla syrup is 70c and milk alternatives are also 70c (or maybe 80c I don’t remember for sure off the top of my head). I’ve been going to the cafes pretty regularly since freshman year and the prices haven’t noticeably changed from what I can tell. I think it’s scummy to charge so much for milk alternatives, but most coffee shops do so 🤷🏻‍♀️ the added syrup and milk alt probably tacked an extra 1$ or more on the cost of your latte.",
            "score": 18,
            "author": "sunflowrrz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Recently graduated. The prices used to be a lot better when I started (2017). A large coffee my freshman year was about the price of a small now. They also had $1,25 medium drip coffee every Monday (loved that bc first semester it was the only coffee I could afford). Imo sparks in the student innovation center is a way better option.",
                    "score": 11,
                    "author": "brokeballerbrand",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a meal plan so I mostly go to the cafes to spend the dining dollars. They’re definitely great for using them up 😂",
                            "score": 1,
                            "author": "sunflowrrz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Grocery and labor prices are up everywhere so likely.",
            "score": 6,
            "author": "m3gan0"
        },
        {
            "level": 0,
            "comment": "I work for Bookends and we raise our prices every semester for some reason.",
            "score": 5,
            "author": "demonangel105",
            "replies": [
                {
                    "level": 1,
                    "comment": "same! I work for Whirlybirds. Wage hasn’t changed, but everything increases by a steady $.50 every semester 🤷🏻‍♀️",
                    "score": 3,
                    "author": "bucketassrabbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, same here. Not even the price our meal slip covers has gone up.",
                            "score": 2,
                            "author": "demonangel105"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "go to Dunkin over by state gym! it’s a trek, but it’s way cheaper and they have a great rewards program.",
            "score": 14,
            "author": "ashisanerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe they have dollar donut with a medium coffee happening right now",
                    "score": 3,
                    "author": "MajoredInPhilosophy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 3,
            "author": "Maroczy-Bind"
        },
        {
            "level": 0,
            "comment": "use your dinning dollars",
            "score": 0,
            "author": "Fearfighter2"
        }
    ]
}