{
    "id": "10s78aq",
    "score": 30,
    "title": "UV power out",
    "author": "63moose",
    "date": 1675387714.0,
    "url": "https://www.reddit.com/r/iastate/comments/10s78aq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just heard a loud pop and lost power. Is this the case for anywhere else in Ames?",
    "comments": [
        {
            "level": 0,
            "comment": "https://myaccount.alliantenergy.com/Portal/outeroutagenew.aspx\n\nKeep an eye on this for updates. \n\n\n A pop followed by an outage was *hopefully* a fuse blowing due to a simple fault. If it's too complex, hopefully crews can do some switching and get y'all back in power while they make major repairs.\n\nSource: I went to ISU, but decided to become a lineman",
            "score": 28,
            "author": "cyclonepsycho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is the outage going to show here? ISU and Ames have their own power plants.",
                    "score": 8,
                    "author": "organman91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most companies refresh these sites every 15-30 minutes. \n\n\nAlso, it doesn't matter if the local power plants are on if there's an issue between the plant and you. Think of it like your whole house has power, but an outlet won't work because a breaker is tripped.\n\n\nEDIT: Call your electrical provider and report an outage. Too many times people assume the company knows or someone else will call. Trust me, these systems are not in top tier shape and it cannot hurt to call their dispatch number found here if you have alliant https://www.alliantenergy.com/accountandbilling/customersupport/helpcenter/outage",
                            "score": 7,
                            "author": "cyclonepsycho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right but I mean Alliant doesn't run these, the City and the university do. I get my electric bill from the city, not from Alliant.",
                                    "score": 5,
                                    "author": "organman91",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Look on your bill for a website or phone number to call in case of an outage. There should be something there or online where you pay your bill",
                                            "score": 3,
                                            "author": "cyclonepsycho",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To be clear, I'm not impacted at present but I did see the lights flicker briefly.",
                                                    "score": 3,
                                                    "author": "organman91"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Most of the electricity on campus comes from the city, not the power plant. It’s cheaper to buy it from the grid than it is to produce it.",
                            "score": 3,
                            "author": "Amesb34r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. As far as I know, ISU's power plant mostly serves to run steam through the tunnels and heat the buildings on campus.",
                                    "score": 3,
                                    "author": "Brobertson69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And it produces the chilled water that is used for air conditioning.",
                                            "score": 2,
                                            "author": "Amesb34r"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard a second pop a few minutes after the first. Is that a bad sign? In the past our power was always back on in a few minutes, but it's been about a half hour now, so I'm curious haha",
                    "score": 2,
                    "author": "expixi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably tried to refuse it, close it in, and the fault is still present. Usually means something a bit more serious is wrong",
                            "score": 2,
                            "author": "cyclonepsycho"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also heard a pop.",
            "score": 8,
            "author": "No-Hold9492"
        },
        {
            "level": 0,
            "comment": "I called the facilities after hours emergency number. The guy said that city power and campus power both have some people here already trying to solve the problem. Hopefully it won't be too long.",
            "score": 9,
            "author": "Captain-Fruit-Punch"
        },
        {
            "level": 0,
            "comment": "Call the number here: https://www.fpm.iastate.edu/utilities/",
            "score": 2,
            "author": "organman91"
        },
        {
            "level": 0,
            "comment": "So that's what that noise was",
            "score": 1,
            "author": "gmvap"
        },
        {
            "level": 0,
            "comment": "Has anyone called the number yet?",
            "score": 1,
            "author": "Bosco-the-Bear",
            "replies": [
                {
                    "level": 1,
                    "comment": "I called the automatic line to report an outage to the city of Ames. Not sure if we have Ames power, Alliant, or university power",
                    "score": 5,
                    "author": "expixi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for calling them! Very much appreciated",
                            "score": 2,
                            "author": "FriendlyCSA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn’t reach anyone",
                    "score": 2,
                    "author": "gramos13"
                }
            ]
        }
    ]
}