{
    "id": "10w2xfm",
    "score": 44,
    "title": "What do these neon signs in State Gym mean?",
    "author": "electrodog10",
    "date": 1675779460.0,
    "url": "https://www.reddit.com/r/iastate/comments/10w2xfm",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/a8hi3wd9zrga1.jpg?width=237&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=431538754fe36a5e57be39fb3907eb61da417448",
        "https://preview.redd.it/dlhyufn8zrga1.jpg?width=1982&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=264ded8485f07d0e63c8203cd424e9d23616a629"
    ],
    "postText": "Never been able to figure it out in my four years here\n\n&amp;#x200B;\n\nhttps://preview.redd.it/a8hi3wd9zrga1.jpg?width=237&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=431538754fe36a5e57be39fb3907eb61da417448\n\nhttps://preview.redd.it/dlhyufn8zrga1.jpg?width=1982&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=264ded8485f07d0e63c8203cd424e9d23616a629",
    "comments": [
        {
            "level": 0,
            "comment": "In short, it's art.\n\nLonger answer, every new building built on campus has a budget for public art installations. for a map of all art on campus you can go here: [https://www.museums.iastate.edu/visit/art-on-campus-collection](https://www.museums.iastate.edu/visit/art-on-campus-collection)\n\nThe neon signs in State Gym are part of an installation called 'A Public Perception' by Terry Allen. For more information on it, check here: [https://publicartarchive.org/art/A-Public-Perception/2eed300c](https://publicartarchive.org/art/A-Public-Perception/2eed300c)",
            "score": 53,
            "author": "puddlehund"
        },
        {
            "level": 0,
            "comment": "Decoration?",
            "score": 6,
            "author": "AJKLPQ"
        },
        {
            "level": 0,
            "comment": "Up until recently (5+ years ago??) public buildings in the state of Iowa had to set put something like 0.5% of a building's cost into public art.",
            "score": 12,
            "author": "technotica",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was so sad when this was repealed. ISUs campus has such amazing art because of that law and now, because it's no longer required, we may slowly see that impact decline. \n\nPublic art is important. You may not like all of it, but it makes a building a place, not just a space.",
                    "score": 5,
                    "author": "m3gan0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah yes, i swear colleges have a fund for purchases like these which they call the \"Give me your money, I know how to spend it better than you\" account. I sometimes wonder how much cheaper tuition would be if colleges actually stuck to their strengths (what students actually like and \"demand\") and didn't waste so many resources on unsuccessful things and stupid purchases.",
            "score": -10,
            "author": "Jmoney1542",
            "replies": [
                {
                    "level": 1,
                    "comment": "This one was decided by your past legislators, they’re the ones to complain to if you don’t like the extra cost. As said above, this was repealed in 2017.",
                    "score": 7,
                    "author": "Diligent_Nectarine"
                },
                {
                    "level": 1,
                    "comment": "It's not public art that causes higher tuition,  it's  funding by the state legislature.\n\nThink of funding of state universities as a three legged chair that supports the mission of the university. The legs of this chair are: state funding, tuition, and research grants.\n\nOver the past 20 years, the state legislature has reduced funding to the universities, just  as they have to K-12, which means that tuition must rise to accommodate the loss.",
                    "score": 4,
                    "author": "puddlehund",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well either way it’s the state rerouting my money to increasingly dumb areas.",
                            "score": -5,
                            "author": "Jmoney1542",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Art on campus has been around for 100 years.\n\nSome of the most iconic places on campus are iconic because of the art. The Grant Wood murals in the library.  The Fountain of the Four Seasons in front of the Memorial Union. The stained glass window in the Gold Star Hall. The Gentle Doctor at Vet Med. \n\n It makes it a better place to be and, maybe, opens the students minds to something greater in the world.",
                                    "score": 8,
                                    "author": "puddlehund"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}