{
    "id": "10w8ush",
    "score": 0,
    "title": "Are any of the university's fees illegal?",
    "author": "yolob212",
    "date": 1675793831.0,
    "url": "https://www.reddit.com/r/iastate/comments/10w8ush",
    "media_urls": [],
    "other_urls": [],
    "postText": "Between professors forcing us to pay for their books so that they profit off of us and using things like Tophat and PackBack which we pay for but staff does not (and it is not disclosed whether professors receive kickbacks for using these services instead of free alternatives), obviously these decisions made by ISU and the staff are unethical, but are any in actual violation of federal or state law and can be stopped?",
    "comments": [
        {
            "level": 0,
            "comment": "Of course not.\n\n^(me is not a lawyer. me just a student)",
            "score": 43,
            "author": "MrRoundJr"
        },
        {
            "level": 0,
            "comment": "Iowa State has clear conflict of interest policy, which you can find here: [https://www.provost.iastate.edu/policies/conflicts-of-interest-and-commitment](https://www.provost.iastate.edu/policies/conflicts-of-interest-and-commitment)\n\nFaculty and staff have to report on a yearly basis potential conflicts of interest.",
            "score": 24,
            "author": "puddlehund"
        },
        {
            "level": 0,
            "comment": "Professors don’t get any kickbacks or profit sharing from the books or any online tools unless they are suing their own book in the class. I use a free ebook for my class as I know most of the students will not read the book again.",
            "score": 14,
            "author": "droidhunger",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my LAS department, before a faculty member can teach their own textbook in a class they have to go through a review committee, have the book approved as appropriate, have to calculate their royalties from sales in that class and donate that amount of money to support a student club. Nobody makes money from using their own book.",
                    "score": 18,
                    "author": "geoffsauer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ages ago, 20 years ago, a few professors tried to get around this by charging royalties on course packets they designed. Not a problem anymore as a) course packets are dead thanks to the internet, b) I think the few that did it got slapped around by the university. \n\nSource- I used the work at Copy Works a long time ago.",
                            "score": 1,
                            "author": "SheltemDragon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously…\n\nProfessors don’t profit from having their books assigned. \n\nAssigning a book written by professor in class is not unethical.\n\nProfessors don’t get kickbacks form any learning services like tophat or perusal or Connect. \n\nImmediate access books with Connect in my department are cheaper than print books (because publishers are not stupid) saving students money. \n\nAll faculty complete an annual conflict of interest disclosure form. University knows of all such relationships.",
            "score": 18,
            "author": "MyHeartIsByTheOcean"
        },
        {
            "level": 0,
            "comment": "You can claim things like Tophat and such during taxes for refund.",
            "score": 4,
            "author": "SweetSauce24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Down bad to an astronomical level",
                    "score": 2,
                    "author": "Jmoney1542",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On TurboTax they ask you if you bought anything extra for school excluding textbooks. Things such as laptops, notebooks, paper, tophat, etc. Things you need to buy not covered by your loan.",
                            "score": 3,
                            "author": "SweetSauce24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to college in the US bud. They tried to make it free but ppl said it was socialism so pay up 😂",
            "score": 12,
            "author": "TheChaosPaladin",
            "replies": [
                {
                    "level": 1,
                    "comment": "College would never be “free”.” You would still pay it in taxes, saying they would ever make it “free” is absurd",
                    "score": 2,
                    "author": "curiousschild",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/iamverysmart",
                            "score": 2,
                            "author": "TheChaosPaladin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unlikely. This is a state university and so they have a massive legal team that find the limits of what they can charge for stuff like this.",
            "score": 7,
            "author": "willboeez"
        },
        {
            "level": 0,
            "comment": "This isn’t like a public high school where there’s free options. It’s a university and they expect you to pay for stuff.",
            "score": 2,
            "author": "IS-2-OP",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I'm well aware of that, and I'm saying that if they want to add these extra costs (tophat, etc) after we're already enrolled, those costs need to be reflected in the advertised cost up front, not sprung on us after it's too late to get out",
                    "score": 1,
                    "author": "yolob212"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is some serious keyboard warrior Ingo before you know the facts. \n\n“Obviously these decisions … are unethical”.  Are they? Or did you just assert that so it *must* be true? That seems like the case for most of this.",
            "score": 1,
            "author": "wolferdoodle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Arbitrarily adding additional costs to the student after the up front price of admission (tuition, room &amp; board, etc.) has been paid while actively choosing not to use alternatives which do not incur additional costs-and doing this in particular against a subset of the population which is far less financially stable-while those choosing to add on this hardship receive no consequence for it is in my opinion, unethical without question.\n\nNow I assume that my standards of ethics are common, as on other topics they tend to be.  Determining a \"true\" set of ethics requires a much deeper dive into the fields of philosophy, anthropology, and ultimately theology which are outside the scope of this thread.\n\nJust to clarify that-I'm not categorically denying the premise of a \"true\" ethical code.  I just don't have enough time on my hands for the discussion that requires.",
                    "score": 1,
                    "author": "yolob212",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Books are/always have been an additional cost. At that, most of the books the profs write themselves are better than normal text books. And besides some faceless corporation, it goes to the prof/a club. Lesser of a two evils. It sucks paying for books but still, it is what it is.",
                            "score": 2,
                            "author": "wolferdoodle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was more or less directing that last comment at the use of things like Tophat, packback, and things of that nature when there are free alternatives or in many cases Canvas has features built right in at no additional cost",
                                    "score": 0,
                                    "author": "yolob212"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On another note, does anyone know what the university fees were before 2021?  My U-Bill is only allowing me to access fees prior to 2021 and I have been here since 2019.  I want to compile University Fees and their increase over time with Grad. student stipends.",
            "score": 1,
            "author": "Battlecatsmastr"
        },
        {
            "level": 0,
            "comment": "One thing is that I think anything you have to pay for has to be listed on the syllabus.",
            "score": 1,
            "author": "drunkstatsguy"
        }
    ]
}