{
    "id": "11ics3l",
    "score": 2,
    "title": "Taking EM 324 over the summer alongside an internship",
    "author": "druskelles",
    "date": 1677962896.0,
    "url": "https://www.reddit.com/r/iastate/comments/11ics3l",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was wondering if anyone has taken this class over the summer and if so, what your thoughts were on doing so. Bonus if you did it alongside an internship/working full time.\n\nI still haven’t officially accepted my internship offer, but regardless if I do or not I still intend on working full-time. I saw that the class would meet everyday and would start the third week of May until the first week of July. This doesn’t sound fun at all of course, but I just need to weigh my options. Any input is appreciated, thanks",
    "comments": [
        {
            "level": 0,
            "comment": "I did it along with working about 30 hours a week. My Mon-Fri typically looked like \n\n- Getting to work around 6am and watching lecture and starting the homework (typically finished the homework)\n\n- Work starting anywhere from 8-10 am until about 4pm\n\n- went home to relax from class or finish the homework\n\n- 7pm was actual class time were you are quizzed over the lecture material\n\nIt's lectures Monday through Friday with an exam every other week. I ended up getting an A and really loved the class, but it can be tough especially when you have friends and family doing stuff over the summer, but I'd do it again.",
            "score": 3,
            "author": "centaree",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hello! I have decided to stick it through and take EM 324 this summer. I had two more questions:\n\n1) Was the homework turned in through the textbook courseware or did you have to submit photos of it and upload it on Canvas? Is it a lot of problems per day or not that much?\n\n2) Are video lectures posted prior to the “actual” lecture time? \n\nJust want to get an idea of what this class is going to look like for me this summer. Thanks!",
                    "score": 1,
                    "author": "druskelles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah its online homework. Some days I got it done in half an hour some days it took me about 4 hours to finish bc of how hard it was. I'd say about an hour and a half was the average maybe a bit more. \n\nYeah you watch the videos and then the lecture is just a quiz",
                            "score": 2,
                            "author": "centaree"
                        }
                    ]
                }
            ]
        }
    ]
}