{
    "id": "11ur8p0",
    "score": 11,
    "title": "What happens to scholarships when you switch your major?",
    "author": "Weird-Kiwi8331",
    "date": 1679152937.0,
    "url": "https://www.reddit.com/r/iastate/comments/11ur8p0",
    "media_urls": [
        "https://i.redd.it/19t4hyes3koa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I originally was going to major in computer science in liberal arts, however I changed to so I will be majoring in software engineering. I can now apply to engineering scholarships, but I know that software engineering has a sort of deal with the liberal arts building. Would I lose this money because it's specific to liberal arts?",
            "score": 11,
            "author": "Weird-Kiwi8331",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I believe so",
                    "score": 11,
                    "author": "biplbopl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ahh",
                            "score": 2,
                            "author": "Weird-Kiwi8331"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When do you see your scholarships?",
            "score": 1,
            "author": "No_Philosophy_6208",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wdym",
                    "score": 1,
                    "author": "Weird-Kiwi8331"
                },
                {
                    "level": 1,
                    "comment": "Different scholarships get announced at different times. Some are already announced, some won't be announced until a month before fall semester starts.",
                    "score": 1,
                    "author": "IowaStateIsopods"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it’s a college specific scholarship, you could lose it if you switch colleges. If you switch from LAS college to Engineering college, you likely will lose any LAS specific scholarships. This is not always the case, but I know people who wouldn’t change their major to a different college because of this. \n\nOne of my friends is considered LAS (does science stuff don’t remember specific major) and has scholarships, and she wanted to switch to Agriculture and Life Sciences for a specific biology degree, but when she discovered she’d lose some scholarships, she decided against it.",
            "score": 1,
            "author": "GroupSubstantial5734"
        },
        {
            "level": 0,
            "comment": "You lose them if they’re tied to a specific college/major. I switched colleges so the scholarship didn’t renew",
            "score": 1,
            "author": "druskelles"
        },
        {
            "level": 0,
            "comment": "i think they stay. i got international merit when i applied to architecture and switched to computer science, they still apply. however i would definitely check with your advisor first",
            "score": 0,
            "author": "bucketassrabbit"
        }
    ]
}