{
    "id": "12h5xlf",
    "score": 132,
    "title": "Course on spectral graph theory running in Fall 2023 taught by Steve Butler",
    "author": "puleshan",
    "date": 1681098043.0,
    "url": "https://www.reddit.com/r/iastate/comments/12h5xlf",
    "media_urls": [
        "https://i.redd.it/hj3o7phy9zsa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This will be my second course in the past six years not in the calculus/differential equations realm (the other one was a course on math of juggling).\n\nThe basic idea is to look at how graphs (which are really the study of connections between objects) can be understood through the use of tools of matrices and their corresponding eigenvalues/eigenvectors.\n\nWhile this is listed as a graduate course; the actual material is accessible to undergraduates who have had some proof based linear algebra course (e.g. MATH 317 or MATH 407), have at least a passing familiarity with graphs (we will fill in a lot of gaps along the way so you don't have to know everything coming in), and are willing to put in a small bit of effort (not too much, just the right amount).\n\nI hope to make it interesting, informative, and even occasionally have some fun.\n\n\\-- Steve Butler",
            "score": 52,
            "author": "puleshan"
        },
        {
            "level": 0,
            "comment": "Will it be on YouTube?",
            "score": 15,
            "author": "Sigh-WhatIsMyLife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. Fun fact, the reason I started posting videos online was for the version of the class I taught in Spring 2017 to help a student take the class remotely.",
                    "score": 34,
                    "author": "puleshan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks intriguing!",
            "score": 7,
            "author": "willboeez"
        },
        {
            "level": 0,
            "comment": "God I love this man",
            "score": 4,
            "author": "epicsmokey"
        }
    ]
}