{
    "id": "12qm63x",
    "score": 17,
    "title": "Help dealing with an injury?",
    "author": "furby_jpg",
    "date": 1681822535.0,
    "url": "https://www.reddit.com/r/iastate/comments/12qm63x",
    "media_urls": [],
    "other_urls": [],
    "postText": "You guys know everything so I am hoping for some good advice.\n\nMy son is a freshman who was in an accident last night breaking his foot. He will be finishing the semester on a mobility scooter with pins in his foot.\n\nHe is concerned about finishing school because he is a good student. I have called his academic advisor, but does the community have any other suggestions for resources or people that may be able to help make sure his professors and others accommodate him after this injury?\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Perhaps have your son contact the Dean of Students, Student Accessibility Services or Student Assistance offices:\n\n* https://sas.dso.iastate.edu/\n* [https://www.studentassistance.dso.iastate.edu/](https://www.studentassistance.dso.iastate.edu/)\n\nThey'll know where to guide him.\n\nSince he's an adult and this is a health matter (HIPPA), he'll probably need to do this himself.",
            "score": 56,
            "author": "imemdr13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good advice to contact Student Accessibility.   \n\n\nAccess to student data is is covered under the Family Educational Rights and Privacy Act (FERPA) and not the Health Insurance Portability and Accountability Act (HIPPA).",
                    "score": 10,
                    "author": "puddlehund",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I was thinking less about academic data and more about the possible medical support materials he might have to get to establish a physical disability for accommodation.",
                            "score": 5,
                            "author": "imemdr13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He will have to gather his information, i.e. doctor's notes explaining what his diagnosis is and what accommodations he can succeed with, and go to an appointment with the center. They have online and in person appointments. There is a bus stop right by the building on the Orange circulator",
                    "score": 1,
                    "author": "Skittles_Owo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was at Iowa State between 2014 and 2018, there is always at least 1 to 2 people on campus every day with these scooters. I would assume he’s going to be fine, especially if he was a good student prior to breaking his foot. It’s just gonna suck a little bit more.",
            "score": 35,
            "author": "Master_Mastadon"
        },
        {
            "level": 0,
            "comment": "Nearly every classroom is accessible for someone in a scooter. Probably every given ADA. In some buildings accessible entrance may be not as obvious. He’s have to go around to find it. What other accommodations is he looking for?",
            "score": 21,
            "author": "MyHeartIsByTheOcean"
        },
        {
            "level": 0,
            "comment": "You are overthinking this. Lots of people break feet at college. It sucks, but is manageable.",
            "score": 18,
            "author": "mandalorianterrapin"
        },
        {
            "level": 0,
            "comment": "His advisor can't tell you anything due to FERPA. They can't even confirm that your son is a student. He needs to contact his advisor and Student Accessibility Services (SAS) for short-term accommodations. \n\nOnce he has those accommodations,  SAS will email all of his professors with them and then he'll have to meet with those professors to talk about how to implement them. For the most part, it would probably just be \"Student can be x minutes late and leave x minutes early without penalty\", but SAS and your son will work together to determine what he needs to succeed while injured.\n\nEdit: FERPA not HIPAA. Whoops.",
            "score": 18,
            "author": "The_Wrenegade",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be FERPA, not HIPPA, and he could also simply try working with his professors first.",
                    "score": 2,
                    "author": "Marrrkkkk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, my bad! He can talk to his professors but SAS is the best route if it will be several weeks.",
                            "score": 1,
                            "author": "The_Wrenegade"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually got ankle surgery last year over spring break. I missed a week of school and was on campus with a scooter for 2 weeks. Have your son reach out to the accommodations office and send in the proper paperwork for his injury. I was able to get an extension for the stuff I missed for the one week, and I got a handicap parking pass to use for the rest of the semester which gave me access to every lot on campus.",
            "score": 6,
            "author": "Rchristians13"
        },
        {
            "level": 0,
            "comment": "It’s not that big of a deal. Just make him scoot around",
            "score": 11,
            "author": "Normal_Ad_5020"
        },
        {
            "level": 0,
            "comment": "I broke my ankle during my freshman year at ISU and had to use crutches to get around for a few months. I’m sure having the scooter will be much more convenient for him. I was able to get a temporary handicap permit so I could park on campus instead of walking/riding the bus. The professors and staff were all super understanding and accommodating. Have him reach out to Student Disability Services with a dr note and they will be able to help with whatever assistance he needs.",
            "score": 3,
            "author": "Nike33"
        },
        {
            "level": 0,
            "comment": "In addition to the other advice given, I'd have him reach out to the Physical Therapy and Sports Medicine group ([https://health.iastate.edu/services/physical-therapy-sports-medicine/](https://health.iastate.edu/services/physical-therapy-sports-medicine/)). As he'll be in a boot for the next 6-8 weeks he'll want to get into PT as soon as possible.  Jim and his group are top-notch.",
            "score": 2,
            "author": "puddlehund"
        },
        {
            "level": 0,
            "comment": "Not sure how he gets around, but when I tore my ACL I got a handicap pass and was able to park closer to classrooms which helped. I was a cyrider before that and the people were always nice. I just talked to my professors about the situation and they always understood. It was also my last semester at Iowa State.",
            "score": 1,
            "author": "CabesHere"
        },
        {
            "level": 0,
            "comment": "When I broke my collarbone, I used the ride service to get around and it was quite nice. It can take a bit of time for a ride, but you can apply for a pass through the university",
            "score": 1,
            "author": "IchaelSoxy"
        }
    ]
}