{
    "id": "1303nhi",
    "score": 5,
    "title": "University Village",
    "author": "Roller_Coaster_Geek",
    "date": 1682552875.0,
    "url": "https://www.reddit.com/r/iastate/comments/1303nhi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm going to be living at UV next semester and I just had a few questions. In the video tour they give it looks like the kitchen is absolutely tiny and there is no microwave as well. Is the video accurate? If so what did you do when living there to combat the small kitchen (I will be living with a roommate). I was also wondering if people are nice in the laundry facilities or if you should stay with your laundry. Back when I was in the dorms we never had problems but my friend who lived in helser said you had to watch your laundry otherwise people would take it out midcycle",
    "comments": [
        {
            "level": 0,
            "comment": "Kitchens are comedically tiny yes, I’ve found it’s the only big drawback of the space in my opinion though. I haven’t really combatted it, I just eat on campus a lot. There’s room for a microwave (not included) and another cooking device like air fryer or something. Stove/oven is also pretty old in most units but functional. \nLaundry facilities are fine, people mostly keep to themselves, and I haven’t had anybody touch my things at all. I’ve never stayed to watch it.",
            "score": 7,
            "author": "Spare_Ad_2255"
        },
        {
            "level": 0,
            "comment": "I’ve lived in UV for three academic years and one summer and am planning on staying for this summer and my senior year as well. I’ve enjoyed living here. Rent is super cheap, the apartments are cozy and have character, it’s generally very quiet, and it’s only a 20-30ish walk to central campus depending on what building you’re going to. CyRide is gold route which is free for non-students as well. Overall a great value for having an apartment as a college student. My experiences with the laundromat have all been positive. I almost always leave it unattended and have never had a problem. In-unit laundry would be preferred, but it’s only 75 cents per load and there are plenty of machines available. I use my toaster oven pretty frequently since it’s quicker than the stove and it uses electricity, which is included in the rent. It is a gas stove and you do have to pay for your monthly gas use. It is a small kitchen, but you get used to it and it’s still very functional.",
            "score": 5,
            "author": "EmHof817"
        },
        {
            "level": 0,
            "comment": "Yea the kitchen is small, especially if you cook a lot (but the sink is deep!, which is a plus for me) no microwave, but people moving out sell them on Facebook market place, so keep an eye out. My stove is actually really powerful and heats fast. I also recommend getting a filter for the sink. (I live around 150s I can taste the pipes 😅) there is a cutting board right above some drawers, but I recommend to just get your own. Also clean before you put anything away, as the drawers when I moved in were nasty. Contact paper works on counters to spruce it up a bit and only leaves a bit of glue residue that can be washed off with soap.\n\nLaundry is fine, but there can be piles of clothes just sitting there on the folding stations. I typically sit for my washing to be done and leave when it's in the dryer. Weekends are always busy, but you can plan for a weekday instead or go really early/late in the day. Hope move in is smooth!",
            "score": 2,
            "author": "just-a-Razzledazzle"
        },
        {
            "level": 0,
            "comment": "Kitchen is small but it isnt too bad sharing it with another person I also have a microwave i brought from home and I think its a great addition and a must have if you plan on using the kitchen alot",
            "score": 1,
            "author": "rayray0978"
        },
        {
            "level": 0,
            "comment": "Buy a bakers rack to take",
            "score": 1,
            "author": "AdCareless7017"
        }
    ]
}