{
    "id": "138xvsc",
    "score": 2,
    "title": "design portfolio",
    "author": "trini-for-the-wini",
    "date": 1683312976.0,
    "url": "https://www.reddit.com/r/iastate/comments/138xvsc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have heard mixed feedback on this, but I’d like to know if a portfolio is required at the end of the CORE program when applying to the desired design major? Specifically wondering for interior design.",
    "comments": [
        {
            "level": 0,
            "comment": "Daughter is ID.  She did have her portfolio but she also had a high GPA so was automatically granted her Major.  This was Covid year though so not sure if anything changed from two years ago.  The portfolio may be more critical if your grades aren’t as strong.  She definitely needed it in her internship interview a few months back.",
            "score": 2,
            "author": "bbh42"
        },
        {
            "level": 0,
            "comment": "3.2 in the minimum gpa(Across the core classes so 131,102, and 183) to get automatic acceptance into most of the programs including Interior.Watch for a Mindy email before the end of the month with details.  I think they ask for you to upload your 5 best works or something. Just make sure you got stuff scanned and watch your email for the form.",
            "score": 2,
            "author": "funkymonkey152"
        },
        {
            "level": 0,
            "comment": "I graduated from the graphic design major, &amp; they required a portfolio, so I can’t speak for interior design specifically. However I remember classmates in my core classes who were wanting to go into interior design had to also make portfolios (this was 2017-2018 school year, so things may have changed). \n\nIf nothing else, someone from the interior design department/ an advisor should be able to tell you :) good luck!",
            "score": 1,
            "author": "theglidermom"
        }
    ]
}