{
    "id": "13j8qqr",
    "score": 10,
    "title": "CS 311 summer session",
    "author": "ShadowKillerx",
    "date": 1684251753.0,
    "url": "https://www.reddit.com/r/iastate/comments/13j8qqr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone taken 311 during the summer before? I was surprised to see it’s taking place in half a summer, is it doable?\n\nI’m just trying to get enough info to set me up for success.",
    "comments": [
        {
            "level": 0,
            "comment": "It'll heavily depend on your professor. \n\nI took it summer of like 2020(?) And it was lead by a grad student. Genuinely so easy, it was like cs227 levels of easy. I put maybe 4 hours a week in, got a B+ and was happy.\n\nThen in 2021 the summer session was taught by the usual professor and it was like 20 hours a week of absolute hell for my friends in it.",
            "score": 8,
            "author": "NewUnusedName",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is good ole Trent, who was your professor?",
                    "score": 1,
                    "author": "ShadowKillerx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't remember, it was a grad student in his last year though I believe so you won't have the same guy :(",
                            "score": 1,
                            "author": "NewUnusedName"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took 311 online last summer, taught by a new faculty member I don’t remember off the top of my head, and it was 100% the way to go. The class had an hour-long lecture everyday around 11am, and weekly or biweekly homework/assignments. I was able to concentrate on that one class by itself, and I think I got more out of it than what I would have during a regular semester.",
            "score": 2,
            "author": "BurningVShadow",
            "replies": [
                {
                    "level": 1,
                    "comment": "That puts my mind at ease, thanks friend!",
                    "score": 1,
                    "author": "ShadowKillerx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Summer school is great. I know nothing about that course however.",
            "score": 1,
            "author": "mcfarmer72"
        }
    ]
}