{
    "id": "13tdshz",
    "score": 11,
    "title": "Laptop for engineering",
    "author": "Matt_787",
    "date": 1685210037.0,
    "url": "https://www.reddit.com/r/iastate/comments/13tdshz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I am a incoming freshman and will need a laptop for engineering next year. Looking between the xps 15 (9530) or the precision 5570. \nThey both have similar specs but I'm wondering which will be better. Also if I go the 5570 route should I have 32 or 16gb of ram?",
    "comments": [
        {
            "level": 0,
            "comment": "Do you have a major picked yet? A lot of engineering majors use MATLAB and the extra RAM will be useful if you want to do anything else simultaneously.\n\nCan you post links to the ones you're looking at?",
            "score": 13,
            "author": "BeardedScott98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I'm majoring in Ag engineering \n\n[9530](https://www.isubookstore.com/Dell-XPS-15-OLED-9530)\n\n[5570](https://www.isubookstore.com/Dell-Precision-5570-32GB-RAM)",
                    "score": 2,
                    "author": "Matt_787",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dont buy from the book store. They purposefully rip you off. Do you have access to a Costco membership? Its even better to buy directly from a manufacturer than the bookstore. These specs aren't even remotely close to what they should be priced at.",
                            "score": 11,
                            "author": "Logicrazy12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Slightly disagree.  Purchase from the bookstore and get the warranty.  They do in house repairs and it's worth a lot.  My son has had to take his there twice.  Once for spilled mountain dew in his key board and they repaired it the same day, no cost.",
                                    "score": 8,
                                    "author": "puddlehund",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guess that is fair. I have a different opinion as I build my own PCs and have the skills to troubleshoot. The peace of mind if something goes wrong and the ease of access can make the price worth it.",
                                            "score": 8,
                                            "author": "Logicrazy12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As someone who worked for the bookstore tech department I can say it's worth it as they have the best repair services in Ames. They can also get you educational discounts on anything on Dell's website so if you're going Dell, it's generally the best deal",
                                                    "score": 7,
                                                    "author": "Roller_Coaster_Geek"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Really? I have access to a sams club, also I thought it was good because they give you a better warranty. \nWhat about buying directly from Dell?",
                                    "score": 1,
                                    "author": "Matt_787",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Here is an example from Costco that is half the price but similar specs (same CPU and GPU only 16gb RAM though instead of 32 but RAM is cheap.)\n\nhttps://www.costco.com/acer-nitro-16%e2%80%9d-gaming-laptop---13th-gen-intel-i7-13700h---geforce-rtx-4050---1200p-165hz.product.4000182788.html\n\nSams club can be good too.",
                                            "score": 2,
                                            "author": "Logicrazy12"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit, spending over $2k on a laptop for engineering is insane. You could get a $200 laptop to run most things you most engineering majors, especially ag engineering. I would imagine they don't do as much/any graphical stuff, so you'd just need a decent processor and RAM. Please tell me you're at least planning on gaming with this too. Otherwise, you're spending like $2k more than you need to run Microsoft Word and whatever coding software ag engineering uses.",
                            "score": 1,
                            "author": "Dogestronaut1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Broskie, have you ever had to run Autodesk products or solidworks on a cheap laptop? It freaking sucks and you can’t hardly do anything in the programs without having some sort of buffer time that locks up the program. Granted fusion 360 has never been good with large files with multiple components. but a good, solid laptop is so worth it. No matter what engineering major you go into I am assuming they will make you use some sort of CAD program. I’m running a Lenovo Thinkpad P15 gen 2 and it is a dream and was built to handle CAD programs. It’s a workstation so it is pretty beefy, but so worth the extra weight. They came out with the P15v gen3 which I would highly recommend looking into (it runs about 1.5k-2.3k depending on how you build it out). I’m personally not a dell fanboy and haven’t had good experiences with them, but Lenovo Thinkpads have  never let me down.",
                                    "score": 3,
                                    "author": "Wooden_Transition402",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can definitely get a gaming laptop for under $1.2k to do it easily. A lot of engineering majors probably don't have to run 3D CAD software that often, and if they do, their major is going to have computer labs set up to run those programs just fine. It also usually wouldn't be until junior/senior classes. I may be wrong, but I don't think that Ag Engineering is going to be doing a bunch of modeling on solidworks. If they are, it would be later in the curriculum, so it's a bit silly to overpay for a laptop now if you aren't going to use the extra hardware until later. Especially since the technology in a laptop will definitely improve within those 2 years.  \nPersonally, I'd rather just have a desktop at home to run the hard stuff, and if I really need to run it on campus, go to a computer lab. If you've got $1.5k-$2.3k burning a hole in your pocket that you really want to throw at an overpriced laptop, more power to ya.",
                                            "score": 3,
                                            "author": "Dogestronaut1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I were just choosing between these two, I'd go for the XPS. OLED is really nice, 13th gen processor vs 12th will provide a small uplift. \n\nHowever, you can find some solid options for $500-1000 less that will work just as well. Best buy has some solid laptops at the $1699 price point.",
                            "score": 1,
                            "author": "BeardedScott98"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d refrain from buying any laptop in that price range right now, the engineering lab have enough computers for you to run with all the essential softwares, it’s also good place to social with other engineering students. \n\nWait until you know what exactly you need before buying it, maybe you would only need a M1 MBA for presentation and entertainment, you can just go to the lab for processing needs. Generally, speaking Precision lines are better quality than XPS, you can also buy refurbished Precision 55X0 from DellRefurbished.com for cheap. RAM as mentioned would not be an issue for the Precision, these are user upgradable, remove the rear panel, plug and play the new RAM. I believe any engineering student should have the capability to do it. \n\nTLDR: save your money use the school computers, spend the money elsewhere: hobby, new shirts and suits for interviews, socializing with other engineering students. If you have to pick, get the Precision",
            "score": 10,
            "author": "Accomplished-Luck680",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point I do have a tower PC that I use for gaming and what not but it's getting old. I still think that would be enough for main workhorse if I needed it",
                    "score": 4,
                    "author": "Matt_787",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you have a tower PC I would just upgrade it as needed. I don't think it's worth getting your own laptop. I ended up using a VM to access most of the computers so I got a cheap computer that just connected to the internet and used the VM resources on campus for all the programs I needed . That's an option too.",
                            "score": 6,
                            "author": "dragonrule029"
                        },
                        {
                            "level": 2,
                            "comment": "There is a lot of money to be spent in college, new computers depreciate every 18 month. You’d better off spend money socializing and figure out if the degree would work for you.",
                            "score": 1,
                            "author": "Accomplished-Luck680"
                        },
                        {
                            "level": 2,
                            "comment": "I personally love my M1 MBA and don’t think any Windows laptops are very competitive for day-to-day use, though I don’t know how the market has changed since I bought it a couple years ago. I’m also in engineering and never found myself needing anything more than my Macbook and my powerful desktop at home. Just my two cents.",
                            "score": 1,
                            "author": "stupidfritz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's interesting that you never needed more than that. I'm not an apple person and never will be but apple has come a long way with their laptops",
                                    "score": 1,
                                    "author": "Matt_787"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the school recommends is totally overkill for anything you will be doing. The most demanding thing will be solidworks. If you want to save money you should buy a cheaper Dell/Asus (any windows laptop really) with an AMD Ryzen cpu or recent Intel chip and upgrade the ram and storage with eBay parts. I’d recommend having 16 gb of ram and 500 gb of storage and you’d be perfect. 2 years ago I did that with my laptop and spent a total of about $500",
            "score": 2,
            "author": "zander0207"
        },
        {
            "level": 0,
            "comment": "I’m in the ag engineering department myself, and I’ve only ever used the computer labs/my own pc. I’ve never actually used my laptop for an assignment.",
            "score": 2,
            "author": "doorknoblol",
            "replies": [
                {
                    "level": 1,
                    "comment": "What software or coding does ag engineering even use? I'm genuinely curious. In aerospace, the hardest thing to run on your own computer was soldiworks. In materials, we haven't really run anything but imagej, and it can literally be run in a browser. I think for any of the engineering majors, any of the harder software to run can easily be accessed from a computer on campus. Most of the time, it seems that's the only way to access it due to licensing. Buying a $2k laptop for ag engineering (or even for aerospace needing to run solidworks) sounds like extreme overkill to me, but I guess I don't know what kind of stuff you guys have to run.",
                    "score": 1,
                    "author": "Dogestronaut1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like before August soon?",
                    "score": 1,
                    "author": "Matt_787"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an electrical engineer I have not needed a good laptop. I do most of the computer demending work in the lab with my partner. The rest can easily be done with a modest laptop.\n\nSave your money and get what you feel comfortable with/want.",
            "score": 1,
            "author": "Revolutionary_Bit_60"
        },
        {
            "level": 0,
            "comment": "What the school recommends is totally overkill for anything you will be doing. The most demanding thing will be solidworks. If you want to save money you should buy a cheaper Dell/Asus (any windows laptop really) with an AMD Ryzen cpu or recent Intel chip and upgrade the ram and storage with eBay parts. I’d recommend having 16 gb of ram and 500 gb of storage and you’d be perfect. 2 years ago I did that with my laptop and spent a total of about $500",
            "score": 1,
            "author": "zander0207"
        },
        {
            "level": 0,
            "comment": "My input for the pile: in general, stay away from Precision or any other “enterprise grade” workstation laptops (Lenovo has a lot of these too) if buying for student/personal use. They are specifically marked up to be low risk investments for companies with a $400,000 annual IT budget. You could likely find a used Precision for a decent deal, but don’t buy computers that are 99% only ever acquired by IT depts. \n\nPersonally I think they’re rip-offs even for some companies that use them. No laptop is super powerful enough to not be slower than a midrange chip that is 3 years newer. By the time you graduate the average freshman with a MacBook Air will have more compute power anyways.",
            "score": 1,
            "author": "Grobfoot"
        },
        {
            "level": 0,
            "comment": "You can find the best deals on https://www.microcenter.com/ that’s where I’ve gotten mine",
            "score": 1,
            "author": "JSwamie"
        },
        {
            "level": 0,
            "comment": "Dont buy from the precision or xps line. Just get an inspiron and upgrade the ram. It'll save you a lot.",
            "score": 1,
            "author": "Acceler01"
        },
        {
            "level": 0,
            "comment": "I’m buying my daughter (an incoming freshman in Engineering) a MacBook Air as something light to drag around to class for note taking and whatnot.  She already has a desktop PC she built a couple years back for running Solidworks (and gaming).",
            "score": 1,
            "author": "john_hascall"
        }
    ]
}