{
    "id": "13zlqpk",
    "score": 4,
    "title": "What is the best dorm? I’m looking for a double but am having trouble choosing a dorm, I originally was planning on east campus but have been hearing good things about west.",
    "author": "Choice_Bid_7401",
    "date": 1685818143.0,
    "url": "https://www.reddit.com/r/iastate/comments/13zlqpk",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Union Drive neighborhood (west side of campus) is an excellent place to live. If you're studying engineering or have lots of classes on the west side, it's especially convenient.\n\nI lived in Helser freshman year. Some say Helser is haunted. Imo, Helser has the best communities. As a general rule of thumb, worse living conditions = better community. Rooms have no AC. Dens (common rooms in each of the hall's 'houses') were air-conditioned. This provided an incentive for people to hang out in the common area.The hall's laundry room is in the basement. Bathrooms are communal and can get a bit gross. I can be a bit of a clean freak sometimes, but I enjoyed my time there anyway.\n\nFriley is one of the biggest dorms in North America. It's basically like Hogwarts. The large common spaces in the basements are referred to as the dungeons.  It's partially air-conditioned. You can get an AC room or cheaper no AC room. From what I've gathered, communities in Friley are less tight than Helser (this is a generalization based on opinions from others). \n\nUnion Drive neighborhood has two pretty decent dining centers: Friley Windows and Union Drive Marketplace (UDM). Friley Windows is conveniently located inside Friley. UDCC (the building containing UDM) also has a convenience store, a fast food restaurant, and a Starbucks.You may get tired of these convenient options by the end of the year. Fortunately, you can take a bus or walk to any other dining centers/cafes on campus.",
            "score": 14,
            "author": "TheOGTortilla",
            "replies": [
                {
                    "level": 1,
                    "comment": "Iv heard really good things about Friley my only problem is I can’t seem to find a open room. Linden seems to be comparable?",
                    "score": 2,
                    "author": "Choice_Bid_7401"
                },
                {
                    "level": 1,
                    "comment": "hey, i am new here and I am an exchange student, not living in the US. I also had to choose a room and i didn't think of, having an ac. Having an AC is not quite common in europa. Could you tell me, how important is it, to have an AC in the US?",
                    "score": 1,
                    "author": "_lanaklanA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Based on what I know of average temps anywhere in Europe, compare an average of 69F (20.5C if I did conversions right), to Ames's average of about 82F (27/28C) based on the averages I could find for around the same time of year. Parts of the US tend to be much hotter than Europe from my understanding so things like AC or at least a fan or two to keep air circulation and cool air coming through, become more of a necessity.",
                            "score": 3,
                            "author": "EzioSnead69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohh thanks for the fast reply!!! \\*-\\* so i will start in isu at fall 2023. so does the temp stay so high in the summer, or did you mean through the year?  \n\n\nso my question would be rather, do i need also an ac in fall? \\^\\^",
                                    "score": 1,
                                    "author": "_lanaklanA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You'll be fine with just a fan, or two. I'm from Illinois and coming back for my 2nd year. My roommate and I managed with just a fan and a clip on for our beds",
                                            "score": 2,
                                            "author": "EzioSnead69"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I lived in Helser in the late 90s and I’m a native Iowan. It can be hot and humid in August and sometimes in September but it’s not unbearable with a fan. It builds character (and characters) as said before.",
                                    "score": 1,
                                    "author": "Diligent_Nectarine"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;As a general rule of thumb, worse living conditions = better community.\n\nPreach, if you aren’t a completely anxiety ridden, introvert. This is the way to have the best experience",
                    "score": 1,
                    "author": "YourStolenCharizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived in Friley back in the 90’s and it was great",
            "score": 2,
            "author": "xandera007"
        },
        {
            "level": 0,
            "comment": "BLF are the best dorms if you want dorms with actual community. Added bonus of nobody randomly pulling the fire alarms because the building is so small everyone would know who did it.",
            "score": 2,
            "author": "pm_me_round_frogs"
        },
        {
            "level": 0,
            "comment": "There is no “best dorm” as each building has its pros &amp; cons. I lived in Geoffroy my freshman year &amp; in Martin my sophomore year. Geoffroy is nice because its newer (built in 2017). Rooms are standard squares &amp; 2 people to a room. Bathrooms are nice because the stall doors go all the way down to the ground so a bit more privacy there. Otherwise its a pretty basic dorm. Activity room on ground floor is where everyone hung out the first month to watch movies &amp; etc. in my experience it was not social after the first month. Nobody kept doors open &amp; i knew nobody on my floor really. Another point is dining centers are far away. Especially in the winter its a pain to have to bundle up &amp; walk 5-7mins to seasons or convos. \nMartin is suite style with a common area entrance &amp; 2 bedrooms (2people each room) &amp; a bathroom for your suitemates. I lived here during covid so it was not social but suite style are generally less social than traditional style. It was a nice dorm but the bedrooms themselves were a bit smaller than geoffroy. Also when you have your own bathroom you clean it yourself, traditional style have communal bathrooms that are cleaned on weekdays.\n\n\nTldr: the “worse” the living situation is, the more social the dorm is. There’s not really a bad dorm.",
            "score": 2,
            "author": "Fizziac"
        },
        {
            "level": 0,
            "comment": "Geoffrey and the one right next to it are nice doubles. The rest of the dorms are okay at best.",
            "score": -2,
            "author": "Substantial-Emu5745"
        }
    ]
}