{
    "id": "142wjls",
    "score": 1,
    "title": "Graduate School Letter of Recs",
    "author": "AwesomArcher8093",
    "date": 1686093273.0,
    "url": "https://www.reddit.com/r/iastate/comments/142wjls",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I’m currently filling out my applications for grad school and several schools ask for Letter of Recs.\n\nSince I haven’t  accessed my iastate email in over a year, what’s the best way to contact faculty and ask them to submit a recommendation?\n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "Do you not have a non ISU/personal email? Can you not just send them an email from your awesomearcher8093@gmail.com or whatever account?",
            "score": 5,
            "author": "transmission",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can I’m just a little worried my email might be sent straight to spam at because I don’t have the @iastate.edu email tag",
                    "score": 4,
                    "author": "AwesomArcher8093",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They shouldn’t automatically go to spam if not sent from an ISU email, or at least I haven’t encountered this issue. However, I’d make sure to indicate the deadline and expectations, definitely ask with plenty of time (and be prepared to remind them when it’s due in the near future).",
                            "score": 3,
                            "author": "musicalmud"
                        },
                        {
                            "level": 2,
                            "comment": "That makes zero sense. We receive emails every day from non ISU email domains.",
                            "score": 1,
                            "author": "transmission"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated in ‘22 with my degree in biology and just accepted my admission to grad school (masters). I was able to email my recommenders with gmail with no issues. \n\nIf you have problems, try calling their office numbers. Or, if you have that type of relationship, text them and ask.",
            "score": 3,
            "author": "haileyamc"
        },
        {
            "level": 0,
            "comment": "You can look up staff contact info on the ISU website. But judging from the fact that you didn’t know that I’d advise saving your time and not applying to grad school.",
            "score": -11,
            "author": "doctorbeans27"
        }
    ]
}