{
    "id": "ie9miq",
    "score": 418,
    "title": "wendy takes the wheel",
    "author": "robreinhard",
    "date": 1598059584.0,
    "url": "https://www.reddit.com/r/iastate/comments/ie9miq",
    "media_urls": [
        "https://v.redd.it/ut0plua1igi51"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Atlantic was prophetic.",
            "score": 31,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is the quality of meme I stick around on reddit for",
            "score": 38,
            "author": "CMPD2K"
        },
        {
            "level": 0,
            "comment": "Don’t agree, but still laughed and upvoted",
            "score": 66,
            "author": "afterschoolsnacks19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Out of curiosity, why do you disagree",
                    "score": 20,
                    "author": "IchaelSoxy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because the gatherings of people on 801 day were horrifying. The lack of care about the disease is insane and embarrassing. ISU was embarrassed on national television. That's why the new policies were created, not 50% of ticket holders at the football games, not students wearing masks at destination Iowa State or the small gatherings of socially distanced students wearing masks at the cyclone cinema, but hundreds of students throughout the city standing shoulder to shoulder playing Cornhole saying \"yeah, I believe the disease is a hoax\" and \"I don't care, only old people die\".  \n\n\nIn fact, any of the things made fun of in this meme could still be done with the new policies in place. What can't you do? Attend large parties and get drunk, boohoo. No one should be complaining about these new policies. Grow up. Not partying for 6 more months won't kill you, covid could. Sure, statistics show it probably won't, I'm currently self-isolating while asymptomatic, but you know what large outbreaks will do? Shut down the campus. I don't think anyone wants that...\n\nI'm not trying to flame you or anything, but I have no respect for people who don't give two shits about the disease and prioritize having fun and their social life over academics and safety.",
                            "score": 115,
                            "author": "EclipticMind",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol 100% agree with this all being a PR stunt.  The only reason anything is being done is because it hit the national news",
                                    "score": 5,
                                    "author": "Patrick625"
                                },
                                {
                                    "level": 3,
                                    "comment": "But she should’ve placed these policies before 801 and had a talk with the frats about removing funds and getting them in trouble if they did 801. She closed the ranch after the horses escaped, so that was irresponsible of her part.",
                                    "score": 6,
                                    "author": "despacito4206669",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100% true. It was not smart to think 801 wouldn't happen and I still think that the only reason these new rules went into place, at least this soon, was because a smart reporter from CNN knew what 801 day was and decided to do a report on it. \n\nThe horses might have escaped, but the bison, cattle, and pigs are still here.",
                                            "score": 5,
                                            "author": "EclipticMind"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;But she should’ve placed these policies before 801 and had a talk with the frats about removing funds and getting them in trouble if they did 801.\n\nYou realize that talk with the frats just wouldn't have affected a thing right? It is a day the entire university knows about, as well as most colleges within a couple hours of here.",
                                            "score": 1,
                                            "author": "Move_Weight"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Brilliant—this is all the truth; I might site your words to other people; you do a perfect job giving every detail",
                                    "score": 19,
                                    "author": "SnooCrickets9339",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's missing the forest for the trees.  It's three paragraphs saying people who party in the middle of a pandemic are irresponsible.  True!  How do we prevent this?  Having vague, basically unenforceable university policies isn't it.",
                                            "score": 6,
                                            "author": "SouthTriceJack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I would hardly say the new policies are unenforceable. An ISU PD Officer could stroll up to a party and just start taking names, right?\n\nVague? 6-ft separation and mask wearing has been preached from the mountain tops since March, I don't think it's too hard to understand what \"Covid safety guidelines\" refers to.\n\nI highly doubt we will hear about small gatherings of friends without masks getting suspended, but ISU does however, now have a way of stopping or more precisely of deincentivizing large frat and house parties even though they are technically legal.",
                                                    "score": -1,
                                                    "author": "EclipticMind",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Vague? 6-ft separation and mask wearing has been preached from the mountain tops since March\n\nActually the cdc and who were saying masks do nothing in march.\n\n&gt;deincentivizing large frat and house parties even though they are technically legal.\n\nright, but frats can just have non sanctioned parties at peoples houses.  And this does nothing for gdi parties.\n\nThe vague part is the isu email doesn't constitute what seperates a \"large\" party from a \"not large\" one, they don't say what the punishment will be for violators(they allude to suspending, but it's highly unlikely that they're going to suspend thousands of students).  They don't say how it will be enforced.  Many campus events are mostly business as usual (with mandated masks, but masks aren't not some magical forcefield, they help somewhat).\n\nThe reason they decided to have in person classes was purely monetary.  They were worried students were more likely to enroll in community college/ have a gap year if it was purely online learning.  This is all about money at the end of the day.",
                                                            "score": 0,
                                                            "author": "SouthTriceJack",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Unless I read it incorrectly, I don't remember there being a punishment difference for large or small gatherings. I would just assume it's only worth their time to go for large ones.\n\nReferring to your suspension comment. The hometown that I am from has a college and just a few days ago 17 students were suspended for partying during covid. I don't think it's as unlikely as you think. News reports about covid parties = negative press. ISU taking a stand and suspending rule breakers to make a safer campus = positive press.",
                                                                    "score": -3,
                                                                    "author": "EclipticMind",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "isu is going to have to suspend thousands of people.  How big is this college in your hometown?",
                                                                            "score": 1,
                                                                            "author": "SouthTriceJack",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not that big. At all. That's a good point.",
                                                                                    "score": 1,
                                                                                    "author": "EclipticMind"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn't say I disagreed with you, I just wanted to hear your perspective. I personally have fully online classes already and I also think that, no matter what the students do, ISU will send everyone home after payments are finalized.",
                                    "score": 6,
                                    "author": "IchaelSoxy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not the OP btw,. Nothing against you, I just saw it as an opportunity to say my opinion about this post.",
                                            "score": 1,
                                            "author": "EclipticMind",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's fine, I just felt attacked because you used \"you\" inferring that it was directed at me.",
                                                    "score": 1,
                                                    "author": "IchaelSoxy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was trying clarify that I wasn't trying to flame you personally, but on party goers in general, sorry about the confusion.",
                                                            "score": 1,
                                                            "author": "EclipticMind"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wendy made the decision to have in person classes.  Without that, these parties would not happen.  Do you:\n\n1. Count on 36k+ students to each individually make the decision to sacrifice and each behave responsibly, when even 10% percent of students NOT doing that will create massive problems.\n2. Have online classes.\n\nPretty black and white.  Don't blame 18-22 year old barely functioning alcoholics for not making the public health conscience decision.  Blame the administration that ever thought they would.  \n\nBeing a very affordable state university with lax admission requirements means we get a lot of tards at ISU.",
                                    "score": 0,
                                    "author": "SouthTriceJack"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ok I agree, but then why is Iowa state allowing after dark to happen? That event is very popular and even if they don’t allow people at the door, it still ignores the fact that there will be a large group of people, regardless if they are wearing masks.",
                                    "score": 1,
                                    "author": "TheBigMaackk"
                                },
                                {
                                    "level": 3,
                                    "comment": "I disagree. The thing is, people are going to be people. It’s naive to assume that because the school is asking, people will not party. They need to assume that people WILL indeed be partying, will be going good out, and plan accordingly. That could look like way more testing, perhaps all online classes, or even sending dorm people home.",
                                    "score": 1,
                                    "author": "bgibbz084"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck it you get silver too",
            "score": 9,
            "author": "imabeerye"
        },
        {
            "level": 0,
            "comment": "Brilliant in its simplicity",
            "score": 14,
            "author": "SouthTriceJack"
        },
        {
            "level": 0,
            "comment": "Although they are still having some events, I think that Wendy is actually trying her best to keep students on campus, unlike some schools where they just gave up after a week (UNC).",
            "score": 29,
            "author": "jay__p_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do not agree, she’s only placing these policies because ISU got embarrassed. She acted too late and it was pretty obvious that events like 801 were going to happen (Barstool ISU constantly posting about it etc.)",
                    "score": 12,
                    "author": "despacito4206669",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I get that. Obviously they knew that 8:01 day was coming. They should have been more proactive.",
                            "score": 3,
                            "author": "jay__p_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What song is that soundtrack the intro to, again?",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tokyo Drift",
                    "score": 8,
                    "author": "Saint_Genghis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I knew it was from a Fast and Furious movie but I couldn't remember which one exactly.",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " [https://www.youtube.com/watch?v=dQw4w9WgXcQ](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
                    "score": -1,
                    "author": "acemanian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://tenor.com/view/tommy-look-tak-alook-newspaper-reading-gif-5986427",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Quality content",
            "score": 5,
            "author": "Busch__Latte"
        },
        {
            "level": 0,
            "comment": "I mean, why shouldn't the students be blamed? If you go to a bar/football game/gathering and don't distance or wear a mask, you are the problem. You can limit capacities and events all you want, but at the end of the day it still comes down to individuals being smart enough to do the right thing.\n\nISU is a university, not a daycare. Students are responsible for their own actions. \n\n^^it ^^was ^^a ^^nice ^^meme ^^tho...",
            "score": 7,
            "author": "thewonderfulwiz"
        },
        {
            "level": 0,
            "comment": "Man move the posts so I can see the drifto.",
            "score": 1,
            "author": "Builder1094"
        },
        {
            "level": 0,
            "comment": "Ok I love preacher Lawson, but why was after dark given permission to continue?",
            "score": 1,
            "author": "TheBigMaackk"
        },
        {
            "level": 0,
            "comment": "Wendy do you want my addy ?",
            "score": 0,
            "author": "Sir_Oscie"
        },
        {
            "level": 0,
            "comment": "u/Vredditdownloader",
            "score": 1,
            "author": "Gimmeguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "*beep. boop.* 🤖 I'm a bot that helps downloading videos \n###[Download via reddit.tube](https://reddit.tube/d/CNwCelv?t=1598067803)\n\nIf I don't reply to a comment, send me the link [per message.](https://np.reddit.com/message/compose?to=VredditDownloader&amp;subject=Download&amp;message=Put%20your%20reddit%20video%20link%20here%20and%20click%20send%20)\n\n[Download more videos from iastate](https://www.reddit.tube/category/iastate)\n\n ***  \n[Info](https://np.reddit.com/user/VredditDownloader/comments/cju1dg/info/)&amp;#32;|&amp;#32;[Contact&amp;#32;creator](https://np.reddit.com/message/compose?to=-botbert)&amp;#32;|&amp;#32;[Donate](https://www.paypal.me/synapsensalat/5)",
                    "score": 3,
                    "author": "VredditDownloader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First",
            "score": -7,
            "author": "sohtrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fourth",
                    "score": 7,
                    "author": "pacmain1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stephen Leath wouldn’t have allowed this",
            "score": -5,
            "author": "PapaNudies"
        }
    ]
}