{
    "id": "k2954j",
    "score": 427,
    "title": "HORNS DOWN HORNS DOWN HORNS DOOOOOWN",
    "author": "[deleted]",
    "date": 1606509379.0,
    "url": "https://www.reddit.com/r/iastate/comments/k2954j",
    "media_urls": [],
    "other_urls": [],
    "postText": "HORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWNHORNS DOWN HORNS DOWN HORNS DOOOOOWN",
    "comments": [
        {
            "level": 0,
            "comment": "Thank God that wasn't on the Longhorn Network",
            "score": 127,
            "author": "MahjongDaily",
            "replies": [
                {
                    "level": 1,
                    "comment": "FUCK THE LONGHORN NETWORK. ALL MY HOMIES HATE THE LONGHORN NETWORK.",
                    "score": 146,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Sure sounded like it was, what with the announcers sucking Ehlinger off 👀👀",
                    "score": 31,
                    "author": "phiiscool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No shit! Worst announcers ever.",
                            "score": 8,
                            "author": "PotentialFull4560"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mike Golic Jr. might as well have been on LHN...also the show beforehand \"The View\" (lulz) had Emmanuel Acho on it (former Longhorn player) leading into the start of game.",
                    "score": 1,
                    "author": "sinkdawg04"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry can you repeat that, I didn't quite get it.",
            "score": 84,
            "author": "YoYouMadMadmike",
            "replies": [
                {
                    "level": 1,
                    "comment": "##**HORNS DOWN HORNS DOWN HORNS DOOOOOWN**",
                    "score": 93,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck Texas 🤘⬇️ Roll Clones🌪🌪",
            "score": 67,
            "author": "Fire_tiger223",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tuck Fexas 🤘🤘🤘 Coll Rlones 🌪 IOWA ALL DAY",
                    "score": 11,
                    "author": "KimJongIllyasova"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ROLL CLONES BABYYYY",
            "score": 84,
            "author": "sohtrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Roll Cajun",
                    "score": -80,
                    "author": "McNasty51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Roll ya mum",
                            "score": 16,
                            "author": "vmilla2019"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "#HORNS DOWN MUTHERFUCKERS",
            "score": 30,
            "author": "VoluptuousVelvetfish"
        },
        {
            "level": 0,
            "comment": "Amazing win. For the rest of the afternoon, I'll also be rooting for the Huskers of Corn",
            "score": 62,
            "author": "Fourty8Seventy6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Corn is king",
                    "score": 25,
                    "author": "adeick8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Noob Question: is qualification for the Big 12 Championship game based on conference record or on record in all games? Either way we’re gonna be in but just curious",
            "score": 16,
            "author": "h1gh_0n_0xycl34n",
            "replies": [
                {
                    "level": 1,
                    "comment": "Conference record",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, that’s what I always thought. I was reading the Big 12 website on tiebreakers today and it was really poorly worded and made it sound like all games counted.",
                            "score": 5,
                            "author": "h1gh_0n_0xycl34n",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah IIRC the tiebreakers would be head to head record, so we would beat out both OU and Texas in that case since we beat both of them, and I think the next one after that is point differential or something like that.",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The thing that was really poorly worded on that site was that the first tiebreaker for a 3 or more team tie is that “The Conference records of the three or more teams will be compared against each other in a “mini round-robin” format”, which implies that the conference record would be used in a tiebreaker among teams that tied by having the same conference record, which would just produce another tie and therefore be a pointless tiebreaker.",
                                            "score": 3,
                                            "author": "h1gh_0n_0xycl34n",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m guessing that what they meant to say is that each team’s record among the tied teams would be compared, but it just straight up says the conference records would be compared",
                                                    "score": 3,
                                                    "author": "h1gh_0n_0xycl34n"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YESSIR PUSH THEM HORNS DOWN",
            "score": 9,
            "author": "thecoolchicken18"
        },
        {
            "level": 0,
            "comment": "SUCK IT TEXAS!!!",
            "score": 6,
            "author": "isubucks"
        },
        {
            "level": 0,
            "comment": "I still don’t believe it.",
            "score": 3,
            "author": "denimpanzer"
        },
        {
            "level": 0,
            "comment": "Anyone see how many times Ehlinger locked his fingers? I am counting on high covid transfer",
            "score": 2,
            "author": "mdorlz"
        }
    ]
}