{
    "id": "zehpo2",
    "score": 20,
    "title": "How does MATH 151 compare in difficulty to MATH 150? (Had to put a picture because it wouldn’t let me post otherwise.)",
    "author": "wnootwy",
    "date": 1670359870.0,
    "url": "https://www.reddit.com/r/iastate/comments/zehpo2",
    "media_urls": [
        "https://i.redd.it/35h4r6khtd4a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A mildly amusing story regarding 150 vs. 151, and this was 25 years ago, so grain of salt.  I took 150 and got a D-.  It was my first semester and I really didn't apply myself.  I then took 151 and did pretty well, probably a B+.  When I was in my last semester as a senior, I had a fairly light load, so I thought I try to retake 150 and improve that GPA, especially since I did well in 151.  I retook 150 and got a D- again.  I just couldn't figure it out, but in my mind they were completely different.  Obviously I didn't need to take much from 150 to do well in 151.  Again, this was a long time ago, so things have probably changed.",
            "score": 21,
            "author": "flynnhicks03"
        },
        {
            "level": 0,
            "comment": "I’m in 151 right now. Had absolutely no prior experience with calculus and I’m struggling a lot and so is majority of the class",
            "score": 12,
            "author": "7blackgoldies"
        },
        {
            "level": 0,
            "comment": "Well, it’s obviously 1 more difficult. Since you couldn’t figure that out, you may need to take Math 150 (or re-take it as the case may be)",
            "score": 47,
            "author": "MrTick"
        },
        {
            "level": 0,
            "comment": "If you are not seeing your post show up, please message the mods and we can approve it, sometimes the spam filter is dumb. OP. I am not seeing a previous post in the modqueue, so either it never posted successfully or it was deleted.",
            "score": 8,
            "author": "organman91"
        },
        {
            "level": 0,
            "comment": "I did MATH 150 at community college and MATH 151 at Iowa State. I didn’t take calculus in high school. I’d say 151 got a little challenging towards the end but it wasn’t too bad. I got an A with the curve. \n\nMake sure you go to recitation and pay attention. My TA was way better at explaining concepts and working through examples than my professor. My TA also had office hours. Seek help early if you don’t understand. All the concepts build on top of each other. They also offered peer study groups, supplement instruction, etc. There’s a lot of resources available. Also doesn’t hurt to make friends with some engineers.",
            "score": 5,
            "author": "ashwood7"
        },
        {
            "level": 0,
            "comment": "Your success in 151 relies heavily on previous calc experience. I had no previous calc experience and barely passed, but friends who took AP calc in high school, for example, got by just fine. You will want to prepare for 151 exams and don't get behind on the material. Like any class, don't be afraid to utilize office hours or SI sessions. Don't plan on floating through the class, the people that succeeded either earned it by studying the material or had previously taken calc and were comfortable with the material.\n\nEdit: My best advice is to take it online through a community college if you anticipate it will be a challenge.",
            "score": 5,
            "author": "drab_handkerchief"
        },
        {
            "level": 0,
            "comment": "Significantly more difficult but both are quite easy as far as college math courses go",
            "score": 13,
            "author": "ChigBungus22",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s calculus- it’s not easy…",
                    "score": -8,
                    "author": "7blackgoldies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As far as college courses go it is.",
                            "score": 11,
                            "author": "Aboelter23"
                        },
                        {
                            "level": 2,
                            "comment": "Sorry to tell you, but this is an engineering school, so someone saying Calc is easy is not surprising",
                            "score": 11,
                            "author": "Fabio101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Math 150 is a easy B+/A- if taken online \n\nMath 151 was hell. had to retake it just to get a C+\n\nso to the SI sessions, it will payoff\n\nthis was in 2013",
            "score": 3,
            "author": "HungerForHipHop"
        },
        {
            "level": 0,
            "comment": "Isnt tbat a Calc class? And 150 isn’t right? So it’ll be hard for you probably yes. But understand the concepts theory and that’ll help a lot.",
            "score": 2,
            "author": "IS-2-OP"
        },
        {
            "level": 0,
            "comment": "I did 150 here at ISU. I got a D and I swore that I wasn’t taking 151 here. I took it at DMACC in the summer and that was the best decision of my life. It was online, the professor was acc helpful, you’d email him to get help and he would send the full working and the answer sometimes. I got an A-. Now I know it doesn’t affect your gpa or whatever but I was just glad to get it over with.",
            "score": 2,
            "author": "Certain_Attorney_608",
            "replies": [
                {
                    "level": 1,
                    "comment": "How does it not affect your gpa?",
                    "score": 1,
                    "author": "DarkKnight56722",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because only the credit of the class transfers, not the grade. As long as you pass the class.",
                            "score": 1,
                            "author": "Certain_Attorney_608"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Advisor",
            "score": 1,
            "author": "Oohhloverboy"
        },
        {
            "level": 0,
            "comment": "Took it five years ago with 0 calc experience I passed with a C the class was brutal though. I remember getting a 35% on one of the tests after that I got a tutor they are cheap like only 5 dollars a lesson back then anyways I still never got a passing grade on a test but I made sure I’d get perfects on my homework back then you could do a question as many times as you wanted. Not sure if it’s still that way. I think I passed the class with a 60% curved to a C at the end. I’d say it comes down to hard work and dedication school wasn’t my priority If I were to take it again I think I would do better even without doing calc for years I just have more work ethic than before.",
            "score": 1,
            "author": "asshatcharlie"
        },
        {
            "level": 0,
            "comment": "It's 1 more harder",
            "score": 1,
            "author": "RedmondBob"
        }
    ]
}