{
    "id": "5836fr",
    "score": 2,
    "title": "\"Please Briefly Elaborate on one of your Extracurricular activities\"?",
    "author": "hiimaa",
    "date": 1476788760.0,
    "url": "https://www.reddit.com/r/GetIntoStanford/comments/5836fr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does it have to be one of the activities that I've but on the common app? It's Stanford and my goal is to stand out and show them my authenticity. I have a few extracurriculars on the common app I can do that with. HOWEVER, there's one adventurous hobby that I'd like to put that is specific to the person I am today. I don't necessarily want to use it for any other essay.\n\nWhat do you guys think of talking about an activity not on the \"activities\" section of the Common App? Am I just being stupid?",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; What do you guys think of talking about an activity not on the \"activities\" section of the Common App? \n\nThat's completely fine, no-one will bat an eye. Though if it's a hobby you care about, why not list in the ECs section, too? (No big deal if you don't just curious of the reasoning)\n\n&gt; Am I just being stupid?\n\nNo, at least you're asking questions, which is more than many people do",
            "score": 1,
            "author": "129183-stan-ps",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's like a qwerky hobby of mine it's not really an \"extracurricular.\"\n\nI'm contemplating between writing something on that hobby and linking it to my \"seeker of the unknown trait\" or writing about the business I founded. I've already wrote the latter and focused not about the success of the business, but instead my attitudes, thought process, and growth from it. But I feel like it's not that cool as there are most likely other applications with more successful businesses that mine. Let me know what you think!",
                    "score": 1,
                    "author": "hiimaa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; extracurricular\n\nI think ECs can include hobbies. I view it as things outside of school work.\n\nMy general advice: Write out both essays, show them to people who don't know you very well (e.g. parents friends), ask them to rank the essays on 1) most interesting 2) person most likely to have a wikipedia page, etc.",
                            "score": 1,
                            "author": "129183-stan-ps"
                        }
                    ]
                }
            ]
        }
    ]
}