{
    "id": "5ccp6a",
    "score": 2,
    "title": "Update admissions office before March Decision release Date",
    "author": "collegethroaway12",
    "date": 1478839887.0,
    "url": "https://www.reddit.com/r/GetIntoStanford/comments/5ccp6a",
    "media_urls": [],
    "other_urls": [],
    "postText": "Before the decisions are released in march, could you update the admissions office with any new accomplishments? \n\nWhen is the last deadline for this? ",
    "comments": [
        {
            "level": 0,
            "comment": "/u/129183-stan-ps\n",
            "score": 1,
            "author": "collegethroaway12"
        },
        {
            "level": 0,
            "comment": "Are you saying for regular decision? Bc when I applied early deadline was early nov and decisions dec 15 or so, and regular was jan 1 or something and decisions in march or april or something..\n\nso I'm confused -- are you saying for a regular decision application, and sending in extra info later?\n\nassuming that's the case -- sure, but probably not worth it unless they are substantial enough that you could see an officer just knowing that one specific thing having a compelling case for your acceptance\n\nremember accomplishments are important but many accomplished people get rejected. maybe if you sold a company for $10mm+ that would warrant serious consideration just on the merit of the achievement or something like that, but mostly seems unlikely to impact",
            "score": 1,
            "author": "129183-stan-ps",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm asking about sending in extra info later before march decision. Updating the admissions office. \n\n&gt;but probably not worth it unless they are substantial enough that you could see an officer just knowing that one specific thing having a compelling case for your acceptance\n\nCould you give an example of something that could give you more consideration? Other than a 10mm company. \n\nLike what if you made a website, that gained 1000s of members in few months? \n\n&gt;remember accomplishments are important but many accomplished people get rejected.\n\nI'm still curious why. People with accomplishments already demonstrated passion, determination, creativity with these accomplishments. I don't know what else colleges are looking for. \n\n&gt;maybe if you sold a company for $10mm+ that would warrant serious consideration just on the merit of the achievement or something like that\n\nIf someone has done this, then I don't know if they really need to go to college. They've already accomplished something that 99% of people will never do. They already have capabilities to start something even bigger. They probably wouldn't want to spend 4 yrs at college, when they could be doing something else. ",
                    "score": 1,
                    "author": "collegethroaway12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Like what if you made a website, that gained 1000s of members in few months?\n\nI mean probably not. But thinking about it, as long as you don't do it in an obnoxious way, I can't see it hurting and only see possibility of it helping and them thinking hmm ok this kid really is eager (which is good)\n\n&gt; I'm still curious why. People with accomplishments already demonstrated passion, determination, creativity with these accomplishments. I don't know what else colleges are looking for.\n\nI mean I suppose it depends on the accomplishment. Some accomplishments are obviously thoughtful, authentic etc. Others I and admission officers look at them and the assumption is \"ok cool they are doing this and probably haven't given it a second of thought and basically don't think for themselves\"\n\n&gt; If someone has done this, then I don't know if they really need to go to college. They've already accomplished something that 99% of people will never do. They already have capabilities to start something even bigger. They probably wouldn't want to spend 4 yrs at college, when they could be doing something else.\n\nI strongly believe that if someone had done this they would get INSANE value from spending 1-2 yrs at Stanford. Invaluable. The degree sure wouldn't make a difference but the people they'll meet in the first 1-2 yrs absolutely will",
                            "score": 2,
                            "author": "129183-stan-ps"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can but I think in general try not to waste the admission officers time. If the accomplishment is a big big deal then yes, otherwise no.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}