{
    "id": "5l0r6e",
    "score": 2,
    "title": "Opinions on ideas for IV essays?",
    "author": "Optimistic_Mute",
    "date": 1483062550.0,
    "url": "https://www.reddit.com/r/GetIntoStanford/comments/5l0r6e",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm stuck on for my intellectual vitality essay because I have two ideas that I want to write about.\n\nOn one hand, I want to write on how disability/mental illness has impacted my view of learning for the better and why I have chosen to continue my education despite setbacks. I feel like this one is more abstract and I could make it show why I love learning for learning's sake. I wrote something similar to this for my UC apps and the people who I showed it to loved it because it revealed a different side of me. \n\nOn the other hand, I feel like the question might be asking for something a little more concrete. Like a talent or hobby that I pursue because it brings me joy. I could write about why I learned sign language and my experiences tutoring in the subject. However, I feel as if it could come off as mundane and not as personal.\n\nSince it's only 250 words I suppose I could write both and then choose the one I like best, but I would like a second opinion. Which one would both answer the prompt and be interesting to read?",
    "comments": [
        {
            "level": 0,
            "comment": "My take on the intellectual vitality prompt is that it's fairly abstract.\nSomehow, you want to demonstrate you just love learning.\nThe way I did it was by discussing the difference between Stanford and the Universities back home (New Zealand/Australia) in regards to the structure of the degree (ability to study a broad range of things at Stanford), and for me the whole essay was an extended metaphor on skittles (random ik).\nI got accepted REA.\nI think you need to think about what best demonstrates your love of learning and your love of bettering yourself (if this is the truth).  Ideally, you could showcase another side of yourself, but my take on the application process is building a consistent and true picture of yourself to the admissions officers.  They'll see through the bullshit etc.  Have a think about it from this point of view, and if that doesn't clear it up, send me a PM :).",
            "score": 3,
            "author": "ThisWorldOfEpicness",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the feedback! I think I'm pretty set on the more abstract one because it is consistent with what I wrote about for my common app. I just need to find a way to make it work with the word limit. I've started on it but it feels like I'm rushing in order to stay under the word limit and not really conveying the message that I want to put out. ",
                    "score": 2,
                    "author": "Optimistic_Mute",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, my first few drafts felt like that too, but effective editing will solve the problem",
                            "score": 2,
                            "author": "ThisWorldOfEpicness"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "+1",
                    "score": 2,
                    "author": "129183-stan-ps"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My opinion doesn't really matter, I haven't gotten in or I don't work there, but I *love* the first prompt. I feel that if it was well-written it could be amazing! Good luck.",
            "score": 1,
            "author": "wootweetwoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Your feedback is greatly appreciated! I'm liking the first one better myself. I just didn't know if it answered the question. Then again, they leave these prompts so open-ended that one could write about almost anything.",
                    "score": 1,
                    "author": "Optimistic_Mute"
                }
            ]
        }
    ]
}