{
    "id": "5u3gh0",
    "score": 4,
    "title": "Subpar achievements, but stellar essays?",
    "author": "[deleted]",
    "date": 1487110683.0,
    "url": "https://www.reddit.com/r/GetIntoStanford/comments/5u3gh0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently a Junior determined as fuck to go to Stanford for its wondrous weather, location for startups, and general laid-back-but-still-fucking-smart student culture. \n\nHowever, I've been reading a lot of the recommended guides and articles, and all the authors and examples have achieved so much and so highly. Examples being: app being featured by the App Store, attaining a paid internship/job at a legitimate company, attending WWDC conferences, etc. \n\nMe? Not so much. I've made a few sites which I'm pretty proud of in terms of design, and I've won a few awards in debate, attended a couple competitions in public speaking and related stuff, and did fairly well in them. Nothing *so* poor, but nothing mind-blowing either.\n\nThing is, I have what I consider an extremely unique story and fairly unique background, along with a knack for words and the ability to have my voice shine through whatever I write. \n\nMy unique story is that I essentially developed myself to the person I am today through watching self-improvement/development videos on YouTube since middle school, reading articles on social dynamics, meditation, taking action in your life, etc. I used to be this shy-ass, scrawny kid who couldn't look the cashier at McDonalds in the eyes. But through watching these videos, and reading these articles, I taught myself the intricacies of social dynamics, the principles of success, and how to overall be happy. When/if I attend college, I will be a first-generation student, and have also only lived in the U.S. for five years, having grown up in Australia for the past ten, and South Korea for the first two.\n\nWhat are your guys' thoughts? If I authentically tell my story in vivid colors, could it outshine my rather subpar achievements compared to the majority of qualified students? I still plan on applying, of course, but I've just been getting kind of worried and wanted some outside input, especially from like-minded individuals on this subreddit.\n\nThanks for the consideration if you made it this far.\n\n**TL;DR:** I have a fairly unique background and story through which I know I can effectively communicate all the good traits Stanford wants in an applicant (intellectual vitality, initiative, multi-dimensionality, general interesting-ness), however my achievements are subpar. Do I still stand a reasonable chance?",
    "comments": [
        {
            "level": 0,
            "comment": "You're a junior - you've got some time to do some cool shit.  Find an idea over the summer and go at it hard, dude.  Never know what might happen.",
            "score": 3,
            "author": "ThisWorldOfEpicness"
        },
        {
            "level": 0,
            "comment": "/u/129183-stan-ps",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "&gt; Do I still stand a reasonable chance?\n\nYes, you definitely can. I've seen examples of applicants who demonstrated excellent fit for Stanford + showed them as interesting, valuable, high-potential people + wrote excellently about compelling experiences and stories even w/ less awesome achievements. Not every Stanford has insane achievements. Look at this video: https://www.youtube.com/watch?v=2T4cjJYbIng. Drawbacks? Maybe especially for CS it could be a bit harder -- and in general there would be more luck involved for you in the admissions process, + more unlikely -- is my take.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your input. Guess I'll just continue along my path, trying my best, doing the things I'm passionate about!",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}