{
    "id": "7rupqd",
    "score": 3,
    "title": "Should I join National Honors Society?",
    "author": "ArrayLiszt",
    "date": 1516498249.0,
    "url": "https://www.reddit.com/r/GetIntoStanford/comments/7rupqd",
    "media_urls": [],
    "other_urls": [],
    "postText": "As far as community service, I already teach a free programming class at my local library every Saturday for the last 2 years, and I play music at a nursing home every month (for the last year), but NHS wouldn't accept either of those activities for my community service. I'm wondering if I should join NHS or not because it would just take up more time.",
    "comments": [
        {
            "level": 0,
            "comment": "In my personal opinion, I do not think that NHS is significant enough to join just for a college application. I assume you have the grades/leadership/comm service to get in, all of which will stand by itself on an application. Ultimately, you really have to look at what NHS does and determine the opportunity cost of joining. In my school, for example, NHS does very little and is pretty much useless. If you believe NHS can help you achieve a goal and/or open some door to something you wouldn't have been able to do otherwise, by all means, join. If not, I would recommend staying away from NHS and using that time to pursue your own interests--or at least something with a higher rate of return than NHS. ",
            "score": 14,
            "author": "waterlily77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah I'm loving the contributions on this subreddit. This is a wonderful answer. I specifically like that you talked about opportunity cost, and explained that it's all about whether it can help them achieve their goals. And to everyone who upvoted this answer - good on you, as well, for your discerning taste!\n\nFrom the mod",
                    "score": 3,
                    "author": "129183-stan-ps"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My personal opinion is no. I was an admit to the class of '22, and I never joined NHS. You'll be better off focusing your time on your \"spike\". An activity that coincides with the major that you plan to take in college and something that you really enjoy. This needs to be something that will makes you stand out, and NHS is too generic to do that. I became part of a research team that published a paper on the logistics of making moon-dust into solar panels.\n\nTldr: Save your time, focus your effort on something more unique.",
            "score": 3,
            "author": "FlappingSamurai",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of the questions I have is, how do I make the claim that I teach a class at my local library legitimate? Obviously, I'll write it on my application, but when I apply, should I get an extra letter of recommendation from my librarian to certify that I have, in fact, gone to the library to teach the class every week for several years?\n\nOr maybe I could get the letter from a local web dev who comes each week to help since he's seen the planning I put into it outside of the class time itself.\n\nWhat do you think?",
                    "score": 1,
                    "author": "ArrayLiszt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you see this as the point of emphasis on your application, then yes, it's a good idea to get a letter of recommendation from someone who can attest to your teaching classes. In my case, I had a letter of recommendation from the professor I was working under. \n\nWho you decide to ask for a letter of recommendation should be a matter of who knows you better. But make sure they're doing more than giving confirmation that you taught! They should be helping the admissions officer get a better of who you are as a person.",
                            "score": 2,
                            "author": "FlappingSamurai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the advice; I'll definitely keep this in mind.",
                                    "score": 1,
                                    "author": "ArrayLiszt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes that's correct--NHS is the bare minimum. You really need to push the envelope, and by that I don't mean volunteering at your local homeless shelter. ",
            "score": 2,
            "author": "Nmhra2017",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think my current amount of community service is enough? I'll continue to do both activities I mentioned until the end of senior year (I'm a junior). ",
                    "score": 1,
                    "author": "ArrayLiszt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well you shoulddo what u need to do in order to join nhs but generally you need to go the extra mile beyond the volunteering activities you mentioned",
            "score": 1,
            "author": "Nmhra2017",
            "replies": [
                {
                    "level": 1,
                    "comment": "The activities I mentioned were unrelated to NHS; they're just activities that I've already been doing for a while that I enjoy and I think would count as community service. Both of the activities I mentioned take a fairly long time to do.\n\nFor the programming class, I make an 8-week long curriculum for each programming unit, so I have to plan lessons, projects, contacting local schools and getting them brochures, make videos for anyone who misses the lessons, upkeep a website, etc. \n\nAnd for the music in nursing homes, that usually takes about 3-4 hours a week because I play piano, and I have to accompany any other musicians that come with me, so I have to learn several different pieces/songs.\n\nBut I suppose I can add another activity or two if I need to. What types of activities have you done?",
                    "score": 1,
                    "author": "ArrayLiszt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What are your grades like and what are your target schools",
                            "score": 1,
                            "author": "Nmhra2017",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "4.47 GPA (should rise to a little higher than 4.5 next year)\n\nSAT goal is 1550, so we'll just assume that that's what I get when I take it next\n\nAs far as target schools, I pretty much have it ranked from reach to fallback schools. My reach schools would be Stanford and Princeton, then the next level below that would be Georgia Tech, below that would be Virginia Tech, and then my fallback school would just be University of Tennessee because that's where I live.\n\nAlso, I should note that those activities I told you about aren't my only activities. They're just my activities that would count for community service.\n\nEdit: I should also note that I've taken 5 AP classes (plus 1 AP test without the class), and I'm signed up to take at least 3 more next year. I've received 4's on most of my tests. I got a 5 on AP Comp Sci",
                                    "score": 1,
                                    "author": "ArrayLiszt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, depends on your school really. NHS is pretty pointless at our school. But I think if you're strong in everything else, it might be more odd that NHS wasn't there rather than the fact it was.\n\nNone of the honor societies I'm in do much. The most I do is usually the actual induction process. I combined it all in one activity on my Common App as National/Music/Spanish/Math/Science/Art Honor Societies. More of a resume booster than anything. It sounds impressive to other people who don't know what it is. ",
            "score": 1,
            "author": "StupidTinyFatUnicorn"
        }
    ]
}