{
    "id": "10kkhya",
    "score": 2,
    "title": "Questions about Co-Op Placement and Multimedia Design and Development Program",
    "author": "Old-Wash-7778",
    "date": 1674604901.0,
    "url": "https://www.reddit.com/r/Humber/comments/10kkhya",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI’m deciding between applying for Humber College or Seneca College and would really appreciate some advice or answer for these questions.\n\n1) How supportive is Humber College’s co-op program in helping you find a job placement (for any program)?\n\n2) How easy is it to find an UX Designer job after you graduate from the Multimedia Design program?\n\n3) How does the Multimedia Design and Development Program compare to Seneca’s Interactive Media Design in terms of course structure and instructors?\n\nAny answer or opinion is greatly appreciated! THANK YOU!",
    "comments": [
        {
            "level": 0,
            "comment": "I’m not in the program you’re asking about, but I finished placement last semester and there was a portal where companies put listings up, many of my classmates got co-op placements through that. I was fortunate enough to have someone with connections.",
            "score": 4,
            "author": "AnaBlack01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh ok, thanks for the feedback and congrats on your success!",
                    "score": 2,
                    "author": "Old-Wash-7778"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They don't. It is the students responsibility to find an opportunity for themselves. I spoke to the Work Integrated Learning Program Administrator regarding this same. Their response\n\n\"To clarify, the Work-Integrated Learning component of the program is student-driven, in that Humber does not place students with specific employers but rather, students are expected to search and explore relevant industry opportunities based on their own interests within their program of study. That said, students are required to enrol in a Field Experience preparation course called Professional Practice which provides students with the tools to be successful in their search. The topics surround things like Resume/Cover Letter building, creating an online profile, mock interviews, job search tactics and more. Our team offers support and shares opportunities and resources with students but it is ultimately the responsibility of each student to spearhead their search.\n\n\nFor example, if you decided that you wanted to return to Sony and gain additional experience there, you could do so. Once you secure an opportunity, you would submit an approval form to our team for review and approval. The guidelines and terms for approval will all be shared in Professional Practice but ultimately, your experience needs to align with the program and program learning outcomes – you can find the learning outcomes on Humber’s Post Production program webpage.\"",
            "score": 3,
            "author": "confusedchaddi"
        }
    ]
}