{
    "id": "12gqx3p",
    "score": 3,
    "title": "My prof invited me to her wedding and I’m not sure if I should go?",
    "author": "GurinderBrarGurlal",
    "date": 1681063981.0,
    "url": "https://www.reddit.com/r/Humber/comments/12gqx3p",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m not sure if she invited just me or the entire class but I’m not sure if I should go? Has anyone else had this happen?",
    "comments": [
        {
            "level": 0,
            "comment": "That’s a little odd. Do you have a close relationship with her?",
            "score": 5,
            "author": "username1874",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a professor at Humber, I can tell you that it is a little odd. Professional boundaries are important and mixing personal and professional worlds is typically not done.",
                            "score": 11,
                            "author": "username1874"
                        },
                        {
                            "level": 2,
                            "comment": "You would invite random people to your wedding?",
                            "score": 2,
                            "author": "LAKAZET5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was it an evite where maybe you have the same name as a friend of theirs who they meant to send it to?",
            "score": 2,
            "author": "keepusguessing"
        },
        {
            "level": 0,
            "comment": "I've been invited to and attended a professors wedding. She probably just appreciates you as a student. I wouldn't overthink it but if you're uncomfortable with it you're uncomfortable with it.",
            "score": 2,
            "author": "blaisebailey",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not really uncomfortable, just wanted some thoughts on this. Were you the only one that got invited or was it your whole class?",
                    "score": 1,
                    "author": "GurinderBrarGurlal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was the only one. I formed a friendship with a professor and it led to the wedding invitation.",
                            "score": 3,
                            "author": "blaisebailey"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i mean all depends on how close you are",
            "score": 1,
            "author": "LilSpitty69"
        }
    ]
}