{
    "id": "k2kmfy",
    "score": 9,
    "title": "UX DESIGN Graduate Certificate",
    "author": "lilchintu",
    "date": 1606554322.0,
    "url": "https://www.reddit.com/r/Humber/comments/k2kmfy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I'm looking to connect with students attending the UX DESIGN graduate certificate program in January 2021. If there's any alumni of the program to guide me, would appreciate that as well.\n\nThanks 😊",
    "comments": [
        {
            "level": 0,
            "comment": "Hi, I'm a student attending the ux design in Jan 2021. Let's be friends.",
            "score": 1,
            "author": "suuu31"
        },
        {
            "level": 0,
            "comment": "Is Jan intake for 2 semesters? I applied to Sept 2021 but I'm on the waitlist so I may try for Jan instead",
            "score": 1,
            "author": "Level-Cupcake8",
            "replies": [
                {
                    "level": 1,
                    "comment": "It used to be 2 semesters for both the intakes until now but thev have updated the curriculum. From, September 2021 it will be 3 semesters.",
                    "score": 1,
                    "author": "lilchintu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah I see. How early did you apply if you don't mind me asking? The spaces fill up quickly, especially for international students",
                            "score": 1,
                            "author": "Level-Cupcake8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For getting into September 2020, I had applied on around 15th November 2019 and had an acceptance by 15th December 2019.",
                                    "score": 1,
                                    "author": "lilchintu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've applied for Sept 2021 and confirmed offer. It's showing me 2 semesters. \n\nHow has your experience been so far, how's the course?",
                            "score": 1,
                            "author": "ImaginaryQuestion217",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My experience so far has been great. I've been told that the 3rd sem is basically the mandatory work placement. So on offer it might show you 2 semesters of studies and the 3rd being the work placement.",
                                    "score": 2,
                                    "author": "lilchintu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glad to hear that!  Are you doing it entirely online?",
                                            "score": 1,
                                            "author": "ImaginaryQuestion217",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes",
                                                    "score": 2,
                                                    "author": "lilchintu"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've got a couple questions! \n\nHow are the professors in the program? And did you come into the program with any prior UX design experience?\n\nThanks!",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi the professors are good. However, their is a lot of overlap between the courses. It's more about UX Research and other methods of the process than visual design. I did some prior experience as a UX Designer before joining. If you're interested more in the visual design part of UX, this might not be the best program for that.",
                    "score": 1,
                    "author": "lilchintu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In terms of getting a job after the program, how was the experience for you?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I started in January 2021 as mentioned. So my first semester actually ends this month. Can't really share an experience of finding jobs at this moment.",
                                    "score": 1,
                                    "author": "lilchintu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh okay thanks!",
                                            "score": 1,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;her methods of the process than visual design. I did some prior experience as a UX Designer before joining. If you're interested \n\nHey can you give us an update, have you been able to land a job after and were you able to do a placement?",
                                            "score": 1,
                                            "author": "queen459",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I graduated from the program in August. I'm doing another program now, Human-Centred Design, at Algonquin college which I started this fall. \n\nBut I was able to successfully land a co-op, and as far as I know everyone in my class was able to do so. Some are still in the process of completing their co-op and a few have already found full time roles. So, I don't think landing a co-op placement or a job was very challenging. It all comes down to your individual skill and the effort you put in. One thing that I did note though, is that the process of finding a job took a decent amount of time so it's always better to start applying as early as you can.",
                                                    "score": 2,
                                                    "author": "lilchintu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s good to know, Thankyou for responding, also what made you want to do the human centre design at  Algonquin?",
                                                            "score": 1,
                                                            "author": "queen459"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hi, According to your comment. You started in January and graduated the course in August which is 8 months of time. Did you skip co-op? Is co-op optional?",
                                                            "score": 1,
                                                            "author": "Own-Cicada5752",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I did my co-op part-time during the second semester.",
                                                                    "score": 2,
                                                                    "author": "lilchintu"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But will you be able to work in the visual aspect of design after graduating? I am currently enrolled and I am finding it more research based that visual hands on element ( which i hate) cuz i like the visual aspect. please let me know I am desperate.",
                            "score": 1,
                            "author": "Intrepid-Tangerine-7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes you can work as UX Designer with your work being more around visual design. If you find the Humber UX Design program more research heavy then you would've gone bonkers with my second program at Algonquin College (IHCD). Despite that, I'm working with Statistics Canada as a UX Designer with most of my work being around visual design, wireframing, prototyping etc.",
                                    "score": 1,
                                    "author": "lilchintu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Alright that takes so much stress off my back, cuz I went in thinking the courses were more colorful, more design based, and got huge panic attacks after attending three lectures so far lol, But I do not mind pushing myself through if it's just the studying part that is stressful.",
                                            "score": 1,
                                            "author": "Intrepid-Tangerine-7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I can totally relate. If you already have decent skills in visual design think of the research skills as a value add. If you have a good hand in visual design and research, you'll have the upper hand over other people entering the industry. If you want, you can connect with me on [LinkedIn](https://www.linkedin.com/in/dilpreetxyz/).",
                                                    "score": 1,
                                                    "author": "lilchintu"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "thank you so much for ur response",
                                            "score": 1,
                                            "author": "Intrepid-Tangerine-7"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "worst program that I've ever had. For future students, please don't go there",
            "score": 1,
            "author": "Ok_Professor_4765"
        }
    ]
}