{
    "id": "m7p1vu",
    "score": 16,
    "title": "My experience at Humber this year...",
    "author": "[deleted]",
    "date": 1616068117.0,
    "url": "https://www.reddit.com/r/Humber/comments/m7p1vu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Some background: I am a mature student who dropped out of school in ninth grade and returned this year, fifteen years later. I have a huge interest in social justice issues, having come from a background of poverty myself, and wanted to work within the shelter system later on. \n\nI was really excited to join my program because I had been studying the issues they planned to cover independently. For me, this was just needing to get a piece of paper that would help boost my resume to break into the field in ways beyond volunteering can do. Still, I was really excited to see this and things I had yet to encounter displayed in an academic way so that I had a better handle on the concepts and how I could communicate with people around me about them. \n\nOver the past few weeks, I have tried so hard to just accept the program for what it is but over the past few days, it really seems like a scam. Here is a breakdown of some of the things I've experienced ...\n\n- one professor linked a video created by Scientology to explain a pretty basic social concept but refused to acknowledge the fact it was created by Scientology\n\n- in one class, they built a team which you work with for most of the semester (more on this). At first I was open to this until I realized they were requiring me to give my personal contact information to my group members who had no problem texting at all hours of the day/night and during planned group meetings wasted hours of time pressuring each other to give more personal info at the behest of the assignment. I told the professor that as a survivor of recent abusive situations, I was no longer comfortable sharing my personal information with strangers in this format. At the time, she explained the team portion would account for about 15% of my mark and urged me to continue to attend class. Later I realized most of the semester was team work, asked her about it and she referred me to someone else. \n\nSide note: yesterday they sent an email regarding the conduct of students using third party apps but they have yet to contact me regarding my experience.\n\n- there is one assignment I did which I did wrong according to instructions but I disagreed with the portrayal of the community in the assignment. I recieved a zero, which was obvious, but the professor further commented that I had no empathy and to check my privilege. \n\n- same professor assigned everyone to do a 100 point quiz on Buzzfeed that judged how privileged you are and then submit a reflection piece. As I mentioned, I come from a rough background and scored 21 out of 100. The professor, who took the quiz live on camera for some reason, scored 40 out of 100. So by definition this professor who has experienced less injustice than I have told me that I do not have empathy and to check my privilege because I disagreed with her view on consumerism. \n\n- same professor again could not give me the academic definition of the differences of extremism in beliefs and discord but spoke for two hours on a mixed up concept of it. At some point she had mentioned Waco to which I asked for further clarification. At that point she said Waco was fine and caused entirely by the American government and suggested we watch the miniseries on Netflix about it. Just as a FYI- David Koresh has been accused by many many many survivors of abuse as well as being documented for marrying a 14 year old. \n\n- another professor used that Marilyn Manson clip from Columbine in an attempt to justify media and school shootings and this popular trope. Another student brought up Manson's recent sexual abuse allegations and they were ignored. \n\n- one class has not had a live class, ever. The \"professor\" is a young girl who asks you to show up for 30 minutes every two weeks to \"check in\" but otherwise the entire class is an independent study which you read modules posted and do very basic multiple choice questions or common sense short responses. \n\nSo ironically, I am getting really good grades because I completely understand the subjects beyond their broken explanation. I have gained absolutely nothing from this program except the chance at co-op placement later on. They use concepts that were developed in the 1970s and 1980s and state it as complete fact while interweaving new movements without any critical thought but their own personal and political beliefs. They will teach entire classes on using critical thinking but in no way allow you to apply that to their own program. \n\nThe only professor I've had that has demonstrated an academic knowledge in their subject is the WRIT-100 professor. He is also the only one to take the time to explain how Blackboard worked, where to find certain things on the website, how to troubleshoot it etc and quickly adapted to any tech issues that came up while teaching valuable, useful and correct information. \n\nI've submitted complaints to all my professors, the program director, ALS etc and gotten absolutely no where with anyone. I am attempting to continue so that my grants do not turn into loans by dropping out mid-semester but this was honestly the biggest mistake of my life. I suppose if you're fresh out of highschool snd never experienced any hardship, this program would be beneficial in some way but as it stands, they should be ashamed that this is how they prepare future social workers.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm still deciding what I want to do in the future now but just wanted to share my experience since half of the posts here ask what the school is like.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I completely agree. This is why I am reconsidering my choice - being apart of that meat grinder is soul crushing and heartbreaking and in this program I began to see that much of it is about things being for profit or how can others benefit off of someone's suffering. \n\nI wanted to work in the shelter system but I realize now I'm just going to watch a cycle that has no actual support and I can't do that. Feeling pretty lost at the moment, but hopefully I'll figure it out.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Humber profs are sometimes wonderful but the institution churns out students with little regard for the quality of their education. I'm sorry to hear about your experience but you should not expect much better than this for the duration of your time at Humber. You can sometimes extract value from these degrees, but the onus is on you. At Humber, you are a tuition paying number and you will never be treated as anything more.",
            "score": 6,
            "author": "brettlebda"
        },
        {
            "level": 0,
            "comment": "I just want to start out by saying that having this 'online learning' as the introduction to your college experience is really unfortunate. The transition for me (also a mature student, returned after 16 years) from in-person classes was really tough. I think you are missing one of the best parts of going to Humber, and that is the campus, the professors you can become familiar with, and the network of class and groupmates that become real life friends. \n\nI graduated from the CJS program in 2019, and I am now getting my Bachelor's in Community Development. I was so shocked reading your experience because it is so different from mine. \n\nThe group work is annoying but absolutely necessary, and as one of the people who messages at 2am (guilty) I can say that my work hours and family responsibilities mean that I am usually desperate for quiet time to get coursework done, and late night is generally quiet. Co-ordination is really difficult when everyone is on a different schedule, but I understand your frustration. One of the most satisfying feelings is leaving a group once a project is done lol. \n\nOther than group work I absolutely loved my time in CJS. Unlike you, I wasn't coming from  place of experience with many of the issues plaguing our society, in fact I was very naïve before that program. It seems to me that University would be better suited for you based on your level of experience in the field. I will say that I feel like the things I learned in CJS have benefitted my career and definitely opened some doors, because networking is almost as important as knowledge in social work. \n\nI'm gonna say stick with it, especially if the classes are easy for you. There is a good chance you will be able to teach your classmates something, despite that not being your job, your frame of reference is **important**. Giving a different perspective is sooooo important in these classes. If this is your first semester, things will get better and harder as you go along. The Co-op placement is valuable too, I ended up working at my placement for 3 years!\n\nI don't mean to ramble on, and I get if you really are over it, but at least finish out the semester then take a break if you need to, or transfer credits like someone else suggested. \n\nGood luck!",
            "score": 2,
            "author": "RoNiceHer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the response and perspective of the program from a positive side. As I said, I do think this program is designed for those who have little to no life experience in these topics, which makes it pretty uncomfortable for someone who does have those experiences to see the approach that is taken with some of the subjects. \n\nI had a two part complaint with the group work - I was ready to take a 0 on those parts which the professor told me was worth 15%. After two missed assignments I realized most of the semester was still group work and the professor just sort of dipped out of the conversation when I tried to ask about the \"15%\". The group work has been 100% team building activities from 90's work place office vibes so far. \n\nI didn't really want to make friends, I wanted the credentials and skills to actually help vulnerable people. I live in a different city than most of my classmates so far as well so volunteering locally is better networking than school. \n\nI've felt most of the time that I've shared my perspective that its been dismissed for another perspective and that mine has been shot down because the professors are assuming they are talking to highly privileged people and do not seem open to hearing from the people they are talking about. \n\nI am really on the fence with continuing in social work at all. I think some of my views might be suited in a university academic study kind of context but I need a lot of upgrading to get to that point and I'm not sure I'm trying to change the world in such a manner either. \n\nI'm sure my life experience is beneficial somewhere, I just haven't figured it out yet. But again, I do appreciate you sharing your thoughts as it will give me a few things to think about as I've not spoken to anyone who has taken the program so its definitely worth weighing your thoughts in my ultimate decision.",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which program specifically are you in? I had a similar experience last semester.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Community and Justice Services",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to join that program, would you recommend it up if I wanan go to Guelph Humber after getting my diploma to get my degree in Justice studies?",
                            "score": 1,
                            "author": "ProffesorOfPain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't recommend Humber as there are other reviews of this program in other places online that mimic what I had been saying in this post. There are other colleges offering similar programs that may be better than Humber.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Group projects are huge in post-secondary. Every class, every semester has group projects. While I understand your concerns, having to join group chat sessions (usually using WhatsApp) is really the only way to go, especially now when everything is online. If you have issues with privacy, it's a good thing none of your courses are required to use ProctorTrack, I had to use it for some of mine and it's incredibly invasive.\n\nWhile I can't really speak much to that one professor you've had an issue with, it's pretty common for online classes (again, especially NOW) to have no lectures and be \"self-directed\". I'm in 3rd year nursing and a large chunk of my 5 classes last semester was exactly like that. 30-minute sessions every other week to \"check-in\". I went from having 3 and 4-hour classes full of lecture, PowerPoint slides, and discussion to nothing but read the textbook and make sure you learn the learning objectives.\n\nThe 3rd year nursing students had a huge disagreement with faculty over numerous issues last semester and essentially it went nowhere. By the looks of it, this semester we're pretty much just putting our heads down and trying to get through. You even said yourself that you are taking these courses just for the bureaucratic requirement of that \"piece of paper\" (trust me, I know all about that BS) So I'd just stick with it, get that all-important piece of paper and go about your goals. \n\nIt's a shitty situation, but students literally have no power when it comes to faculty and behaviours/teaching style. The school even told us that they leave the structure of the courses up to the instructors so you can have one class with PowerPoint slides, lectures, and the whole shebang, and another exact same course, different instructor and have it all be \"self-directed\". They also don't seem to worry too much about passing percentage or using bell curves either.",
            "score": 1,
            "author": "BubblyBullinidae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I'm leaning towards dropping out for now. If I had an interest in something that required technical skill, I might feel differently because I certainly couldn't be a nurse for example without that piece of paper but a lot of people don't even work in their field of study so for me on my path it might be perseverance and luck of the draw with a career path and less through the academic route.  \n\nI commend you for putting up with it to reach your goals though. I definitely could not do this for years and that patience will likely serve you and your future clients well. Although I have a lot of personal experience in my field of interest, I dont have the head space to sum up the \"get 'er done\" attitude right now in my life. I suppose that's silly because its not my grades holding me back but just how I feel in my soul about things I'm seeing.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a first year nursing student at humber and I definitely feel you. I have never been so discouraged. I am a mature student as well with some experience in different post-secondary institutions. They are always run like businesses, but there is at least a veneer of humanity and it usually comes from the professors seeming invested in students or at the very least, enthusiastic and knowledgeable about their subject matter. Humber feels like a scam through and through and I am ashamed of the education I am getting and unsure if I can slog through another 3 years of this which essentially feels like oversimplifying very complex social realities and then overcomplicating very bullshit simple concepts. \n\nIt is really disheartening that you are feeling this way as it sounds like your life experiences would be so valuable in social work. It may be that you having lived experience of the things that your professors have only learned from a textbook is creating this dynamic. A true educator would be open to hearing you and other students and you deserve better on your path to becoming a social worker. What I will say from experience is that social workers who are very academic and textbook tend to be shit in the field (probably why they became academics instead of actually working with people?) and if you can make it through this, working will not be like school at all. I don't know if there are social work schools that are more social justice-oriented but maybe that could be an option if you are willing to transfer?\n\nI know the pandemic has made these things worse but it says a lot about the priorities of the professors that given the choice, they would choose to have \"check-ins\" with students rather than teach. Many of my profs have decided for fully or partially asynchronous and I feel like, I did not sign up or pay tuition to read a textbook. In our department they also use the words \"social justice\" and \"critical thinking\" a lot without, IMHO, applying those concepts at all to the material or being at all current with medical research or advocacy. Man, somethings the professors say are straight-up offensive.  I can only imagine they pay teaching staff very poorly, or keep them on temporary contracts.",
            "score": 1,
            "author": "kleelewl"
        },
        {
            "level": 0,
            "comment": "Wanted to jump in here and offer a suggestion too. I'm also a mature student who returned to school (and from a low economic background and the first in my family to do higher education) after being away for many, many years and now that I've done both college and university, I have to say that what you are looking for is university. I am currently at UofT (so I can only speak to this university experience) and I did the Academic Bridging program to get in (it was a 1 year program) but I am absolutely not sorry I did it. The AB program had social justice classes, which went toward my degree and informed the direction I've taken in my degree. As well, the school itself has excellent social work programs and there are lots and lots of people involved in the work you want to do with many different outreach opportunities. And there is a lot of funding available (osap, bursaries, scholarships), which for me was a huge reason I'd never considered university before. So if you still really want to go in this direction, I suggest you finish the semester and transfer your credits to another school. Good luck!",
            "score": 1,
            "author": "SkyIntelligent742"
        }
    ]
}