{
    "id": "w1212l",
    "score": 2,
    "title": "Elective Courses",
    "author": "hahaKillingLife",
    "date": 1658043990.0,
    "url": "https://www.reddit.com/r/Humber/comments/w1212l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I'll be starting my degree program come this fall and had a few queries about the elective course that I have to take, I have skimmed through their confusing website and also e-mailed them but could not satisfactory answers.\n\nPlease tell me if I am a student whose program is based at Lakeshore can take up an Elective course at North?\n\nAlso I could not find any English courses for registration that I was looking forward to such as Memory and Trauma, Love Stories etc. Are they not being offered this term and would they be available in future terms?",
    "comments": [
        {
            "level": 0,
            "comment": "If the elective is in person, you’d have to travel to the other campus to take it. \nThey have a ton of electives listed that I’ve not seen offered once, just the same ones every semester.",
            "score": 1,
            "author": "kitt_katt_bratt",
            "replies": [
                {
                    "level": 1,
                    "comment": "are there electives i can take that are fully online ?",
                    "score": 1,
                    "author": "TharnxJj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recall hearing that electives would all be online but I’m not sure. Best to do your schedule planning, they either show a classroom location or online.",
                            "score": 1,
                            "author": "kitt_katt_bratt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Awh man, I was looking forward to taking up an English course :( Thanks though.\n\nDo you recall ever being offered any English course as an elective?",
                    "score": 1,
                    "author": "hahaKillingLife"
                }
            ]
        }
    ]
}