{
    "id": "wk4v2w",
    "score": 1,
    "title": "Computer Programming Question (Hardware Requirements)",
    "author": "No-Building6488",
    "date": 1660055582.0,
    "url": "https://www.reddit.com/r/Humber/comments/wk4v2w",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a future student of the 2 year Computer Programming program. The program website says windows laptops are required. To other students in this program, is a windows laptop absolutely mandatory? I emailed the program coordinator and they said if I want to use Mac, I can but if there are any program incompatibilities, the instructor cannot help me. I don’t want to spend money on a whole new laptop if not needed as I have a Macbook that fits the required hardware aside from the operating system. Is there anyone in this program that can confirm if windows is absolutely mandatory? Will I have a lot of trouble if I attempt to use a MacBook?",
    "comments": [
        {
            "level": 0,
            "comment": "They recommended windows. Reason being is that the professor usually mainly use windows. And if problem arise they can help you pretty easily",
            "score": 2,
            "author": "hanzedellion"
        },
        {
            "level": 0,
            "comment": "Windows is not mandatory. However, having a Mac will cause some problems down the road because a lot of the software and programs require big workarounds when using macs, whereas for windows os they just work fine. Also, if your MacBook is old then you'll probably have problems too, since this program will require you to use VM for a lot of courses, and VMs are quite needy when it comes to software.",
            "score": 2,
            "author": "anal_nuke"
        },
        {
            "level": 0,
            "comment": "I am not in this program but I am in Information Technology Solutions. We have a variety of courses that require Mac, Linux, and Windows. All of the courses till now have provided cloud VMs for all three OSes to students if required, although this was not mentioned anywhere so it is probably program coordinator or professor dependent.    \n\n\nI must admit that the VMs are not fun to work with and Humber does provide students with a laptop on request. I have a Macbook for my work that I purchased and I requested a laptop from Humber that is Windows. That was all I needed to work with all courses. Hope this help in clarifying your query.",
            "score": 1,
            "author": "ankitgusai"
        },
        {
            "level": 0,
            "comment": "Just install a VM, you should have free access to Microsoft software through Humber.",
            "score": 1,
            "author": "makonde"
        },
        {
            "level": 0,
            "comment": "I’m not in the program but you can always use Mac bootcamp. It lets you run windows 10 on your Mac",
            "score": 0,
            "author": "bobertmcdickhead",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would never recommend a Mac for any type of computer courses.",
                    "score": 0,
                    "author": "anal_nuke"
                }
            ]
        }
    ]
}