{
    "id": "x22i75",
    "score": 2,
    "title": "Insight on the lnternational Development Graduate Certificate?",
    "author": "CompetitionOk2505",
    "date": 1661914919.0,
    "url": "https://www.reddit.com/r/Humber/comments/x22i75",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I recently graduated from a Bachelor’s Degree in Media Production/minored in Communications and I’ve been wanting to pursue more of my passion for international relations and public affairs. I’m thinking of gaining volunteer experience but was also interested in getting more education and knowledge. \n\nWould anyone enrolled or graduated from the certificate program at Humber be able to share their experience? I saw other programs at Centennial and Seneca for International Relations/Development so I want to ask around and compare different colleges. My ultimate goal is to get a Master’s or PhD in IR/PolSci in a few years, but for now, I’m open to learning more through a certificate program and apply that experience for jobs in the near-future.\n\nAny advice or insight is greatly appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing! Are all the courses virtual or in person (or hybrid) and how is your schedule? I was also wondering about the internship/placement opportunities and what connections Humber has with government, charities/non-profits, and so on?",
                    "score": 1,
                    "author": "CompetitionOk2505"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This program is more for practical skills for aspiring development or humanitarian workers than political science. It’s probably one of the only few available in Canada but I found that they mislead you on how difficult it is to get a job in this field, which is really terrible as many have trouble finding jobs they want after graduation and they only realize after graduation. It might have been easier in the past but it’s harder for people to get international jobs now as they hire locally. So prepare to do a lot of internships and volunteering if you want to go into this field, even years of it. I think the program is for the most part dated and not up to date (makes sense as program coordinator worked in the field many years ago). Still one of the only options in Canada but there are other options from outside the country that might be better for similar price.",
            "score": 2,
            "author": "fragrance-offpath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing! I was trying to look for other certificate/diploma/continuing education programs around public policy, international development, and global affairs within Canada but it seems somewhat limited. As a recent graduate, I'm currently working and financially unable to pursue another 4 year degree right away, but I'm also looking into scholarships for Master's programs or other continuing education programs. I saw that UofT has a Certificate in International Affairs but I'm waiting to hear back from their admissions team to ask for details.  \n\nIf you know of other Continuing Ed/ Graduate/ Certificate programs in Canada/ abroad, please feel free to share! I appreciate any help :)",
                    "score": 1,
                    "author": "CompetitionOk2505"
                }
            ]
        }
    ]
}