{
    "id": "xun3ly",
    "score": 0,
    "title": "APA format?",
    "author": "[deleted]",
    "date": 1664812197.0,
    "url": "https://www.reddit.com/r/Humber/comments/xun3ly",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi can anyone explain to me what is APA format, please?",
    "comments": [
        {
            "level": 0,
            "comment": "https://library.humber.ca/APA-MLA\n\nHumber library has lots of resources you can use. On that link, there's a Tip Sheet for APA referencing",
            "score": 10,
            "author": "pineberrycoladas",
            "replies": [
                {
                    "level": 1,
                    "comment": "can u dm me",
                    "score": -4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The link provided has literally all the information you need.",
                            "score": 8,
                            "author": "Nickyy_6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ik but for me idk how to start a sentence of it.",
                                    "score": -3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you are still having trouble, try contacting the writing center and see if they still have any APA session.",
                                            "score": 3,
                                            "author": "PickledPizzle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Everything is the same writing wise. The difference is title page, quotation, references and in text citations. Check out the library if you need help with format. They’d be able to help you.",
                                            "score": 2,
                                            "author": "Justsomeonewhosnew",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I understand what ur saying but for me to understand more is by a picture or something (plz)",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Google APA format, it gives tons of examples. \n\nIf you still need help then it sounds like you have a learning disability for which you should seek out the writing center and student resources for an accommodation.",
                                                            "score": 3,
                                                            "author": "Morality01",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "i do have learning disability btw and i went to the tutor that didnt DANG help tbh",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "While I sympathize, you need more professional help not just posts on Reddit. \n\nThis problem will get bigger as your college career goes on and the standards get higher.",
                                                                            "score": 3,
                                                                            "author": "Morality01",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "ik that",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[APA format](https://www.easybib.com/guides/citation-guides/apa-format/)\n\nVisit that site, at the bottom it has pictures and examples of APA. It’s genuinely easy! Just needs extra titles, indentation etc. If you have a learning disability check out the learning centre for accommodation. They’ll help you, as well as the library. I’m sure the library can also print out some visual aids to help you understand how to write in APA format.",
                                                            "score": 1,
                                                            "author": "Justsomeonewhosnew"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "apa really refers to title pages, in text citations, and references, your general essay writing is the same, just look at the link and go through it",
            "score": 3,
            "author": "Anakin___"
        }
    ]
}