{
    "id": "133zvqv",
    "score": 72,
    "title": "Is it dumb to bring my laptop to South America?",
    "author": "truthfuldelusion",
    "date": 1682880871.0,
    "url": "https://www.reddit.com/r/solotravel/comments/133zvqv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! So I'm going to Peru and Brazil for about a month, leaving next week. While I'm traveling, I'll need to be applying for jobs back home and the easiest way to do that is on my laptop (since writing cover letters and sending emails is difficult on my phone). \n\nIt's my first time traveling to South America, and I'm a little worried as a woman traveling alone. Should I worry about bringing my laptop or will it be safe if I generally keep it locked in my hostel? Thank you:)",
    "comments": [
        {
            "level": 0,
            "comment": "You should be fine in hostels as you can lock it up in lockers.\n\nI had a laptop stolen in Ecuador on a bus ride. Make sure on buses to keep your belongings literally on your person if possible.\n\nI enjoyed a lovely nap while my backpack was sitting in the storage shelf above my head.\n\nWhen I got off the bus my laptop was no longer in my backpack, sad day.\n\nSo yeah just be cautious of your belongings in public.",
            "score": 103,
            "author": "tio_aved",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I enjoyed a lovely nap while my backpack was sitting in the storage shelf above my head.  \n&gt;  \n&gt;When I got off the bus my laptop was no longer in my backpack, sad day.  \n&gt;  \n&gt;So yeah just be cautious of your belongin\n\nGood advice. Thank you!",
                    "score": 23,
                    "author": "truthfuldelusion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bring a bag lock to lock your bag closed. Some people bring a chain lock that might help",
                            "score": 9,
                            "author": "expectedpanic"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah even while traveling across England I made sure to sleep with my arms strung through my backpack’s strap.",
                            "score": 4,
                            "author": "Question-asked"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you me??? I also had a laptop stolen in Ecuador on a bus ride in EXACTLY the same manner. Were you traveling through Guayaquil by any chance?",
                    "score": 25,
                    "author": "ashaleeeya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahaha no way!\n\nI was going from Quito to Baños when it got stolen.\n\nYours was stolen going through Guayaquil?",
                            "score": 11,
                            "author": "tio_aved",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep either from Montanita to Guayaquil or Guayaquil to Quito, I can’t remember which. I also got robbed on the street in Cuenca.",
                                    "score": 4,
                                    "author": "ashaleeeya",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow that sounds horrible. How did it happen?",
                                            "score": 3,
                                            "author": "tio_aved",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It was my fault. I was drinking a bottle of wine with my Russian friend standing outside of our hostel at almost midnight during the pandemic so it was empty, dark and quiet. \n\nSuddenly a man appears, says something to us (I don’t remember what - drunk and Spanish not great) and suddenly flashes his knife and grabs my purse, I do nothing because I’m not going to fight for it, then tries to grab my friend’s purse but she’s crazy and from Siberia so she fights him off. He tries to cut the purse, ends up slashing one of the straps and her wrists but she holds onto it. He runs off into the night and she runs after him swinging the bottle around and yelling in Russian. She lost him. \n\nNow ask me about trying to file a police report for theft in Ecuador. LOL just kidding, don’t, because it’s  impossible.",
                                                    "score": 2,
                                                    "author": "ashaleeeya",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Holy shit that sounds frightening lol but hey good on you for not putting yourself at risk by trying to fight off an unknown with a knife.\n\nCan't believe your friend chased after the guy lmao what a story.\n\nYeah the police wanted nothing to do with me about reporting the theft at all lol",
                                                            "score": 2,
                                                            "author": "tio_aved"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wow that sux I’m sorry",
                                            "score": 1,
                                            "author": "ohnowheredmypantsgo"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My friend got his bag snatched in Quito. Luckily some locals grabbed the guy and he got it back. Shortly after, I got one of those travel purses that latches the zippers and has a wire running through the strap so you can’t cut it off.",
                            "score": 5,
                            "author": "_banana_phone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard so many bus theft stories in Ecuador, especially compared to other South American countries.",
                    "score": 3,
                    "author": "thesalfordmystic"
                },
                {
                    "level": 1,
                    "comment": "The same thing happened to a travel YouTuber while in south America. While he was napping on the bus in Ecuador. What a coincidence.",
                    "score": 1,
                    "author": "Spapadap"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The risk is primarily while you’re in transit, not when your valuables are locked up at a hotel or hostel.  Having said that, if you have a choice, bring the cheap laptop and not the brand new expensive one.",
            "score": 145,
            "author": "TravelerMSY",
            "replies": [
                {
                    "level": 1,
                    "comment": "this, bring a cheap one",
                    "score": 25,
                    "author": "Lordganeshas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This a cheap $100 laptop, even used, you should still be able to do word processing and send emails and apply for jobs",
                            "score": 6,
                            "author": "b1gb0n312"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be careful when travelling on coaches etc - don't leave it in the bag that get's thrown under the bus as it could be damaged. Also, don't advertise the fact you have a laptop. Just keep it in your bag when travelling from place to place. Use it in the hostel/hotel. Don't take it down to the local coffee shop unless it feels safe - and even if it does, why risk it.\n\nWhy not consider an external keyboard for your phone to save the trouble of carrying a laptop?\n\nAlternatively, buy a cheap Chromebook that's light and that you'll only use for travel. If it gets stolen or damage it's no big deal.",
            "score": 36,
            "author": "TheAlisterG",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not OP, but this is great advice. I honestly had no clue how inexpensive (comparatively) Chromebooks are to laptops, so I’ll likely be doing that",
                    "score": 11,
                    "author": "staywickedlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seams chromebook is the way. Any further thoughts on this? Thank you.",
                            "score": 4,
                            "author": "Hifi-Cat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chromebooks are cool for quick, short tasks and light browsing but they can't fully replace a laptop IMO. Not only are you forced to constantly work online, but there is software that can't be installed on Chromebooks and the processing power isn't the greatest.",
                                    "score": 17,
                                    "author": "AppropriateRecipe342"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was going to suggest a Chromebook as well. Not only are they dirt cheap (start at $100) they will still allow you to do simple web browsing.",
                    "score": 3,
                    "author": "nerdyandnatural"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brazilian here, from São Paulo. If you have to walk around the city with your laptop, your backpack will ALWAYS be in front of you (unless you’re in a shopping mall or in a store). If you’re in the subway, bus or street, backpack with valuables always (and I can’t stress this enough) in front of you. Do not use backpack as you’d normally use elsewhere. \nNo iphone usage in the middle of the street as well or in your back pocket. Just inside cafés/stores.",
            "score": 19,
            "author": "Apprehensive-Wash491",
            "replies": [
                {
                    "level": 1,
                    "comment": "Slightly different question but if your backpack doesn’t have any valuables in it (say your phone and passport are in an internal zipped up packet or in person somehow) is it generally safe to have your backpack on your back? Or are people likely to try and steal from it anyways? Is it better to have no lock on your bag to avoid getting it slashed if there is nothing they would want to steal anyways?",
                    "score": 3,
                    "author": "queenslayqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would avoid to have it on your back. Your passport is not valuable to them but it’s VERY valuable to you. Brazil has a lot of pickpockets and you’ll just realize it happened to you when it’s too late. \nI don’t want to make a horrible picture of Brazil. Nothing ever happened to me, but because I was ALWAYS careful. Some foreigners go to Brazil with the same mentality as their countries and its just not like that. You have be aware of your surroundings at all times. And just don’t be naive, and you’ll have a great time. Brazilians love gringos (that’s not derogatory in Brazil fyi).",
                            "score": 3,
                            "author": "Apprehensive-Wash491",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay!! Would you say that my passport and phone would be safe in a money belt??",
                                    "score": 1,
                                    "author": "queenslayqueen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh for sure. And if you have the option, do not walk with your passport-leave it locked back in the hotel/hostel. Less of a hassle in case you lose it. \nYou really just going to need any form of ID if you go to a nightclub and you look suspiciously young. I’d recommend walking with a copy of your passport (that’s what I do when I travel anyways).",
                                            "score": 1,
                                            "author": "Apprehensive-Wash491"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you take a bus, don't fall asleep. That seems to be the trend. Keep your stuff on your lap. NOT under the seat",
            "score": 56,
            "author": "mile-high-guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every time I am on a bus, the backpack is hanging off my leg/ on my lap with a strap wrapped around my leg. I have fallen asleep on buses but I wouldn’t let myself with how busy the bus was between Quito and Baños",
                    "score": 10,
                    "author": "jrosenkrantz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the way I do it as well and I traveled all of south and Central America for 1.5 years (including 3 months in Brazil) without being robbed. I think that’s the only correct way to do it! You just can’t avoid falling asleep on buses sometimes but you can try to avoid getting robbed or at least making yourself the easiest target for robbery",
                            "score": 2,
                            "author": "cheeky_sailor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I spent most of last year in South America with an expensive laptop and expensive camera equipment and didn't have any issues. I didn't carry the laptop around, but I did visibly carry cameras around and had no problems.\n\nI didn't stay in hostels, but didn't have issues in AirBnbs or hotels.\n\nI also insured my expensive things, it was a peace of mind thing.",
            "score": 71,
            "author": "Projektdb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very helpful--thank you so much!! If you have any tips for Peru and Brazil, feel free to pass along :) I'm in the research phase right now.",
                    "score": 13,
                    "author": "truthfuldelusion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair warning, my husband was robbed at knifepoint for his pretty crappy digital camera while living in Peru. These things happen, so be prepared to not lose too much should it happen to you.",
                            "score": 2,
                            "author": "impishlygrinning"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One thing I've noticed, both personally and from anecdotes online, is that thieves don't really seem to actively target expensive cameras (i.e. they don't *actively* go after them the way they do smartphones and wallets).\n\nMy guess on this is that nice cameras are harder to liquidate (less of an easily-accessible black market for them than there is for phones) and/or that locals in developing countries actually don't have a good sense of how expensive they can actually be (i.e. I feel if more people were aware a well-kitted DSLR with a nice lens could actually be worth way, way more than the iPhone you'd see more muggings and snatchings of them).",
                    "score": 2,
                    "author": "BD401",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you're correct in that cameras aren't targeted as often. It probably also has to do with ease of concealment after the fact. Once you have a phone or wallet, it's easy to pocket or handoff to someone. If you've got a camera with expensive glass, you have to run away with it.\n\nThe only actual incident I had in South America was an attempted cell phone theft that would have looked like comedy skit to anyone watching.",
                            "score": 2,
                            "author": "Projektdb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very true - my full-frame with a telephoto is going to be a pretty awkward getaway attempt for a thief versus palming my phone lol",
                                    "score": 2,
                                    "author": "BD401",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mines not too bad since I travel with M43, but my telephoto is still a decent size.",
                                            "score": 1,
                                            "author": "Projektdb"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you travel through Brazil safely?",
                    "score": 1,
                    "author": "ohnowheredmypantsgo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worse case buy a Chromebook or something really cheap if you are just sending emails",
            "score": 8,
            "author": "TravelWithAHat"
        },
        {
            "level": 0,
            "comment": "I've been in South America over 3 months now (mostly on Brazil) without issue. just keep it on your person when in transit and don't take it out to cafes or anything, keep it in the hotel. I can't comment on hostels/busses but I've had no issues with hotels/flights.",
            "score": 6,
            "author": "squidgemobile"
        },
        {
            "level": 0,
            "comment": "Do not travel with something you can not depart with.",
            "score": 7,
            "author": "sakuratanoshiii"
        },
        {
            "level": 0,
            "comment": "You'll be fine! For peace of mind, you could look into a PacSafe bag and a good lock",
            "score": 6,
            "author": "Cryan-Branston",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! That's good to know!",
                    "score": 2,
                    "author": "truthfuldelusion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends on your mode of travel and were you will stay.  I have worked and lived in Peru for 30 years.  Theft is common!",
            "score": 6,
            "author": "TeaGeo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be very careful if traveling on public busses, vans, combos and staying in bus stations.\n\nI strongly suggest a small lock for every zipper and a small cable do you can lock the bags to something to prevent the grab and run or sneaking in when you doze off!!\n\nSaved me a few times. They often work as teams. One distracts while other grabs or get in bag and takes the item\n\nAlso a wrist or neck strap for the phone!",
                    "score": 1,
                    "author": "TeaGeo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you take it, be sure you lock it down. Don’t save passwords except maybe a password manager that  auto logs outs. Clear cache and history often.",
            "score": 4,
            "author": "weolo_travel"
        },
        {
            "level": 0,
            "comment": "I'd draft a cover letter before you go and edit as needed on the phone.\n\nLaptops are hard to travel with if you aren't going to have a home base.",
            "score": 4,
            "author": "itsybitsybiter"
        },
        {
            "level": 0,
            "comment": "i’d suggest a tablet. if you do a lot of typing, bring a small bluetooth keyboard.",
            "score": 3,
            "author": "leorapture"
        },
        {
            "level": 0,
            "comment": "As a Brazilian is so cute seeing you learning something we know all our lifes, but also sad because the truth is, I wish I had lived life on an place this isn't necessary.\n\nMixed feelings",
            "score": 3,
            "author": "vinimanock"
        },
        {
            "level": 0,
            "comment": "Hey OP, I've been living in SA since December and bring expensive technology with me everywhere. The best tip I could give is to remain out of areas which may be an issue, and to not make yourself a target. \n\nPersonally, I haven't been in Peru, so I cant speak to there, but I wouldn't dare leave my laptop at home for a month, especially if I were applying for jobs. Ive been in Mexico and Brazil so AFAIK there can be worse areas in these countries than Peru. \n\nI am a male, so that does help, but looking organized and not appearing wealthy will take you far further than your gender will. \n\nOnce you're in your apartment/hotel things are almost always fine. Furthermore, if you don't need to have a bag (luggage or backpack) with you, then don't. Theives see more potential value in a person with bags than they do with one who is only carrying a good attitude.\n\n Cheers, good luck.",
            "score": 2,
            "author": "ImPrettynice"
        },
        {
            "level": 0,
            "comment": "I live in Brazil and work remotely on my laptop. I've been traveling with it frequently for some time and never had any problem, staying in dorms and in private rooms.\n\nDon't leave it unattended or unlocked in your accomodation.\n\nLuggage being stolen is rare, but since I only carry a backpack I always take it with me on buses, mostly because I'm concerned about improper handling and damage.\n\nWalking around in daylight at places that foreigners go is safe. Pickpocketing and snatching are the main concern, so as long your backpack is in your front you will do fine (some skechier neighborhoods are exceptions, better research about each city so you know where to avoid. For example, around Central Train station in Rio is rough). Mugging usually happens when its dark, so I take ubers when I have expensive stuff with me at night.\n\nIt was never necessary to me, but in bigger cities its quite common to see people using their laptops in cafes.",
            "score": 2,
            "author": "penguinintheabyss"
        },
        {
            "level": 0,
            "comment": "I am laptop that wanders around the world. Sometimes I wonder if I should leave home the human which carries me",
            "score": 2,
            "author": "nomadlaptop"
        },
        {
            "level": 0,
            "comment": "I carry my super expensive macbook pro (always at home) and no issues. Plus I have apple care which is nice.",
            "score": 2,
            "author": "ofexagency"
        },
        {
            "level": 0,
            "comment": "One more item which could be stolen. Stick with a tablet or phone",
            "score": 2,
            "author": "SnootyTooter"
        },
        {
            "level": 0,
            "comment": "Install Prey Project on your system.  It can help you recover the system if it is stolen.  [https://preyproject.com/](https://preyproject.com/)\n\nNOTE: I have had a laptop recovered after being stolen in Argentina because Prey Project's software.",
            "score": 0,
            "author": "Weary_Valuable3300",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not in South America lol",
                    "score": 3,
                    "author": "macchinas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "WRONG!  I have had my laptop recovered after it was stolen in Argentina.  Did you personally have a different experience than me?",
                            "score": 1,
                            "author": "Weary_Valuable3300"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are definitely overthinking it. I've been in South America for 3 years (everywhere north of Chile excluding Venezuela 😕) and I have an expensive tablet and my 4K work computer. Never had an issue working out of hostels, Airbnbs and coffee shops. \n\nTake the normal precautions like everyone else has said and you'll be fine. You'll be completely fine in Peru...from Lima to Puño to Cusco to Huacachina. In Rio (not trying to scare you, but) you have to be a bit more mindful because if you look like a target, you will become one there. I've found that I was much more comfortable in other cities in Brazil because I didn't have to always be on guard.",
            "score": 0,
            "author": "AppropriateRecipe342"
        },
        {
            "level": 0,
            "comment": "Hey truthfuldelusion,\r\nIt sounds like you have questions about travel safety. Check out our [Wiki post on safety for solo travellers](https://www.reddit.com/r/solotravel/wiki/stayingsafe) for advice on staying safe out there.",
            "score": 1,
            "author": "WalkingEars"
        },
        {
            "level": 0,
            "comment": "I'd probably buy a uber cheap and basic laptop/tablet to allay some concerns while still being able to be productive.",
            "score": 1,
            "author": "RevelryByNight"
        },
        {
            "level": 0,
            "comment": "You can insure it with allianz or Clements travel insurance! I brought my MacBook to Brazil for a year but always kept it locked somewhere safe or tried not to ever have it too visible while in public. Bring an older laptop instead, if you can, but if not, yours should be fine as long as you keep it somewhere secure",
            "score": 1,
            "author": "verax47"
        },
        {
            "level": 0,
            "comment": "If you have a tablet, get a keyboard for it and use this. If you can’t do that Chromebook would be the next choice for me and last resort would be my laptop.",
            "score": 1,
            "author": "Daddyg2019"
        },
        {
            "level": 0,
            "comment": "You should be fine, especially if you get a private room in the hostels. I travel with my laptop constantly and as long as you aren't leaving it around public spaces you should be ok.",
            "score": 1,
            "author": "Travelling-Cat"
        },
        {
            "level": 0,
            "comment": "Get a backpack with a dedicated laptop sleeve. I got one from Patagonia that is serving me so well. I’m currently traveling through Central America, heading to Ecuador in 2 weeks",
            "score": 1,
            "author": "seblangod"
        },
        {
            "level": 0,
            "comment": "I brought my laptop to Thailand and didn't end up using it.  I just used my phone.",
            "score": 1,
            "author": "jedinachos"
        },
        {
            "level": 0,
            "comment": "Never had an issue.  Watch your bags.  Keep things locked",
            "score": 1,
            "author": "EnthalpicallyFavored"
        },
        {
            "level": 0,
            "comment": "Bring a cheapo that'll only do what you need at bare minimum, no reason or sense in risking good hardware",
            "score": 1,
            "author": "nautilaus6"
        },
        {
            "level": 0,
            "comment": "I travel a lot in Asia. If you’ve an iPad or tablet that isn’t as valuable I’d take that. Also cuts down on the weight.",
            "score": 1,
            "author": "colcannon_addict"
        },
        {
            "level": 0,
            "comment": "I have a brand new MacBook, before my trip to SEA I found a used 2015 MacBook Air for $150 and brought it with me. Won’t be too upset if I loose it",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "bring a cheap one. put it in a normal bag, not a laptop bag. when traveling, always have the bag with you (on your lap, between you &amp; a wall/next seat)",
            "score": 1,
            "author": "CrabbyKayPeteIng"
        },
        {
            "level": 0,
            "comment": "Just keep your laptop bag with you when your travelling and youll be fine, if your smart you’ll survive (unless you’re extremely unlucky) youll be fine however",
            "score": 1,
            "author": "Dazzling-Dog1628"
        },
        {
            "level": 0,
            "comment": "It depends on your individual circumstances and requirements. You might not need to bring your laptop if you are going for pleasure and are not required to work. Nevertheless, bringing your laptop can be useful if you need to work or have other crucial tasks to finish while you are traveling. Be sure to keep your laptop secure while traveling because it's crucial to think about the security of your possessions. Make sure to check whether there are electrical outlets and Wi-Fi in the locations you will be visiting.",
            "score": 1,
            "author": "Plaitoaiapp"
        },
        {
            "level": 0,
            "comment": "I brought my iPad to Colombia. I never brought it out except on the plane and inside my hotel room, so I think that reduced the risk of it being stolen. Also I carried in in a pacsafe bag with two locks on the bag. I used it for doing work and watching movies when I stayed in at night. No tactics are guaranteed to prevent theft, but you can also get insurance. Although it doesn’t fix losing what is stored🤷‍♀️if it’s stolen.\nGood luck!",
            "score": 1,
            "author": "hollyshellie"
        },
        {
            "level": 0,
            "comment": "I travelled SA for 4 months last year and am doing it for 5 months this year with a new powerful laptop and never had a problem.\n\nI trade for a living, hence the need.",
            "score": 1,
            "author": "Connect_Boss6316"
        },
        {
            "level": 0,
            "comment": "I can't give advice regarding bringing it vs. not, but if you decide not to bring it, Amazon has cheap $60 fire tablets (I snagged mine for $40 during a sale) that might be an alternative if you ditch the laptop.",
            "score": 1,
            "author": "dorkface95"
        },
        {
            "level": 0,
            "comment": "Anyone anywhere will steal your laptop or valuable item if the opportunity presents itself.",
            "score": 1,
            "author": "Mzdgaf"
        },
        {
            "level": 0,
            "comment": "I brought my laptop to Peru and it was fine. But, I stayed apartments and didn’t bring it anywhere in public",
            "score": 1,
            "author": "keving691"
        },
        {
            "level": 0,
            "comment": "No. But if you are going to be in hostels or public buses I wouldn't be bringing a very expensive one. \n\nHonestly for what you want to do a cheap Chromebook would work totally great",
            "score": 1,
            "author": "invalidmail2000"
        },
        {
            "level": 0,
            "comment": "You should be safe if you can securely lock it away and minimize your time in open transit to/from the airport, etc.",
            "score": 1,
            "author": "TZshuffle"
        },
        {
            "level": 0,
            "comment": "Keep it locked. Don’t have your phone and smart watch we’re people can see it. Take it from a native of Brazil.",
            "score": 1,
            "author": "Sueli1"
        },
        {
            "level": 0,
            "comment": "I had no problems traveling with a laptop in Peru… I haven’t been to Brazil yet, however.",
            "score": 1,
            "author": "DavTravels"
        },
        {
            "level": 0,
            "comment": "As a very paranoid Brazilian, you just need to be careful. Do not wander with you phone on the street. Always be aware of what you're doing. Use your backpack in front of you. Hold your backpack on your lap when at a bus or other public transport. Do not go into dark alleys or walk on empty streets alone at night. I have never been robbed but I know how things are here. It's not super dangerous, but always be careful. It also depends on where you're going. The south region is fairly safe. São Paulo and specially Rio de Janeiro are more dangerous.",
            "score": 1,
            "author": "Lipe18090"
        },
        {
            "level": 0,
            "comment": "Never leave your belongings unattended, even in the hostel. Always choose hostels/hotels that have a security box/locker and leave your valuables inside. I spent 3 months in Brazil last winter and our hostel in Pipa was robbed. Someone climbed over the fence and got into the dorm that was the closest to the fence and stole 2 iPhones and a laptop that were left charging openly on top of beds while people were in the dinning area having dinner. \n\nAlso never have your iPhone out in your hand while in Brazil. Never. I saw iPhones being ripped out of people hands in broad daylight in Rio and Salvador. In Salvador an iPhone was stolen from the hands of a Brazilian girl right in front of the police car and the police did nothing. They didn’t even flinch when the robber ran away. \n\nI loved Brazil but man.. that was for sure the most dangerous country I’ve been to and I could never got relaxed there, spent all of 3 months being constantly on high alert. Didn’t get anything stolen from me though, unlike some more relaxed and carefree people i met there.",
            "score": 1,
            "author": "cheeky_sailor"
        },
        {
            "level": 0,
            "comment": "It's not dumber that this question lol",
            "score": -7,
            "author": "RexieSquad"
        },
        {
            "level": 0,
            "comment": "I would carry it in a backpack instead of leaving it at the hostel",
            "score": -2,
            "author": "mintycrash",
            "replies": [
                {
                    "level": 1,
                    "comment": "Around the city?! Ahah you never left your neighborhood",
                    "score": 1,
                    "author": "Mendadg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never had any issues.",
            "score": 0,
            "author": "redditmbathrowaway"
        }
    ]
}