{
    "id": "1341m95",
    "score": 0,
    "title": "Germany to Spain with a HK passport",
    "author": "Yuri_Jung",
    "date": 1682885273.0,
    "url": "https://www.reddit.com/r/solotravel/comments/1341m95",
    "media_urls": [],
    "other_urls": [],
    "postText": "I haven’t been able to find much information since there are three countries involved but I’m a minor planning on staying in Barcelona for two weeks, and staying a weekend or two with my friend. However I will have to book hotels for weekdays since Spanish schools don’t have term breaks on the same time as I do\n\nI’m currently boarding in Germany with a HK passport and my school is my legal guardian(except for holidays), and another problem is my visa has also expired (I had an exemption slip from when I returned to home so I was able to get back but I’m not sure about going to and from EU countries)\nCan someone tell me what I need to do in order not to fuck up? Thx 🥲",
    "comments": [
        {
            "level": 0,
            "comment": "Germany and Spain are both Schengen zone countries so if you're legally allowed to be in Germany you shouldn't need a new stamp to go to and from Spain. However if your visa is expired you might want to get that situation remedied, I'm not sure I understand what you mean with your description of your visa situation.",
            "score": 2,
            "author": "WalkingEars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also: if you're a minor there's a decent chance you're not allowed to officially cross borders with a permission from your guardian and/or parents.\n\nYou can check here for all the countries you will enter and exit: https://europa.eu/youreurope/citizens/travel/entry-exit/travel-documents-minors/index_en.htm\n\nIf you go by land there's a decent chance you won't be checked and may be able to skip through (though be aware that France definitely has restrictions on unaccompanied minors crossing borders). If you fly you likely will have your Visa checked and could run into problems there.\n\nAlso check if you can book hotel/hostel as a minor because that's often not allowed too.",
                    "score": 2,
                    "author": "BerriesAndMe"
                },
                {
                    "level": 1,
                    "comment": "My visa expired in March, but I was able to return to Hong Kong and come back with a “fiktionsbescheinigung”(a certificate that states I’m allowed to return without consequence because normally I wouldn’t be able to return with an expired visa)\nI’m just waiting on getting the visa renewed atm",
                    "score": 1,
                    "author": "Yuri_Jung"
                }
            ]
        }
    ]
}