{
    "id": "134mruj",
    "score": 18,
    "title": "Spending Guilt or Being Too Cheap?",
    "author": "hongos_me_gusta",
    "date": 1682948383.0,
    "url": "https://www.reddit.com/r/solotravel/comments/134mruj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi.  Perhaps this is a better post for one of the psychology threads. Regardless, I thought I'd ask here.\n\nQ1:  In planning a trip, booking flights, etc. do you ever experience incredible hesitation and guilt in spending your money on travel? \n\nEven if you got an incredible deal on flights, are staying in a place that costs 10 usd a night, ... you still have a panic about spending $2 - 4k usd on trip?\n\nQ2:  If you feel this guilt, Why?\n\nQ3: How do you resolve that guilt and/or change your plans?  How do you either spend or not spend your money and have fun?!\n\nIn a nutshell, my business is going well and I want to plan a trip for 7 - 10 days duration.  I have been considering either Peru &amp;/or Ecuador with a layover in Bogota. Of course, I don't want to overplan as both Ecuador &amp; Peru have so much to see &amp; do.  Really now is the best time for me to make a trip like this. I've put it off for years. Years past I did not have the money and then I did, but there was the virus.  I don't have children or a spouse to worry about. I'm healthy. \n\nThe problem I have is that I look at flights and what I'd like to do in that time and think the following:  \n\n\"with the price of flights &amp; connections, this is too expensive $$ of a trip.\"\n\n \"7 - 10 days is not enough Time to fly to Lima then fly to Cusco or Iguitos, then back to Lima then to Bogota then home.\"\n\n  \"I'm Solo and won't really have fun spending so much time &amp; money and flying so much. I'll be very worried.\"\n\n\"Maybe I'll just go someplace national I've never been to save $$.\"\n\nI think I just need to CBT write myself out of this. 'Fear Setting' is some kind of exercise that may help.  .\n\nAny input or advice is helpful. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "I usually do not feel guilty about the plane ticket but for the hotel/apartment. I never was a hostel girl and i do prefer some place nice to sleep. When i return i always think that i didn't need to spend that much money. But then i do it all Over again.\n\nEdit: i now travel One place at a time. I used to go to lots of places but my age is not helping and i get really tired from all the flying.\n\nedit 2: autocorrect changed some words to my native language and I did not noticed.",
            "score": 18,
            "author": "quedeusmeperdoe"
        },
        {
            "level": 0,
            "comment": "As long as my bills are paid so my cat has a house and is safe/fed, every trip is worth the spend. As long as it’s within your means and your responsibilities are covered, it isn‘t an issue. \n\nFWIW, I would skip Bogota on 10 days in Peru, acclimating to Cuzco takes time. It’s worth the time but you will need it for that.",
            "score": 8,
            "author": "bakersmt",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the advice. I will dble check, but where I live now is a higher elevation than Cusco, but regardless I'll do that. Have you been elsewhere in Peru besides Lima, Cusco, or Aguascalientes you'd recommend?",
                    "score": 2,
                    "author": "hongos_me_gusta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check out Arequipa/Colca Canyon.  One of my favorite places in Peru now.",
                            "score": 3,
                            "author": "IBIUBU_23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks for the suggestions. I was looking at taking a bus to the town of Cachora or Apurimac. though, I'm open to anything.",
                                    "score": 1,
                                    "author": "hongos_me_gusta"
                                },
                                {
                                    "level": 3,
                                    "comment": "You are so right! Colca Canyon was one of my favourite places, it's higher up than Machu Picchu on my list, and I just fell in love with Arequipa.",
                                    "score": 1,
                                    "author": "biold"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Money is meant to be spent. Why feel guilty about spending to enjoy life. \n\nDon’t overthink too much. \n\nAfter more than 10 years travelling, I don’t book or plan more than 3-5 days ahead to have flexibility. \n\nWhile it’s good to have itinerary and plan what to do, see and eat, trying to fit everything is often very tiring. It also takes away the joy of discovering. \n\nJust go and have fun. Keep track of your expenses if you’re on a budget.",
            "score": 39,
            "author": "BoringCanary",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do this too. I'll get the flight and car rental booked but for actual itinerary, I'll book tickets for stuff the night before depending on my mood. It's super freeing to have 10 days with no real plans other than to explore and have fun.",
                    "score": 6,
                    "author": "LaHawks"
                },
                {
                    "level": 1,
                    "comment": "Money is also meant to be saved and used for \"needs\" like housing, food, health care.",
                    "score": -1,
                    "author": "JahMusicMan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of people that grew up not wealthy or relatively poor have this mentality including me. I have just started realizing that all the money I try to hoard means way less nothing compared to the memories I will make and remember for years to come.",
            "score": 7,
            "author": "thaisweetheart"
        },
        {
            "level": 0,
            "comment": "Travel is an expensive hobby, but it's cheap therapy.",
            "score": 32,
            "author": "Willum",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Travel is an expensive hobby, but it's cheap therapy.\n\nLove this quote! Thanks for sharing.",
                    "score": 1,
                    "author": "gotthelowdown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My grandparents and parents all planned to travel when they retired and were unable to due to illness. My mom is looking after my dad and tells me all the time she wished they had traveled earlier and I should travel as much as I can because your health isn't guaranteed.\n\nI have a budget that's pretty specific and I put aside money for savings and for traveling whenever I get paid and I do not ever feel guilty spending money on travel. It's what I'm interested in doing and I'm not going into debt to do it.",
            "score": 6,
            "author": "Neither-Dentist3019",
            "replies": [
                {
                    "level": 1,
                    "comment": "My husband and I travelled a lot because we knew that his health would put an end to travels. We really enjoyed it. He died last year, and this year I'm going to travel a lot, because there are so many places to visit and so little time - Carpe Diem!",
                    "score": 5,
                    "author": "biold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this is where budgeting comes in handy - not just budgeting while you're on a trip, but having a budget in your day to day life which includes a \"travel fund\" containing money you set aside specifically for travel and other fun stuff. I sort of switched to this method of keeping track of money and it makes things a lot easier, because even if a flight is more expensive than I thought, as long as it's coming out of the \"travel fund\" it's just spending that money specifically on what it's meant to be spent on",
            "score": 22,
            "author": "WalkingEars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! When I think I want take out or a coffee I often just think “do I want coffee here or on the trip?”. It’s surprising how quick things like Uber eats, drinks in bars, taxis, etc add up",
                    "score": 8,
                    "author": "TheLindberghBabie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I calculate the cost of things I want (not need) in terms of what I'd get if I spent that amount on travel instead! Like if I'm tempted to buy a new phone because it's on offer, I'd think \"this costs a return flight to Europe\". Or if it something small, it could even be \"this is the price of a coffee / gelato in Italy!\". I find it a bit amusing tbh.",
                            "score": 2,
                            "author": "melusina721"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is exactly how I do it. I have a separate savings account that I've labelled \"travel fund\". In addition to saving a certain amount each month in it, I also use it to deposit any extra money that comes my way -- bonuses at work, birthday gifts, tax refunds, unexpected income, etc. In addition, anytime I manage to be under budget in other areas of my life, the savings go to the travel fund. Skip that coffee at Starbucks for a month? Travel fund. Clip coupons to save on groceries? Travel fund. You get the idea.\n\nAt first, it started off very modest. But I've been doing this for more than 20 years and have amassed a healthy amount in the travel fund over the years. \n\nAnd now, whenever I travel, I spend money that already exists in the travel fund, totally guilt-free and without the stress of wondering whether I'm short-changing other aspects of my life. I've done this because travel is a priority for me. So I've made it a financial priority by setting up my budget this way.",
                    "score": 8,
                    "author": "segacs2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an easy one ;-)\n\nQ1 No....I work,I earn my money.I can spend it on what I like.\n\nHaving said that,there are things i would like to do but can't justify the cost.That is not guilt though,that is knowing I can get much better value for money going somewhere different!",
            "score": 3,
            "author": "lucapal1"
        },
        {
            "level": 0,
            "comment": "I maintain a very detailed budget in my day-to-day life and have carefully set aside an ample emergency fund, I'm fully funding my retirement accounts to meet my retirement savings goals, I have no debt, and I have a set percentage going to charity. Knowing (and reminding myself) that my financial house is in order helps me not feel guilt about spending money on travel.",
            "score": 4,
            "author": "ihatekale"
        },
        {
            "level": 0,
            "comment": "My logic is that: I save all the money I can at home and I’m going to be generous to myself to do whatever I want when traveling. Whatever makes me happy and whenever my finance can support, I feel no guilt at all.",
            "score": 3,
            "author": "Admirable_Mango_7683"
        },
        {
            "level": 0,
            "comment": "My spending guilt comes from souvenirs I later wished I'd bought. In Marrakesh I haggled with a vendor over a metal \"Alladin's\" lamp for twenty minutes, getting him down from his original price of $100 down to $20. I wanted it for $15 and ended up walking away. When I got home, I wished I'd just paid the $20 because i really did like that lamp. \n\nThis has happened with lots of other things on my travels - a magnet i wished I'd bought at Neuschwanstein Castle, a headscarf in Petra, a figurine in Malta, a plate in Italy, etc.\n\nI've missed out on unique travel souvenirs just because i was too cheap to pay a few extra bucks. Things I doubt I can ever buy again, and even if I found them cheaper online, they don't have the same sentimental value.",
            "score": 3,
            "author": "BrazenBull"
        },
        {
            "level": 0,
            "comment": "At the end of each year, I budget for all of my spending categories for the next year and my travel budget is usually nice and thick. Once my travel budget bucket is established, I don't mind spending out of it as, well, the purpose of it is to be spent on my traveling hobby.\n\nThe only time I feel bad about spending is if I purchased something usually non-refundable and then see that the price dropped shortly after I already purchased... but I think we can all agree that that feeling sucks! OR seeing a low price on Monday and dragging ass to book and then by Thursday it's already almost double what it was. Man!\n\nIn life -- I don't mind spending money on travel, food, and photography equipment BUT I also have a savings bucket so I'm not one of those people who spends it all as soon as it gets in. My budgeting spreadsheet is a work of beauty and I have savings to cover me for the next 10 years \"in case shit\".",
            "score": 2,
            "author": "NewTeeth2022"
        },
        {
            "level": 0,
            "comment": "Travel, for most people, comes out of our discretionary income. If your bills are paid, you’re happy with your savings, and you’re not going to put yourself in a bad financial situation from going on this trip (or any other trips) then it’s completely a person decision how much you are comfortable with spending.\n\nNearly every day we spend on things we don’t absolutely need. A summer clothing haul, a new video game coming out, a nice bike, ordering Uber Eats instead of cooking, etc. To me, travel is just like all of those things spending-wise. I just my “fun” money for something that brings me joy, just like anyone else would with whatever they’re into. Spending $2-4k on a trip like that is pretty typical.\n\nAll in all, we only have one life to live and if you don’t allow yourself to experience these amazing places while you have the time/health/money, you may feel much worse guilt later down the line when those things start to decrease.",
            "score": 2,
            "author": "avii7"
        },
        {
            "level": 0,
            "comment": "Q1: Yes, sometimes I do. As much as I’d like to say no, the truth is that I sometimes do feel hesitation. \n\nQ2: I think mostly because I didn’t grow up with a lot of money, because I’ve been taught how important it is to earn, save, and invest, and because I don’t spend that much money in day-to-day life so bigger purchases come always come with a bit of sticker shock, regardless of how well I’ve planned, saved, and invested for them. \n\nQ3: This question has a two-fold answer for me. \n1. I try to change my mindset—if I want to be earning more money, I might as well be at home doing that rather than doing it while I’m traveling, otherwise I’m wasting my time and money being stressed. (Compartmentalizing my thoughts)\n2. I move all the money I’m willing to spend into a separate account so that I can keep track of it more easily without having to count every penny. (Compartmentalizing my money)\n\nI hope this helps :)",
            "score": 2,
            "author": "sunshinecat16"
        },
        {
            "level": 0,
            "comment": "I think I had the opposite experience. My wages were meager for so long that when I switched jobs and my income doubled, I couldn’t make travel arrangements fast enough. I was 39 when I went overseas for the first time. Solo trip: 10 days, Paris/Amsterdam. I didn’t feel guilty because I was finally able to afford something on this scale on my own. This is your reward for doing things right on your timeline; don’t overthink it. Have fun!",
            "score": 3,
            "author": "Busy_Principle_4038"
        },
        {
            "level": 0,
            "comment": "Life is too short. As long as you have savings and consider yourself a financially educated person there's nothing to fear. You know your boundaries and your limit. Money is meant to be spent on vacation and other pleasant activities too. That's actually a necessity to keep your mental health safe.\n\nBut if you are playing with money that is short or that is not sufficient for a emergency reserve then yeah I would feel kinda guilty.",
            "score": 1,
            "author": "Swish46"
        },
        {
            "level": 0,
            "comment": "Q1: No. If I can afford it, why on earth would I feel guilty?\n\nLife is too short to waste on useless guilt.\n\nGood luck on your travels.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Money is convenience. Depending how lazy im feeling, I’ll spend different amounts. If I want to rough it for awhile and live on ramen packs and pasta I can, but sometimes I like to buy myself a room for a night and enjoy myself. The key is to have enough to be comfortable with most things that can go wrong. If you know you can buy your way out of a bad situation (breakdown, losing ticket, etc etc) you should feel comfortable spending it during good situations.",
            "score": 1,
            "author": "chenkie"
        },
        {
            "level": 0,
            "comment": "I spent 6k on a trip in November and 8k on a trip in March. I’ve been thinking about that 14k a little bit… to be honest",
            "score": 1,
            "author": "Alyx-Kitsune"
        },
        {
            "level": 0,
            "comment": "OMG, I thought I was the only one who did this. I'm not rich or even well-off enough by any means. I am a Ph.D. student in Paris, so go figure. But part of what I have realised is that I am always unable to spend money on a holiday. It always kinda feels like a waste to me. Don't get me wrong, when I do travel, I find it wonderful but the homework before the trip is what makes me overthink.",
            "score": 1,
            "author": "ayushpandey8439"
        },
        {
            "level": 0,
            "comment": "You'll never get to the end of your life and think \"I wish I spent less of my money traveling\"\n\nHaving the best experience you can have is priceless - that includes not stressing about it",
            "score": 1,
            "author": "SkewedX",
            "replies": [
                {
                    "level": 1,
                    "comment": "You absolutely can.  Being old and unable to retire because you blew your money in your prime saving years could lead you down an awful road.",
                    "score": 1,
                    "author": "Oftenwrongs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel the guilt. It’s because my brain hasn’t caught up from my poor/really frugal days. I have the means to travel often now, but I still feel that residual guilt about spending on something non essential because that used to be my reality for several years.",
            "score": 1,
            "author": "145gw"
        },
        {
            "level": 0,
            "comment": "Dude, I was having a bad day and I spent 350$ on a luxury hotel in budapest. Meanwhile I’ll stay at an 8$ hostel on other days",
            "score": 1,
            "author": "Gogh619"
        },
        {
            "level": 0,
            "comment": "Yes, sometimes I feel guilty. But not for the reason you may think. \n\nI’m single, in my 40s, and comfortable financially. What that means to me is I’m hitting my budget goals and feel confident I can afford what I’ve prioritized. We all value different things so my version of “too much” spent for travel likely isn’t helpful. \n\nI feel guilty because I know I’m doing something so many people can’t afford. Like they are making tough choices in the grocery store, putting something back. I have family who are eking out the last of savings after a job loss. I live in a city where homelessness and addiction is very much in your face right now. And I think about going away this month and feel a mix of guilt and gratitude that I have the option. \n\nHow I deal with this is to remind myself of a few things:\n1. I share my finances through planned giving. \n2. It is a good thing that I work hard and budget. \n3. Even hard workers can fall on hard times. I’m grateful for those that taught me to plan ahead and have an emergency fund. \n4. I’ve been through a lot of hard times. It is ok then to enjoy when it’s my turn at the good times. \n\nI hope you find that sweet spot where you can take care of your future AND live for today doing what you love.",
            "score": 1,
            "author": "staybackloretta"
        },
        {
            "level": 0,
            "comment": "I feel guilty not spending it. Examples being florentine steak and singapore chili crab. Both are premium meals and i had decided not to splurge. Now i regret it! But i am going back to florence in 2 weeks!",
            "score": 1,
            "author": "Prize-Contest-6364"
        },
        {
            "level": 0,
            "comment": "Sounds like you are smart with your money in every day, life, and if that’s the case, don’t stress. If you can afford to pay your bills regularly and aren’t in debt, there’s nothing wrong with spending money on what makes you happy. Like so many people have said, life is short. And you never know what’s around the corner. You could live for another 50 years, but you can get sick tomorrow. If traveling is something you want to do, figure out a way to do it. \n\nI was like you, though, still am in some ways. Pre-pandemic I always found great deals on international flights and I know I saved a lot of money when I made those deals work. I like to stay in places that are clean and comfortable, but are not five star resorts. For activities, I pick things that appeal to me and not just what the guidebook says you must do. So I know over the years, I saved a ton of money traveling the way that I do. But still, last fall, I went back to Australia with others, and because of the state of travel, flights and lodging were ridiculously expensive. I almost backed out because it just seemed ludicrous that a trip like this would cost more than I’ve ever paid. And then the pre-pandemic days, I could probably get 2 to 3 trips out of what I paid for this one. But, in the end, I told myself through my planning I saved tons of money, and just like buying gas, sometimes you buy gas when it’s really cheap and other times you buy it when it’s super expensive, but it balances out. I don’t spend a ton of money on other vices like going out to eat all the time, drinking, sporting events, going to concerts, nightclubs, etc., so I give myself permission to spend money on things that bring me joy… And travel is it. \n\nLike I said, I still do struggle, sometimes with following my own advice… I have time off this summer, and really want to go somewhere, but looking at prices, I’m aghast. But in the end, I’ll probably find somewhere to go. \n\nI feel as though I’m a better person for it in so many ways. And they also recognize that one day, circumstances may keep me from traveling, whatever they may be… so I may as well take advantage of the opportunity that I have today. \n\nIf you want to go, by all means, don’t stress. Have a great time planning and enjoy your trip!",
            "score": 1,
            "author": "CSq2"
        },
        {
            "level": 0,
            "comment": "Most of my 7-10 day trips run anywhere from $2500-4000 normally anyway, so I don't have a problem with it.  That includes everything, flights, hotels, rental car/gas, parking, visas, etc.\n\nThe only regret I have is not being able to travel enough!\n\nI've flown Texas to Buenos Aires several times just for a long weekend, 2-3 nights.",
            "score": 1,
            "author": "valeyard89"
        }
    ]
}