{
    "id": "135lyg2",
    "score": 4,
    "title": "2 weeks in Vietnam itinerary",
    "author": "neondeers",
    "date": 1683035845.0,
    "url": "https://www.reddit.com/r/solotravel/comments/135lyg2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, as the title suggests will be going to Vietnam for a couple of weeks, travelling south to north. Generally not as interested in big cities and want to experience more of the natural beauty, good food, and local culture. This is my itinerary at the moment:\n\n1. Fly into Ho Chi Minh and stay there for a couple of nights. Do a walking tour and explore the street food scene. \n\n2. Fly to Da Nang then head straight to Hoi An for 4 days. Do a cooking class, boat trip through the lanterns, explore the markets, and just generally chill out on the beach. \n\n3. Fly to Hanoi for a few days, explore the city a little and do a day tour to Ha Long Bay. \n\n4. Do a 3 day Ha Giang loop tour. \n\n5. Back to Hanoi for a couple of days to check out anything I didn’t have time for earlier and then fly out. \n\nAny tips / guidance much appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like you're planning a trip around Southeast Asia. Check out solotravel's [detailed guide to planning a solo Southeast Asian trip](https://www.reddit.com/r/solotravel/wiki/seasiatrip) for general planning advice plus useful tips and tricks for Southeast Asian travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Looks good, only recommendation might be to do the 4 day Ha Giang loop tour instead of 3 - I did the 4 day every person I met who did 3 says they wish they'd done the extra day. You may also like to spend a night or two in Ninh Binh, much more quiet compared to Hanoi",
            "score": 6,
            "author": "barley77"
        },
        {
            "level": 0,
            "comment": "Awesome, happy travels!\n\nDon't miss the water puppet show in Hanoi",
            "score": 2,
            "author": "uu123uu"
        },
        {
            "level": 0,
            "comment": "I recommend not to miss Phong Nha ke Bang national park. I did the one night trip to Hang En. It wasn’t just the best part of my trip to Vietnam but it may be the most incredible experience I’ve ever had traveling.",
            "score": 2,
            "author": "zekerthedog"
        },
        {
            "level": 0,
            "comment": "Ho Chi Minh to Da Nang and Da Nang to Hanoi are easy night trains if you want to save on accommodation and CO2 emissions",
            "score": 1,
            "author": "love_sunnydays"
        }
    ]
}