{
    "id": "135o069",
    "score": 98,
    "title": "What to do when your room gets cancelled last minute and you have no idea what to do?",
    "author": "MotherDragon003",
    "date": 1683039614.0,
    "url": "https://www.reddit.com/r/solotravel/comments/135o069",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm in Portugal and I found a place for 3 months where I was suppoed to move in on May 4th. All was set until 2 ago when it got cancelled. I'm already in Portugal for 1 week in an airbnb until I moved into the room which is now cancelled.\n\nHowever now with it being such last minute, I'm finding it exteremly hard finding something for the next month. I'm debating getting a flight and returning back to the US (where im from) because it feels hopeless lol. I'm also looking into spain and france and again finding it super hard finding somehting last minute. I almost just want to give up and purchase a ticket back. I have no idea what to do or where to go\n\nAnyoen been in this situation or advice?",
    "comments": [
        {
            "level": 0,
            "comment": "Just stay in a hotel/hostel for a few days while you keep looking for a place. Much cheaper than any flights back to US will be",
            "score": 225,
            "author": "spaderr",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way. I also found that in Portugal 4 star hotels were comparable to private rooms in hostels. Either are a good option!",
                    "score": 51,
                    "author": "TravasaurusRex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take a deep breath…maybe a walk, some good food, look at all the options. Many.\nSpain is right next door, huge…amazing. Could easily break it up into 3 one month stays in cool places.",
            "score": 158,
            "author": "tombiowami",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great advice. There are options out there, it just takes a lot of time and patience to search and find them. You could also reach out to AirBnB to see if they can help, I've had them offer before in last minute cancellation situations.",
                    "score": 28,
                    "author": "fermentedAlex"
                },
                {
                    "level": 1,
                    "comment": "This is good advice, but I'm sorry I found it funny that you said \"huge... amazing\". I read that in Donald Trumps' voice.\n\nMaybe I've got the mind of a 12 year old.",
                    "score": 8,
                    "author": "Immediate-Highway340",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha! I hear you…my excitement and tendency for hyperbole is prob my only connection with Mr Trump. Too funny :-)",
                            "score": 4,
                            "author": "tombiowami"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A different AirBnB place\nHostelworld.com\nHotels.com\nFind a local subreddit and make an inquiry or seek advise",
            "score": 32,
            "author": "weolo_travel"
        },
        {
            "level": 0,
            "comment": "This happened to me before! (on a smaller scale) I recommend like someone else said to just book a place for a night or two since that will be easier to find (compared to longer stays) and you need extra time to find a place you'd like for your long term stay. It can be frustrating but you'll find some combination of changing accommodations halfway or changing locations slightly that will make this work. Don't go home, just yet! Sleep on it for a night or two then you can go home if you're still not liking the situation in a few days.",
            "score": 29,
            "author": "WittyPrattler"
        },
        {
            "level": 0,
            "comment": "What was the reason for them canceling last minute? Can you find a place in a smaller town in portugal? Sorry to hear what happened and keep us updated on if you are able to find someplace to stay",
            "score": 18,
            "author": "harukasweet",
            "replies": [
                {
                    "level": 1,
                    "comment": "They don't need a reason, they just cancel. Same happened to me in Sicily. There's no guarantee at all with Airbnb, you are on your own.",
                    "score": 10,
                    "author": "FalseRegister",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hosts get dinged for doing that in the USA.  Why is it different in the EU?",
                            "score": 2,
                            "author": "Spangler928",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No clue if they don't, and don't really care about what happens to hosts.\n\nThe fact that you can be cancelled literally last minute and left stranded by the platform is already terrible. \n\nThe surprising part for me is that there is no regulation for this in the EU.",
                                    "score": 3,
                                    "author": "FalseRegister"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find a hotel",
            "score": 11,
            "author": "Lorentz_Prime"
        },
        {
            "level": 0,
            "comment": "Happened to me with my Airbnb.\n\nNot only did my place get cancelled, but my credit card was full due to the 1-2 month reservation I made on it.\n\nI had to call Airbnb like half a dozen times and wait on call with them for hours at a coffee shop in Mexico with my luggage beside me. And it was nearing night time. Eventually they allowed me to message people with cash requests for a few nights until my CC gets paid off (takes a few days).\n\nIt was a nightmare. Very stressful. It was also March, so most everything was booked except the stuff x3 the original price. I got lucky finding a place.\n\nNever rely on Airbnb. I was cancelled on last-minute twice now.",
            "score": 8,
            "author": "thenuttyhazlenut"
        },
        {
            "level": 0,
            "comment": "start with 1 month increments, shared room if you have to, hostel for the first week or so if need be - the 2nd and 3rd months should be much easier",
            "score": 19,
            "author": "aqueezy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I usually set my search for 28 days as thats when the monthly discount kicks in. Hopefully that way there are more options.",
                    "score": 7,
                    "author": "fschwiet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are a female, I recommend host a sister Facebook group!!!",
            "score": 18,
            "author": "fossa__wet"
        },
        {
            "level": 0,
            "comment": "Talk to a hostel about your situation!! Sometimes they offer work trades for living there.",
            "score": 7,
            "author": "endofthesouthbay"
        },
        {
            "level": 0,
            "comment": "Do couch surfing until you find a room. There’s groups in facebook or other platforms. Sleep at the airport? Book in a smaller city nearby?",
            "score": 4,
            "author": "it_me1"
        },
        {
            "level": 0,
            "comment": "Hostel and for long term: register at [workaway.info](https://workaway.info) (requires a minor membership fee to be able to use it) its a platform for private people and hostels and farms etc offering people free accomodation(sometimes also payment) in exchange for a few hours of daily work. Maybe you find a host that is spontaneous and takes you in. You'd also get to know locals that way.",
            "score": 4,
            "author": "Viscoct"
        },
        {
            "level": 0,
            "comment": "In addition to all the other great tips I would consider looking into university towns or near major universities in larger cities. I don’t know about Portugal,  Spain, and France first hand but students are always looking for short term sublease tenants.",
            "score": 4,
            "author": "JTernup"
        },
        {
            "level": 0,
            "comment": "You could also pivot to a less expensive less touristed country nearby that has more lodgings. Such as Croatia",
            "score": 5,
            "author": "middlewhole"
        },
        {
            "level": 0,
            "comment": "Where in Portugal are you? You could look for sublets on the expat FB groups. I found my first place on the Porto Expats FB group.",
            "score": 9,
            "author": "DorianGraysPassport"
        },
        {
            "level": 0,
            "comment": "Look into workaway or wwoofing, you can work for free room and board",
            "score": 6,
            "author": "limpbisquick123"
        },
        {
            "level": 0,
            "comment": "Boutique hotels are the way to go. Just do a little research and choose the one that works the best for you.",
            "score": 5,
            "author": "NoRingsCity7"
        },
        {
            "level": 0,
            "comment": "Have you looked into spotahome? I don't know what they have in Portugal, but I booked a two month stay in Spain using them.  I did book mine for the summer months ago, but it's meant for stays over a month, so worth a shot!",
            "score": 2,
            "author": "No_Eggplant_9972"
        },
        {
            "level": 0,
            "comment": "France will be much harder to get an apartment it short notice. Have you checked monthly stays on airbnb?",
            "score": 2,
            "author": "cptmorgantravel89"
        },
        {
            "level": 0,
            "comment": "Doesn't Airbnb have a guarantee and alternative accommodations for when the host cancels last minute like that?",
            "score": 2,
            "author": "mountainruby"
        },
        {
            "level": 0,
            "comment": "Get a cheap hotel and contemplate a Plan B. Dont act on emotion and fly back. Unless you think it out very thoroughly. Chances are you will find another place, dont be too picky, if its in your price range, safe, clean, it will get the job done.\n\nTheres ALWAYS a place. Even if it means having to stay in a hotel long term",
            "score": 2,
            "author": "amazonri"
        },
        {
            "level": 0,
            "comment": "maybe look for areas/towns off the beaten track?",
            "score": 2,
            "author": "CrabbyKayPeteIng"
        },
        {
            "level": 0,
            "comment": "Couchsurfing",
            "score": 3,
            "author": "Schroding3rzCat"
        },
        {
            "level": 0,
            "comment": "Why not just kick it in a hostel for a while until you sort it out?\n\nNo need to be so dramatic and abandon the rest of your trip. Plenty of other options.",
            "score": 3,
            "author": "Spadeninja"
        },
        {
            "level": 0,
            "comment": "booking.com -&gt; Map view -&gt; book next one\n\nMaybe sleeping at a night at the beach. It's not too bad in PT.\n\nLol.. flying back because of a cancelled hotel.. oh dear. Sucks a bit.. but pretty pretty much a non-event.",
            "score": 4,
            "author": "Nice-Reception5382"
        },
        {
            "level": 0,
            "comment": "Go out drinking. Meet some locals and buy them a round. See if they have ideas.",
            "score": 3,
            "author": "Colonel_Dent"
        },
        {
            "level": 0,
            "comment": "Please don’t take this the wrong way but if your default to go back to the the US and rant on a sub at the first sign of inconvenience, you might not be a good fit for your chosen travel style. Just know that is not uncommon at all for AirBnB in Portugal or anywhere else. AirBnb customer service MAY be able to help find accommodation and although I would def try that first, I would not hold my breath and have a plan B. Most hotels and hostels this time of the year are far from at capacity and would not have any issue taking a walk in off the street.",
            "score": 2,
            "author": "Immediate-Ad-5878"
        },
        {
            "level": 0,
            "comment": "Egg that persons house",
            "score": 1,
            "author": "yezoob"
        },
        {
            "level": 0,
            "comment": "Take a different room? A hotel?",
            "score": 1,
            "author": "TravelerMSY"
        },
        {
            "level": 0,
            "comment": "are you traveling long term or digital nomading?",
            "score": 1,
            "author": "demolitionrob"
        },
        {
            "level": 0,
            "comment": "I've seen some nice places in Southern Spain.  Ranges from 70-150 per night on air bnb.",
            "score": 1,
            "author": "khmerguy"
        },
        {
            "level": 0,
            "comment": "https://www.couchsurfing.com/places/europe/portugal\n\nLook here!  You won’t be without a bed for the night!",
            "score": 1,
            "author": "Zorrolitto"
        },
        {
            "level": 0,
            "comment": "Portugal has some of the best hostels in the world. Home Hostel in Lisbon, for example, was absolutely amazing. At the time I visited, they made home cooked meals every night. Even made a turkey on thanksgiving.",
            "score": 1,
            "author": "dj-Paper_clip"
        },
        {
            "level": 0,
            "comment": "use workaway to find a place to sleep and learn something",
            "score": 1,
            "author": "Sea-Space-6983"
        },
        {
            "level": 0,
            "comment": "Lateral thinking might help, after you go for a head-clearing walk to remind you THAT YOU ARE ON A DIFFERENT CONTINENT, HOW COOL IS THAT DUDE!\n\nOk: you plan to be there for a while, cool.\n\nHow about travelling around a little, go to places that are lower in price for the same quality. A few weeks in one city/country, a few in another?\n\nI'm assuming money is a factor, so sorry if I'm wrong. \n\nOften apartments are surprisingly cheap Monday-Thursday, and with kitchen access you can save money on food. Friday - Sunday go for a cheaper hostel option.\nYes, it means moving once or twice a week, which can suck, but you will probably find a rhythm and get more for your money. You'll also have somewhere a little nicer to stay regularly, hopefully. \n\nI use Booking.com regularly, after a set number of bookings you get into their 'Genius' levels where you can get discounts and stuff too.\n\nIt might be worth checking your local embassy or consulate too, they might not be able to help directly, but I doubt you're the first to run into these problems and they could point you in the right direction?\n\nAlso: see if you can find out when the university year ends locally. Maybe student rentals will free up in a few weeks and you can find somewhere reasonable for a longer period later on.\n\n\nAll the best, don't go home if you can help it. These next few days will become a fun story in the years to come. X",
            "score": 1,
            "author": "spudfish83"
        },
        {
            "level": 0,
            "comment": "Lots of good advice here that I can't add on to, I just wanted to share that a similar thing happened to me in Lisbon, only it got cancelled the same day I had to check in. Its scary, I'm sure your stress-levels are through the roof, but I don't think you should book a flight back home, I think you'll end up regretting it. Follow the great advice here, persevere and you'll get it sorted, and then have an awesome experience!",
            "score": 1,
            "author": "BeachJenkins"
        },
        {
            "level": 0,
            "comment": "If you are female there is something called hostasister on Facebook - women hosting other women. If you put out an emergency situation like this then other women in the country will host you.",
            "score": 1,
            "author": "Spiritual-Hand-9563"
        },
        {
            "level": 0,
            "comment": "Hi! Portuguese renting a place here. Try the sites \"Idealista\", \"Imovirtual\" and \"OLX\". Try to look for some places a bit further from the city centers!",
            "score": 1,
            "author": "lc_marques"
        },
        {
            "level": 0,
            "comment": "Ask the hotel for a better solution. If there's no more room left, ask for an alternative hotel that's nearby.",
            "score": 1,
            "author": "visigraph23"
        },
        {
            "level": 0,
            "comment": "Take a walk and ask at all the places with a hotel/lodge/rent (and similar in local language).\nUsually, only a low percentage of the available accommodations have online listings, and walk-ins can lead to good deals or people finding a connection for you.",
            "score": 1,
            "author": "ayamflow"
        },
        {
            "level": 0,
            "comment": "Find a hidden bush in a park and sleep under it. Work for me in NYC, Tokyo, London, didn’t work in Rome though. Their parks were too well kept",
            "score": -17,
            "author": "The_Wandering_Chris",
            "replies": [
                {
                    "level": 1,
                    "comment": "This man's a survivor adventurer. Respect ✊...  sometimes legends are born..",
                    "score": 1,
                    "author": "SH0mBIE_BABA"
                }
            ]
        }
    ]
}