{
    "id": "1371zso",
    "score": 1,
    "title": "Looking for suggestions for my trip to Switzerland (Zermatt and Interlaken) during early May",
    "author": "Adolfvonschwaggin",
    "date": 1683153551.0,
    "url": "https://www.reddit.com/r/solotravel/comments/1371zso",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'd normally google everything on what to do where, but I understand some places are closed in May, so I'm here to ask on what's best to do in Zermatt and Interlaken during my visit in early May.\n\nI'm about to go to Switzerland on a solo trip from May 5 - 8. I'm arriving in GVA and departing from ZRH, but I'm not really interested in big cities so I probably won't spend much time there if at all. Main objective is to see the gorgeous Swiss sceneries and maybe day hiking if possible (no longer than 6 hours per hike). Also, it seems like it will rain during my stay there and so I'm also looking for alternative itinerary (indoor) suggestions should it rain.\n\nI haven't finalized my itinerary yet, but here is my rough plan:\n\n**May 5 (Zermatt)**\n\n* Arrive in Zermatt around 10am. Spend a few hours exploring Zermatt and then lunch.\n* After lunch, go to Gornergrat to get a nice view of Matterhorn and then take a hike from there. I'm not sure where to hike yet since I have no idea which trails are going to be open, but I'm looking for a 2-5 hours long trail. Any suggestions?\n\n**May 6 (Zermatt/Interlaken)**\n\n* Spend morning and afternoon in Zermatt and its surrounding areas. I'm not sure what to do yet for this day. Open to suggestions.\n* Leave Zermatt for Interlaken in the afternoon or later afternoon depending on whether I feel like there is still I need to see/do in Zermatt. Spend the evening in Interlaken. Might explore the city if I still have energy left. What can I do during night time there? I don't go to clubs and I don't really drink.\n\n**May 7 (Interlaken)**\n\n* Visit Lauterbrunnen and Grindelwald. Am I right to feel it is stupid to do both in one day? Or can I do just one of them? I'm leaning towards Lauterbrunnen. What are your thoughts?\n\n**May 8 (Interlaken/Zurich)**\n\n* Spend my morning in Interlaken. Not sure yet where to go. This will depend on where else I can go. If nothing else, take train to Zurich as early as possible.\n* Spend some time in Zurich and then be in the airport no later than 4pm.\n\n&amp;#x200B;\n\nExtra questions:\n\n1. Would it be wise to buy Swiss Pass (or the Half-fare Pass) considering my rough itinerary thus far? Moving between cities will cost me about CHF 100 total, but that doesn't include internal transits and touristy rides.\n2. Are there places to swim during early May? I have no issues with cold water, but I don't want to be the only person swimming.\n\n&amp;#x200B;\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "This is an awkward time of year in terms of what is open and doable. Check webcams and go to the local tourist info office.\n\n&gt; After lunch, go to Gornergrat to get a nice view of Matterhorn\n\nIf it is clear when you arrive then grab some food from the shops and just go straight up for lunch on the mountain. You can see Zermatt quickly enough later.\n\nGornergrat is probably still covered in snow, but you could likely walk down to Zermatt from one of the lower stations.\n\n&gt; Visit Lauterbrunnen and Grindelwald. Am I right to feel it is stupid to do both in one day?\n\nYou can do both easily enough, though again the villages are not all that special. I would go for the valley rather than the village.\n\n&gt; If nothing else, take train to Zurich as early as possible.\n\nYou could take the train via Luzern and get off somewhere like Brienz for a look around.\n\n&gt; Are there places to swim during early May?\n\nYou can jump in the lakes by Interlaken, there won't be many other people doing the same at this time of year mind.",
            "score": 2,
            "author": "travel_ali"
        },
        {
            "level": 0,
            "comment": "If you choose to get the Swiss pass, I think it might include the train up to Jungfraujoch as well.",
            "score": 1,
            "author": "TrinityIsNotMyName"
        }
    ]
}