{
    "id": "137gcm4",
    "score": 422,
    "title": "Taking photos whilst solo",
    "author": "kinder3628",
    "date": 1683195437.0,
    "url": "https://www.reddit.com/r/solotravel/comments/137gcm4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all\n\nI’m gearing up towards my first solo trip. I’m going to Prague for 3 days and super excited! \n\nI’m really looking forward to going solo,but confused on how to take photos. Want to take some full length pics rather than just selfies and wondering the best way to do this? I don’t want to keep asking pestering people to take photos of me and want to figure out how to do it myself as i’m planning another solo trip to NYC in Oct as well. \n\nIs it to set timers and place the phone on the ground. Kind of scared someone might take my phone if I do that? Sorry if i’m being super dense, but any advice is welcome!! \n\nThank you!!\n\nEDIT : Hi, so comments asking why I want the photos. To be very transparent I had a really difficult childhood both mentally/financially and i’ve missed out on a lot growing up. However, I am extremely grateful to live in a country where I had opportunities to study/work and ive got a good job now. I realised I have very little photos (due to reasons stated above) and it was the least of my priorities but I think it would be great to start taking some now to serve as nice memories when i’m older. I’m definitely not going to go abroad and take 100’s of pics but I would like to hold myself account to getting 2-3 nice pics per holiday so I have positive memories to reflect back on.",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t know why people are being so rude about someone wanting photos that aren’t selfies, I think it’s totally normal to want a variety of pictures. Sometimes a selfie just doesn’t capture everything you’d like it to. \n\nI also don’t like asking people to take pictures of me, so I usually I ask people if they would like me to take a photo of them (or they offer) and then I ask if they wouldn’t mind taking a photo of me once I’m done (and sometimes they offer). I find it a lot less awkward this way. \n\nAs a twenty-something female I try to find girls around my age taking pictures and try to ask them, like others have said. I think that they tend to make sure your photos turn out pretty decently. \n\nFinally, if I don’t think anyone looks trustworthy enough to take either good photos or not to take my phone, but the area looks safe enough, I’ll prop my phone up and use my apple watch to make sure I’m properly in frame and to take the pictures. I really don’t like doing that though. \n\nHope you enjoy your trip and get some wonderful pictures! They’re lovely to have to look back on.",
            "score": 210,
            "author": "Comfortable_Ad_6099",
            "replies": [
                {
                    "level": 1,
                    "comment": "because a lot of people on this sub think solo travel HAS to mean anti-social travel and if you talk to other people or god forbid take photos to post on social media for people to see you are FAR beneath them as only plebs need/ want pictures to remember their memories.",
                    "score": 3,
                    "author": "otherstuffilike"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i usually try to find girls that look around my age, maybe two friends ,even better if it looks like they’re taking selfies, and ask if they want a pic together. then i take a bunch of nice pics of them and ask if they can take some of me. works like 99% of the time!",
            "score": 579,
            "author": "sometimes_right1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same but I look for families with a kid or two. I figure I can outrun an adult carrying a child and the parents are usually pretty excited to take a family photo.",
                    "score": 111,
                    "author": "vadarpoo"
                },
                {
                    "level": 1,
                    "comment": "this is the way. i do this as well. offer to take pics of people and ask in return. usually they’re really excited to get a good pic together and more than happy to take one of you.",
                    "score": 122,
                    "author": "ayooolinds"
                },
                {
                    "level": 1,
                    "comment": "This! I asked a girl who took like 100 selfies of herself. She did a whole damn photo shoot for me. She put my phone camera in 3X to create a shallow depth of field (blurry background) and took some amazing photos.",
                    "score": 64,
                    "author": "eykei"
                },
                {
                    "level": 1,
                    "comment": "Im always gonna say yes to someone asking for a pic, and im going to be that person thats taking like 50 of them in portrait / landscape / full body shot. You gotta have options! And id hope to meet someone who would return the same energy for me when I go solo travellin :)",
                    "score": 10,
                    "author": "badgurljaney",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I do this too and I usually don't even have to ask because they're nice enough to offer!",
                    "score": 10,
                    "author": "videos4ever"
                },
                {
                    "level": 1,
                    "comment": "Just curious, is the 1% when they don't want you to take picture of them, or is it when they don't return the favor. Cause the latter would be hilariously rude",
                    "score": 6,
                    "author": "yeahsureYnot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hahahah i dunno really LOL, i don’t think i’ve ever had someone say no, i think once the person i asked like, pretended not to hear me which was awkward.. and one time i had some girls say no to getting their pic taken but then asked if i wanted mine taken so that worked out",
                            "score": 3,
                            "author": "sometimes_right1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "100% this!! I do the same, it always ends up being such a wholesome interaction. Last time I did it in Paris the girl taking my pics was hyping me up and it was so sweet and made me day",
                    "score": 11,
                    "author": "EggSaintLaurent",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ask someone who looks like they can run slower than you",
            "score": 671,
            "author": "bulls9596",
            "replies": [
                {
                    "level": 1,
                    "comment": "So that's why everyone always asks me to take photos of them...🫠",
                    "score": 343,
                    "author": "pepe307A",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh man I thought I just looked trustworthy but maybe this is it 👀😅",
                            "score": 34,
                            "author": "surfingsaturn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ahahah thanks for the tip!! :)",
                    "score": 60,
                    "author": "kinder3628"
                },
                {
                    "level": 1,
                    "comment": "Seriously, this is what I do.",
                    "score": 40,
                    "author": "Cali-Doll"
                },
                {
                    "level": 1,
                    "comment": "LOL",
                    "score": 11,
                    "author": "Ulf51"
                },
                {
                    "level": 1,
                    "comment": "Why is this so funny😂😂😂",
                    "score": 3,
                    "author": "dialovesu"
                },
                {
                    "level": 1,
                    "comment": "I'm a marathon runner so I can pretty much outrun anyone haha",
                    "score": 5,
                    "author": "sw2de3fr4gt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sprinters…",
                            "score": 8,
                            "author": "CrypticWeirdo9105",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I want a pic, I ask other tourist that favor. That's usually the best.\n\nI tend to choose a small group (ex: a family or a couple). I know there are probably just enjoying the place as I am, so I don't bother being robbed or something.\nThen, I offer to take a picture of all of them as well!\n\nOh, and if you are with a tour guide they can also take a picture of you.",
            "score": 230,
            "author": "thecoolcapybara",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best tip in my opinion! I find younger girls generally take the best photos because they're more familiar with people's good angles.",
                    "score": 110,
                    "author": "emmach17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Young girls, for sure. They will make you look like a traveling model. You don’t want pragmatic, unenthusiastic, non tech-savvy, soccer dad… who will give you 1 badly composed option where you blinked and weren’t ready for the pic… ha!",
                            "score": 99,
                            "author": "bananahammocktragedy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fucking crooked landscape pictures from your worst angles... and they always take just one",
                                    "score": 12,
                                    "author": "ToSeeAgainAgainAgain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Crooked… THIS pisses me off the most. What possesses people to turn the phone diagonally? What makes them think it looks good to have a photo where the earth is tilted? It’s not cute or funny. Photos should be taken either in landscape or portrait, but never diagonally.",
                                            "score": 4,
                                            "author": "Aromatic-Project-745"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Always… just one hahahaha yep!!",
                                            "score": 1,
                                            "author": "bananahammocktragedy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m cracking up. I was solo recently and asked the woman of a couple to take my pic. She was like, “ohhh, you don’t want me to take it, but he’s great”, and I TOTALLY expected the type of pic you talk about. But…he actually took a really amazing good angle pic of me. More than one. 😂 I was so happy.",
                                    "score": 7,
                                    "author": "girlwholovespurple",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve never even thought of this before but this is so true…thanks for clarifying why most of my hiking photos taken by other hikers end up looking off, haha!",
                                    "score": 3,
                                    "author": "a-localwizard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep… there’s the “just get it done” guy and the “make it look good” guy. With photos of strangers needing a pic taken, more men are the first kind. I say that as a man of the second kind!",
                                            "score": 3,
                                            "author": "bananahammocktragedy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My tour guide in Kyoto was a Moroccan model that made me look amazing with my iPhone idk how she did it\n\nBut also another tour guide was a 75yr old man in Kamakura and his pics were almost as great as the ones the Moroccan model guide took of me lol it varies",
                            "score": 30,
                            "author": "prosperity4me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think when tour guides do it every day they get really good at knowing what sort of photos people want!",
                                    "score": 24,
                                    "author": "emmach17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "being a tour guide upped that 75 year old’s photo-taking game by 600%",
                                            "score": 5,
                                            "author": "bananahammocktragedy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I completely agree on the tour guide approach! At at least three different tours in India, and one in Dubrovnik (walking tours, or tours around a palace or fortress, etc) the guides took excellent photos. They know all the good angles and photo points, to highlight you against the architecture. \n\nI also am a big fan of the offering to take their photo first approach. Though it’s not necessary, you can always ask out or the blue ti anyone who looks nice and trustworthy. And then say “I’ll take yours after if you’d like”.\n\nAlso ask someone who you think will know how to operate your smartphone camera (or whatever you’re using) ;) the risk of having a bad picture is probably way higher than the risk of your phone/camera getting stolen!",
                                    "score": 3,
                                    "author": "lwebzzz"
                                },
                                {
                                    "level": 3,
                                    "comment": "All you need to make something look great on an iPhone now is to hit the focus button",
                                    "score": 2,
                                    "author": "ohnowheredmypantsgo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "These are some great tips thank you so much!",
                    "score": 16,
                    "author": "kinder3628",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely ask young women. They can do things with phone cameras that no one else can lol",
                            "score": 24,
                            "author": "king_flippynipss"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just pester people. Provided you’re not a total dick about it people tend to pretty chilled - especially if you ask people who are together and having to take photos of each other separately if they’d like a photo together. Obviously there’s a bit of a risk but you’ve just gotta choose wisely. I did this in Morocco recently and everyone was lovely about it.",
            "score": 55,
            "author": "SirAngusMcBeef",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the tips! That makes sense and I like the idea about asking other people together if they want a photo too",
                    "score": 9,
                    "author": "kinder3628",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem at all! Tbh I offer even if I don’t want a photo in return - everyone deserves nice things and good photos are arguably the best souvenirs one can have.",
                            "score": 10,
                            "author": "SirAngusMcBeef"
                        },
                        {
                            "level": 2,
                            "comment": "This is what I do too. Often I don’t even have to ask, I’ve been approached by so many couples at tourist spots who ask me to take a photo of them together &amp; they’re always happy to take a photo of me in return.\n\nI always liked a quote from an interview with the photographer Martin Parr, who has a long-running project on global mass tourism. He said that while working on it he was often asked to take group shots, and that there must be hundreds of families who have a Martin Parr print in their holiday album without even knowing. So try to pick someone who looks like a good photographer!",
                            "score": 6,
                            "author": "Gullible-Guess7994"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "5 tips from another traveller who also often travel solo and love to take photos.\n\nLet me start by saying - don’t be afraid to take photos of yourself despite traveling solo. I used to be very conscious about this. But remember - there are millions of photos of these beautiful tourist spots, but there’s none with you in it. So go ahead and take that photo, and strike your best pose while you’re at it!\n\n1. Get a good tripod that is small enough to fit in your bag. There are lots of good yet affordable options available. A bluetooth functionality to control the shutter is NOT necessary.\n2. Download LENS BUDDY on your phone. Use it to take photos instead of the native camera app. It won’t affect the quality of the photos. Set the timer, and how long it should take photos. Delete the ones you don’t like. Repeat as necessary. You can take hundreds of photos in one go. This is the best app. And it is free!\n3. This third one can be a little counter intuitive when you’re on vacation - but, wakeup before sunrise and go to the sites really early in the morning. I used to hate doing this, but I’ve done it often enough that it has become one of my favorite activities when traveling. The golden hour in the morning is the best for photography, there are no people, you can have the most visited places to yourself. It’s the best! I look forward to those moments now.  I find this quite relaxing and meditative. And I've taken my favorite travel photos during this time. After, go to a coffee shop or back to your hotel and enjoy the photos.\n\n4A. If you’re in a crowded place - ask my fellow Asians. Haha. There was viral TikTok video about this, and there’s a lot of truth to it IMHO and based on my own experiences. I think most of us love taking photos, and would gladly take photos of other people too.\n\n4b. If you're in a crowded place - look for your fellow solo travelers. They often take selfies. Offer to take a photo. And ask them to take your photo too. Make their photo nice. And shoot them at the exact same angle/ spot where you want your photo taken. They can just copy it for your turn. I've made a lot of friends just by doing this.\n\n4C. If you're in a crowded place - and conscious about handing a stranger your phone, considering bringing a small camera. Use that instead your phone. There are a lot of point-and-shoot cameras that are good. Just make sure the camera has a wifi or bluetooth function, so you can transfer the images on your phone.\n\n5. Finally, get Lightroom and install your favorite presets.\n\n&amp;#x200B;\n\nI'm excited for you and your trip! Take loads of photos!!",
            "score": 42,
            "author": "watermelonpep83",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; This third one can be a little counter intuitive when you’re on vacation - but, wakeup before sunrise and go to the sites really early in the morning. I used to hate doing this, but I’ve done it often enough that it has become one of my favorite activities when traveling. The golden hour in the morning is the best for photography, there are no people, you can have the most visited places to yourself. It’s the best! I look forward to those moments now. I find this quite relaxing and meditative.\n\nAll of us on a tour of Jordan whined about how the tour guide wanted us up at 5:30 am and out the door by 6 am to see Petra.\n\nThat night we were told him how appreciative we were of that decision! We have pictures of a practically vacant Petra, only a few people around and easy to avoid. Whereas when I went by later in the afternoon it was absolutely packed and no way to avoid people in your shots.",
                    "score": 12,
                    "author": "rabidstoat"
                },
                {
                    "level": 1,
                    "comment": "I second using Lens Buddy!! That app is a GAME CHANGER!! Lets you take multiple photos at once and you can set how many to take / time increments in between pics so you don’t have to go back and forth from you phone after each photo. Used this in combo with a tripod with those flexible legs to take some great photos in nyc!!",
                    "score": 7,
                    "author": "ChlorineFlavored"
                },
                {
                    "level": 1,
                    "comment": "These were excellent tips! Thank you for taking the time to write them out.",
                    "score": 2,
                    "author": "gotthelowdown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a 20f female, a younger woman who looks like she’s taken an insta photo in her life is your best bet hahaha. Id just ask! And return the offer.",
            "score": 36,
            "author": "EveningTomorrow9612",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can get a mini Tripod for 40ish euros",
            "score": 55,
            "author": "Kitchen_Fancy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking about this actually! Thanks for the tip!",
                    "score": 11,
                    "author": "kinder3628",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, get a small bungee cord. I’ve been able to get a lot of good pics by attaching my phone to random poles, trees, etc. when I need a higher angle. Easiest way for me has been to have my phone on one of the small tripods that has flexible legs, then wrap the bungee cord around the legs of the tripod and the pole/tree to secure it all together.",
                            "score": 17,
                            "author": "motivation_vacation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have a small tripod with flexible legs that can stand on a table or a car, etc. Or you can wrap the legs around a pole or tree. It’s called a gorilla pod, I think",
                                    "score": 10,
                                    "author": "gypsysinger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are also gorilla pods with magnets in the feet to attach to metal objects like street signs, poles, fences, railings …",
                                            "score": 4,
                                            "author": "MotownMan646",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks, that’s good to know! Very interesting the way things can improve with the next iterations. Makes the one I have seem primitive!",
                                                    "score": 1,
                                                    "author": "gypsysinger"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is what I have! Echo the recommendation. Paired with remote shutter capability on my apple watch I tend to do okay getting pictures that I like.",
                                            "score": 3,
                                            "author": "yasdinl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Best to go with whatever works best for your situation. I also have a big ass camera and tripod it’s literally painful to carry around.",
                                                    "score": 2,
                                                    "author": "gypsysinger"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can also get a little Bluetooth clicker thing to control when you take photos so that you don't have to rely on timers. They work great!",
                            "score": 7,
                            "author": "IAmAnIslanderGander"
                        },
                        {
                            "level": 2,
                            "comment": "Get a tripod. I bring my tripod everywhere and my pics are so much better than asking strangers to do it",
                            "score": 5,
                            "author": "atreegrowsinbrixton"
                        },
                        {
                            "level": 2,
                            "comment": "Many come with Bluetooth remotes! I always carry my tripod just in case I don’t come across anyone my age to ask, it’s awkward at first but I just remind myself that I literally will never see any of these people again, it’s my memories that I want to document, and if they find it funny then good for them! I gave them something to laugh at and hopefully made their day a little better lmao",
                            "score": 2,
                            "author": "EggSaintLaurent"
                        },
                        {
                            "level": 2,
                            "comment": "This is the one I use. It packs down to a reasonable size - but I'm normally hiking so not sure how it would look being carried around in a city.\n\nhttps://www.amazon.com.au/dp/B07NWC3L95?ref_=pe_19115062_429603572_302_E_DDE_dt_1",
                            "score": 2,
                            "author": "MC-fi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have something similar and it works well. It also works like a selfie stick.",
                                    "score": 2,
                                    "author": "Ulf51"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just get a half decent one.",
                            "score": 2,
                            "author": "Kitchen_Fancy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And a Bluetooth shutter remote for like $5",
                    "score": 3,
                    "author": "drunken_man_whore"
                },
                {
                    "level": 1,
                    "comment": "Agree!!",
                    "score": 1,
                    "author": "summersalwaysbest"
                },
                {
                    "level": 1,
                    "comment": "I was thinking same thing. I went to a solo trip in NYC last december. My photos were great. Get a good tripod with a remote control that way you dont have to use a timer everytime. I bought one from B&amp;H for only $15",
                    "score": 1,
                    "author": "Rosemrytg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know you’ve got plenty good responses already but I wanted to add another voice in favour of a selfie stick. To be honest I used to think they’re a silly idea but after buying one and using it on my recent solo trip I have to say they’re genius! It looks so much more flattering than a normal selfie, much easier to take pictures with a nice background, and in busier places it felt safer than putting down a tripod. Ideally get a convertible selfie stick/mini tripod for the best of both worlds :) and ignore the comments being negative about taking selfies, it’s your trip and you can take as many as you want! I probably took 100s on my last trip, it’s lovely to be able to look back on those pictures afterwards and see that you were in those amazing places",
            "score": 20,
            "author": "penguinpyjamapants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your kind words and advice! I’m defo going to invest in a selfie stick!",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mini tripod, mine has flexible legs and magnets, so it can stick to metal table or street signs or wrap it on something. And I use the 5 second timer and take a few.\n\nSome may say they don't need or want photos of themselves in front of iconic Backgrounds. And I snap both. \n\nI've a hallway wall with little 5x7s +/- of places I've been, and it makes me smile and often people who visit ask questions about places.\n\nI will say, most of the hall snaps don't have me in them. Except. If I'm on a neat rented motorcycle in front of something... Like, me on a liter vstrom in front of a sequoia. or, skipper ing a sailboat in front of alcatraz. Etc. But, in my mind, I can't decide which photos are the coolest until I see both - with and without me. Etc..",
            "score": 15,
            "author": "Mrknowitall666",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just commenting to say, have no shame taking pictures of yourself. Selfies just don’t cut it if you want a more professional picture and getting the angle and lighting and composition right is fun. Nothing wrong with that",
            "score": 40,
            "author": "PlatniumFork",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this also. Wanting to take photos is reason enough to take photos. Don’t mind people who give you a hard time about it.",
                    "score": 11,
                    "author": "jellyhamz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thank you for your kind words. I think you’re right. I wasn’t expecting negative comments on this post and went into defensive mode when I got them which I probably didn’t need to!",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just two more cents: I think your phone is safer in the hands of a fellow tourist than sitting on a tripod.. particularly in touristy European cities where pickpocketing and petty crime is common",
            "score": 10,
            "author": "pineapple_sling",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was there a couple of weeks ago and saw quite a few people with mini tripods or selfie sticks. You’ll struggle with a mini tripod on weekend days, and technically it’s against the law to set one up in Prague without a permit but they’ll never fine you for it. We got up early one morning and took photos around Old Town Square and Charles Bridge while it was quiet.",
            "score": 8,
            "author": "toady89",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m going to Prague with a friend for the first time too! I’ll be there all next week, I can spot you lol",
            "score": 8,
            "author": "TheNagaFireball",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Micro tripod and a bluetooth shutter button.",
            "score": 7,
            "author": "Antrimbloke",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I was backpacking in Australia I had a gopro with tripod. I usually set it to take e.g. 1 photo per sec, put it down on the tripod and put myself it position, looking around, doing casual poses. Some of my best photos ever are taken this way.",
            "score": 7,
            "author": "blablajajaja",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ask someone who is carrying big DSLR-style cameras to take your picture.  Not only are most of them willing to pause for a second to do it, but they usually know how to take a good one.  Just make sure to wait until they are done taking whatever photo they are in the middle of before you ask, don't interrupt while they're setting up a shot.\n\nI'm a photographer and, while traveling, people ask me all the time to use their phone to take a picture of them, I always oblige them.\n\nI also follow this same advice, because as a solo photographer I almost never have pictures of myself.  So when I spot another photog at a cool spot, that's usually who I politely ask to take one for me.\n\nNote:  This is for snapshots, don't expect a traveling photog to do a whole instagram shoot for free or anything like that.\n\nThe other option is get a little tripod and set a timer.  Also works great and is how I sometimes get shots of myself if nobody is around.",
            "score": 7,
            "author": "jadewolf42",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can do a walking tour and ask the people within the walking tour to take a picture.",
            "score": 6,
            "author": "cinnawars123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea thank u",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1- You don’t need to justify why you want photos…. You’re allowed to want photos without having a reason for it, so ignore those comments. \n2- Here is how i planned to do it: i bought a tripod… but i didnt even end up using it at all. Instead, one time the street was completely empty so i felt comfortable putting my phone on a bench and i used an app that took like 50 pics per second lol. Another time i asked 2 older ladies that were tourists, another time was a group that was taking pictures and i offered to take theirs then asked them to take mine. When I did group tours and bar crawls i just asked people who were in my group. \nHonorable mention: I asked my hotel concierge to take pictures of me as well lol",
            "score": 7,
            "author": "slpundergrad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would recommend getting a tripod and shutter! That way you can get your best pics without having to trouble people. But if you’re afraid of it getting stolen, then ask other tourists. I usually do so by offering to help them take photos first, before asking if they could help me do the same !",
            "score": 6,
            "author": "Master_Lukiex",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I ask tourists, probably a bit prejudiced but I mostly ask older people or couples/families. Also a tripod works great! \n\nPrague is amazing though. If you need some tips let me know as I lived there for 5 years.",
            "score": 4,
            "author": "Rykka",
            "replies": []
        },
        {
            "level": 0,
            "comment": "- Tripod for your phone, either get a bluetooth shutter button or set the timer\n\n- Ask people \n\n- Find other people taking selfies and say \"I'll take your photo if you take my photo\"\n\n- Use a drone, hover it nearby and hold the remote in your hand",
            "score": 5,
            "author": "UniversityEastern542",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Easy! My wife just got a flipstick for her phone case, which is like a little case on the back of the phone that can flip open to reveal a super sticky backing which makes it easy to just stick her phone to anything and get solo shots wherever with the photo timer.\n\nhttps://www.getflipstik.com/",
            "score": 4,
            "author": "defnotajournalist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank u so much for the advice!",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most people don't mind taking one photo. Just don't ask them to take 10. You can also approach couples and ask them if they want their photos taken. They'll be more than happy to return the favor. Locals in Prague are also extremely nice. You can ask the locals as well. The risk, though, is that most people aren't great at taking photos. A tripod will be a good solution",
            "score": 10,
            "author": "Bitter-Culture-3103",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Usually people ask you to take photos of them, &amp; then you can ask for the same \n\nI rarely get photos for myself unless I'm doing it for a specific reason(my family has a cousin calendar every year and I never have photos of myself so I've been working on taking more just for that).",
            "score": 11,
            "author": "bookandbark",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a really good idea thank you!! I’m the same in not taking many photos of myself, but i’ve been trying to take them more this year as memories for when i’m older.",
                    "score": 6,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have never had an issue asking others to take my picture while traveling solo.. Can spark great conversation with people you otherwise would not have engaged with too.",
            "score": 3,
            "author": "lmasiero",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can get a Bluetooth remote - I just put my phone on a wall and watch it while pressing the remote.",
            "score": 3,
            "author": "Spiritual-Hand-9563",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yo can buy a mobile tripod. The Pocket Tripod is credit card sized and pretty cheap. If you have an iPhone and don’t mind spending a bit more then check the Peak Design Mobile Tripod. It uses magsafe and also fits in your pocket.",
            "score": 3,
            "author": "useless55",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was going to make the same post, so thanks for posting this! All of my twenties I barely had time or funds to travel just had to work all the time to support myself. I'm early thirties now and am able to take a few short trips a year but will be solo. Getting some good pics to add to an album or use in frames will be nice. I think if you can take group tours it is nice to lose with the group in group pics.",
            "score": 3,
            "author": "EnvironmentComplex98",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I go on Airbnb experiences and book a photographer! You'll get nice souvenir shots with iconic backdrops and none of the fear of getting your phone/cam stolen or wasting people's time asking for multiple shots.",
            "score": 3,
            "author": "clamchauder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aah this is such a good idea i’m looking into it now!",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I solo travel, I normally ask someone either random or some in a tour with. If I cba to do that I just take a selfie",
            "score": 3,
            "author": "dare2travell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea thanks",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Forget the haters asking you why you need the pictures! I wanted the same for my solo trips so I got a combo selfie stick and tripod. When I was looking for one I came across this review which is the cutest thing and I ended up buying that one https://www.amazon.com/review/R37LQF99ZNANHP",
            "score": 3,
            "author": "likeitironically",
            "replies": [
                {
                    "level": 1,
                    "comment": "This reviewer is so sweet. Had to check out his other reviews.",
                    "score": 3,
                    "author": "a_mulher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I travel solo and take tons of pics! Here are the hacks:\n\n*Selfie remote* absolute game-changer. It's a small button you can hold in your hand, hide in your hair, behind your back, etc. that takes a photo when you push it. You can find them for pretty cheap on Amazon, or if you have a smart watch it might have it as a feature.\n\nGet a small tripod, a bendy one, so you can wrap it around railings or trees if need be.\n\nSet up your camera and use either video or single take. I do a mix. You can pull frames you like as photos from the video and you can make yourself a cute video compilation at the end of the trip.\n\nAt museums, employees are often happy to take pics of you. The same goes for tour guides and other guests on guided tours.\n\nAs others have said, ask a group if they would like you to take one of them together and they'll usually offer to return the favour. This works more often than not, but keep in mind people might be weary of handing you their phone or camera in an area known for tourist scams.\n\nYou can get a waterproof phone case that hangs around your neck and drop it into shallow water, then take video of yourself swimming around it. You could also dangle it off railings or trees when in a bind.\n\nAt the end of the day, just know most people there understand photos are an important part of the trip to most of us and will be happy to help you out. Be sure to stay sensible and aware, though, because they might run off with your phone or demand money for the service. Other tourists are usually a safe bet.",
            "score": 3,
            "author": "sweetiepi3-14159",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for such detailed advice! Really appreciate it",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tripod+timer (or camera that lets you use your phone as a remote); pictures taken by strangers are going to look bad 90% of the time. With a tripod they will look exactly as you want them to.",
            "score": 3,
            "author": "Mondego2k",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I usually join a walking tour or an AirBNB Experience and it's a lot easier asking someone who's in the same group and going the same places as you to help you take a photo. I've taken photos for other solos while doing this and have asked for them to do the same.",
            "score": 3,
            "author": "American_Non-Voter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There are great photographers on airbnb experiences. \n\nMost only allow day shoots in Prague - but we contacted one photographer that is also a professor of photography at the college and takes you out for a beer after.   \n\nHe came out at night to take pics with us during a full moon on the bridge.   It was $100ish - and 3-4 hours of us walking around. GREAT PICS!  \n\nThat's what I'd do. You can get a castle background and all over the bridge - we even had someone come up with owls and we had a photoshoot with them which was weird. \n\nHighly recommended.",
            "score": 3,
            "author": "checkm861",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea - thanks!",
                    "score": 2,
                    "author": "kinder3628",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a selfie stick that can also be used as a tripod. I find it a little cumbersome, so I don't use it super often. I also have a thing called a pocket tripod that is the size of a credit card. You can prop your phone up with it. I have an iPhone and can use my Apple watch as a remote, which is very handy. And as many others have said, I will ask other female travelers to snap a quick pic of me.",
                            "score": 4,
                            "author": "gnatgirl"
                        },
                        {
                            "level": 2,
                            "comment": "Just a fair warning selfie sticks are banned at some historical sites depending on where you’re going! So just be ready to have a bag to put it in",
                            "score": 3,
                            "author": "priuspower91"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I tend to find people ask me to take their photo because I have an DSLR with me and that makes them think either I know what I am doing, or that I have no reason to steal someone else's camera. So my advice is to find the person with a camera around their neck!",
            "score": 2,
            "author": "Progenitor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There are already lots of suggestions here from other people. I haven't read them all, but I didn't see anyone call out limitations around tripods/drones. \n\nDrones can be a fun toy if you're a techie, but be careful if you get one. Some countries (ie- Egypt) do not allow drones into the country. Other places (ie- National Parks in the United States) also prohibit drones.\n\nSimilarly, at some attractions (ie- the pyramids in Egypt) if you plan to use a tripod, you need to buy a tripod pass/entry ticket. Usually it's just a few dollars, but it's an added expense and extra hassle. If you use one, plan on people trying to get more money out of you.\n\nI usually just resort to asking others to take pictures of me. It's less things I need to bring with me on my travels and keep track of. Sometimes I will set my phone down and use a timer if I'm somewhere that's not got a lot of people, but that's more so out of concern for looking weird or people walking into the shot not realizing I'm trying to do a picture.",
            "score": 2,
            "author": "aabaker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My Galaxy phone has the stylus built in and it also acts as a shutter button.\n\nThis is how the gf and I take most of our vacation photos for things like park entrance signs and the like. Put the phone on a small tripod and use a remote switch.\n\nWe got lots of great photos with both of us in frame for very little effort.",
            "score": 2,
            "author": "stavigoodbye",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you are gonna ask strangers to take your photo, follow these tips: First, ask about her tourist. Tourists aren’t gonna be the one you need to worry about stealing your camera, and often will ask you to take their photo in return. Second, ask groups of people who are taking photos if they could snap one of you when they are finished. Obviously don’t do this if it’s a professional shoot but if it’s casual photos then people won’t mind snapping an extra pic or two. And third, ask younger people (20s) to help take pictures. Oftentimes they will take lots of photos with different angles and shots and are generally really good at iPhone photography or taking Instagram-able pictures.",
            "score": 2,
            "author": "Sea-Ad9730",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have a selfie stick that turns into a tripod that works really well, although I mostly use that for areas where I’m more likely to be alone since it takes a minute to set up and I worry it will be in someone else’s way. If you’re in a tourist-y area, especially if you’re trying to get a picture of yourself in front of a landmark and see other people getting pictures nearby, this would 100% be your best opportunity to ask someone to take your photo - and offer to take theirs in return. For what it’s worth, in these particular spots, I’ve only ever had to ask once or twice - usually people saw me trying to take a selfie, or noticed I was alone, and kindly offered to take my picture. This may entirely depend on where you are (tourist area vs a street on someone’s commute), but it absolutely made me more comfortable with asking someone to take my picture (and I’ve never had someone decline). \n\nHave fun on your trip!",
            "score": 2,
            "author": "waitnoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, for what it’s worth, don’t feel scared to ask for a picture - everyone will forget about the interaction after it’s happened, and you’ll have pictures for the rest of your life that you otherwise wouldn’t have.",
                    "score": 2,
                    "author": "waitnoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a selfie stick that also transforms into a tripod + a bluetooth shutter button! Works perfectly",
            "score": 2,
            "author": "Hobbitea",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I got a small tripod from amazon and it’s been amazing! It comes with a little bluetooth remote so that I can press to take pics instead of relying on timer.",
            "score": 2,
            "author": "kryssst",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tripod with a Bluetooth timer you hold in your hands to take the pics",
            "score": 2,
            "author": "DurianRejector",
            "replies": []
        },
        {
            "level": 0,
            "comment": "On a couple of occasions, I have hired a local professional to follow and take pictures of me for an hour or so. You can find deals on Airbnb experiences sometimes. My return on investment was great imo.",
            "score": 2,
            "author": "Mighty_quin_005",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m looking into this great idea thanks",
                    "score": 2,
                    "author": "kinder3628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually asked a couple or a family if they wanted me to take their picture, and then they took mine in exchange! Didn’t do it often, but my phone wasn’t stolen so it seemed to work out",
            "score": 2,
            "author": "xyla-phone",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In Prague specifically, I hired a photographer through Airbnb and it was an amazing experience! Got some professional photos taken and it wasn't expensive at all",
            "score": 2,
            "author": "ry-yo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good advice here about asking the younger crowd. My tip would be asking them to take a short video (or setting the phone up in video mode on a tripod) then grabbing the stills that you like best.",
            "score": 2,
            "author": "bluefortytwo2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ask girls, they tend to be more patient and take better photos.",
            "score": 2,
            "author": "justbronzestuff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yo OP, invest in a tripod and set the timer when taking photos or you can video yourself then just screenshot the images you want and colour grade the images via Lightroom.\n\nI use the Insta 360 flow phone gimbal and I’m able to execute videos and photos of myself flawlessly.",
            "score": 2,
            "author": "NZdrop",
            "replies": []
        },
        {
            "level": 0,
            "comment": "While I prefer to be in none of my shots (wife ensures that we do get some selfies in), and after recently returning from a European trip, including Prague, I have some thoughts. Key point: get up early for the best light and least amount of people. This is important because you can set up a phone or camera to do timer/trigger shots at your own pace, not be rushed and have little to no interference from others. For the folks you do see, they are likely going to work, and may indulge you for a photo if you ask. That’s my two cents. I loved strolling around Prague just after sunrise to get some really nice shots.",
            "score": 2,
            "author": "pakepake",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There was this time a young american tourist enthusiastically asked me to take a photo of him. I was walking my dog at the time so I couldn't hold a camera in one hand and hold on the leash with the other so I declined. I still remember the disappointment on his face.",
            "score": 2,
            "author": "Peripatitis",
            "replies": [
                {
                    "level": 1,
                    "comment": "That has happened to be so many times as I am trying to control my dog, and it really drives me nuts",
                    "score": 3,
                    "author": "ricecrystal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an American, I’m learning that an iPhone is a hot commodity (hotter than I thought) so it’s stolen a lot. If that’s what you are using, be careful who you hand it to.\n\nGenerally in a touristy place, find a couple and ask them if they want their pic taken. Regardless of their response, they might ask you if you want yours taken or you could ask them. Just a tip…",
            "score": 1,
            "author": "inmyelement",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I rarely take photos of myself, I'm not positive I'd improve a fabulous view and I dont need to prove im visiting anywhere. Is there a reason you're taking them? Wouldn't a selfie with a iconic view as a backdrop work?",
            "score": -50,
            "author": "BimbleKitty",
            "replies": [
                {
                    "level": 1,
                    "comment": "i mean a lot of views/landmarks aren’t really doable to fit in a selfie. like the sagrada familia in spain is massive, you need someone else to take a pic of you to really capture it. n just because you’re “not positive you’d improve a fabulous view” doesn’t mean everyone else thinks that of themselves as well ?",
                    "score": 17,
                    "author": "sometimes_right1"
                },
                {
                    "level": 1,
                    "comment": "What's wrong with wanting to take higher quality images of your memories?\nOP literally said he/she doesn't want to only take selfies.\n\nI don't invest too much time in taking pictures either, but I would appreciate some tricks for better photography ngl",
                    "score": 36,
                    "author": "ElectrocutexD",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don't really think the tone of this comment is fair. OP isn't wrong for wanting a photo of themselves on holiday.",
                    "score": 32,
                    "author": "emmach17",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep an eye out for anyone else travelling solo. You will usually find other people in the same situation (looking around awkwardly to ask for a photo). They are more than happy to take photos of you if you offer the same.\n\nAlso, one of the first things I do is go on a group tour and make friends with the other solo travellers. (It can even be a free walking tour of the city). You can take photos of each other and if you get along, you can meet for other site seeing activities as well.\n\nIf you can afford to, some cities have professional photographers for around $100. They know the best spots and take the best pictures. Just make sure you book it through a reputable site and not some random advetisement.  I used one from Get Your Guide when I was in Santorini and she was AMAZING.",
            "score": 1,
            "author": "HelioThalasso"
        },
        {
            "level": 0,
            "comment": "Ask strangers! I’ve gotten some great pictures this way. It’s a stereotype, but teenage girls usually take the best shots. They know they’re angles! Also tripods with a remote",
            "score": 1,
            "author": "Ok-Consequence-6026"
        },
        {
            "level": 0,
            "comment": "Ask ppl and chat to them it’s part of the experience of travelling and ppl don’t mind.",
            "score": 1,
            "author": "FunkySausage69"
        },
        {
            "level": 0,
            "comment": "As a middle aged lady (who can definitely not outrun anyone), I'll just ask someone. Or, I'll find people trying to take the same photo as an awkward selfie, and ask if I can help with their picture. Then they do the same for me!",
            "score": 1,
            "author": "ClassyBroadMSP"
        },
        {
            "level": 0,
            "comment": "Bluetooth tripod. Practice poses before at home. I've taken quite a few amazing pictures of myself (if I may say so) that way. Asking to take pictures almost always never works well for me, because either they mess up the angles (understandable, they don't know my best angles) or something else. And I was subjected to quite a rude behavior when I took a group tour with friends where everybody else were couples and I was solo. A xiaomi tripod/selfie stick for 20 euros solved all that ugliness and problems. Try to buy a long one that stretches to full length of a person (that people use to make reels) and you can take great pictures of yourself.",
            "score": 1,
            "author": "IamNobody85"
        },
        {
            "level": 0,
            "comment": "Bluetooth tripod. Practice poses before at home. I've taken quite a few amazing pictures of myself (if I may say so) that way. Asking to take pictures almost always never works well for me, because either they mess up the angles (understandable, they don't know my best angles) or something else. And I was subjected to quite a rude behavior when I took a group tour with friends where everybody else were couples and I was solo. A xiaomi tripod/selfie stick for 20 euros solved all that ugliness and problems. Try to buy a long one that stretches to full length of a person (that people use to make reels) and you can take great pictures of yourself.",
            "score": 1,
            "author": "IamNobody85"
        },
        {
            "level": 0,
            "comment": "Usually I just take selfies. If I see other tourists around me, and I want a proper photo in some pretty place - I just ask someone to take a photo of me, it's nothing special. I got asked to take a photo of other people in many places too.",
            "score": 1,
            "author": "AlexDub12"
        },
        {
            "level": 0,
            "comment": "I'm also going to Prague today. Ask me to take some pics haha",
            "score": 1,
            "author": "DerWilhelm"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what my husband and I do! We’ve gotten some great shots using iPhone and Apple Watch!",
                    "score": 1,
                    "author": "vino-drunk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Prague is over run by tourists. Most of them would be taking photos at the bridge so it's pretty normal to ask anyone over there to take pics. It's a very easy place to spot tourists.",
            "score": 1,
            "author": "araheem94"
        },
        {
            "level": 0,
            "comment": "Ask lower ages. Like mid 20s' 30s or teen agers. Most of them are willing to take the best shot and angles.\n\n\nDo not ask oldies. Either they are rude' or some of them are not willing to take photos. And there captures are teribble like your cameras are built in 80s. 🤷‍♂️",
            "score": 1,
            "author": "smlley_123"
        },
        {
            "level": 0,
            "comment": "Prop your phone up on a tree or a rock or something! For when that's not available I'm not sure lol",
            "score": 1,
            "author": "tsunamiinatpot"
        },
        {
            "level": 0,
            "comment": "Get a tripod!! I took my first solo trip last month and actually got some really good pictures with my tripod. I thought it would be awkward, but it’s only awk if you overthink it. Don’t get me wrong, it’s a little weird at first but you have to make a conscious decision to not care hahaha",
            "score": 1,
            "author": "Super_Cauliflower_51"
        },
        {
            "level": 0,
            "comment": "Just ask some people. No one minds! \n\nIf you see a couple where one person is taking a pic of the other, offer to take their pic and then ask if they’ll take yours. It works literally 100% of the time!",
            "score": 1,
            "author": "EagleEyezzzzz"
        },
        {
            "level": 0,
            "comment": "Get a tripod! I’ve been on several solo trips and I’ve been able to get good shots with a tripod that holds up my phone. I got it from Amazon probably for 30 dollars. It can go to to full length and extend from very small size to the height of a person’s body and you can use a remote control when to snap the picture or video. \n\nStrangers take TERRIBLE photos FYI. This is the best way to do it. I’ve taken amazing photos on my last solo trip this way. \n\nPeople do look at you funny and they think I’m an “influencer” because the setup looks intense but just continue on if you want actual good photos. The setup is NOT intense. You just pull it out of your backpack and extend the pole to full length.",
            "score": 1,
            "author": "freethemanatees"
        },
        {
            "level": 0,
            "comment": "Hi, I was just in prague a month back, my favorite city to date! It’s full of tourists, you shouldn’t have a hard time finding another to take your pic. There’s nothing wrong with taking plenty of pics! it really helps me remember the feelings and experiences I had when looking back years later. I definitely set up my phone a few times for some wide angle shots and never thought anything of it.",
            "score": 1,
            "author": "uncomfortbIe"
        },
        {
            "level": 0,
            "comment": "if you decide to ask someone to take a photo for you, try to find someone holding a legit camera (not just their phone).  Proper framing is something 90% of people have no clue how to do.",
            "score": 1,
            "author": "marvelish"
        },
        {
            "level": 0,
            "comment": "Use a selfie tripod with remote, in most tourist places there will be lot of people, so i dont think someone just takes your big selfie tripod and run away.\n\nin isolated places, there may be no one to take your phone away. also dont take forever while talking photos, and dont try this if the place feels unsafe and shady.",
            "score": 1,
            "author": "winnybunny"
        },
        {
            "level": 0,
            "comment": "Get a selfie stick!",
            "score": 1,
            "author": "becauseoftheoffice"
        },
        {
            "level": 0,
            "comment": "Selfie stick with tripod capabilities . Set to video mode , pose , screenshot pics from video .",
            "score": 1,
            "author": "bigfatsooty"
        },
        {
            "level": 0,
            "comment": "You can always look on Airbnb experiences there’s usually photographers on there and you can book like an hour long session!",
            "score": 1,
            "author": "Hman68161"
        },
        {
            "level": 0,
            "comment": "I've found something like a gorillapod or a mini tripod with a strap designed for phones/small cameras is good.  You can strap them to signposts and lampposts.",
            "score": 1,
            "author": "kojikabuto1"
        },
        {
            "level": 0,
            "comment": "When I went to Paris solo, I hired a photographer for a couple hours from AirBnB Experiences for around $50. Totally worth it if you can find something similar, I recommend that!",
            "score": 1,
            "author": "pricklysalamanders"
        },
        {
            "level": 0,
            "comment": "For me, the best photos taken of myself while solo traveling were done when I was on walking tours. Not only can you ask other travelers on the tour to take your photo, but on several tours I've been on the tour guides themselves were pretty used to taking photos of folks for them (and pretty skilled I might add).\n\nShout-out to the GoT guide in Croatia for taking some great photos of me!",
            "score": 1,
            "author": "Seven-of_9"
        },
        {
            "level": 0,
            "comment": "as someone who hates how i look in photos most of the time, i dont usually bother anything other than a few selfies, but occasionally i’ll splurge on a photographer for an hour or 2 (easy to find on airbnb) and then have REALLY GOOD photos in one destination to at least have and treasure and show people. i only do it sometimes but even then i’m sure in a couple years i’ll have a small collection. obviously not always the answer as it can add up but a nice treat every now and then. also use them to take new linked in pictures 😂",
            "score": 1,
            "author": "troyemellets"
        },
        {
            "level": 0,
            "comment": "There are lot of collapsible stands that you can get for your phone to help take pics on a timer (that are also easy to travel with). There’s a ton on Amazon like this one: Limited-time deal: TONEOF 60\" Cell Phone Selfie Stick Tripod,Smartphone Tripod Stand All-in-1 with Integrated Wireless Remote,Portable,Lightweight,Tall Extendable Phone Tripod for 4''-7'' iPhone and Android Phones https://www.amazon.com/dp/B09QM6CXHB?ref_=cm_sw_r_apin_dp_5YHA40G0ZKE9NPPQCBBY\n\nYou can also use this little hack if you don’t want to bother carrying a tripod or stand around: https://www.instagram.com/reel/CTdEtEohJiY/?igshid=YmMyMTA2M2Y=\n\nI would also suggest pick a few places you know you want pics at and research when their busy “tourist” times are. Google usually does a good job of showing the activity in different places in terms of being busy. If you go at a time when there are less people, you have more opportunity to find a good spot to take pictures in a more private way. \n\nIf you have extra spending money, you could look into different travel agencies/companies to see if they offer photography services. Even places like yelp, Groupon, or Airbnb have “experiences” that can be booked where a local photographer will take you to all the “iconic” places and do photo shoots for you. Of course make sure there are good reviews to ensure the person/company is legit. These probably range in pricing but it is an option! \n\nLast piece of advice is if you have IG try to follow some influencers who share their hacks on good photo tips / solo traveler tips. Hope this helps and enjoy your vacation!",
            "score": 1,
            "author": "SliceOfKayke"
        },
        {
            "level": 0,
            "comment": "I get out sooo early when no one is around and set up my little tripod.  I use the lens buddy app. It has a timer and can take a bunch of photos in sequence for you.\n\nEdit: I also find couples trying to take photos and offer to take theirs if they take mine if it's crowded.",
            "score": 1,
            "author": "Clarence_Bow"
        },
        {
            "level": 0,
            "comment": "Ask a girl or a Zgen dude",
            "score": 1,
            "author": "ToSeeAgainAgainAgain"
        },
        {
            "level": 0,
            "comment": "I have a tripod that allows horizontal and vertical pictures and selfies. Takes better pictures than any person I've ever encountered.",
            "score": 1,
            "author": "Individualchaotin"
        },
        {
            "level": 0,
            "comment": "A personal tip from my 10+ solo trips. When asking people to take photo for you, put it on video mode then press record and just ask them to hold the phone. Then review the video afterwards, screenshot the frame(s) you like, then delete the video. This way, you can avoid those awkward looking photos lol. You can even make short videos this way.",
            "score": 1,
            "author": "mileuxd"
        },
        {
            "level": 0,
            "comment": "tripod for sure!",
            "score": 1,
            "author": "tulipiscute",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;tripod for sure!\n\nsure?",
                    "score": 1,
                    "author": "exclaim_bot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just use a tripod. \n\nI’ve also used one of those collapsible phone stands as a tripod before and just set it on a taller surface. The one I use fits in my purse so I always have it with me.",
            "score": 1,
            "author": "WhatAboutMeeeeeA"
        },
        {
            "level": 0,
            "comment": "Ask someone who also looks like they are taking photos if you can take a photo for them. Then ask if they can take one for you! Avid solo traveler here and this always works!",
            "score": 1,
            "author": "plantscatsrealitytv"
        },
        {
            "level": 0,
            "comment": "I take 3 cameras and tons of photos..just not of myself.",
            "score": 1,
            "author": "Oftenwrongs"
        },
        {
            "level": 0,
            "comment": "I hate asking people for pics because if they don't take it right I feel bad asking for another one...so I bought a selfie stick that is also a tripod!! Best thing EVER!!!\n\nEdit: it has a Bluetooth remote to take the pics",
            "score": 1,
            "author": "manzanapurple"
        },
        {
            "level": 0,
            "comment": "So definitely get a tripod. What I do is take a free walking tour to get an idea of the places I want to get a picture of and save the locations on my phone. Then get up early the next day before all the other tourists and set up my tripod and usually get solid pics with way fewer people. It also lessens the chance of someone snatching the phone.  Hope this was helpful! Safe travels✌🏿",
            "score": 1,
            "author": "Nintendo_Sixty4"
        },
        {
            "level": 0,
            "comment": "You can ask groups if they want a picture all together, and they will probably offer to take a picture of you too.\n\nAlternatively, bring a tripod and a timer. Only use this in areas that you have to pay to get into--that will decrease the risk of theft.",
            "score": 1,
            "author": "videos4ever"
        },
        {
            "level": 0,
            "comment": "just ask someone to take photo of you. Shouldnt be too much of a problem, it takes literally five seconds. Use your old phone if you are scared someone might steal it.",
            "score": 1,
            "author": "JazavciNikadNeUmiru"
        },
        {
            "level": 0,
            "comment": "If you've got some extra income to splurge, see if you can find a photographer on something like AirBnB experience. I did that while solo traveling in Japan and it was nice to get some high-quality photos of myself and also get a mini tour of the area. Was also able to have some lovely conversations and get recommendations on places to go afterwards.",
            "score": 1,
            "author": "Extracurvy_driftwood"
        },
        {
            "level": 0,
            "comment": "You could lean your phone on the ground but you would always get a low angle. It would be better to bring a little gorilla stand like [this one](https://www.amazon.com.au/JOBY-Griptight-Gorilla-Smartphone-JB01390-BWW/dp/B01C7UYCWW/ref=asc_df_B01C7UYCWW/?tag=googleshopmob-22&amp;linkCode=df0&amp;hvadid=341792083664&amp;hvpos=&amp;hvnetw=g&amp;hvrand=4334590493655409694&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=m&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=1000339&amp;hvtargid=pla-406359898698&amp;psc=1)\n\nAnd attach it to a pole or stand it up on a railing. It can wrap around things and grip so it won't fall",
            "score": 1,
            "author": "wasporchidlouixse"
        },
        {
            "level": 0,
            "comment": "I didn’t see this here yet so I thought I’d jump in.  I’m not sure where you are financially but if you go onto Airbnb EXPERIENCES- you can find a lot  of local photographers you can hire for an hour or something and they usually have great spots to take pics etc.  I have paid $100 for a session in denver down to $27 in Guadalajara. I highly recommend looking into it.",
            "score": 1,
            "author": "thebougainvillea"
        },
        {
            "level": 0,
            "comment": "Look for someone already taking photos with a nice camera. they know how to frame a photo well and they have no reason to steal your camera, because they already have a nicer one than you.\n\nI've also found a lot of luck with women in their teens and 20s, especially if they are already in pairs or groups.\n\nAnother tip is to start by taking a few selfies in the spot before you ask someone. You make it clear to anyone nearby that you're just a fellow tourist and this isn't some sort of weird scam. Also, in my experience, sometimes fellow tourists will offer to take the photo for you if they see you struggling with getting the shot.\n\nRemember that while there are thieves and assholes in the world, the vast majority of people are just like you: not looking to steal anyone's phone and not bothered by someone asking if they can take a quick picture.",
            "score": 1,
            "author": "NoodleDrive"
        },
        {
            "level": 0,
            "comment": "I got all kinds of side-eye from people in Amsterdam with a tripod, so just be aware that some will judge you harshly for that. \n\nThe best pics I have were from a woman in a group visiting from Taiwan and they could see I was struggling to get a good photo of myself at the Mercedes museum. I was hesitant to accept her offer because I had my phone grabbed in Florence last year. All of her pics were amazing. She even gave me posing tips! So happy she offered to help.",
            "score": 1,
            "author": "munichbish"
        },
        {
            "level": 0,
            "comment": "I don’t really take a lot of selfies, but I have had people seeing me taking photos, and offered to take one of me, which is very nice. I would ask someone if I really wanted one somewhere, as long as it looked like they were also a tourist (because I think tourists have time.) Also, servers take a lot of photos of people. I don’t think it matters if you are alone. Other people from the hotel or tour guides would probably be good bets too, although I would offer a tip, for the server I would add to the gratuity.",
            "score": 1,
            "author": "kitzelbunks"
        },
        {
            "level": 0,
            "comment": "Not related to photos at all, but if you are looking for a great café to relax, grab a cool drink, a beer, or a bite to eat check out CAFÉ CLUB MÍŠEŇSKÁ. I just came back from a Prague trip and it was one of my favorite places!",
            "score": 1,
            "author": "quixotic59"
        },
        {
            "level": 0,
            "comment": "This might be just the younger generation in me, but I really enjoy taking photos with the 0.5 lens. Captures more than the selfie but I can take by myself. It also a different style. Ik so phones don’t have it though",
            "score": 1,
            "author": "TravelWithAHat"
        },
        {
            "level": 0,
            "comment": "Offer to take photos of other obvious tourists and get them to take yours in return. Use a selfie stick when not it a crowed area. I would only used a tripod when fully alone or inside a paid tourist attraction like an expensive museum or garden. 1) there will be security 2) local thieves aren’t paying to get in there.",
            "score": 1,
            "author": "TakeTheMikki"
        },
        {
            "level": 0,
            "comment": "Go on Airbnb experiences and book a photographer for a 1-2 hour shoot in the city center or the castle. I did that when I went solo and it was so worth it.  Affordable too",
            "score": 1,
            "author": "Suspicious-Armadillo"
        },
        {
            "level": 0,
            "comment": "I usually look for people who are also taking photos and ask if they would want me to take a photo of them. Once that’s done I ask if they’ll take one of me",
            "score": 1,
            "author": "david2742"
        },
        {
            "level": 0,
            "comment": "You need to just get a little mini Bluetooth device that can connect and act as the camera shutter on your phone :) I bought a panda one for €20 in a Paris train station and it works great for taking pictures of yourself",
            "score": 1,
            "author": "S0meb0dy5"
        },
        {
            "level": 0,
            "comment": "I usually bring my selfie stick.But some places prohibit using it……",
            "score": 1,
            "author": "ChrisWaynene"
        },
        {
            "level": 0,
            "comment": "Ask people I always do that and usually people are happy to take pictures of me :)",
            "score": 1,
            "author": "AdIndependent27"
        },
        {
            "level": 0,
            "comment": "I offer to take photos for strangers and thry usually reciprocate.\n\nA selfie stick may work for you as well",
            "score": 1,
            "author": "ScienceOverNonsense2"
        },
        {
            "level": 0,
            "comment": "In my experience, nothing quite says “I don’t need your help” like taking my own photo. A selfie-stick feels silly at first, but totally worth the awkwardness to not have to hand off your phone or camera to a stranger.\n\nEdit: unlesss of course there’s someone else taking a million photos of themselves. Easy exchange to take their picture and have them take yours. But sometimes other people aren’t around.",
            "score": 1,
            "author": "electryckoolaid"
        },
        {
            "level": 0,
            "comment": "There will almost always be other tourists around. If I see a couple or a small group of tourists that are taking selfies or photos, I ask them \"would you mind taking a photo for me?\" while gesturing with my phone. Or, I offer to take a photo for them, and then I ask them to take one of me. \n\nUsually just finding the people nearby who also happen to speak your language (or have the same accent as you) is the easiest way. \n\nIt's actually a great way to meet fellow travelers!",
            "score": 1,
            "author": "vibrantlybeige"
        },
        {
            "level": 0,
            "comment": "Get a tripod. Or a drone. Done. I used both when I was in Greece last.",
            "score": 1,
            "author": "shortedaman1"
        },
        {
            "level": 0,
            "comment": "There are selfie sticks that double as tripods now. I wouldn't be too worried in Prague about people taking off with your phone. For starters, there will be a tripod attached to it. \n\nPictures are great. I actually do take hundreds. The more, the better. The #1 rule of good photography is to take a lot of pictures. Weed out the best ones later. Of course less than 10% of them have me in it, but that's ok.",
            "score": 1,
            "author": "BRCityzen"
        },
        {
            "level": 0,
            "comment": "Yes definitely take pictures to look back on! What I find is that while traveling solo, it is great to go on group tours. Here you will find people you connect with and they will offer to take the pictures for you. Especially if they know you are traveling solo. Even if you don’t speak to people in your group, I found that they will still reach out to you and ask! The world has amazing kind people. Also, you can bring your own tripod and set it up as well. Either way you will get amazing memories! Enjoy yourself and don’t put to much pressure on yourself to capture every little thing. Enjoy the moment as well!",
            "score": 1,
            "author": "Lovebug256256"
        }
    ]
}