{
    "id": "137ndzi",
    "score": 0,
    "title": "How to make Europe more interesting?",
    "author": "purplegoat2411",
    "date": 1683211141.0,
    "url": "https://www.reddit.com/r/solotravel/comments/137ndzi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recently, I visited a handful of European cities (to name a few Seville, Lisbon, Prague). I'm travelling on a budget as well so I was very selective with the attractions I chose to pay for, and I didn't pay extra for audio guides. At the end of my trip, I found some cities to be quite boring because I felt seeing cathedrals, churches, castles and viewpoints of the cities was very repetitive and mundane. I did enjoy Porto a lot tho, it didn't have as many tourist attractions compared to other cities but the food and people there were the best\n\nI feel like I am doing Europe wrong and before I continue going to other European cities, i was wondering how to elevate my trip without paying exorbitant amounts for every tourist attractions in each city. I'm thinking of paying extra to get audio/tour guides so I can learn the history of the cities more this time. Hopefully, this will make the next few cities more interesting, but I would also like more suggestions (that do not include clubbing/drinking) to make my Europe trip more fun because I think Europe is interesting, I'm just doing it wrong :&gt;",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like you're planning a trip around Europe. Check out solotravel's [detailed guide to planning a solo Eurotrip](https://www.reddit.com/r/solotravel/wiki/eurotrip) for general planning advice plus useful tips and tricks for European travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "It sounds like the issue is you don't know what you are looking at.\n\nA Rick Steves guidebook is perfect for this - they usually have good, concise summaries of the history of each place, which informs why it looks the way it does, and of the local culture, which gives you sense for why it works the way it does. He also has free audio walking tours on his app (including for Lisbon and Prague). The books will also give you a sense for which museums, monuments and structures really are unmissable even for the casual tourist.\n\nThe Wikipedia article for each place can also be surprisingly useful for cramming hundreds or even a couple millenia of history into something you can consume in 10-20 minutes of dry prose.",
            "score": 28,
            "author": "slakmehl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, even looking at a Wikipedia article for whichever castle/palace/ruin you're going to can make all the difference.\n\nIts the difference between \"this is just some old castle\" and \"this castle was site of one of the most prominent battles during one of the bloodiest wars in Europe which has shaped the entire continent to this day\".",
                    "score": 3,
                    "author": "talcom_powder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Might help to know what your interests are. Do you like nature? Food? Architecture? The ocean? Small towns? Big cities?",
            "score": 10,
            "author": "WalkingEars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh good question, I really like exploring nature and food. I'm OK with small towns and big cities, either work. And I'm not that interested in architecture (but i do appreciate really pretty architecture and picturesque places like Vienna) or the ocean. \n\nI guess learning history would be interesting, hence why I've decided to spend more on audio guides for my next trip. Sorry I can't provide a more detailed reply, I'm still trying to pinpoint my interests.",
                    "score": 2,
                    "author": "purplegoat2411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe skip the cathedrals then and do some googling on picturesque cities in Europe and beautiful nature. I don't think it's necessarily fair or within the rules of the subreddit to expect others to plan out an itinerary for you that'll make Europe less \"boring\" for you, but some ideas of things you could consider might be hiking in the Swiss Alps or the Italian Dolomites, visiting some of the picturesque towns of the Amalfi Coast or the Greek Islands, or seeing some of the arctic scenery of Scandinavia (Lofoten Islands for instance)\n\nBut also consider the \"wherever you go, there you are\" universal advice of traveling. If you're in a big foreign city and can't think of any way to keep yourself entertained, that might be something to work on. In any major city (and plenty of small towns) you ought to be able to google \"best food in this city\" or look for live music or try to see if there are any day trips nearby to local hikes or things like that. It's a good skill to find ways to keep yourself amused even if you're in a location that's not your favorite",
                            "score": 14,
                            "author": "WalkingEars"
                        },
                        {
                            "level": 2,
                            "comment": "Check out some of the cheaper restaurants in the cities you’re in. Sometimes I’ll just plan my whole day around where I want to go to eat that day if I find a really cool spot. I like to use Google, TripAdvisor and instagram to find good restaurants when I travel. I also like to visit grocery stores, candy stores and street vendors, etc, if I’m on a budget. \n\nYou don’t really have to go visit cathedrals and stuff like that if you’re not interested in architecture, even if that’s what everyone else does.",
                            "score": 6,
                            "author": "WhatAboutMeeeeeA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nLots of European cities have free walking tours. There’s almost always a “best of” tour and then a few other themed ones. The “best of” ones are a good way to get oriented. You should Google for the best reviewed tour companies in your city, but for instance, Walkative is a network across many cities. The ones by licensed guides do tend to be better. If you’re on a budget, those free tours can be a great value (please tip what you can though). The tour guides also often have cheap, good restaurant and bar suggestions too. \n\nTour guides (or audio guides) are an easy and efficient way to learn, especially if you’re interested in not just the site/object itself, but also the culture and people behind it. Sometimes even paying $20 for a tour is well worth it if you’re interested in a particular theme or area.\n\nIf you don’t want to buy a guidebook (echo u/slakmehl on Rick Steves helping you prioritize and free audio tours), use your library for free ebooks to download to your phone. \n\nThere is definitely church and castle fatigue. You don’t have to go to all of them. Research ahead to see if it’s worth your time to go inside then.",
            "score": 11,
            "author": "Shrinker11",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this. Free walking tours in Europe make all the difference for me. I usually do one on my first full day in a new city, make a list of all the things the guide mentioned that I want to go back and see in detail, and then plan my itinerary around that!",
                    "score": 3,
                    "author": "OkWorking7"
                },
                {
                    "level": 1,
                    "comment": "Agree with this 100%. Free walking tour tip as much as you can afford and its always great information that should make things more interesting.",
                    "score": 3,
                    "author": "jackthebackpacker"
                },
                {
                    "level": 1,
                    "comment": "Also, agree with the free walking tours! For example, when I was in Prague, there was a company that offered 3 different types of themed tours, one being general, the second being a castle tour only, and the 3rd being about the cold war and communism. In most cities, you can find unique historical tours that will cater to your interests where you can learn a lot.",
                    "score": 1,
                    "author": "zogrossman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't start my trip for a couple of months, but I can reiterate what other solo backpackers have been doing to enrich their travels:\n\nBefore going to or during transit to the next destination: watch YouTube videos about the city's history, watch movies/shows that are based on the area (i just finished watching Derry Girls on nflx and seriously thinking about adding Derry to my list).\n\nI'm big on movies and shows, though. \n\nAnother great one is Game of Thrones (northern Ireland and Dubrovnik, croatia) \n\nI watched the da Vinci code for Rome etc etc hahahaha \n\nSo to prepare for my long bus/train rides I have a library of downloaded movies/shows on my phone.\n\nWorks for me!\n\nYou can try audio books also.....maybe check out \"how to travel the world for free\" Michael wigge\n\n\"For the love of europe\" Rick steves\n\nEDIT: I'm not a history buff, although a little is ok, so I'd rather get lost in people's own stories about a city.",
            "score": 8,
            "author": "drawingablank111"
        },
        {
            "level": 0,
            "comment": "Take up birdwatching! Not joking, it's like an ongoing, extremely low-key scavenger hunt. And if you use tools like eBird to find birdwatching \"hotspots\" you will find yourself in places not listed in guidebooks.",
            "score": 7,
            "author": "cetaceanrainbow"
        },
        {
            "level": 0,
            "comment": "Well what are you interested in? You just gotta focus more on that then the stuff you feel like you have to do. If you aren't for example into history or architecture or whatever and don't enjoy looking at stuff like that at home you won't enjoy it while travelling either.",
            "score": 7,
            "author": "valiciachita"
        },
        {
            "level": 0,
            "comment": "Atlasobscura.com is a great resource for learning about unique sites in major cities, outside of the typical tourist attractions that everyone goes to.",
            "score": 5,
            "author": "BrazenBull"
        },
        {
            "level": 0,
            "comment": "Big cities are super samey to me.  Go to smaller towns and find hiking, nature, castles, wildlife.",
            "score": 2,
            "author": "Oftenwrongs"
        },
        {
            "level": 0,
            "comment": "I find it funny that this topic has 0 up votes because this is a very real issue when people travel. \n\nI guess this is an indicator of how many people in this sub are in denial, do not want to recognize one of the pitfalls of traveling, or were triggered by your title.\n\nI've been to numerous places where I was like \"uhh this is fine.\" \"Not as cool as I thought it would be.\" \n\nHas your trip improved at all? I'd like to know!",
            "score": 2,
            "author": "drawingablank111"
        },
        {
            "level": 0,
            "comment": "You went to all the tourist cities. Just go somewhere where there are no hordes of Americans and you´ll be fine.",
            "score": -1,
            "author": "Marsandsirius",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn, us Americans really do stand out in a bad way, huh? \n\nFrom what I've read.....we gotta be a lot more quiet....control our volume, read the room, be much less entitled, and remember we are guests.",
                    "score": 1,
                    "author": "drawingablank111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "brits stand out more than americans",
                            "score": 3,
                            "author": "solo_greg"
                        },
                        {
                            "level": 2,
                            "comment": "As an Australian, I actually find Americans are really fun to hang out with. It's just a generalisation, but while they're often loud, its usually in a fun, positive way (ie. they'll express enthusiasm for literally everything, which is great to have in a travel buddy). Never heard so many \"omg that's amazing!\"s when I'm with a group of them, and the enthusiasm is infectious.",
                            "score": 1,
                            "author": "talcom_powder"
                        },
                        {
                            "level": 2,
                            "comment": "Ehm sorry, I wasn´t really targetting anyone. I just meant that there were many rich English speaking foreigners. Americans, but also British and others probably.",
                            "score": 0,
                            "author": "Marsandsirius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, generally, you have it correct about Americans traveling internationally. Hahaha\n\nA lot of it comes from a mindset of \"well, I paid a lot of money to be here so I'm going to squeeze as much value from this as possible may it be monetarily or experience.\" \n\nIt's a \"look at me/what about me?\" Culture here.",
                                    "score": -2,
                                    "author": "drawingablank111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Myeah possibly, but I just wanted to say that the balance is gone. If some city centers are nothing but tourists, digital nomads etc and business focused on them, there´s no more space for the locals left. At that point the city is dead though. OP just went to places like this and probably didn´t find them very nice, which is understandable.",
                                            "score": 3,
                                            "author": "Marsandsirius"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "or just go outside of the major tourist neighborhoods",
                    "score": 1,
                    "author": "solo_greg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eyewitness tour books are my favorite. They are an excellent mix of maps, historical excerpts, detailed explosions of buildings telling you the best things to look for and why they are important.  They also cover modern stuff like shopping, cultural districts, and let you know about things like festivals that happen annually.\n\nJust google walking tour of the city or church or whatever.  I was the tour guide for my family in Rome and it featured me reading aloud passages from my eyewitness book and googling/wikipediaing tours and places.  Focus on details and unique features and people for the place you are in.  Try to read the walls of the church.  Watch a youtube video of it before you go in.  In the vatican I was doubling fisting phones to view a detailed map on one and read its annotations.  It wasn’t here’s another pope.  It was this guy has an entire ship battle on his tomb because he fended off The English at the battle.  Notice these two ships tied together hammering themselves with cannon at point blank range.  Can you imagine?\n\nTalk to the docents for suggestions on what to see next and where to eat.\n\nFinally, let yourself stop when it becomes all the same.  Plan the most interesting sites first and then rest. Everyone gets overwhelmed after a while.",
            "score": 1,
            "author": "tealcandtrip"
        },
        {
            "level": 0,
            "comment": "I was feeling that too... old buildings, lot of walking, repeat. Fatigue. I felt like I was missing the point. \n\nTwo thoughts- get out of town. Most areas have outdoor attractions- even just a few hours in a park somewhere may help to regroup.  \n\n\nGet out of Europe. For all the cultural differences between countries, the similarities can become distracting. In my case, a trip to Japan. Which was enough of a jolt to make me feel like I was someplace new, different, and worth paying more attention to.   \n\n\nIn my opinion, not necessarily the best time to look at the world for destinations, but the choices are there.",
            "score": 1,
            "author": "Oddswoggle"
        },
        {
            "level": 0,
            "comment": "Have you looked at the cities' official tourism sites?  You might find something that isn't an obvious/well known choice.  A lot of sites have been adding unique things to their attractions and events.",
            "score": 1,
            "author": "HMWmsn"
        },
        {
            "level": 0,
            "comment": "Start with Rick Steves Audio Europe app\n\nDon’t sink money into things you don’t care about just because they’re on some list, save your budget for stuff that has meaning for you. I know that’s not rocket science, but it’s surprising how people try to have the trips they think they’re “supposed” to have, which I think leads to experiences like what you described",
            "score": 1,
            "author": "roub2709"
        },
        {
            "level": 0,
            "comment": "Europe is boring \n\nGo to Latin America/Africa or some other area for your next trip",
            "score": 1,
            "author": "highonlife_222"
        },
        {
            "level": 0,
            "comment": "If you like to outdoors/nature consider doing some hiking or any of the below \n\nVia ferratas in Italy, Switzerland, Austria\n\nGermany has lots of hiking such as the Rothaarsteig or Zugspitze\n\nFrance has some amazing national parks (parc national des calanques is just outside Marseilles and can be reached easily enough by bus.) There's lots of rock climbing, bouldering, snorkeling etc there\n\nAustria has tons of outdoors stuff: rafting, canyoneering, caves, mines, hang gliding, skiing, etc.\n\nObviously some of these things will be quite pricey but maybe they are worth it to you and so you're willing to budget for some of them.",
            "score": 1,
            "author": "Express_Platypus1673"
        },
        {
            "level": 0,
            "comment": "I travel, camp and hike a lot to break up the repetition. Here are some things I've done in Europe and a few i would recommend:\n\n\n* Hike around the Norway fjords\n* Hike the alps (i did the tour du mont blanc, ~170km and hikes in Zermatt and Interlaken in Switzerland)\n* 3 day camping/canoe trip through estonian bogs\n* Go somewhere during their big festival (Nice carnival, Valencia las fallas, Basel Fasnacht, etc)\n* Croatian road trip including the Plitvice waterfalls\n* Road trip/visit northern Ireland near the Giants Causeway\n* Seek out specific things to eat\n* Those free walking tours\n* Seeing a concert \n\n\nOther ideas\n\n* bungee jump in Switzerland \n* I think you can solo skydive with an automatic parachute in Switzerland too\n* Hiking in the Dolomites in Italy\n* Visiting antique/junk markets (besides curious gawking you have outdated world maps, English novels published in USSR edition, etc)\n* Schlittenfahren in the winter (like skiing down a mountain but on a wooden sled)\n* Rollercoasters (Shambhala coaster in Spain)\n* Go to a popular exciting event that you usually have no interest in (formula 1, boxing match, performance art, bathhouses)\n* Visit graves of notable people that matter to you (eg i visited oscar wilde)\n* Visit historical significant places like Waterloo and Normandy and Auchwitz \n\n\nEveryone travels to take in the architecture, the art, food and history. Culture is experienced in varying degrees. But most of these activities boil down to just \"looking at stuff\".\n\n\nIt's okay to get bored with \"looking at stuff\" even when the stuff is beautiful. There's nothing wrong if you skipped on a guide and learned very little history because it's your trip and you're not obligated to do anything you don't enjoy.",
            "score": 1,
            "author": "kayday0"
        }
    ]
}