{
    "id": "138snzj",
    "score": 9,
    "title": "Traveling alone with my two cats",
    "author": "babyboybelch",
    "date": 1683301624.0,
    "url": "https://www.reddit.com/r/solotravel/comments/138snzj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Next month, I will be traveling with my two cats in a single carrier to move from Chicago to Portland. I have already confirmed with the airline that this will be allowed, but my main worry is that I will have to carry these guys through TSA and the airport by myself. The issue with this is that neither of them like to be held, and my kitty stroller I originally planned on placing them in is too large to fit under the seat and they are sooo heavy. I plan on giving them each a dose of gabapentin so they will be sleepy, but I am worried that this will not be enough to keep me safe from their scratching and cries while I wait for their carrier to go through the scanner. I can not find a single person online with a similar experience to me and I am starting to get increasingly nervous as the date approaches. If anyone has any advice on how to make this day not a living hell, I would greatly appreciate it.",
    "comments": [
        {
            "level": 0,
            "comment": "Arrive really, really early and request a private screening.\n\nA TSA agent   will screen you, your cats, and your carryon and carrier in a private, enclosed room, ensuring the cats cannot wiggle free.",
            "score": 38,
            "author": "Kv603",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is it - request a private screening room. This is how we moved our cat from Scotland to the US. We still had a little harness and leash for him - just in case.",
                    "score": 12,
                    "author": "l_amarien"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I flew with my two cats from California to North Carolina and back. I highly recommend getting halters for them with tags attached just in case you need to hold them you have something to hold onto. I’d also suggest doing a trial run with the sedatives before your flight. One of my cats reacted very badly to it on the first flight and ripped all her claws out. The second time, I didn’t give them any drugs and they did a lot better. Also if you can get the airline to allow two separate carriers, it’s a lot better to have them on the plane with you vs being the cargo hold. Good luck!",
            "score": 13,
            "author": "K8astrophically"
        },
        {
            "level": 0,
            "comment": "Parents gate check strollers. Maybe you can gate check it? You leave it in the jetway (they tag it prior to boarding) when you get on the plane and they take them down into the belly of the plane from there. When you arrive, it’s waiting at the jetway for you.",
            "score": 11,
            "author": "Codewoman1125",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is exactly what I do with my dog stroller for my Pug and Chihuahua.",
                    "score": 1,
                    "author": "PandSshow2021"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i flew alone with my cat from denver to NC, i had to carry him through the scanner and put him in his carrier under my seat. he was freaking out and i was barely able to hold him walking through security, thankfully a kind stranger grabbed the carrier and held it for me to put him back in after it had gone through. they offered me a private screening but i would have missed my flight, so definitely get there EARLY and request a private screening for you and your kitties!",
            "score": 10,
            "author": "ConsiderationFew3360"
        },
        {
            "level": 0,
            "comment": "I've flown on Southwest out of Midway (one of the only airlines allowing two pets per carrier) and getting through the checkpoint was a bit of a juggling act even with two people involved.\n\nIf you have a friend on the Chicago end, you could try to arrange for a \"*gate pass*\" (aka   \"[Non-Passenger Escort](https://community.southwest.com/t5/Knowledge-Base/Requesting-a-Non-Passenger-Escort-Pass/ta-p/93349) (NPE)\") so an assistant can come with you through airport security despite not having a ticket.\n\nFirst place to ask would be your airline.",
            "score": 6,
            "author": "riverviewpark"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.tsa.gov/travel/security-screening/whatcanibring/items/small-pets\n\n&gt;&gt; You should maintain control of your pet with a leash and remember to remove the leash when carrying your pet through the metal detector",
                    "score": 3,
                    "author": "Kv603"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[https://www.tiktok.com/@cat.mando/video/7075338391310699822](https://www.tiktok.com/@cat.mando/video/7075338391310699822)\n\nThere are a bunch of tiktoks with people taking their cats through the airport!",
            "score": 3,
            "author": "swancandle"
        },
        {
            "level": 0,
            "comment": "Ask tsa for a personal room when you take them out of the carrier. I came to Italy with two cats and had a friend help. We were both red and tired carrying them - only one cat with our luggage so I don’t know how you will manage that part. I didn’t give my cats anything. I used a calming spray and that worked. Best of luck. Highly suggest getting a friend and having two carriers. If they can’t stand up and turn around, they won’t let them travel no matter what the other worker said. Plus they can’t be over a certain weight.",
            "score": 1,
            "author": "BrookeBeckOnlyFans"
        },
        {
            "level": 0,
            "comment": "I moved from Chicago to Portland with a cat a couple years ago. My cat hated her carrier and hated being held so I gave her gabapentin, and she basically slept the entire time. She was too out of it to even notice I was holding her. If your cats tolerate a harness, I would recommend putting a harness on them so you can have a hand firmly on the harness while you’re holding them in case they get wiggly. Also, ask your vet for a couple extra doses of gabapentin so you can test it out on the cats before the trip and make sure they respond well to it.",
            "score": 1,
            "author": "llama_raptor89"
        },
        {
            "level": 0,
            "comment": "Have you considered a backpack for each cat?  They sell cat backpacks on Amazon that some cats actually enjoy.  I see them quite frequently now.  Obviously each cat is different so yours might not like them but some learn to like them after a small amount of exposure.  I just bought one for my cat to take her on walks with.  It’s kind of funny, outer space looking but it gets the job done.",
            "score": 1,
            "author": "GiveMeThePoints",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  unless you have a special security screening you have to take them out of the carrier and walk thru the metal de\n\nYou won't be allowed to keep the cat in the backpack when you go through the scanner.\n\n[All bags and cat carriers \\(empty\\) go through the X-ray machine, you and the cat walk through the scanner.](https://www.tsa.gov/travel/security-screening/whatcanibring/items/small-pets)   They'll make you take off any leash, but usually you can keep a metal-free (velcro style) harness on while going through the scanner.",
                    "score": 1,
                    "author": "Kv603"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve flown with my cat six times, internationally and state side. Every single. Dang. Time. I ask the tsa agent for a private screening room. It’s been massively busy, I even had a tsa agent get angry with me once because all the agents there were scared of cats and I had to wait 15 min. I’ve always sat in the screening room and kitty will either hide under one of the desks or sit on my lap.",
            "score": 1,
            "author": "Pastalavistababy_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I should add that you have to wait with your cat(s in the screening room while they scan the carrier",
                    "score": 2,
                    "author": "Pastalavistababy_"
                }
            ]
        }
    ]
}