{
    "id": "139zf62",
    "score": 2,
    "title": "Slovania roadtrip - 14 days itinerary (thoughts welcome!)",
    "author": "Maxime_Bt",
    "date": 1683400912.0,
    "url": "https://www.reddit.com/r/solotravel/comments/139zf62",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi!\n\nI'm planning on visiting Slovenia for 2 weeks mid-end of May. I will have a car so I'm quite flexible. This is the current itinerary - I still have some gaps to fill and some questions :)\n\nDay 1: Arrive in Ljubljana, 1/2 day Ljubljana\n\nDay 2: Explore Ljubljana\n\nDay 3: Explore lake Bled, walk around and hike to viewpoints Mala Osojnica and Velika Osojnika\n\nDay 4: Hike Mount Vogel early morning, explore lake Bohinj in afternoon (hike to Vogar viewpoint)\n\nDay 5: Hike 7 lakes of Triglav (I hope the weather allows.. Will there be snow at this altitude?)\n\nDay 6: Go to Kransjka Gora and visit Zelenci + Lago Di Fusine (Italy)\n\nDay 7: Visit Lake Jasna + go over Vrsac pass and hike there at top (not sure yet) -  Is this worth it given I already did some nice hikes the days before?\n\nDay 8: Explore Soca valley (potential hike along the river) or visit Tolmin and do a hike there\n\nDay 9: Rafting in soca river in morning and chill in afternoon\n\nDay 10: Explore wine region (not sure yet which one/where - somewhere between Bolvic and Piran I guess? Any recommendations?\n\nDay 11: Wine region again? (other activities welcome)\n\nDay 12: AM Koper - PM Piran\n\nDay 13: Not sure (other activities welcome)\n\nDay 14: Skocjan caves + go back to Ljubljana airport and fly home (evening)\n\n&amp;#x200B;\n\nQuestions :\n\n* Day 8: How to hike along the Soca river when you have a car? It looks like the hikes are mainly from the Vrsic Pass to Bovec (one way) - then my car would be stuck at the Vrsic Pass?\n* I'm not sure about day 7 and 8. Is a hike at the top of the Pass worth it? A hike in Tolmin sounds nicer. On day 7, I might just drive over the pass and hike along the river from Bovec and take a bus(?) back to Bovec and then hike in Tolmin on day 8.\n* Day 10: Not sure yet which wine region I should go for. I'm not that much interested in the wine itself, more in the beautiful views of the vineyards\n* Is it worth it to swap visiting a wine region for Logar Valley? Or should I add Logar Valley on the 2 days for which I'm still looking for activities?\n* Is Maribor a better option than Logar valley or a wine region?\n\n&amp;#x200B;\n\nThis above would be the ideal order of my itinerary, but it will be highly dependant on the weather. It seems like there is quite a bit of rain forcasted in the coming weeks. I will prioritize the hikes over anything else whenever the weather is nice :)\n\nThanks a lot for your inputs, all help is more than welcome!!",
    "comments": [
        {
            "level": 0,
            "comment": "Don't miss the opportunity to see Skocjan Cave. You have it at the end of the itinerary on the day you fly, and I can see you dropping due to time or fatigue - Don't skip it!\n\nIt's really an amazing cave. I would also highly recommend Postojna Cave and Predjama Castle (the \"castle in a cave\"). \n\nEverything on your trip looks great. \n\nAnother beautiful hike near Lake Bled is through Vintgar Gorge. They built a nice walkway right through the gorge and it's pretty cool walking along the wooden path just feet from the raging rapids.",
            "score": 3,
            "author": "BrazenBull",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sh*t, I will have a duplicate thread coming up anytime soon. My internet dropped when I posted this one and I thought it didn’t get saved. In the meantime I changed my itinerary slightly (which you will see in the other thread) and moved Skocjan caves on the trip from the wine valley to Piran (so no longer the day before I fly home).\n\nWould you recommend to visit both Postojna cave and Skocjan? I haven’t looked into Postojna or the castle yet, thanks for the tip!\n\nVintgar Gorge ended up on my “maybe” list. For some reason I’m more attracted to valleys and mountains than by gorges.. I guess it’s a personal thing. Eventhough I must say that you triggered me with the raging rapids right underneath your feet..",
                    "score": 1,
                    "author": "Maxime_Bt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Between the two caves, Skocjan is more impressive. It earns its place on the UNESCO list for sure. Postojna is absolutely worth visiting also, if you have the time for a few reasons:\n\n* There is a beautiful hotel right next to Postojna Cave called Hotel Jama that is not expensive and has hiking trails all around it. (George R. R. Martin stayed at this hotel when he visited Postojna Cave).\n\n* Predjama Castle is only 15 minutes away, so so can see both in half a day.\n\n* Postojna Cave has a train that runs through it for part of the way, and you can ride on it! This is a unique activity unlike any other mega cave in the world.\n\nI've been to both and I recommend both caves. I saw them during a weekend trip to Slovenia (I live in N. Italy). I couldn't decide which to see, so I saw both. I was in Cappadocia last week and couldn't decide between Derinkuyu or Kaymakli Underground Cities, so same situation  - I went to both (Derinkuyu was better).",
                            "score": 1,
                            "author": "BrazenBull"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who literally got back yesterday. It’s beautiful. But be prepared for rain. Also to note it was very not busy when I was there. Which is nice but at the same time hiking 10+ miles and not seeing a soul can also be eerie. \n\nI don’t think the first cable car up Vogel is til 8am so be sure to check so you aren’t too early. But Bohinj was my favorite day. \n\nAlso to answer your other question about snow. There was some in the mountains still. \n\nI also wouldn’t skip Vingtar Gorge from bled. Well worth the ~2 hours it takes.",
            "score": 3,
            "author": "lavacakeislife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi!\n\nHow credit card friendly is Ljubljana? Do all of the grocery stores take foreign VISA? \n\nI saw on youtube that there's a farmer's/open market, but I'm assuming those are cash only.\n\n&amp;#x200B;\n\nThanks!",
                    "score": 1,
                    "author": "drawingablank111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hello! Almost everything was CC friendly. (Visa and Mastercard I personally used.) I did buy a bag at the open air market with one as well. Not sure if that extrapolates to all the booths. There were a few bus drivers that didn’t take card and one bed and breakfast in the mountains. So I would bring some cash. But you probably don’t need much at all.",
                            "score": 2,
                            "author": "lavacakeislife"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m really excited to go, it does look beautiful from the pictures! Yeah it looks like there will be quite a bit of rain the coming weeks. I’ll make sure to waterproof treat my jacket and boots again. I also have waterproof trousers, so I hope that’ll do..\n\nRegarding the snow in the mountains, are hiking boots and walking sticks enough, or do I need something else?\n\nI’m hoping to meet fellow hikers to go hiking with :) but I can imagine it’s more quiet these days. Which is good as it’s easier to change travel plans and hotels, but which can also he eerie on a long hike as you said.. Pratical question: is there internet up in the mountains?\n\nI’ll try to squeeze in Vintgar Gorge, I keep reading good things about it but somehow it didn’t attract me that much. Maybe I’ll miss out by not going.",
                    "score": 1,
                    "author": "Maxime_Bt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The snow I encountered was just fine with hiking boots. Higher elevations you might want spikes. \n\nI didn’t have any cell phone service haha the Labor Day holiday being two days made it so by the time I was able to buy a SIM card I only had one full day left. So I just used the free trial of AllTrails+ and downloaded maps.",
                            "score": 1,
                            "author": "lavacakeislife"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, Slovenia is a great country. \n\nI have not been in the Logar Valley but have been in Maribor one September where it rained non-stop for 3 days.\n\nHave  you got a backup plan if the weather ends up being wet?",
            "score": 1,
            "author": "baghdadcafe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m really scared of the weather tbh, it looks horrific atm. But I’m hoping it’s short periods of rain, or just a bit of drizzle..\n\nNo real back up plan.. I will look up some interesting museums, like one on cheese making and the one on WWI, but that’s it. Other than that, I’ll just wear my waterproof trousers and go for hikes in a more foret area on rainy days I guess..\n\nDo you have any suggestions on things to do when it rains?",
                    "score": 1,
                    "author": "Maxime_Bt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A good book and a cafe bar in Maribor was my solution...It was very enjoyable.",
                            "score": 1,
                            "author": "baghdadcafe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good idea! I still need a good book to take with me! A good book in a café on a rainy day does sound lovely.",
                                    "score": 1,
                                    "author": "Maxime_Bt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For the wine region, check Goriška Brda, it's on your way and very scenic place.",
            "score": 1,
            "author": "TheSB78",
            "replies": [
                {
                    "level": 1,
                    "comment": "That looks beautiful! And it’s indeed on my way down to Piran, thank you!",
                    "score": 1,
                    "author": "Maxime_Bt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recommend to rent a bike (electric if you're not good with hills) to explore the region.",
                            "score": 1,
                            "author": "TheSB78",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a good idea, didn’t think of that. Should I get them from a store in a center (which one?), or do most hotels/hostels offer them too?",
                                    "score": 1,
                                    "author": "Maxime_Bt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's been a while, but I think I rented mine in Šmartno, you can rent them from tourist info center or the hotel across the street. There might be other places, as there were many people going around on bikes.",
                                            "score": 2,
                                            "author": "TheSB78",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks, those are good instructions already. Thank you!",
                                                    "score": 2,
                                                    "author": "Maxime_Bt"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll also be in Slovenia around this time (may 19-22 specifically). Message me if you want to meet up, planning on doing hiking around Bohinj and Bled",
            "score": 1,
            "author": "fundo7"
        }
    ]
}