{
    "id": "13bmbvn",
    "score": 0,
    "title": "How much data for one week in Mexico City?",
    "author": "littlefoodlady",
    "date": 1683545580.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13bmbvn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently traveled to Yucatan and while I do have a flip phone that can have data/make a hotspot, I also use an old iphone when I travel that does not have any service. I was able to get around fine just using wifi. The only thing was, since I'm solo and a woman, I kept a pretty early curfew at night (like 8pm) unless I was out with others. I know I was in a really safe area but it just felt like common sense to not walk back alone after dark. \n\nWell now I'm going back and doing another week in Yucatan with 2 friends and then a week solo in CDMX. This time, I want to get a sim card for CDMX so that I can use Uber. This seems like a no brainer expense for safety purposes. \n\nHow many gb for a sim card do I need for 6 days/7 nights? I read one female solo travel blog where 8GB was recommended. This seems a little excessive, but I'd definitely rather spend too much than too little. Want to be sure I have enough for final Uber to the airport. And can I just get my sim at an Oxxo in Merida before I go to CDMX or should I order ahead of time? \n\nTIA!",
    "comments": [
        {
            "level": 0,
            "comment": "Look at what you use on data now and use that to estimate.",
            "score": 6,
            "author": "AdditionalAttorney"
        },
        {
            "level": 0,
            "comment": "This has everything to do with how you use your phone and nothing to do with where in the world you are. If you’re literally just using it for Uber, the smallest package they sell would be more than enough. If you want to have a nonstop stream of TikToks playing, then 8GB sounds more right. For me, 2GB would probably be plenty. Maybe I’d go for 3 if it was a physical SIM that I can’t easily top up",
            "score": 7,
            "author": "elijha"
        },
        {
            "level": 0,
            "comment": "It depends so much how you use your phone. If you're literally only turning the data on when you need an uber, 1GB is more than enough. if you're video chatting, tiktoking, instagraming, watching netflix, etc everywhere you go then you could burn through 20GB in a week.\n\nI don't use my phone to do much other than maps and texting, and am on wifi a lot, and I use about 1GB in a month. Maybe 2 if I'm not around good wifi often enough.",
            "score": 2,
            "author": "RobotDevil222x3"
        },
        {
            "level": 0,
            "comment": "**Note:** Are you asking for travel advice about Mexico City? Read what the Solo Travel community had to say in the [weekly destination thread for Mexico City](https://www.reddit.com/r/solotravel/comments/12bio7z/weekly_destination_thread_mexico_city/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Get your telcel chip at any OXXO and pop it in. It will come with with like 50-100MB which just enough for you to pop it in to buy another data packet. Telcel has packages from 50MB to 6GB starting from $10MXN all the way up to $500MXN. The typical social media (all but Tik Tok) platforms are included for free after 400MB. \n\nI am on the 2GB plan (and live here) and have never come close to hitting that limit. In the rare instance that I hit the limit, I just log into mitelcel and buy another package. It's really not sweat.",
            "score": 1,
            "author": "AppropriateRecipe342"
        },
        {
            "level": 0,
            "comment": "\\&gt; I know I was in a really safe area but it just felt like common sense to not walk back alone after dark.\n\nThat's common sense everywhere, but really not needed in Downtown Merida. You can walk 4:00 AM alone and nothing will happen to you. CDMX is another thing entirely, i don't like to be out by 7:00 pm lol",
            "score": 1,
            "author": "soparamens"
        },
        {
            "level": 0,
            "comment": "There is free wifi everywhere, your need for data will be minimal.",
            "score": 0,
            "author": "ihatekale"
        }
    ]
}