{
    "id": "13c1vqt",
    "score": 55,
    "title": "Trip Report: 3 Weeks in Europe by Train",
    "author": "jtrom1010",
    "date": 1683573711.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13c1vqt",
    "media_urls": [],
    "other_urls": [],
    "postText": "# About Me\n\n30M, 3rd time in Europe, never did the multi-country train stint. Remote worker, I spent \\~5 days working so I could see more places. Pace was quick but I didn't feel stressed or rushed at all.\n\nBrevity is not my strong suit, glance at the recommendations bullets if you want to skip the stories. :)\n\n**Route:** Vienna, Prague, Berlin, Amsterdam, Ghent/Bruges, Paris—April/May\n\n# Tl;dr Highlights\n\n* Showed up for King's Day in Amsterdam by accident\n* French food (and people)\n* Roger Waters in Paris\n* The beauty of Prague\n* Currywurst and partying in Berlin\n* Finally learning about, and using, the Hostelworld city chats\n\n# Budget\n\nTotal \\~$5000. I sprang for amazing restaurants and generally anything I wanted. Private hostel rooms and a couple Airbnbs because of my work gear and need to take meetings. Dorms would have shaved a lot of spend.\n\n# Vienna\n\n**2 Days - Airbnb in Schwedenplatz**\n\nWith fatigue and short time, I can't review fairly but I'm glad I didn't stay longer. Vienna is stunning but struck me as a prettier, less cool Budapest; an architectural dream with a mall plopped in the middle.\n\nSt. Stephen's was awesome, but the catacomb tour was underwhelming. I'd skip it. **Get punschkrapfen, but don't get it at Aida.**\n\n# Prague\n\n**4 Days - Hostel Elf in Zizkov**\n\n\"Regions\" start to blend and lose their wow factor for me. Prague stunned me; walking through Old Town was uniquely inspiring.\n\nHostel was fantastic, highlights included patio nights with hostelmates and an unexpected club night with a group of Spanish travelers.\n\n*Highly* recommend Zizkov to stay; tons of amazing bars, restaurants, and street art, feels more local. However, it's not convenient for walkability or trams where I was, and it's hilly. Use the bus or Bolt for time.\n\n**Recommendations**\n\n* Don't take the stairs to Prague Castle. Start in Letna Park, enjoy some stunning views, and walk up the side through the park areas to get to the castle from there. Amazing.\n* Black Angels bar under Hotel U Prince for nice cocktails. Speakeasy vibe, no pictures, random piano playing.\n* Jazz Dock: A jazz club on the canal that's simply wonderful. Get seats, not standing, trust me.\n* Kutna Hora: Do all the things, I bungled this as a daytrip badly by not planning. Go early and leave late, or spend the night. The bone ossuary is amazing, but **absolutely not** enough to go for just that.\n\n# Berlin\n\n**4 Days - Kiez Hostel in Friedrichshain**\n\nI'm madly in love with Berlin, even though Germans will (probably rightly) tell you it's not true Germany.\n\nFor sightseeing, I like to head in the direction of POIs, and explore randomly from there. The Lime scooters made this obnoxiously fun; bike routes are plentiful and straightforward. Tram system was also stellar (and necessary, Berlin's big).\n\nHostel was dead, but a great neighborhood on the east side by famous clubs, a cool (but hipstery) nightlife area, and restaurants. I suspect other neighborhoods are preferable for lots of travelers, but I was content on the east side.\n\n**Recommendations**\n\n* It's a cash town, plan accordingly.\n* Don't bother with the Berghains of the city. Lots of great smaller clubs you can party 72 hours straight in if you want to, and you should go once if it's your thing.\n* Eat Currywurst, lots of it. Curry 66 was a 2-time meal.\n   * Shitty places will just do ketchup and a seasoning for \"curry\". Good places have their own sauce. There's a difference.\n* Most of the usual sightseeing suspects are grouped, but it wasn't a neighborhood I'd love to hang out in. I'd do these in a day together. Checkpoint Charlie is entirely skippable.\n* Matanga Tapas &amp; Cocktails for an incredible dinner and drinks.\n\n# Amsterdam\n\n**4 Days - Hans Brinker Hostel in the Centrum**\n\nThis was my first repeat city, and I loved it even more. It's special in every way. That said, what was meant to be a shorter, chiller work stop was obliterated by King's Day.\n\nFor those unaware, it's a 2-day street party like Mardi Gras on steroids, and oranger. I cut Antwerp to extend for this (getting around the city is pure absurdity that day anyway).\n\nThe hostel was cool, but hotel-like with the \"common\" area being a large bar, so I used the Hostelworld city chats for the first time **(didn't know they existed, and seriously, I'm so glad I figured it out)**. Wound up with an amazing group of people for 3 days.\n\nI was getting serious solo blues from bad luck with social hostels, and this properly cured it.\n\n**Recommendations**\n\n* Go to Amsterdam twice, once for King's Day, and once to experience the city authentically.\n* Late food is difficult and food overall is meh. Keep snacks handy, eat simple, Amsterdam perpetually disappoints me with this.\n* If coffeeshops are your thing, Barney's Lounge by Rembrandtplein. I still need good coffee and theirs is great. It also feels more like a coffeeshop where you smoke, not a dark, schticky place to burn one that also has coffee.\n* Melkweg, even on a busy night, was fun and relatively hassle-free if you're into clubs.\n* The Dutch will plow you on bikes, watch your ass. They are the friendliest humans until they're on bikes, and then they have no chill—I love them for it, though.\n* I did a lot of typical sights on my 1st trip here, so they're not included. But most of them are rad, go do them, and go to the A'dam Lookout at sunset.\n\n# Ghent/Bruges\n\n**2 Days - Kaba Hostel**\n\nI was exhausted, got a small cold, and also had to work. I can't give a fair review, so the tl;dr\n\n* Pretty, but expensive, didn't do much for me overall. Wouldn't go back, glad I went briefly.\n* Try the \"noses\" in Ghent, they're unique. Just get the traditional raspberry ones.\n* Chocolate totally holds up.\n* Bruges was stunning, but I would not stay there. I'm glad I did a half day, it's way too overrun with sightseers (obviously I'm part of the problem) and Ghent was more fun to hang out in.\n* Trains here are the worst.\n\n# Paris\n\n**4 Days - Airbnb in Le Marais**\n\nTravelers of all nationalities (French included) told me horror stories. Fuck every bad thing anyone's ever said about Paris. It's wholesale amazing and Parisians were some of the friendliest people I've ever interacted with.\n\nOverly accommodating with language barriers, random locals coming to chat in a bar where I was having a drink by myself, restaurants going the extra mile to accommodate me even as a solo diner\\*.\n\nWalking through Paris feels magical, but more importantly, it's a major metro. If you can't find **something** to enjoy in NYC, Paris, London, etc. you're probably the problem.\n\nI went to L'Arôme for a Michelin dinner and. Just wow. Indescribably good food. Talked to several other tables nearby. Chef came out to greet everyone and hang, caught me on my way out and invited me to sit down more with other patrons over drinks. Dude was hilarious, and also gave me like 3 free glasses of amazing wine for no reason at all.\n\nIronically, you'd think the \"solo dining isolation\" would be worst in the nicest restaurants. It was the opposite experience for me, although eating alone doesn't bother me regardless.\n\nMy final night, I checked out Roger Waters' farewell tour, and yes, it was mind-blowingly good.\n\nAlso, I'm a musician and my Airbnb had a piano, guitars, all kinds of weird instruments. I swooned hard.\n\n**Note on the protests:** I was there on May Day, one of the worst days. I saw smoke in the distance once, otherwise, I would not have known anything was up. Kind of a strange thing, honestly.\n\n**Recommendations**\n\n* Go to the Trocadero at sunset with wine, baguette (TRADITIONAL, ORDER IT THIS WAY), ham, and butter. Watch the sun set on the Eiffel, and accept that you can't overrate the experience. It is indeed incredible.\n   * I went to the top at night, wait was much more bearable. Take the stairs down from the 2nd level, it's fun.\n* Montmarte was stellar to explore all around.\n* Shell out for at least 1 Michelin restaurant. Preferably, make it L'Arôme.\n* I'm sure the Louvre is great. I didn't go, and I don't care. Versailles would have been nice, but also glad I skipped for time's sake only.\n* St. Michael's Fountain is your standard, pretty, old POI, but something about it amazed me.\n* Macaron at Pierre Hermé is the move.\n   * Take a day to hate yourself and drop into a few different patisseries and just eat everything\n\n*\\*Some places I went, like Les Marmottes, have raclette courses meant for at least 2, for example. \"Don't worry, we got you, enjoy\" and didn't even charge me for 2 which they very much should have. Do go get raclette, and do go to Les Marmottes for it. Similar treatment in Michelin places, many of which I found don't give the online res option for 1.*\n\n# General Thoughts\n\n* I won't be spontaneous with day trips anymore. I will plan those meticulously forever.\n* I've never had as much extended time feeling lonely as the first 7-10 days. The HW chats really were a game-changer, but I also got my first string of hostels where friends weren't instant or it was empty-ish.Looking back it was good chill/reflection time for me, but I learned I enjoy spontaneity more with friends. I don't want to plan by the hour, but the days where I had lots of activities to choose from made it easier. I suppose I, arrogantly, built in \"whatever time\" because I got used to ending up on random adventures just by being in the common area. Tl;dr, too little planning was as bad as too much.\n* I miss Europe a lot, every day.\n* Still shocked at how absolutely \"do whatever you want\" the rest of the world is, while hearing people back in the States talk about how free we are. I knew this already, but it's hilarious still.\n* Always go out of your way to see concerts and music abroad. This wasn't my first. Def Leppard in Bogota, Backstreet Boys in Budapest, festivals in the UK. It's seriously such a fun thing.\n* I didn't get the whole ticket vs. seat reservation thing, honestly. I won't ever get on a train without a seat res again.\n\n**EDIT:** For no reason, other than perhaps my own journaling, I'm including the random list of on-repeat songs for the trip. I'll never be able to divorce these songs from the memory of this trip:\n\n* Shade Astray - Invent Animate\n* Thanks Nuobo - Periphery\n* Lots of Fleetwood Mac\n* English Girls - The Maine\n* Rylynn - Andy McKee\n* Lots of Chvrches\n* Closer - Deadmau5\n* Provenza - Karol G\n* Lots of Sleep Token",
    "comments": [
        {
            "level": 0,
            "comment": "I live in Amsterdam and I agree with you on food - it sadly pales in comparison to the big cities like Paris, Rome, and Madrid.\n\nGlad you got to be here for King's Day though. It was my first because of COVID and it was absolutely amazing! \n\nIf you ever find yourself in Amsterdam again, give me a shout. There are some great Michelin restaurants here that I found over the past three years, happy to send you some recs",
            "score": 11,
            "author": "leffe123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad I'm not just crazy, I take pride in sniffing out the best food in a city and continue to fail miserably in the Dam.\n\nAbsolutely will do friend, thank you.",
                    "score": 1,
                    "author": "jtrom1010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We did a very similar trip, Amsterdam, Bruge, Paris and I was also there for May Day which sucked because all the stores and museums were closed, so I do not recommend going May 1st for anyone reading this. Also felt Parisians were very friendly and the city was beautiful. Belgian trains are awful and so hard to understand, somehow managed to figure it out. I need to go back to Amsterdam for King’s day it looked amazing!",
            "score": 6,
            "author": "Ohh0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like an amazing trip! May Day happened to coincide with the worst days of the protests, which is why I bring it up, but also the closures in general. It *is* why I didn't do quite as many of the typical sights, although I was happy with my trip. \n\nCrazy going from Belgium to France for me on the train front. The stark contrast between Belgian rail and those absurdly nice bullet trains from Lille to Paris.",
                    "score": 2,
                    "author": "jtrom1010",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The protest part was interesting because if you didn’t hear about it, good chance you would have never of known it was happening. Everything in the center area was business as usual and hardly anyone was mentioning it. I didn’t even see any videos of it. I was thinking about walking in the general area for a good view but decided not to.",
                            "score": 2,
                            "author": "Ohh0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was morbidly curious myself—early college years were social studies/journalism—but I figured it was equal parts unwise and fear porn at the expense of others, so I decided against it.",
                                    "score": 5,
                                    "author": "jtrom1010"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post! When you say that the fancy restaurants didn’t do res online for one person - do you mean that you called and they accommodated? Or that you went in person hoping for the best? Thanks!",
            "score": 5,
            "author": "wowsomethingwow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yeah I wasn't very clear about that. I had to look hard for a place that had openings within 2 days AND allowed for solo res.\n\nI'm sure pop ins may have worked but I didn't wanna roll the dice on it and I eventually found this one (the best reviews too, go figure).\n\nI'll be clear that I usually spring for Michelin or fine dining once or twice per trip and it's super not weird to go solo, but it seemed to me that tasting menus were much more common than in other cities (even in bistros) and the unconfirmed vibe I got is they're often meant for 2 or more.\n\nIn any case, that applied more to the raclette place. After all, it's a giant wheel of melted cheese and a bucket of potatoes with meat and salad. That's hard to prepare for 1 haha. I do appreciate when nice restaurants make solos feel welcome though and L'Arome absolutely did.",
                    "score": 3,
                    "author": "jtrom1010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you handle the rail travel? Rail pass or individual tickets for each trip?",
            "score": 2,
            "author": "Magic8Ballalala",
            "replies": [
                {
                    "level": 1,
                    "comment": "Booked separately. I think I saved some money, but I suspect for my itinerary it was close to 6s. More cities than that you probably want the pass.\n\nFlexibility with the pass probably would have been the benefit (I lost some 30 bucks when I yolod King's Day) but because of my work time and private room inflexibility I was pretty bound to a schedule anyway. \n\nOne or two of my trains got damn close to full though so I'd be pre reserving if I went back in peak months anyway i.e. I dunno how much that flexibility really matters unless you're fully open ended.",
                    "score": 3,
                    "author": "jtrom1010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ay, I'm staying at kaba hostel in a couple of months. Can you give a rundown of the positives and negatives?\n\nWhat was you experience on not purchasing reserved seating on trains? Did you have to stand the entire time or something?\n\nWhat was it about belgium trains that make them garbage? \n\nI'm not easily offended/sensitive/sjw/white knight/etcetcetc so, please, speak your mind about the place and trains.\n\nMuch appreciated!\n\nEdit: if you would be more candid if you DM me, please do!",
            "score": 2,
            "author": "drawingablank111",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Can you give a rundown of the positives and negatives?\n\nAlways remember YMMV, no dorms can be an experience difference both positive and negative. I was also there end of April, so it wasn't peak season yet, and Ghent isn't exactly the solo bustle other cities are.\n\nThat said very nice, very central, very boring and empty. Cool common area but no one around and I didn't really see any kind of organized activity to speak of. Overall pretty clean, breakfast looked good but I missed it every day.\n\nWould go if you like peace and quiet, can't confirm if it's any fun usually.\n\nGhent felt incredibly safe 100% of the time, but you do go through the red light district to get anywhere, so it's a bit seedier, if you care about that. You're a 10 minute walk from the center, ish.\n\n&gt;What was you experience on not purchasing reserved seating on trains? Did you have to stand the entire time or something?\n\nIt *seemed* like it would be rare for trains to be so full you must stand, but it's probably worse in the summer. Also, it can be hard to figure out what's reserved and what's not. The extra $3 for me to know I can sit and not have to keep getting up was plenty worthwhile.\n\n&gt;What was it about belgium trains that make them garbage?\n\nShitty stations, sometimes overly complicated, no wifi (all the others had them so I assumed these would and I was hoping to work), no outlets, just not as nice. I've also heard horror stories about delays but most of those are not actually the train operators' faults.\n\nApparently gummed up schedules because of track suicides are a real thing, and common. In larger cities, heard complaints about no late schedules as well.",
                    "score": 2,
                    "author": "jtrom1010",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks so much!",
                            "score": 1,
                            "author": "drawingablank111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm thinking about doing similar trip in future. Do you have to book everything in advance like train tickets and hostels before entering EU so that you could show your travel \"schedule\" on border control?",
            "score": 1,
            "author": "SYtor"
        },
        {
            "level": 0,
            "comment": "I would skip Belgium, it’s pretty lame compared to other countries in europe. Go to Budapest for a couple nights instead, its so close to Vienna. Budapest and Prague were BY FAR my favorite cities i have ever been to.\n\nIf your looking to party there is no better place than prague. Maybe Spend 5 days in prague and 3 in berlin. Berlin is nice and all, but was devastated in ww2. There isn’t much beauty left unfortunately. \n\nSome others may disagree, but i have been to all of these cities besides paris and this is my experience.",
            "score": 1,
            "author": "Appropriate-Price955",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate the effort, friend, but this is a trip report, not an upcoming itinerary, dunno where the feedback is coming from haha. \n\nFwiw, agree on Belgium but I'm glad I didn't skip. Budapest was another trip, and agree it's an amazing city. I personally loved Berlin and Prague both, for similar **and** very different reasons.",
                    "score": 3,
                    "author": "jtrom1010"
                }
            ]
        }
    ]
}