{
    "id": "13djs20",
    "score": 0,
    "title": "Has anyone here had any miserable experiences with TSA?",
    "author": "Responsible44",
    "date": 1683705187.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13djs20",
    "media_urls": [],
    "other_urls": [],
    "postText": "I haven't been on a plane since I was twelve and When you're that young you're not subject to the same TSA rules as anyone over that age atleast back then it was like. I wonder if they treat you differently traveling Solo and I've had terrible experiences with security guards outside of TSA. I have a fear of getting a pat-down because as a male my balls are sensitive and I feel like it's very invasive. I watched a story about a woman being suspected of drugs and even though she didn't have any they strip searched her and basically cavity searched her since they had her spread her butt cheeks. I know the strip searches are rare and that I can lower my chances of a pat-down but I have enough trauma from my childhood to not want to deal with all that.",
    "comments": [
        {
            "level": 0,
            "comment": "In my hundreds of experiences with them, I can confidently tell you that the TSA has never behaved abusively towards my balls. The kneestrike to the groin that they gave all passengers post 9/11 was a short lived security measure that was ultimately found ineffective at preventing terrorism.",
            "score": 17,
            "author": "elijha",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wouldn't say ineffective. There hasn't been a significant terrorism incident on a U.S. plane since 9/11.",
                    "score": 3,
                    "author": "DrGrillCheesy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There has also been 0 attempts so we don't know if the TSA is actually effective at preventing them.",
                            "score": 4,
                            "author": "McCoovy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tub stackers of America?",
                                    "score": 1,
                                    "author": "SellingRunePickaxe"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "that's why I get all the convenience for use travel, pre-check, global entry, that facial scanning thingy, ever since airport entrees are a breeze.",
            "score": 9,
            "author": "afkfubagels",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did it so that I stopped getting flagged as possible drug mule. Apparently single female travelers often make that list.",
                    "score": 3,
                    "author": "nikki815"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Consider the things you can control and work on those.  Get there with more than enough time to spare so if they want to search you or your bag it won’t impact your flight.  Don’t pack anything you can’t have in your carry on.  Be ready to go through (minimize what needs to be removed to go through).  Pause and ask questions if you need to.  Stay calm and be patient.  \n\nThat said, I’ve never had any issue going through TSA.  Arrive, stand in line, be ready to go through the screening, make eye contact and ask question calmly and politely if you have any.",
            "score": 7,
            "author": "srslyeffedmind"
        },
        {
            "level": 0,
            "comment": "My cat was frisked once... So that was fun. \n\nI paid extra to take my cat on the plane under the seat. So as I went through TSA they decided that I was randomly chosen to get extra screening... The lady put gloves on, and then used two fingers on each hand to frisk my cat",
            "score": 3,
            "author": "supersquirrel33"
        },
        {
            "level": 0,
            "comment": "I travel 10+ times a year, mostly alone, and have never once gotten a pat down. The best thing you can do is follow the rules about liquids and prohibited items. Pat downs are mostly for people who can’t do the X-ray machines for medical reasons",
            "score": 3,
            "author": "Acrobatic-Day-8891"
        },
        {
            "level": 0,
            "comment": "I only fly a couple of times a year, but TSA PreCheck has been worth every penny. \n\nMy home airport is Newark, though, and everyone who works there is super cranky all the time, so I just grit my teeth and do everything possible to get through it quickly.\n\nI always wear slip on shoes, no belt, no underwire bra, keep nothing in my pockets, and go over my carry-on several times before I leave for the airport to make sure nothing in there is forbidden. (I put my Kindle and its charger cord, as well as my phone's charger cord, directly on top of everything, because the few times my carry-on bag has been flagged, those are the reasons why, so they can open it and see them sitting right there. If you don't have PreCheck, you need to remove these things before your bag goes through.)",
            "score": 2,
            "author": "BlackWidow1414"
        },
        {
            "level": 0,
            "comment": "While I can’t actually claim to be latino or middle eastern descent, I certainly look the part so I find that at some airports I get “randomly selected for additional screening” far more than others (looking at you, Denver). It’s probably unfair to outright assume that racial profiling is the cause and not just bad luck but there’s a trend that airports in whiter populations like Denver and Salt Lake City give me a harder time at the TSA than say Chicago or Philadelphia. Although, The worst that happens is the uncomfortable and underpaid TSA agent does a pat down and they take a few minutes to empty my bag. I’ve never had a horrible enough experience to warrant a complaint or miss a flight. \n\nThe funniest incident I had was an agent yanked me aside and said “we got an alarm on your bag so you’ve been randomly selected for additional screening”. I just kinda stood there for a bit because I’d assumed he would grab my bag and lead me over to the back table like usual but then he turned to me and said “which ones your bag?” I’m thinking Umm if you got an alarm on it, wouldn’t you know which one it was or are you just giving me a hard time for some reason? Pat down, bag check, sent me on my way. More annoying than malicious \n\nYou’ll be fine, thousands of people go through TSA every day with no horror stories to tell afterwards. You gotta be really trying to hide something for them to take you to the back room and make you strip down. Your balls are safe",
            "score": 2,
            "author": "LilyAran",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wait one more tip! If you go through the wave scanner and not the classic metal detector, (usually the case. You’ll be able to tell which is which. Wave scanner is a big booth that you enter one at a time and put your hands up in the air while it does a quick scan, then you walk out and wait for the all clear) HIKE YOUR PANTS UP when you’re in the booth. Idk if it’s the button or just the fabric density at the waist band but for some reason if your pants are hanging low, it’ll be more likely to flag the downstairs region and they’ll have to pat down there.",
                    "score": 2,
                    "author": "LilyAran"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The TSA checkpoint employee can flag you for enhanced screening for any (or no) reason, but won't know you are traveling solo.\n\nThe backend security software does have this data, and might increase your chance of getting the dreaded SSSS on your boarding pass and unavoidable \"[enhanced screening](https://thepointsguy.com/news/ssss-on-boarding-pass/#:~:text=The%20enhanced%20screening%20also%20typically%20involves%20a%20full%2Dbody%20pat%2Ddown%2C%20an%20additional%20metal%2Ddetecting%20wand%20wave%20and%20explosive%2Ddetecting%20swabs)\".\n\nJust acting nervous may get you sent to the side.   If you have a true anxiety disorder, talk to your doctor about it, though they're not as quick to write a Xanax prescription these days.   There's anecdotal evidence that *Dramamine® Original Formula* can help with flight anxiety.",
            "score": 2,
            "author": "Kv603",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let’s pump the brakes a little. If you’ve got an anxiety disorder or trauma that’s one thing but everyday people have no reason to be scared of passing through TSA. \n\nEven if you get pulled to the side for any reason which is rare (happens to me on maybe less than 5% of my flights and I take 2-3 dozen a year), the odds of them needing to Pat down uncomfortable spots is a fraction of even that. \n\nUsually the scanner puts up a little yellow box on the area it didn’t get a good picture of like a forearm or chest, they find you an agent that matches your gender, ask you if you’d prefer to go somewhere private, and pat down over your clothes. If you just do it right there by the scanner, whole ordeal is over in like 10-15 seconds on the vast majority of occasions.",
                    "score": 5,
                    "author": "LilyAran"
                },
                {
                    "level": 1,
                    "comment": "the SSSS on boarding pass stopped in 2013. there's still enhanced screening - it's just not revealed on boarding passes anymore.",
                    "score": -2,
                    "author": "savehoward",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is not true. I regularly get SSSS printed on my boarding passes with precheck and global entry when I have international travel. \n\nReason: born in Japan but white and US citizen from birth, also I don't plan travel in huge advance",
                            "score": 3,
                            "author": "Automatic-Banana-631"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have been pulled over by both TSA and British security. Most of the time it was just to search my suitcase. It feels invasive but the best tip is just to be polite and go with the flow. \n\nI've been patted dow by TSA and British security. It definitely is not pleasant but it is quick. I've never heard of strip searches. Most TSA just want to get you out of security ASAP.",
            "score": 1,
            "author": "Tardislass"
        },
        {
            "level": 0,
            "comment": "No",
            "score": 1,
            "author": "drawingablank111"
        }
    ]
}