{
    "id": "13i3721",
    "score": 0,
    "title": "Finding Europe to not be very adventurous.",
    "author": "shoe_bro99",
    "date": 1684142909.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13i3721",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all, I'm currently coming to the end  of a 12 day trip to Iceland, Denmark and Germany and to be honest i'm finding the trip kinda boring. I'm a young 20s male who previously traveled to Colombia (solo), Mexico and Peru (with my GF). Maybe I am romanticizing the past but when I was there, I felt a sense of adventure that I do not feel in Europe. In Colombia, I felt a sense of fear because not only was it my first solo trip but I've also heard Colombia is not very safe. Funny enough, I did get robbed in Colombia but now I look back and laugh at myself for being so stupid and allowing myself to go into a easily avoidable situation. In Mexico and Peru, the culture was also vastly different and I feel the activities there are much more exciting (dune buggies, temples, hiking, interacting with the locals more). Meanwhile here in Europe, in a way I feel too safe. Too safe that I am not getting out of my comfort zone. The public transport is so good that I can find easily find my way around. I feel like I have not been able to find any truly adventurous activities but simply museums and historic buildings. For reference, I have been to Reyjavik, Copenhagen, Berlin and Hamburg. \n\n&amp;#x200B;\n\nAm I simply doing Europe wrong, or do you guys also find Europe to be lacking a sense of adventure?\n\nEdit: for some reason, everyone here thinks I want to get robbed again. No, I just want to get out my comfort zone.",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like you're planning a trip around Europe. Check out solotravel's [detailed guide to planning a solo Eurotrip](https://www.reddit.com/r/solotravel/wiki/eurotrip) for general planning advice plus useful tips and tricks for European travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Western Europe is for drinking beer and looking at castles. If you want to get run over by a scooter driving handbag bandit then you’re in the wrong place.",
            "score": 75,
            "author": "Aerialise"
        },
        {
            "level": 0,
            "comment": "Damn, this is the whole reason I love Europe so much. I love being able to walk outside without fear for my possessions or my life",
            "score": 50,
            "author": "ClassicAd6675",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, but he's young and looking for adrenaline. I can understand there's more people like that, but I personally wouldn't do it either.",
                    "score": 3,
                    "author": "ElectrocutexD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, he just needs therapy if the only thing he finds appealing is the fear of robbed at gunpoint.",
                            "score": 17,
                            "author": "thaisweetheart",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed. I too equated drama with excitement when I was younger. Now I know better",
                                    "score": 5,
                                    "author": "ClassicAd6675"
                                },
                                {
                                    "level": 3,
                                    "comment": "Where did I ever say that? I said I think it’s a funny story to look back on.",
                                    "score": -7,
                                    "author": "shoe_bro99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've been robbed three times while traveling abroad. I've never looked back on them as \"haha\" moments, only as warnings to others on how to avoid what happened to me and avoid the stress of losing your possessions in a foreign country. You might want to check out a therapist after all",
                                            "score": 11,
                                            "author": "FriendlyLawnmower",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea let me be forever afraid of something I can’t change. Might as well never travel again just to make sure I can be sure be 100% safe. I made a dumb mistake and everything turned out just fine. I’m not gonna be a coward about it. Get a grip on life my guy",
                                                    "score": -3,
                                                    "author": "shoe_bro99",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Get a grip on life my guy \n\nSays the guy who relishes in being afraid of potential muggings and complains about efficient public transportation lmao",
                                                            "score": 12,
                                                            "author": "FriendlyLawnmower",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I never said I relish being mugged. I said I relish the sense of adventure and wonder and I find Europe to be to easy. So ether your a troll, hater or just someone afraid of life. Might I suggest you get out of your comfort zone? It will teach you a lot about yourself",
                                                                    "score": 1,
                                                                    "author": "shoe_bro99",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Buddy, I've traveled across Europe, Latin America, Africa, and Asia. I've been out of my comfort zone plenty more than you have. And I've never yearned for more danger in my life or complained about how safe developed countries feel. That's the thing that is making you come off as douche in this thread, that your complaints are \"I can safely walk around at night\" and \"it's hard to get lost using public transportation\" while equally hyping the sense of adventure you get from potential of being a victim of a crime. And despite only having gone to a handful of countries, you want to tell others they should \"get out of their comfort zone\" lol",
                                                                            "score": 10,
                                                                            "author": "FriendlyLawnmower",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I can tell your reading comprehension is low at best. The point of my post is that I feel Western Europe lacks adventure and I wanted to know if I just did my trip wrong. Did I ever ask for more danger? No I asked for a sense of adventure which I have not experienced in Europe compared to other countries.  What is the point of travel if not for the sense of adventure.  Now take a chill pill dude",
                                                                                    "score": 1,
                                                                                    "author": "shoe_bro99",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Iceland, Denmark and Germany are probably three of the safest countries in the world. With all countries you go to you just have to take them for what they are really",
            "score": 29,
            "author": "JRR92"
        },
        {
            "level": 0,
            "comment": "Travelling is not necessarily about risk taking lol. The things you criticize would be very welcomed to a lot of people as your previous experiences wouldn't also. But even the places you've been too you could easily make it \"adventurous\" if you want too. Go out without a phone, stay in a dangerous neighborhood, go out at night alone, put yourself a budget...",
            "score": 17,
            "author": "Swish46"
        },
        {
            "level": 0,
            "comment": "Well, it’s true that Europe can feel a bit boring and too much on the safe side for adventurous travellers, especially the places that you visited because they’re in some of the safest, well organized countries. \nAs someone who lives in a similar country I’m quite happy with that because I don’t need adventure everyday",
            "score": 15,
            "author": "slimfastdieyoung"
        },
        {
            "level": 0,
            "comment": "Well yeah, if your goals for traveling are to be scared, confused, and robbed then maybe you’ve gone to the wrong place. Personally, I’d suggest learning to find enjoyment in travel beyond what you could get from a visit to a haunted house in a bad neighborhood.",
            "score": 142,
            "author": "elijha",
            "replies": [
                {
                    "level": 1,
                    "comment": "based xD",
                    "score": 7,
                    "author": "cebex92"
                },
                {
                    "level": 1,
                    "comment": "Berlin is a good place to get robbed to be fair. Paris too if he's looking for that kind of thing. Maybe Naples if he wants to see Italy...",
                    "score": 10,
                    "author": "XenorVernix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it’s really not",
                            "score": 8,
                            "author": "elijha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe not in the context of comparing with the rest of the world as places in South America and Africa will always come with a higher risk but certainly in Europe. I've travelled extensively around Europe and those are the only three cities where I haven't felt safe in broad daylight. Of course someone else may have a different three so you're welcome to disagree.",
                                    "score": 4,
                                    "author": "XenorVernix"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Berlin is quite safe. You can't compare the scammers, and the petty thieves at Paris or Naples to the gun in your face robbery in South America.",
                            "score": 1,
                            "author": "Cheap_Expression9003"
                        },
                        {
                            "level": 2,
                            "comment": "Tbh Berlin was the only place I've ever been robbed on my travels",
                            "score": 1,
                            "author": "willofleur"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, I understand, and I’m saying that’s a pattern that OP should try to break out of.\n\nIf the adrenaline of being in potential danger is the only thing that brings you pleasure while traveling, you’re missing out on a whole lot of beauty of pleasantness in life. Of course, most people enjoy an adrenaline rush now and then, but if you’re bored by everything else, that’s an unhealthy dependency.\n\nFrankly, it comes across sounding like the same kind of immature, irresponsible approach to travel that gets people like Miles Routledge in over their heads",
                            "score": 20,
                            "author": "elijha"
                        },
                        {
                            "level": 2,
                            "comment": "Well then they should just hang out in Paris, Barcelona, or Prague. You could easily get robbed in those cities. Sounds like this guy wants adrenalin and fear instead of culture and museums. You have to enjoy what a place has to offer or go somewhere else. Maybe art, museums, and drinkable water just aren't for him. Maybe he should try Southeast Asia, Africa, or India, he can get robbed and shit his brains out lol. Now don't get me wrong I've enjoyed all of these places without any negative experiences, OP just sounds whiny that things are too nice boohoo.",
                            "score": 3,
                            "author": "JubalHarshawII"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just get out of the popular cities. And also even shift towards the east of europe if you want less touristy. How did you get robbed btw?",
            "score": 16,
            "author": "Garnservo97"
        },
        {
            "level": 0,
            "comment": "Yeah, you're doing Europe really wrong if your aim is danger and adrenaline. You visited Iceland - a country where careless tourists die to nature regularly enough that people are warned about it - but you stayed in the small, cozy place known for being one of the safest hipster capitals on the surface of the Earth. A quick trip to the nearest tourist agency could've gotten you in touch with people who'd put you on the back of a horse and bring you out into the volcanic glacial sandstorm wastes, where nature is big and you are small.\n\nAdventures exist in safe places, too, because people always thirst for adventure. But they're typically arranged adventures that you need to look for, not adventures that wacks you over the head to steal your purse. Go to the tourist agency and ask the clerk to give you the right brocheurs.",
            "score": 16,
            "author": "DandelionOfDeath"
        },
        {
            "level": 0,
            "comment": "Maybe you should look for specific activities like a cave tour, hiking to peaks, wild water rafting etc. Every country/city offers things like that.",
            "score": 12,
            "author": "JaneyJane23"
        },
        {
            "level": 0,
            "comment": "i dont have any tips for you but i can confidently say i am the absolute complete opposite 😅 i cant enjoy myself until i feel safe and secure and know my way around at least slightly. my adventure is in the comfort of feeling good and confident! but wishing you the best! hopefully you find some more adventure",
            "score": 11,
            "author": "troyemellets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I just like to challenge myself. Being 100% comfortable just doesn’t feel like I’m challenging and get out my comfort zone.",
                    "score": 3,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;The public transport is so good that I can find easily find my way around.\n\nI suggest you to go to Naples and take the Circumvesuviana, it has been elected for the last 3 years the worst train line in Italy.",
            "score": 11,
            "author": "SteO153"
        },
        {
            "level": 0,
            "comment": "&gt;The public transport is so good that I can find easily find my way around.\n\nHow the fuck is that a complaint? The audacity of some people smh",
            "score": 12,
            "author": "FriendlyLawnmower"
        },
        {
            "level": 0,
            "comment": "There's a very, very different culture in northern Europe compared with central and south America, next time try SE Asia for fun.",
            "score": 9,
            "author": "ArticulateAquarium"
        },
        {
            "level": 0,
            "comment": "&gt; Meanwhile here in Europe, in a way I feel too safe.\n\nFeelings have of course little to do with reality, but if you want danger, it can be had.\n\n&gt; Am I simply doing Europe wrong, or do you guys also find Europe to be lacking a sense of adventure?\n\nThere isn't a right way to travel, everybody is different. Though I agree Europe is on the boring side in general, if you seek it out there is plenty of adventure to be had. I guess just my biased opinion, but if you look for adventure, go to Iceland an only visit Reykjavik you've not done your homework and you're doing it wrong.",
            "score": 8,
            "author": "Ninja_bambi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. Reykjavik was simply a layover. I wanted to dedicated more time to Iceland than only 12 days.",
                    "score": 1,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Out of all the countries in Europe you’ve managed to pick 3 that are the complete opposite of the things you like. \n\nIf you want to be scared for your life, get a van ride over the mountains through Bosnia to Serbia with a local. Way scarier than anything I experienced in South America.",
            "score": 7,
            "author": "BradMtW",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; get a van ride over the mountains through Bosnia to Serbia with a local.\n\nI remember that route.. took it about 10 years ago. Scared the shit out of me. Our driver was over-taking vehicles around corners at breakneck speed on a mountain pass.",
                    "score": 3,
                    "author": "Sorenchd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, that sums it up exactly. Not uncommon to try overtake 3 cars and a bus at once like that either. I thought I was legitimately going to die at least a dozen times. \n\nNot to take away from these countries themselves. I love it over there.",
                            "score": 4,
                            "author": "BradMtW"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tell me more lol.",
                    "score": 0,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You must be the only person on the planet to go to Iceland and not find it adventurous. Hire a campervan and do the ring road, you'll find plenty of amazing places to hike or natural sights that you can't find in most other European countries from geothermal zones to volcanoes. If you can't drive then take day tours but you'll be quite limited. Reykjavik is a place to fly into, not a place to stay. You can see everything you need to see there in half a day.",
            "score": 9,
            "author": "XenorVernix",
            "replies": [
                {
                    "level": 1,
                    "comment": "I only stayed in Rey for one day as a layover stop. I plan to come back when I have more time to fully explore.",
                    "score": 2,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My advice if you’re craving adventure is to take a trip to Morocco. If you do things right, you can visit a hash farm, get robbed at knifepoint and be run down by a motorcycle all within 24hrs of arriving. Good luck!",
            "score": 7,
            "author": "beaverhoussen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get robbed at knifepoint?",
                    "score": 0,
                    "author": "pasho-99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My guy needs to have a daughter kidnapped and sent to Albania so he can go on a fun manhunt.\n\nAnyone know of any tour companies that can line this up for him?",
            "score": 8,
            "author": "tio_aved",
            "replies": [
                {
                    "level": 1,
                    "comment": "No. I just want to be challenged. If I wanted to feel in my comfort zone 100% of time why travel? IMO",
                    "score": 2,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe therapy? If you get your joy from fear of things like getting robbed. Or just go on your more dangerous adventures I guess",
            "score": 6,
            "author": "IndependentYoung3027",
            "replies": [
                {
                    "level": 1,
                    "comment": "Clearly you didn’t bother to actually understand my post.",
                    "score": 1,
                    "author": "shoe_bro99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You clearly enjoy getting robbed like you said… I suggest therapy, because that’s not normal.",
                            "score": 1,
                            "author": "yumyuminmytumtummmmm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No I said it was funny as in a funny story looking back on. Sorry I’m not so uptight and scared as you appear to be",
                                    "score": 1,
                                    "author": "shoe_bro99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not but seems like you’re just depressed",
                                            "score": 1,
                                            "author": "yumyuminmytumtummmmm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And desperate for attention",
                                                    "score": 0,
                                                    "author": "yumyuminmytumtummmmm",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And you seem like your a troll",
                                                            "score": 1,
                                                            "author": "shoe_bro99"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reykjavik is the least interesting thing about Iceland. I’m confused as to how you went to a country known for it’s incredible nature and presumably did none of that?",
            "score": 6,
            "author": "greenwoodgh0st",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was simply a layover stop between Copenhagen. I didnt do all of Iceland because I felt 12 days would be to short and do not want to rush when I eventually do have the time to further explore.",
                    "score": 0,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t really know what you expected. If you don’t like feeling so safe (wtf?) don’t go to the safest countries in the region and in the most developed cities.",
            "score": 5,
            "author": "mattgbrt",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I’m asking. I just wanted to know if i am just doing Europe wrong or not. 🙄",
                    "score": 0,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well you are in a “first world country”, arguably THE first world country. And all these Nordic places are even more organised, safe, and comfortable than the south or east of Europe. So yeah, no comparison to South America when it comes to being out of the comfort zone. If you really want to get robbed again try a Balkan state 😅 Or just go to Russia or Ukraine you crazy daredevil 😀\n\nEdit: you can also try the good old “countries comparisons or historical approach”…just go to France and tell them they are pussies and not like the British, mention nazis in Germany, and say in Italy that French food is better..that should ensure you get beaten up real good 👍",
            "score": 11,
            "author": "nomadlaptop",
            "replies": [
                {
                    "level": 1,
                    "comment": "\n\n&gt;countries comparisons or historical approach”…just go to France and tell them they are pussies and not like the British, mention nazis in Germany, and say in Italy that French food is better..that should ensure you get beaten up real good 👍\n\n🤣🤣🤣 Excellent approach if you just want to get beaten up. He could also presumably just go to US and say he supports Russia. Next time in SA, he could tell Brazilians that Argentina is better at football. Go to Saudi and say something against Islam. Go to NK and talk against Kim. So many options for this dude.",
                    "score": 3,
                    "author": "Maleficent_Poet_5496"
                },
                {
                    "level": 1,
                    "comment": "Sounds good.",
                    "score": 2,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, if you're wanting irresponsible stories to tell ppl just get really drunk and stumble around the train stations in Paris, budapest, berlin (hit up the parks) late at night...like around 1am. \n\nIt should get your heart pumping.\n\nYou're welcome.",
            "score": 10,
            "author": "drawingablank111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m looking for the stories that I can look back on and say wow I can’t believe I did that or wow that really happened. Museums and churches in Europe aren’t cutting it for me.",
                    "score": 2,
                    "author": "shoe_bro99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Europe isn't just museums and churches. To answer your question, maybe you have indeed done your trip wrong.",
                            "score": 8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Hmm. Getting robbed? Those kind of things do not always have happy ending.",
                            "score": 0,
                            "author": "ukrut",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok? But mine did. You act like I’m saying I wanna get robbed again.",
                                    "score": 2,
                                    "author": "shoe_bro99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You sound like that but what ever. South America is great and South Africa.",
                                            "score": 2,
                                            "author": "ukrut",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not sure how. I just want a sense of the unknown.",
                                                    "score": 1,
                                                    "author": "shoe_bro99",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You never been those places so they are unknown to you but nice traveling To you",
                                                            "score": 2,
                                                            "author": "ukrut"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Iceland, Denmark and Germany\" are hardly the more adventurous parts of Europe lol. Go to the sourt or to the east.",
            "score": 4,
            "author": "Emma_Rocks"
        },
        {
            "level": 0,
            "comment": "So you’ve been to a few of the most safe, well-ordered and well-off places *on the entire planet* and you wonder why you don’t feel the same level of danger and excitement as in places that are almost the polar opposite in many regards??\n\nGee man I wonder why, call a professor and get science in on this mystery",
            "score": 9,
            "author": "magicbrou",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you professor I know why. You clearly didn’t understand my question.",
                    "score": 0,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Consider the activities you're doing as well.. Try out a via ferrata or some hydrospeeding if you need a thrill. Maybe also leave the big cities.. if you go into the country side in Germany, you'll find plenty of people that won't speak any English and quite a few that really don't care for tourists and/or foreigners. Might be more up your aisle.",
            "score": 3,
            "author": "BerriesAndMe"
        },
        {
            "level": 0,
            "comment": "Try more off the beaten path places…Uzbekistan, Kyrgyzstan, Mongolia…",
            "score": 3,
            "author": "GorgeousUnknown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I really do wanna check these places out. I just feel like I will need several weeks or months in those places not a few days.",
                    "score": 3,
                    "author": "shoe_bro99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True!",
                            "score": 1,
                            "author": "GorgeousUnknown"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This I why I love Europe (most of it at least). I can explore a new place without being overly worried about safety or the possibility of getting extremely lost.",
            "score": 3,
            "author": "Givemethecupcakes"
        },
        {
            "level": 0,
            "comment": "Based on your interests, I think you are doing Europe wrong. There is lots of hiking and activities in Europe. I am from BC, Canada and love hiking. Been to the Banff, Colorado, Yosemite, Zion. The Dolomites area in Northern Italy is up there for some of the best hiking in the World. You can also go mountain biking in many places where there are mountains and on the coast of like Portugal, lots of opportunities to surf. If you stick to a city visiting churches, you aren't enjoying what can be an awesome continent for your interests.\n\nI do agree though that interacting with locals is tougher in Europe. I found in SE Asia like Vietnam or Thailand, it was a lot easier to strike up conversations with locals.",
            "score": 3,
            "author": "PMMeYourCouplets"
        },
        {
            "level": 0,
            "comment": "Yeah check out India, better yet, head to North Korea where you can be served a death sentence for taking a poster! Do you think that will be enough to keep you on your toes?",
            "score": 5,
            "author": "thaisweetheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "You seem like a very bitter person",
                    "score": 1,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At least you’ve experienced it and now know what you look for in adventure.",
            "score": 2,
            "author": "EnglishInToronto14"
        },
        {
            "level": 0,
            "comment": "You should visit eastern Europe",
            "score": 2,
            "author": "johnytestt",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is on my bucket list. Just trying to find a cheap flight.",
                    "score": 2,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Europe expensive overrated but a must so to speak. South east asia should be a blast for you",
            "score": 2,
            "author": "luckyboyjuni"
        },
        {
            "level": 0,
            "comment": "Go to the developing world more often and plan more adventurous activities such as the ones you mentioned in Mexico and Peru. Europe has plenty of good hikes, climbs, via ferratas, etc., as well as archaeological sites. You're obviously not going to find that sense of adventure in a big touristy city, because most people like to be comfortable.",
            "score": 2,
            "author": "schmidty33333"
        },
        {
            "level": 0,
            "comment": "You are in the safest countries in Europe and if you compare it to your latest travels, Colombia and Peru which are among the most dangerous counties in South America, then the difference is huge. I've never been to Iceland or Denmark, but I'm sure you can find some trails to explore If that's the kind of adventure you are looking for. You can look up for southern Italy and Sicily, but it won't get close to Medellin or Cali. \n\nIt's a pitty your expectations were not met. I would like to hear more of your story getting robed in Colombia!\n\nEDIT: curios on how you chose Iceland, Denmark and Germany for your trip",
            "score": 2,
            "author": "ElectrocutexD",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I travel I simply look for the cheapest flight. I found a cheap flight to Copenhagen with a layover in Iceland for a day. Germany because I’m a WW2 buff and wanted to visit some WW2 sites.  I’m Colombia I met a girl and I’m sure you can figure out the rest.",
                    "score": 1,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How are you spending your day? Looking at churches, markets, old town, museums, buildings, monuments...? Are you doing anything besides looking at things? Are you looking at things that have meaning to you or just things that happen to be around?\n\n\nYou need to do adventurous things to have an adventure. Find an activity (sky diving, bungee jumping), travel outside the major cities, find niche famous places like \"flower auction\" or \"Salvador dali hometown\", get out in nature, rent a car and take a road trip, go to a festival (not necessarily music but las fallas or fete des lumières), etc. \n\n\nThe best part about solo travel is that you're in control. If you're not enjoying yourself, just go somewhere else where you can do something else besides look at things.",
            "score": 2,
            "author": "kayday0"
        },
        {
            "level": 0,
            "comment": "Maybe head to the mountains!",
            "score": 2,
            "author": "SmallTownSaturday",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which mountains?",
                    "score": 1,
                    "author": "shoe_bro99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We were just in the alps. But any I guess. Lauterbrunnen had a lot of paragliding.",
                            "score": 2,
                            "author": "SmallTownSaturday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How do go about getting around the alps? Renting a car?",
                                    "score": 1,
                                    "author": "shoe_bro99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've only been in Switzerland but they have great public transport.  Not necessarily cheap but a lot and efficient.  They have passes that can save you money.",
                                            "score": 1,
                                            "author": "SmallTownSaturday"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Plenty of through-hike opportunities if you want to expand your limits and have a real adventure. Get some gear and head into the Scottish highlands. Or there are plenty of other trails in mainland Europe with enough infrastructure that you don't need a tent. \n\nThere are a lot of mountains to get lost in. Maybe you just need to get out of the cities.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Go to Romania or Bulgaria, or something in that realm. You'll find some funky things going on for sure. I sort of agree with you on Western Europe, can be a little bland as far as adventure goes. Although I enjoyed those countries a bit more than you. I also had a crazy encounter in Santa Marta, Colombia! And was totally my fault for wandering into the wrong area after telling a beggar to get bent....",
            "score": 4,
            "author": "Dongusamericanus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Romania is pretty dull too. Bad transportation good be a plus for OP, but doesn't seem that that's what he's looking for. Probably southern Italy or Southern France can get more close to what he wants. Also some parts of Turkey or Istanbul?",
                    "score": 3,
                    "author": "ElectrocutexD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you expand more on those places? I don’t mind having a good public transportation but at the same I do want to feel out of my comfort zone.",
                            "score": 1,
                            "author": "shoe_bro99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you want to feel out of your comfort zone I say India is a real challenge, I went to India and Bangladesh and it’s not the typical tourist style place, it’s dirty, smelly, hot, crowded, but depending on if you head north to the mountains it can be beautiful and south to the beaches of goa aswell. There’s also the Taj Mahal which is a wonderful thing to see",
                                    "score": 1,
                                    "author": "Sara_godsword2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might want to add Japan to the exclusion list if OP is looking for somewhere to get robbed",
                    "score": 8,
                    "author": "alhendo89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, of all continents Europe is without doubt the most comfortable. So yes, if adrenaline is your drug of choice you're going to not get much of a high just by being there and participating in daily life or just touristing it.\n\nRisk in europe is found outside the mainstream only and harder to get into as an outsider",
            "score": 4,
            "author": "Pietes"
        },
        {
            "level": 0,
            "comment": "Hi shoe_bro99, your post will need to be manually approved by a moderator as your account age is less than 48 hours, this is an automated measure to prevent spam. Please be patient and do not message the mods or repost as we will get to the modqueue as soon as we can. Thank you for your understanding!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Yes, Western Europe is very sterile and organized. If you want something different you should go to the East. It's very safe, but more fun. The same applies for significant part of Asia. Safe and chaotic.",
            "score": 1,
            "author": "mathess1"
        },
        {
            "level": 0,
            "comment": "The Baltics.",
            "score": 1,
            "author": "jatawis"
        },
        {
            "level": 0,
            "comment": "What was the easily avoidable situation?",
            "score": 1,
            "author": "brilliancemonk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Meeting a girl.",
                    "score": 1,
                    "author": "shoe_bro99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Basically, go East",
            "score": 1,
            "author": "uncle_sam01"
        },
        {
            "level": 0,
            "comment": "You missed out and by the sounds of it wasted time",
            "score": 1,
            "author": "ihatethesystem01"
        },
        {
            "level": 0,
            "comment": "Reykjavik is the least interesting thing about Iceland. I’m confused as to how you went to a country known for it’s incredible nature and presumably did none of that?",
            "score": 1,
            "author": "greenwoodgh0st"
        },
        {
            "level": 0,
            "comment": "Try more off the beaten path places…Uzbekistan, Kyrgyzstan, Mongolia…",
            "score": 1,
            "author": "GorgeousUnknown"
        },
        {
            "level": 0,
            "comment": "Try more off the beaten path places…Uzbekistan, Kyrgyzstan, Mongolia…",
            "score": 1,
            "author": "GorgeousUnknown"
        },
        {
            "level": 0,
            "comment": "Try more off the beaten path places…Uzbekistan, Kyrgyzstan, Mongolia…",
            "score": 1,
            "author": "GorgeousUnknown"
        },
        {
            "level": 0,
            "comment": "It sounds like you’re more of an adventurous traveler liking a totally different culture and taking on challenges. I would suggest India, Morocco, Laos, Sri Lanka, Vietnam. Japan is not a “developing country” but it’s so different from the West with its culture.",
            "score": 1,
            "author": "Siam-Bill4U"
        },
        {
            "level": 0,
            "comment": "Yes, if you are looking for adventure, you do it totally wrong. If you want adventure similar to South America, go to Eastern Europe. Romania, Moldova, Serbia, Albany ... plenty of poor and less safe countries for you to check out. If you need even more risky &amp; adrenaline pumping, you can up a level and try Belarus or Ukraine.",
            "score": 1,
            "author": "Cheap_Expression9003"
        },
        {
            "level": 0,
            "comment": "Go solo hiking in Romania or the balkans where I got menaced by packs of feral dogs. That got my adrenaline going",
            "score": 1,
            "author": "grindle_exped"
        },
        {
            "level": 0,
            "comment": "12 days is nothing for those 3 countries, so you are just going to be in their samey megacities..so duh.  Do extended stays and go out of the big cities.\n\nYou could have chosen to explore iceland in a campervan.  I spent 6 weeks in germanyvlast year and didn't go anywhere near munich, berlin, hamburg or frankfurt.  You get to choose how to travel.",
            "score": 1,
            "author": "Oftenwrongs"
        },
        {
            "level": 0,
            "comment": "Eastern Europe is what you are looking for.  \nEspecially Southeastern Europe. Our reputation as a region is far from stellar for a reason.",
            "score": 1,
            "author": "The_annonimous_m8"
        },
        {
            "level": 0,
            "comment": "You should try the Balkans. Europe but without that “you can’t fail if you tried” feeling. You can fail. Hard. Especially with transportation. It’s still Europe and safe but you’ll definitely feel out of your element when everything starts being written in Cyrillic and nobody has been able to understand a word you’ve said for days on end. And you’ll eat weird things and end up in weird places that you didn’t know existed",
            "score": 1,
            "author": "HandOfBeltracchi"
        }
    ]
}