{
    "id": "13ielov",
    "score": 178,
    "title": "Trip Report: Ukraine in 2023",
    "author": "Fithboy",
    "date": 1684171983.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13ielov",
    "media_urls": [
        "https://www.reddit.com/r/solotravel/comments/13ielov/trip_report_ukraine_in_2023/"
    ],
    "other_urls": [
        "https://visitukraine.today/",
        "https://u24.gov.ua/)",
        "https://imgur.com/a/5cktEoi),"
    ],
    "postText": "Like I'm sure many of you on this forum I love to plan hypothetical trips when its a slow day at work. Well, a few weeks ago I was looking at things to do in Odesa, a city that's long been on my list to visit. Out of interest I had a look at hotels on booking.com and found that international guests were leaving reviews. This intrigued me, people visiting Ukraine in 2023? I had a look at https://visitukraine.today/ , the tourist board was advertising holidays in Ukraine! To cut a long story short, I soon found myself cycling to Liverpool airport and hopping on a plane to Romania!\n\nNow I should take a moment to say that it would be irresponsible for me to actually reccomend that anyone take a trip to a country that is under active invasion. While the cities in the West of Ukraine are generally safe, you are still putting your life at 1000x more risk than you are in most of the rest of the world. Ukraine will win this war and open up more to tourism in the coming months and years. For this reason I won't go into too much detail on my preparations or how I got in or out, that sort of information is very much available through the above mentioned website if you are interested. If you go, go to enjoy Ukrainian culture and hospitality and to spend money in their economy, be respectful and follow the curfews etc. Do not go to gawp at bombed out buildings or cause a nuisance. \n\n**Odesa**\n\nOdesa is like a postcard picture. Its all tree lined avenues and gingerbread buildings, quite Vienna esque! It's also hot!! The Black Sea creates a microclimate similar to Batumi in Georgia. I spent two days in the city; while museums were closed I had a lovely time ducking into extravogent Orthodox churches and drinking speciality coffee. Ukrainians seem to be really in to coffee - there are stalls on most street corners with full on espresso machines in, none of those Jacob's instant sachets you see elsewhere! On both afternoons I booked tickets to the opera house which was one of the main attractions to Odesa for me. I saw a Chopin ballet, then the Barber Of Seville the next day, both were loads of fun. There was a party atmosphere on Saturday evening, I stopped on Derybasivska St and listened to a folk band as well as watching a big old hare krishna parade! The beach is really nice, white sands with a forrested park right behind, loads of bars and cafes on the seafront.\nI knew I'd enjoy Odesa but it exceeded expectations, really proud to call it our sister city! Big &lt;3 from Liverpool.\n\n**Kyiv** \n\nOn Sunday I got the overnight train to the capital. The train is very modern and pleasant. Kyiv is a massive, grand, thriving city. It feels a lot like Berlin, you have historic tennement buildings with balconies and ornamentations right next to a renovated communist block, right next to a super modern all glass office block. Again, there were artisan coffee shops and trendy restaurants everywhere. While understandably a fair amount of tourist stuff if closed or half closed I enjoyed looking round the many gold-topped cathedrals and the catacombs underneath the Pechersk Lavra monastry. I love just rambling round cities and taking in the feel of things; looking at the imposing buildings on Khreschatyk St, getting lunch down in Podil (gentrified docks district), reading my book in Khreshchatyy Park (genuinely never seen a park like it, its a system of elevated walkways around essentially a cliff face with panoramic views of the Dnipro and Kyiv). The Kyiv metro is really cool too, its super deep and very art deco.\n\n**Conclusion/Photos**\n\nI had a really great 4 days in Ukraine, it's such a beautiful and buzzing place! I'm excited to see more of the country once the war is won.\n\nI had no problems travelling in the country as both a vegetarian and someone who has very poor language skills.\n\nIn no way did I need to go there to be reminded of this, but visiting Ukraine really drove home for me how barbaric and evil this war is. It's inspiring to see the Ukrainian people not only stand up to the terrorist oppressor, but live and laugh. If you can [donate to the defence and humanitarian efforts](https://u24.gov.ua/) then please do. \n\nI'm no photographer, but hopefully [these pics are of interest](https://imgur.com/a/5cktEoi), a fair few of them have captions :).\n\nThanks for reading!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm dating a Ukrainian refugee and she talks about us going to Kyiv in the fall to visit her family, I'm scared at the prospect so you have my respect. \n\nI'm sure the locals appreciated it, injecting money into their country and learning more about their country currently defending itself from an invasion.",
            "score": 52,
            "author": "cdn_backpacker",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's really lovely, I hope you get to visit them one day! Of course the situation will likely be different by the autumn, but feel free to message if you want to chat about what to expect at the moment.\n\nMaybe another option would be to offer to meet them half way, maybe in Poland or even Lviv? Your apprehension to go is completely valid, don't go if you feel it's not right for you. Kyiv will be there long after this war is won.",
                    "score": 19,
                    "author": "Fithboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, so do I!  As worried as I'd be to go, if she was going and wanted me to come, there's no way I'd say no. It'd be a heck of an experience, and I'd be equally uncomfortable with the thought of her there alone (although my underwear will probably stay cleaner if I stay home haha)",
                            "score": 8,
                            "author": "cdn_backpacker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A family friend was going in and out of Ukraine frequently around 2 months ago. I'm not up to speed on the situation over there at the moment (although the many comments in here give insight) but I'd say as long as you're not going out and about a whole lot then you'll be fine (we'll see how the conflict evolves though by the fall).",
                    "score": 6,
                    "author": "Joman_Spatula"
                },
                {
                    "level": 1,
                    "comment": "My girlfriend is also a refugee now, in Canada with me, but up until the last year we all we living in Ukraine, only now did we have to make the move over to Canada.\n\nI'd rather be back in Ukraine to be honest, I'd go on that trip in the fall, life's all about risk, the country is so much safer now than it was Feb.24 with air defense. \n\nYou'll love it.",
                    "score": 2,
                    "author": "Walker----",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks got the encouragement buddy, you're echoing similar statements from my gf.\n\nRegardless of any danger, it seems like an incredible country and I'd love to check it out. Hope you're both enjoying Canada!",
                            "score": 2,
                            "author": "cdn_backpacker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a clichéd statistic, but I think it is one worth remembering: you are far more likely to die by being trampled by a cow in a field than you are to be killed by a terrorist. You’re also more likely to be injured by a toilet than struck by lightning, and you’re more likely to be struck by lightning than attacked by a shark. You have higher odds of being born with eleven fingers or toes than all of the above. (The Art of Exploration by Levison Wood)\n\nThat quote always stuck with me for some reason.\n\nEdit: lol someone didn’t like the Levison Wood quote 😝",
                    "score": 0,
                    "author": "belthazubel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably not applicable here. Risk exists. Even if its fairly small in most areas.",
                            "score": 3,
                            "author": "Objective-Garden-109"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I visited western Ukraine just before the war and loved it. \n\nI personally would not go now, as Kyiv and other western cities are still being bombarded weekly by long-range missiles and drones.  However, I do think it would be a very interesting contrasting experience to my pre-war trip.",
            "score": 47,
            "author": "gosu_link0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not weekly. Daily. Every night multiple times. Anyone who hoes yo Kyiv right now won't get much sleep unfortunately.",
                    "score": 5,
                    "author": "Objective-Garden-109"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your pictures show Odesa is just as beautiful as I had imagined it to be. I had a trip planned to Moldova and Odesa a week after the invasion so unfortunately I had to cancel of course. I loved reading your trip report and can't wait to go myself in the future.",
            "score": 15,
            "author": "kaykayjesp",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's genuinely a stunning city! I had seen pictures but still didn't expect it to be as pretty as it was. One of those places where a 10 minute walk takes half an hour because you end up getting distracted by something interesting at every street corner! I know I'll definitely be back once the war is won!",
                    "score": 3,
                    "author": "Fithboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our former ukrainian guest comes from Odessa. She's now got a job and her own flat in lovely old Bolton. Sadly I don't think Bolton is anyway like Odessa in terms of history/ beauty etc so a bit of a culture shock ! She's been back a few times to visit her elderly parents and had no problems. She talks very fondly of it.",
                            "score": 3,
                            "author": "Every_Piece_5139"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great photos! That Georgian food looks amazing. Bit dangerous though, cycling to Liverpool airport.",
            "score": 5,
            "author": "ArticulateAquarium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha gets back safely from Ukraine, gets mowed down by a BMW on Aigburth road cycling home",
                    "score": 1,
                    "author": "Fithboy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I visited around the beginning of September last year, Odessa and Kyiv in 6 days. Met some people I've stayed in touch with since. Surreal of course, visiting a country at war, but really I was safer there than I've been places in the US. \n\nI'd definitely put Kyiv on my top-5 favorite cities in Europe, and hope to go back before long.",
            "score": 8,
            "author": "AndrewithNumbers"
        },
        {
            "level": 0,
            "comment": "# Slava Ukraini!",
            "score": 44,
            "author": "orca_eater"
        },
        {
            "level": 0,
            "comment": "Beautiful pics!! I think Odessa is too close for comfort for me (not as brave) but I’ve heard Uzhorod and Lviv are stunning and I don’t think Russia has been targeting that area much. Maybe in a year or two once Ukraine has beefed up their air defenses a bit more, I could pay a visit.",
            "score": 4,
            "author": "RainbowCrown71"
        },
        {
            "level": 0,
            "comment": "Damn, thanks a lot for posting, I'm jealous!",
            "score": 2,
            "author": "Plexieglas"
        },
        {
            "level": 0,
            "comment": "This is crazy. I have done almost the exact same thing. Back in August 2022 I also found cheap flight tickets to Romania and took a trip throughout Romania, Moldova and Ukraine. They are really lovely countries, and the landscape throughout them is amazing.",
            "score": 2,
            "author": "squidbattletanks",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you get from Moldova to Ukraine? Transistria should be avoided as I understand?",
                    "score": 2,
                    "author": "Objective-Garden-109",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So Transnistria is not dangerous at all, I encountered no problems upon entry or exit, but you have to make sure to bring enough Moldovan Leu to buy a ticket back as, if I recall correctly, ATM's can't be used with international cards. It is quite an interesting place and I would definitely recommend checking it out.\n\nFrom what I understood there usually is a train going from Chisinau, through Tiraspol in Transnistria, to Odesa in Ukraine, although it is currently not active as the border between Ukraine and Transnistria is closed due to the war and Transnistria being aligned with Russia.\n\nAs for the trip from Moldova to Ukraine, I copied this from my other comment:\n\nI've done almost the same trip but back in August 2022. From Romania you can catch a night train from Bucharest to Chisinau (you can buy a ticket online and pick it up at a train station in Romania), and thereafter a bus from Chisinau to Odesa (I used this website: https://infobus.eu/en, be sure to be there very early for the bus, one bus I was going with left an hour and a half before the stated departure time). The border crossing into and out of Ukraine is not really a problem, actually the Moldovan border guards were more strict both when entering from Ukraine and Romania, they ask for a proof of accommodation and ask for your purpose in Moldova. Throughout Ukraine there are military checkpoints where they will check each passengers passport.\r  \n\r\r\r  \nBe sure to get all necessary documents in order, I recommend proof of accommodation, Covid-19 Vaccination papers, insurance for Ukraine (can be bought very cheap on https://visitukraine.today/). I didn't actually need to show any of these papers except proof of accommodation upon returning to Moldova from Ukraine, but I brought them just to be sure of no problems occurring.",
                            "score": 1,
                            "author": "squidbattletanks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry, I'm a little confused here..you mentioned that the border between Transistria and Ukraine is closed, but that you crossed the border into Transistria? \n\nWould the bus that I could take from Moldova to Odesa avoid Transistria?\n\nThanks",
                                    "score": 1,
                                    "author": "Objective-Garden-109",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was finally able to reply to your comment, I couldn't see it before somehow, but yes the border between Transnistria and Ukraine is closed. I went on a day trip from Chisinau, Moldova to Tiraspol, Transnistria after returning to Moldova from Ukraine. Going to Ukraine from Moldova just involves taking a bus that avoids Transnistria and crosses the border between Moldova and Ukraine in the South-Eastern part of Moldova. If I recall correctly it is the Palanca-Maiaki-Udobnoe border crossing which is passed on the way to Ukraine.",
                                            "score": 2,
                                            "author": "squidbattletanks"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really wanted to try this trip but I decided against it the last sec. Cause I didn't know if I would be turned around at the border",
            "score": 2,
            "author": "Mighty_Moo94"
        },
        {
            "level": 0,
            "comment": "Wow... Thank you for visiting and appreciating my country even during tough times! \n\nI heard there are some touristic programs where the agency is supposed to take care about tourists safety (makes sure there are shelters nearby). I'm quite impressed you went on your own, just the way people live here.",
            "score": 2,
            "author": "Cautious_Radio_163"
        },
        {
            "level": 0,
            "comment": "Where are you off to next, Syria and Sudan? It is pretty irresponsible to travel to an active war zone. Russia has been bombing Ukraine and Kyiv indiscriminately and whilst the west of the country is generally safer than the east right now, you don't know where the bombs are going to drop next.\n\nNow clearly Ukraine will need its tourism back after the war to help the economy recover, and it may well make my list of places to visit as well. But now just isn't the time. You can help their efforts from the safety of your home by donating, as you have suggested in your post.\n\nPlease, no one read this thread thinking \"that's cool, I could do that too\" like this guy did after seeing a hotel review. Ukraine will be a great holiday destination in the future once the war is won so there is no rush.\n\nBear in mind that if you travel to a country where the government advise against all travel then you will invalidate your travel insurance so if you are unlucky and get injured it is going to be a very expensive visit.",
            "score": 30,
            "author": "XenorVernix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol, you do know that people are visiting Syria, right? This person's trip to Ukraine does not affect you in any way yet you feel the need to be super judgy about it. I had a trip planned to Odesa a week after Russia invaded and really enjoyed reading this trip report as I couldn't go (yet) myself.",
                    "score": 33,
                    "author": "kaykayjesp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should read up on the story of Miles Routledge to see what happens when danger tourism goes wrong. No doubt he too was influenced by what he read online.",
                            "score": 4,
                            "author": "XenorVernix"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Saying someone is irresponsible and ‘where are you going next -insert war zone-?’ is pretty judgy imo. We are all adults here (well anyone who can travel anyway). Everyone can decide for themselves where they want to travel to, and everyone has a different risk level they are comfortable with. It is not this person’s job ‘to keep others safe’, when he has no first hand experience of even going there.",
                                    "score": 15,
                                    "author": "kaykayjesp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I love the whole \"if you post something you're asking people to respond\" thing as a response to a response to a response.. I mean the best response to that is to say, well, you were practically asking someone to disagree with that too.\n\nThere's lots of cities less safe than Kyiv right now, that tourists visit every day.",
                                                    "score": 11,
                                                    "author": "AndrewithNumbers"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The OP already said this though: 'Now I should take a moment to say that it would be irresponsible for me to actually recommend that anyone take a trip to a country that is under active invasion.' This person mainly replied so they could judge OP. Comparing this to scamming is ridiculous, as the OP did nothing wrong. Also, I'm not saying not recommending to go to a war zone is judgy. But there is no need for this person to try and shame OP for making that decision for themselves, which does not affect that person in any way. If you don't see it that way, well we can just agree to disagree.",
                                                    "score": 12,
                                                    "author": "kaykayjesp"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hi mate thanks for your comment. While I do believe Ukraine's situation is unique and quite different to the other countries you mentioned, you are of course right, it's not a good idea to travel there just now, and, as I say in my post, I can't in good conscience recommend that people go there. There is a genuine risk to life. I don't think my weeks of research and thinking the trip through both morally and from a safety perspective make for particularly interesting reading, but I guess to summarise, I accept that my selfish curiosity is greater than my regard for my own safety, which is not the most healthy attitude. If I am to defend my decision at all I would just say that there is an awful lot of bad, sensationalist journalism going round that will happily let you think that the entire country is a pile of rubble, and not reflect the reality of life for the tens of millions of Ukrainians who remained or have now returned to the country.",
                    "score": 19,
                    "author": "Fithboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What pushed me over the edge was an Indian guy in my cheap hostel in Chisinau who practically told me I owed it to myself to go. He'd been working in Kyiv before the war and was trying to go back but his work visa was nullified when he left iirc. Assured me I'd be safe and wouldn't have any issue getting in or out, which proved to be true. A few others in the hostel were trying to get in as well, but as an American I had no issues either way. \n\nI was questioned at the entrance to Kyiv as to whether I had a second passport or had ever been to Russia though.",
                            "score": 7,
                            "author": "AndrewithNumbers"
                        },
                        {
                            "level": 2,
                            "comment": "So why did you make the post?",
                            "score": 1,
                            "author": "Objective-Garden-109"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh shut up and keep your self righteous opinions to yourself please! I am from Ukraine. Everyone knows what is on the line if we loose this war so you won’t hear many public complaints (and do not take this to be one) but our prices keep growing and people are making less and less. If tourists want to visit safely and responsibly and inject money into the economy there is no problem with that. After all, we are the ones living with the daily horrors",
                    "score": 41,
                    "author": "topological_quasar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I visited last September and felt a bit awkward about it — like I was party-crashing someone else's funeral — but everyone seemed happy to be remembered, and anyway was intrigued by what kind of crazy American would be coming to Kyiv as a tourist in the middle of a war. Still keep in touch with a couple people I met while I was there. \n\nAside from the checkpoints and occasional (depending on where you are, and I realize it got worse after I left) bombed out building, and caltrops and sandbags everywhere, it really didn't feel so different. Well and the hostels all being empty. \n\nOnly thing keeping me from coming back is life obligations, otherwise I'd be happy to come again.",
                            "score": 8,
                            "author": "AndrewithNumbers"
                        },
                        {
                            "level": 2,
                            "comment": "I think it's irresponsible for tourists to visit the Ukraine while there's an active conflict, but OP can make their own decision.",
                            "score": 4,
                            "author": "saltytradewinds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Given that “THE” Ukraine hasn’t existed since 1991, yes it would be a bad idea to try and visit it",
                                    "score": 1,
                                    "author": "topological_quasar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Removing \"The\" doesn't change anything in my post. Continue to worry about small details if you wish. Thanks for playing!",
                                            "score": 2,
                                            "author": "saltytradewinds",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you were more informed about this war you'd know how big of a deal adding 'the' is to the name of the country.",
                                                    "score": 2,
                                                    "author": "Objective-Garden-109"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not sure if you’re following the developments but the risk is minuscule. Kyiv is safer than somewhere like South Africa or Brazil. Stop being rude to OP",
                    "score": 4,
                    "author": "fisstech15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Certainly following.\n\nhttps://www.bbc.co.uk/news/world-europe-65606385\n\nNot being rude at all. Stop making assumptions - it's rude.",
                            "score": 2,
                            "author": "XenorVernix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No people injured out of 3 million",
                                    "score": 1,
                                    "author": "fisstech15",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Other sources are claiming three people were injured in these attacks. Three out of three million is still three too many. However it's great to see how good Kyiv's missile defences have become. Sooner this shit is over the better.",
                                            "score": 2,
                                            "author": "XenorVernix"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I kind of feel the same.  I really hope that a load of travellers don't see this now and start flocking in. Even though I've been considering going myself because I have some attachment to the country. If I went I'd be volunteering somewhere.",
                    "score": 1,
                    "author": "Objective-Garden-109"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice report, thanks for posting!\n\nI visited those two cities a few years ago and enjoyed them very much... hopefully many more people will be able to do so in the future!",
            "score": 5,
            "author": "lucapal1"
        },
        {
            "level": 0,
            "comment": "This beats what I heard today on a call, a client went to St. Peters berg last year... It could of been before the war but it didn't sound like it. I wouldn't have thought that would have been with easy flights but they are from Scandianvia so maybe a border crossing.\n\nFair play to you. I'd much prefer the risk than ever go to Russia. I look forward today when I'll visit Ukraine and visit friends I've made and help them a little whatever way I can.",
            "score": 5,
            "author": "useibeidjdweiixh"
        },
        {
            "level": 0,
            "comment": "I just got back Lviv a day ago. Beautiful place and fascinating place. I suppose it was the ignorant American in me, but I could have never imagined just how interesting, kind and different the Ukrainian people/culture are.\n\nSlava Ukraini!",
            "score": 2,
            "author": "hucksuck"
        },
        {
            "level": 0,
            "comment": "The guy : girl ratio in Ukraine right now must be off the charts!",
            "score": 2,
            "author": "BeavTek",
            "replies": [
                {
                    "level": 1,
                    "comment": "kek",
                    "score": 0,
                    "author": "Conor_Birkett"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You still want to go there even though there is a war??",
            "score": 1,
            "author": "PassionDelicious5209"
        },
        {
            "level": 0,
            "comment": "Beautiful pics! How was your journey from Romania? I am looking to do a trip like this, but cannot find many ways to do it \"safely\". Thank you.",
            "score": 1,
            "author": "RonisioDicio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done almost the same trip but back in August 2022. From Romania you can catch a night train from Bucharest to Chisinau (you can buy a ticket online and pick it up at a train station in Romania), and thereafter a bus from Chisinau to Odesa (I used this website: [https://infobus.eu/en](https://infobus.eu/en), be sure to be there very early for the bus, one bus I was going with left an hour and a half before the stated departure time). The border crossing into and out of Ukraine is not really a problem, actually the Moldovan border guards were more strict both when entering from Ukraine and Romania, they ask for a proof of accommodation and ask for your purpose in Moldova. Throughout Ukraine there are military checkpoints where they will check each passengers passport.\n\nI'm not sure how the situation is regarding Transnistria but if I recall correctly there usually is a train going from Chisinau, through Tiraspol, to Odesa, but it is not active currently because the border between Transnistria and Ukraine is closed due to the war.\n\nBe sure to get all necessary documents in order, I recommend proof of accommodation, Covid-19 Vaccination papers, insurance for Ukraine (can be bought very cheap on [https://visitukraine.today/](https://visitukraine.today/)). I didn't actually need to show any of these papers except proof of accommodation upon returning to Moldova from Ukraine, but I brought them just to be sure of no problems occurring.",
                    "score": 3,
                    "author": "squidbattletanks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm guessing you're not the sort of person who worries about having travel insurance or fees if you get sick and need to vist a hospital etc?",
            "score": 1,
            "author": "Objective-Garden-109"
        },
        {
            "level": 0,
            "comment": "Hey mate I’d really like to go to Odesa but obviously am scared of the war. How was it there regarding safety?",
            "score": 1,
            "author": "Gman2736"
        }
    ]
}