{
    "id": "13knynl",
    "score": 0,
    "title": "Keeping costs down in portugal",
    "author": "PurposeSudden2049",
    "date": 1684382796.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13knynl",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m looking at accommodation on booking.com for portugal for a week in June and it’s coming to around £800 . This is not even for fancy hotels but just private rooms in hostels in Porto and Lisbon . I’ve done all inclusive in fancy resorts for £500 a week around the same time in turkey so this is quite surprising to me, am i just looking at a really busy time or is this the standard cost of accommodation now?",
    "comments": [
        {
            "level": 0,
            "comment": "If you're looking to find good deals booking.com is not the place to do it. Are you okay with hostels? If so, you might want to check out Hostelworld. Otherwise just shop around on other sites and see if the same (or similar) rooms are available for a better price elsewhere.",
            "score": 4,
            "author": "EdgeJG"
        },
        {
            "level": 0,
            "comment": "I think the fact I’m doing it solo is increasing the cost a lot Wheres before I’ve had another person so it’s halved the cost ?",
            "score": 4,
            "author": "PurposeSudden2049"
        },
        {
            "level": 0,
            "comment": "Heading to Portugal right now. Accommodation is much cheaper if you’re willing to sleep in the dorms at the hostel. Also summer season will be in full swing by June so it’s definitely more expensive. Safe travels!",
            "score": 2,
            "author": "Khashab529"
        },
        {
            "level": 0,
            "comment": "try a workaway maybe",
            "score": 1,
            "author": "abroadineuro"
        },
        {
            "level": 0,
            "comment": "**Note:** Are you asking for travel advice about Portugal? Read what the Solo Travel community had to say in the [weekly destination thread for Portugal](https://www.reddit.com/r/solotravel/comments/10uec2c/weekly_destination_thread_portugal/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Try not going somewhere every other \"digital nomad\" goes",
            "score": 1,
            "author": "mywifesbullbeatsme"
        }
    ]
}