{
    "id": "13kxrnq",
    "score": 126,
    "title": "I'm Biking Across Japan (Part 4): Exploring Fukuoka",
    "author": "Bikingacrossjapan",
    "date": 1684412913.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13kxrnq",
    "media_urls": [],
    "other_urls": [],
    "postText": "\r  \nI have some good news! My leg has healed a lot. After waiting for 10 days, most of the swelling has gone down, and I can now walk without the need for a cane! My doctor has given me the green light to proceed with the biking trip as long as the pain remains manageable.\r  \n\r  \nI've decided to continue pushing forward, but at a slower pace. Instead of covering 50km per day, I've set my sights on a goal of approximately 30km per day.\r  \n\r  \nDuring my journey, I had the opportunity to visit the captivating city of Fukuoka, although my stay there was brief due to falling behind schedule. Nonetheless, I managed to explore some remarkable sites, including the ancient shrine Kushida, which dates back to the year 700, and the awe-inspiring Nanzoin Statue of Buddha, renowned as one of the largest in the world. People from all corners of the globe flock to this shrine, and I took part in the common practice of rubbing the statue's feet for good luck, as many visiting Buddhists do.\r  \n\r  \nTo conclude my trip, I met up with a friend I had made on Hello Talk, a social language learning app. He kindly took me to savor some rich and flavorful ramen! I thoroughly enjoyed my time spent there, and I am excited to continue this trip!",
    "comments": [
        {
            "level": 0,
            "comment": "[Pictures](https://drive.google.com/drive/folders/1flQfK6PiB-wxdcLBTeZMkYDY43LBwpaB?usp=share_link)",
            "score": 10,
            "author": "Bikingacrossjapan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looks clean 👌🏻",
                    "score": 1,
                    "author": "desimemewala"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cheers,glad to hear you have recovered!\n\nFukuoka is a pretty interesting city, quite underated...",
            "score": 3,
            "author": "lucapal1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I enjoyed my time there :)",
                    "score": 2,
                    "author": "Bikingacrossjapan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live down the road from Fukuoka 20 years ago.  Great City!",
            "score": 2,
            "author": "POLDERrider"
        },
        {
            "level": 0,
            "comment": "I was curious to see how your body was going to hold up as I've have similar issues in my past bicycle trips. If you're not doing it already, try to choose a lower gear whenever possible to be spin rather than pushing!",
            "score": 2,
            "author": "ayamflow",
            "replies": [
                {
                    "level": 1,
                    "comment": "My body has gotten used to it now, but I'm also starting to get a bit burnt out. I'm trying to balance video editing with this trip so it can quickly become a handful. \n\nYep! I'm usually in the lowest gear it's a lot easier for long distance.",
                    "score": 2,
                    "author": "Bikingacrossjapan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "glad you can continue! Thank you for the post and pictures. Excited to follow you on your journey",
            "score": 2,
            "author": "driver_picks_music",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I'm excited to continue :)",
                    "score": 1,
                    "author": "Bikingacrossjapan"
                }
            ]
        }
    ]
}