{
    "id": "13mcy59",
    "score": 31,
    "title": "Buying a 40L backpack vs using a north face (personal item) and a roller carry on?",
    "author": "Curryiswhereitsat",
    "date": 1684543004.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13mcy59",
    "media_urls": [],
    "other_urls": [],
    "postText": "First time traveler to Europe/solo. I just booked a flight from NYC to London to start my 2 month trip to Europe, and separate flights to get to NYC then London&gt;Spain. Have basically zero plans otherwise. The JFK&gt;London flight includes a carry on, but the two flights to London and to Spain do not. Do you guys recommend just bringing a 40L back and a daypack, or did you prefer/worth it to bring a normal personal item bag + a roller suitcase? Leaning towards just the 40l for ease, but I plan on taking mostly trains after getting to Europe so the carryon additional fees wouldn't amount to too much more. Thank you for the input!",
    "comments": [
        {
            "level": 0,
            "comment": "as a european (German, Berlin), I am team personal item + carry on roller. Yes, there are cobblestone streets, but you probably won‘t need to walk endless miles with it, as you surely drop it off at your hotel or in a locker anyways.  If you chose backpack, PLEASE take it off in public transport (and shops!) and carry it in you hand, on leg level. These things take of so much space on torso level and smack fellow citizens in the face when turning around - the ones sitting or smaller than you -  you won‘t even really notice (and you will be very sorry &amp; embarrassed when you do).  Backpackers don’t seem to realize how much space they take up. Esp when everyone is standing tight, absolute no go to keep it on your back. Put it on the floor like a suitcase for the benefit and safety of the people around you. It also will save space, since the leg level has more space then torso height",
            "score": 36,
            "author": "driver_picks_music",
            "replies": [
                {
                    "level": 1,
                    "comment": "(q)(and you will be very sorry &amp; embarrassed when you do)(/q)\n\nThis happened to me on my last trip and you're absolutely right. I'm honestly considering going back to a carry on roller now as I really didn't love the pack as much as I thought I would and found it kind of obnoxious actually.",
                    "score": 2,
                    "author": "pascucci91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would you still recommend that for 3 week trip to the Balkans, moving out every three-four days in that area to catch buses for transit?",
                            "score": 1,
                            "author": "Aeqnalis"
                        },
                        {
                            "level": 2,
                            "comment": "I actually feel the same. started out with backpacks, moved to carryons/ suitcases.",
                            "score": 1,
                            "author": "driver_picks_music"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can afford a good backpack I recommend it. A lot of places in Europe have cobblestone streets that are not super convenient to have a roller in. It is also nice to have your hands completely free.",
            "score": 61,
            "author": "thaisweetheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cobblestone thing is real!! Even the sidewalks will be very uneven",
                    "score": 10,
                    "author": "Likelukelikefather"
                },
                {
                    "level": 1,
                    "comment": "Yeah but you just have to drop off the rolly bag to the hotel. If they can hold it, leave it there till your check in. Put only clothes and toiletries in that, so if shit happens nothing important is gone.",
                    "score": 1,
                    "author": "VongolaDWF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was a backpack person at first but now I prefer the roller carry on/ personal item bag.  Just felt more convenient for me since I didn’t really like lugging a heavy bag around anymore. If you’re moving around place to place constantly bag might be a little more convenient but if you’re gonna stay in one spot for a few days than go to the next spot I think the carry on is a better option.",
            "score": 48,
            "author": "spideyv91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah even then, I tried the one bag thing in Europe and moved around alot. Packing and unpacking that was so tedious. Been a backpack, carry on, and a (high quality and empty) drawsting bag/or like the ultralight osprey foldable backpack kind of person since. \n\nOnly time to do heavy backpacks is if you go camping or long hike I guess. Where you need to carry a tent. (Personally haven't been camping before but is imagine this was the (one of) the only real time to go backpack only. \n\n\n\nCarry on luggage: Clothes, shoes (enough for 2 weeks no laundry and still have some space). Toiletries. (Leave in hotel)\n\nBacpack: Tech, Chargers, miscellaneous stuff you might need. (Since it's not stuffed to the brim, it's easier to find shit you need when you are on the road). (If you get to the hotel early you can leave your luggage, and keep this bag with you and the important stuff with you - this should not be too uncomfortable since only laptop and some smaller things should be in it. After check in you can leave this in the room and bring the Drawstring bag with you instead)\n\nDrawstring bag: bring it with me on the day, water and snacks + anything else you need. (I carry this empty or with a tissue box from the hotel and then fill it with a water bottle and some snacks for the day/more. Drawstring hurts when I carry heavier content, I am looking at the osprey foldable bag to use instead since it has classic wider straps)\n\nFanny/Sling: Passport, wallet. Sunscreen, portable charger you can put in this bag or Drawstring bag.",
                    "score": 3,
                    "author": "VongolaDWF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get the 40L and use your personal item. I’ve been doing this for years and have never regretted it.",
            "score": 8,
            "author": "ghostedgoats"
        },
        {
            "level": 0,
            "comment": "i preferred the roller unless you want to carry 20lbs on your back everywhere. it's also more secured.",
            "score": 16,
            "author": "PizzaCatRun"
        },
        {
            "level": 0,
            "comment": "I recently purchased a 73L wheeled duffel that you can wear as a backpack if need be. It served me great for 2 weeks in Cambodia (just finished up there). There was a lot of space in my bag and I could definitely see myself packing pretty much the same amount for 2 months in Europe if travelling in the summer months.\n\nI’ve done Europe a few times and have found that as long as the bag is good quality and you’re careful, a wheeled bag is not a problem on the cobble stones. Have travelled for 3 months in eastern and western Europe by train, bus and plane with a 94L wheeled duffle with no issue. ONCE in Edinburgh I had a hell of a lot of stairs to climb up with the bag but I switched to duffle and it was fine. A bit of a workout but it was only 5 mins and still overall felt the wheeled duffel was the better call over the backpack.\n\nI like the versatility of the 3-in-1 wheeled duffel backpack because it’s easy enough to carry the bag upstairs as a duffel which means I can keep my day pack on my back.\n\nThe times where I’ve committed to a backpack-only style bag I’ve regretted it because it always seemed I was carrying all this weight on my back for no reason. The option of wheels is always a life saver. However, I usually stay in hostels and don’t really ‘rough’ it or do long hikes or camping so it depends on your travel style.",
            "score": 7,
            "author": "OkWorking7",
            "replies": [
                {
                    "level": 1,
                    "comment": "If OP is taking Ryanair or EasyJet, the 94L will most likely need to be checked in. They’ve been a bit strict with anything over 40L even with priority",
                    "score": 3,
                    "author": "gelato234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was recommending the 73L, I just used the 94L as an example of how big I went without feeling inconvenienced to help give OP a better idea overall. \n\nI never fly those airlines but I always just do checked baggage anyway. I did carry on only once when I was travelling through USA and never again! It was way too much effort and stress trying to make sure I didn’t go over on weight/packed small enough liquids etc (between facial cleanser, moisturiser, shampoo &amp; conditioner, toothpaste, body wash, sunscreen etc etc it adds up fast). But that’s just my personal preference/experience and I know there are die hard “carry on only” travellers.",
                            "score": 2,
                            "author": "OkWorking7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get the larger backpack.  You don't want a roller, between cobblestones and stairs.",
            "score": 23,
            "author": "redrosebeetle"
        },
        {
            "level": 0,
            "comment": "Personally I always opt for a 40L backpack with a small day bag. Means I never have to check any luggage, and I don’t have to try and negotiate sketchy city streets with a suitcase",
            "score": 6,
            "author": "spicytravelzoe"
        },
        {
            "level": 0,
            "comment": "A 40l rolling suitcase and small normal backpack is the best combination in my opinion.\n\nThere will be a lot more moments when you’ll wish you had wheels, compared to moments when you’ll wish you had shoulder straps. A good middle ground might be getting a rolling suitcase which you can attach shoulder straps too.",
            "score": 5,
            "author": "The-Smelliest-Cat"
        },
        {
            "level": 0,
            "comment": "I’m taking my Osprey farpoint 40L to Europe next month :)",
            "score": 4,
            "author": "Basic_Helicopter2045",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm doing it now and it works fine. Also fit a smaller daypack inside",
                    "score": 1,
                    "author": "mile-high-guy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Snap. I might find a small Nike to also chuck in. How you finding Europe atm?",
                            "score": 1,
                            "author": "Basic_Helicopter2045",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's pretty cool, a little expensive. I've spent a month between Portugal and Spain, and I really need to see the next country, but I have to wait to meet a friend here. It really helps to know Spanish, but not required.\n\nIt's hard to eat well, I'm getting a little fat.\n\nThe daypack had been very important to have! It would be awful to lug around everything all the time. I have been taking buses between cities, it's the cheapest.\n\nThe osprey 40L fits my daypack in the laptop sleeve, or mounted outside. it also fits my hiking boots along with all my other stuff",
                                    "score": 2,
                                    "author": "mile-high-guy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha glad you are having a good time. Yea I’m not too keen on the getting fat part but I guess I’m there to let loose and have a good time. Safe travels bro!",
                                            "score": 1,
                                            "author": "Basic_Helicopter2045"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Roller bag all the way. Lugging your bag on your back can be exhausting, especially hoofing around Europe. Plus all the bulk on your back gets annoying in crowded places. \n\nRegardless of the bag you use, the key is to not overpack. You’ll still have to carry your bag up stairs, regardless of shape.",
            "score": 3,
            "author": "werdygerdy"
        },
        {
            "level": 0,
            "comment": "A solid team backpack after taking my 37 liter favorite pack to England, Peru, Spain, Portugal, California, and the bottom of the Grand Canyon.  Your stuff is on your  back, so you do need to pack light, but if you can limit yourself to what you can comfortably carry there is a real freedom to just grabbing your pack and going.",
            "score": 3,
            "author": "Carp_"
        },
        {
            "level": 0,
            "comment": "I’m just returning from a 2 week euro trip visiting 3 countries. I brought a 40L backpack and a sling bag for a day bag. This will probably be my last euro trip with the backpack. Travel days are too rough on the body with it now. \n\nHonestly you can’t go wrong with either one, as long as you pack light.",
            "score": 3,
            "author": "Mighty_quin_005"
        },
        {
            "level": 0,
            "comment": "I am old enough to remember the days when there were suitcases that did not have wheels.  Roller carry-ons are huge modern advantage.\n\nSo yes, I would choose a roller carry-on.  If my travel companion is watching my stuff then she doesn’t have to lug it and strain her back.\n\nCobblestone roads are drastically short compared to the modern pavement and asphalt roads that we cover.  If the noise over cobblestone is really a problem then I could opt for a carry-on with rollerblade wheels.\n\nIf I had to do a backpack then it would not exceed 35L.  I rather do laundry often than carry more.  I already reduced most of my electronics over the years.",
            "score": 3,
            "author": "realmozzarella22"
        },
        {
            "level": 0,
            "comment": "Roller bags are terrible on cobblestones and on staircases and in crowded areas, all of which you'll encounter regularly in Europe. I use a single 36L pack (Gregory Deva) and a cross-body purse, and I can easily travel for months with that setup.",
            "score": 6,
            "author": "segacs2"
        },
        {
            "level": 0,
            "comment": "For a euro trip I’m definitely team backpack. Sometimes I get annoyed and feel like a pack mule but the second I’m facing a room a few flights with no elevator up or a cobblestone street(s), I have zero backpack regrets. I use a 40L and hoping I can downsize in time. I’ve come a long way from my overpacking days though! \n\n\nI have a small pacsafe backpack I bring as my day bag. It’s a little bulky to pack but it’s fine enough for me. The locking zippers make me annoyed to use it when it’s conveniently placed for me to open which makes me feel better about not constantly paying attention to it in crowds. If I have the room in my big bag I’ll prepack it with my airplane stuff and stick it in the top. If I don’t have room, I pack it flat and put my airplane stuff in a plastic bag in the top of my back bag and move them into the pacsafe when I get to the gate to keep with me on the plane.",
            "score": 9,
            "author": "tams420"
        },
        {
            "level": 0,
            "comment": "Another vote for the 40L.  The one I got from REI is on sale right now, can’t recommend it enough: REI Co-op Trail 40 Pack",
            "score": 5,
            "author": "JetsetVignette"
        },
        {
            "level": 0,
            "comment": "Osprey farpoint 55L (new updated version)\n\nDaypack zips off so you have a 15L and a 40L.\n\nIf you take the daypack off and zip up the 40L's straps, it fits in the overhead.\n\nhttps://youtu.be/I7j8UqOc46k",
            "score": 4,
            "author": "drawingablank111"
        },
        {
            "level": 0,
            "comment": "I prefer single backpacks for everything, makes navigating a new city easier, and your appearance doesn't scream \"tourist\", which can be advantageous when arriving in places you've never been with scammers on every corner.",
            "score": 11,
            "author": "godless-life",
            "replies": [
                {
                    "level": 1,
                    "comment": "How many locals walk around carrying a massive backpack full to the brim? It certainly does scream tourist to me.",
                    "score": 17,
                    "author": "XenorVernix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot more than residents who wheel around luggage. You’ll look like a tourist regardless, because you are!",
                            "score": 2,
                            "author": "TimelyBrief"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For two months I'd want a checked in roller case. Unless you want to do laundry every few days. I'd also take my 36L backpack as hand luggage, which will be my day pack. I opt for the larger day pack so I have space for layers on a hike, but if you aren't hiking a smaller day pack is fine.",
            "score": 2,
            "author": "XenorVernix"
        },
        {
            "level": 0,
            "comment": " Just a backpack, you don’t want to be dragging a roller bag around Europe for 2 months especially with all the cobblestone streets. I have a 40L Deuter Futura 32 backpack and a regular backpack, it’s so much easier to get around especially in airports and crowded streets.",
            "score": 2,
            "author": "Mmystic480"
        },
        {
            "level": 0,
            "comment": "I'm at the end of a 2 month trip (2 countries, 8 cities). I carried a 46L backpack and a small tote as a personal item. The backpack converted to a bag that can easily be checked, though it does fit in the overhead as a carryon. I did not regret this choice. If you can handle the weight of the pack, and especially if you'll be moving city to city rather than an extended stay in one place, I recommend the backpack.",
            "score": 2,
            "author": "WingingIt0215"
        },
        {
            "level": 0,
            "comment": "I have the Osprey Farpoint 40, it’s great.",
            "score": 4,
            "author": "leorapture"
        },
        {
            "level": 0,
            "comment": "Are you going to be traveling luxuriously, like with many taxis and valet services? If not, get the backpack with the lumbar strap (osprey was my first real backpack and still use it to travel). Do you want to be a backpacker or a vacationer? There is a reason it is called backpacking lol.",
            "score": 4,
            "author": "cutefuzzythings",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or there’s the in between: traveler. I don’t think there’s anything wrong with being a traveler and allowing yourself a luxury every now and then. It’s still backpacking in the sense that you’re moving from one place to the next in short periods of time",
                    "score": 2,
                    "author": "gelato234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally I’d go with the backpack\n\nRoller suitcases aren’t very practical for moving about with, and if the flight is busy they’ll be the first to be taken off passengers at the gate and put under the plane (I’ve seen this with easyJet and Ryanair)",
            "score": 2,
            "author": "mij8907"
        },
        {
            "level": 0,
            "comment": "Pros of a backpack:\n\nYou get to have your hands free\nIt can be more convenient to take things out of your backpack\nIt doesn’t scream that you’re a tourist as much\n\nCons of backpack:\n\nCan kill your back\nCan be difficult to lug around everywhere (I’ve found difficulty with this on city busses and small cafes since they are so awkward in size)\nCan be expensive\n\nPros of suitcase:\n\nGet to save your back\nCan be more convenient in some ways\n\nCons of suitcase:\n\nCan be awful to lug around in cobblestone and dirt roads and paths\nCan be difficult to lug up stairs in narrow European hostels and hotels\nIf a wheel breaks, which happens with cobblestone, you’re screwed\nYou have a hand occupied because of the suitcase",
            "score": 1,
            "author": "ichawks1"
        },
        {
            "level": 0,
            "comment": "Patagonia MLC is the way.",
            "score": 1,
            "author": "shawnwar4586"
        },
        {
            "level": 0,
            "comment": "I would recommend it! I did a month in a 35 L backpack, that included work and personal travel from Vegas to Salt Lake City, to Portland to Seattle. My point is that they’re very different climates and my professional and personal travel clothing differs a pretty good amount, and I made it work. The difference between 1 month and 2 is the amount of times you do laundry, usually.",
            "score": 1,
            "author": "Infamous_Committee17"
        },
        {
            "level": 0,
            "comment": "Good quality roller suitcases actually do fine on European cobblestones in my experience, though they are noisy. The two wheeled ones are generally more robust than the four wheelers. I recently needed to replace the wheels on my suitcase after 9 years of hard use, so they can last well (and it was Qantas baggage handlers that damaged the wheels)",
            "score": 1,
            "author": "Appropriate_Volume"
        },
        {
            "level": 0,
            "comment": "Benefit of backpack: hands free, squishy, makes a seat/pillow, you can hang things off the outside with calipers, lots of pockets, more identifiable, lighter.\n\nSuitcases are nicer for packing/unloading, they keep the contents more secure/ less creased, but the wheels sometimes take up space and they're more awkward if you're moving around a lot.\n\nIt depends on your trip and what you're doing, but if you'll be taking a lot of public transport I'd go for the backpack + a small crossover body bag or combat trousers for your essentials.",
            "score": 1,
            "author": "Jennynumpkins"
        },
        {
            "level": 0,
            "comment": "Personally I recommend the backpack route, the only time a roller is better is if your body can’t handle carrying a semi heavy backpack all day. Especially in Europe with the old cobble stone roads and potentially very long flight of stairs on hostels and hotels/Airbnb’s, a backpack is much better (coming from someone who’s visited 28 countries, I’ve only used a roller twice). If you do choose a roller, get one with nice wheels, I bought the old generation Osprey ozone 42L roller and the large wheels work great on old cobble stone. And for backpacks, Osprey, AER, peak design and mystery ranch are all pretty popular brands that offer great travel packs (I’m personally a huge fan of Osprey, almost all my bags are from them)",
            "score": 1,
            "author": "pizzaloiver54"
        },
        {
            "level": 0,
            "comment": "On a euro trip and took a 38l backpack and a personal item, used a personal as my dayback as well and held my toiletries for security. The backpack for me gets pretty heavy and can also be a pain taking on and off though mine is fully filled up so the personal item is nice too in that regard",
            "score": 1,
            "author": "6godblockboi"
        },
        {
            "level": 0,
            "comment": "Genuinely a ‘either/or’ person depending on how much time I’m spending in a place or what I’m doing. If it’s lots of cities with more than a couple days in each I’m rollers and if it’s more rural or there’s lots of walking to/from it’s a backpack \n\nAs a note it’s best to check the dimensions on a carry on for your flights without checked - different carriers allow different dimensions/weights and you can easily fall afoul of it! \n\nCould be a pretty expensive mistake",
            "score": 1,
            "author": "Agirlnamedheath"
        },
        {
            "level": 0,
            "comment": "A roller bag is ideal if you have enough arm strength to carry it over the really rocky roads. Samsonite roller bags have excellent wheels and hold up well on the cobblestone roads.",
            "score": 1,
            "author": "ConfusionOrnery6985"
        },
        {
            "level": 0,
            "comment": "The Cotopaxi 42L has been amazing for my travels. I highly recommend looking into it.",
            "score": 1,
            "author": "Cmaclsu"
        },
        {
            "level": 0,
            "comment": "I’m currently on month 3 of my backpacking trip in Europe. There’s pros and cons to both. I have both a backpack and a roller carry on. The roads in almost all parts of Europe are not meant for luggage and there’s very few elevators or escalators which does make a roller luggage a bit more difficult. The backpack however hurts my shoulders and back and wears me down quicker than a roller luggage.",
            "score": 1,
            "author": "gelato234"
        },
        {
            "level": 0,
            "comment": "I'm team backpack. Look at the /r/onebag subreddit and try not to overpack. You can buy stuff later if you forgot about something, you will probably also enjoying buying one or two things in your trip, at least. I've been traveling by train and I think backpacks are the best if they're not too heavy. I carry one 40L backpack and a small handbag to go around the city and leave the backpack at the hotel. In the handbag I carry the tickets, water, one snack, etc. so I don't have to unload the backpack each time. Sometimes also bring a reusable textile bag for food, which mostly fits on the 40L backpack.\n\nIn a lot of places there can be a lot of stairs (e.g. metro in Paris) or cobblestone. If you're arriving somewhat late or early to a place, you might feel awful about the noise the suitcase causes and carry it anyway in your hand. It's better to carry the weight distributed in your hips/ back.",
            "score": 1,
            "author": "CamBG"
        },
        {
            "level": 0,
            "comment": "I have had [one of these](https://www.patagonia.com/product/black-hole-duffel-bag-40-liters/49338.html?cgid=root) for 17 years. It has literally been all over the world. Carry-on, checked and no signs of degradation or wear. It is a *workhorse* and you will be glad you went backpack in Europe (stairs, cobblestone, etc.)\n\nI did my euro trip last year. I swore that I’d never take a roller anywhere ever again. My buddy that traveled the world all last summer did a double backpack combo. Don’t take a roller you will regret it.",
            "score": 1,
            "author": "TimelyBrief"
        },
        {
            "level": 0,
            "comment": "Suitcase",
            "score": 1,
            "author": "One-Awareness-5818"
        },
        {
            "level": 0,
            "comment": "Having done both, I much prefer the daypack/roller carry on with good wheels. Also, some airlines have a max per item weight for carry-on. Lufthansa for example is 8kg/17lbs per carry-on item.",
            "score": 1,
            "author": "remoterockstar"
        },
        {
            "level": 0,
            "comment": "Samsonite has a 55l travel backpack.\nThat’s my choice",
            "score": 1,
            "author": "GreenEuroDev"
        },
        {
            "level": 0,
            "comment": "If you go with a roll-aboard suitcase, get a Luggage Works. They’re the brand used by most airline pilots. They’re totally rebuildable, and they use rollerblade wheels, which will hold up just fine on cobblestone.\n\nhttps://luggageworks.com",
            "score": 1,
            "author": "Cessnateur"
        },
        {
            "level": 0,
            "comment": "I did backpack for my first time in Europe and I'm currently in Italy with a roller carry on and I much prefer the carry on suitcase. Carrying my bag was a lot heavier and more difficult than I expected.  I have a suitcase with me as well now and even that is annoying to carry once it's loaded up.  I'm also a 5’ tall female though, so maybe you won't find it heavy and annoying as I did.",
            "score": 1,
            "author": "TinyTeaLover"
        },
        {
            "level": 0,
            "comment": "I’m currently two weeks into two months around Europe with a 68L pack with 16kg of luggage. If I could do my packing again I would try and fit everything into a single carry on. \n\nReason is that internal transport, especially flights, are dirt cheap if you only have carry in luggage as low as £30. As soon as I add my check in luggage it’s jumping to £150. \n\nSecondly, I’ve been wearing the same clothes the entire time anyway and have had no need for a second pair of jeans etc.",
            "score": 1,
            "author": "kempeasoup"
        },
        {
            "level": 0,
            "comment": "I HEAVILY recommend using a backpack over the roller.",
            "score": 1,
            "author": "ivanwarrior"
        },
        {
            "level": 0,
            "comment": "40L backpack every time for me",
            "score": 1,
            "author": "Negative_Excitement"
        },
        {
            "level": 0,
            "comment": "My last three month backpacking trip I went with only a schoolbag, something like 20~30L. The tinyness was magical. So freaking convenient and I still had like a weeks worth of clothes between laundry days.",
            "score": 1,
            "author": "SafetyNoodle"
        },
        {
            "level": 0,
            "comment": "I have backpack and roller,  i choose wich bag to take depending on the trip, traditional European trip where you be visiting cities i take the roller",
            "score": 1,
            "author": "P-a-k-o"
        },
        {
            "level": 0,
            "comment": "Back pack it. Rollers are lame",
            "score": 1,
            "author": "acethecreatorOF"
        },
        {
            "level": 0,
            "comment": "If I can bring a roll aboard I always pick that. I did two weeks in London and Paris and travelled with an Away roll aboard and my Far Point 40 as my personal item. I’ve been all over Europe with my Away and I prefer that and a normal backpack. Even if you have some cobble stone street moments you can roll the bag the majority of the way and to me that’s a huge help! I also did a nearly three week trip all over Italy taking trains, ferries, smaller boats and planes in country and I was glad to have my roller. Keeping a full 40L on my back in hot weather is not so appealing.",
            "score": 1,
            "author": "AmyStenny"
        },
        {
            "level": 0,
            "comment": "When are you leaving? I'm in the same boat! First time traveling to Europe and I'm starting in London. Going for 2-3 months. Landing on June 14th.\n\nI bought myself a 40L backpack. I plan on only using that as my carry on and bringing a personal item.",
            "score": 1,
            "author": "the__mastodon"
        },
        {
            "level": 0,
            "comment": "I'm in NYC also and what I always did was just use a backpack with a zip off daypack. I must have 5 different ones.\n\nUsually I use an mei voyageur with zip off daypack.\n\nYou can also use one of those little things ones that pack away to the size of a golfball.",
            "score": 1,
            "author": "HaChayalBoded"
        },
        {
            "level": 0,
            "comment": "I like the backpack, but the key is to not overload it. A lot of airlines have 8kg (17.6lb limit) or even 7kg (15.4lb) limit for budget or regional airlines, so that should hopefully keep the weight low, even though in my experience they often aren't weighed. And obviously it depends on your specific situation how practical or comfortable this would be for you. Some people, like me, carrying 8kg isn't an issue, but for others it will be (no judgement or anything - we all have different situations and thoughts in our life). So keep that in mind when you read reviews pushing one way or the other. If you don't think it'll be comfortable for you to carry a heavy backpack for an extended period of time, then it might not be worth considering even if there are 100 other reasons you would want to.\n\nAlso re-reading your question, I think a lot of places would consider the 40L pack a carry on. It kind of sounds like your question is only calling the roller a carry on and the bag as a way around the extra fees associated, but I think a bag the size of 40L will often be viewed as a carry on and charged as such, even if you don't have another bag. Though this can vary place to place.",
            "score": 1,
            "author": "GreatNorthWater"
        },
        {
            "level": 0,
            "comment": "No to the roller bag.",
            "score": -2,
            "author": "GiveMeThePoints"
        }
    ]
}