{
    "id": "13njwiv",
    "score": 1,
    "title": "South America itinerary help",
    "author": "jeremyhendler",
    "date": 1684646725.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13njwiv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey there everybody! I’m coming up on a 2 week trip to South America in July and im looking for some help with my plans. I have all of my locations sorted out, it’s more of activities, food, accommodations, and tours im looking for help with. \n\nJust to help with knowing what Im interested in. My favorite things are: Nature/Animals, Food, and culture. I love being outdoors compared to just spending time in museums. \n\nSo here are the locations and time spent for my trip. \n\nLima Peru  (4 nights)\nCali Colombia  (3 nights family)\nAmazon jungle trip in Brazil (5 night)\nBogota (2 nights)\n\n\nSo basically Lima and Bogota are going to be my most free times to explore. \n\nCali I will be visiting and staying with family so I’ll be doing whatever they want to do basically. \n\nAmazon is a guided tour so I’m all set there. \n\nMy biggest interest in Peru is a day trip to Paracas/Huacachina. Do you think this is worth it? Should I spend a night instead of a day trip? Any better ideas? \n\nI’ve been to Bogota before but not exploring the city. I’ve visited the Salt Cathedral and Zipoquira. Do you have any must do things for me in Bogota? Monserrate is the most interesting thing to me currently. \n\nThank you so much for any recommendations!",
    "comments": [
        {
            "level": 0,
            "comment": "First, it’s interesting that your top priority is nature and animals but you’re spending most of your trip in large cities… I personally liked Lima but most people view it as more of a stopover on their way to other locations in Peru. Considering that you’re also going to Cali and Bogota, I think you’d be better off planning to spend at least one of those nights somewhere in the countryside.",
            "score": 2,
            "author": "henicorina",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well the top destination on this trip is the Amazon for me!\n\nI am going to Cali because I have family that I’m visiting there. \n\nMy original trip was Cartagena, Cali, Amazon. I switched to Lima because I talked myself out of Cartagena and thought it would be cool to experience another country a bit. Unfortunately with the short time I don’t think I’ll be able to venture out much into other areas. That’s why the trip to Huacachina/Paracas interests me a lot because it can be done as a day or 1 night trip. \n\nAlso I’m just going to have a little time in Bogota because it’s where I can fly to after the Amazon where I have a good flight back home. It’s not like Bogota was a desirable destination for me haha.",
                    "score": 1,
                    "author": "jeremyhendler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what I mean, the Amazon part is the highlight of your trip but this itinerary has you spending twice as much time in large cities as in the jungle. \n\nDefinitely do an overnight trip south along the coast of Peru since you have so much time. The beaches near Paracas are a really beautiful/weird environment, feels very remote.\n\nFrom Bogota you could go out into the coffee growing region which is the exact opposite of Paracas, super lush green hills.",
                            "score": 2,
                            "author": "henicorina"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lima is cool definitely get outside Miraflores tho and it's cool but if u just stay there it gets boring after a day. There's a cool Pyramid in lima right next to some super modern buildings it's an intresting mix. I'm in the Amazon rn in Puerto Maldonado and it's very cheap and tons of great wildlife viewing so far. The gold museum in bogota is sick to but I know u said u don't like museum. Other than that to be honest if I only had 2 weeks I'd just stick to one country instead of 3 I'm in peru for 31 days and even with that I feel like I havnt even done 25 percent of the main sites let alone the nature stuff I wanna do. I think 2 weeks in colombia would be cool.",
            "score": 2,
            "author": "TheRealTylermadani"
        },
        {
            "level": 0,
            "comment": "I was in Bogota for 4 nights last month and really loved it! \n\nDefinitely take the gondola up Monserrate - try to arrive around sunset, it's really beautiful. I took a fruit tour at Paloquemao Market, it was super interesting and delicious. Tried so many unique and interesting fruits I hadn't had before. Mercado La Perseverancia was interesting too. I also liked hanging out and people watching at Chorro de Quevedo - try the local chicha!\n\nMy favorite restaurants were Bijao Y Malanga - you **must** get the ajiaco and moto de queso - and El Chato - the multi-course meal with wine/cocktail pairings was incredible!",
            "score": 1,
            "author": "lynxpoint"
        },
        {
            "level": 0,
            "comment": "Instead of Lime, I suggest you go to Quito, Ecuador. From there you go to Mindo (2h ride) which is a bird watching sanctuary, incredible place to see a huge variety of orchids, great fun trail hiking through the rain forest. \nAlso from Quito you are 2h away from the largest indigenous market (Mercado de Otavalo), with beautiful Andean landscapes. \n1h from Quito you can visit incredible hot springs high up the Andean mountains and into the Amazon. Also from Quito you are 4h away from the city is Tena, the entrance to the Ecuadorian Amazon. There, check out the Yasuni national park, one of the most bio diverse hotspots in the planet, also the location of indigenous communities who offer great ecotourism options . Quito itself is a world heritage city with the biggest life colonial downtown. \nI guess Ecuador offers a lot of what Brasil Amazon and Lima trip can offer, with the benefit that you don’t spend so much time and money moving from place to place. Ecuador is very small and you can get from one place to a totally different one in a matter of a couple of hours. Good luck with your trip! And enjoy your family time in Cali.",
            "score": 1,
            "author": "boriarrobo"
        }
    ]
}