{
    "id": "13ny6se",
    "score": 1,
    "title": "Interesting turn of events leading to a weird (flight) itinerary",
    "author": "ParrotRiley",
    "date": 1684683576.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13ny6se",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's kind of funny how my summer itinerary came to be. I'm threading the needle between hiking my country's coastline, spending a weekend in Rotterdam, going to Nice with my boyfriend and travelling solo to Kosovo, all of this while working on any of the days I have left!\n\n**TL;DR: dumb flight itinerary due to relationship issues, resulting in hundreds of dollars extra to rebook flights and adding a useless connection. First I'll hike my country's coastline, followed by a week of working, immediately after my last shift I'm heading up to Rotterdam where I'll spend a few days, I come back late in the evening and need to catch an early-morning flight the next day to Nice. A week later I return from Nice to Brussels, to then sit around in the airport for 7 hours to finally head down to my original destination of Kosovo.**\n\nI had my work shifts scheduled around a three week trip to France (Nice) and Spain (Barcelona) with my boyfriend and his family. We broke up however, and it didn't look like it was going to get back on track. So I booked my solo trip to Kosovo in this three week window. My flight tickets were non-refundable and so was the 5-star hotel I decided to treat myself to at the end of the trip. I had some more free days in this three week time frame so booked a trip to Rotterdam as well.\n\nThen me and my boyfriend got back together and all hell broke lose when he heard about my plans. I suggested cancelling the second half of my trip to Kosovo, missing out on the hotel and not using my return ticket. Eventually his mother proposed I rebook both plane tickets to a week later, so I can join them in France for a week and still have my complete trip in Kosovo. Issue then is that when they are leaving for Nice, I will still be in Rotterdam. So I then booked a flight the morning after I come back from Rotterdam. My flights to Kosovo were rebooked but had to depart from and arrive at Brussels Airport, so I basically will be flying from Nice to Brussels, spending 7 hours in the airport before then catching my flight to Kosovo. A useless connection basically. Oh, and to add on that, I have tight layovers of approximately an hour in Vienna. Great.\n\n**Lesson learned**: always take travel insurance or refundable options for bookings.\n\n&amp;#x200B;\n\nAnyone had similar experiences or fun stories, dumb mistakes like me?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm not sure travel insurance covers boyfriend issues.",
            "score": 17,
            "author": "XenorVernix"
        },
        {
            "level": 0,
            "comment": "Good luck with that itinerary, if one of those flight gets delayed/cancelled you are fucked. Especially that it will be in the summer and a lot of people will be traveling, remember what happened last year. Hope you learned your lesson and have travel insurance.",
            "score": 2,
            "author": "ProT3ch",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the least of my concern. A seven hour delay would be quite impressive. The connections in Vienna are on the same ticket so I'm safe there",
                    "score": 1,
                    "author": "ParrotRiley"
                }
            ]
        }
    ]
}