{
    "id": "13ojwfc",
    "score": 1,
    "title": "Solo traveler to Chicago &amp; Boston with an injured foot - looking into bike options for seeing the cities",
    "author": "HumanSieve",
    "date": 1684741009.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13ojwfc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi people,\n\nI have a vacation booked to Chicago and Boston but recently I got a foot injury that might take months to heal, and leaves me unable to explore the cities on foot. Biking I can still do. Would you guys say that it is feasible to rent a bike in these places and see the cities that way? Would you have any tips for me?",
    "comments": [
        {
            "level": 0,
            "comment": "Chicago has divvy bikes(rentable) all over the city plus great public transport.  Biking downtown is quite hard since the bike paths aren't best in the loop and you can't bike on the sidewalks. But you can bike the lakefront.\n\nI would map out your points of interest and see where they all are compared to eachother.",
            "score": 3,
            "author": "Clarence_Bow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I forgot divvy has some electric bike options and there's the scooters.",
                    "score": 1,
                    "author": "Clarence_Bow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bostonian here. They are trying to make the city more bike friendly by building pathways on the main roads. But in my opinion, because it's so recent that they built it, it still seems really scary to bike in some parts because some roads that still merge into traffic even though the bikers have more right-of-way than cars. But then again, I never biked here.\n\nI also think the roads here are just so confusing (for drivers)because it's not a grid-like pattern like New York. Cattlemen roads were built first in this city and the conversion to roads made it really hard and awkward so therefore, drivers can be just as confused and make it dangerous for bikers. Wish you luck either way. Let me know if you want a list of places to visit",
            "score": 1,
            "author": "Silver_Scallion_1127"
        },
        {
            "level": 0,
            "comment": "As someone who has had to do physical therapy way too many times, I am getting sympathy pains just reading this. Maybe you could rent a moped or something?",
            "score": 1,
            "author": "Happy-Birthdays",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that a bike will also support me a bit while walking. That doesn't work with a moped.",
                    "score": 1,
                    "author": "HumanSieve"
                }
            ]
        }
    ]
}