{
    "id": "13pfmg4",
    "score": 8,
    "title": "Just a little check-in on my trip and prioritizing myself",
    "author": "texcc",
    "date": 1684821388.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13pfmg4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got to San Juan del Sur, Nicaragua a couple of days ago.  I have been pretty anxious about my trip because, although I've traveled alone a lot and traveled to Latin America a lot, I've never traveled for this long (a month) by myself in Latin America.  I'm a woman and that brings a host of it's own complications in solo travel, I think.  \n\nWhen I got to the apartment I booked, I pretty much immediately felt sketched out.  I knew I was staying in a locals' neighborhood, but it was much further back then I expected and on a somewhat desolate street.  I felt all the locals staring every time I went in or out of the house/neighborhood, which is somewhat frequently with my dog.  The setting of the house made me feel like I was pretty much never going to feel comfortable coming or going after dark.  The apartment was also really dirty (roach poop all over the bathroom), and some basic things were missing (like the toilet wouldn't flush, no matches for the stove to make coffee in the morning, etc.).  I'm no stranger to cheap developing country dwellings, and maybe I've just gotten older, but this one was a bit beyond what I felt psyched to stay in for a month. To top it off, there were probably 5 dogs who barked LOUDLY almost all through the night.  I'm a heavy sleeper and don't mind some noise, but it was torturous. To sum it up, I was feeling really uncomfortable both inside and outside of the home.  \n\nToday, I posted on the locals Facebook page looking for an apartment.  I went to look at two that I felt were definitely an upgrade but kind of meh, and when I got back from my Spanish lesson I saw a new message from a couple who owns a local restaurant and a little apartment above.  Y'all- my new apartment is AMAZING.  I've never had a/c when traveling in Latin America before!  I'm sitting in a recliner watching a big screen TV with allll the apps.  My kitchen is so cute and clean and even has an air fryer.  The space is so open and bright.  The bed is feather top and there's an indoor hammock.  I'm right above the restaurant, right in the middle of town, and right next to the park to take my dog out.  When I moved in tonight I almost cried of joy.  \n\nIt is double what I was paying at the other place, but I'm a bit older now and the reality is I have the money to splurge a little.  I think it will make a huge difference in my overall experience, and I feel so safe and cozy now.  Maybe if I had a travel companion we could've laughed off the discomforts of the other spot, and it would've helped with the insecurity I felt there, but ultimately traveling solo is uncomfortable enough to deserve to support yourself a bit if you can/need/want.  Also want to say that I was nervous and skeptical about my in-person Spanish classes, and after having my first one I have to say: AMAZING!  Excitement/happiness starting to win over anxiety.  \n\nOne other tip that I will definitely be using for the future: \n\nI found that the local Facebook group page brought lots of offers for really nice places (just many not meeting my last-minute booking request).  The apartment I ultimately got is listed about 40% higher on AirBnb, and overall the apartments were MUCH cheaper on the FB group.  In the future, I will always go this route first if possible, maybe with a live video chat tour and PayPal goods and services deposit.  \n\nHappy travels everyone!",
    "comments": [
        {
            "level": 0,
            "comment": "So this is ads space for FB rentals?",
            "score": 1,
            "author": "YellowIsCoool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just sharing my experience 🤷🏼‍♀️",
                    "score": 3,
                    "author": "texcc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd advise using caution when doing local rentals outside of a platform, even if (sometimes especially if) you're offered a cheaper rate for paying cash or outside the protections of the website. Sure, you might find a good deal, but tourists and travellers are also often prime targets for scammers because they don't know the ins and outs of doing business locally.",
            "score": 1,
            "author": "segacs2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I can def see that.  This was a really good situation for me, as I could meet the owners personally and they were also American, owned the restaurant right downstairs, etc.  Even meeting the other two owners that I met who were local felt very safe and straight up.  Sometimes, especially in more rural areas in developing countries, a lot of locals might not know how or have the desire to list places on AirBnB, but offer rentals locally just the same.  I think it's obviously a bit more of a risk and you need to proceed with caution, but is also a viable second option that it can work out quite well as long as you use common sense.  It's probably ideal to (if you're like me and go on longer trips), just book a few days at an airbnb and be open to getting in-person deals.",
                    "score": 1,
                    "author": "texcc"
                }
            ]
        }
    ]
}