{
    "id": "13pofnx",
    "score": 2,
    "title": "Looking for a snorkelling destination accessible from SEA for July",
    "author": "Difficult-Duty-8156",
    "date": 1684848218.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13pofnx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! \nI’m currently in the Philippines and going to Vietnam next. I have 4 weeks in July where i’d like to go to another country to relax but also do some snorkelling for a few days. \n\n I’d like to hear some experience for specific locations and for solo travelers (no private tours). \n\nIdeally somewhere I can get to quiet easily = no secret island where I need to charter a private boat to get there  lol \n\nMy budget would be 30-50$ per day. \nI’d like to find a place where I can move around the country to do some sightseeing and ideally. \n\nI’d love to find a place where I can just go by myself to the beach and snorkel or join a tour (budget max of 50-100$ for the tour). \n\nI’ve heard about Thailand and Indonesia for snorkelling but after doing some researches, places like Thai gold islands or Bali are not great for snorkelling (coral being dead). \n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "Hey Difficult-Duty-8156, it looks like you're planning a trip around Southeast Asia. Check out solotravel's [detailed guide to planning a solo Southeast Asia Trip](https://www.reddit.com/r/solotravel/wiki/seasiatrip) for general planning advice plus useful tips and tricks for Southeast Asian travel!",
            "score": 1,
            "author": "segacs2"
        },
        {
            "level": 0,
            "comment": "Actually the snorkeling around nusa penida just off the coast of Bali was incredible. It is definitely over touristed but the coral was pristine and home to such an amazing array of sea life. I've heard the snorkeling near Raja Ampat is even better but I haven't been myself.",
            "score": 5,
            "author": "jhakasbhidu",
            "replies": [
                {
                    "level": 1,
                    "comment": "For Nusa Penida do you need to join boat tours? Thank you",
                    "score": 1,
                    "author": "Difficult-Duty-8156",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also the Gili Islands off Lombok, my preference way Gili Air to stay on. But many options also Kuta Lombok. snorkelled with turtles there two weeks go. Was great",
                            "score": 4,
                            "author": "Overall_Intention_15",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Gili islands are my favorite snorkel spot I’ve ever been to. Spend an hour in the water and see a dozen turtles",
                                    "score": 1,
                                    "author": "Agreeable_Ad281"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes they have many boat tours leaving from Nusa Penida island and even from the Sanur dock in Bali. Very reasonably priced too. Not more than $30-40, might have been even cheaper",
                            "score": 1,
                            "author": "jhakasbhidu"
                        },
                        {
                            "level": 2,
                            "comment": "Just go.  In July Bali is the best weather, by far.  On your budget you will be fine and you can go east from Bali, as others have suggested.  Do some research and you will find that this is your best option.",
                            "score": 1,
                            "author": "3rd_in_line"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Asked this same question myself and responded after I came back, take a look!\n\n[https://www.reddit.com/r/solotravel/comments/wftx2p/snorkeling\\_in\\_southeast\\_asia/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/solotravel/comments/wftx2p/snorkeling_in_southeast_asia/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
            "score": 1,
            "author": "ceratopolis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Perfect thank you. I’ll go for Indonesia probably :)",
                    "score": 1,
                    "author": "Difficult-Duty-8156"
                }
            ]
        }
    ]
}