{
    "id": "13qiqob",
    "score": 1,
    "title": "Planning solo car trip in Europe (looking for tips/advice)",
    "author": "LongSunnyDay",
    "date": 1684927453.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13qiqob",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everybody,\n\nstarting autumn I'm planing to do solo trip though the Europe. For now not much planned, just that I'll start in Lithuania, drive to Warsaw and stay there for three of weeks, then move to Belgium for another three. Afterwards the only point which I want to reach by the end of the year is Gibraltar, but it's also open for discussion. Idea is to wander a little bit with option to stay at one place for longer period of time if I feel like it.  \nSince I've remote job, most of workdays will be occupied with my work, this is why I'm planning at one place to stay for at least three weeks, so I have couple of weekends there during my stay.  \n\n\nSo far done a little local test run for my trip and enjoyed staying at hostel. Mostly I've get back just to sleep, so it's fine to share a room, also new connections made there are welcome for sure. For doing my work, I think it will be easy to find co-working spaces in bigger cities and since I don't have many meetings, working at smaller town coffee shops is quite an option.  \n\n\nOverall looking an advice on how to pre-plan itinerary, what to look out for, how to expand network, would it make sense to stay in big city center, or it's better to stay near by, and so on...\n\n&amp;#x200B;\n\nPlease share your experiences and any advice is welcome!",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like you're planning a trip around Europe. Check out solotravel's [detailed guide to planning a solo Eurotrip](https://www.reddit.com/r/solotravel/wiki/eurotrip) for general planning advice plus useful tips and tricks for European travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "3 weeks in the same town will feel like too long, Would stay max 2 weeks.  \n\n\nGet speedify and use wifi+ mobile connection for stable internet.",
            "score": 3,
            "author": "Arrelevant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hm... Even taking into account that I'm going to work bigger part of the day?  \nSince idea regarding three weeks came from one of my previous trips where I was just staying for two weeks. That felt like just having off-office hours and single weekend wasn't enough.",
                    "score": 1,
                    "author": "LongSunnyDay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do as you like.",
                            "score": 1,
                            "author": "Arrelevant"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A car is possibly going to be a pain for the type of trip your planning. \n\nMost hostels are in the centres of cities - exactly the place where parking is the most expensive. \n\nAnd a lot of co-working spaces are also in the centres of towns and cities. \n\nThere will also be the constant worry of theft because cars with foreign plates always seem to be bigger target for the local thieves.\n\nThere's awful lot to be said for stepping off a train, walking to your accommodation without having to worry about parking fees, local parking restrictions or the safety of your car!",
            "score": 2,
            "author": "baghdadcafe",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is true. But road trips are amazing and allow you to see things at your own pace and find “hidden gems” that you would miss going from central station to central station in cities. It is clearly more expensive but I like this tour. Only OP has to “watch out” (not really sure how) for theft, especially in the Eastern European regions and check out any fees for crossing borders or even if any additional paperwork is needed",
                    "score": 1,
                    "author": "nomadlaptop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know people who done this in campervans. \n\nAny horror stories regarding theft all happened in Western European countries. Eastern Europe was perfectly safe!",
                            "score": 1,
                            "author": "baghdadcafe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm from Eastern Europe and I can say that it's perfectly safe!",
                                    "score": 1,
                                    "author": "LongSunnyDay"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's that I'm aiming for, to take things slowly, see surroundings, not only stick to cities, but also to see nature around.  \nRegarding theft, not really planing to take anything of value with me, just my laptop, t-shirts, underwear and so. Car still can be looted, but same thing can happen in my Eastern Europe country xd  \nMy main concern here regarding car is now much of the extra effort there is going to be involved regarding parking",
                            "score": 1,
                            "author": "LongSunnyDay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Parking for sure is going to be a hassle. But in the more Mediterranean countries you can often park in “creative” ways and not necessarily in expensive lots. I wouldn’t do it in places like Belgium but hey..no better way to experience the reality of a country than having your car towed and dealing with the local police lol",
                                    "score": 2,
                                    "author": "nomadlaptop"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good point, I kind a see that having car in bigger cities is going to be pain in the ass. Motivation to go with it is to explore a bit, being able to take more of my belongings with me. Since you pointed out parking issue, I'm considering just leave car in some long term parking loot while I stay in bigger town. Would that be mad for doing that?",
                    "score": 1,
                    "author": "LongSunnyDay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chinese old proverb say \"Good traveler dose not have fixed plan.\"",
            "score": 2,
            "author": "hogie12345",
            "replies": [
                {
                    "level": 1,
                    "comment": "xexe, Chinese were on point with this",
                    "score": 1,
                    "author": "LongSunnyDay"
                }
            ]
        }
    ]
}