{
    "id": "13qqfmk",
    "score": 0,
    "title": "Less touristy areas of Rome?",
    "author": "Extrabytes",
    "date": 1684945954.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13qqfmk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone, I (18M) am about to finish a 30 day solo cycling trip from the Netherlands to Rome. On my trip I visited Florence, which was a major disappointment to me as it was *extremely* busy. Florence is a nice city, but it absolutely cannot handle the amount of tourists it receives and beyond the dozen or so sights to see the city really had nothing to offer for me. I am quite used to European cities as my parents and I used to travel alot, so seeing a city like Florence being as flooded with tourists as it was surprised me. In most cities I have visited on my cycling trip I have tried to avoid popular attractions and instead visit places that locals go to or are otherwise not geared to tourists (Florence was geared to tourists to such an extent that it felt disgenuine and fake to me).\n\nSo now that I am about to arrive in Rome I want to be slightly more prepared and try to visit interesting parts of the city that are not as busy and touristy as the main attractions.  Since this is my first time in Rome I will obviously visit places like the St. Peter, the forum Romanum etc. But after about 3 days of that I think I will mostly have seen all main sights. After this I have mabye 1 or 2 days left to see some other parts of the city. Which less well known parts of Rome would you recommend, and what was your experience exploring them on your solo travels?",
    "comments": [
        {
            "level": 0,
            "comment": "If you can’t handle the amount of tourists in Florence, you will not enjoy those three days in Rome visiting the main sites.\n\nMaybe you should spend four or five days in the less touristed parts of Rome - not one or two. I’m sure they exist because it’s a big city.\n\nI can’t really recommend any because I stayed pretty much in the centre - only going as far as Trastevere, which is more relaxing but still plenty of tourists. \n\nI was told, by a Roman, that I should stay in Monteverde next time.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I went to the [Flaminio](https://www.wantedinrome.com/area/flaminio) neighborhood to go to Neve di Latte for gelato (they now have other locations in the city). Seemed like an interesting area of town and not super touristy. There's a tram you can take to get there.",
            "score": 1,
            "author": "wake_time"
        },
        {
            "level": 0,
            "comment": "I felt the same way about Florence! I stayed in Monti during my time in Rome and had a chat with a local who told me tourists don’t usually stay there, though it is close to the Colosseum. Prati is really nice if you stay away from the Vatican, but seemed pretty expensive to stay in. Outside of the heart of Rome, Testaccio and Monteverde might be good options? I didn’t spend much time there, but my art history professor recommended them to get off the beaten path a bit. Hope you find what you’re looking for!",
            "score": 1,
            "author": "lyoness09"
        },
        {
            "level": 0,
            "comment": "I wonder why tourists hate going to touristy places? Certain places are attractions because they are attractive to visit. Why should you miss the Coliseum if you visit Rome. Anti-tourist tourism is a form of snobbery. At the end of the day we are all tourists.",
            "score": 1,
            "author": "Sufficient_Roll_2193"
        }
    ]
}