{
    "id": "13rif6z",
    "score": 26,
    "title": "Caribbean destination ideas - solo female (late 20s)",
    "author": "mh942",
    "date": 1685022797.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13rif6z",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been trying to wrap my head around a destination for a trip I'm looking to take in July for 3-4 nights.  I am a late 20s female and travel alone (domestically) all the time, but have some anxiety about going out of the country alone.  I haven't been out of the country since a Cancun trip with friends in college 7 years ago so I'm really just aiming to get out of my rut and get off US soil.  I'm keeping my focus on Caribbean now, as Europe is too far out of budget (trying to stay under $2000 for flight from PHL/EWR and hotel).  Basically the purpose of this trip is to unplug from work for a few days, get out of the country/out of my comfort zone,  relax with some pool time, have a few drinks/some good food, and see someplace new.\n\n\\*Looking for a place that has some things to \"explore\", per se, I'm not a fan of going somewhere and never leaving the resort.  Doesn't necessarily have to be major excursions but even just like a cute area of shops/restaurants/etc. nearby where I could walk from the hotel to get out and see things.\n\n\\*My personal comfort level, I don't feel comfortable relying on public transportation.  I have an anxiety disorder so being alone on public transportation and trying to figure out the logistics of things, especially if there's a language barrier, is just not a good situation for me.\n\n\\*Not opposed to cruises but they're incredibly expensive/low availability this close to sailing.\n\n\\*Though not a dealbreaker, somewhere that has Marriott properties would be ideal as I'm trying to accumulate points towards a January Hawaii trip! \n\nAny input, whether it's destination, resort, places to avoid, etc. would be greatly appreciated.  Thank you! :)",
    "comments": [
        {
            "level": 0,
            "comment": "OP appears to have requested personal experiences from (women/people of color/LGBTQ+ travelers). If you are not a member of the requested demographic, please carefully consider whether your post will add value to the conversation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Caye Caulker Belize if you're interested in marine life. A cheap private hotel room there is around $50. You can fly right to the island, or get an airport transfer from Belize City air port right to the ferry which may save a few bucks. The island is completely walkable so no public transport worries whilst you are here.\n\nYou could also look into The Costa Rican carribean coast or if you're looking for beautiful small island beaches, the San Blas islands of Panama are to die for!",
            "score": 46,
            "author": "AlertEvening6098",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to recommend both Belize and Costa Rica. Belize has some of the best diving in the world. I spent almost a week in San Pedro and it was lovely. Not too expensive.",
                    "score": 19,
                    "author": "Mursetronaut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed on Belize having the best diving in the Caribbean",
                            "score": 3,
                            "author": "Lobi545"
                        },
                        {
                            "level": 2,
                            "comment": "Im gonna vote for my old stomping grounds: Placencia!",
                            "score": 1,
                            "author": "muscleupgyal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for these specific recommendations! I'll have to take a look!",
                    "score": 5,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Goodbye Apollo :(.]",
                            "score": 7,
                            "author": "into-res-ting",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Will definitely need to look this up, and the Marriott as well. Thank you!",
                                    "score": 5,
                                    "author": "mh942"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Last year, I (woman in early 30s) spent a few days in Puerto Viejo, Caribbean side of Costa Rica and it was wonderful. You can rent a bicycle and explore several beaches in the area. There is also a national park (cahuita) and an animal rescue center that are quite nice. Lots of wildlife and natural beauty! Would definitely go back.\n\nIf you travel to the Caribbean side of Costa Rica and fly into San Jose, I can recommend taking a whitewater rafting tour if that's something for you. I had never done it before but apparently it's one of the best places in the world for whitewater rafting. I'd recommend it for the tropical scenery alone, it is incredible! The tours pick you up in San Jose in the morning and drop you off at the beach in the evening.",
                            "score": 4,
                            "author": "snoea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Along with Bocas del Toro! You cannot beat this area! But it isnt for the faint of heart, or should I say the cruise ship/AI/Hilton crowd. But anyone with a sense of adventure and tolerance for being wiht locals rather than fellow travelers cant go wrong here! It has gotten more expensive, so my first choice would be Corn Islands!",
                                    "score": 2,
                                    "author": "SnooTangerines7525"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Caye caulker would be perfect for you! Amazing people, food, vibes. Beautiful beaches, swim spots and excursions",
                            "score": 4,
                            "author": "cerebral_n00ds"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seconding San Blas...  Just gorgeous and so chill!  (Great suggestions!)",
                    "score": 1,
                    "author": "FeistyMcRedHead"
                },
                {
                    "level": 1,
                    "comment": "Oo good recommendation! Commenting to save for my future trips!",
                    "score": 1,
                    "author": "Whirloq"
                },
                {
                    "level": 1,
                    "comment": "Agreed! My dad lives on Caye Caulker so I regularly visit. I’m always seeing plenty of backpackers and solo travelers coming through. Very social, I meet travelers from all over each time I go. The island is very small but with a trip on the water taxi you can reach the mainland and San Pedro. Small group tours with a guide for fishing/snorkeling/Mayan ruins/cave tubing are relatively inexpensive and fun. I see lots of travelers doing routes from Mexico through Guatemala and Belize.\n\nAs a woman I say avoid the mainland, especially Belize City, without a guide. But the islands are great, the only guys who ever creep on me are the British servicemen who train on a nearby island. I regularly take walks alone in the middle of the night.\n\nDM me if you need recommendations or suggestions!",
                    "score": 1,
                    "author": "Imaginary-Ad1161",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interestingly enough I was speaking with a Caye Caulker local about solo travelling - he was saying how he had always wanted to travel solo but was worried about his safety, and that obviously I, as a solo female traveller, don't have to worry about my safety as much as he would as a solo male traveller.\n\nI was completely baffled by that statement that I asked him to elaborate l, thinking that perhaps he was joking, but no - he genuinely felt that a woman travelling alone would find less trouble than a man, as people would respect the wants or needs of a female more.\n\nThis isn't to get into a women have a harder time travelling than men or vice versa argument- however it was the very first time I met someone with the opposite standard opinion. I felt a lot more at ease on carribean islands now that solo travelling women seem to be offered a level of respect I hadn't seen elsewhere.",
                            "score": 1,
                            "author": "AlertEvening6098"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Roatan is very small but cool. \n\nHowever I wouldn’t eliminate europe if your flight and hotel budget is $2000. \n\nJust a quick google search. Random July dates (7-12) from EWR. Flight to Milan $858. 4 star hotel for 4 nights. $608. ($1466 total). \n\nPorto Portugal same dates. Flight $1151. 4 star hotel $590. ($1741 total). \n\nHaha I literally love planning trips and finding deals. So if you want help DM me. But I also get if you are set on the Caribbean.",
            "score": 21,
            "author": "lavacakeislife",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll have to play around with it... thank you! Out of curiosity, what hotels did you get the prices for?",
                    "score": 5,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mercure Porto Centro Santa Catarina hotel was the $590\n\nMilan was UNAHOTELS Mediterraneo Milano. $608\n\nI literally just searched hotels.com and picked the first one that meets my standards.\n\nI’m sure you could find better deals if you looked harder.",
                            "score": 7,
                            "author": "lavacakeislife"
                        },
                        {
                            "level": 2,
                            "comment": "I love Belize, either caulker or ambergris\n\nBut the euro is nearly at par to the dollar due to interest rates and such. So, Europe is my destination this summer instead of the Caribbean",
                            "score": 2,
                            "author": "Mrknowitall666"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Puerto Rico off the table since it's part of the US? Culturally it's a very different and unique area but some things are similar to the mainland. It's a good transition IMO.",
            "score": 16,
            "author": "tambrico",
            "replies": [
                {
                    "level": 1,
                    "comment": "2nd this, especially since it’s only a 3-4 day trip. I’ve been to San Juan a few times.  Beaches aren’t amazing, little rough and sand isn’t white but if you did a Marriott resort with a pool that might be enough.  I’ve stayed at the San Juan Marriott Resort &amp; Stellaris Casino as well as some of the hostels in the area.  The two Marriott’s in Condado put you within walking distance of Santurce and Calle Loiza. Old San Juan and the Airport are both a 15 or less minute uber away.  El Yunque not too far off and plenty of historical stuff in old San Juan.  Plenty of independent food and drink options. Also plenty if direct flights out of PHL.",
                    "score": 6,
                    "author": "J0fr0"
                },
                {
                    "level": 1,
                    "comment": "Great question! It's not off the table, but my passport \"expires\" (at 6 month mark) in September so I was kind of shooting for one last use out of it lol.",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "St Maarten airfare can be expensive but lodging is not too bad.  Great nightlife, can travel between dutch and french side, take a ferry St Barts for a day trip as well.\n\n&amp;#x200B;\n\nGrand Cayman has good airfare prices but lodging can be expensive (Has a Marriot as well). Great excursions, stingrays, sea turtles, mangroves at night. Beaches are clear blue water. Also one of the safest places in Caribbean",
            "score": 12,
            "author": "SinceWayBack1997",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for this! Grand Cayman was one of the places I had in mind but the hotel prices were definitely up there.  The main issue was nonstop flights don't run out of PHL, and only once a week out of EWR.  Grand Cayman flights with a layover were more expensive than a lot of places direct.  One day I'll get there!",
                    "score": 3,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you care about your money, do not go to Grand Cayman. I just went last week and never again lol",
                            "score": 5,
                            "author": "redvelvetandobsidian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How much did you spend?",
                                    "score": 1,
                                    "author": "3iiis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For two people we spent 3k not including flights and hotel for 5 days",
                                            "score": 3,
                                            "author": "redvelvetandobsidian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "$1500 per person actually not too bad imo . That’s about what I would spend in NYC, Vegas , and Miami",
                                                    "score": 1,
                                                    "author": "3iiis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It seemed excessive for what we got. The food didn't justify the cost imo and we spent less going to other islands for double the time.",
                                                            "score": 3,
                                                            "author": "redvelvetandobsidian"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "if you don't mind extra travel you could also take the Amtrak for $20-$40 from Philly to NYC and fly out of JFK. NYC to Caymans has direct flights",
                            "score": 2,
                            "author": "SinceWayBack1997"
                        },
                        {
                            "level": 2,
                            "comment": "Cayman is a fantastic place. It's about the safest place in the Caribbean; English is the official language (and the accent isn't too strong); it's clean; the beach is among the best in the world; it's fairly easy to get around (cheap convenient buses, safe taxis, and it's small so you don't have to spend a lot of time to get anywhere). If you're comfortable driving on the wrong side of the road, it's easy to rent a reliable car.\n\nYou can fly direct from JFK. Cayman Airways is great. JetBlue and others fly direct as well.\n\nI lived there for three years. Feel free to DM me if you have questions.",
                            "score": 2,
                            "author": "jimheim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 1,
                                    "author": "mh942"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dominica",
            "score": 9,
            "author": "Gman2736"
        },
        {
            "level": 0,
            "comment": "I had a great time in St. Martin (stayed on Dutch side). Not sure about a Marriott, but I'd be surprised if there wasn't one.\n\nThe French side is lovely, but there are fewer walkable areas on that side. There is \"public transportation\" on the Dutch side which is literally a fleet of small vans that travel in a loop and you wave them down when you want to get on.  Very easy, but since it's just a loop they only go to certain places (but one of them is the capital, Philpsburg.  If there are cruise ships docked it will be crowded, ghost town if not).  Taxis are rather expensive, but renting a car was pretty cheap.  Very easy to drive around the whole island (there is only one traffic light on the whole island!)\n\nThere are tons of snorkeling/scuba excursions.  Lots of lovely beaches for day trips (you pick a restaurant or resort and rent lounge chairs through them, can order food, drink at the restaurant or with the attendant).  We did beach days at Simpson Bay and Anse Marcel on the French side (so beautiful). There is also some nice hiking.\n\nDon't miss brunch at the Sint Maarten Yacht Club!",
            "score": 7,
            "author": "FritoPaws1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will have to check this out! I know someone who honeymooned there but not sure which \"side\". Thank you!",
                    "score": 2,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My wife and I stayed on the French side last year, we loved it.  The French side is the chill beach side, and the Dutch side is more of a party/touristy vibe also with beaches, but not quite as nice.  I'd 100% recommend you check it out.  There's a lot to do, great food, lovely environment,  rum.  You should be aware that they're still rebuilding from a hurricane that damaged or destroyed like 80% of the buildings on the island.  They've come a LONG way, but there's still busted stuff everywhere.",
                            "score": 1,
                            "author": "13dot1then420"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would recommend Aruba. Everyone speaks English and there are a ton of European and American tourists. The island is small and I felt incredibly safe and not on edge about being scammed all the time. Took a few taxis and noticed they charged the same price to/from the locations I went to without any negotiating. Also, US customs is before you leave the island so it’s easy when you land back in the US.",
            "score": 9,
            "author": "latebutton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second Aruba! I felt very very safe, it’s so small (the whole island is 30 miles long!), the beaches and water are gorgeous, and I enjoyed the local restaurants. You can rent a car for super cheap and driving there is easy!",
                    "score": 2,
                    "author": "cheesewiz90"
                },
                {
                    "level": 1,
                    "comment": "That's great to know about customs! Aruba is one I kind of had in mind so I appreciate this information.",
                    "score": 1,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went to Aruba as a solo woman last year and had a great experience! You can walk pretty much anywhere, although I would encourage you that public transportation is very easy. The bus drivers speak English and will take either Aruban or American currency, and it's quite cheap. Private Airbnbs are quite affordable as well although I know you're looking for Marriott. All of the beaches are public, and many have palapas for shade. The small sample of locals with whom I interacted were all very kind and I had a lot of fun hanging out with them, but it's also easy to enjoy on your own. I bought groceries and occasionally ate in restaurants and spent under $900 for 10 days, including flights.",
                            "score": 7,
                            "author": "slowdownlambs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is great to hear - thanks for sharing your experience! Out of curiosity, where did you stay during your trip?",
                                    "score": 2,
                                    "author": "mh942",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I stayed in Orangestaad!",
                                            "score": 1,
                                            "author": "slowdownlambs"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re comfortable hiring a car I can recommend St. Lucia. Friendly, safe and small enough to drive around without getting lost.",
            "score": 6,
            "author": "helenahandcart"
        },
        {
            "level": 0,
            "comment": "Find an apartment on Sao Miguel in the Azores!  SO safe.  Go swim in the thermal baths.  Find a beach on the north part of the island and watch surfers or go surfing.  Europe is not as expensive as you think, and apartment rentals are insanely well appointed AND they are everywhere.",
            "score": 4,
            "author": "Remote_Cherry7790"
        },
        {
            "level": 0,
            "comment": "My fiance and I really enjoyed St Croix. Can find cheap flights sometimes.",
            "score": 4,
            "author": "tjpwns"
        },
        {
            "level": 0,
            "comment": "If you like camping, you can Glamp at St John, USVI, it’s a affordable option for a Caribbean trip and the only place you can actually really live on the beach.",
            "score": 4,
            "author": "3PNK"
        },
        {
            "level": 0,
            "comment": "Can definetely recommend Puerto Viejo de Talamanca Region of Costa Rica / the caribbean coast in generel. \n\nCosta Rica is in the Aspects of biodiversity unmatched in the world (That‘s a fact). Despite being a Bit More expensive you can absorb wildlife at the highest Level. PV itself is a cute small town with paradise-beaches a Bit More outside and sounds exactly what you are searching for.",
            "score": 3,
            "author": "Klutzy_Juice2370"
        },
        {
            "level": 0,
            "comment": "St Maarten for lovely beaches and a huge tourist population if you wanna mingle with others.\n\nTrinidad &amp; Tobago (2 islands, one country) for great food and beaches. Seasonally popular, but generally a great experience through and through. Look into hiring a local tour guide or Google some touristy spots and rent a car if you don’t mind driving.",
            "score": 3,
            "author": "marinocor"
        },
        {
            "level": 0,
            "comment": "Costa Rica, Manuel Antonio area (Quepos), you can do lots of activities and the tour operators will pick you up and drop you off at your lodging.  It's absolutely gorgeous, there's lots to do and good food, very nice people too.",
            "score": 3,
            "author": "angelwild327",
            "replies": [
                {
                    "level": 1,
                    "comment": "Find a place that has airport shuttle services.  That part is not cheap, but definitely worth it.",
                    "score": 2,
                    "author": "angelwild327"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Dominican Republic is safe and beautiful. Nice resorts and a beautiful countryside to explore. I took a tour on four wheelers and it was really fun.",
            "score": 3,
            "author": "Lord_Muramasa"
        },
        {
            "level": 0,
            "comment": "Though on the expensive side, I went to Martinique in 2019 and loved it. My family is from the Caribbean and it was so weird how at ease I was there (whereas for other islands I can sometimes have my guard up when I think things are dodgy).\n\nVery safe to get around. Beautiful volcanic beaches. Great hiking. Excellent food. Everything is based in Euros, so more expensive than other islands. English isn't universal, but you can usually find someone to help, especially if you know at least a little French. Most tourists are from Europe and speak English, so that was fun too. You'll likely be one of few Americans in most spaces.",
            "score": 3,
            "author": "Mother_Drenger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really familiar but will have to look it up! Thank you!",
                    "score": 1,
                    "author": "mh942"
                },
                {
                    "level": 1,
                    "comment": "Aah! We are approaching Martinique!",
                    "score": 1,
                    "author": "Glittering-Hunter-23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I strongly recommend puerto rico. Lots of things to do and very safe for tourists.",
            "score": 3,
            "author": "FlyingKneeSuplex"
        },
        {
            "level": 0,
            "comment": "Not really carribean but I highly recommend Bermuda - I felt safe walking alone in the evenings, lots of restaurants in downtown but I stayed at Airbnb and got to see/chat with locals, everyone has such a easy going vibe about them/ sooo friendly! Swam on cutest little beach, explored some caves, went scuba diving. You can also rent electric car or scooter to explore the island. I got the car, it was so easy and all the charging stations are free. 1 week was enough to see most things on my list. The prices are comparable to US, so it’s not “cheap” but totally worth it if you are trying out travelling solo in another country.",
            "score": 3,
            "author": "adnapadnap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bermuda is definitely one I'm interested in! I was trying to book a cruise to Bermuda in July back in the winter (it was a great deal - $1100 with tips and wifi included for 7 days ocean view on Celebrity, port was \\~2 hours from my house so no flight required) but then abandoned the idea because of finances at the time... and now very much regretting it!",
                    "score": 1,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I absolutely LOVED Jamaica. We went to Falmouth a few years ago, it was great! It’s big enough to have a lot going on with varied options, but not overwhelmingly so. Still an intimate feeling. There’s a lot of activities for many different interests. And it is absolutely beautiful!",
            "score": 3,
            "author": "Glittering-Hunter-23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Did you go solo? If so, where did you stay?",
                    "score": 1,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, I went with my family, and it was on a cruise so we stayed on the ship, sorry! Been a couple of times on different cruises, though.",
                            "score": 1,
                            "author": "Glittering-Hunter-23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "San Andrés colombia? Idk about flights prices",
            "score": 3,
            "author": "bi_shyreadytocry"
        },
        {
            "level": 0,
            "comment": "St Marteen and Saint Martin, this island have a invisible border between the Dutch side (St. Marteen) and the French side (Saint Martin), fun and pretty island, not expensive. You can use dollars and speak English at the Dutch side",
            "score": 2,
            "author": "Brain_Geode"
        },
        {
            "level": 0,
            "comment": "Have you considered St.Lucia? They have Marriott properties. I believe the Royalton is one, but I've never stayed there so can't speak on personal experience. \n\nHiring a taxi driver for your trip would be ideal. Since you don't want to stay cooped up in the resort, they can take you to alot of cool local spots. You can do walking tours in the capital too.\n\nBeing from Dominica, Lucia is nearby so I often go alone and never felt unsafe (also late 20s female). Da and Lucia are considered sister islands but honestly Lucia has more activities and is easier to travel to so you'd get more out of your short stay.",
            "score": 2,
            "author": "Eiraxy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, the Royalton is now considered Marriott (under the \"Autograph Collection\" umbrella).  Thanks for the recommendation!",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Belize is a great option. I highly recommend Tobacco Caye if you like natural environments rather than more resort style places - it's a tiny island on a reef and the whole island is essentially your playground. Meals are included in accommodation and it's about $60-90/night (but it's not an all inclusive place they just make your 3 meals a day - but it's great - and there are two small bars on the island). You fly to BZE Belize City and then need to take a 15 minute flight to Dangriga and then they will arrange to collect you by boat and take you to the island. It's such an amazing beautiful place, the people are so friendly and I felt 100% safe as a solo female traveller.",
            "score": 2,
            "author": "Anni-Roc"
        },
        {
            "level": 0,
            "comment": "Barbados (St Lawrence Gap) or Turks and Caicos (Grace Bay).\n\nIn Europe, if you find a good deal, basically any smaller Geeek island or Algarve in Portugal",
            "score": 2,
            "author": "SamaireB"
        },
        {
            "level": 0,
            "comment": "Aruba. Despite what Nancy Grace says, Aruba is very safe. Roundtrip direct flights from NYC/Philly area can be roughly $300, $400 max. Everyone speaks english very well so there shouldn't be much of a language barrier. You can take a cab right from the airport to the hotel area and back. They have a few Marriott properties all next to each other (I think 3-4 properties - a courtyard, 2 full service, and ritz ) at the end of the High rise hotels. All of the big chain hotels are next to each other at the High Rise area. You could easily walk out the front of your hotel or along the beach to get to other properties/restaurants and casinos. Right across the street from the hotels is Paseo Hernancia (spelling is way off probably lol). It's a little shopping/restaurant area. Theres always something going on in that area, plus there are a lot of clubs in the area now too. There are a few other restaurants all along the strip by the big hotels. You could easily spend a few days trying a bunch of different restaurants there.\n\nAlso, the Renaissance hotel is a Marriott property. It's in down town which isn't as fun anymore, a lot of the clubs moved to the high rise area. There are still shops and restaurants in that area but a lot left for the high rises a few years ago. Still good if you want a better idea of what the locals are like. The main reason I suggest the Renaissance is because they have their own private island which is perfect for a getaway. They have flamingos on the island, SUP rentals, a little bar/restaurant. I would maybe recommend a day there if you want to check out the private island.\n\nFor excursions, you could do ATVs or a tour that picks you up from the hotel and drops you right back off. There is water sport rentals right on the beach everywhere you go. There's Jolly Pirates cruise, an all inclusive snorkeling trip to see a sunken pirate ship. De Palm Island is an all inclusive island off the coast with snorkeling as well too, but I think tourists go for Jolly Pirates usually because its a bit easier (you have to take a bus past the airport to get to De Palm Island).",
            "score": 2,
            "author": "Jeff-Van-Gundy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is amazing information... thank you! I looked up the Renaissance many years ago because of the flamingos but forgot about it.  I know Aruba sometimes gets a bad rap because of some isolated incidents many years ago, but I'm also an incredibly overcautious person and don't plan on being too social at night (not a club person by any means).",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a Marriott Stellaris in Aruba but it is upwards of $500 per night, but I have heard good things!",
            "score": 2,
            "author": "thaisweetheart"
        },
        {
            "level": 0,
            "comment": "I'm in the West coast, but I've heard that the East coast go-to is Bermuda or the Bahamas. Curious why these aren't options. Especially for a short trip",
            "score": 2,
            "author": "ingwarwick",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been surprised that these two, along with Mexico, haven't come up.",
                    "score": 1,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been to Ambregis Caye. We took a day trip on the ferry to Caye Caulker. But, either island, take an excursion to Lamanai. Mayan ruins. You'll get on the ferry from one is the cayes, then a bus, then a boat ride down the New River. If you like Mayan ruins, I highly recommend the trip.",
                            "score": 1,
                            "author": "ingwarwick"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look into Curacao or Puerto Rico. Curacao is not super expensive with beautiful blue water. Can relax at Avila Beach hotel and go out for drinks/bite in Pietermaai. Then a day seeing the beautiful beaches further up the island. Other places are in the beginning of hurricane season. You’re usually good in July. I like the relaxed vibes of Vieques island off of Puerto Rico. Could do 2 nights in main island of PR and 3 nights in Vieques. San Blas Islands in Panama are awesome but it’s not somewhere you stay. You explore by boat. Costa Rica has chill vibes but not the same beautiful water as a place like Curacao or PR. Lots of places in Aruba as well if you want to just get chill beach vibes with pool etc.",
            "score": 2,
            "author": "WNC3184"
        },
        {
            "level": 0,
            "comment": "Anguilla is the best island in the Caribbean. Best, uncrowded beaches in the world. Incredible dining options at all price levels. Locals are English speaking, as well as being warm and friendly. I have visited more than 20 islands and this one is unquestionably the best. Great place  to chill.",
            "score": 2,
            "author": "Turbulent-Whereas988"
        },
        {
            "level": 0,
            "comment": "Maybe Bonaire is a good option.\n\nAlthough not the cheapest option, but still doable. The island is laidback, not really populated compared to other Caribbean islands. You can dive, but even better, the coral and fish are directly when you enter the sea. Snorkeling is even enough instead of diving. Visiting NP Washington Slagbaai is also another option.\n\nOtherwise Barbados is a good option. Although populated. The West coast has many resorts. The East coast is more rugged and laidback. \nIn 2017 my SO and I stayed for a week in Silver Sands. We stayed at Milena &amp; Mark. You can find them on AirB&amp;B. \n\nIn both cases you do need a car to explore the island.",
            "score": 2,
            "author": "AnalUkelele"
        },
        {
            "level": 0,
            "comment": "Cartagena was a blast when I went last summer as a solo 20s woman. Plenty of beachy fun a cool sites around the city to round out the trip",
            "score": 2,
            "author": "krk737"
        },
        {
            "level": 0,
            "comment": "Corn Islands Nicaragua or Bocas del Toro Panama",
            "score": 1,
            "author": "SnooTangerines7525"
        },
        {
            "level": 0,
            "comment": "Holy Moly! I tried to share a couple of photos, but I'm not going down Imgur's hole",
            "score": 1,
            "author": "ingwarwick"
        },
        {
            "level": 0,
            "comment": "Interesting I can get to Europe all day long from under 2k$ with flight and hotel from the west coast of the US",
            "score": 1,
            "author": "Severe_Media_1361"
        },
        {
            "level": 0,
            "comment": "Aruba is cool, you can walk from end to end of the island in like 30 mins. Pretty safe for a tropical island, beautiful views.",
            "score": 1,
            "author": "PessimistsPeril"
        },
        {
            "level": 0,
            "comment": "Another vote for Aruba here. Last time I checked, there were direct flights from both Philly and EWR. There is Marriott and it is located walking distance from many shops, restaurants and bars. It’s right on one of the nicest beaches. Or get one of the snorkel boat trips that leave from near the hotel. \n\nIf you would think of renting a car, you could buzz up and down to the snorkling beaches and the donkey refuge. \n\nThe people there are super nice and an interesting mix of South American and Dutch.",
            "score": 1,
            "author": "gypsysinger"
        },
        {
            "level": 0,
            "comment": "Haiti",
            "score": -6,
            "author": "cnylkew"
        }
    ]
}