{
    "id": "13rjdkz",
    "score": 28,
    "title": "6 months travel - one Basecamp or 6 different cities",
    "author": "dare2travell",
    "date": 1685025129.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13rjdkz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Yo,\n\nJust wanna say love the sub, as a solo traveler love the stores / info\n\nAnyway just a thought. I want to learn web development and I'm taking 6 months off work to learn this. If I can or can't learn it is a different matter. \n\nI have a flight to Singapore then I either plan to rent for 6 months in Bangkok or rent a few different places for one month at a time.\n\nWhat are people's thoughts on this?\n\nI have travelled SEA before so I don't plan on doing a big backpack route as I'd like somewhere i could focus on learning most of the time.\n\nPro BKk 6 months.\n\nGet a nicer apartment for cheaper as it's a longer rent.\nCould still fly out to different countries once a month for visa run\n\nPros 6 cities in 6 months \n\nExplore more places, more cultures \nNever get bored as each month would be different.\n\n\nIdk not best list but what's everyone's thoughts, would you prefer have a home base and do smaller trips to other places or stay in 6 different places for the 6 months and if the latter which cities would you choose? \n\nObv I want to keep costs to a minimum as in going SEA as it's cheaper than England to live. \n\nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "It's really preference but it sounds like you're looking for focused study time with some travel - I personally would do a home base in Bangkok, find some nice rental condo with fast internet, do some travelling at the end of every month maybe. That helps keep costs low and it will help keep you in the study mindset.",
            "score": 37,
            "author": "shereboots",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye man that was my original thought tbh. Just wasn't sure how interesting it would be but if I'm just focusing on studying and their after each month do a bit of travel might be a good option",
                    "score": 4,
                    "author": "dare2travell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bangkok is definitely not the cheapest place in Southeast Asia, and I don’t think it will really affect you hopefully but be aware that Thai authorities do sometimes question if they see you’ve been doing multiple visa runs back and forth from Thailand. I have a mate that almost got banned from returning but he just stayed away for a month and it was okay.\n\nHave you considered Vietnam?",
            "score": 7,
            "author": "sockmaster666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unless I got a visa for Vietnam I would only get 15 days visa on arrival as I'm from the UK. \n\nU thought Bangkok was cheap when I was their that's why I was thinking if it. Lots of cheap food, good transportation links, good for flights in and out, 7-11 everywhere. \n\nNo beaches and less things to do but can get a good condo with pool/gym from what I've seen pretty cheap.\n\nI've been north Vietnam not south so don't know if HCMC is better than BkK",
                    "score": 3,
                    "author": "dare2travell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah okay fair point. \n\nBangkok is definitely cheaper than the UK by miles, I guess I was just comparing it now to when it was just a few years ago. When I went to Bangkok recently I was pretty surprised at how much more expensive it seemed, especially compared to their neighbouring countries.\n\nBangkok is definitely a lot more developed though. I liked Hanoi more than HCMC personally and Bangkok over HCMC for me but it may be worth checking it out. 15 day visa sounds like a drag though.\n\nBut if you feel Bangkok is well within your budget then go for it! At the very least it’s a good base to move around from. Are you looking for city life or a more chill, laid back environment?",
                            "score": 2,
                            "author": "sockmaster666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just somewhere that if I had a home base that was cheap enough to rent somewhere and then shoot off from, has convenience like shops, pharmacy, transportation, with other things to do during the week, gym.\n\nBut then last time I was travelling I was staying in hostels, which I wouldn't mind but I always feel you don't get much downtime to spend long periods of time in somewhere comfortable. So maybe a hostel with a good co-working space would be good.",
                                    "score": 3,
                                    "author": "dare2travell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’ve done SEA, then what were your favorite cities?\n\nHow many hours a week will you devote to studying, and will you be wanting to go out afterwards? Weekends? That would affect what I would do. If I just wanted a cheap place to study, I’d look for a place that had great internet, as cheap as possible and would allow me to be there on a 6 month visa. If I wanted to be traveling while learning- 6 month-long stays all the way. (In fact I might do a different continent like South America if you really wanted something new but I speak Spanish better than Thai!)",
            "score": 3,
            "author": "celoplyr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did consider south America however I don't yet speak Spanish, it is on the list to go for sure.\n\nMalaysia has 90 days visa free for UK so that's the longest I can think off. I've been KL don't know where else could be good their that's cheap, might look into it.",
                    "score": -1,
                    "author": "dare2travell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Both Langkawi in West Malaysia and Kuching in Malaysian Borneo are good options. Much cheaper than KL and both really amazing places. In Kuching you get the added bonus of it not being crazy overrun with tourists too",
                            "score": 1,
                            "author": "spicytravelzoe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would move around.  Even in Thailand, I'd try different areas (and did).  As others pointed out, Bangkok is great value but probably one of the more expensive areas anyway. \n\nHave you figured out your VISA limitations?  That's going to be a huge factor.",
            "score": 3,
            "author": "NoTamforLove",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well I thought I could enter as much and leave on visa free travel to Thailand but apparently they may question why I keep coming straight back. \n\nMy only issue I have with travelling as I always spend a few days in once place then move, especially in hot SEA weather it can take a lot out of you carry your backpack for x to y. When I want to focus more on learning with a side of traveling. But also don't want to be alone for 6 months so id like to meet people also. Maybe it's just too much to try and balance.",
                    "score": 2,
                    "author": "dare2travell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Well I thought I could enter as much and leave on visa free travel to Thailand but apparently they may question why I keep coming straight back.\n\nOnline forums are littered with posts from people who get warned or denied entry after multiple visa runs in Thailand. I recall one here on Reddit within the past few months where someone had an apartment in BKK with all his shit and he was denied entry attempting to do a visa run.\n\nNot the most pleasant life.",
                            "score": 6,
                            "author": "YuanBaoTW"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would personally go to 6 different places. But, my comment is actually that this sounds like such a great idea! Maybe I should do this, I’m ready for a change of career…",
            "score": 3,
            "author": "swink386",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha so am I mate, that's why I'm doing this, cheaper than stay at home and get to see the world whilst I learn. Also I want to learn web development to work remotely and this could be a good way to see what it would be like",
                    "score": 1,
                    "author": "dare2travell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you been to chiang mai? It’s cheaper than bkk, has enough things to do, and has an international airport.",
            "score": 3,
            "author": "Just_mad18",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did love chiang mai, however does make visa runs more expensive is the only downside.",
                    "score": 1,
                    "author": "dare2travell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about like 3 months, each in a different country. And then last 3 months in Bangkok. Like split it up. That way u can have a bit of both worlds. For where to go, idk cuz I've never been to SEA, but I hope u have a good time!",
            "score": 5,
            "author": "bookandbark",
            "replies": [
                {
                    "level": 1,
                    "comment": "True could split it up a few ways, I was more thinking I'd would be cheaper to get a 6 month lease, so if I do 3 and 3 might be more expensive or just as expensive as 6 separate months.",
                    "score": 2,
                    "author": "dare2travell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure how much it'll make a difference.",
                            "score": 2,
                            "author": "bookandbark"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably going to say the opposite of what most recommend but I would move around. Obviously it is more expensive but the vacation/visit aspect of it can help you pace yourself as you’re learning. There’s so much info one can take in daily or everyday all the time. It would be different if you knew what you were doing and had a project where you can work all day straight, but when it comes to learning I think taking breaks to do some sightseeing and let yourself absorb the concepts and skills you spent 6h the day before learning is better. But need to be disciplined and remain constant with the learning schedules",
            "score": 2,
            "author": "nomadlaptop",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye Im not sure if travelling backpacker style would help when learning however I suppose at night times it would mean I have something to do every night. \n\nThanks for advice",
                    "score": 1,
                    "author": "dare2travell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you should have a base...but not in bangkok. Its lovely there, but only for a short, short time.",
            "score": 2,
            "author": "Useful_Use_7727"
        },
        {
            "level": 0,
            "comment": "Visa runs are more or less illegal (iirc in every country btw), you're risking a lot by even entertaining the idea.\n\nIn which case separate countries would be my solution.",
            "score": 2,
            "author": "AidenHero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why is it illegal to leave a country and return? Or is it more if you leave for 5 hours and return it may look dodge",
                    "score": 1,
                    "author": "dare2travell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "illegal isn't quite the right word, cause you're not even supposed to get into the country. \n\nIt's more like the border guards are supposed to deny you, if you're circumventing visa rules. \n\nThe big idea is that to stay longer, you're supposed to apply for a long-term visa. \n\nI'm not intimately aware of thailand visa restrictions, but of the other countries i know, they don't want you staying in the country longterm without the proper paperwork. A flight in then out, every month to try and stay for 6 months(or indefinitely), is effectively just longterm staying without filling out the proper paperwork. \n\nOther countries will just set it up so that you cannot stay more than 90 days in any 180 day period(and will sometimes deny you if they think you've spent too much time in that year), but SE asia countries give the liberty to the border agents. \n\nYou're thinking of it as more of a \"loophole\" or a \"cheat\" to stay in a country indefinitely, but countries do try to stop people from cheating the system and staying indefinitely in their country.\n\nThe big issue is you're gambling with a lot, and can get colossally fucked.",
                            "score": 2,
                            "author": "AidenHero"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "when i was solo traveling around the world bangkok organically became my 'home base' between countries. i would stay anywhere from a few days to a few weeks. i was living out of a suitcase and my only \"job\" was to live, explore and travel so i didn't need a proper space abroad, but if i did i'd definitely choose bangkok! it's super affordable, people are beyond lovely, food is something i miss everyday, it has everything for everyone. and, of course, it's a massive travel hub!",
            "score": 1,
            "author": "wanderlush21"
        },
        {
            "level": 0,
            "comment": "KL is a good city as a base too",
            "score": 1,
            "author": "NachoMuncher94"
        },
        {
            "level": 0,
            "comment": "have you considered maximizing optionality by doing a shorter lease and renting month to month? sure it’ll be more expensive, but it shouldn’t be more than 50%. and it’s probably cheaper than where you’re renting currently anyway. \n\nbkk, hcmc, phuket, hanoi - these are all great cities!",
            "score": 1,
            "author": "TheBigShort00"
        }
    ]
}