{
    "id": "13rkuyp",
    "score": 10,
    "title": "(First time) Solo-Travelling in Tanzania in September",
    "author": "Zzzaino",
    "date": 1685028751.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13rkuyp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everybody, I'm (25M) planning to solo-travel Tanzania and Zanzibar in September for 20ish days, with the first 7/8 days in the mainland doing a Safari and the remaining giving myself the freedom to explore the island(s).\n\nI've thought about gettin a flight into Arusha airport (price-wise and time-wise it's better than arriving in Kilimanjaro or Dar Es Salaam), without having previously booked the safari. Then after a brief recover from jet-lag I'd start to look for the safari I have in mind.\n\nNow, after the safari I've thought about leaving the mainland to get to Zanzibar and that's where I'm a bit stuck on the how-to. Should I wait to book a plane to Zanzibar, just in case I decide to stay longer? Should I get there with the ferry (from Dar)?\n\nThe other main dilemma is what to focus on once in Zanzibar or rather how to optimise the time I have (10 day circa); assuming I'm not inflexible about what to see (again, I really want to explore as  much as I can) these are some of the hotpoints I wrote down:\n\n* Stone Town\n* Prison Island\n* Nakupenda\n* Pange\n* Jozani Forest\n* Mnemba Island\n* Mafia Island\n\nDo you any advice on how to structure my visit, also tips on how to get around (Dala-Dala, Taxis, Ubers)? Do you think I'm missing something? \n\nAny advice/thought is appreciated. Thank you guys in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Do SAfari first if you are expecting a bit of jetlag. It is a lot of just cruising around and waiting for your driver to point stuff out. Good time to rest before doing Kili. Arusha is basically a Kilimanjaro airport, but also between the Safari Parks and Kili.  Check your flights often, we had a flight decide they wanted to reroute the day before from Kili to Arusha instead. Kilimanjaro airport is like an hour south while Arusha is two hours west.  It is also a pretty drive. If you do Kilimanjaro expect 7 days, 5 if you are in good shape. If you do Kili, do Zanzibar afterwards to be able to to relax on the beach.  Stone Town is the old town of Zanzibar City.  Just use the Tuk-tuks, or whatever they call them there if you are by yourself.",
            "score": 9,
            "author": "techietraveller84",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I was in fact thinking of focusing on the natural parks (Tarangire, Serengeti and Ngorongoro) more than Kili. Do you think I’ll be able to fulfill everything on the list in Zanzibar or I’m a little bit too hopeful?",
                    "score": 1,
                    "author": "Zzzaino"
                },
                {
                    "level": 1,
                    "comment": "Thank you! I was in fact thinking of focusing on the natural parks (Tarangire, Serengeti and Ngorongoro) more than Kili. Do you think I’ll be able to fulfill everything on the list in Zanzibar or I’m a little bit too hopeful?",
                    "score": 1,
                    "author": "Zzzaino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't help you with that. I just know stone town. It should only take a couple days.",
                            "score": 1,
                            "author": "techietraveller84"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in Tanzania this March. \n\nIf you're climbing Kili, it's going to eat up at least a week of your time (can't tell by your post if you are or not). \n\nI really liked the Arusha airport - it was very chill. It's tiny (and so are all the planes that take off/land from there, as it's a domestic airport). We flew out of there after safari to Zanzibar. \n\nI recommend doing your safari first, and then heading to Zanzibar. Even though safari is basically driving around in the car all day, it wears on you. The roads can be terribly bumpy - and after hours and hours of this - and days and days - you'll have had your fill! You'll be wanting some beach time, even if you are not a 'beach person.'\n\nI also highly recommend booking the safari ahead of time to get what you want - i.e. the itinerary you want/what parks you want to see, the level of lodging you want, and the vehicle you want. The vehicle is pretty important - I HIGHLY recommend going with a Land Cruiser vs. a  mini van -it's more expensive but you'll be much more comfortable. \n\nIn Zanzibar, we did Stone Town, Prison Island, and just hung out at the resort, but we only had 3 days. \n\nAs for transportation, my safari tour operator booked our Arusha &gt; ZNZ flight, and had ground transportation lined up to collect us to/from the airport in Zanzibar. While we were there, we just asked our driver who picked us up from the airport if he wanted to be our driver to Stone Town the next day (we were staying in the northern part of the island, so it was like an hour away). Our driver also put us in touch with a boat operator - I had researched what the price was to go to/from Prison Island, so I told him exactly what I wanted to pay and it was all good. I'm pretty sure Uber isn't a thing in Zanzibar. \n\nHave fun!",
            "score": 2,
            "author": "swissmissys",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much, I don't think I'll climb Kili, even though I hope i'll not regret it. What website did you use to book the safari?",
                    "score": 1,
                    "author": "Zzzaino"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to Tanzania. You can arrive in Arusha through Arusha airport/Kilimanjaro international airport, Arusha airport is a small airport and close to the city. Taxi available from the airport, you can arrange in advance. In Zanzibar most activities can be booked with a travel company, hotel which your staying. Mnemba island is the best beach in Zanzibar, you can stay 3 nights in stone town for prison island, stone town visit. Visit mnemba island for 2 nights and stay in pongwe for jozani forest. You will have to fly to Mafia island for whale sharks and diving activities.",
            "score": 2,
            "author": "True_Independent_714",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I'm already excited. Do you think that a flight to Mafia Island + 3 days there are worth it?",
                    "score": 1,
                    "author": "Zzzaino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's worth it but try to add more time while in Mafia. As for safari it's best if you book in advance because of airport transfer and to have sorted out early after your arrival, next day safari and after fly to the islands.",
                            "score": 1,
                            "author": "True_Independent_714"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You seem to have figured it out fairly well. I don't think there's much need to book your Arusha - Zanzibar flight in advance. I did mine just a few days ahead and got it for like $35 (that's unusually low though). If the price gets too high then you can just take the bus called something like Kilimanjaro express to Dar then get the ferry to Zanzibar from there. And yes dalla dalla is a good way to get from town to nearby town. Within a town you can pick up a motorbike or tuk tuk.",
            "score": 2,
            "author": "No_Windy_Corners",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also as a general tip I'd recommend you don't book anything online except flights and negotiate basically all prices for anything. ATM withdrawal fees are high in Tanzania so I'd recommend you bring a load of USD and change it while there. Even if you're not on a tight budget I'd recommend it because it helps prevent people profiting from price gauging",
                    "score": 3,
                    "author": "No_Windy_Corners",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's really good advice, I guess I'd better prepare to split all the cash into small amounts and spread it around my bag, hopin I won't forget where tho",
                            "score": 1,
                            "author": "Zzzaino"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks, that's exactly what I was hoping to hear. Since I wanna leave myself a lil wiggle room to change plans I didn't wanna book the flight Arusha-Zanzibar too soon, but I was a lil scared that planes would be already sold out.",
                    "score": 1,
                    "author": "Zzzaino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Should probably mention that my flight was Z-A not A-Z. No idea if there's more demand one direction or another",
                            "score": 1,
                            "author": "No_Windy_Corners"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, It's good to start with safari. 7 to 9 days are enough to explore the famius Northern parks. After safari you can fly to Zanzibar for relaxing days. I am local and live in Arusha. I can help you to plan your whole trip, so you don't need to hassle thinking how you should move from one point to another, etc...I can propose an Itinerary that suits your interests and budget based on the period of the year you plan to come.\nYou can send me a PM",
            "score": 2,
            "author": "glory1812"
        },
        {
            "level": 0,
            "comment": "For Safari you can do either in Northern circuit to visit Tarangire, Ngorongoro and Serengeti) or Southern circuit to visit Nyerere National Park, Mikumi and Ruaha.\nIf you do safari in North, you should use Kilimanjaro Airport and after safari you can fly out Serengeti to Zanzibar or come back to Arusha to take a flight to Zanzibar, it depends on your budget. Your departure flight should be from Zanzibar Airport.\nNorthern parks are a little bit expensive compared to Southern parks.\nIf you would prefer to do Southern parks, the best Airport to use is Dar es Salaam. 7 to 9 days are enough to explore these off-the beaten Southern parks. The Southern parks are less famous and therefore they are cheaper compared to Northern. If you are looking for a park with less crowds, true nature, look no where than Southern parks.\nLet me know your interest and I'll come back to you with a great itinerary suggestion.\nThanks",
            "score": 2,
            "author": "glory1812"
        },
        {
            "level": 0,
            "comment": "Kilimanjaro is as crowded as Central Park on a summer day.  I would suggest hiking Mt. Kenya instead.  Either way enjoy!!",
            "score": 2,
            "author": "satonahottinroof",
            "replies": [
                {
                    "level": 1,
                    "comment": "And for the rest of your life, when you tell someone you climbed a mountain in Tanzania they'll ask, \"Kilimanjaro?\" and you'll have to answer - \"no, the *other* one\".",
                    "score": 3,
                    "author": "BrazenBull"
                },
                {
                    "level": 1,
                    "comment": "I was thinking of coming back another time to focus only on Kenya, but I always feel like there’s too much to see in this world and so little time",
                    "score": 1,
                    "author": "Zzzaino"
                }
            ]
        }
    ]
}