{
    "id": "13txrrr",
    "score": 3,
    "title": "Solo female travel to Beijing after COVID?",
    "author": "littletomato93",
    "date": 1685271993.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13txrrr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone!\n\nMy previous post got deleted due to low effort so gonna try to be more detailed. \n\nI (29f) have decided to travel Bangkok between 11-29 of July. While at it, I have decided to travel to Beijing also, seeing there was my dream. \n\nI did some research and lots of blogs didn’t necessarily mention about whether if it is hard to navigate in the city as a tourist or not. The ones said that it was easy, was rather old. They suggested to use subway as it was quite advanced. \n\nBeing the anxious person as I am, I have contacted with one of my friend who lives in the city. She was quite sceptical, she said that there were lots of racism after COVID, and even hailing a taxi is impossible for a tourist as it requires a Chinese wechat pay, which you can’t download without a residence permit. She suggested me to visit Hong Kong or Shanghai instead, but I have already visited Hong Kong and I wanted to see Beijing for forbidden city, summer palace, the Great Wall etc. \n\nSo I’m torn and i thought that it would be really helpful to hear the experiences of the tourists who recently had been there.",
    "comments": [
        {
            "level": 0,
            "comment": "OP appears to have requested personal experiences from (women/people of color/LGBTQ+ travelers). If you are not a member of the requested demographic, please carefully consider whether your post will add value to the conversation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The Beijing Metro is very easy to use. Pretty much every significant tourist attraction is within walking distance of a station. They have tons of lines and everything is signed and spoken in English as well. I don't speak any Mandarin and had zero issues getting around. I never had a need to take a taxi as the Metro is so large. It even connects to both airports. The Great Wall is probably best visited as part of an organized tour through your accommodation. I picked a more distant but much less crowded section (Jinshanling). They drop you off at one section and tell you that they'll pick you up at another section in X number of hours and then you're free to explore on your own.",
            "score": 7,
            "author": "Varekai79"
        },
        {
            "level": 0,
            "comment": "you can pay taxi by CNY.wechat or alipay is not necessary after covid now.\nIn addition, scenic spots such as the Summer Palace and the Forbidden City may need to be booked in advance, but I don't know how to make a reservation for foreigners.",
            "score": 3,
            "author": "Then_Ad_7841",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reply! Do you have any idea about using subway as a foreigner?",
                    "score": 1,
                    "author": "littletomato93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except for the problem of real-name ticket purchase mentioned by other users, there is nothing else, as long as you don't take the wrong destination. In addition, Google Maps is not available in mainland China, and domestic mainstream electronic map clients (AMAP, BAIDU MAP, TENCENT MAP) do not seem to have an English version.",
                            "score": 2,
                            "author": "Then_Ad_7841"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of the information on this thread is a little outdated from pre-COVID - I spent 6 weeks in China in March and April as a non-Chinese national, and these are some of my thoughts re: logistics. \n\nThe switch to digital payments is real and you are going to have a hard time in some areas with just cash. Taxi cabs that you hail will take them, but it completely locks you out of a bunch of Alipay/Wechat services. At most restos, for example, you'll order on your phone on Meituan via Alipay or Wechat pay, and cabs called on Alipay are cheaper. \n\nBig issue with the Beijing metro specifically - if you do not have a mainland Chinese ID it is functionally impossible for you to buy a single use token/ticket for the metro. You HAVE to use Alipay. The little kiosks at each station will ask you for your name and \"shenfenzheng\" (national ID number) in order to purchase and you will not be able to override that. This wasn't the case pre-COVID, but they set up this system during zero-COVID in order to link people's health codes to their public transport journeys for case tracking. When I was in Beijing the first two days before fully setting up Alipay, it was really frustrating being locked out of system. If you have a friend who's got all that set up for you then you might be able to get around it, but you still won't be able to get on the Beijing metro. There's a process to order a Yikatong, which is the physical Beijing metro card, but last I checked the process to get one as a foreigner was pretty onerous. You'll be able to get on the metro in some other cities with just cash (e.g. Guangzhou,) but the Beijing metro as of last month was definitely not really feasible for a foreigner without Alipay set up.",
            "score": 3,
            "author": "starsinblack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many thanks for the info! Is it hard/not possible for foreigners to get an Alipay? I’m also curious how you were able to solve logistics problem as it is impossible to use subway as a foreigner? Thanks a lot one again!",
                    "score": 1,
                    "author": "littletomato93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can get Alipay as a foreigner, but you'll need to link your passport to it. Certain services won't be available if you can't link a Chinese bank card (e.g. the bikes) but you can link a foreign credit/debit card that can be used for basic QR code payments and metro/bus/taxi services. I'd recommend linking a Wise or Revolut that converts more transparently than a standard card that might charge fees for use in CNY/RMB.",
                            "score": 3,
                            "author": "starsinblack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a bit inconvenient but doesn’t seem impossible! Many thanks for the tips, I am quite relieved and will book my flight as soon as possible 😁",
                                    "score": 1,
                                    "author": "littletomato93"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}