{
    "id": "13us0tm",
    "score": 66,
    "title": "Struggling to finish my trip",
    "author": "Zealousideal_Owl9621",
    "date": 1685359136.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13us0tm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've seen people post these sort of rants quite frequently and I never thought that would be me, and yet here I am. I'm at the tail end of a 9 week solo trip though Portugal and Spain. I have hit a wall in Madrid. \n\nThis isn't a question, as it's more just me just struggling to come to terms with where I'm at mentally. Madrid has been very difficult to enjoy as a solo traveler aside from the incredible museums and parks. The atmosphere here is all about being social in the vibrant tapas bar scene and nightlife. The language barrier here for non-Spanish speakers is difficult, and I've had multiple instances of being misunderstood and either receiving the wrong food, awkwardness, or being treated poorly or totally ignored. I'm in a hotel, so no social opportunities there. Guy in the next room has the smokers cough from hell. \n\nTo be honest, I'm struggling to muster the energy to do anything here. I've enjoyed the last two months of my trip immensely. I loved the 5 weeks I spent in Portugal. I loved the 10 days I spent in Andalusia.  \n\nNow I'm here in Madrid for the next four days before my return flight trying to dig deep to actually go out and do stuff. I don't know why this is such a struggle after the rest of my trip has been (for the most part) so fantastic. Travel burnout? Maybe. But I just feel very low right now, self-doubt and anxiety, which is discouraging me from even leaving my hotel. I'm not sure why this is creeping in at the very end.\n\nHas anyone else ever taken a trip for multiple weeks or months and just crash landed at the end?\n\nEdit: I am in no way blaming Madrid or the culture here. It's a beautiful city and I've enjoyed walking through the parks and visiting the art museums, and I've met some very kind people. I can acknowledge that my negative headspace combined with my more introverted nature is making it more challenging. Thanks for the helpful feedback and comments!",
    "comments": [
        {
            "level": 0,
            "comment": "Take others advice on stuff to do, or do nothing and rest. Both choices are ok. Crash landing at the end of a long trip is pretty normal, as is some people who pile a weeks worth of stuff into three days. Whatever makes you happiest at this moment in time.",
            "score": 68,
            "author": "Publandlady",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right. I absolutely hit a wall in Barcelona around maybe the 6-week mark of constant going, going, going. It’s hard when you’re facing a language barrier and constant stimulation—nothing is as easy as back home would have been. Don’t feel guilty about getting some rest. And see if they can switch your hotel room, that sounds awful.",
                    "score": 16,
                    "author": "faith00019"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go for a massage, you can book it online, so no misunderstandings. Go have a walk around malasaña, tons of little shops and patios to explore. Go to my favorite restaurant: Kitchen 154 in mercado de vallehermoso. They only have like 5 dishes, so no chance for much mistakes, and they are very nice.\n\nHelps not to have much expectations and just explore. But if you are depleted, it’s also good to just rest and recover.",
            "score": 47,
            "author": "IndustryTasty9955",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good ideas and thanks for the rec!",
                    "score": 14,
                    "author": "Zealousideal_Owl9621"
                },
                {
                    "level": 1,
                    "comment": "How much does an average 1 hour massage cost in Madrid?",
                    "score": 1,
                    "author": "Garnservo97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have spent a couple mornings just hanging out in my hotel, either playing something on my switch or watching something on my phone. It's such a nice way to recharge and it's important. I couldn't be out doing things all day every day, i don't think anyone can",
            "score": 21,
            "author": "killbeam"
        },
        {
            "level": 0,
            "comment": "Just here to say that maybe Madrid isn't your vibe. I went there just recently during my 6 months abroad and really didn't enjoy myself either. It felt really difficult as a solo traveller, as mainly it's big groups of locals or tourists going out for tapas, bars, nightlife etc and I really struggled to find a group of friends compared to other Spanish cities I've been too. This is despite staying in a hostel. I'm sure Madrid is enjoyable for a lot of people, but it just wasn't for me. Also, factoring in travel burn out and its no wonder that you're struggling a bit, perfectly normal.",
            "score": 19,
            "author": "ActualAnxiety",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. You get it. I appreciate the thoughtful comment.",
                    "score": 6,
                    "author": "Zealousideal_Owl9621"
                },
                {
                    "level": 1,
                    "comment": "yup. Madrid is not the best place for solo travel. can definitely agree.",
                    "score": 3,
                    "author": "woundedviking"
                },
                {
                    "level": 1,
                    "comment": "Just jumping in here but I felt the exact same way when I was in Madrid, yet I enjoyed Barcelona immensely - out of curiosity, did you have a chance to go to Barcelona/also feel differently about it than Madrid?",
                    "score": 2,
                    "author": "sandwichscouter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did not go to Barcelona, cost being one of the reasons. Prices for accommodations there are bonkers right now. I was able to find a decent place in Madrid for half as much. I was in Granada before I came here and absolutely LOVED it.",
                            "score": 2,
                            "author": "Zealousideal_Owl9621",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No way - I also loved granada haha, it felt like paradise. Granada and Barcelona were my favorite cities during that trip.\n\nI hope you’re able to make the best of the remainder of your time in madrid :)",
                                    "score": 2,
                                    "author": "sandwichscouter"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take a day trip to Toledo via train; go dancing; take a bus ride to the mountains for a hike. No need to sit in a tapas bar every evening if you’re not enjoying it.",
            "score": 62,
            "author": "hoyasaxa_2017"
        },
        {
            "level": 0,
            "comment": "Yeah. If I feel like that for more than a few hours, it’s a sign to change something. I would figure out how to make the remaining time enjoyable, whether it be changing accommodation, chilling out in a nicer hotel, or even changing cities. For me it’s either gut instinct or passing anxiety. If it’s passing anxiety, it disappears quite fast. If it’s a gut instinct, it’s a sign to change something",
            "score": 10,
            "author": "rubysunshine999"
        },
        {
            "level": 0,
            "comment": "So I recently took a trip for 2 and a half months and I totally get what you're saying. Not every place is going to be great. By the end of the trip I had to experience snowfall and I'm a guy who hates cold weather and that caused me to stay in my room for days and just getting food and stuff. I think it was also a good thing that the last destination was not great because then I would just have never been able to go home happy. So maybe it was a blessing in disguise.  \n\n\nAlso, during traveling keep in mind that what you're doing is being open to new experiences and not just being open to new GOOD experiences. Make sense?",
            "score": 11,
            "author": "themodestnomad"
        },
        {
            "level": 0,
            "comment": "9 weeks is a long time to travel. Sounds like burn out.",
            "score": 25,
            "author": "DJAlaskaAndrew"
        },
        {
            "level": 0,
            "comment": "I got burnt out around the 9 week mark of the trip I'm currently on. I took a break for a week and just chilled in an airbnb doing nothing. It was great. Since ur trip is almost over, take a day or two to chill. Then go do something fun like what other ppl mentioned.",
            "score": 13,
            "author": "bookandbark"
        },
        {
            "level": 0,
            "comment": "I did a food tour in Madrid that is admittedly a total tourist thing but was all Americans so it was nice to be around people I could talk to. They were great, interesting people so it was a highlight and eased some of the feeling of being so alone. I figured, hey I am a tourist so I might as well embrace it and I’m glad I did - it gave me some people to eat and drink with and some really fun experiences.\n\nI also moved from a so-so hotel to a nicer one and that made a huge difference - slept better, staff was nicer, could get laundry done, etc. \n\nI didn’t worry about going out late, unless that’s your thing. Honestly I couldn’t keep up w Madrid. I ate dinner late and then I was done. No guilt about going to bed at midnight bc I want to be able to be out &amp; about the next day. \n\nOverall I liked Madrid but did experience some of passive-aggressiveness from a few people pretending not to understand my order, ignoring me or making less than favorable comments about tourists/Americans/our personal attributes that they thought we couldn’t understand. My son joined me for the last few days I was there and while my Spanish is functionally basic, he is completely fluent so that surprised more than a few people. \n\nI hope you’re recharged and can maybe just wander and enjoy looking at the sights of Madrid. One of my best afternoons was sitting in the window of Starbucks, eating a jamon sandwich, looking out at the city and the people and just reveling in it all. But it sounds like you’ve had an amazing trip and yeah, I think it would be normal just to be tired, wherever your last stop happened to be.",
            "score": 3,
            "author": "aspecificdreamrabbit"
        },
        {
            "level": 0,
            "comment": "I did 4 days in Madrid and that was plenty, even going with my friends. Genuinely just wasn’t a fan of the place for some reason. Lisbon in Portugal however, I did 6 days there and felt like I wanted to do another whole week there",
            "score": 4,
            "author": "dinotoxic"
        },
        {
            "level": 0,
            "comment": "I recently travelled solo to Madrid so I get what you mean, a few things that helped me:\n- Do the touristy things, it’ll be so busy that no one will notice you’re by yourself. I particularly liked going to Chocolateria San Gines, one of the guys helped secure me a table when I was apprehensive about getting one for just myself\n- Go to food markets for lunch and eat at the stands \n- Eat at the busy areas like Plaza Mayor or near attractions. Yes it’s a little overpriced but honestly the food I had there was pretty good, and they speak perfect English \n- Book a tour, be it a food tour or a day trip to Toledo/Segovia \n- If you’re interested, watch a sports game or a bullfight",
            "score": 7,
            "author": "Adrian_Healey"
        },
        {
            "level": 0,
            "comment": "I personally hate Madrid, but that stems from living there for 11 years. Search Facebook for \"expats in Madrid\" groups and I'm sure you'll find plenty of English speaking social mixer events where everyone is welcome. Go to Mercado de San Miguel and there will be TONS of other tourists who are usually very open to meet people (but be extremely careful of your wallet!!!). If you still have another week, don't miss Sunday morning vermut at Lavapiés, maybe starting at Mercado de la Cebada. Just walking by the neighborhood you will see plenty of bars of all kinds bursting with people, and again, if you're open to bar banter you almost have to actively try to NOT meet new people.",
            "score": 6,
            "author": "Four_beastlings"
        },
        {
            "level": 0,
            "comment": "It’s only four days… you really don’t have to force yourself to do anything you don’t want at this point. Stay in 1-2 days and see if by the third day you have enough energy to do something. Even if you stay in all four days at this point you’ve probably done enough traveling.",
            "score": 3,
            "author": "Substantial-Past2308"
        },
        {
            "level": 0,
            "comment": "I had the same experience in Madrid and Barcelona. Everything is based on groups. In fact, I was refused restaurant seating twice, and only allowed a standing table outside another, to reserve the space for multiples. I understand the economic reason, but it was embarrassing and disheartening as a solo traveler.\n\nI have been fortunate to travel extensively, including countries in which I did not speak the language well or at all, and never had to psychologically push myself through a trip like I did in those cities. I will try Spain again, but this time to the south, which friends assure me is very warm and welcoming.",
            "score": 3,
            "author": "MindTraveler48"
        },
        {
            "level": 0,
            "comment": "This happened to me as well.  It seems I learned something about myself.  I need to be mentally challenged with puzzles to solve daily.  I don't think I could last in a leisurely life for long.  I would need to find a project or hobby.  When this happened to me, I  couldn't wait to get back to work 😀.  \n\nThis fits a pattern.  When I was young, I would be miserable after 4 weeks off in the summer.  One time I just started going to my middle school's print shop to help out with anything.  I learned a lot about the print biz.\n\nAt this point, when I retire, I think I will try to learn a foreign language while in that country (e.g. Japan).",
            "score": 3,
            "author": "JesusChrisAbides"
        },
        {
            "level": 0,
            "comment": "Next time you know to stay in Portugal only ;)",
            "score": 8,
            "author": "tentativa-1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually considered doing that. I loved Portugal. Lesson learned. 😁",
                    "score": 6,
                    "author": "Zealousideal_Owl9621",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Last fall I took my first trip to Portugal and really enjoyed it too. I felt like Lisbon was a bit like Amsterdam with all the tourists there to drink and party, but like Amsterdam I found ways to enjoy my time without spending too much time in the drunk and rowdy areas.  \nThen I went to the Algarve and I could have been there for a month or more without a problem. The whole coast was worth exploring and with only 10 days there I wasn't able to see or do as much as I wanted. I loved Lagos and Portimao and liked Faro for being such a good transit point to see the rest of the coast. The train to the Spanish border was quick and fun. I will be back, I haven't seen Porto yet or many other places inland.  \nI wanted to add Spain to my trip  but couldn't figure out how to do it and still get the time I wanted in Portugal. I still hope to see Spain one day but Portugal will be part of any Iberian peninsula trip as well.",
                            "score": 6,
                            "author": "JorgeXMcKie"
                        },
                        {
                            "level": 2,
                            "comment": "Come back any time friend. Portugal is very small but there's so much to explore.",
                            "score": 4,
                            "author": "tentativa-1000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can relate so hard! Take a day or two to allow yourself to stay in and do nothing, maybe call a friend or loved one if that helps you reset. It’s not realistic to expect yourself to do something constantly when you’ve been out for 2 months already",
            "score": 2,
            "author": "Bitter_Theory5467"
        },
        {
            "level": 0,
            "comment": "Hit mine recently at about the 6 week mark and I just used a couple rest days to get back to normal.",
            "score": 2,
            "author": "Mighty_Moo94"
        },
        {
            "level": 0,
            "comment": "The last month of my 3 month trip, I rented a short term apartment and pretty much just lived my normal life. I was tired after 2 months of amazing nonstop tourism. The last month I did have a nagging sense of guilt - I stayed in and watched a lot of netflix lol - but I don't regret anything, I got a different kind of cultural immersion just living my regular life but in their streets, with their foods, surrounded by their language.\n\nYou've done enough. I think you can just let go and relax. Stay in and watch some TV. Go to the park and soak in the foreign language all around you. Don't feel bad for being alone in a social city; you're a traveler, you're here for a few days, it's perfectly normal and OK.",
            "score": 2,
            "author": "circleen"
        },
        {
            "level": 0,
            "comment": "Congratulations, you are a traveler, not a tourist.",
            "score": 2,
            "author": "818a"
        },
        {
            "level": 0,
            "comment": "There's nothing wrong with staying in, sleeping late, watching TV, ordering takeout. Rest and relaxation is important.",
            "score": 2,
            "author": "harmlessgrey"
        },
        {
            "level": 0,
            "comment": "OP, i’m curious - were you doing something everyday (eg going out) for the entire 9 weeks? i’m barely 5 weeks into my trip, and some days i do absolutely nothing, except for going out for lunch and dinner, just to recharge my batteries.",
            "score": 2,
            "author": "TheBigShort00",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've had a couple of \"do nothing\" days and they've helped. Sometimes it doesn't matter where I am and I just need a day off. Madrid has felt different. It just feels like a really bad date that I'm stuck with for a few days. She's pretty to look at, but has an intractable personality that I'm not vibing with.",
                    "score": 3,
                    "author": "Zealousideal_Owl9621",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know that feeling especially in a date setting! Hope you're able to find some ways to enjoy the remainder of your trip. Safe travels!!",
                            "score": 2,
                            "author": "TheBigShort00"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes I crash landed at the end of a trip! I was travelling Laos and Cambodia. At the end of the 3 weeks and after 2 long days of biking around Angkor Wat, I crashed in my hotel room for my last 2 days and just completely relaxed… slept, showered, went out to eat and came back. Take care of yourself and do what you want! Solo travel means you’re the boss.",
            "score": 2,
            "author": "warmmagicbag"
        },
        {
            "level": 0,
            "comment": "Try Toledo, I liked that a lot more",
            "score": 2,
            "author": "darcenator411"
        },
        {
            "level": 0,
            "comment": "Not sure if this helps at all but when I solo travel, I’m either hiking long distances (extremely physically stimulating) or I’m attending music festivals (another stimulating experience). I’ll mix in an odd day off in a town between festivals but man are those days boring. I’ll do the museum day here or there but I feel those experiences, along with just ambling around cities, I’d rather have an acquaintance. If you’re just running around parks and museums, to me it seems like a no brainer you’d get bored. \n\nDo you have a passion or hobby outside of casual meandering? Music? Film? Dance? Reading? Writing? I would say choose one here and there and emphasize it to the max on your travels.",
            "score": 2,
            "author": "Witty-Carpet4189"
        },
        {
            "level": 0,
            "comment": "Not sure if that's going to help but there are a few absolutely stunning day-trips you can do from Madrid.. It'll take you away from the city that doesn't vibe with you (at least right now). It'll let you do relatively little as you'll be sitting in a train 2-4h (total) and at least I found the places absolutely impressive, leaving little room for other thoughts. (if you're into historic architecture).\n\nAlso consider rebooking/double-booking a night or two at a hostel so you can meet some people.. If that's not an option just hang out at the hostel bar, people are more open to talk, will likely speak English and prices are usually reasonable. The same can be done with guided tours.. It takes a little more strength as you're on a 1-2h timer... but if there's someone you managed to talk to during the tour, doesn't hurt to ask if they're up for a coffee afterwards or if they're interested in doing something together tomorrow. \n\nSome options for day trips are: Toledo, Segovia, El escorial, Aranjuez, Avila. For the day trips if you want some company, maybe look into an organized trip it'll be a bunch of people stuck in a bus.. If you think you'll be able to initiate contact that at the very least should give you some social contact as well.\n\nLast and not least: Sounds like you've been going 110% for the last 6 weeks.. maybe you just need to catch up on sleep and rest.",
            "score": 2,
            "author": "BerriesAndMe"
        },
        {
            "level": 0,
            "comment": "Nothing wrong with hitting the wall while traveling. I've been on the road for 5 months now and usually \"burn out\" once every other week or so. I will get McDonald's and relax in my hotel room until morale improves and I'm ready to roll again. It usually only takes half a day.",
            "score": 2,
            "author": "anonymousguy202296",
            "replies": [
                {
                    "level": 1,
                    "comment": "Curious where you've been traveling where a half-day McDonald's recharge is all you need. 😂",
                    "score": 1,
                    "author": "Zealousideal_Owl9621",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "South America",
                            "score": 1,
                            "author": "anonymousguy202296"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My suggestion is when you make a trip, know where your limits are. I see people here doing two and three months vacation and even the occasional person doing a gap year vacation. I couldn't do that. I know after 4 weeks I want to go home and sleep in my own bed. Next time maybe split it up if you want to travel the full 9 weeks. Do 4 weeks and then do another 5 weeks later in the year. That way you will enjoy all of both trips. \n\nI do agree with all the posts that are saying take a day or two and do nothing. It may feel like a wasted do but when you are on the road for a long period of time you have to recharge now and then.",
            "score": 2,
            "author": "Lord_Muramasa",
            "replies": [
                {
                    "level": 1,
                    "comment": "One thing I've learned is not to worry about \"missing\" anything. It's more important to be able to pay attention to and absorb what's in front of you and around the next corner. Because, no matter what, there's always another bucket list item that can't be worked into a trip. Some bucket list things are worth it, but the essentials of many of them can be fully experienced elsewhere.\n\nMy limitations are increasing as I age, so over the years I've collected sets of activities that work for any energy level and for various degrees of culture shock (which is what a lot of the burnout is.)",
                    "score": 3,
                    "author": "ConnieDee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is my attitude as well. I would rather spend a day doing nothing then forcing myself to see and do things just to cross them off my list. I don’t have to see all of the top tourist sites, just what interests me.  That’s the beauty of traveling solo! There’s just as much to be gleamed from wandering around, checking out a local grocery store, even getting some takeout and watching some local TV in your hotel room, whatever!",
                            "score": 2,
                            "author": "elusivebutterfly84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Those can be travel adventures in themselves. But one thing I do is have a priority list for where I'm at and each day try to do the top priority thing. (But for any given week in a city, there might only three or four of those top priorities. And then sometimes I go to places where I have no priorities and have no idea what I'm going too do there.)",
                                    "score": 1,
                                    "author": "ConnieDee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I spent three months last fall traveling France, Italy and the Netherlands. I felt good and was ready to proceed onwards, but I decided to head home for the holidays to see family. This time I just felt the mental equivalent of smashing into the dead end of an alley going 150 km/h right at the end here. Didn't see it coming.",
                    "score": 2,
                    "author": "Zealousideal_Owl9621"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I’ll fully admit Madrid was not for me. I quite frankly hated it. If you haven’t gone to Segovia and Toledo yet, you should. Much less overwhelming vibes. They were what made it more enjoyable. I know there are lots of other things within an hour train as well. Honestly give one a try and see if that eases stress. If it does. No shame in seeing the area around Madrid to make it so you can enjoy the last parts of your trip.",
            "score": 2,
            "author": "lavacakeislife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Altho I have to mention that I got lost in Toledo and ended up walking up and down a lot more than I had intended. With GPS even... But reason I got lost is because there weren't many tourists around for asking the way.",
                    "score": 1,
                    "author": "ConnieDee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha it was a bit confusing. But it was small at least so no wrong turn was too much of a detour.",
                            "score": 2,
                            "author": "lavacakeislife"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I totally get what you mean about Madrid. Do a day trip to Toledo if you haven’t yet - I loved wandering around solo and there’s definitely enough to do to fill the day, plus it’s cheap and quick to get to on the train. Or look into other nearby cities you could do a day by train to.",
            "score": 1,
            "author": "gr2020xx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely doing the Toledo day trip. Thanks!",
                    "score": 2,
                    "author": "Zealousideal_Owl9621",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a great city to just wander around and get lost in. Like there’s plenty to do - the cathedral is gorgeous, there’s multiple museums, etc - but it’s also a really nice city to just grab a coffee or snack from one of the many little cafes or restaurants or shops and just get fully lost.",
                            "score": 1,
                            "author": "gr2020xx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got like this in Paris, but it was also torrential raining 90% of the time I was there and I genuinely couldn’t see why people gush about it so much. Food was bad, massive language barrier and very unfriendly people. It didn’t help I’d just arrived from a couple weeks between Madrid (where I lived for many years) and Barcelona where it was sunny and vibrant and beautiful with good food and friendly people and was much easier for me to navigate. I always do a food tour when I travel to places but didn’t in Paris (because of the weather) so that may have added to my feelings. I think it’s definitely burnout at the end of a long trip for you. I’d recommend a food tour if you’re into that. Even though I lived in Madrid for many years, I still took a food tour and it was one of my favourite things I’ve done there.",
            "score": 1,
            "author": "EstateWeary5789"
        },
        {
            "level": 0,
            "comment": "Not really.",
            "score": -8,
            "author": "castaneom"
        },
        {
            "level": 0,
            "comment": "Find a gym for workout. That always brings me back",
            "score": 1,
            "author": "yungcameltoe"
        },
        {
            "level": 0,
            "comment": "Tbh I loved discovering Madrid solo. But 9 weeks sounds a bit tiring, so maybe that’s why. But it‘s only 4 more days. Do these very relaxed. Chill in your accomodation a bit, go for a stroll in a park, ride the cable car, have some nice dinner, and just relax.",
            "score": 1,
            "author": "SXFlyer"
        },
        {
            "level": 0,
            "comment": "Try some of the group tours (like from Airbnb)? There were some city walks and food hopping ones I recall that were nice.",
            "score": 1,
            "author": "throfanfor"
        },
        {
            "level": 0,
            "comment": "Go for walks around the city. Keep going till your legs fall off. People watch and find new areas and things. Thats my go to",
            "score": 1,
            "author": "Garnservo97"
        },
        {
            "level": 0,
            "comment": "I spent 5 days in madrid and felt the exact same way. I had one weekend in Madrid where I decided to join a pub crawl and met a few other solo travellers. This made my trip that much more tolerable. I would highly recommend joining one. Just search pub or bar crawl Madrid and you’ll find a few.",
            "score": 1,
            "author": "generik80"
        },
        {
            "level": 0,
            "comment": "Try staying at a hostel instead maybe? They’re built for people like you, very easy to meet other travelers. Can try a bar crawl as well if you’re having trouble meeting people to go out with",
            "score": 1,
            "author": "clutchutch",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm less inclined to stay in hostels now that I'm in my 40s. I stayed at one in Lisbon and it was awkward as hell and not enjoyable. I'm not cracking that 20-something party cabal, nor would I want to.",
                    "score": 1,
                    "author": "Zealousideal_Owl9621"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zip over to Salamanca or something. Less then an hour by bus. Get outside the city. I think it’s as cheap as 6 euro by train and 2.3hr to Barcelona. Go for an adventure or just a break.",
            "score": 1,
            "author": "jetclimb"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not anxious about going home. I'm anxious TO go home. I've done all the art museums in Madrid already and I love what I'm seeing but there's half of me that is just numb and unenthusiastic about anything I see. Retiro Park was lovely and I spent an entire afternoon there. \n\nI know it's probably just me needing to go home for a bit to recharge so I can get back out there and enjoy my travels again.",
                    "score": 1,
                    "author": "Zealousideal_Owl9621"
                }
            ]
        },
        {
            "level": 0,
            "comment": "sign up for a tour.. you dont have to do everything on your own. you can take a bus that wll take you to lovely toledo, avila and salamanca or segovia all in one day",
            "score": 1,
            "author": "First_Place_Finish"
        },
        {
            "level": 0,
            "comment": "It's ok to hit a wall. Also, I didn't vibe with Madrid either for some reason. I liked Southern Spain way more.",
            "score": 1,
            "author": "accidentalchai"
        },
        {
            "level": 0,
            "comment": "Try a guided bike tour- I’ve met some great people on them, including in Madrid.  Many guides speak some English and so do most patrons.  Or just rent a bike and explore the parks- you’ll give yourself some space and still see nice parts of the city.  Order bocadillos takeout from shops- you can just point and no Spanish needed.",
            "score": 1,
            "author": "icesprinttriker"
        },
        {
            "level": 0,
            "comment": "I spent 4 weeks in Spain not knowing a lick of Spanish at all by myself I had none of these issues",
            "score": -8,
            "author": "ohnowheredmypantsgo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I spent 10 days in southern Spain and had none of these issues either. Thanks for the comment.",
                    "score": 6,
                    "author": "Zealousideal_Owl9621",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah one week Madrid no issues ether. Sounds like you just got hit with some mental health shit",
                            "score": -5,
                            "author": "ohnowheredmypantsgo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too long. You chose to go to a country aline where you do not speak the language. I mean honestly how did you think the trip wasngoing to unfold?\nAfter 9 weeks you really should have picked up some\nspanish.\nYou could\ndo things like book a guided tour, visit all the churches and museums, spend a day at the shore.\nNightclubbing and eating alone are probanly not in the top-ten things\nto do alone.\nHope you enjoy the last days.",
            "score": -3,
            "author": "Embarrassed_Ad_2377",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you need a reality check, amigo. If you had bothered to read what I wrote you would have seen I've been in Spain for two weeks. There's only so much useful Spanish one is going to pick up in that brief amount of time. Is your position that one shouldn't travel for very long in countries where they don't speak the local language? The language barrier is obviously not my main issue, but it's amplified when I'm on the struggle bus mentally.",
                    "score": 3,
                    "author": "Zealousideal_Owl9621"
                },
                {
                    "level": 1,
                    "comment": "You know they don't speak Spanish in Portugal, right?",
                    "score": 1,
                    "author": "BerriesAndMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🙄OK ignore the entire point: Replace “spanish” with “portugese”. Learn Portugese phrases in 9 weeks was the suggestion. Or don’t. Expect everyone to speak YOUR native language for you.",
                            "score": 1,
                            "author": "Embarrassed_Ad_2377",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are aware that they don't speak Portuguese in Madrid as it is in Spain?",
                                    "score": 0,
                                    "author": "BerriesAndMe"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Spain actually not a great place to travel? I feel like every other negative post here is someone having a bad time in Spain",
            "score": 0,
            "author": "Jack_the-Maggot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've enjoyed Spain up to this point. Not sure why I crash landed in Madrid. I honestly could have spent a month in Granada I loved it so much.",
                    "score": 2,
                    "author": "Zealousideal_Owl9621"
                },
                {
                    "level": 1,
                    "comment": "I spent 10 days in Spain as a part of my Europe trip and Spain is actually a great place to travel! If you are someone who is more social, staying in a hostel would be your best bet because it makes it easier to find people to hang out and go out with.",
                    "score": 1,
                    "author": "zogrossman"
                },
                {
                    "level": 1,
                    "comment": "Spain is an amazing place to travel, I want to make a separate trip to each region. But it won’t be everyone’s cup of tea and it’s one of the most visited countries, so by raw numbers there will be a decent amount posting negative experiences compared to people sharing their bad day in Luxembourg",
                    "score": 1,
                    "author": "roub2709"
                },
                {
                    "level": 1,
                    "comment": "Spain is probably in the top 5 most touristed countries in the world.",
                    "score": 1,
                    "author": "terminal_e"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find the language barrier part interesting as I've been to Madrid twice and never had this issue. I suggest joining tours so that you can at least be around other people because staying in a hotel solo can easily feel isolating.",
            "score": 0,
            "author": "zogrossman"
        },
        {
            "level": 0,
            "comment": "Sorry to hear about your burnout, definitely an unfortunate part in every longer solo travel trip... but I would love to hear more about your time in portugal! I'm going in October and trying to find a few places that are less touristy and more chill",
            "score": 0,
            "author": "kcoolthxbb"
        }
    ]
}