{
    "id": "13vaxza",
    "score": 3,
    "title": "First solo trip to Italy! Critique my itinerary please?",
    "author": "MiloMan4",
    "date": 1685405436.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13vaxza",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone,\n\nI am really excited to be doing my first solo trip to Italy soon. I have a rough itinerary which I intend to follow but would appreciate any advice. \n\nPlan is as follows:\n\nDay 1 (Saturday) - Arrive in Milan (Flight booked and arrive around 5PM). I intend to get dinner and spend the evening exploring the city.\n\nDay 2 (Sunday) - Explore Milan and the various attractions (Duomo di Milano, Galleria Vittorio Emanuele II). I intend to leave this city in the evening around 7PM to go to the next city.\n\nDay 3 (Monday) - Explore city (Parma/Genoa or open to any other suggestions for cities I could visit)\n\nDay 4 &amp; 5 (Tuesday and Wednesday) - I will be in Modena for these two days as I plan to visit the Ferrari and Lamborghini Museums. I intend to leave Modena in the early evening on Wednesday for Bologna. I will explore Bologna in the evening and spend the night there.\n\nDay 6 (Thursday) - Explore Bologna and fly out from here.\n\nMy main concern is Day 3 - should I go to Genoa or Parma? I am more interested in Genoa and would like to visit this city, however Parma is on the route to Modena which is a non-negotiable destination for me. I am open to visiting any other interesting cities too, suggestions would be welcome!\n\nThanks so much!",
    "comments": [
        {
            "level": 0,
            "comment": "I think it’s be a shame to miss Florence. \n\nThe Galleria in Milan is just a mall. It’s worth walking through as it’s right by the Duomo, but I wouldn’t plan on spending a lot of time there. \n\nYou should see the Last Supper while you’re there. You’ll need to book a timeslot ahead of time. And I’d also recommend the Ambrosian Library, it’s a museum that has some of da Vinci’s notebook pages on display.",
            "score": 5,
            "author": "PorcupineMerchant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I definitely intend to visit Florence on a later trip. It is quite high up on my list but for now trying to cover Northern Italy.\n\nAppreciate the advice, I will book a slot for the Last Supper, didn't know it required this.",
                    "score": 2,
                    "author": "MiloMan4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure thing. \n\nAnd yes, they limit the number of people allowed in to see the Last Supper. It’s heavily deteriorated so they control the humidity and only let groups in for 15 minutes or so at once.",
                            "score": 2,
                            "author": "PorcupineMerchant"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which airport is your arrival airport? Malpensa has train into Milan.",
            "score": 2,
            "author": "RecommendationNo8223",
            "replies": [
                {
                    "level": 1,
                    "comment": "I arrive at Malpensa and will take the train into Milan!",
                    "score": 1,
                    "author": "MiloMan4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fast train Milan to Genoa is 1.30 each way,so its doable as a long day trip.If you want to go there,why not?\n\nIt has a nice harbour and a great historical centre.",
            "score": 2,
            "author": "lucapal1"
        },
        {
            "level": 0,
            "comment": "Book ahead for the Dome in Milano. Waiting time even with Tickets are insane",
            "score": 2,
            "author": "TherealQueenofScots"
        },
        {
            "level": 0,
            "comment": "day 3 go to verona , i live there  it s worth half a day:)",
            "score": 2,
            "author": "Vraluki90"
        },
        {
            "level": 0,
            "comment": "Pavia is a very short (and frequent) train ride from Milan and it (along with many other small cities in Lombardy) are worth a visit. Old college town with a big pedestrianized area and beautiful piazzas. Would recommend using Milan as a base and getting a cheap 3 day transit pass that lets you go anywhere in Lombardy. Bergamo or cities on Lake Como or Maggiore could be other possibilities for a day. Might be easier than going off to another city for one night",
            "score": 2,
            "author": "taconiccom"
        },
        {
            "level": 0,
            "comment": "I think Genoa is much more interesting than Parma, however getting from there to Modena will not be easy at all. \nI would suggest you to look up bus routes as well, like Flixbus and similar, may be faster than train (you will be forced to exchange in Milan).",
            "score": 2,
            "author": "Just_a_spaghetti"
        }
    ]
}