{
    "id": "13wjug2",
    "score": 1,
    "title": "Best place to visit in Central America in July",
    "author": "StandardExpensive535",
    "date": 1685533304.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13wjug2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nAm changing jobs and will have 3-4 weeks in between roles, from the last week of June to late July. \n\nCentral America/Mexico has been top of my list to visit for a while now, however, I realise that this time is rainy season. I would have much rather gone during the dry season, but unsure when I will next get such a break from work so figured I should seize the opportunity. \n\nI would really like some sun/beaches while I am there, as well as the opportunity to hike, and was wondering which country would be best for this?\n\nMy initial plan was to do Guatemala and Belize, but if there is somewhere with far preferable weather then I would happily switch.\n\nI went to Costa Rica in June many years ago and had grey skies the entire time, which I don’t especially want to repeat. \n\nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "I'm going to El salvador later this year. Check it out.",
            "score": 2,
            "author": "shortedaman1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too! Just booked end of June to beginning of July. What are your broad plans? We are planning on lots of hiking and some water sports. As of now the plan is a hotel in Santiago the entire 2 weeks and having a car to travel around. Are you doing it similarly?",
                    "score": 1,
                    "author": "Leo_br00ks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly I'm mostly gonna just wing it. I don't like to \"just be a tourist.\" So I'll figure it out as I go. I will be staying in San salvador.",
                            "score": 2,
                            "author": "shortedaman1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sweet. Have fun!",
                                    "score": 1,
                                    "author": "Leo_br00ks"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yo, I just got back from El Salvador. Gonna advise you to rethink staying in San Salvador the whole time - it feels like just another city, and although it has some cool stuff like the national palace, anthropology museum, liberty plaza, you'll get bored real quick and you'll find it a hassle to get to other places that are more worth it.\n\nAlthough it's tiring, what I did for this trip was jump locations every 2 days. San Salvador, Lake Coatepeque, Santa Ana, and El Tunco. (8 days total) Allowed me to do day trips to places nearby for what I wanted to do. Used the chicken busses to get around.",
                                    "score": 1,
                                    "author": "bigcum-littlecum"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "July may not be the best time for OP, when I visited (a few days ago) there was some rain and clouds but the majority had quite a bit of sun. I spoke to others there who said true rainy season comes a month or two later (so, June/July). OP should probably ask locals to see if the weather will be good the time he plans on visiting.",
                    "score": 1,
                    "author": "bigcum-littlecum"
                }
            ]
        }
    ]
}