{
    "id": "13wo2lv",
    "score": 112,
    "title": "People forcing solo travel?",
    "author": "tylerthe-theatre",
    "date": 1685543996.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13wo2lv",
    "media_urls": [],
    "other_urls": [],
    "postText": "This has been playing on my mind recently and it'll inevitably be divisive but I definitely feel like some people are doing solo travel for the wrong reasons.\n\nDon't get me wrong, I don't want to gatekeep it, in fact I'm an advocate for it and have recommended doing it to several people over the years but some experiences I read on this sub especially make me think.\n\nSome people are travelling solo specifically to make friends, why? Sort of defeats the purpose. Some people have travel/solo anxiety and are doing it, again I get throwing yourself out into the big world but I wouldn't recommend potentially causing a mental breakdown or panic attack just to be abroad.\n\nI think people just need to ask themselves why they want to solo travel, most peoples reasons I'm sure are fine and I'm not here to question exploring, experiencing new things etc. But for friendship, love, feeling like 'you have to' because it feels like everyone's doing it. No, do it because you actually want to.",
    "comments": [
        {
            "level": 0,
            "comment": "For me, ‘solo’ represents the starting point, but does not determine the state during the trip. \n\nIt’s the freedom to be alone when I want, and be social when I don’t. That toggle is a luxury that doesnt exist when embark with one or more other people.",
            "score": 653,
            "author": "don_r22",
            "replies": [
                {
                    "level": 1,
                    "comment": "That toggle is precious! Thanks for articulating this benefit of being solo.",
                    "score": 93,
                    "author": "gracielynn72"
                },
                {
                    "level": 1,
                    "comment": "Exactly, that was my favourite part! Solo during the day for my activities, and then I had groups I could meet up with for dinner and drinks in the evenings. It was the perfect balance for me.",
                    "score": 52,
                    "author": "AyeBB8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly this. When I solo travelled to Paris, I walked around all day, ate a restaurants, sipped espressos at cafés, completely alone. But at night after getting a couple brewskis in me, I was a social butterfly &amp; met a lot of different people &amp; loved every minute of it. If you wanna meet people/friends on your solo travels, do it! You’ll have someone you know next time you visit :)",
                            "score": 16,
                            "author": "Acceptable-Tune-9800"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s so funny to read that, it’s exactly me. When I’m with a group I’m always the one to strike up a conversation with others and broaden the circle, but when I solo travel I don’t go out of my way to talk to anyone. My “toggle” as you put it so well is either 100% social or 100% solo apparently lol.",
                    "score": 22,
                    "author": "Low_On_Coffee"
                },
                {
                    "level": 1,
                    "comment": "I'm also interested in meeting locals and soaking up any potential culture, and when you're by yourself, it is much easier to get in with the locals!",
                    "score": 11,
                    "author": "Substantial-Week-258"
                },
                {
                    "level": 1,
                    "comment": "Well put!",
                    "score": 8,
                    "author": "Fresjlll5788"
                },
                {
                    "level": 1,
                    "comment": "Top comment right here. 100% agree!",
                    "score": 6,
                    "author": "LivingAttitude9414"
                },
                {
                    "level": 1,
                    "comment": "I am currently using this toggle on my trip to Italy, I booked some airbnbs, which was nice for a bit of rest and relaxation. I ended up cancelling some of the airbnbs in exchange for booking a hostel in certain cities so I was able to be a bit more social. very well said!",
                    "score": 10,
                    "author": "xRhyfel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is a great strategy, going to start doing this",
                            "score": 5,
                            "author": "don_r22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree that sometimes on here it seems that people have very unrealistic expectations when it comes to solo travel. I think that many people haven't spent much if any time alone before they decide to solo travel and when they're actually really alone they realize that they aren't  comfortable with it. That's totally fine! It can take time to learn how to be alone and to enjoy your own company. That being said it's normal to feel lonely and it's 100 percent ok to just sit in that loneliness. You don't always need to escape those feelings. Only you know what's best for you. If it's too much and you need to cut your trip early and go home then do it. I also think it's ok to ride it out and  learn how to be more accepting of it, and truly learn how to be ok with yourself. People just need to figure it out themselves. Solo travel isn't for everyone.",
            "score": 108,
            "author": "RabbitGravity",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure. There are people who wouldn’t go spend the night by themself in a nearby city, who are suddenly embarking on multiweek solo international trips.",
                    "score": 58,
                    "author": "TravelerMSY"
                },
                {
                    "level": 1,
                    "comment": "I am solo traveling right now and I haven't meet anyone that I clicked with or with whom I can do something. Right now is propably the first time that I am actually alone. It feels weird but it also gives me the chance to like you said sit in my loneliness and explore it. I don't know why but your coment really helped me right now. Thanks",
                    "score": 20,
                    "author": "newqueeraitalover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome :) Congrats on the solo trip! Be very proud of yourself for having the courage to do it and for getting to know yourself better!",
                            "score": 2,
                            "author": "RabbitGravity"
                        },
                        {
                            "level": 2,
                            "comment": "Same for me right now. It's so weird that sometimes i meet a BUNCH of nice people i get along with and now i sometimes feel completely lonely and almost homesick.. A feeling i don't have very often at all. I think a lot about accepting it and learning how to be ok with it but now that I'm actually in it, idk how to do that? \n\nAnyway it's nice to see that I'm not alone with this so thanks for commenting",
                            "score": 2,
                            "author": "chiaear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I travel solo because usually none of my friends can take 2-3+ weeks off work the same time as me.",
            "score": 102,
            "author": "DudeBroManCthulhu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I tend to quit my job and take off for like 6-12 months at a time every 2 years. Everyone else seems to say they \"can't\" do that for whatever reason, but that they wish they could.... honestly, most of my childless associates totally could do this (or come with me), but they're scared of the unkown. Currently, my partner is with me on an 8 month stint in SE Asia and it's wonderful!! But if no one is up for joining, I will go on my own cause that's wonderful too! I can afford to do this making less than 6 figures a year, and that's when I'm actually working lol. I have no debt and a solid savings account. It's sooo doable and there's nothing to be afraid of.",
                    "score": 4,
                    "author": "caity1111"
                },
                {
                    "level": 1,
                    "comment": "^^ Same",
                    "score": 2,
                    "author": "EqualBar1123"
                },
                {
                    "level": 1,
                    "comment": "Same. \nBut honestly, I usually have more fun alone than when I’m with a friend/s. I tend to meet more people and have more spontaneous adventures on my own.",
                    "score": 2,
                    "author": "_baegopah_XD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep",
                            "score": 1,
                            "author": "DudeBroManCthulhu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, I see a lot of posts were the very obvious answer is either...\n\n1. Maybe this is not for you.\n2. Your schedule for your 9 month trip is too intense. Take a few days to relax and destress and just enjoy being in a different place away from work.",
            "score": 60,
            "author": "Moon_Logic",
            "replies": [
                {
                    "level": 1,
                    "comment": "A LOT of those posts.",
                    "score": 11,
                    "author": "Grace_Alcock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am a person with mental illness--major depressive disorder. I have to work at managing it every damn day. And solo travel has been absolutely incredible for me. Could I wander solo for a year? Nope. That would feed the depression. But my solo trips that have been 1 to 10 weeks? They have helped tremendously. While I am traveling and typically with a sustaining effect when I return home. (I know you mentioned anxiety, but others have discussed mental illness in general, so I wanted to throw this out.) I also have social anxiety which has been at times a problem for me. I find often while solo traveling I am have LESS anxiety in social situations, meeting people, asking for help, than I do at home.   \n\n\nI agree that no one should feel they \"have to\" solo travel. But there are a lot of different whys behind the \"want to\" solo travel.",
            "score": 40,
            "author": "gracielynn72"
        },
        {
            "level": 0,
            "comment": "I feel like some people romanticize it, seeing others on social media having the time of their life or expect/wish their own travel to be just as moving/mind and life changing. Which it can be. But as some already mentioned, it can also be about finding out if it’s something for you or not. And it’s totally fine to rant/cry/share queasy feelings about solo traveling too.",
            "score": 30,
            "author": "steffysteffysteffy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree, in the last few years I think social media has definitely painted a very rosy picture of it, it's not always comfortable or fun and things can go wrong.\n\nBut that's true, it won't be for everyone and in doing it you'll find one way or the other!",
                    "score": 14,
                    "author": "tylerthe-theatre"
                },
                {
                    "level": 1,
                    "comment": "I don’t think it’s social media, before social media there have been books written by free spirits (on the road, travels with charley, bill Bryson) that romanticize traveling. I think the idea of solo travel and being on the open road is inherently romantic and we just deal with its realities like we do in life.",
                    "score": 2,
                    "author": "between-seasons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least Bill Bryson also put in his frustrations in his books. Influencers today have to be perfect and go to \"amazing\" places and make long lasting friendships with the natives.But that is also fake as most influencers friends are really there for the publicity. I feel today social media doesn't show the bad side of anything. Everything has to be perfect and it makes for unrealistic expectations.",
                            "score": 1,
                            "author": "Tardislass"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People should travel anyway they like to travel, I have no dog in that race.",
            "score": 29,
            "author": "nim_opet",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think OP means that some people think that they want to travel solo, but in reality don't want to. They are being influenced and feel pressure from social media for example.",
                    "score": 9,
                    "author": "ModestCalamity"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree that people shouldn't solo travel because they feel like they're supposed to. If you're only going because your friends/family say it's a right of passage and are pushing you to do it, you have every right to say no.\n\nHowever, I disagree with most of your other points. If someone wants to travel solo as a way to meet friends, what's wrong with that? They have an interest and a self-chosen goal, and found a way to combine those - cool. If someone wants to travel for self-improvement, that's also great as long as it's their own decision. There are many valid reasons, and not everyone will have the same motivations.",
            "score": 147,
            "author": "QuelynD",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If someone wants to travel solo as a way to meet friends, what's wrong with that? They have an interest and a self-chosen goal, and found a way to combine those - cool.\n\nI think this is fine if you set realistic expectations for what these friendships will be like. You're most likely to go your separate ways with friends you make in hostels after a few days, weeks, months together. Long-term friendships can form from these travel friends you meet (and that has been known to happen), but I think that if you go on trips with the *expectation* that you'll definitely meet your new ride-or-die group, you're only setting yourself up for disappointment. Again, this *can and does* happen, but you shouldn't *expect* it to every single time. \n\nBasically, if you're struggling with social anxiety at home, being abroad won't magically cure it.",
                    "score": 34,
                    "author": "Justin_Credible98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Basically, if you're struggling with *anything* at home, being abroad won't magically cure it.\n\nTruth bomb right there.",
                            "score": 17,
                            "author": "michiness"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with Op on the friend factor. I don’t think solo travel is the best method of meeting friends. And if you’re entire purpose is to make all the great life long friendships along the way you may be misguided.\n\nUltimately for solo travel you need to be comfortable in your own skin. Sometimes you’ll know that before you try solo or you’ll learn it along the way. \n\nWhen you are comfortable on your own (which you can be extensively while soloing) your expectations change from “I must make friends” to “it’d be great if I met new people but not a big deal if I don’t”\n\nI don’t think anyone is saying don’t make friends while traveling, that would be ridiculous. Manage expectations in regards to friends is more reasonable.",
                    "score": 34,
                    "author": "Wexylu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It might not be the best method but it sure beat college in my experience.",
                            "score": 15,
                            "author": "AndrewithNumbers"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I don’t think solo travel is the best method of meeting friends.\n\nActually sort of curious, where do people get these ideas? I.e. that solo traveling is a good way to meet people. Eat, Pray, Love was a *while* ago, is there a piece of media I’m missing?",
                            "score": 0,
                            "author": "mthmchris"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly why I solo travel. If we went together, you’d have me signed up on a group tour, when I just want to explore alone and meet people later at the hostel. 🤣 \n\nActually, I like to travel with my sister because we split up as soon as we get there, do our own things, then see each other at the hotel or for dinner later.",
                            "score": 6,
                            "author": "kaproud1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can see that. I also know that I realized if I waited for people to go with me to see all the things I wanted to see, I'd miss out on so much. So, see The Place alone or not at all? I opt for seeing The Place, even if I have to do it by myself.",
            "score": 17,
            "author": "artemissgeologyst",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is like when I try to date people who say they love to travel, but once I’m in a relationship they say they can’t take off work or we don’t have the money. Solo!!!",
                    "score": 3,
                    "author": "kaproud1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't do the solo travel trips that some people do. The longest I've been away on my own is 8 days\n\nI honestly feel it's made me a better person and I've learnt doing solo trips that I'm a lot more confident and outgoing than I think I am.\n\nI still do trips with friends but it's really freeing that if they are not available I can take myself off somewhere and still have a great time.",
            "score": 13,
            "author": "yellowarmy79",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am there with ya. My longest trip was 10days. That is really about my limit. I usually am tired of traveling around the 1 week mark. No one has to take months long backpacking trips. A shorter trip can refuel you. I usually just go alone because coordinating travel among many family and friends is not fun for me.",
                    "score": 4,
                    "author": "Karm0112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well yeah nobody HAS to, but for me taking a trip isn’t worth it unless it’s 3-4 weeks. 1 week just simply isn’t enough for me to be happy with it.",
                            "score": 3,
                            "author": "jasper486",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it all depends on other factors. Everyone is different. Usually a week is enough for me. But traveling overseas it makes more sense to do at least 10-14 days because of the cost of flights",
                                    "score": 3,
                                    "author": "Karm0112"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I'm the same. I find organising a trip for a big group of friends a bit stressful. Then once you go, some of them just wanted to sit in bars all day and not go sightseeing which was not what i wanted to do.\n\nIf I limited it to a small group of friends some of the others got annoyed that I hadn't asked them so it was easier if it was something I wanted to do to just go on my own.\n\nI still travel with friends but I let them organise the trip.",
                            "score": 2,
                            "author": "yellowarmy79"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think there’s anything wrong solo traveling to make friends as part of the reason. That’s the most interesting part of solo travel for me. Meeting people from all over the world and learning their different perspectives and cultures. And then I get into the most fun adventures through people I meet.",
            "score": 12,
            "author": "New_Artichoke_9940",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wasn’t the reason I started solo traveling but it’s definitely the most interesting and in my opinion my favorite! From small love interests to best friends, I’ve visited a lot of the people I’ve met while traveling 2/3x since. We keep in touch on WhatsApp and social media, I’ve even been invited to and have attended holiday events. You start growing this international friend group and then you start having couches to sleep on in different countries whenever you want to and I love it. People have come to visit me and my door is always open. I’m even going to a music festival now in a month now with people I made friends with on my last solo trip. I guess it depends on the type of person you are as well",
                    "score": 2,
                    "author": "Odd_Emotion_6206"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who cares how or why someone travels.",
            "score": 11,
            "author": "Karm0112"
        },
        {
            "level": 0,
            "comment": "Can I just dislike traveling with other people in general? I like doing what I want to do, when I want to do it. It’s also easier to talk to other people when traveling because the likelihood of running into them again is slim to none.",
            "score": 24,
            "author": "munichbish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely fair reasons and motivators for a lot of people I'm sure.",
                    "score": 0,
                    "author": "tylerthe-theatre"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe im wrong, but 90% the times the stress is not on 'solo\" but on 'travel'.\n\nBtw ppl have different priorities: an introverted person may want to meet new people and make connections, an extroverted may want to finally have time for him/herself alone. Whats the problem with that?",
            "score": 7,
            "author": "herevero_hevero"
        },
        {
            "level": 0,
            "comment": "I totally agree with the anxiety part as travel is not a cure for mental health issues since you bring yourself and your problems wherever you go. The friends part is a different story. Some people travel because they want to find more people who do the same activities as them. For example, I've met solo travelers who have purposely gone by themselves to stay at surf clubs in order to literally meet others to surf and hang out with; the same could be said for skiing, hiking/biking, and any other activity. There is a reason why social/party hostels exist. Despite it being called solo travel, many people traveling long term want to meet new people. I as a 22-year-old woman loved meeting new people/friends because I had people to go out with at night and even explore with during the day and it really added to the fun.",
            "score": 7,
            "author": "zogrossman"
        },
        {
            "level": 0,
            "comment": "I travel solo because I enjoy making my own plan, my own itinerary, and traveling at my own pace. I like making new friends along the way, but it doesn't mean I will just tag along with anybody. I made my own decision and I love independence. \n\nI also understand that solo traveling is not for everybody. There are people whose traveling style is basically following others. If you are this type, then solo traveling is not for you.",
            "score": 6,
            "author": "jedrevolutia"
        },
        {
            "level": 0,
            "comment": "Solo just means I get to do what I want without planning my trip around anyone except myself. If I wanna go out with thirty people while there and then abruptly leave in the middle without any explanation, I'm still solo travelling",
            "score": 7,
            "author": "khaki53"
        },
        {
            "level": 0,
            "comment": "&gt; Some people are travelling solo specifically to make friends, why? \n\nBecause life, mostly, is about other people and the time we spend with them. Traveling in general is a means of meeting people that live distinct lives from your own that you ordinarily would never have met. Solo traveling is easier than traveling with other people because you only have to consult with yourself on how to go about doing it.\n\nI don't know what to say if you can't comprehend people wanting to meet people in new places. It sounds like these are personal problems that you might have, but unless you're the Grand Vizier of Vacations, it doesn't really matter how you feel about it. Fly solo or don't.",
            "score": 6,
            "author": "SmugRemoteWorker"
        },
        {
            "level": 0,
            "comment": "I definitely think social media (and possibly covid) has increased the appeal of solo travel/backpacking/\"adventure travel\", etc. For the longest time, most people I know's idea of \"travel\" was doing two weeks in Turks &amp; Caicos, with activities that consisted of lounging by the pool and seeing how many pina coladas they could down before happy hour was over. There's nothing wrong with relaxing vacations, but it feels as if there's been an inorganic shift towards adventurous or cultural tourism destinations and doing it solo. \n\nThis might also be a subconscious urge to seek out authentic experiences and human connection in an increasingly digital world. Europe, in particular, has also had a resurgence in popular culture, thanks to television.\n\nKeep in mind that the [stats don't necessarily bear this out though,](https://en.wikipedia.org/wiki/World_Tourism_rankings) the top tourist destinations have been fairly consistent for some time.",
            "score": 20,
            "author": "UniversityEastern542",
            "replies": [
                {
                    "level": 1,
                    "comment": "And tbh beach tourist destinations tend to be some of the most dangerous. And they’re all pretty much the same - packed pools, screaming kids, and people talking to you constantly. \n\nWhen my kids were young, I’d take them on a semi-stay-cation in the off-season to a hotel on the beach 10 minutes away, or camping at the state park down the street. Now that they’re grown I still book a room during the off-season, read a book and watch the waves.",
                    "score": 1,
                    "author": "kaproud1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Solo travel is what you want it to be, if you want to meet people where you're going that's great!  It's an adventure going solo.",
            "score": 5,
            "author": "ReferenceSufficient"
        },
        {
            "level": 0,
            "comment": "Some people start off solo, as they have no one to go with from the starting point, but are happy to make friends along the way. Not sure how that’s a confusing concept.",
            "score": 6,
            "author": "k-apoca"
        },
        {
            "level": 0,
            "comment": "I think everyone should solo travel simply to learn that they can (or can’t). A sad life to have never done anything by yourself because you were too afraid. Even if it sucks/was unrewarding it’s a learned experience",
            "score": 4,
            "author": "jszly"
        },
        {
            "level": 0,
            "comment": "I just wanna see some ancient pyramids man lol. Fuck all the socializing.",
            "score": 4,
            "author": "Familiar_Payment_740"
        },
        {
            "level": 0,
            "comment": "I think that’s fine, but imo it will just force you into friendships that you don’t even want. The amount of forced conversations i have overheard, damn. It sounds torturous to go through it. \n\nFinding people by accident or naturally is what’s always led to me finding the best people",
            "score": 10,
            "author": "Garnservo97"
        },
        {
            "level": 0,
            "comment": "Why does one solo travel? Of course because you like it, why else. I am retired now, but for years often try to coordinate a trip here or there with a friend, and sometimes it did work. And then it occurred to me decades and decades ago, that I love the freedom, coming and going as I will, and chatting with new people along the way... Once you get used to it solo travel is awesome. I've sold my New England real estate and bought myself a little van and between houses, I am completely nomadic and bi coastal.\n\nThe best arrangement that has worked for me when traveling abroad is sometimes to dovetail a week with another person, pre-arranged and we meet there.. last fall I rented an apartment in Paris for a couple weeks and invited a friend for that time span.. But before and after I was on my own and I love it.. Solo is the best",
            "score": 4,
            "author": "Different_Ad7655"
        },
        {
            "level": 0,
            "comment": "im on this sub cos im old, and so im just here to listen about stuff.\n\n&amp;#x200B;\n\nand if people are \"forcing travel\"...well....it is a sub called \"solo travel\"\n\nits sort of a \"go off the grid!, its fine, totally easy!\" but it isn't really, it all depends on who you are,and if you aren't ready for globe trotting and dealing with people, don't do it,its fine.",
            "score": 5,
            "author": "PuppidVelids"
        },
        {
            "level": 0,
            "comment": "I solo travel merely because I have no one to travel with. It was difficult in the beginning and now I love it. I love meeting people along the way. Sometimes we travel in the same direction for a bit or so day excursions together. All in all, something I was afraid to do has become quite enjoyable!",
            "score": 4,
            "author": "Thin-Kaleidoscope-40"
        },
        {
            "level": 0,
            "comment": "I've made many friends solo traveling over the last 15 years; in fact, I'm renting a house in Sardinia this summer with a group I met sailing in Greece in 2021. I do agree that that's not why I travel, just a happy side effect.",
            "score": 11,
            "author": "DJSauvage"
        },
        {
            "level": 0,
            "comment": "How does making friends defeat the purpose of solo traveling? I solo travel because I want to be able to do it on my own time, in my own budget, and at my own pace. Naturally, I will meet people that fit in those same categories while on my travels, but trying to plan that out beforehand with a friend is a lot of work and oftentimes falls through.\n\nI don’t think it’s any of my business, or yours, why people choose to travel the way they do and whether it makes them happy or they feel forced to.",
            "score": 9,
            "author": "Fancy-Comb1056",
            "replies": [
                {
                    "level": 1,
                    "comment": "OPs post is exactly why I travel solo. Let me live! 😂",
                    "score": 3,
                    "author": "kaproud1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of us wanted to go with friends but schedules didn’t line up so had to go solo… hence hoping to make friends there. Hope this helps! :)",
            "score": 3,
            "author": "EqualBar1123"
        },
        {
            "level": 0,
            "comment": "People should do whatever they feel like. If your motive is because other people are doing it then go ahead.. they're probably onto something. If you feel like you want to make friends that way then go for it. If you want to meet someone to fall in love with while solo travelling GO FOR IT.\n\nDon't tell people their reasons aren't good enough. If they want to do it they want to do it.\n\nIf people have to force themselves to go out and end up having good experiences that's absolutely fine.",
            "score": 3,
            "author": "mrdibby"
        },
        {
            "level": 0,
            "comment": "The only way to defeat anxiety etc is to confront it. Trying to appease anxiety by protecting yourself from anxious situations will only make it worse long term.",
            "score": 10,
            "author": "FunkySausage69"
        },
        {
            "level": 0,
            "comment": "People like to solo travel for reason you won't understand until you actually do it. \n\nI hope you aren't discouraging a friend or partner from solo traveling because then you'd be the worst. Let people discover and explore their own interests in their own time. :)",
            "score": 8,
            "author": "CBear_0"
        },
        {
            "level": 0,
            "comment": "I feel like there's a lot of different travel styles on this sub, and none of them are right or wrong. \n\nIf you want to solo travel to meet friends in hostels, sure go for it! If you want to solo travel and stay at hotels, amazing. If you want to solo travel to get out of your comfort zone, all the power to you. \n\nEveryone has different motivations, and I feel like it is wrong to judge them for it.",
            "score": 6,
            "author": "Chemroo"
        },
        {
            "level": 0,
            "comment": "&gt;Some people are travelling solo specifically to make friends\n\nYou have to realize some people feel alone where they come from and find comfort and warmth among fellow tourists or locals who don't share the same culture.",
            "score": 6,
            "author": "anima99",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like a mix, so even when I am intentionally traveling solo I've got an eye out for future travel partners.",
                    "score": 2,
                    "author": "YoungLorne"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's like going for a 5k competition with differing experiences and knowledge of the training etc. Some people can ace it. Some barely get through it but are motivated to continue. Some, very few, die from suddenly exercesing and getting heart attacks. Those aren't predictable, but you can't expect adults to not know better, even if social media motivates them to travel. If they find out the hard way, they do... but it's a risk worth taking. Many people are depressed &amp; feel existential about life, if they could go with friends they would have already. But to have an option that's easy to do in theory can be very uplifting as opposed to being thought of as being something tough",
            "score": 2,
            "author": "LocksmithConnect6201"
        },
        {
            "level": 0,
            "comment": "I get anxiety from solo traveling because airports and traveling stresses me out also dealing with unforeseen situations like lost check in luggage while trying not to miss the flight. Traveling with someone won't prevent that but feels less \"alone\" in the situation. However, after arriving and going around the new city the experience is great, it is worth going out of comfort zone.\n\nAlso, I travel solo because I don't know anyone who wants to travel with me so it is not a choice anyways",
            "score": 2,
            "author": "Rosehus12"
        },
        {
            "level": 0,
            "comment": "I liked doing what I want when I want. Free to come and go as I please. Push myself for a day or take it easy.\n\nNow I travel with my partner, its fun but not the same. I def prefer doing it alone but dont tell her that HAHA",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "&gt;Some people are travelling solo specifically to make friends, why?\n\nI think you're under the impression that everyone that travels alone wants to be alone. Quiet as kept, for a lot of solo travelers, it wasn't exactly a choice for them. They either don't have any friends or family or they do have friends and family but unfortunately they don't have the money to travel. So that means they have to travel by themselves but when they travel they do so with the intentions of meeting people to join them on their next trip. Nothing wrong with that. Solo traveling isn't for everyone. Although, I do wish they'd get off this sub and join a 'looking for a travel buddy' sub instead because, and I could be wrong, but I feel like the crux of this sub is for people that WANT to travel alone and spend a majority, if not all of their time, alone. \n\n\n\n\n\n&gt;Some people have travel/solo anxiety and are doing it, again I get throwing yourself out into the big world but I wouldn't recommend potentially causing a mental breakdown or panic attack just to be abroad.\n\nSo start small. Your first trip shouldn't be abroad if you're trying to overcome travel anxiety. It could be regional, hell even local like to the next city over. \n\n\nWhen you first learn to ride a bicycle, you start with 3 wheels than as you start to get the hang of it, you start to ride with 2. \n\n\nMe, personally, I don't see the point of letting fear ruin your life. So I'll have to disagree with you on this one and absolutely recommend it to anyone trying to overcome their anxiety.",
            "score": 2,
            "author": "PrissyCatttt"
        },
        {
            "level": 0,
            "comment": "It’s okay to do things without a specific reason. Maybe a reason will be illuminated. Maybe it won’t. Doesn’t matter.",
            "score": 2,
            "author": "818a"
        },
        {
            "level": 0,
            "comment": "I would also add to this that solo travel doesn't need to be exclusively \"overseas travel\".\n\nI feel like if you're set on solo traveling (especially for the first time), experimenting in your home country and going out on your own is a great first step to test the waters to see how you like it is like etc.\n\nI've done this, and really enjoyed the experience.",
            "score": 2,
            "author": "Aromatic_Conflict632"
        },
        {
            "level": 0,
            "comment": "I will travel because I have no other choice if I want to go places 🤷🏼‍♀️ I have no one to go with but I want to see other places and experience other things. Would I rather go with someone? 100%. Do I have a choice? No.",
            "score": 2,
            "author": "jessikawithak"
        },
        {
            "level": 0,
            "comment": "Towards the end I was forcing it. Just because I'm never happy with the mundane parts of life and I was always running away from it. But now I just take shorter and less frequent trips.",
            "score": 2,
            "author": "cutefuzzythings"
        },
        {
            "level": 0,
            "comment": "Why do you care",
            "score": 2,
            "author": "jswissle"
        },
        {
            "level": 0,
            "comment": "it's more about knowing yourself and do something outside your comfort zone. you said that traveling solo to make friends defeats the purpose. this depends, if you travel to a country with different culture, making new friends can be just to reach out to other parts of the world and it does not mean that hanging all the time with new friends. it can be mutually inclusive.\n\ni have anxiety going to a country for which most people do not speak english. at first, it can be stressful but once the problem is overcome. it is not too bad.",
            "score": 2,
            "author": "OutsideRide7730"
        },
        {
            "level": 0,
            "comment": "i go solo because i got tired of people bailing on me every time we made plans. i realized i’ll never see the world if i keep waiting for others to join me",
            "score": 2,
            "author": "Dull_Ad5872"
        },
        {
            "level": 0,
            "comment": "I think solo travelling is more of a mindset than anything else. You can easily tag along another person or group of people, while solo travelling - the subtle line is that you're essentially not dependent on any companions, you don't make specific plans together, your journey is based on your vision and ideas and wants. None of that forbids you from inviting fellow humans to join you if they wish so or to ask if you can join them in case their plan sounds appealing to you.",
            "score": 2,
            "author": "PrivateSpeaker"
        },
        {
            "level": 0,
            "comment": "I don’t think you can be forced to solo travel. You might approach the idea a bit naively but without doing it, you’ll never know that you hated it or loved it. Such is life and exploring outside your comforts. Sometimes it works out and sometimes you learn things about yourself. I don’t think even failure is a wasted experience as long as we learn something from it. Maybe a person will realize how unprepared they are and this will motivate them to become a better planner. Maybe solo travel with amplify their personality traits and in “living the dream” realize they can never escape from themselves. Whatever it is, sometimes life and travel are messy and no one in this context is being forced against their will.",
            "score": 2,
            "author": "between-seasons"
        },
        {
            "level": 0,
            "comment": "I think I may understand the OPs point. \nThey're people who have never gone to their own neighborhood restaurant solo or even the movies by themselves, but are booking a 3 month international vacation with the intention of finding their next bff. These are the same people starting threads complaining because their illusions are shattered or depressed asking us if they should go home because of (insert blank) situations. We see the posts.",
            "score": 2,
            "author": "Mizdiville"
        },
        {
            "level": 0,
            "comment": "For me solo traveling is a good way to get out of some of my comfort zones, while i also get to meet people that have similar interests. Some of them can become good friends.\n\nBut i guess that you are right that there is a difference. They will always be part of my travels, but they aren't the reason *why* i travel. I just want to see the world and broaden my horizons.",
            "score": 4,
            "author": "ModestCalamity"
        },
        {
            "level": 0,
            "comment": "I'll disagree. I travel solo, and one of the reasons is to make new friends. I understand your confusion as to why I would do this since it defies the definition of solo so let me explain my rationale...\n\nIf we flip the situation and I travel with people who know me, then I have to be the person I am with them. That's not necessarily who I am. For better or worse they have made certain assumptions about who I am, what I enjoy, what I want to do.\n\nWhen I'm solo travelling I can be me. I can be multiple \"mes\". One day I can be a party person, the next day I can be shy reserved person. I can be extrovert or introvert. I have no feeling of being judged.  I have no hang ups about what others will think. What happens in Vegas stays in Vegas so to speak. I have total freedom over who I am. If I meet new people along the way then they see me as I want to be seen. They see the real me. Those are my real friends.\n\nMy own friends see me as a much more reserved person than I actually am. Part of this is due to living in a very rural area where everybody knows everybody else's business,",
            "score": 3,
            "author": "ConnectBlue",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a great response, I think it's overinterpreting the solo to act like the entire trip has to be asocial. Solo means you are creating the travel experience for yourself and are not beholden to other people's takes and having to compromise with them. I think it's evident why we like that, but how many people you meet or if you do solo vs group activities shouldn't make someone any more or less of a solo traveler.",
                    "score": 2,
                    "author": "roub2709"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely sounds like you're gatekeeping lol, why on earth do you care how other people travel?",
            "score": 4,
            "author": "Langtoppifjella"
        },
        {
            "level": 0,
            "comment": "I've said it a lot here.... if you're unable to be without your friends and family for any duration, if you've never had to be on your own when things go wrong, and if you need constant approval or constantly need noticed.....solo travel will probably not be for you. \n\n\nThis sub is loaded with the 'I'm not making friends, what am I doing wrong?' or 'I'm so lonely, should I just go home now' sort of posts. And I simply don't get it... \n\nThe reality of solo travel is that it's a lot of alone time (aka 'solo')... lots of walking, lots of waiting, and lots of things that don't always go as you planned. \n\nIts not a bullshit instagram or tiktok video.... Most people will give zero fucks about your awful phone snapshots. \n\nI've done this for decades... even before smartphones and the internet.... and it never changes..... seriously, be honest with yourself before you buy that plane ticket. Are you going to be ok by yourself, or will you be whining about the friends you left back home the entire time?",
            "score": 2,
            "author": "da_london_09"
        },
        {
            "level": 0,
            "comment": "Some very good points.  I, too, wonder why people solo travel if the goal is to find friends and a group to connect with.",
            "score": 1,
            "author": "xeroxchick",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would think your statement answers your question - some people don't have a group of friends to travel with and want that experience, and where better to find people that enjoy travel and can travel than while on a trip?",
                    "score": 3,
                    "author": "QuelynD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exactly.  This sub should be renamed socialtravel because an overwhelming number of posts focus in that.  It’s the opposite of solotravel.  \n\nBy solotravel many people here simply mean solotransit and then socialize like crazy when you get there.",
            "score": 2,
            "author": "Frunkit"
        },
        {
            "level": 0,
            "comment": "The whole point of solo travel is to get what you want out of travel *for you*, pretty ironic to judge others' reasons for travelling.",
            "score": 2,
            "author": "phantasmagorica1"
        },
        {
            "level": 0,
            "comment": "I mean…..wanting to gatekeep is not necessary…you still are.",
            "score": 1,
            "author": "doodscool"
        },
        {
            "level": 0,
            "comment": "To meet friends who like to travel! And because my current friends can’t/won’t travel.",
            "score": 1,
            "author": "Codewoman1125"
        },
        {
            "level": 0,
            "comment": "I agree. I worry when I read posts from people who feel uncomfortable being social in their own country expecting to make friends on a trip. If you’re not good at making friends at home, it’s still going to be challenging on your trip. I don’t want people to have a bad time because their expectations are not met. \n\nThat being said, when I was in my early 20s and I wanted to travel and there was no one to go with, I was afraid to go on my own. I really had to force myself. But now I don’t worry about that and I travel on my own often. So, I do think sometimes you need to step outside your comfort zone, which I suspect is what some people are talking about here when they sound like they’re having a tough time.",
            "score": 1,
            "author": "swink386"
        },
        {
            "level": 0,
            "comment": "Different people do solo travel for different reasons. Some want to be alone the whole time. Some just don’t want to be stuck at the hip with someone and be forced to do things they don’t want to do as a compromise. Meeting people at hostels with low commitment let’s you make friends, do fun stuff together and then leave whenever you want to do other stuff. You are in fact hate keeping unfortunately. \n\n\n\nYou solo travel to be alone, not everyone wants to be alone while solo travelling.",
            "score": 1,
            "author": "Prometheus188"
        },
        {
            "level": 0,
            "comment": "I definitely fell into the anxiety category today, which is unusual for me.\n\nBut I learned something I did not like to do solo today. Er, well, two things I suppose.",
            "score": 1,
            "author": "PM_ME_YOUR_CATS_PAWS"
        },
        {
            "level": 0,
            "comment": "The point of solo travel isn’t to always be alone, that doesn’t sound very fun. It is to have the flexibility to do what you want and to have the social ness of any given day be your choice. You can go to a quite place in a city or the countryside and have it all to yourself or find a group in a hostel to do something with. Solo is how you go in but it doesn’t mean how you come out or the duration of the trip. But people should definitely be honest with themselves if ask if they are solo traveling for the right reasons.",
            "score": 1,
            "author": "blaiseboi"
        },
        {
            "level": 0,
            "comment": "I solo travel due to not having friends that either want to travel, are unable to travel (usually timing issues), or make an effort to plan out or make time to travel.",
            "score": 1,
            "author": "Ricemap"
        },
        {
            "level": 0,
            "comment": "I think it’s less about the state before going there and more so having the time to work on those things in a new environment and somewhat having to force yourself knowing immediate circle aren’t around. \n\nFor those who have solo/travel anxiety i would recommend doing a trip in your country but at least 3/4 hours from home - that way it’s a good introduction to a solo trip but still close enough that if there is a major issue it’s possible to get help from those in your hometown but still far enough for that not to be the first resort.",
            "score": 1,
            "author": "shaquille-oatmeal22"
        },
        {
            "level": 0,
            "comment": "I am solo traveling because I want to do what I want to do when I want to do it and I am retired and none of my traveling buddies are. We will meet up during my trip but they only have a week or two to travel.",
            "score": 1,
            "author": "MagyckCrow"
        },
        {
            "level": 0,
            "comment": "i travel solo often simply because my friends generally can't afford to come with me to the places i want to go or they can't take the time off, etc. if i meet friends while traveling, cool. if i don't, also cool.",
            "score": 1,
            "author": "raptorjaws"
        },
        {
            "level": 0,
            "comment": "You don't know until you try. Distance from a stifling home environment is just what many people need. Going into social situations with as close as you're likely get to a blank slate and no future consequences can be freeing. \n\nTrue it can also make things worse but not because people are doing it for the wrong reasons, more they're over ambitious. It's like taking up running and immediately doing a marathon, you have to build up to it. Many would benefit from easing into things and trying to mitigate potential stressors.\n\n Although even that can be tricky , some have a small window of opportunity to travel so it's got to be all or nothing.",
            "score": 1,
            "author": "HappyHev"
        },
        {
            "level": 0,
            "comment": "I had plans of solo traveling before I got into my relationship. I pretty much gave up the idea and was ready to settle down but lo behold the person I was with was a narcissist and even though I had dreams of doing life with her, it didn’t go according to the way I had planned. Ended up becoming less of a person and going through depression afterwards. Booked my first trip with the goal of exploring and experiencing but also for the journey of finding myself and learning to love myself again.",
            "score": 1,
            "author": "AccomplishedPie4292"
        },
        {
            "level": 0,
            "comment": "I think friendships and love are a part of life, they don't disappear just because you chose to travel solo.. you can make friends and find love along the way!",
            "score": 1,
            "author": "bluesnakes321"
        },
        {
            "level": 0,
            "comment": "Solo travel...it's my business, and not anyone else's.\n\nWhy care what motivated others?",
            "score": 1,
            "author": "Prudent-Proposal1943"
        },
        {
            "level": 0,
            "comment": "for le its not really about making friends but friendly encounter with ppl i'll probably never meet again, i dont solo travel because im akward socialy (and to be honest in this case traveling with friends or family is often a better idea) but because i want to meet strangers and living great experiences",
            "score": 1,
            "author": "true-kirin"
        },
        {
            "level": 0,
            "comment": "I solo cuz I’m solo. \nIt would be amazing to travel with someone for so many reasons. However, until I find a travel buddy I’m completely fine with soloing. Cuz (to your point) I travel for my own well-being and I know what to expect when I’m alone.",
            "score": 1,
            "author": "Affectionate_Look_14"
        },
        {
            "level": 0,
            "comment": "There is no \"wrong\" reason to solo travel. \\*You\\* just perceive it as wrong.  You labeled this as a question, but I see no question. I just see you shitting on people who solo travel for the sake of traveling. I solo travel for the sole reason of being abroad. I feel more comfortable and at peace when I'm in Europe. My vacation times and my friends' vacation times don't always align and I'd rather be having a panic attack by myself in a villa by the sea in Greece than sitting on my ass at home watching tv for a week straight. Some of my favorite people on this planet are people I met in Iceland. With social media, it's so easy to keep in touch with those you meet along the way. It allows you to have a global perspective and take your blinders off. Some of my fondest memories are of strangers I've encountered in various corners of the globe. It reminds me that all humans are not shitty and there are really amazing people to meet that aren't within a 20 mile radius of the place I sleep most nights.",
            "score": 1,
            "author": "ur_close"
        },
        {
            "level": 0,
            "comment": "Just because you travel solo doesn't mean you're always going to be alone on your trip. You sometimes meet people along way through tour groups, events that happen on vacation, and many other circumstances.",
            "score": 1,
            "author": "Natural-Leopard-8939"
        },
        {
            "level": 0,
            "comment": "I don’t understand. Why would someone’s personal reasons for traveling the world concern you? You say you don’t want to come across as a gatekeeper, but that’s exactly what you did. There is no wrong answer to why someone decides to travel the world. Just be happy that people are making an effort to experience life on their terms, and save the criticism.",
            "score": 1,
            "author": "jenkins271"
        },
        {
            "level": 0,
            "comment": "One of the reasons I travel solo is because I've had fallouts travelling with friends. That way I have the freedom of doing what i want and when I want, without needing to consideration of others.\n\nBut of course, there will be times you feel isolated and want some company. Ive made some friends along the way even though I might never see them again.",
            "score": 1,
            "author": "Libojr23"
        },
        {
            "level": 0,
            "comment": "For me the reason is lack of funds for the whole family\nAnd interests mismatch.",
            "score": 1,
            "author": "winnybunny"
        },
        {
            "level": 0,
            "comment": "It doesn’t need to be for potential friendships nor dealing with anxieties or fears. I only travel solo and have been for most of my years on this planet. I do it because it is self directed and I do not need to weigh in another persons perspective on where to go, when to go, what to see, what to avoid, when to wake/sleep, what to eat, etc. There is an immense freedom in driving your own travel experience without the interference or input of others.",
            "score": 1,
            "author": "dirkbeszia"
        },
        {
            "level": 0,
            "comment": "Solo traveling fixed my social anxiety don’t judge others for there reasons of doing what they do.",
            "score": 1,
            "author": "Mundane-Bat-7090"
        },
        {
            "level": 0,
            "comment": "The goal is always meeting people, immersing in the experience. Otherwise, I'd travel (solo or not) to a private island\n\nSolo or not is irrelevant to meeting new people while you travel. Solo is not synonymous with cut off from the people around you",
            "score": 1,
            "author": "DirtyPrancing65"
        },
        {
            "level": 0,
            "comment": "Travelling solo to make friends doesn’t defeat the purpose. The dynamic of being at a hostel and meeting people is incredibly different when you’re travelling with even 1 other person.",
            "score": 1,
            "author": "Patriek01"
        },
        {
            "level": 0,
            "comment": "I assumed solo travel was for the introverted loner like myself. Of course introvert doesn’t mean not social. But yeah somewhere along the lines some eat, pray, love got a bit too much influence lol. I really dislike trying to accommodate others interests when I’m spending thousands of dollars so solo just sounds like the better option.",
            "score": 1,
            "author": "FinesseTrill"
        },
        {
            "level": 0,
            "comment": "of course. most people here are like that. because most people do not do well alone. and this is fine and healthy",
            "score": 1,
            "author": "First_Place_Finish"
        },
        {
            "level": 0,
            "comment": "On trekking and backpacking discussions I keep seeing the opposite, people recommending solo travelling and hiking alone, like it was a remedy for every mental health or stress related problem.\n\nLikely they have a job too stressful and work with too many or too obnoxious people, or they don't have no problems at all. I don't like the idea of being alone on long hikes, because I fear being only with my own inner monologue for days. Heck, even one day is sometimes too much, when one is an overthinker like me. Better than being ther with a wrong person tho.",
            "score": 1,
            "author": "Ziriath"
        },
        {
            "level": 0,
            "comment": "Before I travel anywhere, I ask my friends and family if they want to go. I make the plan and propose the whole trip to them. If no one goes, it becomes a solo trip for me.",
            "score": 1,
            "author": "saurov0jbond"
        },
        {
            "level": 0,
            "comment": "People who you say \"force\" solo travel eventually figure it out themselves that it's not for them. But sometimes, people go out of their box to try new things, and they end up loving it. You never know until you try.\n\nRealistically, solo travel can be lonely, but it's actually a good way to meet people, too. Easier than traveling with a group because you'll stay with your group. People who solo travel likely don't have friends around them that travel, but being in hostels, workaways, etc. puts you exactly in an environment who enjoy travel like you do. It's not an unrealistic goal.",
            "score": 1,
            "author": "Conscious-Tone-2827"
        },
        {
            "level": 0,
            "comment": "I think ‘solo’ travel for me has meant renewing my self assurance and independence during different points in my life. Sometimes I think it’s overused to fix issues such as when people may need a therapist instead of a hostel lol but usually I think it can help you realize what you are capable of! I recommend it to everyone at least once in their lives.",
            "score": 1,
            "author": "Charlotte71127"
        },
        {
            "level": 0,
            "comment": "I like the freedom to choose how and where I spend my time, my money, etc. I like meeting people. I don’t necessarily want to be alone, but I enjoy not needing to compromise and knowing I won’t feel I missed out on something because I had to go along with a group decision.",
            "score": 1,
            "author": "Soft-Tangelo-6884"
        },
        {
            "level": 0,
            "comment": "I travel because I was to see and experience other parts of the world. I don't solo because I don't have anyone to do it with 😆 hence forced to go it solo. My desire to travel to a new destination tends to trump my anxiety so that's pretty much it.",
            "score": 1,
            "author": "Devillitta"
        },
        {
            "level": 0,
            "comment": "When I was younger, 22-25, I solo traveled with a goal of making friends. I used to make really fun travel friends in shitty hostels. Now, at 30, I solo travel with a goal of being alone. I now have really peaceful “me” time in nicer hotels. \n\nWhy would it matter to any of you what I’ve done or why I’ve done it? You said you’re not gate keeping but you actually are and it’s kind of silly.",
            "score": 1,
            "author": "gringitapo"
        },
        {
            "level": 0,
            "comment": "What’s wrong with traveling to make friends? What’s wrong with traveling because everyone else says it’s great and they want to try it? A lot of judgement here. If they don’t like it, they won’t do it again.",
            "score": 1,
            "author": "Historical_Leek_9012"
        },
        {
            "level": 0,
            "comment": "Why do the reasons people choose to solo travel bother you? Lol I think everyone for sure should only do things if they genuinely want to and not to live up to anyone else’s expectations. However, I think most people who choose to solo travel want to and it doesn’t matter their reasons lol I’m someone who loves meeting new people on my travels and it’s one of my fav parts of travel. I don’t expect to make long lasting friendships per say, but if someone wants to socialize and make connections on their trips, that’s cool; don’t think we should judge them. Also it’s normal to have these lofty expectations as a young person lol it’s just part of being young and having that idealistic view imo is beautiful. Reality might hit you a few times but nothing wrong with romanticizing life. If everyone was “realistic” 100% of the time, life would be very boring.  \n\nAnd if someone wants to solo travel to learn to be by themselves/get comfortable with it/improve their anxiety…nothing wrong with that! Lol like I guess if one’s mental health is particularly fragile, that’s one thing, but if you have some coping skills, this is actually a great way to tackle fears. Anxiety only improves with exposure and CBT lol\n\nI just find this post weird lol like why does it matter the reasons people travel..how does it affect your travel experience",
            "score": 1,
            "author": "Brooklynlife1800"
        },
        {
            "level": 0,
            "comment": "Maybe this ain’t it fam",
            "score": 0,
            "author": "Handbook5643"
        },
        {
            "level": 0,
            "comment": "It doesnt matter. \n\nWhatever the reason may be, whether its stupid or mimetic or makes sense, it doesnt matter :) \n\nEvery time someone get out of their shell thinking they are right and meet the solo travel world, they find someone with a different motivation altogether and might find it every bit contrary to theirs, and whether they realize it today or tomorrow or never, it doesnt matter. \n\nThere is no success or failure to solo travel, maybe I went out to find a woman, but ended up meeting someone who taught me valuable lessons in life, maybe I did have that agoraphobic breakdown or episode, which taught me that there is nothing to fear, because everyone's new to this place.",
            "score": 0,
            "author": "oi_piglet"
        },
        {
            "level": 0,
            "comment": "I solo travel specifically to smoke weed because none of the people I know smoke. Is that a good enough reason?",
            "score": 0,
            "author": "Barca-Dam"
        },
        {
            "level": 0,
            "comment": "I just can't believe this many people have opinions about other people's travel choices. Let 'em go and figure it out for themselves.",
            "score": 0,
            "author": "Love_my_garden"
        }
    ]
}