{
    "id": "13xmi5n",
    "score": 343,
    "title": "Women - how do you deal with unwanted male attention while traveling alone?",
    "author": "mh942",
    "date": 1685637706.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13xmi5n",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got back from a short sightseeing trip to Chicago and unfortunately had a few issues with harassment during the daytime.  I've had minor instances of catcalling here and there when traveling over the years, but never anything I couldn't quickly dismiss.  This trip was different, as I had a few instances mid-day in civilized/popular areas (Michigan Ave for one) where guys yelled derogatory comments as I walked by, and also had a guy who wouldn't stop trying to engage/hitting on me at an afternoon Sox game (shoutout to the awesome group in the row behind me who knew exactly what was up and looked out for me!).  \n\nTo provide some context, I'm a late 20s white female.  I have a very average appearance and am a bit on the heavier side. This past week I was wearing unisex t-shirts, hair in a bun, no makeup.  I give this information not to victim-blame/shame those who dress different by any means (it's the culture that's the problem, not the women), but just to give an idea that in these situations I was pretty nondescript and unsure how to fade into the background more. \n\nI have a pretty severe anxiety disorder, so I tend to always anticipate the worst when traveling and have a strong guard up; that being said, situations like these definitely don't calm my nerves or make me eager to travel more.  **For those who have found themselves in similar situations, have you found anything that relatively helps the issue (like the wedding ring thing)?  How do you calm your nerves and try to move past it, in the event it happens?**\n\nThank you for all input/suggestions!",
    "comments": [
        {
            "level": 0,
            "comment": "OP appears to have requested personal experiences from (women/people of color/LGBTQ+ travelers). If you are not a member of the requested demographic, please carefully consider whether your post will add value to the conversation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I’m from Chicago and I’m sorry you experienced this! Unfortunately it does happen, especially in big cities. I try to walk quickly, like I have somewhere I need to be, and look angry. Not fuming, but like I’m not going to take shit from anyone. It’s always served me well.",
            "score": 415,
            "author": "emccaughey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, I’ve always known I have a pretty severe case of resting bitch face but I’m currently on holiday in the US and a crack head told me I “look like an evil bitch who hasn’t been fucked in a year”.\n\nMakes sense why other than that encounter I’ve been mostly left alone I guess.",
                    "score": 113,
                    "author": "littlebetenoire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know this is a serious discussion but that made me cackle. Sometimes crackheads really know how to find a weak spot 😂",
                            "score": 58,
                            "author": "geniamh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No it’s fine. I can laugh about it now that he’s not actively next to me telling me I’m a Russian spy and that my Bluetooth headphones are microchips controlling my brain.",
                                    "score": 7,
                                    "author": "littlebetenoire"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Resting Bitch Face works wonders 🤣",
                    "score": 21,
                    "author": "Felonious_Minx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My RBF just got me filmed on a train by some local dude. I didn't even register what had happened until I'd gotten off.... wtf people, stop filming others, it's weird",
                            "score": 11,
                            "author": "opheliazzz"
                        },
                        {
                            "level": 2,
                            "comment": "I suck my cheeks in when I walk and it turns my mouth down into a frown naturally, and it has served me well in places I don’t want to be bothered",
                            "score": 3,
                            "author": "filthymouthedwife"
                        },
                        {
                            "level": 2,
                            "comment": "some guys see mine &amp; take it as a challenge, unfortunately",
                            "score": 3,
                            "author": "CrabbyKayPeteIng"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's worth mentioning that overall I had a lovely trip and would come back to the city again! (I had been in the past a few times but not in the past \\~10 years).  This didn't sour my opinion of the city.  I get that, unfortunately, it's a problem in many areas.",
                    "score": 86,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you  for that. I'm a native Chicagoan and love this city. There will be asshats everywhere. I'm a 66 yo male and find that the best way to avoid street urchins is to walk with confidence and do not pay them any attention.",
                            "score": 11,
                            "author": "Openhigh4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm convinced that always looking angry is the key to living in a big city",
                    "score": 8,
                    "author": "UnexpectedSharkTank"
                },
                {
                    "level": 1,
                    "comment": "in small towns they will skip to the marriage proposal",
                    "score": 14,
                    "author": "818a"
                },
                {
                    "level": 1,
                    "comment": "I follow this too, but the whole 'I've to be somewhere' logic makes me further anxious- and I wonder why I can't just enjoy the moment (Context: This isn't specific to when I get unwanted attention, but in general, akin to OP- my guard is up when I travel solo, so I'm constantly 'trying to get somewhere in a hurry')",
                    "score": 4,
                    "author": "SureOKBueno"
                },
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll pretend to not know English, and speak Hebrew to them.",
            "score": 82,
            "author": "thatsnotaviolin93",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did this with French in Mexico many years ago! May have to do it again!",
                    "score": 48,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had to use German when I was in Morocco, because somehow all the hecklers in Tangiers spoke Spanish, French, English, and Arabic",
                            "score": 58,
                            "author": "bigdatabro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hecklers dedicated to their craft for sure 😂",
                                    "score": 20,
                                    "author": "thedoobalooba"
                                },
                                {
                                    "level": 3,
                                    "comment": "that's hilarious and annoying lmao",
                                    "score": 2,
                                    "author": "SemperSimple"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Omg I did the exact same thing, had a persistent guy in Mexico who ran off as soon as I started speaking French. Very effective, need to make list",
                            "score": 6,
                            "author": "wandamaximoffs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This reminded me of an incident years ago when I was a personal trainer. I was walking down the street in my gym gear and this dude was yelling after me, calling me \"workout Annie!\" and talking about my rear end 🙃\n\nI completely ignored him and when he caught up to me he said \"what's the matter? don't you speak English?\" and I replied \"not only do I not speak a word of English, I'm also a lesbian\"... lol. \n\nHe was like \"oh ok, ok, so you don't wanna talk to me?\"... 🤪\n\nI mean, who thinks it's charming to run down the street yelling at the top of your voice about someone's body parts? No, I don't wanna fuckin talk to you. Get away from me.",
                    "score": 25,
                    "author": "TigreImpossibile",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is such a great idea 😂",
                    "score": 3,
                    "author": "thedoobalooba"
                },
                {
                    "level": 1,
                    "comment": "I did that but pretended to be deaf (I learned ASL in college and still try to practice, though there aren’t really any deaf people in my area to connect with), and started signing that I couldn’t understand the two older men who were “just trying to say good morning to me, why was I being so rude and ignoring them?”, and they just kept asking me why I was ignoring them and being rude. At the time I was pretty shaken up and ducked into a McDonald’s (they didn’t follow), and I was rather frustrated that it didn’t work. My only guess is that they’ve never seen sign language before, and had no clue what I was doing.",
                    "score": 2,
                    "author": "catreader99"
                },
                {
                    "level": 1,
                    "comment": "Kind of you not to launch in to full Krav Maga!",
                    "score": 1,
                    "author": "mohishunder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've done the 'wedding ring' thing, but haven't noticed it made much difference in deterring people.  Neither does what you wear, honestly.  I'm not much to look at and usually wear long pants, loose tshirts, never wear makeup, etc, too.  But it's not really about what you look like or wear, it's about their need for power and getting a reaction.\n\nI just ignore ignore ignore.  No eye contact.  No reaction when they catcall.  Deny them the reaction they want.  But remain aware of what's around you and get out of the situation/area as quickly as possible.  Walk away.  And walk with *purpose*.  Don't wander.\n\nIn situations where the harassment gets bad, step into a store or restaurant or someplace supervised where you can find help and witnesses.  I enlisted the help of people behind the counter at a gas station when I was in a particularly threatening situation once.  Usually people will help you.\n\nReally, it's all the same stuff I do at home.  The only difference for traveling is that you should probably make yourself aware of how to get help in a foreign place beforehand.  (ie: how to call the police, how to ask for help in the local language, etc).  Write it down and keep it handy, just in case.",
            "score": 183,
            "author": "jadewolf42",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the Sox situation I was fortunate to have a group behind me around the same age that was tuned in to the situation.  When the guy would make a weird comment here and there (\"I feel like I've seen you before\" \"you on Facebook?\" \"we're going to \\_\\_\\_\\_ bar after this\" etc.), one of the guys in the group behind me would grab my attention, like \"oh, this player at bat is the one I was telling you about earlier!\" or \"hey have you ever had \\_\\_\\_?\" (point to some random food/drink banner)\n\nI had a similar situation with help from bystanders many years ago in Vegas where I was walking out of the Bellagio back to the strip and there was a crazy belligerent guy (definitely drunk, but probably drugs as well) throwing cans and walking around in pajamas.  I walked up to the people a few steps ahead of me (two couples \\~30s) and asked if I could walk with them for a bit because I didn't feel safe.  The husbands were immediately like \"we got you\" and they all walked back with me until we passed my hotel and kept talking to me the whole time.\n\nIt's a funny concept to me that in situations like these, strangers can both cause the issues and sometimes be the best help!",
                    "score": 124,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, there's good and bad out there.  I've had bystanders step in and it's always appreciated.  I try to return the favor if I see someone else being harassed and intervene if I can.\n\nGlad you had some folks to back you up in those previous encounters!",
                            "score": 36,
                            "author": "jadewolf42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They did an expirement not long ago where they found out that people who faced some prejudice before (be it racism, sexism, etc) are much more likely to step in when they see something unjust is happening to someone.",
                                    "score": 17,
                                    "author": "_bvb09"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm always grateful to the people around me who paid attention and looked out for me. Sometimes it's even just communicated with the intensity in my eyes as I make eye contact and they don't even need to know what happened, they just understand that I need some kind of help and I'm grateful when people notice, and watch out for me.",
                            "score": 23,
                            "author": "between-seasons"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like person in the group behind you had some excellent bystander intervention training, great to see it in use! So sorry you had to experience that",
                            "score": 2,
                            "author": "-Edna-"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll be honest that I was leaning more towards the inclusion thing at first, then went the other way as it went on.  I have no issue talking to people at a ball game and have had great conversations with people sitting in the seats around me many of times.  At first the guy was being pleasant, nothing alarming, just talking about the game in general.  He had a friend with him who then suddenly went missing for the last few innings, which I'm thinking was intentional (he made some comment at one point about he and the friend driving together, so he didn't leave).  Once the friend was gone, the attempts to engage started to get weird.  The \"are you on Facebook\" was just weird af.  I immediately said \"no\" to shut it down and he said something along the lines of \"you're a different kind of woman\" , which again was concerning.  Had I not had an awesome group of people behind me who were clued in, I would have tried to make as graceful of an exit as possible to avoid any further attempts.  When it started to get really weird was in the final inning, so at that point I thought it would be worse to immediately react and leave (showing I was impacted by it) and just rode out the inning knowing the group behind me had my back.\n\nI totally get where you're coming from with this perspective though, and didn't think anything of it until his questions took a sharp turn.",
                                    "score": 18,
                                    "author": "mh942",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Men are dumb idiots. They really are.",
                                            "score": 19,
                                            "author": "ResistCompetitive852",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Man here. Can confirm.",
                                                    "score": 12,
                                                    "author": "mushuggarrrr",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "'Nother geezer reading this - yep.",
                                                            "score": 4,
                                                            "author": "ArticulateAquarium"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People who care about a wedding ring aren't people who catcall",
                    "score": 26,
                    "author": "centwhore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this has always been my feeling on it as well, but was curious if others had different experiences",
                            "score": 5,
                            "author": "mh942",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s something that helps in specific places/cultures where women are more expected to be married at a certain age, and the harassment is more of a standard way to act towards what is considered a “loose” woman. And also an aspect of fear of the husband retaliating if you bother the wife too much. In Western countries I think it’s entirely useless.",
                                    "score": 12,
                                    "author": "AshToAshes14"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep, exactly.",
                            "score": 3,
                            "author": "jadewolf42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my personal experience I tend to get less people hitting on me unwanted in public when I “dress up”, like I’m going somewhere “important”. Reason is that regular run of the mill clothes makes the crusty men feel like you’re more accessible to them, increasing their chances of hitting on you. Likewise if you dress up then they will know that you are out of their league and they’re less likely to hit. Not completely preventative but it’s helped a few of my friends and I.\n\nSomething that also helps is my mindset to “never entertain a bitch on the street” and by that I mean that I don’t talk to or engage with strangers, especially if I’m walking on the street. I don’t know them, so I can just walk away. I can briefly acknowledge them, as an “I’m watching you” kinda look, but I just don’t engage. If they don’t understand boundaries never be afraid to tell ‘em off or tell them to leave you alone.",
            "score": 209,
            "author": "thewodpack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never thought of it that way... thanks for this perspective! With the nature of this trip (was going to baseball games daily) I think I would've felt a little odd wearing anything besides casual/workout clothes but I'll definitely keep this in mind for the future! \n\nI usually just look straight ahead and ignore, which I did yesterday; when that didn't work, I kind of put up a hand to indicate I wasn't interested/stop (it was someone handing out flyers) and then they started yelling after me.",
                    "score": 45,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Walking with a purpose, wearing sunglasses and headphones keeps most of them at bay. I’ve really only had to tell a guy to quit it once (actually in Chicago, but way outside of downtown), and that was cause he was being an idiot and I was trying to just get to Mariano’s after a workout. \n\nOtherwise walking into a nearby open business does wonders too. That’s how we got the stray dogs to stop following us in Cusco too.",
                            "score": 26,
                            "author": "hot-whisky",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This, do this u/mh942. Adding to what u/thewodpack said: also wear sunglasses, earbuds, &amp; a wedding ring. Keep the earbuds silent so you can stay aware of your surroundings. The earbuds give you full plausibility to both ignore &amp; start talking as if you’re on a very important business call with a group of people who can hear everything going on. I’ve had friends go as far as using them to record especially egregious or dangerous situations automatically uploaded to the cloud. Bonus: if they are Bluetooth you can use them to call 911.  If I’m going somewhere causal, I just change when I get there (when I was single, I ditched the ring too.) It’s a pain, but honestly anything that makes you seem less accessible &amp; less attractive bait is worth it imo. \nLPT: If a guy is really bothering you, look for a lady who looks like a mom or is 40+ yo &amp; walk up to her. Just start talking as if you know her &amp; motion towards the offender. We will understand &amp; help you. We’ve all been there. This is about power for the guy &amp; he’s not looking to have it questioned by someone’s mom or an “Old lady”. He’ll generally back off.   \nAs for the baseball situation, I’ve found it very helpful, in my youth, to casually work in stories about my brother who is a cop. Funny story, when we were teens he broke the arm of a guy who kept bothering me. I’m in town to see him &amp; he’s picking me up after the game. He’s here for a convention. He just bought a new HK 9 mm. It’s really pretty. I can’t wait to try it out. Every time the creep talked, I’d work in something about my brother &amp; overprotective father who is also a cop. I still use a similar story for when tradesmen come over, only now it’s my youngest brother who is staying with me right now. There are a pair of used tactical work boots in my entryway. I occasionally move them around &amp; set them outside. I have no brothers.",
                    "score": 15,
                    "author": "Lcatg"
                },
                {
                    "level": 1,
                    "comment": "Love this, this is my exact approach too! LOL, “never entertain a bitch on the street!”",
                    "score": 4,
                    "author": "PringlePasta"
                },
                {
                    "level": 1,
                    "comment": "This actually explains a portion of my life I've been wondering about 😂👏 Thank you",
                    "score": 11,
                    "author": "ellefordestiny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same way I do at home, \"I'm married.\" For catcalls, ignore.\n\nMen have so much respect for my imaginary husband.",
            "score": 107,
            "author": "kittyglitther",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha this is great! I thought about it yesterday but my only concern was if it would lead to more - like \"oh, he's okay with you traveling alone?\" or something along those lines.  I was concerned the lie would stress me out, but I did seriously think about it!",
                    "score": 24,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I'm not traveling alone, we're here for his work.\"\n\nMy imaginary husband is a very powerful executive who takes me on all of his work trips because he just can't stand to be away from me! 😉",
                            "score": 103,
                            "author": "kittyglitther",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great idea! I'll have to start working on concocting my fake husband's backstory!",
                                    "score": 34,
                                    "author": "mh942",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes honestly it works wonders, I remember I got in an Uber once and the Uber driver kept hitting on me, asking me personal questions, then the moment I said “Hang on a second my husband is calling me”, he immediately shut up and didn’t say a single word to me the rest of the trip LOLLLLL",
                                            "score": 28,
                                            "author": "Maleficent_Flan_721"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Definitely this ^^ NEVER let strange people know you’re traveling alone.",
                                    "score": 33,
                                    "author": "Sad_Application_7524",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I feel there Is balance. I travelled a lot by myself, i usually Say that cause i dont like making up stories and what if i get along with this Person well? Now i have to lie all the time or do i Say i lied? Weird situation anyways.\nIt's also easy to connect with other solo travellers, or wannabes. If someone annoying Is talking to me i find a way to go away, maybe saying i'm with someone in this case, or if they know im not i can Just Say i Need to meet up with some people i Met at hostel (which Is probably true anyways). Being a solo traveller doesnt mean you are travelling alone in my experience.\nOther solo traveller girls are strangers but also really nice, why lose the opportunity of a good connection?\nBtw i only travelled by myself around Europe, context is important.",
                                            "score": 2,
                                            "author": "Revolutionary_Sand60",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly thank you. I have no interest in lying let alone keeping up a lie. I am literally right now talking to four different guys/romances I met on my most recent trip (I just came back) and that’s not counting the many other dalliances I had. How would any of that be possible if I had pretended I wasn’t alone… I can guarantee they wouldn’t have pursued me or invited me to as much stuff etc etc. And as you say it’s easy to say you have to go somewhere if things get weird. Also if you’re in a hostel almost everyone is by themselves so super weird to pretend you’re not",
                                                    "score": 2,
                                                    "author": "Just_improvise"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a solo traveller I completely object to this and will not do it. It’s 2023 and I’m independent and single. Obviously I don’t engage with people who seem suss.",
                                            "score": -3,
                                            "author": "Just_improvise",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You don't always know who's sus though. Some people take a while to show it.",
                                                    "score": 4,
                                                    "author": "valiciachita"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Why do you completely object to this? Is announcing you’re independent and single important to do with strangers you have no intention of entertaining? Having this very simple lie as a deterrent seems like a no-cost advantage.\n\nI’m a man, making it inherently safer, and I still won’t tell people I’m completely alone when I travel. “Someone” is always expecting me, or meeting me. Ya just don’t know, even if you think you do, and your first big misread could be your last.",
                                                    "score": 3,
                                                    "author": "JazzlikeWing6233",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fr, I don’t think it matters if you’re a man or a woman, don’t ever let strangers know you’re traveling alone. There’s just so much that can happen to you that it’s simply not worth the risk, no matter how much you want to prove your independence (which I can kinda understand as a woman myself, but safety should always come before trying to prove your independence)",
                                                            "score": 2,
                                                            "author": "catreader99",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Oh, no, he hates it. When he finds me he's going to kill anyone I'm with! Again! He's such a jealous silly boy!\"",
                            "score": 11,
                            "author": "LibraryLuLu"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  I thought about it yesterday but my only concern was if it would lead to more - like \"oh, he's okay with you traveling alone?\" or something along those lines.\n\nJust tell them that he's currently training for his upcoming UFC fight.",
                            "score": 6,
                            "author": "YuanBaoTW"
                        },
                        {
                            "level": 2,
                            "comment": "How would strangers on the street know you’re traveling though?",
                            "score": 3,
                            "author": "gypsysinger",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "currently in Napoli, Italy and it’s like every 10 feet someone is calling out to me. I just ignore it and unfortunately it’s just been part of my experience so far. I don’t react at all and that’s been the best for me. But like others have said, just be mindful and if someone is following you or is aggressive, pop into a shop and they usually keep walking. Unfortunately, Naples is somewhere where I don’t walk at night alone. I either get a cab or go out earlier in the day to avoid trouble.",
            "score": 60,
            "author": "blueberrrybread",
            "replies": [
                {
                    "level": 1,
                    "comment": "Italian men are very forward. Even the nice ones are just way more forward than the average U.S. male.",
                    "score": 28,
                    "author": "between-seasons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "theyre very forward but unfortunately a lot of them find street harassment completely acceptable too. one of the parts of my culture I dislike , a lot.",
                            "score": 33,
                            "author": "420gnar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was staying in a hotel/hostel outside of Rome and a young Dutch lady there offered to make me a lunch of cold meat cuts and salad in the communal gardens, then we went to a few venues in the city and I bought us a glass of white in one of those plazas they charge a fortune to sit in. Looking back, it was probably so she wouldn't be harassed while seeing the sights. The same (pretty young women asking me to accompany them) has happened in several other places like Madrid (she was Brazilian) and London (American). I'm an experienced traveller, friendly but not very gregarious or loud - also over 6 foot tall, dress conservatively (no logos), and definitively over 40y/o. I can say confidently I've never knowingly made a woman feel unsecure or threatened (I can also often be a bit dull, tbh). \n\nNapoli is super aggressive, although as I can easily pass for Italian I fortunately wasn't harassed or intimidated once there. I was in Barca quite a few times by dudes, ha ha, and in Vietnam by hawkers - a withering look goes a long way ;)",
                    "score": 5,
                    "author": "ArticulateAquarium"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was a common issue for me when I was in my teens/20s. I took some self defense classes to gain the ability to handle a situation if it got really bad. That really built up my confidence and my changed perspective made most harassment just an annoyance. Part of the program was practicing key phrases for common situations in an off-putting tone. I have a very strong \"no\" voice now. When that wasn't enough, I'd generally approach a group of strangers for help. The closest group that feels at all comfortable, I'd just ask \"can I join you for a bit? This guy won't leave me alone.\" No one has ever turned me away. \n\nNow, I'm old and fat though. I almost never get harassed anymore. Lol I do step in when I see similar situations though. Usually just step right between the victim and the harasser, with my back to the harasser, and start a conversation with the victim. Keep their eye contact on me, and loudly cut off the harasser like they don't exist whenever possible. It's nerve racking, but they always walk away after a couple minutes.",
            "score": 43,
            "author": "Svecmom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same with me! Sometimes old and fat has its perks!",
                    "score": 22,
                    "author": "sharkbitejones"
                },
                {
                    "level": 1,
                    "comment": "Well I guess I'll look forward to getting older (and wiser) then! That was part of why I mentioned the weight... not that it is EVER okay for a beautiful skinny girl to get harassed, but I'm not what one would consider conventionally attractive so I guess I'm always a bit caught off guard by it?",
                    "score": 11,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My weight came on REALLY fast because of medical stuff. There was no noticeable difference in men showing interest. The older I get, the older the minimum age of the creepers gets though. At 45, only guys over 60 are generally creepy/pushy/etc. I'm like catnip for the polite, respectful 30-somethings though. 😂🤷 (More things to look forward to)",
                            "score": 10,
                            "author": "Svecmom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i find that my friends with people-pleasing tendencies unfortunately end up getting catcalled, questioned, followed etc. much more. i think shitty men can sense it and it opens the door for them to seek some sort of reaction. \n\ni live in a big city and i’m dead cold to anyone catcalling, which luckily generally works for me. i ignore, look right past them, try not to even acknowledge a human presence. if i feel safe enough sometimes i’ll chuckle to myself at how pathetic the catcall was. usually, just walk away with an unchanging posture and get past it.",
            "score": 33,
            "author": "raven_kindness",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not me but my female friend is from New York and had the unfortunate way of developing a combination of sarcasm and sassy. \n\nFor instance, while she was taking a walk on a night out with her outgoing clothes, rbf, and stern walk, a guy would say to her, \"Hey girl lets see a smile you don't look too happy\". She then yells back, \"NO ONE HAS MADE ME LAUGH YET! IT'S BEEN SUCH A TERRIBLE DAY\". \n\nShe then proceeds to keep walking while the guy was left there and didn't know what to say.",
            "score": 53,
            "author": "Silver_Scallion_1127",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this!!! The \"let's see a smile\" line is one I hate the most!  A \"hello beautiful\" or something like that... whatever.  I don't like it, but can easily ignore and move on.  The smile one irks me so much!",
                    "score": 25,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldnt doubt it. And the way that my friend made it seem that talking back sassy or ignoring them might have them try harder. Leaving them confused has been working well so far.",
                            "score": 7,
                            "author": "Silver_Scallion_1127"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; while the guy was left there and didn't know what to say.\n\nYeah because she sounds unhinged, lol.",
                    "score": 4,
                    "author": "lookthepenguins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best way to appear. Jackasses are less likely to fuck with crazy bitch energy.",
                            "score": 18,
                            "author": "EmpressStardust"
                        },
                        {
                            "level": 2,
                            "comment": "Good\nThat’s what it fvkking takes\nJeezuz",
                            "score": 4,
                            "author": "tungchung"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’ll be shocked at how your reaction and body language will change how someone acts. \n\nI was on a flight a few months after covid started. Got stuck next to a lady who did not care about anything. She was talking on the phone when she got on and didn’t even ask me to move so she could get to the window. Instead she smacked me in the head with her giant bag on her shoulder and stepped on my feet. Next thing you know she refused to put her mask on. Of course at this time it was a huge deal. The flight attendants were coming by every few seconds to tell the lady to put her mask on. Then the pilot was talking to this woman. This is when I did what I did best… I went into my dead stare and stared daggers into seat in front of me, clenching my knuckles so they turned white, shaking my leg - I honestly probably looked like I was going to go crazy. I also turned up my music so only she could hear. I saw her look at me for a couple seconds and almost instantly, she just started cooperating, she kept her mask on for the rest of the flight and then passed out snoring. I felt very proud of myself that day to say the least.\n\nI’d never hurt a fly by the way, but I knew if I looked just a little crazy with simple body language, she’d stop protesting.",
            "score": 10,
            "author": "gggggfskkk"
        },
        {
            "level": 0,
            "comment": "In big American cities, just keep walking. Don’t make eye contact. Shoulders up, tits up. Have a co fixent stride. It can be hard with anxiety. Sunglasses help. Just pretend you know where you’re going and keep walking when someone catcalls you. \n\nIn my experience, most men that catcall do it to get a rise out of women. They know it’s not going to get them a date.",
            "score": 10,
            "author": "TheFuckityFuckIsThis"
        },
        {
            "level": 0,
            "comment": "Ignore. Ignore all the way. \n\nGet cat-called? Ignore. Don’t be afraid to say NO. In fact, just say no, or don’t even answer or explain yourself. Practice a resting bitch face.\n\nOnce, when I was drinking alone at a cliff bar in Indonesia, a guy comes and sits next to me, offered to buy me a drink. That was my first NO, and he proceeded to chat up with such broken English (barely had any vocabulary), and resulted in asking me this: ‘you, come, my room.’ That was my second NO to him.\n\nAnyway. Ignore all the way, or say NO. Just NO.",
            "score": 23,
            "author": "Tricky-Chipmunk-135",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh! Sorry that happened to you! My typical approach to catcalling is ignore, ignore, ignore.  With the last incident yesterday, I looked straight ahead, kept walking, put a hand up to say \"no\" when he tried to hand me some kind of flyer, and unfortunately it was after that it got worse.",
                    "score": 9,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I start cussing them out in my native language with a very apparent disgusted look on my face. They stop feeling smug real fast. For some reason, it takes away their courage. I then laugh at them condescendingly lol.",
            "score": 17,
            "author": "facciabrutta",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Act like they’re invisible. Act like you don’t hear them or see them. If you have to give someone an answer to something, have it be very curt and cold. That’s how I deal with it and I feel like it’s always been very effective. \n\nIn bigger cities, everything is moving pretty fast so there’s a lot of things in general that you have to ignore. I think the best thing to do is to just brush it off and keep moving and go about your business. Just treat it as background noise.",
            "score": 26,
            "author": "WhatAboutMeeeeeA"
        },
        {
            "level": 0,
            "comment": "Yeah that happened to me in Paris and Amsterdam. The taxi drivers in both cities wanted to meet up later. I changed the subject but yeah it was uncomfortable being in that position. For reference, I was 39 and Mexican-American. I assumed it was because I was traveling solo overseas and they thought I was lonely (I was not). So I would be interested I. Thoughts about how I should handle that since I do travel solo frequently (although the next trip I did rent a car and felt infinitely safer).",
            "score": 16,
            "author": "Busy_Principle_4038",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's scary, especially if the drivers picked you up or dropped you to your hotel",
                    "score": 2,
                    "author": "thedoobalooba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the dude in Paris I just said something like I was meeting friends but yeah it was not great",
                            "score": 3,
                            "author": "Busy_Principle_4038"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really gained a lot of confidence in a self defense class. The class was thorough and we practiced different scenarios including street harassment- we actually practiced ignoring, rbf, etc. I really liked the safe space of the class … as much as I resent the world that makes it necessary.",
            "score": 5,
            "author": "spooses",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is good to keep in mind! thanks!",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was followed by a man briefly whilst I was in Berlin last year in July. It was late, dark and he was for sure under influence. As soon as I took my phone out and pretended to be talking to somebody, he turned around 180 degrees and immediately lost interest. I didn't expect it to work, but it did.",
            "score": 5,
            "author": "Alienaura"
        },
        {
            "level": 0,
            "comment": "I'm fond of the \"crazy bitch\" approach: stop, look then dead in the eye, and say-- completely serious--\"You're skin is lovely. It would make a great lampshade in my living room.\" Then keep on trucking. Most dudes don't know how to react to that and will look for someone less potentially unhinged to pick on. \n\nSince you have an anxiety disorder it's probably not a great option for you-- but even thinking it as a response is super hilarious... so bursting out into laughter at persistent twats is almost as effective.",
            "score": 34,
            "author": "TimmyIV",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love stuff like this and wish I had the audacity to do it- at best, I would get the words out of my mouth and then like run away crying 5 seconds later haha",
                    "score": 14,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Try the biggest eyeroll you can do in their general direction and then continue on your way",
                            "score": 2,
                            "author": "ArticulateAquarium"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know how to tell people to piss off in multiple languages, so I just use the one I think they’d fear most. I had men calling at me in Italy and I yelled back in Arabic with a little bit of aggressive body language. Everybody moved along reallllll quickly after that. German, Russian, and Arabic seem to be the best bet to make people think twice about engaging with me.",
            "score": 25,
            "author": "munichbish"
        },
        {
            "level": 0,
            "comment": "I’m a Russian girl with an angry face, so I think it helps me. I’m also not too shy to be rude to men. Even street scammers leave me alone because I just glance at them like a rabid dog that is about to attack them, and they prefer to find another target. I was at a night club in Hanoi a couple of months ago and a random guy dancing close to me put his hand around my waist. I grabbed his hand, pushed it away and sternly told him “don’t touch me”. He quickly disappeared into the crowd, never saw him again lol. \n\nWhen people annoy me I just let my face express the whole spectrum of negative emotions.",
            "score": 24,
            "author": "cheeky_sailor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m working on a bitch face rn. 🫡",
                    "score": 1,
                    "author": "Searching_4_her_Word",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not just a resting bitch face, but an aggressive bitch face usually helps for me.",
                            "score": 4,
                            "author": "Sad_Librarian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "head down and keep walking works for me",
            "score": 4,
            "author": "Dull_Ad5872"
        },
        {
            "level": 0,
            "comment": "The only thing that goes through my mind is my safety. I assume all strangers could be potentially danger. I do my best to ignore and not engage or make eye contact. I’ve gotten touch groped and grabbed before. You have to be aggressive and let them know you’re not afraid of them",
            "score": 6,
            "author": "shockedpikachu123"
        },
        {
            "level": 0,
            "comment": "When I studied abroad in Rome, I noticed that the Roman women walked very quickly to where they were headed and did not make eye contact. I realized that was totally different from the way I walked and started to adopt that method of not giving the opportunity to be stopped/harassed. It did help. I went on to live in NYC for years and did the same.",
            "score": 4,
            "author": "Tambermarine"
        },
        {
            "level": 0,
            "comment": "From your description it sounds like we dress pretty much identically! For the last two years I've been solo traveling/living in Eastern Europe/the Caucasus. The only thing that stops men from talking to me is a fake wedding ring and the willingness to lie about my \"husband.\" It's immensely frustrating, but at this point I've learned to deal with it. If they ask me questions about him I just make something up and brush off their questions until they leave.",
            "score": 12,
            "author": "Calligraphee",
            "replies": [
                {
                    "level": 1,
                    "comment": "may give the wedding ring thing a try on my next trip... thanks!",
                    "score": 7,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretend phone conversations. How sad we even have to do shit like that.",
            "score": 13,
            "author": "windowseat1F"
        },
        {
            "level": 0,
            "comment": "Aww man I remember the days of constant cat calls and being hit on. I grew up in NYC, had it all. \n\nI settled on a super friendly aggressive approach. Like when passing a dude or group of dudes is look them right in the eye and say \"good morning!\" But keep walking. \n\nThey never know what to do when you don't seem scared, and the friendly greeting always seemed to put them off balance.",
            "score": 11,
            "author": "ohliza"
        },
        {
            "level": 0,
            "comment": "I’m in Istanbul, Turkey now and even though I’m older the carpet salesmen and restaurant guys are very persistent. \n\nI had a carpet salesmen follow me into a line  to see a museum down the road from his shop. He talked to me for about 10 minutes. \n\nThe kibe was long and he kept trying to talk me out of it…said to come back later when it would be shorter.\n\nAfter I insisted I really didn’t need a carpet he want to know if I wanted coffee or tea. When I said no to this, he suggested wine. \n\nI smiled and said no thanks…but he was even waiting for me outside the museum. This time he was suggesting we walk to garden not far away…again, I tried to be polite but firm. It’s a bit scary as I may run into him again…\n\nUsually I just do what the lady above said, I smile and half wave (but am really putting my hand up to say no), look away and just keep walking.\n\nI think here they’re harmless…but to me it shows a lack of respect and is very tiring.",
            "score": 11,
            "author": "GorgeousUnknown",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just think they're not talking to me. Don't turn around. Don't give them any attention. \n\nWhat I would love to do though (but never do because it always catches me off guard) is turn around and bark like a dog at them. Or even say omg I was just looking to find a husband today that shouts at me in the street, what's ur number? Get their number and post it everywhere to get people to spam them",
            "score": 4,
            "author": "bluesnakes321"
        },
        {
            "level": 0,
            "comment": "The fact you feel you have to mention what you looked like is a problem. It doesn't matter. They should not hit on you and respect you. It is there problem, not yours.  Also it's not normal for them to do it.  This isn't the 60s, today this is looked down on.  I actually thought people no longer cat called.  \n\nWhat I used to do was call them out, or give them a you are so nasty get away creep look.  Once I even spit on a guy.. Oh his face was priceless.  Don't ignore them! They don't respect you is a very thin line to attacking you.  Try to stay around crowds or look like you are walking with other people. You see two old people walking...get close to them...imagine they are your grandparents.. Trust your instincts!",
            "score": 4,
            "author": "HelpMeFindTheToilet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally agree with you! The only reason I mentioned it was to give an idea that I wasn't necessarily wearing anything flashy that would've drawn attention to appearance.  I 100% agree that any woman deserves the right to wear what they want without being hounded.",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% ignoring it.\n\nThe worst I've ever experienced in this respect was Barbados (and I've been to North Africa, Middle East etc as well). To be clear: I absolutely LOVED Barbados and would return any time - but the catcalling was constant. Literally constant. I couldn't walk 10 steps without getting some attention. Almost every day, some dude would come up to me at the beach, just sit down right next to me and try to chat me up.\n\nBut I never felt threatened. Uneasy - the beach situation - but never threatened. I just ignored every guy on the beach and they disappeared fairly quickly. The catcalls I barely noticed after a while, and even if I did, I paid no attention to it.\n\nI often put in headphones (even if without music - though sometimes I have a fake conversation/pretend to talk to someone), walk fast and determined (even if I have no clue where I'm going), put on my best fuck off face, pay zero attention, by all means never make eye contact, don't even look in that direction, simply drown it all out and 99.9% of the time, that does the trick. Very occasionally, I wear a fake wedding ring, but find that helps extremely little to nothing at all. If they really bug me, I make up a boyfriend or husband who is \"just on the way to join me\".",
            "score": 10,
            "author": "SamaireB",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good to know about Barbados for the future!",
                    "score": 1,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't let it deter you, the place is breathtaking. I would go back in a heartbeat and hopefully will soon.",
                            "score": 2,
                            "author": "SamaireB"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sometimes ignore them, sometimes just laugh and wave at the catcallers if I'm feeling sassy, and I will get loud and draw attention to myself if someone is really bothering me. I have no problem not being nice. When I dine alone, I like to sit at the bar, partially because I like to chat and partially because most bartenders will not abide bad behavior. If I see a man harassing a woman in public, I'll say something, like ask if she's ok or pretend she's my friend, etc. I am tall, a little overfed, and in my 40s, so kind of past the point of being intimidated, being nice, and putting up with bullshit.",
            "score": 14,
            "author": "gnatgirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm now going to describe myself as \"a little overfed\" lol",
                    "score": 4,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For the guy sitting next to you at the game, pretending to be distracted and not hearing the first time is a great approach.\n\n\"I feel like I've seen you before.\"\n\n\"I'm sorry, what?\"\n\nHe repeats what he said\n\n\"Oh... I don't know.  I'm just here to watch the game.\"  \n\nThe whole time, you just keep watching the game.  He tries again.  You say the same thing.  I do this at sporting events, on planes, a concerts and festivals...  Any time I have some chatty neighbor that I don't want to talk to.",
            "score": 14,
            "author": "Shot-Artichoke-4106",
            "replies": [
                {
                    "level": 1,
                    "comment": "I go to sporting events often (sometimes solo, sometimes not) and this is the first time I've ever had an issue.  I'm typically a very social person and don't mind talking to people around me about the game (I've met some great people over the years!) but this was definitely not one of those moments. will keep this in mind!",
                    "score": 8,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t be afraid to be rude. You are in no obligation to cater them or even give the slightest shit to anyone. When I get catcalled I always give them the eye or the finger. It really depends on the intensity of the catcalling but I usually just ignore and/or yell back on worst case scenarios. \n\nFor people hitting on me, I never use the “wedding ring” card to shove them off. I want them to get off my back bcs of the sole reason I do not want to and not bcs I was taken by somebody else. So I would usually just let them know that I’m not interested. If they still persist, don’t be afraid to hurt their ego by saying what you think. “You are not my type.” “You make me feel uncomfortable, I want you to leave.” \n\nIt’s a case to case scenario so you just gotta figure what works for you or not. I’m sorry we have to live in a world like this. Hugs!",
            "score": 8,
            "author": "Searching_4_her_Word",
            "replies": [
                {
                    "level": 1,
                    "comment": "like the idea of striking the ego... thanks for this!",
                    "score": 3,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes breaking the ego can be Dangerous af. I know i would rather be respected, accept my rejection cause i have dignity not bc of a fake husband. But my Security comes first, even from pride or educating people about women's value.\nAlways read the room.",
                            "score": 2,
                            "author": "Revolutionary_Sand60"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On my last solo trip, I wore a ring on my left hand to give the illusion of being married! I did get a lot less attention. \nPreviously I’ve just tried to have resting bitch face ! Or try and look like I’m not a tourist where possible, such as working out where I’m going in advance so I’m not staring at my maps on my phone.",
            "score": 9,
            "author": "reddressxo"
        },
        {
            "level": 0,
            "comment": "have excellent resting bitch face and also carry a personal alarm. i also wear my apple watch that i can dial emergency services from if necessary and my parents have access to track my location. i ignore any man trying to engage with me unsolicited and just keep on walking. fuck politeness.",
            "score": 6,
            "author": "raptorjaws",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to say develop a resting bitch face too. I feel like there is a way to sort of exude it through your body too, kind of like a version of \"grey rock\" (this is a tactic for dealing with narcissists, lots of info online but it is basically about making yourself feel very boring) but for the general public. I am in my forties but look like I am in my twenties due to genetics, and too tired since the pandemic started to dress up or wear make up. But generally speaking, and unfortunately, I have noticed I get more attention when I am in a wonderful mood (rare, but it happens) so I have developed a sort of emotionless, nondescript \\*energy\\* which acts as an invisibility cloak when out and about. And it does suck that this is a thing, and it is 2023, and also? I value being able to just get around and do normal things without having my flow interrupted so I feel like it is pragmatic to be like this. \n\n(Mind, this is in my hometown, haven't travelled in a while, so this will be put to the test when I do next month.)",
                    "score": 2,
                    "author": "GeorgeYeatSlays",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Experienced a situation where I was traveling solo and a man made some very unsettling comments toward me (\"pretty girls like you need to be careful around here\" etc) and then started following me. I noticed a group of women (grandmother, mother, and daughter) across the street, popped over to them and told them that a man was making me uncomfortable and asked if they wouldn't mind my tagging along with them for a few minutes until he was gone. They were lovely and of course said yes and made sure I was able to leave the area safely after we went orchid shopping together for a bit. \n\nThis was my first instinct and I'm glad I went with it.",
            "score": 8,
            "author": "LinRun",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;\"pretty girls like you need to be careful around here\"\n\nUnless you're in a prison, that's just a bit psychotic. Great idea to join the family for a while - a teaching moment for the daughter.",
                    "score": 5,
                    "author": "ArticulateAquarium"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chicago resident! I get catcalled a lot in certain areas, especially while waiting for the train, and it always makes me uncomfortable. I’m sorry it happened to you too. \n\nIf I’m on the street I normally just keep walking with purpose and ignore them. It works like 99% of the time. If I’m waiting for a train typically I’ll give a not to acknowledge I heard them but either put in, or more likely adjust my already in headphones to signal I’m in no mood to talk. Honestly that’s worked pretty well for me too. It does suck though :(",
            "score": 3,
            "author": "gr2020xx"
        },
        {
            "level": 0,
            "comment": "This is hard to do as someone who doesn’t like making others feel uncomfortable, but if a guy is being creepy, look them blankly in the face with no expression and don’t say anything. Drives them away real quick. Having a resting bitch face helps as well",
            "score": 3,
            "author": "jewlious_seizure"
        },
        {
            "level": 0,
            "comment": "It’s so terrible that we still have to do this shit. My first and primal urge was always to give them the finger and call them an asshole. But then They know they have gotten to you, so they win and you lose. so resist the urge to go on the offensive. Get on with your life and enjoy your trip. Lots of good advice has been given to you.",
            "score": 3,
            "author": "NanaRocks43"
        },
        {
            "level": 0,
            "comment": "iliza's advice:\n\nhttps://youtu.be/o3XxRrfoPYE",
            "score": 3,
            "author": "drawingablank111"
        },
        {
            "level": 0,
            "comment": "Walk quickly and with confidence. Head up, shoulders back, don’t make eye contact or smile.",
            "score": 3,
            "author": "SwampWitch7Stars"
        },
        {
            "level": 0,
            "comment": "Really what you did! Try to get in with another group and truly rely on the kindness of strangers! I have never had something this bad happen to me and I am sorry it happened to you! I also try to look really bitchy if I am in public and feel like I am getting stares from men, not sure if this necessarily works but looking them in the eye with a bitchy look often works.",
            "score": 3,
            "author": "otherstuffilike"
        },
        {
            "level": 0,
            "comment": "Sorry to hear about this - honestly blows my mind how so many of us go through this even today. It’s exhausting. \n\nI have found a trick that works for me - I put headphones on (don’t always play anything) and I find it blocks out noise and doesn’t make me feel as uncomfortable. I also wear sunglasses so that contact is limited - I find these two things have changed my situation so drastically. I walk with more confidence, feel less intimidated by their behaviour and overall walk around like I don’t give a shit. They cat call and look weirdly but it does not bother me as I cannot hear them or see - that is my invisible block. \n\nMay not work for everyone but it helped me.\n\nSometimes listening to adrenaline pumping hype music before I go out also helps (lots of rap) :D",
            "score": 3,
            "author": "CarMore434"
        },
        {
            "level": 0,
            "comment": "Wear all black and keep a serious look on your face. It really works. I’ve found that just dressing like i rolled out of bed counterintuitively gets more attention because douchey men assume you have low enough standards to appreciate their comments. But dressing by like a severe german art historian it looks like you have impossibly high standards, and thus no comments.",
            "score": 3,
            "author": "CharlieAlfaBravo",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a specific look to achieve, haha!",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was referred to as an “approachable 9” at one point in time and before my 20s I had learned to deal with it.  Be pleasant but bold.  Turn people down in unmistakeable verbiage.  “Aww shucks but I have a boyfriend” is misleading.  You need to define clear ends to conversations with a “you have a nice evening” etc.  you don’t owe anyone kindness.  It helps to be polite but not when someone is beyond commonly accepted behavior.",
            "score": 3,
            "author": "GlumAmphibian2391"
        },
        {
            "level": 0,
            "comment": "Also not to victim blame, but I’ve noticed street harassment disproportionately targets women who have anxiety or a generally nervous disposition. I think predators see it as a sign of weakness making you an easy mark. \nWhen I am out and about, I tend to put on my most intense bitch face, my most powerful posture, and my most fuck you attitude. Of course, street harassment still happens to me, but it’s far less likely than when I’m feeling fragile, small, or in my own thoughts. \nAnd when I am at my most “fuck off”, I’m also most likely to go ahead and say “fuck off!” when necessary.",
            "score": 6,
            "author": "RevelryByNight",
            "replies": [
                {
                    "level": 1,
                    "comment": "in the future, I'll channel my best Logan Roy lol",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I jump on a phone call when I feel unsafe traveling alone",
            "score": 7,
            "author": "subf0x",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did this when I was walking back to my hotel from the train station at night and a lot of... characters were out roaming.  Called my mom and put it on speaker",
                    "score": 10,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Severe resting bitch face, lol.\n\nOn that note I was in Chicago a few weeks ago, in Michigan Ave, and experienced what I can only assume was a very pathetic attempt at following a pickup artist script. Maybe it’s a common PuA target area? \n\nGuy: Do you know where I can find a Benihana’s around here? \n\nMe: I don’t. Sorry. \n\nGuy: Oh, ok. Well you look really cute in that jacket. \n\nMe: Thanks. \n\nGuy: You must be from Michigan or Ohio. \n\nMe: Neither. \n\nGuy: No way!! \n\nMe: Way. \n\nGuy: Spicy. (Proceeds to walk away)\n\nIt was like PuA ad libs or something.\n\nAnd for the record, I live a few states away now but I grew up not far from Chicago and have been there a million times. I knew where I was going so I don’t think I look especially tourist-y.",
            "score": 4,
            "author": "_lady_rainicorn_"
        },
        {
            "level": 0,
            "comment": "I’m really sorry this happened to you. I feel like it doesn’t matter how “plain” you try to make yourself look when going out in big cities. I have been cat-called in major cities as someone who covers up from head to toe. I have even gotten unwanted attention whilst pregnant (third trimester + gestational diabetes so no doubt about that belly).\n\nI feel like the only repellent for unwanted male attention is having another man walking with you (nobody bothers me when my 6”5, 260lbs husband accompanies me). Or at least a big, scary looking dog.\n\nI might sound pessimistic but I honestly contemplate over which shoes I should wear outside based on where I’m going and who I’m going with.\n\nIf I know I’m going out in the city centre by myself, I will always choose heavy boots (platform Doc Martens) just to give myself a bit of relief from the idea I can defend myself by kicking someone between the legs when I need to protect myself. Not much else I can think of honestly :(",
            "score": 5,
            "author": "maddogofsh1mano",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally get the shoe thing! I often go with sneakers when in the city for the purpose it's the easiest to run in, if needed.",
                    "score": 3,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I act as crazy as possible. Men tend to back away if you seem psychotic.",
            "score": 5,
            "author": "Carouselcolours"
        },
        {
            "level": 0,
            "comment": "Ignore them and walk fast. New Yorker attitude since I deal with this almost every day. I also look bitchy (so I’m told), so it helps and if I just give one look of ‘don’t fuck with me’ they tend to back off. \n\nIf at a bar or restaurant, I will politely excuse myself or give a look to the bartender/waiter for help. However in one instance, the head manager at a restaurant I had dinner at wouldn’t stop talking to me on my way out so I just told him I was in a hurry to meet some people somewhere else then ran into the nearest bar just in case.\n\nIf generally in public, duck into a store or somewhere where there are people. But most of all just ignore and try to keep a poker face so they will stop or move on.",
            "score": 5,
            "author": "fakeplanettelex"
        },
        {
            "level": 0,
            "comment": "I stopped shaving my armpits and bought baggier jeans and shorts, it doesn't cut down everything, but it does help imo",
            "score": 5,
            "author": "thevastminority"
        },
        {
            "level": 0,
            "comment": "I usually ignore the initial comment and that usually works. However if they continue to comment and are persistent then I get dominant. I square up with them and say “you need to stop right now” I say it very firmly, like I’m giving a dog a command. I don’t curse, I don’t get hostile. If THAT doesn’t work then I usually find someone, a worker, employee, doorman etc and say. Hey can I hang out hear till this person stops harassing me. This has always worked for me in the past.",
            "score": 2,
            "author": "Long-Trouble7460"
        },
        {
            "level": 0,
            "comment": "At this point, before they say a word, I just hold up my hand and say no! Even better, pretend they don’t exist.",
            "score": 2,
            "author": "818a"
        },
        {
            "level": 0,
            "comment": "If you haven’t already consider some self defence classes…that could go a long way to improving your confidence and reducing your anxiety. Years ago I took some Brazilian Ju Jitsu and it was so worthwhile! I can’t speak for all women, but I think it’s fair to say for most of us our legs are our strongest muscles. Honestly, if I did have to get into a physical confrontation with a man, and it was hand to hand, combat or standing up and boxing, there is absolutely no way I could win, but if you take that fight to the ground and I can use my legs, we have a much fair fight on our hands. Also, I think many men would be surprised to find a woman knows how to take care of herself in that manner.\n\nAs for travelling…I walk with purpose and glance around often. I wear RFID bags with cut proof straps. I leave a note or digital trail of where I am going. When men engage I politely decline and lie about having a boyfriend. If they persist I explain even if I &gt;was&lt; single I don’t find this disrespectful approach attractive. If that fails I tell them to be a better a human. \nIt hasn’t happened yet but if one grabbed or touched me in that situation he is going to find quickly find himself on the business end of leg or arm bar from my BJJ training days.",
            "score": 2,
            "author": "Grniii"
        },
        {
            "level": 0,
            "comment": "Pepper spray",
            "score": 2,
            "author": "Ok-Future720"
        },
        {
            "level": 0,
            "comment": "I used to live in Chicago and, while it'll always be one of my favorite places, this unfortunately happened *a lot*. What ended up doing the trick is lifting my phone and either pretending to film or actually filming/taking pictures.",
            "score": 2,
            "author": "carlameeechelle"
        },
        {
            "level": 0,
            "comment": "resist the innate urge to attack, breathe, remember why i’m there, keep traveling",
            "score": 2,
            "author": "wanderlush21"
        },
        {
            "level": 0,
            "comment": "Gosh I never ever get hassled or looked at twice and I do know it’s my strong attitude. I’m 6ft tall, slim, red hair and don’t take shit from anyone - and I have been told I’m intimidating- so that no doubt helps me plus now i am getting older at 58…. \n\nSo now, this gives me the shits that blokes think they can hassle women just because they aren’t intimidating. \n\nI have no solution - other than walk confidently - ALL. THE. TIME…",
            "score": 2,
            "author": "Fetch1965",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think you’re doing the right thing. You’re trusting your gut and engaging for help or at least assistance when necessary. While you can’t change others behavior, it is important to stay aware. And if you’re getting that spidey tingling, be proactive and keep yourself safe. Most females know you can’t stand up or be confrontational because you never know what kind of kooky person they might be. Best to disengage and leave or move spots or seek outside help. I’ve done what you have-ask a couple for help. Usually a simple ‘hey can you pretend to know me, this person is bothering me’ works.",
            "score": 2,
            "author": "ktigger2"
        },
        {
            "level": 0,
            "comment": "I remember meeting this cool hippie girl when I was backpacking years ago. She arrived in Europe with $500 and hadn’t worked but was still travelling around 5 years later. She said she hitchhikes always and has never had an issue. She said she goes and eats lunch with the truckers but she farts and has her hair in a messy bun and basically just acts growse and like one of the boys. Kinda purposely hams up being sexually undesirable and she said it can work like a charm to keeping you safe in more tricky situations. Her story always stuck with me. It’s sad that’s what you gotta do as a woman sometimes but I have flashed to that story when I’ve been in tricky spots with creeps and I feel like it’s helped me personally",
            "score": 2,
            "author": "AussieDesertNomad"
        },
        {
            "level": 0,
            "comment": "Wear a ring. Resting bitch face. If someone asks why you're traveling or who you are joining, make up a spouse. Don't tell anyone you are traveling along and no one is expecting you back at the hotel at a certain time. Lie, lie, lie.  I also ask like they are trying to sell me something and wave them off and say \"not interested.\"",
            "score": 2,
            "author": "texican79"
        },
        {
            "level": 0,
            "comment": "It’s really extreme but it’s the only thing I’ve ever seen shock men enough to stop. In the face of catcalls or scary unwanted attention I had a friend who would let out a bloodcurdling scream.",
            "score": 2,
            "author": "Eliseisrad"
        },
        {
            "level": 0,
            "comment": "If you're in America, it usually works to glam yourself up. It makes you less accessible to dickheads. \n\nIf you're dressing yourself like you don't want to be noticed, they think they have a chance.\n\nThis has the opposite effect in Latin American countries though lol",
            "score": 2,
            "author": "nononosure"
        },
        {
            "level": 0,
            "comment": "I say I’m not interested, and very firmly, no. If that’s not working, I recommend saying “stop” loudly while holding a hand up like a crossing guard. It’s 100% clear, direct, and a conversation ender. The person may feel embarrassed but they had a chance to behave in a dignified way and they didn’t. Never be unclear or send mixed signals. It helps no one.",
            "score": 2,
            "author": "spandexcatsuit"
        },
        {
            "level": 0,
            "comment": "I met a solo travelling girl who was very good looking and her strategy was to \"be deaf\". So she'd ignore and not look at any of them. One time when we were walking and an older guy walked up in a way you couldn't quite ignore verbal-only, she responded with a very slurred \"iiiaamm deaaaffff\" and then turned to me and did what I think was fake sign language. He very quickly left as I don't think he wanted me to \"fake sign\" her his advance lol.\n\nNot sure if that strategy will work for you, but just thought I'd share this fond memory of mine haha. Good luck out there and don't let it stop your travels!",
            "score": 2,
            "author": "Jealous_Chipmunk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Many times I pretend I’m talking to my brother on my cell. Yo bro, are you at the end of the block? I don’t see you. Oh I see you now!",
            "score": 2,
            "author": "Artistic-Ad-1046"
        },
        {
            "level": 0,
            "comment": "Tell them your married or gay or both 🙌",
            "score": 2,
            "author": "ConsistentReason111",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Being from NJ and going to NYC a lot. This used to happen to me a lot when I was younger. Started ignoring and wearing head phones and try not to make eye contact is best I got :(",
            "score": 2,
            "author": "owolowiec16",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;unsure how to fade into the background more\n\nMan, this comment made me sad to read. I'm at an age and body type where I'm completely invisible. Guess there's a freedom in that since it doesn't bother me to be invisible. I hope you find some good answers that allow you to be whoever you want to be without having to consider the feelings of strangers. \n\nI am wondering - what is a good way for a guy to try to approach a young woman?  And maybe your question has to do with tips to communicate that you are not interested without escalating.  I know if a stranger asked me if I was on facebook I would have to be direct in letting them know that I wasn't comfortable with them asking giving them a stern/disappointed mom look and tone (and let them know that they have actually made the interaction weird/uncomfortable if they continued to try to engage). \n\nFinally, I saw comments about guys who say \"smile\" to women and how annoying that is (and I do agree (especially because they think it's ok to do to a stranger) but I work with all men and they do it to each other too. Not strangers like with women but there are some guys with resting bitch faces that get told to \"smile\" all of the time too but coworkers that they don't work with directly.",
            "score": 2,
            "author": "bluemooncommenter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have perfected the look of constantly scowling, not resting bitch face, *scowling.*  My eyebrows are usually knitted together and I scrunch one corn of an eye like a pirate saying \"AYE GRRRR\" lmao. I shoot them a look I believe their mother would give them haha\n\nWalking with purpose and speed helps. \n\nDressing nice helps (they seem to believe you're out of their league. I get harassed more in common blue jeans/Tees than long skirts &amp; blouses as expressed [in this comment](https://www.reddit.com/r/solotravel/comments/13xmi5n/comment/jmi6jyd/?utm_source=share&amp;utm_medium=web2x&amp;context=3))\n\nI ignore cat callers. I never ever react to cat callers and men who lean in to whisper dirty shit in my ear.\n\nWhen it comes to men who are speaking to me (hitting on me), I stare them dead in the eyes with no expression and walk away not breaking eye contact (be the subtle unhinged woman you have inside you). This usually freaks them out or unnerves them.  They avoid me asap.\n\nAlso, fantastic disengaging words that work in conversation: \"Yeah\" \"wow\" \"huh\" use them incorrectly, always respond to their energy with opposite dismissive words lmfao.  \n\"You want to come to my place?\" 'wow'  \n\"You look sexy\" \"wow\"  \n\"Where are you from?\" \"Yeah\"  \nThis sounds stupid but it wittles the guys down it's worth a try, if you ever want to :)  \n\n\nGood luck!",
            "score": 2,
            "author": "SemperSimple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love the last one! Partially because I know if I was on the receiving end of it I would be so annoyed!",
                    "score": 2,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I swear, the most benign things work sometimes 😂😂 we're all human and get annoyed in similar ways 😂",
                            "score": 2,
                            "author": "SemperSimple"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m from Chicago too and agree! Especially in the downtown Michigan area I’m always walking fast and have a serious look on my face. It’s definitely a place to display a strong confidence in how you walk and act like you know where you’re going/doing. \n\nSomeone may still cat call but it’ll be a second of your time and they’ll move on to the next.",
            "score": 2,
            "author": "VariousParsnip1533"
        },
        {
            "level": 0,
            "comment": "Carrying pepper spray in a visible place and trying to give off angry lesbian vibes is semi-successful for preventing the attention. If that doesn't work, telling them \"I'm a lesbian, fuck off\" or \"you're barking up the wrong tree - I don't like men\" while I continue to walk and not make eye contact usually works. \n\nUnfortunately I've found that being rude and/or threatening are the only ways to not get harassed 😕",
            "score": 2,
            "author": "brylikestrees",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I honestly just act like I can’t hear or understand whatever language they’re speaking. And I keep walking.",
            "score": 2,
            "author": "adelizaa44"
        },
        {
            "level": 0,
            "comment": "It happens, it’s part of being in public, just have to sternly ignore it. Not much can be done to stop it entirely other than trying to create a culture of shaming that type of behavior.\nI have a big butt which can be difficult to conceal so I’ve dealt with catcalls my whole life. \nChicago is mild compared to the way they catcall women in places like Egypt. It’s unfortunate.",
            "score": 2,
            "author": "Ok-Effective6346"
        },
        {
            "level": 0,
            "comment": "I'm a 30 yr old white female similar appearance. I just traveled alone for 2 weeks across the country to my new home in Colorado. I travel alot alone and also suffer from anxiety disorder. I ALWAYS travel with at least a knife for protection. I also always have a metal water bottle. If they're persistent, call someone on the phone. Anyone. In the 2 week travels, I was in New Orleans and was followed. I called my bf to let him know the station and where I was. I thankfully was near my location so I ducked in. If you make THEM feel uncomfortable, they USUALLY back off. Always find a public store front to go into if you feel unsafe. If you're hiking, wear bright colors and let someone know what you're wearing and where you'll be. True crime may have jaded me but also, society is rough and its nothing you've done. I hope this helps even a little. Protect yourself ladies! Hope this helps",
            "score": 2,
            "author": "Stonersaurus711",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just ignore people who are speaking to me on the street. Flat out. If it’s anything aside from common pleasantries or a request for necessary assistance or something … tune out. Like they’re not there and it’s not happening. Granted, this is a defense mechanism I developed as a fat person trying to ignore and avoid mockery so… it might be different but I found it helpful the few times I’ve been catcalled.",
            "score": 2,
            "author": "Oomlotte99"
        },
        {
            "level": 0,
            "comment": "I’m so sorry you had this experience. It sounds stressful. I’ve had similar situations of being asked for my phone number while just walking down the street. This might not be the best advice, although if someone is being persistent, I have a google voice number I give out and say I’m on my way to meet a friend and I have to go. It tends to diffuse the situation because they feel relieved they have my contact information, and I feel relieved because I know the number isn’t connected to my real information and I can block the number.",
            "score": 2,
            "author": "theisabellabloom"
        },
        {
            "level": 0,
            "comment": "Ignore it, say you in a relationship, and walk with phone to ear like you are talking on it,  or have friend on FaceTime.. if you are approached, and need a way out, just act like phone rang, or find another person to use as distraction, to get away 🤔🤨🤷‍♀️ \nKeep \"SOS\" type messages saved in Notes on your phone , to easily access to show strangers if approached by unwanted people, and they will know to play along, to help get u out of shady situations...",
            "score": 2,
            "author": "Winter-Wolf-1196"
        },
        {
            "level": 0,
            "comment": "Big over the ear headphones and resting bitch face, lmao. I lived and worked in downtown Seattle for ages and commuted through some of the worst spots, so I think I just have a really refined \"fuck off\" presentation when I want to. Blasting bass music in big obvious headphones, will literally punch through a gaggle of hooligans if they're blocking the door I'm coming out of (literally. The exit from my old office onto 3rd Ave always had a hoard of high homeless people blocking it and I'd just kick the door open to startle them and they'd scatter for me long enough to blast through toward the subway with my \"I'm commuting and today is a good day to die\" energy, lmao).\n\n\nGranted, this isn't so effective at night if you need to be able to hear your surroundings better. In those instances I just keep walking, and if they wanna get loud, I will get loud and channel my inner city ghoul (very New England style tbh).\n\n\nGenerally if someone is catcalling I ignore it, if someone gives me a compliment (tactless or not) I'll give them a simple friendly \"Thanks!\" without breaking pace / stopping for them, and if they follow me I'll start walking an absurd path so they are either forced to admit what they're doing OR don't know what to do with it and stop. On occasion I've yelled \"IN A HURRY, I SHIT MY PANTS, IT WASN'T A FART\" or some other ridiculous gross statement (you can get super creative, I find it hilarious) that will stop most people dead in their tracks. Either that or just start barking at them. Literally nobody knows wtf to do with that. The theme is if you present yourself as crazier than them, they tend to fuck off.\n\n\nBy far the best way I've avoided it overall, though, is just simply dressing like a fuckin bag lady and wearing a face mask (thank you covid!) because I can shift between a visually appealing woman and someone who may or may not eat children. Basket Woman version of me gets ignored and it's fantastic. Appealing me gets a lot of attention and there's a specific time and place where I'm in the mood for that.",
            "score": 2,
            "author": "-_Empress_-"
        },
        {
            "level": 0,
            "comment": "I'm in my 50's overweight and I still get weird men hitting on me and following me around at home and when I travel. It's just more intense when younger. You have to have a bundle of strategies for dealing with it. You definitely were right to take advantage of the offer of help when at the game.  I don't know if a wedding ring works but it's worth a try. Mentioning your boyfriend or husband being asleep at the hotel or on his way or something might help. It depends on the situation. There is no way to stop men from being that way. You have to figure out what you can do to feel safe. Staying home isn't the thing to do. Just read up on advice, figure out what you are comfortable with, and plan. If you can find a church or school group to tag along with, that can help. Or when you travel seek out a group doing the same thing you want to do, like on meetup or at some other site that helps organize people. Being with a group can minimize the trouble but of course, there is bound to be someone in the group too.",
            "score": 2,
            "author": "pedestrianwanderlust",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you - and happy cake day! :)",
                    "score": 2,
                    "author": "mh942",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually wear a wedding ring and completely ignore/blank any unknown man that tries to talk to me on the street.",
            "score": 2,
            "author": "Nice_Conference_4133"
        },
        {
            "level": 0,
            "comment": "I’m from Chicago, and unfortunately, you just learn to drown it out. It doesn’t happen in every part of the city, though; just the touristy area..",
            "score": 2,
            "author": "ghostedgoats"
        },
        {
            "level": 0,
            "comment": "Headphones, even if nothing is playing. If someone says something to you just pretend you didn’t hear them. If they still flag you down or are otherwise able to initiate a conversation, be polite, but brief and uninterested. \n\nYou: “Hi, no thanks, I have somewhere to be”\nThem: “Can I come with you?” “I can show you around. Let me show you a good time.” etc... (I’ve heard it all before.)\nYou: “No I’m meeting up with someone (now or later, you can say family/friend/SO or not specify at all), but I’m flattered. Enjoy your day.”\n\nWhile never slowing down or breaking stride, no matter how true or false it is. Doesn’t stop it from happening (well the headphones + ignoring might) but it has helped me get out of uncomfortable situations.\n\nYou can also give reasons for not being interested such as “I’m gay” or “I have a man/woman/partner.” It’s unfortunate that egos are so fragile and people can’t handle rejection, but it helps soften the blow for them to give a reason other than “Ew no, go away!” \n\nWishing you safe and happy travels.",
            "score": 2,
            "author": "Magicalcocobeans",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate you illustrating a scenario... this is how my mind works as well! thanks",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "strengthen that rbf.",
            "score": 2,
            "author": "More_Art_Girl"
        },
        {
            "level": 0,
            "comment": "Sorry you went through that! I live in Chicago, actually right off of Michigan Ave, and when the weather gets warm and the tourists are out in full swing on weekends, I definitely do see all manner of sketchy and opportunistic guys out. It seems to happen in most large cities. But the yelling of derogatory comments at you is especially appalling! I always walk with my headphones in so if someone tries to talk to me I can pretend I didn’t hear them. I’m a very self conscious person too and hate the feeling of being watched/singled out in public.",
            "score": 2,
            "author": "R12B12",
            "replies": [
                {
                    "level": 1,
                    "comment": "In case it's a recurring thing, it was a group of guys handing out flyers outside Neiman Marcus.  Not sure if it was like a musician/mixtape thing or religion or what.  Just to keep an eye out and be aware, since you're local!",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sunglasses and earphones (without music) when walking alone to avoid eye contact and pretend u can’t hear them lol. Yeah working on the rbf helps to get better at not showing any reaction. When you give a reaction it entices them more it’s fucking stupid and I hate it. Not much you can do when it comes to drawing attention, but the way you react kind of helps. Sorry about the anxiety :(. It’s really shitty but maybe it helps to know that most men don’t have malicious/predatory intent (meaning you usually arent physically in danger) they are just fucking animals that don’t know how to control themselves and must always act/instigate when they see something of interest. I mean still pretty predatory but I don’t know another word to use when meaning they likely won’t hurt you. It’s when they see that you’re vulnerable that they’ll capitalize on that more. If you stay strong and indifferent they usually get bored and will leave you alone. Really depends though. This life as a woman is fuxking annoyig",
            "score": 4,
            "author": "prasolinadicaprio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm always scared to use AirPods because I feel like someone will come up from behind/I'll tune out my surroundings but the no music thing is good to keep in mind! I totally get what you mean.  I don't typically react (though my face may say otherwise?) and just look straight ahead.",
                    "score": 9,
                    "author": "mh942",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im the same. I won't wear headphones or keep my phone out. \n\nI walk around, shoulders back, eyes peeled, head up, and walk like I have a purpose and a place to be. If someone catcalls, I just keep walking. Those asshats are looking for ANY acknowledgment, good or bad. \n\nIn your baseball situation, (hello fellow lady baseball fan! Its my fave too!). I probably would have said, \"I'm here to watch the game, not socialize.\"  If he persisted, I'd probably get cheeky, hold my hand up in that classic stop motion, and if he still persisted, I'd probably have gone to a female usher and let her know what's going on and ask if something can be done. Then go from there.",
                            "score": 3,
                            "author": "Xerisca"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Men can smell anxiety and vulnerability. It’s really shitty and important to make sure you build your confidence. Travelling helps with that and has helped me a lot. I went to morocco by myself and really had to make sure I was in the right head space because the second you start second guessing yourself or physically becoming anxious they know that they can dominate you",
                    "score": 5,
                    "author": "prasolinadicaprio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The harassment in Morocco is insane.\n\n\nI do not really like that country. Others love it though!",
                            "score": 5,
                            "author": "light24bulbs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had the time of my life in morocco! I’m going back in a few weeks hahaha, but sorry your time there was horrible. Where did you go? I was in Essaouira most of the time and it was amazing the people were wonderful",
                                    "score": 2,
                                    "author": "prasolinadicaprio"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a male, so take this advice however you want. \n\nI often get asked to look at something or just endlessly harassed to buy things. \n\nThe most simple trick to get rid of this type of attention is to wear headphones, have a purpose, and be okay with ignoring people.\n\nHeadphones can either be on or not up to you. I mix it up if I want a soundtrack of the day, I'll play some tunes. If I'm feeling a bit skeptical of the area, then they're off and are just aesthetic. People won't know they are off and assume you're listening to something and leave you alone.\n\nHave a purpose. With this, I mean don't look like you're lost or contemplating things. This gives people a window to swoop in and interact with you. If you look like you know what you're doing most of the time, there's no reason to approach you.\n\nBe okay ignoring people. I really hate to dismiss people and find it very disrespectful. So I have to tell myself it's okay to ignore someone if it's for your own well-being. If for some reason there is someone I ignored and it ends up that I do need to interact with them, I play dumn and apologize and move on with conversation.\n\nHope this helps, and if someone knows how to improve these, I'd like to know.",
            "score": 5,
            "author": "stonkfrobinhood",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate that advice was given without dismissing the situation or belittling it from a male perspective.  Thank you! :)",
                    "score": 2,
                    "author": "mh942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know your a tourist but Jesus just avoid Michigan Ave all together.   Mind you no excuse for harassment is being made...",
            "score": 2,
            "author": "NoStars128",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Punch yourself and start screaming in tongues",
            "score": 2,
            "author": "Weather_the_Zesser"
        },
        {
            "level": 0,
            "comment": "Fawn and dodge until I get back to my lodging and cry until it's time to go home.",
            "score": 2,
            "author": "Kaayak"
        },
        {
            "level": 0,
            "comment": "I dress like a lesbian",
            "score": 1,
            "author": "Jazzlike_Weakness_83"
        },
        {
            "level": 0,
            "comment": "Sunglasses",
            "score": 1,
            "author": "Maeabides"
        },
        {
            "level": 0,
            "comment": "I’ve travelled solo and haven’t been harassed at all. I wonder if it’s because I’m not white though.",
            "score": 1,
            "author": "vegas_lov3"
        }
    ]
}