{
    "id": "13xv8v6",
    "score": 2,
    "title": "Trying to decide how to split time between Galway &amp; Belfast, plus time in Edinburgh!",
    "author": "tacosandtopology",
    "date": 1685658136.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13xv8v6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! I (28F) am taking my first solo trip abroad from the US to Ireland/Scotland at the end of June/early July!\n\n* Days 1-4: Dublin\n\n* Days 5-8: split between Galway &amp; Belfast\n\n* Days 9-13: Edinburgh (days 12 and 13 will be taken up entirely by a tattoo appointment)\n\n* Day 14: back to Dublin before flying home the next day\n\nI'm hoping to get some advice on how to best split my time between Belfast &amp; Galway-- would 2 days in each city be sufficient, or should I spend more of my time in one vs the other? I plan on getting around by either bus or train (and flying to Edinburgh from Belfast). I'd also love to hear suggestions around how to best spend my 3 free days in Edinburgh. \n\nI don't plan to spend all my time in Dublin proper my first few days, so any day trip suggestions are welcomed, too! The only really concrete plans I have at the moment are a concert at Malahide castle and my 2-day appointment in Edinburgh. \n\nMy budget for excursions/food is about $2000.",
    "comments": [
        {
            "level": 0,
            "comment": "It depends on what you want to see. Galway isn't big, but taking two days could be a good way to see some countryside with a tour. Cliffs of Moher, Aran Islands and Connemara are beautiful.\n\nBelfast will have far more to see, and also has tour options. Giants causeway is popular, as are some sights near it (rope bridge, castles etc). \n\nFor tours from Dublin, make sure you aren't jetting across the country to have no time for anything. I was on a multiday tour in Southern Ireland last year. First day had day trippers too. They spent over 8 hours on a bus to look out the window on the moterway, spend about an hour in Cong, have less than 2 hours for dinner and a walk in Galway and then back to Dublin. The west coast is stunning, but I'd do overnight tours/trips for that.\n\nCloser to Dublin, Wicklow mountains/Glendalough is stunning, and Newgrange and monasterboice would be interesting if you want history. Both are close enough for a daytour. (Just don't pick a 3 hours back and forth, one hour there tour for glendalough).",
            "score": 4,
            "author": "calmgonemissing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the tour recs! After doing a bit more research on my own, I think I'm going to give myself more time in Belfast because more things appeal to me. I'm thinking I can get what I want out of Galway within 2 days.",
                    "score": 2,
                    "author": "tacosandtopology"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly I don't think you need more than 2 days in Dublin, and keep in mind traveling from Dublin to Galway and Galway to Belfast is going to take a long time by train. I believe Galway to Belfast is around 6 hours with a lot of changes.\n\nGiants causeway is a must see, and there are day trips from Belfast (there are some from Dublin as well but that's a long day). \n\nIf I were you I would cut the days in Dublin down so you can spend more days in Galway and Belfast.",
            "score": 2,
            "author": "Better-Hunter-1456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, I'm kind of stuck in Dublin for those first few days-- I have a few work things to take care of and that concert at Malahide castle, so it just makes it a bit easier to stay there.\n\nGiants Causeway is definitely on my list! So far, more things appeal to me near Belfast than Galway, so I think I'll give myself more time there.",
                    "score": 1,
                    "author": "tacosandtopology",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would be a great idea to skip Galway and head up to Belfast! Near the giants causeway there is the dark hedges, Derry, and carrick-a-rede rope bridge!",
                            "score": 1,
                            "author": "Better-Hunter-1456"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow! I am heading that way as well with 5 other people this summer, and we have the same predicament...so, now I know it's not about being solo or in a group.",
            "score": 2,
            "author": "MavenVoyager"
        }
    ]
}