{
    "id": "13ylov1",
    "score": 4,
    "title": "Swimming with valuables",
    "author": "JoeyyP98",
    "date": 1685732748.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13ylov1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Good evening peeps, I have a question. When you go swimming at the beach as a solo, where do you store your belongings? Interested to know for inspiration.Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "Try these three thread from the past year.  Plenty of great advice in them.\n\n[https://www.reddit.com/r/solotravel/comments/zxag10/where\\_do\\_you\\_leave\\_your\\_valuables\\_when\\_you\\_go\\_to/](https://www.reddit.com/r/solotravel/comments/zxag10/where_do_you_leave_your_valuables_when_you_go_to/)\n\n[https://www.reddit.com/r/solotravel/comments/11g9166/swimming\\_safety\\_while\\_solo\\_travel/](https://www.reddit.com/r/solotravel/comments/11g9166/swimming_safety_while_solo_travel/)\n\n[https://www.reddit.com/r/solotravel/comments/uabuos/going\\_for\\_a\\_swim\\_how\\_to\\_secure\\_your\\_belongings/](https://www.reddit.com/r/solotravel/comments/uabuos/going_for_a_swim_how_to_secure_your_belongings/)",
            "score": 7,
            "author": "3rd_in_line"
        },
        {
            "level": 0,
            "comment": "At a relatively quiet beach, I just leave my stuff at a visible but quiet part of the beach and take a quick dip. It's worked fine.\n\nAt busier places, I typically take up a chair or a couch at a shack/restaurant/club and ask the staff to look after the staff while I finish a swim. \n\nYou could simply buy a waterproof pouch for your phone and spare change as well, and keep it all on you while you swim too. That's an option I've recently started adopting more. But you will need to downsize the stuff you carry to the beach for sure, or be comfortable leaving them onshore.",
            "score": 3,
            "author": "lazycat1989"
        },
        {
            "level": 0,
            "comment": "Personally I don’t risk it on a regular beach. Last summer I was in Nice, France. I booked a private beach one day and wish I had thought of it sooner! It was worth the extra money to not worry about my stuff. Granted many tourists I met said they left their stuff on a regular beach many times without incident… but I also met a woman whose daughter had her wallet and phone snatched from a beach. As a solo female traveler with anxiety I want to minimize my risk levels when possible.",
            "score": 3,
            "author": "lovepotao"
        },
        {
            "level": 0,
            "comment": "Hi JoeyyP98, your post will need to be manually approved by a moderator as your account age is less than 48 hours, this is an automated measure to prevent spam. Please be patient and do not message the mods or repost as we will get to the modqueue as soon as we can. Thank you for your understanding!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 2,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If I am planning to swin, i don't being my valuables.",
            "score": 1,
            "author": "PizzaCatRun"
        },
        {
            "level": 0,
            "comment": "Usually the only valuables I have at the beach would be my phone and wallet, which I bought these \"waterproof waist pack\" on Amazon and it works great. Also take it with me tubing down rivers and whatnot",
            "score": 1,
            "author": "ceratopolis"
        }
    ]
}