{
    "id": "13zjqlq",
    "score": 62,
    "title": "What was your favorite (or most interesting) mode of transportation?",
    "author": "ignorantwanderer",
    "date": 1685813739.0,
    "url": "https://www.reddit.com/r/solotravel/comments/13zjqlq",
    "media_urls": [],
    "other_urls": [],
    "postText": "One of the great things about travel is you get to go on lots of different forms of transportation.\n\nWhat was your favorite (or most interesting, or most terrifying, or most memorable) experience with transportation?\n\nFor me, I love cable cars (or gondolas, or aerial trams, I don't actually know what they are called).  Last summer I did a hike across the Swiss Alps following the Via Alpina....but every chance I got I would ride a cable car either up or down the mountains.  I think they are just the best form of transportation ever!  So quiet, great views, flying over treetops.  They are great!",
    "comments": [
        {
            "level": 0,
            "comment": "Was on the metro in Hong Kong. There was a guy starring at me. Started to feel uncomfortable and thinking of moving to a different car.  A couple more stops and he was closer to me. Then he pointed to his head that had a hat on it then to mine,  he then said,  You...you lose 60% of your heart through your head\". I looked at him and pulled out a hat in my pocket and he gave me a thumbs up,  both of us are bald. Totally didn't expect that.  Favorite was sea plane in Maldives, only time I flew in of those.",
            "score": 48,
            "author": "Foomanchubar",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you are over 6ft tall, go to one end of the HK MTR. On a straight section of the track, the sight over most ppl's head for the entire length of the train is interesting.",
                    "score": 8,
                    "author": "snakesoup88"
                },
                {
                    "level": 1,
                    "comment": "Isn't Hong Kong amazing? I had no desire to see it but I went there with a group of guys from church so we could smuggle Bibles into China. (I nearly got caught, so I'm thankful we all made it back!) \n\nAnyway, flying in to it, I was aghast, from my window side seat because it was so beautiful. We landed and explored the city. (This was in 1987, ten years before it went back to China.) From Shen Zhen, we also took a train into Canton. Canton wasn't all that interesting, but the Chinese countryside was just stunning. And I loved seeing workers in the rice paddys. The countryside doesn't look like any other place I've ever been or seen in photos. \n\nI met this American guy who lived there, and he told me he absolutely loved it even more than home, but of course, that was when it was still a British colony. But when people ask about my travels, specifically beautiful cities, I mention Hong Kong, Oxford, Budapest and Amsterdam.",
                    "score": -9,
                    "author": "Nervous_Magazine_200",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That landing flying into the old airport was amazing!",
                            "score": 3,
                            "author": "ignorantwanderer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It sure did scare me when we got close to the runway, because all I could see looking down was ocean. I was kinda like \"Oh wow, it's so beautiful! Wow! Look at this! Look at that! Oh, um...wait. Uh, there's no runway. Oh, um, AAAAAAAAAAHHHHHHH! Oh okay, we're fine.\" Hahaha!",
                                    "score": 7,
                                    "author": "Nervous_Magazine_200"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Vaporetto in Venice. I understand that people want that iconic gondola ride, but it's so expensive and a Vaporetto pass is like a tour and easy, affordable public transit in one. I just boarded the next one that showed up and got off wherever looked interesting.\n\nAnd a bunch of places with cable cars and funiculars.",
            "score": 21,
            "author": "punitive_tourniquet",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they arrive more frequently than the trains in Chicago",
                    "score": 5,
                    "author": "roub2709"
                }
            ]
        },
        {
            "level": 0,
            "comment": "La Paz, Bolivia has a system of Teleféricos that is used as public transportation around this mountainous city and up to the neighboring city of El Alto. The gondolas are fast, efficient, and dirt cheap - less than the equivalent of US 0.50 per ride. There are 10 lines altogether, providing spectacular views of the city and getting you up out of the crazy traffic below.",
            "score": 22,
            "author": "mhanrahan",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're so awesome. The yellow line used to be my daily commute. Hated the job so it was a nice consolation.",
                    "score": 2,
                    "author": "hazzdawg"
                },
                {
                    "level": 1,
                    "comment": "These are amazing! Plus you can talk with the other passengers. I was only there for 12 hours and it was raining but I still managed to get up to the top of one of the \"hills\".",
                    "score": 2,
                    "author": "ConnieDee"
                },
                {
                    "level": 1,
                    "comment": "Many cities around Colombia also has them (Medellin, cities in Eje Cafetero, etc) and Quito, Ecuador.  They are common public transport in the mountains",
                    "score": 1,
                    "author": "CheverePrepago",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I live in Quito and have taken the Teleférico many times. It is not public transportation though. It is to take tourists up to the Pichincha volcano.",
                            "score": 1,
                            "author": "mhanrahan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's public transit in other towns though.  Like Medellín has both public teleféricos and then the one that takes you to Parque Abri isn't part of the metro system though, it's an extra cost.  I also took one in Eje that was public",
                                    "score": 1,
                                    "author": "CheverePrepago"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Night trains for me. Falling asleep somewhere and then seeing the blue point on the map jump hundreds of kilometers the next morning, but at the same time still getting a feel of the actual distance (which you don't when flying).",
            "score": 16,
            "author": "SXFlyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tgey are soo uncomfortable tho. Better travel by day and actually see stuff.",
                    "score": 2,
                    "author": "Davidreddit7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "depends on the route, operator and carriage tbh, and also if it's just a seat or a sleeper compartment. I have slept amazingly on some, and terribly on others.\n\n&gt;Better travel by day and actually see stuff.\n\nmy favorite train trip ever was Amtrak's California Zephyr from Chicago to San Francisco, which was 51 hours in one go. So basically day and night. Slept very good at night, and during the day I was absolutely amazed by the scenery (canyons!).\n\nEdit: Also, night trains can actually save you a lot of time, by being able to explore during the days and travel by night.",
                            "score": 8,
                            "author": "SXFlyer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love night trains. Did multiple night trains in Europe and rode the Trans-Siberian and Trans-Mongolian. I think it's cool to wake up in the middle of the night at a stop and peek out the window to see which town or village you're in.",
                    "score": 2,
                    "author": "Har0ld_Bluet00f",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so cool! The Trans-Siberian was also on my bucket list but someone had other plans for me apparently.",
                            "score": 2,
                            "author": "SXFlyer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ferrys in Istanbul. People use it to get to work and such but I was enamored by the thousands of years of history every time I got on the ferry.",
            "score": 16,
            "author": "raven1121",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed! Istanbul is just so intense. I love the millions of Seabirds (seagulls?) hovering around the Bosphorus, and watching hundreds of locals fishing from the bridge as you depart on your packed ferrry.",
                    "score": 3,
                    "author": "pkovach64"
                }
            ]
        },
        {
            "level": 0,
            "comment": "* Trolleys in San Francisco \n\n* Single-seat cable \"ski\" lift in Capri, Italy\n\n* Motorcycle Tuk Tuks in Marrakech, Morocco \n\n* Electric Tuks Tuks in Split, Croatia \n\n* Cave Train in Postojna Cave, Slovenia\n\n* Steel track Fun Bob bobsled in San Candido, Italy",
            "score": 38,
            "author": "BrazenBull",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shoutout to the cave funicular in Silver Dollar City in Missouri",
                    "score": 9,
                    "author": "big-b20000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Underrated amusement park!!",
                            "score": 6,
                            "author": "Bean-blankets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "im in awe of any city that has ferrys as part of their public transport. sydney, stockholm, venice obv, even the one in perth … its so cool to me. i love a quick and easy boat ride across a bay or river",
            "score": 13,
            "author": "troyemellets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Years ago, I lived in Northbridge and my best friend in South Perth... used to love wandering down through the city to get the ferry across! I really wish Perth had more ferry routes. It would've been nice as a student hopping on a ferry at UWA to go over to South Perth or into the city.",
                    "score": 2,
                    "author": "Complete_Lettuce8477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes how nice would that be! its such a pretty area too. ferry hopping sydney was one of my favourite activities 🥰",
                            "score": 2,
                            "author": "troyemellets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't believe I have an answer to this, but the [electric boats](https://www.seenschifffahrt.de/en/koenigssee/boat-fleet/boat-fleet/) on the Königsee in southern Bavaria. They're super quiet and it's a beautiful natural spot.",
            "score": 11,
            "author": "cetaceanrainbow"
        },
        {
            "level": 0,
            "comment": "Cargo ship sailing down the amazon river for 4 days",
            "score": 9,
            "author": "kilo6ronen",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you end up in this situation? Id like to di the same",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did the same. It's easy, just buy the ticket. Keep in mind you need to have your owh hammock.",
                            "score": 3,
                            "author": "mathess1"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly what mathess1 said. I was travelling with a travel hammock for 4 months prior so it came in extra handy. \n\nYou can take the slow boat from Leticia, Iquitos, manaos etc. I took it from Leticia (Colombia) to Iquitos (Peru). \n\nYou need to make sure to find out when the boat leaves, it’s the amazon so it doesn’t run on a regular schedule. I asked around town and all got the same answer so figured I was safe. I had my hammock, my bag, I got toilet paper (it isn’t supplied) and food for the 4 days journey. \n\nThe ticket cost $30 CAD for 4 days including food, i didn’t trust the food tbh not to get sick. And that’s that. You take a small taxi boat to get to the cargo ship, jump on. And at some point a day into the journey someone comes to you to collect fair and give you your ticket",
                            "score": 1,
                            "author": "kilo6ronen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thats so cool thanks",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of different modes of transportation and memorable journeys.\n\nIf I had to choose just one,I think it would be sitting on the roof of a bus coming down through the Himalayas, from the Tibetan plateau down to Nepal.\n\nAn incredible journey... freezing cold at the start, very bumpy in places but unbelievable views.Thats one I still remember really well, nearly 30 years later!",
            "score": 39,
            "author": "lucapal1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow! Nepal is high on my list of countries to see.",
                    "score": 4,
                    "author": "Nervous_Magazine_200"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did a cycling tour thru italy. Cycling is best. You trvel on a decent pace and you still get very close to nature and can enjoy your surroundings. Other than that trains.",
            "score": 9,
            "author": "Davidreddit7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love cycling within cities too. same thing, you can explore neighborhoods, while getting from point A to point B faster than walking (and in some cities faster than public transit too), and it's also free exercise",
                    "score": 3,
                    "author": "lawfulkitten1"
                },
                {
                    "level": 1,
                    "comment": "Cycling in Holland is fun - you can go for miles without being in shape because it's all flat. I couldn't believe that I could just pedal along from Haarlem to the coast.",
                    "score": 2,
                    "author": "ConnieDee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "walking. You’re able to take in so much more than even a bike.",
            "score": 33,
            "author": "dekrypto",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way. Walking is transportation and entertainment in one. Also it’s free! Went to Portugal/Spain last summer and my travel bud wanted to Uber anywhere over .5 miles. I was like homie I didn’t cross the fuckin Atlantic to see this whole country through a window lol",
                    "score": 16,
                    "author": "__keanu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Perhaps my most unique transportation experience.\n\nI was hitchhiking on a small country road in Turkey.  A farm tractor came along and offered me a ride.\n\nBut the tractor was already carrying at least 6 peoples.  I assume the were farm-hands all coming back from a field they were working on.\n\nThe only place I could fit on the tractor was standing on the small platform underneath the drivers right foot.  When he needed to use the peddle (I assume it was the brake) I had to move my feet over so they were mostly hanging off....with just my toes still on the platform.\n\nIt was pretty awkward, perhaps a bit dangerous, but a very fun experience.",
            "score": 4,
            "author": "ignorantwanderer"
        },
        {
            "level": 0,
            "comment": "If you're going to Macchu Picchu, paying a bit more for the vista dome train between Ollantaytambo and Aguas Callientes (Machu Picchu town) is 10000% worth it. I was absolutely IN AWE the entire time. Most beautiful train ride ive ever been on, and they even host a show in the bar train with traditional Peruvian music and dancers. Absolutely magical. Dying to go back and experience it again!!!!\n\nEdited to correct the name of the train service!!",
            "score": 5,
            "author": "pippinssqueak",
            "replies": [
                {
                    "level": 1,
                    "comment": "I rode the \"Backpacker\" train from Cusco to Aguas Calientes and it was also incredible.  Not quite the views of the vista dome train I'm sure, but still eye-popping scenery all along the route.  I totally agree that the ride was magical.",
                    "score": 1,
                    "author": "WillrayF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rickshaws in Bangladesh. They are cheap and convenient, but the poor road conditions, plus sometimes ruthless riders, make it a crazy experience.",
            "score": 3,
            "author": "a_bald_potato"
        },
        {
            "level": 0,
            "comment": "Reading these replies brought back so many memories!\n\nMy parents were on a multi-month trip through SE Asia.  I only had 2 weeks vacation, so I flew and met them in Bali.  We took a bus to a somewhat remote temple, but we missed the last bus of the day back to town.  After looking around for a while and having some people ask around for us, we finally got a small pick-up truck sized flat bed truck to give us a ride.\n\nIt was hilarious!  We were just sitting in the back, facing toward the back.  Every single person we passed along the road would stop what they were doing when they saw us.  A huge smile would grow across their face.  And they would point at us and just laugh and laugh and laugh.  Every.  Single.  Person.\n\nAnd there were a lot of people.\n\nMy parents and I couldn't help but laugh along.  The entire ride, which probably lasted about 40 minutes, was just constant laughter.  People pointing and laughing at us, and us laughing back.",
            "score": 3,
            "author": "ignorantwanderer"
        },
        {
            "level": 0,
            "comment": "Every time I visit Italy I end up riding in the back of some cute Italian guy’s Vespa (or, in one occasion, the front of his bicycle). Good fun, great way to see the city, free &amp; efficient transportation from Point A to Point B, and a perfect excuse to wrap my arms around a good-looking man and live out my Lizzie McGuire dreams. Perhaps not the safest choice, but so far so good. 10/10.",
            "score": 10,
            "author": "justalilargentinean",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao I’m a dude but I envy you. If there’s a straight guy equivalent to this lmk 😂",
                    "score": 5,
                    "author": "__keanu"
                },
                {
                    "level": 1,
                    "comment": "That was a taxi for me in Chengdu once, luggage and all.",
                    "score": 1,
                    "author": "ConnieDee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took a lil golf cart-type vehicle to the castle in Sintra, Portugal and that was fun. Also trolleys, anything open air really\n\nEdit: Hold up I’m totally wrong. Dubious tour guide threw us in the back of a pickup truck and trekked us through the mountains in Ecuador lmao now that was a fuckin ride. So gorgeous",
            "score": 3,
            "author": "__keanu"
        },
        {
            "level": 0,
            "comment": "Motorbiking around in Vietnam was really fun.",
            "score": 3,
            "author": "hepheste"
        },
        {
            "level": 0,
            "comment": "Bikes, expecially the cheap public bike sharing things many places have.\n\nI also like trams cause its less confusing to understand how the ruote is compared to buses.",
            "score": 3,
            "author": "Just_a_spaghetti"
        },
        {
            "level": 0,
            "comment": "Funicular in the alps",
            "score": 3,
            "author": "35XA"
        },
        {
            "level": 0,
            "comment": "A few years ago, I loaded a bunch of camping gear onto [my bicycle](https://np.reddit.com/r/bicycletouring/comments/goucwl/i_didnt_get_around_to_making_trek_thursday_happen/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) and spent the better part of the next seven months riding 5,300 miles (8,500 km) around the western US.\n\nIt wasn't always my favorite, in fact there were some days that really made me question why the hell I ever thought biking across much of a continent would be a good idea. But once it was all over and done with, I looked back on that chapter of my life knowing it was an experience I'll cherish for a long time to come.",
            "score": 3,
            "author": "MasteringTheFlames"
        },
        {
            "level": 0,
            "comment": "Getting lost on the Jeepney in Manila &amp; Riding in an US Army Jeep through the streets of Hanoi",
            "score": 3,
            "author": "FinesseTrill"
        },
        {
            "level": 0,
            "comment": "When my college buddy and I went to The UK, we rented a car and I loved it! It was fun to drive while sitting in the right front seat and shift with my left hand. But more than that, we were the masters of our own destinies. We never had to be at a platform at a certain time. Didn't have to deal with tour groups. We would hear about places to see by the locals and we could go the next morning. It was in March, so we drove into Scotland through a blinding snowstorm, which was adventurous, for me. (I drove.) Lastly, just seeing the English. Welsh and Scottish countryside was breathtaking and we would stop for photos. We even found the ruins of an old cathedral in Wales and not one other person was there. It's expensive, but it was so worth it.",
            "score": 2,
            "author": "Nervous_Magazine_200"
        },
        {
            "level": 0,
            "comment": "For me, the group taxi in Tétouan. I was lucky enough to have met someone who was with me because I still have no idea how they work. They go in one direction and you can’t specify a place!",
            "score": 2,
            "author": "GiraffesInc"
        },
        {
            "level": 0,
            "comment": "I had an early flight in Venetiane, and the hotel desk was closed when I left. I couldn't find a taxi anywhere, in fact there was no one on the streets at all, except a homeless guy. Despite not sleeping any English, he figured out I was headed to the airport. He disappears and a few minutes later, a garbage truck pulls up and offers to take me to catch my flight. \n\nI tipped them both generously.",
            "score": 2,
            "author": "Barflyerdammit"
        },
        {
            "level": 0,
            "comment": "Hitchhiking while camping on St John USVI. It’s the only place I’ve been where it’s actually a safe way to travel. FYI, You don’t use your thumb like in the states…you point in the direction you want to go. \n\nThe first time I pointed a jeep stopped so fast I wasn’t sure they stopped for us. I just stood there until the guy said “you getting in or what?” which snapped me out of my confusion. \n\nIt’s a very small island so murders aren’t likely to kill their passengers. We met cool people. The island is so small we kept bumping into our rides in other places. One family drove around with the side door of their van open all the time so people could get in/out easily.",
            "score": 2,
            "author": "Rusty5th"
        },
        {
            "level": 0,
            "comment": "Literally everything in Hong Kong:\n\nThe Star Ferry, the Peak Tram, the actual tram which allows you go to across the whole of Hong Kong island for a couple of cents.. and even the MTR (metro) which is so quick and efficient\n\nThe Tube in London - there’s just so much to nerd out about",
            "score": 2,
            "author": "Pinkjasmine17"
        },
        {
            "level": 0,
            "comment": "Heaven for me is a slow run down night train in Eastern Europe, smoking cigarettes out the window with the locals, watching the world go by.",
            "score": 2,
            "author": "pkovach64"
        },
        {
            "level": 0,
            "comment": "Most interesting- chicken busses, tuk tuks, and collectivos. I got in a collectivo in Peru once with about 12 people and a baby goat.",
            "score": 2,
            "author": "cutefuzzythings"
        },
        {
            "level": 0,
            "comment": "When I was an au pair, I took a funicular to see the children I looked after—they lived in a home on the mountain, meanwhile I stayed in the city below. Loved going up there every day and seeing the city on the way up!",
            "score": 2,
            "author": "CastleRockResident"
        },
        {
            "level": 0,
            "comment": "The suspended monorail in Wuppertal,  Germany.  Edit to add float planes on the west coast of Canada.",
            "score": 2,
            "author": "salalberryisle"
        },
        {
            "level": 0,
            "comment": "I always enjoy riding on the back of pickup trucks, had some wild rides in Egypt and Jordan! \n\nAlso the airtrain to Bologna Airport is one of the most terrifying things I've ever ridden, it's so fast and shaky that you'd expect it to detach and take off at any time 🤣",
            "score": 2,
            "author": "realvoluntaryexile"
        },
        {
            "level": 0,
            "comment": "Nothing beats the freedom of a good ole rental car. Ive traveled Europe many times using only public transport, but never liked the waiting around, limited destinations, the mild fear of theft my gf felt. \n\nA car in Provence simply cannot be beaten. You can get out of cities and smell the lavender and french broom. You can visit coastal paradises only accessible by cheap car or expensive (and higher polluting) boat. You can explore country markets with the freshest foods you can find anywhere in the world. \n\nYou can get away from the frothing masses.",
            "score": 2,
            "author": "Closed-FacedSandwich",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went on a European vacation with my family several years ago.  I was looking forward to taking trains everywhere.\n\nA train strike meant we had to get a rental car....and the rental car ended up being significantly cheaper than the train (there were 4 of us).\n\nAnd of course the car gave us a lot more freedom on where we could go.",
                    "score": 1,
                    "author": "ignorantwanderer"
                },
                {
                    "level": 1,
                    "comment": "You have a good point, and driving in Europe isn't that hard. But never in Britain unless you're very ambidextrous.",
                    "score": 1,
                    "author": "ConnieDee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took the slow boat from Chang Rai to Luang Prabang... two days of floating down the Mekong with tourists and locals felt like such a good way to see the countries. The seats were old car seats lol so a bit uncomfortable but I'm happy I did it.",
            "score": 2,
            "author": "pinecone_below"
        },
        {
            "level": 0,
            "comment": "1.  Flew in and out of a fishing camp in British Columbia in a Grumman Goose amphibious flying boat.  A real piece of aviation history.\n\n2.  Riding a motorcycle all over Vietnam, Cambodia, and Laos.  Untethered wandering.",
            "score": 2,
            "author": "Advantagecp1"
        },
        {
            "level": 0,
            "comment": "I love a good auto in india and the funicular up the mountainside thing in Hong Kong.",
            "score": 3,
            "author": "swink386"
        },
        {
            "level": 0,
            "comment": "Tuk Tuk in India was equally fun and terrifying!",
            "score": 1,
            "author": "annaamused"
        },
        {
            "level": 0,
            "comment": "Bus for me .. whether it’s Italy or India",
            "score": 1,
            "author": "Nomad0108"
        },
        {
            "level": 0,
            "comment": "The coffin car in the Dolomites was a lot of fun.",
            "score": 1,
            "author": "PMMeYourCouplets"
        },
        {
            "level": 0,
            "comment": "Fast trains. Travelled through China on them. None here in Australia. Population to small for them to be feasible",
            "score": 1,
            "author": "Overall_Performer_49"
        },
        {
            "level": 0,
            "comment": "Sleeper bus from rio to sao paolo. Its a total bed and slept like a baby",
            "score": 1,
            "author": "luckyboyjuni"
        },
        {
            "level": 0,
            "comment": "Scooters in Madeira",
            "score": 1,
            "author": "pm_me_your_stepdad"
        },
        {
            "level": 0,
            "comment": "Boat trip on the Madre de Dios and Tambopata rivers in the Amazon Basin in Peru.",
            "score": 1,
            "author": "Thin_Confusion_2403"
        },
        {
            "level": 0,
            "comment": "MTRs specially in HK taiwan",
            "score": 1,
            "author": "chicharonreddit"
        },
        {
            "level": 0,
            "comment": "My solarpunk heart was very happy when I took the tram in Amsterdam and the tracks were covered in green. It’s the simple things. :-)",
            "score": 1,
            "author": "bookgang2007"
        },
        {
            "level": 0,
            "comment": "My favourites are; Trams in Zurich, Hong Kong Ferries, British Columbia Ferries, Horse drawn Sleigh, and aerial trams/gondolas/teleferiques.",
            "score": 1,
            "author": "WirragullaWanderer"
        },
        {
            "level": 0,
            "comment": "The MRT in Singapore sticks out to me because of how user-friendly it is.",
            "score": 1,
            "author": "Kooky_Recognition_34"
        },
        {
            "level": 0,
            "comment": "I got on an actual pirate ship in Hakone, Japan.",
            "score": 1,
            "author": "anima99"
        },
        {
            "level": 0,
            "comment": "The Shanghai Maglev was a standout to me. Such a unique mode of transport, and whisper quiet at 430kmh.",
            "score": 1,
            "author": "rob_the_plug"
        },
        {
            "level": 0,
            "comment": "Sleeper boat was super fun, the rocking really had me asleep in less than 5 min\n\nEdit: Thailand",
            "score": 1,
            "author": "TheBackpacker2"
        },
        {
            "level": 0,
            "comment": "Slow boat from Siem Reap to Battambang in Cambodia. Long day but it was so cool to pass through many different places. Sat outside for most of it and got a nice sunburn lol.",
            "score": 1,
            "author": "Barge_Chilling_Beach"
        },
        {
            "level": 0,
            "comment": "Combis in Lima, Peru\n\nParis Subways\n\nCable Car in Capri, Italy\n\nTuk Tuks anywhere",
            "score": 1,
            "author": "d14t0m"
        },
        {
            "level": 0,
            "comment": "Amtrak Coast Starlight. Stunning",
            "score": 1,
            "author": "PenialColada"
        },
        {
            "level": 0,
            "comment": "Free private transportation for me. \n\nIt's free, convenient, and private. It helps you see a lot of things that other transport can't. You can use it whenever you want, as long as not overusing it. I meant: your legs. 😀",
            "score": 1,
            "author": "JYDDK"
        },
        {
            "level": 0,
            "comment": "I did a dhow cruise this week in Lamu in the Indian Ocean, i felt like i was in a movie. I also love gondolas, tokyo and london metro, flying in smamm airplanes, helicopter and gamedrives!",
            "score": 1,
            "author": "Bright-Butterfly8297"
        },
        {
            "level": 0,
            "comment": "Car Train in Slovenia. \nAs in a train you drive a car onto, like a car ferry but train based.",
            "score": 1,
            "author": "HappyHev"
        },
        {
            "level": 0,
            "comment": "Sucker for all things trains (I attribute that to the fact that I am half Japanese) and my most memorable rides have been:\n\n-\tNozomi Express from Tokyo to Kyoto - Shinkansen that goes 300 kph but you get on/off like a normal subway train\n-\tRJX in Austria from Vienna to Innsbruck - train that goes through some amazing landscapes at 230 kph\n-\tHungerburg Funicular - funky little train that takes you up the mountains in Innsbruck, and does so at a 45 degree angle. Each car is divided into section that actually kind of stair-step as it goes up the steep inclines, and you have a beautiful view of Tirol.",
            "score": 1,
            "author": "golfzerodelta"
        },
        {
            "level": 0,
            "comment": "Kayaking off Vancouver island Canada",
            "score": 1,
            "author": "Ok-Investigator-1608"
        },
        {
            "level": 0,
            "comment": "walkinh",
            "score": 1,
            "author": "Shougee369"
        },
        {
            "level": 0,
            "comment": "Tuk Tuk in Cambodia, freighter across the Pacific, most trains.",
            "score": 1,
            "author": "NewCope"
        },
        {
            "level": 0,
            "comment": "I loved the public ferries in Stockholm",
            "score": 1,
            "author": "11claudiaAM"
        },
        {
            "level": 0,
            "comment": "* Ferries in Calcutta and Bangkok - cheap, efficient, and such a lovely and calming experience of otherwise hectic cities. \n* The Docklands Light Railway in eastern London - always fun to imagine yourself driving one of these mini trains when sitting up front. \n* Funiculars - usually enjoy these just for the novelty. While Paris (Montmartre) doesn't really hit the spot for me, Budapest, Barcelona, and Cape Town (Cape Peninsula, rather) are fun to ride. \n* And ofcourse, the metro systems of the former Soviet Union (and eastern bloc, for that matter). The stations are really something, even in lesser known cities like Tashkent. \n\nI'm also a bit of a public transport nerd (being an urban planner), and am always fascinated by metro/MRT/Subway maps and networks, wherever they may exist.",
            "score": 1,
            "author": "lazycat1989"
        },
        {
            "level": 0,
            "comment": "Scooter around Ometepe, Nicaragua.",
            "score": 1,
            "author": "Travel_Dude"
        },
        {
            "level": 0,
            "comment": "Riding on the top of a jeepney in the northern mountains in the Philippines. 2 hour ride. Laying on the top during a sunny dah, green rolling hills for ages, filipino hippies smoking weed on top, beautifully decorated, colorful refit army vehicle.\n\nInformal transit is my fav",
            "score": 1,
            "author": "potandplantpots"
        },
        {
            "level": 0,
            "comment": "My favorite modes of travel have always been my own power. I walked around Peru for three months, and rode a bike around Cambodia for 6 weeks (two separate trips). These were the highlights of all my travels.",
            "score": 1,
            "author": "TropicalWaterfall"
        },
        {
            "level": 0,
            "comment": "The OBB Nightjet across the Semmering Pass from Vienna to Venice during a snowstorm. It was magical. (https://whc.unesco.org/en/list/785/)",
            "score": 1,
            "author": "mollyoday"
        },
        {
            "level": 0,
            "comment": "The steam engine train that runs on a narrow-gauge track from the mountainous city of Darjeeling, India down to the city of Siliguri, India.\n\n[https://www.google.com/search?gs\\_ssp=eJzj4tTP1TcwsShOKjNg9OIozszJTC8tygQAQtUGsQ&amp;q=siliguri&amp;rlz=1C1CHZO\\_enUS916US938&amp;oq=siliguri&amp;aqs=chrome.1.0i355i433i512j46i340i433i512l2j0i512l3j46i512j0i512l3.7358j0j7&amp;sourceid=chrome&amp;ie=UTF-8](https://www.google.com/search?gs_ssp=eJzj4tTP1TcwsShOKjNg9OIozszJTC8tygQAQtUGsQ&amp;q=siliguri&amp;rlz=1C1CHZO_enUS916US938&amp;oq=siliguri&amp;aqs=chrome.1.0i355i433i512j46i340i433i512l2j0i512l3j46i512j0i512l3.7358j0j7&amp;sourceid=chrome&amp;ie=UTF-8)",
            "score": 1,
            "author": "WillrayF"
        },
        {
            "level": 0,
            "comment": "Most of the Zermatt funiculars are pretty sick",
            "score": 1,
            "author": "usr3nmev3"
        },
        {
            "level": 0,
            "comment": "Favorite - definitely just regular subway/trains/air trains/under ground trains. I love them. \n\nMost memorable - songteow (spelling?) in Thailand. Just pickup trucks with benches on the back that the locals use. ❤️",
            "score": 1,
            "author": "Past-Organic"
        },
        {
            "level": 0,
            "comment": "Funiculars. I love the idea that they must be double - one coming up and the other one coming down (also true of some cable cars.) They come in all kinds of styles, sizes and ages. There are tiny ones in Valparaiso and Lisbon. The one up Victoria Peak in Hong Kong is famous, but locals still use it to get up the hill. The one in Los Angeles was restored and used in the latest \"Perry Mason\". \n\nAlso, seeking them out can lead you on some interesting side trips that allow you to see cities from other perspectives since they are often off the beaten path.",
            "score": 1,
            "author": "ConnieDee"
        },
        {
            "level": 0,
            "comment": "Took an overnight RORO ferry from Rotterdam to Hull - the tiny private cabin wasn't very expensive and the ports were fascinating. Coming into Hull you get a chance to see wind turbine masts getting ready for shipment.",
            "score": 1,
            "author": "ConnieDee"
        },
        {
            "level": 0,
            "comment": "Love both modes of transportation found in Lake Atitlan, Guatemala. The only way to get between the villages that surround the lake is either via lancha boat taxis that you catch by standing out on a dock and waving; or the tuk tuks in the mountain paths.",
            "score": 1,
            "author": "njm123niu"
        },
        {
            "level": 0,
            "comment": "I don't think I've seen garbage truck mentioned yet. \n\nHad a friend who stayed out much later than I did one night in a little Italian village, but forgot how to navigate back to our hotel as we had just checked in before going out for the night. A small garbage truck was doing its rounds around 4:30 am and took pity on her, drove her right back to the hotel. \n\nShe took video of the adventure and was one of the funniest things ever.",
            "score": 1,
            "author": "njm123niu"
        },
        {
            "level": 0,
            "comment": "There are buses that take you around the tourist part of Cancun, but they aren't standardized and I got on one that was a straight up bugs bunny-themed party bus. Loved it.",
            "score": 1,
            "author": "teethandteeth"
        },
        {
            "level": 0,
            "comment": "Definitely a Tuk Tuk... Or teleféricos in the Andes",
            "score": 1,
            "author": "CheverePrepago"
        },
        {
            "level": 0,
            "comment": "Tricycles in El Nido, Philippines. Getting picked up at the airport in a torrential downpour and driving to the town was interesting.\n\nAlso, always fascinated by the BTS in Bangkok. With a city as busy and chaotic as Bangkok, the BTS is very clean and orderly.",
            "score": 1,
            "author": "Imaginary_Engineer1"
        },
        {
            "level": 0,
            "comment": "The Mexican collectivo! A pick up truck with a tarp and bench seats that travels a set route for $5 pesos!",
            "score": 1,
            "author": "SnooTangerines7525",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second is the pepinos in Nicaragua, specifically in Rivas, a bike taxi where you sit in front",
                    "score": 1,
                    "author": "SnooTangerines7525"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The road up the cliffs from the ports in Santorini is terrifying! Multiple times during my stay there, I had to assure myself that the drivers handle these roads several times a day and I'm not about to die in a horrific fall off the cliffs. That was the only way I could handle the Formula 1 style driving they do with buses!",
            "score": 1,
            "author": "GreenEyes9678"
        }
    ]
}