{
    "id": "141d5qg",
    "score": 7,
    "title": "First-Time Trip to the Pacific Northwest (PNW)",
    "author": "speedyjolt",
    "date": 1685968520.0,
    "url": "https://www.reddit.com/r/solotravel/comments/141d5qg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello fellow solo travelers! I'm a urban transportation planner and food adventurer from Ohio heading to the Pacific Northwest for the first time this July! Visiting Vancouver (4 days), Eugene (2.5 days), Portland (5 days), and Seattle (5.5 days) in that order respectively. No car on this trip, so Amtrak, public transport, and bikeshare would be how I'd get around. For each city, I focus on the following categories: food scene, urbanism/neighbo(u)rhoods/placemaking, nature/hiking/running, the two/three top tourist attractions (free or at a low cost), rainy day places, hidden gems. I'll put some things on my itinerary (it's too long if I list everything):\n\nVancouver: Salmon n'Bannock, Baby Dhal Roti Shop, Arbutus Greenway, Mount Pleasant (neighbo(u)rhood), Capilano Suspension Bridge\n\nEugene: Izakaya Meiji Co, Lion and Owl, some bike route, Whitaker (neighborhood), Alton Baker Park, Hayward Field\n\nPortland: Kann, Grand Fir Brewing, Boise (neighborhood), Ladd's Key to SE Portland (or another enjoyable and challenging bike route), Council Crest Park\n\nSeattle: Taku, Rachel's Bagels and Burritos, Pioneer Square (neighborhood), biking in the Green Lake neighborhood, Discovery Park\n\nTrain travel: I've heard that business class on Amtrak isn't really worth it, because contrarily on VIA Rail (CAN), you get a complementary meal and unlimited drinks throughout the whole journey. I'm thinking about just getting coach seats, including the journey from Vancouver, BC to Eugene w/a 1.5 hour layover in Seattle to dine and grab lunch. Do you agree I should just stick with coach seats?\n\nI've done solo travel every year since 2016 (minus 2020) visiting various places, and it's an extremely rewarding experience! For reference, chronologically, where I've traveled so far: Denver/Boulder, Boston, Los Angeles, NYC, SF/Oakland, Pittsburgh, Montreal, Toronto, Detroit.\n\nWhat else would you recommend I should do during this trip?",
    "comments": [
        {
            "level": 0,
            "comment": "For Vancouver, Imo, capilano suspension bridge is very expensive for what you're getting. Lynn Canyon bridge is pretty similar and free! Also since you'll be in the area, the Big Cedar trail is worth checking out!\nIf you like Cambodian food, Phnomh Penh is delicious.",
            "score": 10,
            "author": "kpticbs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes for Lynn Canyon! Plus theres a bus that leaves for Lynn canyon from shipyards market in North Van, which is a fun place to check out too.",
                    "score": 3,
                    "author": "TheLindberghBabie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooooh good shout, that way you'd get to take the seabus from downtown, which is fun in of itself :).",
                            "score": 3,
                            "author": "kpticbs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yay would love to experience the seabus!",
                                    "score": 1,
                                    "author": "speedyjolt"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow, thanks for noticing that Capilano Suspension Bridge Park is really expensive. $67 and then $53 at night, no thanks. I'll reroute myself to Lynn Canyon Bridge! I'll make sure to add the Big Cedar Trail if I still got energy from the legs. And yes, I love to have Cambodian food when I get the opportunity, so I'll add Phnomh Penh to my restaurant list. Thanks for your suggestions!",
                    "score": 2,
                    "author": "speedyjolt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If u like bars, I'd check out Uncle Abe's. It's a dive and nothing particularly special about it but it's got a really nice friendly crowd, great place to meet some cool locals, everytime I go there I leave with a new friend Hehe.\nBeaver lake in Stanley park is also amazing if ur staying around downtown.\nLemme know if u have any qs :)",
                            "score": 2,
                            "author": "kpticbs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for that suggestion, and it's in Mount Pleasant! I would like the chance to socialize with the local crowd! I'll check out Stanley Park for a bit!",
                                    "score": 1,
                                    "author": "speedyjolt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you wanted to see Multnomah falls there's a bus in Portland that takes you directly to it for $20 ($10 each way) called columbia area transit",
            "score": 7,
            "author": "BlendyButt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh! That sounds amazing! I looked up on the Ride CAT Bus site and noticed there's a $15 online only all-day pass! I wonder if there's any food options near the falls or if I would need to buy something relatively portable prior to the ride?",
                    "score": 1,
                    "author": "speedyjolt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a snack bar and espresso stand but if you want something more filling you're better off bringing your own food",
                            "score": 2,
                            "author": "BlendyButt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good to know about that. I'll probably end up getting some salmon candy or something else local and bring that on the train!\n\nEdit: apologies on my part that earlier, I thought this was on Amtrak! I'll probably pack something easy to travel if I want to go to the falls!",
                                    "score": 1,
                                    "author": "speedyjolt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seattleite here, I’d recommend skipping Pioneer Square, the last several years it’s gotten very run down. Capitol Hill and Columbia City both have light rail stops and are cool areas to walk around. There’s a foot ferry in downtown that will take you to Alki Beach (West Seattle) and that’s also good for biking, but your choice of Green Lake is good as well. \n\nAs for restaurants, so many to choose from! I think the two you’ve selected are solid. Would also recommend Pike Place Chowder. You’ll wait in line at the Pike Place Market one, but you could always get it to go and head down to the park nearby to people and boat watch. The other location is in a mall, quick but boring views. :)\n\nDoes Amtrak run from Vancouver to Oregon? I rode it several years ago so things may have changed, but I had to take a bus to the train station in Bellingham WA. The ride from Bellingham to Seattle is beautiful in many places, lots of water views so sit on the right hand side.\n\nVancouver BC is a gorgeous city.\n\nHave oh so much fun on your trip!",
            "score": 4,
            "author": "JankyJens",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Amtrak Cascades goes to Vancouver. There’s two trains a day.",
                    "score": 4,
                    "author": "bandyvancity"
                },
                {
                    "level": 1,
                    "comment": "Agreed with skipping Pioneer Square, unless there's an event at the stadiums, then lots of people are out and it's pretty fun. It's also among the most historic neighborhoods in Seattle. Otherwise, Capital Hill, Ballard, West Seattle to name a few neighborhoods.",
                    "score": 3,
                    "author": "JazzWomanCan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm thinking about heading to a Mariners game, so I'll check out Pioneer Square only before going to one. Would you recommend bringing food to the ballpark or check out ones inside it?\n\nDefinitely going to Ballard since the owner is originally from Cincinnati (and heard the food there is delicious even during its days as Porkchop % Co.), which is very close to where I live. Definitely will add Captial Hill and West Seattle. Thanks for your suggestions!",
                            "score": 1,
                            "author": "speedyjolt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't bring your own food! I'm pretty sure that's not allowed (you can't even bring a medium sized purse inside), but the stadium has pretty good food, so you should check that out anyway.",
                                    "score": 2,
                                    "author": "JazzWomanCan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would definitely agree not to bring food; though baseball, compared to other sports in this country, is surprisingly different. Only Detroit and Miami don't allow you to bring in food.\n\nPer the Mariner's website: https://www.mlb.com/mariners/ballpark/gate-bag-policy-faq. \n\n\"Outside food is permitted in single-serving sizes. Sealed, clear plastic water bottles up to 32oz, baby bottles, beverages related to medical needs, and unopened, soft-sided single serve containers like juice boxes are permitted. Soda, coffee or other beverages are not allowed. Guests may also bring in one empty plastic reusable bottle 32 ounces or smaller.\"\n\nI'll definitely bring in an unopened bottle of water (cause me drinking only beer doesn't bode well). I've heard they've got some of the best food in the MLB, so I'll still check out the food and see ahead of time what options are around!",
                                            "score": 1,
                                            "author": "speedyjolt"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I lived in cap hill for years. Just left. I’d skip it. Better to spend time outside the city. Maybe stay for dinner or brunch or maybe drinks .",
                    "score": 1,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Definitely skipping Pioneer Square except before a Mariners game for a bit. I'm a bit perplexed on the bikeshare options in the city, since I know there's been issues with it over the past decade or so. Would you recommend renting one or just use the bikeshare?\n\nI'll check out Pike Place Chowder in Pike Place Market. I'll just wander around for a bit in the market itself since I heard it's usually crowded. Since the original Starbucks is so close, I'll just take a photo of myself in front of the entrance and not get the coffee itself since it's a tourist trap.\n\nI think the trip I'm taking to Eugene is bus from Vancouver to Seattle and then take the train. I'll keep in mind to sit on the right-hand side.\n\nThanks for your suggestions!",
                    "score": 1,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Portland Japanese Garden was the best thing we did in Portland. You can get public transport from downtown. Both Portland and Seattle have serious homeless issues-you’ll see tents placed both downtown and in the suburbs of Portland. Seattle has similar problems on 3rd (?) Ave and Pioneer Square has plenty of down and outs. Pike Place is fun watching the fishmongers and checking out breakfast. \nEnjoy!",
            "score": 4,
            "author": "andyone1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Japanese Garden is one of the top attractions on my Portland list. Pike Place is on the list too. Thanks for your suggestions!",
                    "score": 2,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kayak on lake union, fish ladder at the Ballard locks, Japanese tea garden, the zoo, good call, e-biking is the way to go, swimming or laying out, you can jump off the bridge at the bottom of lake union, the Fremont troll is worth the hype, ferry to Bainbridge island, dick’s burgers, gas works park. Fremont is a beautiful area to explore. Delicious hot smoked salmon as a snack from pike place market. Renting an electric boat on lake union was a blast, but expensive so probably better not solo. \n\nThere’s an Airbnb day tour of Olympic national park where they pick you up and drop you back off in Seattle. I’m doing the hoh rainforest one but that requires a car. The hostel I’m staying at will be doing a pub crawl and free walking tour, so will give those a shot. \n\nI’m doing a solo trip to Seattle this summer too, though I have been there twice not solo. It is out of this world gorgeous in summer. Enjoy!\n\nEdit: and green lake and walk along the Fremont cut. Great fun to boat watch there since they are very close by and go slow. Might go to national Nordic museum this trip. Have never been.",
            "score": 4,
            "author": "loungeroo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems like Fremont is the way to go. I know there's been issues with bikeshare in the city for around a decade, so I'm not sure whether to use one or to rent a bike?\n\nI wish I had more days in Seattle to check out Olympic National Park. Maybe on the next trip.\n\nAs far as hostels, are you talking about HotelHotel (in Fremont) Green Tortoise (across from Pike Place Market and includes bike rental), or another one?\n\nOoh there's a Nordic museum? Might have to check it out!\n\nThanks for your suggestions!",
                    "score": 1,
                    "author": "speedyjolt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Last time I used Lime e-bikes, there are lots scattered around the city. It would almost certainly be more economical to do a multi day rental from a shop though, if doing lots of riding. I need to look into that. \n\nNo worries, I waited until my 3rd (upcoming) trip to check out Olympic. \n\nHaha yes, I'm talking about both of those! Tbh I have graduated from hostel stays, but I decided to give it a shot again since this will basically be my first solo trip. HotelHotel is in a much prettier location, but I like how staying in both encourages me to explore more of the city. \n\nI didn't realize Green Tortoise provided bikes, that's cool, I will check what kind. Personally it's important for me to have an e-bike since it helps me explore more and not avoid hilly areas. \n\nThe reviews of the Nordic museum are so so, but I might need to check it out anyway since that cultural influence on Seattle is one of the many reasons I like it.\n\nNo prob! Fun to chat and get excited about our trips :D",
                            "score": 2,
                            "author": "loungeroo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Likewise, I'll have to do more research or see what other folks think on the biking situation.\n\nUnfortunately, HotelHotel only has private rooms available with the days I'll be there, so I'm thinking about leaning towards the other one I mentioned.\n\nI'll probably skip Nordic Museum. Klondike Gold Rush National Historic Park is free. The Wing Luke Museum I'm interested since I'd like to see the history of fellow Asian Americans in the PNW ($17). Museum of History &amp; Industry I'm also interested since it shows the history of Seattle and the greater Puget Sound region ($22). I'm not really an art museum fan, so I'll just go outside of the buildings and take photos of those.\n\nLikewise, fun chatting about our trips! :D",
                                    "score": 1,
                                    "author": "speedyjolt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always good to bring layers. T-shirt, Long Sleeve, Rain Jacket, Puffy... etc.  \n\nBring water and snacks/sandwich or other food.\n\nI went on a trip to WA state in April and was delayed at the train station\n\nfor 3 hrs. because someone walked on the track and was hit. Business class was not available so we sat in Coach. On the way back there was no observation or snack car. Minimal snacks were provided but they did have the dining car. I already had drinks, snacks and food with me to save on the dining costs so it was nice I was prepared. I also have food allergies....\n\nOne thing I brought was a blanket scarf and a foam pad to sit on. It was nice on the hard benches at the station and the minimally padded seats on the train. Nice to have the scarf as a blanket on the train at night... air con is on all the time.\n\nThe snack car closes at 9:30pm so nice to have a granola bar for a late night, or an early morning snack.  Eye mask and earplugs are also great to have.\n\nHappy travels!",
            "score": 3,
            "author": "Cre8ive1-4u",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, thanks for the layers suggestion. It can get cold, at times, from what I heard.\n\nI might check out Chinatown-International District during my 90-minute layover in Seattle and get something there. I'll very likely stick w/coach seats. Blanket scarf, that's something to add on the list. Eyemask, earplugs, and snacks noted.\n\nThanks for your suggestions!",
                    "score": 1,
                    "author": "speedyjolt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welcome. have a fun and safe trip!",
                            "score": 2,
                            "author": "Cre8ive1-4u"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My brother lives in mount pleasant and I’ve stayed in that area 15 different times over the last 5 years. I had no idea that it would be a tourist attraction, to be honest it’s no different than another neighbourhood. It’s nice but not, very special. Why did you have that as a travel spot? Just curious.",
            "score": 3,
            "author": "Born-Chipmunk-7086",
            "replies": [
                {
                    "level": 1,
                    "comment": "I picked it, because it's the oldest neighbourhood in the city. I'm intrigued about the usage of its neighbourhood parks (from an urban planning perspective) and the food scene. It's also on some top-world neighbourhoods on some sites, so I'll check it out and see what I think.",
                    "score": 1,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can give you my tips for Vancouver. \n\nActivities: Deep Cove can be a good place to visit for a mix of outdoor activities and transit friendly. There is an easy hike with a beautiful view and a calm inlet where you can go kayaking. Go on a weekday though because it is unenjoyable busy on a weekend. \n\nFood: I would recommend getting Korean and Cantonese food here. Vancouver has I think the second most Koreans outside of Korea behind LA, and I am sure top five for Cantonese outside of HK. So if you want stuff that are better here than the rest of North America, those are the cuisines imo. . For Korean food, assuming you stay in Vancouver So Hyang is my favourite but it is less central. If you want something downtown, Sura is always a classic. For Cantonese food, if you have time, go down to Richmond with the Skytrain. There are tons there, just do a Reddit search of foods in Richmond. Lido Cafe there is a favourite for many Cantonese people as well as honestly the food court at Aberdeen is bomb. But if you stay in Vancouver, places with Cafe Gloucester or BT Cafe are both classic HK style cafes in the areas you are visiting. I would say as a Canadian born Chinese, that my relatives from HK tell me the food here in Vancouver is as good as what they get back home.",
            "score": 3,
            "author": "PMMeYourCouplets",
            "replies": [
                {
                    "level": 1,
                    "comment": "I might have to combine Deep Cove w/Lynn Canyon Suspension Bridge, since both are in North Vancouver. I read it's about a 45-minute ride between the two places. If I somehow don't make it to Deep Cove, is there another place for kayaking you would recommend?\n\nYes, as a fellow Asian North American, Korean and Cantonese food are essential in Vancouver. Some great recommendations on here!\n\nThanks for your recommendations!",
                    "score": 1,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "VANCOUVER: skip Capilano suspension bridge. Lynn Canyon is a better choice.\n\nStanley Park is another one that is a bit overrated. It's still really nice but tough to get around without a vehicle.\n\nIsland Park Walk is nice with great views of downtown, close to Granville Island and very central. You can take a water taxi from there as well which is fun.\n\nCommercial and Victoria Dr have some nice spots to walk around down the side streets.\n\nWalking through Gastown into Chinatown/Lower Eastside is a unique Vancouver experience, to put it lightly. Not for everyone but definitely eye opening. The wealth disparity here is very apparent.",
            "score": 3,
            "author": "huge_red_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lynn Canyon I see doesn't cost anything, so definitely doing that. I might touch a little bit of Stanley Park and see what it's like. Like you said, it's tough to get there without a vehicle/using public transport.\n\nIsland Park Walk is another opportunity to take the water taxi (I'm thinking about using it on the way to Lynn Canyon)!\n\nI'll have to check out Gastown and see it first hand. It's something as an urban planner that I'll have to check out from a personal perspective.\n\nThanks for your suggestions!",
                    "score": 2,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "seattlelite - for a full ish day excursion: another great option could be taking the light rail to the piers downtown (walk through downtown and end up at a great sculpture garden) eat some fish and chips (ivars) and then hopping on the bainbridge ferry (walking or biking) to get to a great PNW island. it’s fairly inexpensive and a really interesting/fun day trip. there’s great biking trails, food, beach walks, and indigenous history and culture on the island. that’s utilizing seattle public transportation to the max",
            "score": 2,
            "author": "Lost-Analysis1",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh also!! forgot to mention that if you want to go for a hike (would be another day trip) our public bus system will take you to popular and fun trailheads. Lookup trailhead direct. mount si is a great stop on it!",
                    "score": 2,
                    "author": "Lost-Analysis1"
                },
                {
                    "level": 1,
                    "comment": "Thanks for your suggestions! I've read that Seattle has had issues w/bikeshare over the past decade or so. Would you recommend renting a bike instead?",
                    "score": 1,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are interested in urban transportation, don't forget to try our ferry system in Seattle.  Definitely the west seattle ferry, but also maybe something like Bainbridge.\n\nRent a bike and try our bike trails, maybe trying to make a loop including the I90 and 520 floating bridges.\n\nTry renting a kayak and getting out on Lake Union - a very urban water experience.",
            "score": 2,
            "author": "FruitOfTheVineFruit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love the suggestion kayaking in Lake Union!",
                    "score": 2,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a bit hard to give nature recs without having a car, but for seattle I think you could bus to Isaquah and do the poo poo point hike (that’s the real name, I’m not even kidding). Great view and you can watch paragliders taking off at the top.",
            "score": 2,
            "author": "IVIichaelD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg that's hilarious that it's named Poo Poo Point! XD\n\nI'll keep that in mind!",
                    "score": 1,
                    "author": "speedyjolt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really liked the west Seattle beach when I went. I’d Uber down to far end, get a coffee , then walk until the ferry and take it back to downtown. Maybe start a day with this.",
            "score": 2,
            "author": "CloutWithdrawal"
        },
        {
            "level": 0,
            "comment": "Definitely Raquel’s Bagels &amp; Burritos!  Also, best pizza ever at Sunny Hill!",
            "score": 2,
            "author": "EmploymentOwn7035"
        },
        {
            "level": 0,
            "comment": "Vancouver you can’t miss Stanley Park, as well as the north shore of West Vancouver. Catch Horseshoe bay, bring some sushi, you won’t regret it. Super easy transit as well.",
            "score": 2,
            "author": "Witty-Carpet4189"
        },
        {
            "level": 0,
            "comment": "From Seattle. Pioneer square is a shithole, the other places won’t take much time.. Spend more time in the mountains. Get a zip car.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}