{
    "id": "142mc57",
    "score": 10,
    "title": "Lisbon In February",
    "author": "SnibStar",
    "date": 1686070890.0,
    "url": "https://www.reddit.com/r/solotravel/comments/142mc57",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, first-time poster so please let me know if I need to remove my post or make any edits. &lt;3\nI’m a 24M American splitting my time between Detroit and northwestern Ohio, a little over a month ago unexpectedly my mother passed away. Now I want to plan a solo trip for myself as before my mom passed away we talked a lot about international trips she wanted to start making again and how she wanted me to experience travel as an Adult (she used to love traveling but as time passed she wasn’t able to as much). Now that I have the means, I'd like to try and make my own trip to try and continue her love of travel and hopefully heal a little bit.\n\nI will be starting out of Detroit, or an Ohio airport if that would be cheaper, and Flying into Lisbon Portugal. I am planning my trip for Feb 8-11. I've read that Lisbon isn’t too busy then and will have nice weather that time of year. Some of the things that I would like to do are walk a new city, try new food, and view a historical place I've read about. My budget for this trip would be $1,500-$2500 if possible. I plan on staying in a hostel, I've never tried one before but have heard good things about them. I am willing to spend the most on food as it’s one of my main interests. My main interests in life are food, different cultures/religions (grew up in the Midwest and the only times I traveled out of the country was with my mom as a child/ teen), music, and cars, although I do not know what type of car scene Lisbon has, if any. As for an itinerary, the 9th and the 10th will be my full days and I'd like to get lunch and dinner at authentic or interesting restaurants and view at least one museum or historical site. As for the research I’ve done myself, I've looked into flights to Lisbon and some hostels in the area as well as watching a few videos on the city including Anthony Bourdain’s No Reservations episode on Lisbon (my mother and I are big fans of his, RIP). However, I am quickly getting overwhelmed as I’ve never solo traveled before or planned a trip of this scale and do not know what to plan for. I like to think I’m a good planner but I need to know what's realistic and what variables I need to keep in mind. \nThanks in advance and if it’s allowed please let me know if other destinations wouldbetter fit my goals. also sorry if my post is too long I don’t know home much info is necessary 😅",
    "comments": [
        {
            "level": 0,
            "comment": "I'd be surprised if you needed $100 a day. It's the cheapest country in Western Europe. Good hostels are $25. Unless you're intending to eat at high-end restaurants. The weather won't be 'good' in February. It's the capital in Europe that gets the most sunshine but it's still winter. The city has a good mix of the relatively modern streets (constructed after the 1755 earthquake) and the old Alfama district of pretty, winding streets that survived the quake.\nSintra is a popular day trip from Lisbon. It looks like a Disney palace. \n\nAre you able to go another time of year for longer? Because it will be warm and you could see Porto too.",
            "score": 7,
            "author": "huntergreeny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reply I really appreciate your insight. I had planned on spending $25-$35 a night at hostels, but did not really know what to expect anything else to cost. Good food is the one thing i’m willing to pay high end prices for, but probably just one high end meal and spend the rest of my time trying as many different types of food as I can. In regards to time of year,  I could possibility fly out on September 28th and fly back on October 1st and I think this would work better weather wise. I really wish I could take a longer trip and hope to in the future, the issue lies in the fact that I attend school year round and my two breaks are going to be spent helping family and celebrating holidays. That leaves me with the long weekends in between the terms at my school. I hadn’t thought of taking a day trip to Sintra but I really like the idea, thanks so much.",
                    "score": 3,
                    "author": "SnibStar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! So sorry for the loss of your mother. \n\nPlanning a trip is a good idea, it’s good to have something to look forward to. \n\nI visited Lisbon this February and I found it an easy city to navigate. The only thing that caught me out was that the bus from the airport only took cash and I didn’t have any. Luckily, a kind man paid for me! \n\nDefinitely try to eat somewhere local and not touristy. I had the best meal of seafood stew at a neighbourhood place with a friend who lives in the city.\n\nIt’s a lively place that you can enjoy just wandering around, taking in the views, walking by the sea… enjoy.",
            "score": 4,
            "author": "missyesil",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the reply, i definitely wouldn’t expect a cash bus fair so i’m glad for the heads up. i’m glad to hear that a lot of the things i believed about lisbon are true based on your comment and some more research i’ve done since posting. how crowded was the city when you visited in february if you don’t mind me asking?",
                    "score": 1,
                    "author": "SnibStar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It wasn’t that crowded away from obvious tourist spots.",
                            "score": 2,
                            "author": "missyesil"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry about your mom. If you need a break from the city at some point it's easy to catch a train to mellow little towns that are stunningly beautiful like Cascais. The trains are super easy to navigate and in 30 mins you can be there on a ride that goes along the sea. I've been lucky to travel a lot and Lisbon is one of my favorite places--the architecture, history, people, food. Learn a few words of Portuguese even though most people speak English, to show respect. Read up on the history and just let yourself get lost and take it all in. You're going to have a really nice time.",
            "score": 2,
            "author": "bluecoastblue",
            "replies": [
                {
                    "level": 1,
                    "comment": "First off I greatly appreciate the condolences🖤. I hadn’t even thought about the trains/taking a day trip on one of my full days but after reading your comment and another i’m excited to try it! thanks for the comment and insight. (:",
                    "score": 2,
                    "author": "SnibStar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Weather is not great in February. Expect rain wind and some cold (7/8 degrees) all these together can be quite annoying. Plus, choose your hostel/hotel well. Winter in Portugal is hell, houses are super cold. Source: A portuguese who never understood how northern Europeans could survive the winter.",
            "score": 2,
            "author": "Unlikely_Panic_8920",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate your valuable input on the time of year, some others have mentioned that so I now plan on trying to go September 28-October 1, which I believe should have much more pleasant weather.",
                    "score": 2,
                    "author": "SnibStar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Note:** Are you asking for travel advice about Portugal? Read what the Solo Travel community had to say in the [weekly destination thread for Portugal](https://www.reddit.com/r/solotravel/comments/10uec2c/weekly_destination_thread_portugal/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I lived in Lisbon for a year back in 2017 and had a lovely time. I visited twice before, in 2013 and 2015. Back in 2015 we ate very well at O Velho Eurico, a small tasca in the Alfama neighborhood. This restaurant was recommended in the Routard and yet all the clientele was Portuguese. \n\nI have plenty of recommendations for things to visit but the majority of them are walking around. Stop at some miradouros to have a great view of the city or the river and have a drink. \n\nMy mother also passed away recently unexpectedly and I'm planning on going on a weeklong trip for the anniversary of her death.",
            "score": 1,
            "author": "simonxvx",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks so much for sharing and leaving a reply! I really appreciate this input, especially the O Velho Eurico suggestion. the more i look into planning this trip the more possible it feels :). i hope your anniversary trip goes well, i’d like to imagine your mother will be looking down fondly watching you enjoy your trip. I hope you don’t mind me asking, but as someone who seems to be well traveled, especially in Portugal, do you think my budget is realistic? ￼",
                    "score": 3,
                    "author": "SnibStar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I understand your post correctly, your budget is $1,500-$2500 for 3 days. I don't know how much your flight tickets will cost you but with this amount you could stay in Lisbon for two weeks minimum. Back in 2013 and 2015 the hostels were mad cheap, 10EUR a night. Now it's more expensive but still, Portugal is a very cheap country so you'll be alright. I would run a simulation if I were you and see if I can't stay a bit more. You could easily stay for a week-10 days in Lisbon without getting bored (given that you'd move around a lot in that scenario)",
                            "score": 2,
                            "author": "simonxvx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really wish i could stay longer but I attend school year round and my 2 breaks will be used for helping/spending holidays with family. I hope to return for a longer Trip after graduation but for now i’m stuck with the long weekends in between my terms at school. the more I look into it i’m realizing that i’ll be fine with my budget which is nice. Also i’ll probably be going in September 28-October 1 on another commenters suggestion which i believe will have much nicer weather. I think that’ll use more of my budget for my plane tickets but since Portugal is less expensive than I anticipated i think it’ll still work out well. Thank you so much once again for your helpful and insightful comments.",
                                    "score": 2,
                                    "author": "SnibStar"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}