{
    "id": "144e0k2",
    "score": 6,
    "title": "Travelling with Flixbus in Europe",
    "author": "SinfulSight",
    "date": 1686242047.0,
    "url": "https://www.reddit.com/r/solotravel/comments/144e0k2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'll be travelling with Flixbus for 13hours, with a total of 13 stops. \n\nCan you guys share your experiences and advices if you ever had a long distance experience with it?\n\nI'll also be carrying 2 suitcases (paid for both) and worried about that. Do you have bad experiences with lost suitcases, delayed/cancelled trips? Good experiences are welcomed as well!",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like you're planning a trip around Europe. Check out solotravel's [detailed guide to planning a solo Eurotrip](https://www.reddit.com/r/solotravel/wiki/eurotrip) for general planning advice plus useful tips and tricks for European travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My longest trip with Flixbus was 8h and it was okay. Train rides are much more comfortable to me. \n\nWith every long journey, make yourself comfortable. Bring movies on a tablet, a book to read, enough snacks, maybe a sleeping mask and noise canceling headphones. I never used the toilet on the bus so I can’t comment on that. Bring your phone charger, so you can charge your phone on the bus if you use it a lot. The wifi is often lacking. \nI had delays up to an hour but that was only once. Other times it was “only” 20 minutes. I got a text message though and the app notifies you if that’s going to be the case. \n\nActually going to hop on a Flixbus tomorrow (only 4h). \n\nWishing you a safe journey!",
            "score": 11,
            "author": "steffysteffysteffy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Safe journey for you too 😊",
                    "score": 2,
                    "author": "SinfulSight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have had a 68 hour bus ride from Toronto to Edmonton once, you got this!",
                            "score": 1,
                            "author": "Upstairs-Extension-9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "68h? Gosh, that would be a no from me 💀🥲",
                                    "score": 2,
                                    "author": "steffysteffysteffy"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ah yeah! Thank you 😊 I really don't like travelling alone. I have travel anxiety 😓",
                                    "score": 1,
                                    "author": "SinfulSight"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Flixbus is just the platform. In theory they have standards, but in practice service and the state of buses varies between countries. \n\nGermany, Nethetlands and apparently UK has high standards. Italy is a bit different.\n\nOverall I like Flixbus a lot.",
            "score": 10,
            "author": "Marsandsirius",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup I took it in Italy overnight bus to Naples from Vicenza.  Was the most uncomfortable thing. Not doing that again.",
                    "score": 1,
                    "author": "moneydeep"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have only used Flixbus in Italy and Croatia. They were always late. Sometimes leaving late. Sometimes leaving at the right time but still having a delayed arrival.\n\nThey stop every 2-3 hours or so for bathroom breaks. Don't expect anything luxurious like plugs or toilet on board.\n\nThe legroom is not great, not terrible. If you are tall I would suggest an aisle seat. Some people also book seats so do expect that some might ask you to move if you sit in their seat. Most people don't though.\n\nI would advise on getting at the bus 20-30 mins before leaving. I don't know much about luggage fees, as I usually had backpacks. I do remember once in Croatia when the driver asked a person for extra money because he didn't pay for a huge luggage.",
            "score": 5,
            "author": "MRobertC"
        },
        {
            "level": 0,
            "comment": "Worst way of traveling. Once I had a 11h bus ride to Berlin (was supposed to be only 8h). We got stopped and searched by police twice, bus smelled horrible and at every stop you have to check that nobody takes your luggage. Never again",
            "score": 4,
            "author": "Friendly-Vegetable59",
            "replies": [
                {
                    "level": 1,
                    "comment": "At every stop? Oh my. I have 13 stops in the middle of the night. 🥴",
                    "score": 1,
                    "author": "SinfulSight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you don't want to risk getting robbed, you should check who is taking out which bags. I've seen people arrive at their destination, realizing their bags are gone in Megabus and greyhound in the US. I heard it happens also in flixbus. I personally have almost lost a bag that way and since then I hate busses even more than before.\n\nEven if people don't try to rob you, some are too stupid to realize they took the wrong bag.",
                            "score": 1,
                            "author": "Friendly-Vegetable59"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You'll be bound to have snoring ppl, crying ppl or babies. Ear plugs are a must have 😄",
            "score": 3,
            "author": "lecanar"
        },
        {
            "level": 0,
            "comment": "I think Flixbus is great and use them all the time, since they're often the cheapest option. The buses sometimes run a bit late if you're getting on at a midpoint stop, but that happens.\n\n&gt; Do you have bad experiences with lost suitcases\n\nThe luggage goes under the bus you're travelling on, you shouldn't be separated from it. Regardless, put airtags in your luggage.",
            "score": 3,
            "author": "UniversityEastern542"
        },
        {
            "level": 0,
            "comment": "I’ve travelled on FlixBus a bunch, including trips that sort of length/distance, never had a problem. That said, it’s 13 hours on a bus full of random people, makes for a very long day/night. Treat it like a long flight, bring snacks, plenty to keep yourself entertained and an eye mask/ear plugs/noise cancelling headphones for a nap/sleep.",
            "score": 2,
            "author": "HarvestWinter"
        },
        {
            "level": 0,
            "comment": "I've been having a good time with Flixbuses in northern europe. The longest I've done is about 7 hours. Trains are definitely nicer but the busses aren't too bad. Going to the bathroom sucks though. Also sometimes the power doesn't work so take a charged powerbank. In terms of delays I had one bus that left 30 minutes late because a passenger was arguing with the bus driver.",
            "score": 2,
            "author": "LittleJono"
        },
        {
            "level": 0,
            "comment": "Used Flixbus regularly when backpacking around Europe. I never had any issues with them. Plenty of long and short journeys.",
            "score": 2,
            "author": "andrewrcoulson"
        },
        {
            "level": 0,
            "comment": "Get a suitcase that doesn't look like the others. Don't bring a black one and be surprised when you realise someone accidentally took it because it was super dark and they didn't realise. Flixbus in Denmark is fine, only place I've used it though",
            "score": 2,
            "author": "ALemonyLemon",
            "replies": [
                {
                    "level": 1,
                    "comment": "underrated answer, it is probably getting ignored. People firmly believe you should get the most generic black bag that 98% has, but the black bag doesn't stand out. I see almost everyone with the same black hard shell carry on case, you can get them in any colour imaginable why must they get them in black only?\n\nI used to travel with Eurolines, because they were really cheap back in the day, or Megabus, Since Flixbus took over all the routes, low early bird prices were gone, so did the on board hostesses, local drivers and entertainment. edited for spelling",
                    "score": 1,
                    "author": "Harry-D-Hipster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol exactly! Mine is a bright blue with a tiny sticker on the back in case there's ever any doubt. Not once have I wished it was black like the rest.",
                            "score": 1,
                            "author": "ALemonyLemon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depending where you are travelling and the weather, dress lightly. Bring additional light layers that are easy to pack close to you and easy to mold into pillows or tuck away. \n\nIn my experience in the Mediterranean during peak summer, most buses were very hot and I regretted dressing \"comfy\" in cotton T and regular shorts. I would have preferred minimal breathable clothing that doesn't bunch, like workout clothes, and a light blanket or two for comfort and in case if the bus had chilly AC.\n\nAlso, timing. I remember one night climbing onto a bus at midnight in Italy and it was a full bus with sweltering hot, stale air. I had to climb over a sleeping person to sit down. Not sure how I possibly slept but woke up in a pool of my own sweat in the morning. If you book for a smart departure time you'd have a better chance at settling in.",
            "score": 1,
            "author": "JohnHowardBuff"
        },
        {
            "level": 0,
            "comment": "I lived in France/Germany many years ago and used Flixbus often! I’d travel up to 10 hours at one time. I never had a “bad” experience, but yes there are delays occasionally, sometimes an hour or more. Depending on the time of your travel, the bus driver may make a few longer stops where you can use a washroom and whatnot if I recall correctly. In terms of the actual bus— I can’t remember anything being too bad, the seats are OK enough, the washroom is tiny and usually icky. The wifi was so-so usually. \n\nI did travel with a large suitcase a few times and it was fine but obviously I’d advise to keep anything valuable with you in the seating area. \n\nI would recommend keeping your valuables such as your laptop/ phone in a personal bag near your feet if you plan to fall asleep. One time I was on an overnight flixbus and we made a stop in the middle of the night somewhere in Germany and many passengers were understandably asleep. Those of us who were awake did not realize it at the time but a random man had boarded the bus while it was stopped and quickly stole a passenger’s backpack/laptop/phone that she had left on the seat next to hers (she was asleep). It was traumatic for her and the bus driver couldn’t do anything about it once we realized what happened! So just be mindful.",
            "score": 1,
            "author": "Remarkable_Ride8159"
        },
        {
            "level": 0,
            "comment": "I like flixbus a lot, but never travelled with such luggage. But they are pretty good price and quality wise.",
            "score": 1,
            "author": "Unlikely_Panic_8920"
        },
        {
            "level": 0,
            "comment": "As others have said, quality varies with each country. I use sites like Bus Bud, Omio, Blablacar to find the quickest option for the best price. I find FlixBus is not always the best. \n\nTook an overnight Megabus from London to Paris, but they go on a ferry - plenty of room to roam or snooze on the ferry with free meal. It was way cheaper than FlixBus but it arrived an hour late so missed my prepaid train to Geneva. Luckily, no additional charge to get the next train. Some routes on train are about similar price as buses, depending on the time of the day.\n\nWill be taking an overnight bus from Copenhagen to Oslo next month. Vy Buss takes an hour less with no stops - probably for toilet and driver break, but no city stops for pick ups like FlixBus - cheaper, and more room, and option to sit in a single seat.",
            "score": 1,
            "author": "Peripatetic_Virgo"
        }
    ]
}