{
    "id": "145qiz3",
    "score": 2,
    "title": "Any tips for layover with 2 separate tickets?",
    "author": "SpicyBagholder",
    "date": 1686371671.0,
    "url": "https://www.reddit.com/r/solotravel/comments/145qiz3",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I just have carry on can I simply stay in the terminal and travel to the next gate I need on my 2nd separate ticket? Does it depend on the airport? Do some require you to fully leave the area and then enter through security?\n\nFirst time trying separate booked tickets and just doing it with carryon.",
    "comments": [
        {
            "level": 0,
            "comment": "You're getting differing answers. This is because it really depends on the specific airport set-up. I'd advise checking in advance on the airport website. Don't book any tight self-transfers until you've checked.",
            "score": 19,
            "author": "Numetshell"
        },
        {
            "level": 0,
            "comment": "Just watch out for the first airline insisting you meet the entry requirements of where *they* are flying you to.  i.e. what *you* see as a transit point, what *they* see as your destination.  If you need a visa for that country, they might insist you have it, even though you don't plan to pass immigration.  Lo Cost Carriers often treat every flight as point-to-point and won't take *your* onward plans into consideration when deciding if you meet the entry conditions of where they are flying you to.",
            "score": 8,
            "author": "WeAllWantToBeHappy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Latching on to this reply, If I don’t need a visa for the transit point, and the airport has airside connections, can I not go through immigration and stay in the terminal? Everything I have seen so far insists that I need to go through immigration regardless.",
                    "score": 1,
                    "author": "MovTheGopnik",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plenty of places allow transit without going through immigration.",
                            "score": 2,
                            "author": "WeAllWantToBeHappy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even with separate tickets?",
                                    "score": 1,
                                    "author": "MovTheGopnik",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So long as you have (or can get) the second boarding card.",
                                            "score": 2,
                                            "author": "WeAllWantToBeHappy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks!",
                                                    "score": 1,
                                                    "author": "MovTheGopnik"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We're going to need to know the airlines and airports involved to give a correct answer.",
            "score": 4,
            "author": "Cardchucker",
            "replies": [
                {
                    "level": 1,
                    "comment": "For this trip it's the Dublin airport. From all the replies, I see it really depends on the airport.",
                    "score": 1,
                    "author": "SpicyBagholder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Airport and whether you're switching between EU/International flights. Post again listing all 3 airports and you should get a better answer.",
                            "score": 1,
                            "author": "Cardchucker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every separate ticket journey I have taken required me to go back through security.",
            "score": 2,
            "author": "Scary-Perspective-57"
        },
        {
            "level": 0,
            "comment": "If they are two separate tickets, you’ll mostly likely need to clear security, and possible immigration",
            "score": 1,
            "author": "mij8907",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope. Not if you have your boarding pass and it's the same terminal",
                    "score": 4,
                    "author": "Jumpy_Possibility_70"
                },
                {
                    "level": 1,
                    "comment": "For most airports you dont.\nYou just follow the path for transfers like everyone else.\nYou pass most often the security for carryons again but so do all the other travellers who fly with 1 ticket.\nAt least in the bigger airports it doesnt make a difference.",
                    "score": 1,
                    "author": "binhpac"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No difference than transferring on the same ticket, except you need to get e boarding pass for the second flight, but even if you don't, many times the transfer counter of the airline inside the secured area can issue a paper one for you too,no need to go out and re enter. I do this all the time for over a decade already, many flights like this every year.",
            "score": 0,
            "author": "Jumpy_Possibility_70"
        },
        {
            "level": 0,
            "comment": "Depends on the airport. Did this recently at Manila. First ticket ORD-&gt;IST-&gt;MNL. Second ticket MNL-DPS. Had to clear immigration even though it was the same terminal. I’d recommend booking a longer layover in case the first flight is delayed. If you miss the second flight, it’s in you.",
            "score": 1,
            "author": "Imaginary_Engineer1"
        },
        {
            "level": 0,
            "comment": "It'll depend on a bunch of things. Knowing your route and nationality would be helpful. And airlines too (as maybe you'll be fine just getting an e-ticket/check in online and use an app). \n\nI think typically, as long as there are no visa restrictions on the layover and final destination (that officials at check in may need to check), and you have all your tickets and are checked in online in advance, then you should be fine just heading straight through to your next gate. \n\nIf there are visa restrictions, and you have to 'enter' that country and pass passport control. Or if its to the US, you have to go through passport control at your first entry point  (and collect and recheck bags, which is a huge pain when you have those), then it's more complicated and would need enough transit time for that. If you don't make the connection you wont be helped since its a new ticket and airline.",
            "score": 1,
            "author": "Organic_Armadillo_10"
        },
        {
            "level": 0,
            "comment": "Generally speaking, you will need to clear security again for your second flight. Doesn't matter if you're only carrying cabin baggage - both your tickets will be treated as separate journeys. \n\nIf both your airlines have an interline or codeshare agreement, you could speak to them and get a single PNR for a through check-in. It'll also help you in the event of delays or cancellations - the airline will then be compelled to offer you an alternate if your trip is on a single PNR.\n\nEDIT - A lot of argument about this in the follow ups, so let me clarify. I meant to say that you may possibly pass through a security check (bag and body scan only) between your arrival and departure gates, and did not mean to say that you will need to necessarily exit the terminal itself - that will depend on which airport you are using, as some have an airside transfer channel while others do not. As per other commenters, security checks might not be required at all at some airports they have frequently used. It’ll be helpful if the OP can either tell us which airport they are transiting through, or just check with the airport directly. Cheers.",
            "score": -3,
            "author": "lazycat1989",
            "replies": [
                {
                    "level": 1,
                    "comment": "Huh?  Why would you need to clear security twice?  If OP had only carryons and can stay on the sterile side of the airport from one plane to the next, why would they have to clear security again?  Maybe for an international flight, but OP didn’t specify. \n\nOP - in a lot of airports, you can travel between terminals without leaving the sterile (plane) side of security. This does depend on the airport and the specific terminals you’re talking about.",
                    "score": 1,
                    "author": "imjustsayin314",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where I'm from (India), you have to clear security even for domestic sterile transfers in the same terminal. There is a security protocol between the arrivals and departures gates. It's quite common across Asia, for that matter. Hence the advice.\n\nAs for why, its to rule out the carriage of any contraband items on to airplanes. OP may buy a bottle of alcohol and have half of it at airport 1, or they may buy cigarettes and a lighter, or a swiss knife or whatever. Airport 2 will have no way of knowing if OP is carrying an opened bottle of flammable liquid, an ignitor, or a sharp weapon onboard flight 2 without doing a security check during sterile transit. Its a security loophole waiting to be exploited otherwise. Most airports will not like to limit what they can sell - its a money spinner - so its just easier to enhance security instead.",
                            "score": 0,
                            "author": "lazycat1989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's only your country, not the rest of Asia. It's not illegal to bring cigarettes and lighter to the airplane. Where can anyone get contrabands like you mentioned from inside the secured areas of airports and the airplane?",
                                    "score": 1,
                                    "author": "Jumpy_Possibility_70",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its not illegal in India either, as long as theyve been purchased at the airport of origin and not in brought in from the city-side - security will confiscate it then. The discard trays are full of lighters and sharp objects here.",
                                            "score": 1,
                                            "author": "lazycat1989",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Then why are you worried passengers can obtain contrabands as well as totally legal items for the 2nd flight? Your comments made zero sense",
                                                    "score": 1,
                                                    "author": "Jumpy_Possibility_70",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Mate, I'm sorry if my travel experience is different than yours. I've always had to pass through security for domestic transit and I do that a lot over here (as well as in Thailand, Indo, Malaysia, and Nepal), and this is the explanation I've been given. I am not inclined to give contrary information simply because some things make 'zero sense' or do not align with what you have / have not experienced while travelling. We could call it peace and just let the OP clarify where they are travelling and let the one with that geography's travel experience take the lead.",
                                                            "score": 1,
                                                            "author": "lazycat1989",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I fly through KLIA 1 &amp; 2 all the time. The bag scan you have to do before the gates but after security, you'd have to do it anyway whether or not you go through security after check in or transiting from another gate of the same terminal. You're saving one big security where they do immigration when you transit directly. You're only going through the same final bag scan you would have to either way.\nI don't have a problem with your shared experience, just the rationale you're giving.",
                                                                    "score": 1,
                                                                    "author": "Jumpy_Possibility_70",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That’s effectively security, right? The same thing happens mid terminal in India instead of at the boarding gate. If your bags or your body scanner beep, you’ll be checked further. I wasn’t talking about immigration anyway.",
                                                                            "score": 1,
                                                                            "author": "lazycat1989",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "OP asks about fully leaving and reentering though. In this case, you don't need to leave or enter, you're just moving through the airport, sometimes through a bag scan, but not leaving the secured area. Even if you leave and re enter, you'd have to go through the same bag scan anyway, effectively scanning your bag twice. Directly transiting is possible and you'd only have to scan your bag once before the gate. Everything is still in the secured area. People are telling OP to clear immigration, leave, and clear immigration again, reenter. That's not necessary if everything is in the same terminal (many times depending on the airport different terminals are still inside the secured area, so you don't need to go through immigration and leave the secured area even. But airports like KLIA1&amp;2 definitely do require leaving to transit cross-terminals)",
                                                                                    "score": 1,
                                                                                    "author": "Jumpy_Possibility_70",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}