{
    "id": "147y3t9",
    "score": 4,
    "title": "First solo trip , a week in spain . Itinerary advice please",
    "author": "stunninglyanxious",
    "date": 1686605066.0,
    "url": "https://www.reddit.com/r/solotravel/comments/147y3t9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I will be travelling to Spain and would like some help with my Itinerary please .it will be my first solo trip as a 22 year old female . My budget is student friendly so I don’t want to spend more than £500 , i have already paid for flights and accommodation. I want it to be relaxing but i also love stunning scenery and nature / sea views so would prefer a mix of both . \nAt the minute my plan is \n\nDay 1 : early flight - relax and explore benalmadena \nDay 2 : beach day and a bit more exploring. Visit Plaza de España and the Church of Santo Domingo . \nDay 3 : Trip to fueringerola by ferry . Explore area and go to the beautiful beaches \nDay 4 : trip to malaga, Explore the Alcazaba fortress and picasso museum\nDay 5 : Trip to Nerja to see the caves and balcon de Europa .\nDay 6 : relaxing \nDay 7 : relax and Parque de la\nDay 8 : home \n\n\nIt looks quite empty at the minute and a bit too relaxed so would appreciate any recommendations . I don’t have any particular food places in mind but follow a halal diet so will most likely have the vegetarian option most places .",
    "comments": [
        {
            "level": 0,
            "comment": "If you’re going to Malaga I suggest checking out either Granada or Ronda. Both are great.",
            "score": 8,
            "author": "dnb_4eva",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second Granada. Absolutely breathtaking city and easily my favorite in Spain. \n\n Just be aware of your surroundings in the Albaicín (the historic neighborhood). Sometimes walking directions will take you through small alleyways and it's safer to stick in the main streets.",
                    "score": 4,
                    "author": "owlerprowler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I assume you're flying in and out of Malaga? \n\nIf you're looking mainly to relax at the beach, Nerja is great. But if you want to see more history or art, I'd do a day trip to either Granada or Cordoba. \n\nFor Granada, book your ticket to the Alhambra VERY early; if you're not able to get in to the Alhambra, I'd go with Cordoba instead. Cordoba is a bit smaller and (in my experience) much less touristy, especially when you get outside the few blocks around the Mezquita.",
            "score": 1,
            "author": "_CPR_"
        },
        {
            "level": 0,
            "comment": "You didn't say which Plaza de España and Church de Santo Domingo (in which town). Literally every small town in Spain has both.\n\nDay 1: skip Benalmádena beach. Is full of drunk Brits, Skandinaviens, Germans. Go instead the few stops towards Fuengirola. Get off at Carvajal. From there you have miles and miles of nice beaches towards Fuengirola. The closer you get to Fuengirola the more crowded with the same crowd as in Benalmádena. But the area around Carvajal is very relaxing. The small town of Fuengirola is lovely and has lots of small restaurants. \n\nDay 2: If your accommodation is in Benalmádena, hop on the bus to Mijas Pueblo. It's about half an hour up in the mountians. Very nice views.\n\nDay 3: hop on the train to Málaga. Walk around the old town and up the hill to the Alcazaba. Spent time at a café in the harbor. If you like walking, you can walk all the way to El Palo, there is a nice beach promenade from Málaga to El Palo. You probably will spent a second day in Malaga. \n\nDay in Nerja sounds good. You can book the bus ticket directly in the Alsa app (Alsa being the biggest bus company in Spain). \n\nYou could go to Granada but without a night there it would be pretty exhausting. \n\nYou could also spent a day in Marbella, the posh town of the Costa del Sol. There are frequent busses.",
            "score": 1,
            "author": "TomBerlin100"
        }
    ]
}