{
    "id": "148bfso",
    "score": 90,
    "title": "Is entering the US via Hawaii usually a more relaxed experience?",
    "author": "the-strangest-cat",
    "date": 1686649436.0,
    "url": "https://www.reddit.com/r/solotravel/comments/148bfso",
    "media_urls": [],
    "other_urls": [],
    "postText": "As an international traveller, have you found entering the US through Hawaii to be easier?\n\nI've entered the US through Hawaii and also the mainland; when I landed in Hawaii, it was extremely easy, it took almost no time to get through immigration, the officers were friendly and easygoing and didn't grill me or even seem that bothered.\n\nBut when I entered another time, through San Francisco, it took hours and I was basically interrogated, taken into a back room and had my bags searched, threatened and treated badly, to the point where I missed my connecting flight, and it's not an experience I ever want to have again as a solo female traveller.\n\nSo what I'm wondering is, was my first experience entering via Hawaii a fluke, or is it always like that?  I want to go back to the US soon, but I don't want a repeat of my bad experience.\n\nEdit - also, I'm not planning on or talking about actually spending time in Hawaii as a tourist, but rather using it as the entry point before flying to the mainland.  I know there are ethical issues surrounding tourism in Hawaii.",
    "comments": [
        {
            "level": 0,
            "comment": "I don't think this any rhyme or reason for it. I've driven to Montreal through Vermont and then came back on a rural road. I was the only car and they strip searched it for an hour. Nothing suspicious about me nothing found I don't know. Ive flown from Europe to Logan in Boston and went through the line lickety split, customs was courteous, kind and virtually just waved me through..\n\n\nGenerally entering from Europe I've never had any issue at Logan so who knows. I'm sure it depends on a lot of the character at the customs desk, the alert level, and of course you. Who knows but I don't think there's one rule for all",
            "score": 137,
            "author": "Different_Ad7655",
            "replies": [
                {
                    "level": 1,
                    "comment": "I 100% share these experiences. The people in Boston have to get thru tons of people, they wanna make it quick. At the rural border crossings in Vermont they've got time to kill...",
                    "score": 73,
                    "author": "bonanzapineapple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone should tell the staff at JFK",
                            "score": 33,
                            "author": "chickenparmo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My last customs experience at JFK was just a few weeks ago and it was super quick and painless, probably one of the easiest customs experiences I've ever had.\n\nI am a US citizen for reference.",
                                    "score": 5,
                                    "author": "cherokeemich",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I read that as pantless…",
                                            "score": 1,
                                            "author": "Thrillhol"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought it would be cool to check out Canada some time but everything I hear about the border crossing alone makes it sound not worth it. Like \"Oh yeah, they'll ask you a million questions, take apart your car, force you to unlock your phone so they can search it, and then deny you entry after all that despite not having found anything just because they think you're suspicious.\"\n\n\"Oh... coooool. Maybe I'll just order poutine at home.\"\n\nI suppose the people that have a hard time are gonna talk about it more than the people that had no problems but it still sounds ridiculous. If you had a nice time and want to refute this with your own experience feel free to chime in and let me know what you're favorite part of visiting Canada was.",
                            "score": 15,
                            "author": "Robobvious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live 10 mins from the Canadian border (as an American) and have crossed back and forth 5 or 6 times since the border reopened and have never spent more than 2 minutes at the crossing booth, both the US and Canadian customs have been extremely fast and chill. (Buffalo NY).",
                                    "score": 17,
                                    "author": "UB_cse"
                                },
                                {
                                    "level": 3,
                                    "comment": "As a Canadian, my worst border crossings have always been back home to Canada.",
                                    "score": 10,
                                    "author": "ferne96"
                                },
                                {
                                    "level": 3,
                                    "comment": "In Canada I was just waived through to go in and probably had I stuck to 89, the interstate coming back it would have been also relatively smooth. I had been wandering through Quebec. I live in New Hampshire, and have old roots in the Northeast Kingdom, Vermont, so I thought it would cross at Richford. As I came down the road and saw the fortified American border station with no cars I knew this was going to go swimmingly well and quick or down the toilet.. and down the toilet it went.. no sass or attitude on my part, but they were bored and really interrogated me in a way I was not pleased with..\n\n\nLater on visiting my friend in St Albans who owns apartments, I noticed that the asshole at the border was also one of her tenants.. Small world..\n\nNext time, I will stick to 89. I have a van these days though and I'm not sure if that also raises a red flag so I've hesitated to cross.. Maybe I'll just stick with international traveling to Europe it's so much easier",
                                    "score": 7,
                                    "author": "Different_Ad7655"
                                },
                                {
                                    "level": 3,
                                    "comment": "The Canadians are the aggressive ones",
                                    "score": 12,
                                    "author": "Old-Razzmatazz1553",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They have to be. Canada is so vast once you get into the country side, they can't find you if they wanted to, so it's important to vet the rime of entry.",
                                            "score": 9,
                                            "author": "GalacticaZero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Makes sense. America is way to lax at its borders compared to most other countries.",
                                                    "score": -5,
                                                    "author": "Old-Razzmatazz1553"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not in my situation but I'm sure it's who's on, and what mood they're in and so many other variables.. Canada'Just waved me in and said have a good time and when I left they simply said aurevois. Timing is probably everything and the luck of the draw",
                                            "score": 1,
                                            "author": "Different_Ad7655",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Really not the norm, many people get turned back by Canadian border patrol for simple criminal records like dui",
                                                    "score": 0,
                                                    "author": "Old-Razzmatazz1553",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Legally, a DUI is considered a serious crime in Canada.  You are not permitted to enter Canada with one.  So no border checkpoint, strict or lax, is going to let you enter with one.",
                                                            "score": 5,
                                                            "author": "birchesandbalsam",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Meanwhile you can enter America with a felony...",
                                                                    "score": 1,
                                                                    "author": "Old-Razzmatazz1553"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Unlock your phone and search inside?? Seriously??",
                                    "score": 2,
                                    "author": "OP90X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've crossed the border between Vermont and Quebec at least 7 times in the past 10 years. They might/probs will look in your car, they might ask 35 questions, but I think (unless you intentionally or unintentionally piss them off) they're not gonna actually open you're Trunk or touch your phone. Idk about Canadian border control, but the Americans really should have a warrant if they're going to be rummaging thru your stuff, right?",
                                            "score": 2,
                                            "author": "bonanzapineapple",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I went once and I’ll never go to Canada again. I was nice, they were “nice” but my car and phone completely searched. Then since they didn’t find anything they decided to do a cavity search on me. I was respectful the whole time. I did nothing suspicious and nothing was found on me. I was allowed to enter but I shortened my stay and left the next day because I was so disgusted.",
                                                    "score": 1,
                                                    "author": "LocalMexicoMan"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah from scrolling through youtube shorts I've seen a few clips of some Canadian border crossing show now where they do that shit. Whatever rights you had to privacy seem to end at the outside boundaries of the border crossing checkpoint.",
                                            "score": 1,
                                            "author": "Robobvious",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's fucking wiiild. Not that I have anything illegal to hide but, I got some personal stuff in there. And realistically, it would take you all day to come through my phone. Lots of cat pics, bad memes, embarrassing poetry, and off the wall search history, lol. Maybe that's what they are looking for as a good sign? If you have a fresh phone with nothing on it, it may seem sus? idk.",
                                                    "score": 1,
                                                    "author": "OP90X",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah same Idk how it works either. I assume either they could have a computer program that just searches through it for specific words or images, or they could be making a straight up copy of it and sending it off to the government. I have no clue it just sketches me out. No thanks! lol",
                                                            "score": 3,
                                                            "author": "Robobvious"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not that bad. Montréal is a great large city, Quebec City has a cutsie/European old town. I think it's worth the trip, but the 5-10 minutes to cross the border do spike my anxiety. **In the end I think it's worth it.** Unlike in the 90s, you do need either a passport (the $30 or $40 passport card works too, but it won't get you in anywhere outside North America) or Enhanced drivers license, which only a few states offer\n\n\nIn April I stopped further up than I was supposed to as I was entering Quebec and I told the guy I didn't know I was supposed to stop further back, and he just smiled and said there were signs (in English and French... I speak/read both). He gave me a bit of \"I'm sorry, but you really shouldn't have done that\" and then had me on my way into Canada!",
                                    "score": 1,
                                    "author": "bonanzapineapple",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Information regarding EDLs: \n\nEDL's are available in the following states:\n\nMichigan,\nMinnesota,\nNew York,\nVermont,\nWashington\n\nI got mine in NY... The website says it's $35 but with fees it comes out to more like $45.\n\nAlso, little known fact - if you have AAA (at least in NY), you can upgrade or renew your driver's license there.  Not many people know this, so it's quicker to get an appointment there. \n\nAlso, your Real &amp; Enhanced driver's licenses come in the mail in 2 weeks &amp; youre given a temporary paper license without your picture in the meantime that's valid for border crossings (if it's enhanced). \n\n*note* - and EDL, like a passport card,only allows international travel by land (car) or sea (boat) to Canada, Mexico, and the following Caribbean countries:\n\n Anguilla,\n Antigua and Barbuda,\n Aruba,\n Bahamas,\n Bermuda,\n British Virgin Islands,\n Caribbean Netherlands,\n Cayman Islands,\n Curaçao,\n Dominica,\n Dominican Republic,\n Grenada,\n Jamaica,\n Montserrat,\n Saint Kitts and Nevis,\n Saint Lucia,\n Saint Vincent and the Grenadines,\n Sint Maarten,\n Turks and Caicos Islands\n\nEdit: removed Mexico &amp; Canada from islands list, added commas, and this info:\n\nYou must be a AAA member to book an appointment at a AAA site.",
                                            "score": 1,
                                            "author": "x3sirenxsongx3"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I got interrogated for an hour and a half (at like midnight) at Logan, as a totally average looking white male. I slept all flight and was sooo sleepy, and the questions were so dumb. But yeah, I guess it is totally random. I still need to tattoo tango-37 on myself! That was the code the officer said into his radio before they escorted me to the back-room :D",
                    "score": 14,
                    "author": "nj_legion_ice_tea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm an older guy, I certainly darken the doorway with my frame and big beard for whatever that's worth if visual profiling is involved.., ..My flight coming back from Europe was right after my nasty nasty episode on the Canadian border where I was detained for that hour and they strip searched my car. It really put a damper in travel and something else happened along the way as well with US police that put a distinct disdain for unwarranted detention in my head . And of course this all in the aftermath and the climate of Donald..\n\nSo by the time I was coming back from Europe I was really ready for a third degree and a bit apprehensive.. The line was long, but it moved quickly and when I arrived at the custom agent, he just looked at me with a nice smile and said where have you been. And I said I've been to Germany Poland, family visit and touring, for a month and a half, and he said did you have a good time? And did you have anything to declare. And then with a big smile he said welcome home , Sir ,and I almost cried from the pent up anxiety.. It was the best welcome home I had ever heard..\n\n. I just traveled again and came back and equally flew through customs in Amsterdam and on the Boston side.. I was totally impressed.. But I think it's all about timing and chance of course",
                            "score": 8,
                            "author": "Different_Ad7655",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wait, you guys get stripped and shit as US citizens too? I thought they only did it to foreigners, I'm not from the US.",
                                    "score": 2,
                                    "author": "nj_legion_ice_tea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They did it to this dude. 70 year old guy, New England native.. I don't know what the hell they were thinking,  that I was some sort of a grandpa drug mule?.. who the hell knows.. It was pretty ugly and uncomfortable and lots of interrogation about myincome and intentionally try to trip me up on invasive questions regarding investments money etc that were none of their goddamn business. But at that time I was very respectfu,l because I understood my vulnerable position but relatively tight-lipped.. of course I had nothing to hide and nothing in the car or in my life to conceal.. But I did not need to write a book for them.. But I didn't know exactly what they were after.. It was unpleasant and has spooked me out of ever going across a rural border crossing again",
                                            "score": 8,
                                            "author": "Different_Ad7655"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree they have always been friendly and kind to me, but we r American citizens, we all don’t have this luxury",
                    "score": 1,
                    "author": "maxcooper69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my experience, as a US citizen, it has more to do with where I am coming from. I've been grilled by US customs, and had an easy time, at the same airport. But when I'm flying in from south/central America or the middle east, I think it's more likely I will be grilled. Just my experience.",
            "score": 62,
            "author": "TropicalWaterfall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always wonder what US citizens get asked by the people at the immigration desks when they re-enter the country, and if there is any actual gain from the practice. Like what are they going to do, not let you into your own country?",
                    "score": 20,
                    "author": "applteam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I've wondered the same, like my dude I am a citizen, what do you care if I haven't been on US soil for 2 years? I am still a citizen.",
                            "score": 18,
                            "author": "TropicalWaterfall",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're questioning you to see if you say anything suspicious or dumb. The question isn't whether they'll let you back into the country or not, it's whether they're going to send you to additional screening and rip apart your bags.",
                                    "score": 25,
                                    "author": "Bobtbob"
                                },
                                {
                                    "level": 3,
                                    "comment": "Some US citizens are being used as mules especially if they travel a lot between Mexico, Colombia, Peru or haven’t been to the U.S. for a long time. These are good red flags and they catch quiet a few people this way.",
                                    "score": 10,
                                    "author": "k1rushqa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nothing, i have Global Entry.",
                            "score": 10,
                            "author": "magnus91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "+1 for Global Entry. It massively reduces the amount of time and hassle of arriving in the US. I have been able to reach the exit within 15 minutes of stepping off the plane (albeit with no bags to reclaim, and nothing to declare), while standing in line at passport control would have alone taken easily over an hour. \n\nAnother benefit to Global Entry is that you can use TSA Precheck.",
                                    "score": 6,
                                    "author": "PacSan300",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How does one get Global Entry?",
                                            "score": 1,
                                            "author": "StrawberryKiss2559",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You fill out an application online, and then schedule an interview. Keep in mind, however, that this program is only for US citizens and green card holders. Also, you may find yourself scheduling an interview months ahead of time. However, the interview itself is pretty short and easy.\n\nHere is the site: https://www.cbp.gov/travel/trusted-traveler-programs/global-entry/how-apply",
                                                    "score": 2,
                                                    "author": "PacSan300"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In about 40 times through IAD with Global Entry, it's never taken more than 2 mins. \n\nHowever, I'm usually pretty quick off the people carrier",
                                            "score": 1,
                                            "author": "HelloJoeyJoeJoe"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Shhhhh don’t tell them",
                                    "score": 2,
                                    "author": "attention_pleas"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do people with global entry still have to talk to someone at the immigration desk but it’s just a shorter line? Or they just go straight thru with some sort of biometric reader? Or?",
                                    "score": 1,
                                    "author": "applteam",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have to say hi basically to someone. But that's about it.",
                                            "score": 7,
                                            "author": "magnus91"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have global entry and was still grilled coming back from Peru and Colombia. Just depends if the agent feels like being a dick to you or not",
                                            "score": 1,
                                            "author": "natod12"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They asked me why did I travel to Iran, who did I meet there, do I speak their language, what places did I visit, did I know someone before traveling there, what did I bring and what did I leave there and dozens of other questions I can’t remember but they all seem very basic and extremely annoying.",
                            "score": 5,
                            "author": "k1rushqa"
                        },
                        {
                            "level": 2,
                            "comment": "Just came back from costa rica for 2 weeks. Flew into Atlanta and the immigration officer asked me one question. “Do you have any fruits or vegetables”? “No” “welcome back”. That was it lol",
                            "score": 12,
                            "author": "Loollppi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah... when I came back from Japan I didn't even have to hand them my passport, they just asked me that? It felt weird. Do they have biometrics on us all now or something?",
                                    "score": 3,
                                    "author": "khuldrim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes… they do",
                                            "score": 5,
                                            "author": "livepepperoni"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I spent 9 months in Nicaragua and when I came back through Florida I got all my bags intensely searched and I was questioned about what I was doing in Nicaragua lol",
                            "score": 3,
                            "author": "sandraver"
                        },
                        {
                            "level": 2,
                            "comment": "It’s mostly to make sure you’re not smuggling drugs or money. They mostly ask me if I bought anything fancy abroad that I didn’t declare, any food, etc. \n\nWhen I studied abroad they asked me about long stays abroad. What I was doing. Why I had not returned to the Us in two years, Etc. \n\nWhen I came back from Korea to see my girlfriend they asked me if she was on the same plane with me, worried about her visa status (going in as a tourist instead of fiancée), she’s a US citizen and after that they were chill and let me pass.\n\nIf you’re truthful and your answers make sense it’s a seamless experience.",
                            "score": 3,
                            "author": "Yotsubato"
                        },
                        {
                            "level": 2,
                            "comment": "They asked me what I do for a living. I said I’m a student. Then asked me did I stay in a hotel? I said no Airbnb. Then he went - you travelled to Europe ALONE as a WOMAN and stayed in an AIRBNB?? Damn girl. And stamped me through",
                            "score": 3,
                            "author": "ilikebananabread",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol. What a complete and utter waste of resources, compared to doing what other developed countries do which is just e-gate automatic photo and passport scan and the gate opens! \n\nWhen I got transferred to the US for work for a few yrs, they would constantly ask me questions about where I went, where I lived, what I did, trying to catch me in a lie. One had the audacity to tell me I got paid too much… like yeah dude that’s the requirement by law :-/",
                                    "score": 2,
                                    "author": "applteam"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've had a harder time crossing Canada both by car and by air pretty consistently than I have coming back from China or Central America (including countries whose counter insurgents we train).",
                    "score": 6,
                    "author": "govt_surveillance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense. More illegal stuff comes thru Canada than China by a factor of ten",
                            "score": 3,
                            "author": "magnus91"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've been really surprised seeing many comments from US citizens saying you are also sometimes given a hard time.  I thought it would only be for international travellers.",
                    "score": 3,
                    "author": "the-strangest-cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It goes both ways unfortunately.  I get questioned more coming back to the US as a citizen than I do going through passport control when I go visit another country.",
                            "score": 3,
                            "author": "nydelite"
                        },
                        {
                            "level": 2,
                            "comment": "They want to stop smuggling of drugs and drug money, as well as the import of plants and foods that can carry insects and infection.\n\nAnd they want to stop \"terrorism,\" which means that any dark-skinned person will get extra scrutiny.",
                            "score": 1,
                            "author": "orange-orange-grape"
                        },
                        {
                            "level": 2,
                            "comment": "Same thing for me returning to Canada. They really want to catch you with drugs or a bunch of liquor/tobacco (both of which are a lot more expensive in Canada)",
                            "score": 1,
                            "author": "Wafflelisk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a US citizen, I got grilled at JFK coming back from Spain after being there only a week. It sucks to feel unwelcome after a long flight.",
                    "score": 4,
                    "author": "nydelite"
                },
                {
                    "level": 1,
                    "comment": "It’s really case by case. They once searched my car when I came back on my own from Canada (they tend to go after young, single men it seems), but they didn’t care at all at the ATL airport when I came back from Brazil with my fiancé. Another time coming back from Canada they didn’t care at all either. My brother, however, usually gets heavily questioned because he entered Mexico through Tijuana once.",
                    "score": 1,
                    "author": "jnoobs13"
                },
                {
                    "level": 1,
                    "comment": "The main difference is you're coming from a drug source country",
                    "score": 1,
                    "author": "Wafflelisk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been pulled aside while solo traveling as a female three times and interrogated over why I was traveling alone and if I was SURE I didn't have a travel partner. Happened at JFK, in Dublin and in SFO.",
            "score": 29,
            "author": "GiveMeCheesePendejo",
            "replies": [
                {
                    "level": 1,
                    "comment": "this happened to me in dublin, too. and they extremely aggressive about it.",
                    "score": 8,
                    "author": "raptorjaws",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting!  I was fine, but I had come for a conference and stayed for some music so maybe my answer mellowed them out?  Or maybe I'm not young/attractive enough to be on their worry list (see the other comment about sex trafficking / marriage fraud)",
                            "score": 2,
                            "author": "birchesandbalsam"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably to check for sex trafficking or immigration/marriage fraud",
                    "score": 9,
                    "author": "MissWatson"
                },
                {
                    "level": 1,
                    "comment": "So interesting, I've never even been asked about traveling alone at any immigration in any country I've been to (30+)",
                    "score": 6,
                    "author": "FlyingPandaBears",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happens all the time",
                            "score": 3,
                            "author": "Old-Razzmatazz1553"
                        },
                        {
                            "level": 2,
                            "comment": "I had this question at Newark a few years ago (I'm not American).",
                            "score": 1,
                            "author": "mapierror",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it maybe a US immigration thing for non-Americans? I've never gotten asked in European, African, or Latin American immigration either as an American. But very rarely do they ask me anything, I'm lucky if I get a \"hello\" in any language if anything. They rarely ever want to know anything about my trip, they just scan my passport, stamp it, and hand it back 🫠",
                                    "score": 1,
                                    "author": "FlyingPandaBears"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I entered us via Houston, using an ESTA and was questioned endlessly, and everything frisked. Later entered via Seattle with visa due to having been to  Iran. Immigrations officer wanted to know how that trip was and he felt sad that he couldn't go himself.",
            "score": 14,
            "author": "GeoGrrrl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm in Seattle and I like to think we're pretty chill. I don't travel internationally *that* often but I've never had an experience like what's being described and I've entered through SeaTac my whole life.",
                    "score": 3,
                    "author": "commanderquill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool! I was seriously worried about entering with an actual visa and having been to 'evil Iran', and it was the easiest US immigration ever. Now getting the visa was a completely different story.",
                            "score": 3,
                            "author": "GeoGrrrl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed. I've also gone through having been in Iran and nothing stands out. The border control on the Iran side was a bit of a different story though, haha.",
                                    "score": 1,
                                    "author": "commanderquill",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "LOL! For me, getting the visa for Iran was cool. I lived in Qatar, and apparently not many non-Iranians go to the embassy. When I picked up the ready visas the ambassador or konsul (not sure) came out and offered food and drinks and gave travel trips. He was just sooooo happy we wanted to visit his country. Getting into Iran was also quick. Now I always wanted to show that passport, with nearly every Middle Eastern country in it to Israelian border officials. But... would have been an expensive trip for nothing :D",
                                            "score": 1,
                                            "author": "GeoGrrrl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "God, it was such a worse experience here. I'm an Iranian citizen but I needed to get my passport. I don't speak Farsi so my mom was doing the paperwork for me. It took half a year before we finally got it, only for me to point out that the birthdate they put was older than my mom's, which went unnoticed I imagine due to the calendar conversion. So we had to repeat the process. We started a year and a half before we left for Iran and nearly didn't have passports in time for the trip. The Iranian embassy in DC is some tiny little thing tucked into I think(?) the Pakistani embassy (or another country nearby) and it is unspeakably incompetent.",
                                                    "score": 2,
                                                    "author": "commanderquill",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh no! That really sounds like a nightmare. &lt;hugs&gt;",
                                                            "score": 1,
                                                            "author": "GeoGrrrl"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your experience in San Francisco was not the norm. If I were you, I wouldn't draw any sweeping conclusions about Hawaii versus other ports of entry on the basis of such a small sample size.",
            "score": 109,
            "author": "lh123456789",
            "replies": [
                {
                    "level": 1,
                    "comment": "to be fair, I'm a US citizen with global entry and entering through SFO (as opposed to other US airports) is the only time I ever got grilled returning from an international flight. I don't even know what the point of asking questions like \"what was the purpose of your trip\" was - outside of inconceivably dumb answers like \"trafficking drugs back to the US\", it's not like they can deny me entry depending on whether I answer \"leisure\", \"business trip\" or whatever",
                    "score": 34,
                    "author": "lawfulkitten1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're trying to see if your answers are sketchy enough to warrant further questioning. (Plus profiling based on your country of origin/ethnicity). They can also use those basic answers to try and trip you up later, especially if you give an answer more specific than needed.",
                            "score": 21,
                            "author": "claude_the_shamrock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think to OP's point, the questions are a lot riskier for a foreign national than a citizen. If you're a citizen, they literally can't deny you entry... worst they can do is waste your time with secondary screening and bag searches (which is nothing beyond a time sink unless you actually *are* carrying contraband). \n\nWhen you're a foreign national crossing an international border, if they don't like your answers they can straight-up deny you entry and deport you (possibly with a stint in immigration detention first).",
                                    "score": 7,
                                    "author": "BD401"
                                },
                                {
                                    "level": 3,
                                    "comment": "True it’s really the best question to ask from their POV too. The onus is on them to start the conversation and assess if you should be granted entry or not. It’s not like they can immediately start accusing you of having an intent to breach your visa",
                                    "score": 4,
                                    "author": "Asleep_Cry_7482"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I travel on an Australian passport and I had flown into San Francisco from New Zealand, and the reason they took me aside was apparently based on my body language being \"irregular\".  I had just come off a twelve hour flight and had been standing upright in a line for two hours in a hot room in the middle of summer.\n\nWhen they took me away and had me in the back room, it was just myself and a very threatening guy, who kept suggesting my passport might be fake, questioning my real age, asking who was potentially \"forcing\" me to enter the US, going through my bags, making me relinquish my phone which he then took away with him, telling me I was going to end up in a lot of legal trouble for \"perjury\" because he could tell I was lying to him.\n\nLong story short, I wasn't lying to him, I was literally just there for a short trip, but that experience lasted for a few hours and was actually pretty demeaning.\n\nAnd I'll add, this was in 2019, I was travelling alone, and I'm a very shy/petite girl of zero perceivable threat, I think I was even wearing a dress with cartoon cats on it at the time.  I really have no idea what they were thinking or why they decided to pick on me that day.",
                            "score": 8,
                            "author": "the-strangest-cat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "American immigrations is just plainly full of assholes, and I say this as an American. I’m a petite Asian woman and every time I’ve reentered I’ve had rough experiences. On a land crossing from visiting Niagara, they pulled our car because they couldn’t wrap around the idea our mom didn’t have the same last name as me and my brother. And that’s how they treat Americans, can’t imagine how it feels being non-American and god forbid you look Hispanic or Middle Eastern or are black",
                                    "score": 8,
                                    "author": "corpusbotanica"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've always wondered about them asking things like employment verification and purpose of trip as a returning US citizen. I work in a very niche field of software, and it's hard enough getting my parents to understand what I do, but explaining it to CBP is not something I enjoy doing. \n\nOttawa's US/airside checkpoint at departure asked me specifics about what automation tools I use (I'm guessing he learned that as a buzzword once?). If I told them pornstar, how much verification are they gonna do to deny me entry?",
                            "score": 3,
                            "author": "govt_surveillance"
                        },
                        {
                            "level": 2,
                            "comment": "Back in the late 90s (I think) my family went on a trip to Hong Kong to visit our relatives out there. We are US citizens and live in the San Francisco Bay Area. When we got back to SFO, the customs agent was asking my dad what he did for work, what company and then asked him how we were going to get home. Like what freeways he was going to take. Bit odd to ask that kind of question. Our minds weren’t really there too since we just sat thru a 14 hr plane ride.",
                            "score": 2,
                            "author": "Mizouse84"
                        },
                        {
                            "level": 2,
                            "comment": "Again, one trip through SFO is a small sample size.",
                            "score": 5,
                            "author": "lh123456789"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol it sucks to enter the US anywhere in my experience",
            "score": 61,
            "author": "fyhf6yhj",
            "replies": [
                {
                    "level": 1,
                    "comment": "My brother in law (British-born, Persian father) says his best TSA strategy is going from London to Dublin to NYC rather than direct.\n\nYou can effectively cross the US border in Dublin airport before you board your flight. The TSA agents are nicer there and if something goes wrong you're only a 1hr flight from home. Much better than doing it after landing at a US airport.",
                    "score": 40,
                    "author": "elgrovetech",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;You can effectively cross the US border in Dublin airport before you board your flight. The TSA agents are nicer there\n\nYour advice is great, just to nitpick for accuracy, there's no TSA at Dublin. You go through US Customs and Border clearance there which happens after the usual security screening process by Dublin security just like everyone else.",
                            "score": 25,
                            "author": "CompassCoLo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why is it like this?",
                                    "score": 3,
                                    "author": "richard_slyfox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's called preclearance. It's available at most large airports in Canada as well.  US Border agents will interview you after security and before your flight.\n\nI personally haven't found it easier than entering by land, but if you get rejected at least you're in your own city and don't have to fly back. That's the main benefit I guess",
                                            "score": 4,
                                            "author": "Wafflelisk"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because Americans like to cosplay as Irish",
                                            "score": 8,
                                            "author": "chickenparmo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Toronto has this also.",
                                    "score": 2,
                                    "author": "Toxic_Asshole666"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are 15 locations that offer [preclearance](https://www.cbp.gov/node/362206/printable/print), very convenient.",
                            "score": 5,
                            "author": "hellothere285"
                        },
                        {
                            "level": 2,
                            "comment": "Based on other comments, this is definitely what I'm going to do in future.  I did go through this once before, flying Vancouver to Hawaii, as they also have the pre-departure clearance in Vancouver, and it was absolutely fine, easy, and quick. I'm happy to hear they have this in Dublin.",
                            "score": 3,
                            "author": "the-strangest-cat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is pre-departure US Customs clearance in all major airports in Canada, and they do tend to be nicer in my experience.",
                                    "score": 7,
                                    "author": "baby_catcher168"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The border patrol agent I spoke to in the booth was very nice and respectful, but the one working the baggage screening line was very grumpy, like she didn't want to be there at all.  So a mixed experience for me.",
                            "score": 2,
                            "author": "birchesandbalsam"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hello fellow Afghan",
                    "score": 3,
                    "author": "clitoral_obligations"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s random.. I sometimes get less moody officers and sometimes really annoying ones. I always enter through Chicago.",
            "score": 9,
            "author": "castaneom"
        },
        {
            "level": 0,
            "comment": "It's luck of the draw. I'm Canadian and cross frequently into the U.S. (and have entered through Hawaii a couple times). Your experience will ultimately come down to the officer processing you in. I've never found much of a pattern where one port of entry was guaranteed to be chill while another was a guaranteed grilling.\n\nIn general, I've actually found U.S. CBP to be professional and courteous - though I've definitely been grilled from time-to-time, usually when re-upping my TN visa for work.\n\nIf you're eligible and don't mind dropping fifty dollars, apply for NEXUS. Makes border crossings into the U.S. way faster and generally less stressful.",
            "score": 9,
            "author": "BD401"
        },
        {
            "level": 0,
            "comment": "As someone who’s done it, no. \n\nHawaii actually has more foreign visitors from Asia than domestic from the United States yet because there is only really 1 option for most flights, Honolulu (HNL), it’s one relatively old building that you have to use. Luckily there is a global entry line which makes it more tolerable but I’d enter via LAX 8/10 times unless I’m getting a free stopover in HNL.\n\nEdit: sorry, didn’t read the whole bad experience but I’ve had several encounters like that as well all over. Immigration is very strict and the slightest discrepancy or sign of increased anxiety and they will ask you questions until they are satisfied.",
            "score": 8,
            "author": "SomeAwesomeWaffles"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 48,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like Canada is worse now that there is records reciprocity. \n\nSome crimes that are low-level ticket-able offenses in the US will get you put back on a plane at the border.",
                    "score": 7,
                    "author": "Furrealyo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Generally depends more on timing, how busy the airport is, and who you get. Don't think it's a Hawaii vs mainland thing.",
            "score": 14,
            "author": "defroach84"
        },
        {
            "level": 0,
            "comment": "It's not a bad thing to come to Hawai'i at all. Just don't be a crappy person. Clean up after yourself, respect the land/wildlife and be nice to other people. It's great to come out, relax and have fun, but don't come here entitled expecting everyone here exists to serve you. We all have normal lives and jobs.",
            "score": 4,
            "author": "braddahman86"
        },
        {
            "level": 0,
            "comment": "No.  The time you were taken to a separate room and had your bags searched was a fluke.",
            "score": 4,
            "author": "ignorantwanderer"
        },
        {
            "level": 0,
            "comment": "NOOOO! I’ve gotten “random” strip searches both times I entered the US via Honolulu. Fuck that airport. Missed my connection and had to pay for a new connecting flight myself. Was coming from Sydney both times btw",
            "score": 4,
            "author": "TittiesInMyM0uth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh my goodness.  I'm so sorry to hear that!  Actually, I did just remember some weird and borderline inappropriate behaviour from someone who frisked me at Honolulu.  From all the comments it definitely sounds like one entry point isn't any better than another, bad experiences can still happen.",
                    "score": 3,
                    "author": "the-strangest-cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Obviously it’s purely anecdotal but yeah it was annoying and an overall bad experience. If I’m being totally honest the whole process felt like a shakedown instead of a process that’s supposed to keep people safe. I’ve entered the Schengen area probably 50 times in my life and have never gotten anything more than a nod from the customs officer.",
                            "score": 3,
                            "author": "TittiesInMyM0uth"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never been through Hawaii, but LA airports are notoriously tough.",
            "score": 3,
            "author": "12OriginalGlazed"
        },
        {
            "level": 0,
            "comment": "i'm a us citizen and have had mixed experiences at border control in several us airports, the worst being in baltimore with an honorable mention for chicago. it's pretty hit or miss in general, even with global entry.",
            "score": 3,
            "author": "raptorjaws"
        },
        {
            "level": 0,
            "comment": "Its all a crap shoot. Im in canada so connecting flights through the US is almost a guarentee when i fly anywhere and want to fly cheap. It all depends on whos working, how busy it is, what terminal you end up in, what the passengers are like, whats going on with flights those days etc. Ive flown through ALOT of airports in the US some multiple times, even the ones ive been to multiple times Ive had different experiences in. \n\nI would say in general, the airports i least look forward to are the ones in major cities around the north east like chicago, philidelphia, NY, etc. They tend to be crowded, airports are old, staff seem unhappy, etc, but ive also visted some of these airports where i had a good experience so.....i wouldnt plan your trip around it honestly, it could cost you more money with no guanrantee youll have a better experience.",
            "score": 2,
            "author": "oceansidedrive"
        },
        {
            "level": 0,
            "comment": "When I'm coming back, it's usually through Chicago and/or Atlanta.\n\nI have my complaints about immigration. Someone once told me that it's more about trying to make you feel uncomfortable or if you seem nervous/combative at all... they can investigate. Whether that be terrorism, drug smuggling, or whatever. It totally sucks because usually you're coming from a long flight and likely not in the mood.\n\nBecause of that... I usually just go through with this carefree attitude(I don't stress over it at all). If they're taking me back into a room, they're just wasting mine and their time. It is weird when going through... different agents treat that job so differently.",
            "score": 2,
            "author": "spid3rfly"
        },
        {
            "level": 0,
            "comment": "I went through JFK recently, was easy peasy even though I expected a more difficult experience due to my first name and the city I was born in. \nIn comparison, I was interrogated and put on hold for over 5 hours in Israel before I was allowed to enter the country.",
            "score": 2,
            "author": "mskinagirl"
        },
        {
            "level": 0,
            "comment": "I’m in my 30’s and a woman traveling alone most of the time. Sometimes have minor issues and sometimes it’s a breeze.  I always fly back through Orlando (MCO) and there have been times where it’s like 50 questions and a “I’ll be right back” and take my passport somewhere but other times where they just ask how my trip went and wave me on through. I do have to say, and I have no evidence other than my life flying through these airports and being stopped countless times, that where it says where I was born on my passport is probably causing the hold up. It starts at the check in counter where they take my passport somewhere to a back room and they have “check on something real quick.” , it’s never real quick and happens 9/10 times. Even though I’m a dual US/UK citizen with both official passports they still play trivia time with me when I come back home or go to Europe. \n\nMost recent experience was last year where I was flying back and forth for six months to England because my grandmother passed away and I had to handle her affairs and packing up her flat. They would ask questions trying to see if I’m going there for other reasons and then when I came back in one instance the customs officer asked why I keep coming and going so much so I told them my grandmother died and I had to go to the funeral and handle stuff and all I got was “….well, it is what it is. That’s life then you die.” Then handed me my passport and and waved me though saying, “welcome home”. \n\nOn the whole, it’s honestly luck of the draw who’s having a bad day, who just wants to make everybody miserable cause they’re on a power trip, and the few lovely angels who just want to make your day and not perform an interrogation.",
            "score": 2,
            "author": "playthreeagain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sorry you encountered such unsympathetic people.  I just find it so hard to wrap my mind around potentially not being allowed back into your own country.  I feel like that would be such an alarming experience, to be held up or questioned when trying to re-enter the place you're from.  I'm a dual Irish-Australian citizen and whenever I fly back to either Australia, New Zealand, the UK, Ireland... it's always just like nothing, they've never even asked questions.",
                    "score": 1,
                    "author": "the-strangest-cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I just find it so hard to wrap my mind around potentially not being allowed back into your own country\n\nThe absolute irony of saying this as an Australian which is the only country in recent history that has actually pulled such a maneuver. Something which is actually not allowed by US law so not a thing to be concerned about here.",
                            "score": 1,
                            "author": "MicroPCT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely not something I've ever experienced in Australia, nor would I have expected it to be a thing in the US or elsewhere.  Just reacting to things people have said about it in the comments, that's all. I don't know anything about it except my own experiences.",
                                    "score": 1,
                                    "author": "the-strangest-cat"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck yah. Each time I enter the US the border guards there are chill and nice unlike Canadian ones who tend to be jerks.",
            "score": 2,
            "author": "gyunit17"
        },
        {
            "level": 0,
            "comment": "Entering via Detroit was lax for me, no questions and am Global Entry. I was coming from Japan. \n\nI agree I think it matters what country you’re coming from.",
            "score": 2,
            "author": "prosperity4me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nobody suspects a Japanese tourist of crime or terrorism. You're pretty much the most welcomed and least feared nation on earth...save perhaps for China and Korea!",
                    "score": 1,
                    "author": "almopo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "China?",
                            "score": 1,
                            "author": "taurist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "History. WW2. Many Chinese hold a grudge against the Japanese due to the invasion and war crimes committed against them. It isn't helped by the fact that the Japanese see themselves as victims of the war, rather than the aggressors and perpetrators.",
                                    "score": 0,
                                    "author": "almopo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know if they relaxed the rules but Hawaii had a very strict covid protocol.  When you were in San Francisco where had you recently been?  My mom got interrogated for flying out of Chicago for her passport stamps.  She does work in a drug hot spot and we had just been to Europe and she didn't have a stamp for leaving Holland or something like that.",
            "score": 1,
            "author": "ninjette847",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hawaii is YOLO'ing it like every other place on Earth these days re: COVID. As a Canadian, I went in late 2021 and had to jump through all kinds of hoops (rapid antigen test prior to leaving for SFO, then a separate PCR test at SFO to be cleared to go to Hawaii, then had to fill out all the Safe Travels stuff with vaccine and test PDFs uploaded, all kinds of flight and accommodation details, got a QR code I had to show to not just the airline but also at check-in to my hotel etc. etc.).\n\nI visited again in August and November of last year and *all* that stuff was gone. The difference less than eight months made was night-and-day.",
                    "score": 1,
                    "author": "BD401",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My mom lives in Hawaii and they put in restrictions again because it shot up the most in the US after they stopped them.  I don't know if they're still in place.  They went to a wedding on the mainland and had to get tests maybe like 10 months ago.",
                            "score": 1,
                            "author": "ninjette847"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To my recollection I’ve never been held long-term returning to the US from abroad, but your post made me think instantly of that Expedition Happiness documentary. That couple did not have fun crossing our borders.",
            "score": 1,
            "author": "Apt_5"
        },
        {
            "level": 0,
            "comment": "Well…. Put it this way…. I haven’t had a bad experience coming in through Hawaii. But I’ve had a few coming into other entry points (along with lots of ok experiences at those places)\n\nAnd it’s a nice place to spend a day or two extra if that’s your cup of tea",
            "score": 1,
            "author": "applteam"
        },
        {
            "level": 0,
            "comment": "Any claims would be anecdotal",
            "score": 1,
            "author": "HappyHighwayman"
        },
        {
            "level": 0,
            "comment": "I’ve arrived at San Fran and it took hours as well. When I arrived via Honolulu there was zero wait and I was done within minutes. I would stick with it",
            "score": 1,
            "author": "howdoesthekittygo"
        },
        {
            "level": 0,
            "comment": "I had an easy time with TSA in Vancouver",
            "score": 1,
            "author": "Alyx-Kitsune"
        },
        {
            "level": 0,
            "comment": "My friend flies from New Zealand to California often and always stops in Hawaii because the immigration is easier for her.",
            "score": 1,
            "author": "hladinidasi"
        },
        {
            "level": 0,
            "comment": "Generally entering the US without a US passport kinda sucks. It's always nice to have the passport of the place you're going, but I think the us has the biggest discrepancy between citizens and non citizens.",
            "score": 1,
            "author": "yeahsureYnot"
        },
        {
            "level": 0,
            "comment": "&gt;I know there are ethical issues surrounding tourism in Hawaii.\n\nLike what?",
            "score": 1,
            "author": "Divadonuts",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.euronews.com/travel/2022/05/03/hawaiian-overtourism-residents-beg-tourists-to-stop-visiting-amid-post-pandemic-boom",
                    "score": -2,
                    "author": "the-strangest-cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tourism is Hawaii's biggest industry. They wouldn't survive without tourists.\n\nThe COVID scamdemic is over. Back to normal life",
                            "score": 1,
                            "author": "Divadonuts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Vacation in Hawaii it’s nice",
            "score": 1,
            "author": "TonightIsNotIt"
        },
        {
            "level": 0,
            "comment": "Less.",
            "score": 1,
            "author": "AnnieAlaska"
        },
        {
            "level": 0,
            "comment": "Nope I've had to stand in a huge queue then get an interrogation entering at honolulu",
            "score": 1,
            "author": "Puffpiece"
        },
        {
            "level": 0,
            "comment": "Hawaiian Airlines is the best airline I have ever flown with, and the Honolulu airport is beautiful 🌺",
            "score": 1,
            "author": "MickJohnLeahy"
        },
        {
            "level": 0,
            "comment": "Entirely depends on how busy the border post is. I have GE and normally there’s no lines for GE entry, except once landing from Japan at Honolulu where all GE machines but one were out of service and everyone going through GE line had to show their passport and talk the officer making it slower than the regular line.",
            "score": 1,
            "author": "nim_opet"
        },
        {
            "level": 0,
            "comment": "I have heard about problems in the honolulu entry.  So it’s probably not a guarantee on what you may experience in the future.",
            "score": 1,
            "author": "realmozzarella22"
        },
        {
            "level": 0,
            "comment": "Honestly, it depends on the agents working that day. I would say that your experience in San Francisco is mostly due to it being a major American hub. Try flying into smaller airports like Seattle (still a big city/airport but not San Fran big) or the biggest airports like Atlanta, Minneapolis and Denver. You might get a better experience there! Happy traveling!",
            "score": 1,
            "author": "adeadlydeception"
        },
        {
            "level": 0,
            "comment": "Why are there etichal issues surrounding tourism in Hawaii?",
            "score": 1,
            "author": "pgmach89"
        },
        {
            "level": 0,
            "comment": "Hi! I'm so curious where you coming from for it to make sense to go through Hawaii( I assume Oceania/Polynesia?), but I hope you have a better time coming to the US next time! I  am born and raised in NYC, and have travelled a lot nationally and internationally as a solo female traveler as well. I would say east coast people/ customs are already viewed as Ruder than west coast people, and tbh customs/border patrol kinds of proves it to be true ( but I swear outside of the airport were pretty nice :)). Ive also travelled via car  and train to Canada every year ( since I was a kid)to visit my cousins and generally speaking, the American side are a bit more \"hardcore\". I think it's the national security culture of the US, mixed with the culture of the area/ if you arriving in a hub city area, and if there are high alert international  issues happening.I only went to Hawaii once for a research class, but culturally it's it's on thing/occupied by the US, and environmentally/resource wise it's more low key. So I imagine that translates around security in the airport being consistently low key and you will have a less demeaning time going through the airport. But that was like 16 yrs ago at this point when I was there,  so I could be deeply misinformed. However, if you have to go out of your way to go to Hawaii to get to the mainland, I wouldn't think it would be worth it. Also, just re read your thread closely, truly sorry you had that experience. It sounds really awful and I hope that doesn't happen again.",
            "score": 1,
            "author": "ChocolateAgreeable15"
        },
        {
            "level": 0,
            "comment": "Compared to other international entries, yes. \n\nLAX is also relaxed\n\nChicago can be stressful, as is SFO and JFK  \nPhiladelphia is ok\n\nLas Vegas is one of the worst to enter, they all think you are hiding something even if you are a US citizen.",
            "score": 1,
            "author": "DoggtorEd"
        },
        {
            "level": 0,
            "comment": "I think it's much more difficult as it has more laws concerning produce in seeds not being allowed to enter the state from other countries. sometimes it takes a long time. check it out",
            "score": 1,
            "author": "SeabirdHawaii"
        },
        {
            "level": 0,
            "comment": "Yeah, Hawaii is a bit tedious at times. I bought Hawaiian Honey to bring home. The Hawaiian inspector took a long time going through everything and had the nerve to open me sealed bottle of honey and stick his nose in it. I was disgusted and frustrated 😠   it was a clearly packaged Hawaiian product.",
            "score": 1,
            "author": "denisebuttrey"
        },
        {
            "level": 0,
            "comment": "Haven't been to Hawaii, but it's inconsistent everywhere. I've had the worst time in Los Angeles - got pulled aside for secondary screening a couple of times coming back from east Asia.\n\nLast time I reentered the country was through Houston, coming back from Ecuador, and it was zero fuss. Long line, but no hassling.\n\nThey do look at other factors when selecting you for secondary screening. One time, I'd flown to Hong Kong and then returned via Bangkok (having caught a flight from Guangzhou to Bangkok after finishing my business in HK and China) and I was also carrying a big brick of adhesive rubber bumpers that probably looked suspicious. The Ecuador trip was purely vacation and didn't look as unusual.",
            "score": 1,
            "author": "madsci"
        },
        {
            "level": 0,
            "comment": "I had a really negative experience entering the US through the Manitoba - North Dakota border I did get through but it took many hours. \n\nI'm not trying to make an overall statement here, just adding my experience to the bucket.",
            "score": 1,
            "author": "ParkerScottch"
        },
        {
            "level": 0,
            "comment": "I got strip searched in Honolulu coming back from Thailand. This happened about 30 years ago and was a rather jarring experience. I was traveling with a backpack. Still…\nNow that I’m older, no one seems to pay attention to me anymore.",
            "score": 1,
            "author": "sanfranciscosadhu"
        },
        {
            "level": 0,
            "comment": "Hawaii is super chill about just about everything",
            "score": 1,
            "author": "mountednoble99"
        },
        {
            "level": 0,
            "comment": "It all depends on the mood of the agent you get in the airport on any given day.",
            "score": 1,
            "author": "oarmash"
        },
        {
            "level": 0,
            "comment": "Reposting this because it's for both the original question &amp; one of the responses:\n\nThere used to be racial profiling reasons after 9/11, but I know they kicked up a huge fuss. My dad is dark-skinned European with \"exotic\" features (not often seen in Caucasians), and he traveled nationally for work, so he would get \"randomly\"  pulled aside at random airports (large &amp; small) for searches. I'd say it happened 2 out of every 3 airplane trips he made. Things have changed since then. \n\nI've been to Hawaii a few times. As a US national arriving and leaving, I've found it to be a refreshingly relaxing experience, but I can't speak for the international division of their customs department. \n\nThe only non-chill exception was during the pandemic when they were *absolutely anal* about vaccination cards and you had to fill out information online at this certain website, show proof before boarding, and then they gave you a purple club entrance bracelet to show you'd been cleared to enter, otherwise the lines to enter the state at their airports were hours long. But no strip searches, etc.\n\nAlso, I cant speak for for the Canadian border patrol, but US border &amp; crossings  has been on high alert since the Trump presidency. So that's a fair warning on any experience you might have entering from any airport. Their job isn't to make you feel comfortable, but rather to make you feel uncomfortable so you talk yourself into a corner or spill information you might not have given otherwise  - pressure &amp; anxiety have a tendency to make people do that. \n\nJust keep your calm and make sure you have no contraband and you'll be fine, no matter where you enter. Can't guarantee your experience will be fantastic, but if you're mentally prepared it'll be okay. \n\nEdit: removed previous edit comment from my copy &amp; paste to this comment. *(facepalm)*",
            "score": 1,
            "author": "x3sirenxsongx3"
        },
        {
            "level": 0,
            "comment": "Last year early November I had the weirdest experience coming back from Japan to HNL (I’m a US citizen). I’m not familiar with the international side as it was my first time flying in to HNL from a foreign country, but typically I fly domestically from OAK or SFO to Hawaii and for Hawaii they always have you fill out an agricultural declaration form during the plane ride. I was flying with ZipAir and no one requested I fill one out and wasn’t even asked after landing. Also it was my first international trip since 2019 and if I recall they usually have you fill out a customs declaration form that you provide to the agents. No one asked me to fill out that or even verbally declare I had nothing to declare. The agent just asked me my purpose and where I came from and then said I can go.",
            "score": 0,
            "author": "Mizouse84"
        }
    ]
}