{
    "id": "148iroz",
    "score": 6,
    "title": "Train travel in India",
    "author": "scrandymurray",
    "date": 1686672104.0,
    "url": "https://www.reddit.com/r/solotravel/comments/148iroz",
    "media_urls": [],
    "other_urls": [],
    "postText": "From the post about India recently, I’ve got some questions about getting the train in India.\n\nIn around January/February, I’m planning to start my travels in Chennai, spend some time there, and then get the train to Pondicherry. It’s only 4 hours which seems pretty manageable. But I’ve got a few questions.\n\nHow early are reservations opened? I saw a lot of talk about making sure to book on as soon as they open to avoid general class. I feel as if I’d be fine with general class but I’m acutely aware that it’ll not be confortable, even for just a 4 hour journey.\n\nThe other questions I’ve got are about being in that region generally. How’s the weather? What’s the food to seek out? I’m a huge cricket fan and I believe England will be touring at that time, how do I get tickets if they do end up playing in Chennai? Any must go spots or things to avoid?\n\nThank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Ticket Reservations open up 4 months in advance. \n\nIdli &amp; Dosa is a staple South Indian Dish that you can try for breakfast. Surguru is an amazing place to try the same in Pondicherry\n\nApart from that Payyasam is one dish that I have heard of. \n\nIf you happen to visit Pondicherry do visit Delhiwalla too for food",
            "score": 3,
            "author": "HaHaJo2301",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, will be sure to check those out.",
                    "score": 1,
                    "author": "scrandymurray"
                },
                {
                    "level": 1,
                    "comment": "Don't they open for like an entire year in advance on foreign tourist quota? Not sure as I don't use FTQ even as a tourist.",
                    "score": 1,
                    "author": "Remote_Echidna_8157"
                }
            ]
        },
        {
            "level": 0,
            "comment": " Try to book in Ac class . Don't know if you can book through irctc .",
            "score": 1,
            "author": "Own-Ring4143",
            "replies": [
                {
                    "level": 1,
                    "comment": "i just did this--bus is super easy and fast...weather is great, nice and hot--and the food! amazing...",
                    "score": 1,
                    "author": "kochikal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For daytime travel I've found that it was easy to get tickets even last moment and general class is fine for that. There's fans on the ceiling and windows are open. Most time I would be almost alone on the bench, and every time people would strike a conversation with me and give me recommendations of places to see/eat in the city.\n\nFor overnight it's better to get 2AC at least if possible and these are harder to book last minute but you can try the taktal system, extras tickets that open up at 10am 1 day before the train leaves from it's starting station.",
            "score": 1,
            "author": "ayamflow"
        },
        {
            "level": 0,
            "comment": "[https://www.seat61.com/India.htm](https://www.seat61.com/India.htm)",
            "score": 1,
            "author": "Appropriate_Volume"
        },
        {
            "level": 0,
            "comment": "There is atleast one bus every hour if not half an hour every day from Chennai to Pondicherry.\n\nDont book the train, go to the chennai bus stand and board a random AC bus. The drive through ECR(east coast road) is a good one.\n\nTill mid of January is the best weather than any other time. Depending on your interest you could visit some classical music concerts during that time, but this is a niche and not the usual foreign touristy thing to do.\n\nGo to the zoo see crocs, the snake park, the beaches, the temples there are a lot of things to see in chennai",
            "score": 1,
            "author": "WalrusMadarchod"
        }
    ]
}