{
    "id": "148ol43",
    "score": 42,
    "title": "Solo travel to Greece as a gay man",
    "author": "Me_ButTaylorsVersion",
    "date": 1686687535.0,
    "url": "https://www.reddit.com/r/solotravel/comments/148ol43",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I’m a 24yo man from Norway travelling alone for the first time. I’m staying on vacation in Parga-greece for two weeks, I have been here before as a child eith my parents, but now I am returning as a young man who happens to be gay, which could maybe make travelling to certain places harder(?)\n\nWhat I’m wondering is how I can make this  a safe vacation for me, maybe you don’t know the town, but does any of you know how it is travelling to and staying alone in Greece as a queer person? Do I need to avoid doing/saying anything or am I free to just be myself?\n\nAll in all, how is it like being/coming out as queer in greece?\n\nAlso if you do know Parga and know of any lgbtq+ friendly spots/places nearby that would also be great!\n\nI know I’m asking alot, but I just wanna feel safe on my vacation :)\n\nAlso: any general tips for travelling/vacating alone would be much appreciated! And feel free to ask questions!\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "OP appears to have requested personal experiences from (women/people of color/LGBTQ+ travelers). If you are not a member of the requested demographic, please carefully consider whether your post will add value to the conversation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You have nothing to worry about.",
            "score": 109,
            "author": "TravelerMSY"
        },
        {
            "level": 0,
            "comment": "Haven't you heard? The Greeks invented gayness, you'll be fine.",
            "score": 137,
            "author": "Rustin_Cohle95",
            "replies": [
                {
                    "level": 1,
                    "comment": "The greeks invented the threesome, the Romans found out you can add women.",
                    "score": 96,
                    "author": "MrBuckstar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "arabs found out you can make harem",
                            "score": 7,
                            "author": "FrodoTheSlayer637",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Turks not Arabs",
                                    "score": 4,
                                    "author": "BessYaBa7ar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "😂😂😂😂",
                            "score": 2,
                            "author": "ChronicallyFazed"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m so glad they did🤩",
                    "score": 15,
                    "author": "Me_ButTaylorsVersion"
                },
                {
                    "level": 1,
                    "comment": "It's not the Greeks, it's the Chinese he's after.",
                    "score": 2,
                    "author": "MoHataMo_Gheansai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not after the Chinese!",
                            "score": 1,
                            "author": "DannyBrownsDoritos"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "FECKIN GREEKS",
                    "score": 1,
                    "author": "DannyBrownsDoritos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hasn’t Greece been the gayest place since the Trojan War?",
            "score": 29,
            "author": "Rancho-unicorno"
        },
        {
            "level": 0,
            "comment": "Anyways, I felt pretty safe as a queer person in Athens and even more so on the islands (There's famously gay beaches and such on some of them). I'd put it on par with most western cities, so generally okay but you can run into situations where it's not.",
            "score": 91,
            "author": "RainahReddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anyways, wow.  Thanks for answering his question, and I hope this thread is nicer than the last.",
                    "score": 12,
                    "author": "Nnkash"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don't have anything to worry about, I went to Parga last year, beautiful town with amazing beaches. I recommend going to the Acheron river and Mike's bar for happy hour to watch the sunset. Only thing you have to worry about is the steps in town, they really took it out of me towards the end 😂 have fun! 🇬🇷🇬🇷🇬🇷",
            "score": 15,
            "author": "WarLordDobby",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! And also thank you for actaully answering my questions and not attacking and questioning queer people like some of the other people here are❤️",
                    "score": 12,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welcome! I don't have any specific LGBTQ+ spots I'm afraid, the Greeks are extremely welcoming and kind people, at least from my experience in touristy areas :)",
                            "score": 4,
                            "author": "WarLordDobby"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have not been to Pargas but have been to Thessaloniki, Crete, and Corfu. Thessaloniki had a bigger queer community, but the islands were safe too. I think Greece as a whole is pretty on par with most of western/central Europe, where I live and can compare it to.",
            "score": 27,
            "author": "TheWaywardTrout",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I feel safer now!",
                    "score": 4,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure! Have fun!",
                            "score": 3,
                            "author": "TheWaywardTrout"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here's  a Norwegian gay tavel guide. You can find other pages that do the same if you look it up, I didn't check if it had your location. This site can give you some tips about what you want to do. \n\nOtherwise, always have emergency numbers written down. You want those for the country you're visiting,  your insurance company, and your emergency contact (parents,  partner, etc.). Keep a spare debit/credit card somewhere safe (thieves are everywhere, no matter where you go).\n\nYou'll be fine. Have a fun vacation!\n\nhttps://no.travelgay.com/",
            "score": 8,
            "author": "Hiworlditsmeagain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 5,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome!",
                            "score": 2,
                            "author": "Hiworlditsmeagain"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a tourist you will be fine.",
            "score": 7,
            "author": "groucho74"
        },
        {
            "level": 0,
            "comment": "The gay community on Mykonos was very welcoming when I went, and the beach clubs were super fun. I'm a straight female but had a blast!",
            "score": 33,
            "author": "life_line77",
            "replies": [
                {
                    "level": 1,
                    "comment": "I rented an ATV on Mykonos and was driving around the inner island. I ended up at a nude beach and figured - why not? - and decided to try skinny dipping for the first time. \n\nIt was only after being naked in the water that I noticed it was all guys, and the beach bar had rainbow flags. It was a gay nude beach! The weather was great and the water felt perfect, so i ended up staying there for a few hours. Nobody bothered me and I enjoyed it, despite being a straight American guy.",
                    "score": 20,
                    "author": "BrazenBull",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "By the rules of 80s bullies you are now gay.",
                            "score": 20,
                            "author": "808hammerhead"
                        },
                        {
                            "level": 2,
                            "comment": "Amazing! Love this for you",
                            "score": 8,
                            "author": "Me_ButTaylorsVersion"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Historically speaking, you're going to do fine",
            "score": 18,
            "author": "oldbailey_newbird"
        },
        {
            "level": 0,
            "comment": "I actually met a gay guy in my hostel and we had been travel buddies for a bit. We were in Athens and I can promise you no one gave a fuck and we never got any funny looks or anything. I can speak for Athens at least and i definitely get a very liberal vibe from the city.",
            "score": 3,
            "author": "ADHDkid707"
        },
        {
            "level": 0,
            "comment": "Went to Athens, the Cyclades, and the Dodecanese in with my bf. Not even the slightest issue anywhere we went. Hell, we even stayed at an airbnb with one bed in a small village on Aegina, and the hosts were nothing but friendly.",
            "score": 3,
            "author": "mrrow1113",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amazing!",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We’ve been to Athens, Mikonos and Santorini- all places were super chill and very welcoming to the 🏳️‍🌈 LGBT community.",
            "score": 3,
            "author": "hinterstoisser",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wonderful!",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cis white man here.\n\nJust got back from Athens. It was gay pride there last weekend and very much similar to my home town's pride festival (Manchester). Also went to a pride party in a restaurant that openly hung rainbow flags outside it.\n\nCouple of my friends who are gay were openly holding hands and being affectionate in public and didn't get any bother.\n\nI cannot for certain say you will be safe, but they felt comfortable to be out there. I have been to other countries with them where they haven't.",
            "score": 15,
            "author": "rhyswynne",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so glad to hear this!! Sounds like I could be as safe in Greece as in Norway😊",
                    "score": 3,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought Greece was gay Mecca. You should be grand.",
            "score": 2,
            "author": "JumpinJackFlashlight"
        },
        {
            "level": 0,
            "comment": "If it makes it more comfortable for you I would approach it playing your cards tight to your chest. When you get their start feeling it out and if it seems safe then be yourself for sure do that. You can adjust how you present yourself accordingly that way at least if a place is hostile your trip isn’t ruined becuase your in fear.",
            "score": 2,
            "author": "jdmfreak1992",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not lqbtq+ but spent 9 months locked down in geeece for Covid as a solo traveler. My only advice is don’t keep ur wallet or phone in ur pockets. Keep them in a purse or Phanny pack or back pack or something.",
            "score": 2,
            "author": "Capt_morgan72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a queer woman I've come to learn Reddit's demographic is too cishet for this question. I've come to prefer checking out gay travel blogs/sites, reading up on the travel.state.gov info for each country, and LGBT travel vloggers lol \n\nit's sad how people just can't let us chill either home or abroad",
            "score": 6,
            "author": "IniMiney",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah.. I just realised this just through this thread. I’m thankful to everyone who has defended my questions, but it’s sad to see all the people who don’t understand. I hope you’re having a great day!",
                    "score": 2,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are traveling alone how will people even know?",
            "score": 12,
            "author": "GlumConstruction609",
            "replies": [
                {
                    "level": 1,
                    "comment": "Much anti-queer harassment has very little to do with who the target is attracted to, but  more to do with gender expression and how well (or not) someone fits within a culture's gender role norms.",
                    "score": 72,
                    "author": "infiniteglass00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -42,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't speak to his specific experience, but people try to clock people as being gay based on their voices, mannerisms, and great deal of physical signifiers all the time. It's not even a matter of people \"knowing,\" it can also be a matter of people perceiving it as such for things potentially beyond his control.\n\nDo you really think kids in elementary school get teased for \"being gay\" (whether or not they actually are) because they all have long-term queer partners lmao",
                                    "score": 32,
                                    "author": "infiniteglass00",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that proves my point, if straight kids are being misidentified as gay then maybe physical indicators aren’t so accurate.\n\nI guess there’s just a distinction between being gay and queer. But if it’s about how you act in public and not who you are attracted to, is the discrimination really about you being gay or that the people just don’t like overt flamboyance.",
                                            "score": -25,
                                            "author": "GlumConstruction609"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because it's fucking exhausting to have to constantly censor yourself in every little conversation so you don't accidentally let something slip. I am queer. It is perhaps not a huge part of my life, but something that permeates every part of my life.",
                                    "score": 44,
                                    "author": "RainahReddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Have you never communicated with someone and based off their mannerisms and tone of voice got the idea they were queer?? I’m a straight male and I have have been asked if I was queer due to some feminine mannerisms. Have you never had a queer friend to learn from? Or a metro friend who exhibited such mannerisms? It’s not hard to understand.",
                                                    "score": 16,
                                                    "author": "invertebrate-jelly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I know people with metro/queer qualities but I won’t assume gay until I ask or if they are superrrr over the top",
                                                            "score": -10,
                                                            "author": "GlumConstruction609",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Since when was it not ok to simply make assumptions based on someone’s behavior. Making an assumption is not the same thing as discriminating. Being deductive of someone’s characteristics in your own mind is not the same thing as discriminating. \n\nI’m sure you mean to be polite by trying not to assume queer but to me it just sounds like walking on eggshells that resulted in your misunderstanding of how things simply may be in OP’s situation.\n\nEdit: can’t spell when I’m frying up in that oil",
                                                                    "score": 3,
                                                                    "author": "invertebrate-jelly",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I didn’t say you can’t make assumptions on behavior, especially on other traits. I just feel like I’ve met people who I’m suspicious are gay but I think my lifetime guessing accuracy is like 60% so I don’t assume gay until it’s confirmed. Being suspicious is different from assuming",
                                                                            "score": 2,
                                                                            "author": "GlumConstruction609",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I appreciate the difference between suspicion and assumption that you’ve mentioned. The issue is that your fair suspicion could be someone else’s assumption possibly accompanied with some negative attitude. It’s fair for anyone in the LGBTQIA’s+ community to ask if the ladder situation could be a likely case when they’re not familiar with the culture.",
                                                                                    "score": 2,
                                                                                    "author": "invertebrate-jelly"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&amp;#x200B;\n\n&gt;If you really have to be constantly censoring yourself to be able to get through a conversation without revealing you are queer\n\nI'm a female solo traveler who also happens to be a lesbian and I get asked all the time by strangers abroad if I have a boyfriend or husband, and whichever country or province/state I'm in depends on rather or not I can tell the truth or lie about myself, meanwhile straight people don't ever have to consider that. You're making it seem as if OP or other gay men just go around waving a pride flag saying \"hahaha look at me, I suck d\\*\\*\\*!\", meanwhile OP probably just wants to know if it's safe to mention he has a boyfriend to anyone who befriends him there. It's almost as if you're purposefully misinterpreting the point of this post.\n\n&gt;I think a lot of people just get exhausted with the constant in your face queerness, and very few are getting annoyed at what’s happening in a private bedroom.\n\nAnd a lot of people, like OP, are exhausted with having to research and make sure that certain countries are safe for them and their sexual orientation. But yes, go right ahead and tell us about how you're sick of hearing people talking about being gay. That's such a great contribution to make in this thread...",
                                                    "score": 18,
                                                    "author": "biscuitwithjelly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This. I just want to know if I have to make up lies about my life or if i can say \"yeah i live with a partner\" and let the conversation move on.\n\nI'm not worried about making a big deal about being queer. I'm worried about the other guy making a huge deal about it. I'd really rather not",
                                                            "score": 12,
                                                            "author": "RainahReddit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, you're good! You were doing what you were supposed to do. This subreddit has an advisory against people contributing to discussions they have no experience in and that guy was just a moron. I'm sorry about him, and I hope you have a great trip.",
                                                                    "score": 3,
                                                                    "author": "biscuitwithjelly"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "STFU, you have no idea what they are talking about, so stop. It is as simple as referring to your spouse, S/O, or even the way you speak. Until you have had to police everything about yourself so people don’t kill you, beat the shit out of you, fire you, and so on into eternity, keep your lack of knowledge behind your teeth.",
                                                    "score": 14,
                                                    "author": "weeburdies",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You guys are walking around acting like if anyone finds out you like guys they are gonna behead you, and it’s not the case. Most people don’t care about other people’s private lives, as long as they keep it private. You can’t just go to a country and expect them to be as progressive as San Francisco. It’s their country and you are a visitor. If you want to go be obnoxiously gay in a country that’s anti-LGBT, pick a different country.\n\nRespecting customs is part of being a tourist. If I’m on a train in Japan, I’m going to speak more quietly and use more respectful language than I would on a train in Philly. Im not gonna complain about not being able to be myself, because I’m grateful to be there and respectful that they have their own customs and are a more reserved culture.\n\nIt’s unfair that they might be bigoted against you, but noone is forcing you to go and being granted a visa is a privilege that alot of entitled tourists take advantage of",
                                                            "score": -14,
                                                            "author": "GlumConstruction609",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So painfully stupid. The false equivalency of equating being gay (an inherent part of someone) to being quiet on a train lol really? Gay people have reasons to question their safety. Why should anyone listen to you on the topic when you clearly know nothing about it",
                                                                    "score": 7,
                                                                    "author": "chitownsparty12",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": -7,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Do you know once I was walking along a street carrying my groceries home and a car drove past me, called me a f*g and threw a McFlurry cup out the window. \n\nI still to this day have no idea what I did. I was just walking. I can’t really hide who I am obviously.",
                                                                                    "score": 5,
                                                                                    "author": "Kkcardz"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "K, as I said, keep your lack of knowledge behind your teeth. Perhaps you have none. We will be beheaded, or worse, if the hate-filled mindset you espouse continues to grow: https://thehill.com/blogs/blog-briefing-room/news/3898187-hate-crimes-up-by-double-digits-last-year-fbi/amp/",
                                                                    "score": 6,
                                                                    "author": "weeburdies",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What do you mean beheaded? Maybe in some extreme country like Saudi Arabia, definitely not in Greece",
                                                                            "score": 2,
                                                                            "author": "9Athelas7"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You are assuming every hate crime is just someone mentions they are gay then gets attacked, which is not the case. Assimilating and not attracting attention is an extremely effective way to avoid conflict, regardless of orientation",
                                                                            "score": -4,
                                                                            "author": "GlumConstruction609"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://thehill.com/blogs/blog-briefing-room/news/3898187-hate-crimes-up-by-double-digits-last-year-fbi/](https://thehill.com/blogs/blog-briefing-room/news/3898187-hate-crimes-up-by-double-digits-last-year-fbi/)**\n\n*****\n\n ^(I'm a bot | )[^(Why &amp; About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                                                                            "score": -1,
                                                                            "author": "AmputatorBot"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": -15,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not everyone is \"straight passing\" - before I finally came out of the closet I used to get all sorts of speculation out of people (albeit my journey differs in that I came out as trans), you'd be surprised how much shit a heteronormative society obsesses over in the most toxic of ways\n\nNowadays I struggle more with people assuming I'm straight instead of lesbian (the femme struggle is real) but I still have a fear of my masculine face clocking me as trans in a dangerous area/country",
                    "score": 5,
                    "author": "IniMiney"
                },
                {
                    "level": 1,
                    "comment": "Cause I don’t want to hide who I am. Being queer can mean not adhering to the heteronarmative standards which can mean dressing certain ways, it can mean flirting with the opposiye gender or some people might even look for hooking up with people. It can mean buying things that could challange the way people think about you.\nOther than these, some of us have a natural way of being that could also reveal our identity. These are just some examples of how people would know, and it would be unfair to not be able to just be oneself fully, but unfortunately that’s dangerous in some countries, so I guess that’s why I am asking all of these questions 😊",
                    "score": 59,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's good that you mention these more specific questions. Disclaimer, I'm not gay so I don't know how quickly things  go sour if someone hates you. As others have commented, GR is very oriented towards tourism from northern Europe, so if they chased away gay white men they would have been out of business. That being said, in a smaller town like Parga there will definitely be people negatively predisposed. In big cities they exist as well, but it would be hard to find a space where their negativity will go uncontested. \n\nSo in a small town, if you wear make up or a skirt and try to enter a local cafe, it's very possible that the manager will tell you it's all booked, or maybe they will be itching for an excuse to argue. Use your gut feeling. If someone is driving a farmer's truck, if a priest or monk is sitting in a table, if it's a huge group of men only sitting together, these are indications of not very progressive people. Additional attention when you flirt with people. \n\nAs a general idea I think in Greece you don't have to be careful before the fact, but be prepared to back down if the tension does come. The bystanders or police might not be eager to help you if a local accuses you of starting the fight.",
                            "score": 6,
                            "author": "Mediocre-Yoghurt-138",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 1,
                                    "author": "Me_ButTaylorsVersion"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m a straight/cis guy and I would change how I’d plan to dress during travel based on the country/region I’m going to. I’m not gonna wear the same clothing to a European Beach Town as I would a City in The Middle East, because I know there are different values there, and when I’m visiting another country I try to assimilate, as I am being given a privilege even being allowed to be there.\n\nIn my perfect world, you could be yourself anywhere on the planet, but it’s also not unreasonable to change how you dress/present yourself when you are in an area with different cultural standards, even if you believe they are bigoted.",
                            "score": 13,
                            "author": "GlumConstruction609",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, so that's precisely why OP is asking the question - what's the culture/openness in Greece where he wants to travel, wrt being openly queer.",
                                    "score": 69,
                                    "author": "anoeba"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a plethora of reasons why LGBTIQA+ people can't or don't want to just closet themselves for travel.",
                    "score": 20,
                    "author": "calmgonemissing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it really closeting yourself to just wear non descript clothes? He’s just gay, it’s not like he has different biological physical features, any dude can throw on a polo and cargo shorts and blend in anywhere",
                            "score": -10,
                            "author": "GlumConstruction609",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ever walked down the street and seen a gorgeous, stunning, attractive woman? Do you think no one looking at you would have been able to tell you saw someone you thought attractive?\n\nGay friends and colleagues deal with street harassment or even violence when they are alone, in shirts and cargo shorts, or in office wear, not looking at people, just on the way to work or home. Men I wouldn't have known were gay until they told me deal with this. \n\nIt isn't as easy to hide as you think, even if you want to or if you are already just happy wearing the 'blend in' clothes. If you are not with a partner, not looking at the gorgeous greek men. If you are being careful about how you walk, move, talk, what you say etc. \n\nVisiting a country where you have to adjust for safety is a choice. It may be easy, it may be hard. And part of finding out about potential safety concerns can be asking people with experience in the region, which is what OP was doing.",
                                    "score": 6,
                                    "author": "calmgonemissing"
                                },
                                {
                                    "level": 3,
                                    "comment": "Changing the way you behave and dress so that people don't realise you are gay, is obviously closeting yourself.",
                                    "score": 6,
                                    "author": "Beerbongs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, gay people can seem pretty normal right? Unless he is a complete stereotype does he really have anything to worry about?",
                            "score": -18,
                            "author": "Level-Set-6239",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. You can read my reply to glum construction if you want to learn more about why.",
                                    "score": 4,
                                    "author": "calmgonemissing"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a gay man myself, I don't see any reason to fear solo travel anywhere. It's not like people are walking up to me asking for my sexual orientation. Don't wear rainbows or crop tops, and you'd probably be fine in most places if it's a concern.",
            "score": 2,
            "author": "yungScooter30"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Greeks are definitely very private about toilets and showers. Hostel and gym showers are not as popular as northern Europe.",
                    "score": 2,
                    "author": "Mediocre-Yoghurt-138",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting, guess all of my knowledge is from ancient times with the big bath houses",
                            "score": 1,
                            "author": "Magnetoreception"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can’t tell when someone’s gay?",
                    "score": 2,
                    "author": "Jolin_Tsai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, there are ones which seem obvious, but I’m sure there are a lot more people out there who just happen to like men, yet aren’t camp or feminine or whatever characteristics you think makes it clear that someone is gay.",
                            "score": 0,
                            "author": "Weather_the_Zesser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because he will tell them obviously",
                    "score": 2,
                    "author": "9Athelas7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very strange.",
                            "score": -4,
                            "author": "Weather_the_Zesser"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really don’t understand these types of questions. You are a person like all of us aren’t you? Why the hell would your sexual preference  have anything to do with your trip in Greece? These two things have zero relation to each other. You’re not going to Saudi Arabia. \nI think most of queers like to separate themselves from the rest.",
            "score": 0,
            "author": "frosthazer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would advise you to read through the thread, some people and even I have given some good insight to why there is reason for concern, at least to why we would ask questions like this, please go into it with an open mind and try to understand it from queer people’s perspective :)",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does this mean?😅",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Didnt Amber heard say we get free speech from the Greeks?\nur good!",
            "score": 1,
            "author": "Financial_Giraffe324"
        },
        {
            "level": 0,
            "comment": "Depends on how much culture has changed in, um, a couple thousand years or so. Gay relationships were definitely a part of army life in classical times. Achilles was very definitely bi, with his primary relationship being gay. (When his \"friend\" died, the funeral rites as recorded were what one would accord to a spouse.)\n\n...but yeah, probably a good idea to check an LGBTQ specific site for current info.",
            "score": 1,
            "author": "MariaInconnu"
        },
        {
            "level": 0,
            "comment": "Okay, I think most people have no idea what they are talking because mainland Greece is a lot different than Athens and the islands.   \n\n\nSince I'm from a place an hour away from Parga I will tell you that touristy places are very welcoming to all people but the majority of people on the non touristy places in Epirus are a little bit of bigots. But bigotry in Greece is limited to looking at you weirdly mostly by old people. The crime in Epirus is very low even by Norwegian standards.",
            "score": 1,
            "author": "elysios_c"
        },
        {
            "level": 0,
            "comment": "literally not a single soul will give a f\\*ck that u are gay. Why do u think people would care?",
            "score": -15,
            "author": "Marci711",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a gay person I have a lot of reasons to care, this should be super clear from the Media tbh.",
                    "score": 5,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re pathetic man and obviously live under a rock. This dude’s just trying not to get killed if homophobe suspects something of him that they dont like. Grow up or shut up. It’s not all an attention grab.",
                                    "score": 8,
                                    "author": "janitorial-duties",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you!",
                                            "score": 3,
                                            "author": "Me_ButTaylorsVersion"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Its not the fucking medieval times, it's the 21st century. he is not gonna get killed for being gay. stop with this bullshit.",
                                            "score": -7,
                                            "author": "Marci711",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh hm I didn’t know that’s when hate crimes stopped. Well, since it is irrelevant to you, worry about yourself and get off this post✌️",
                                                    "score": 4,
                                                    "author": "janitorial-duties"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There are plenty of places in that part of Europe where being gay isn't exactly friendly.  As a gay man who frequents a number of gay subreddits, I have seen many posts from people in Eastern Europe asking for help to escape.  \n\nYou probably won't find a *government* over there ready and willing to jail or execute you outright for \"being gay,\" but you will find random assholes in those countries who will beat the shit out of you, or kill you.",
                                                    "score": 3,
                                                    "author": "NSMike"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -54,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And wtf is this supposed to mean? Explain it.",
                    "score": 1,
                    "author": "nomoshoobies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely go to Ibiza!!",
            "score": -5,
            "author": "Missmarymarylynn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Ibiza is a good place, but is 1600 km far from Greece",
                    "score": 12,
                    "author": "MorningBloodyMary",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oops.  That from when I lived in Menorca!  There is a Greece island I think it’s Mykonos for the fun dancing culture!",
                            "score": 1,
                            "author": "Missmarymarylynn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How would they even know in the first place",
            "score": -1,
            "author": "cnylkew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have a read through the thread :) more people and I have given some insight on this :)",
                    "score": 1,
                    "author": "Me_ButTaylorsVersion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did but couldnt find anything, can i have a tldr",
                            "score": 1,
                            "author": "cnylkew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So basically being queer is more than who you fall in love with and have sex with. But ofc, prople could ask if you have a boyfriend or a girlfriend, but other than that there are mannerisms that come naturally to some of us like the limp wrist or high pitched voice and other things (things that some of us suppress in many years before we come out) Basically there are heteronormative patterns that we don’t necessarily subscribe to that COULD make us a target to the wrong people, people who would «clock» us for this behaviour. So that’s why I am asking😊",
                                    "score": 1,
                                    "author": "Me_ButTaylorsVersion"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}