{
    "id": "8jjff2",
    "score": 2966,
    "title": "Leaving japan after a month, fell in love with this peak.",
    "author": "SurgicalInstallment",
    "date": 1526365312.0,
    "url": "https://www.reddit.com/r/solotravel/comments/8jjff2",
    "media_urls": [
        "https://i.redd.it/c280wmhkpyx01.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Spent about 5 weeks in Japan (Tokyo, Osaka, Kyoto, Kawaguchiko). Been travelling for past 6 months (9 different countries) But by far the most mesmerizing landmark I've seen was Mt. Fuji. Just as jaw dropping the 100th time I see it as I did the first time. \n\nFeel free to ask me any questions about japan or solotravel in general. \n\nAlso, more Japan: https://imgur.com/a/C87u3qY",
            "score": 98,
            "author": "SurgicalInstallment",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m going to Japan for 8 days, what’s your suggested budget? Place to see? We’re to eat? I’m hoping to aim for $50 USD/a day. I’m coming from SEA and I’m an American. ",
                    "score": 23,
                    "author": "sara_godsword",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I’m hoping to aim for $50 USD/a day.\n\nIs that a budget for food or for everything? 50$ is around 5500 yen, and that is a very reasonable budget for food. You can eat in a lot of places for 1200 yen.",
                            "score": 21,
                            "author": "Ze-Manel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is that inclusive of street food?",
                                    "score": 2,
                                    "author": "average_name_of_user",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There weren't many literal \"street food\" places, like Thailand, and the ones I passed by were mostly snacks. But restaurants are everywhere, and there are a lot of them because they are really small.",
                                            "score": 15,
                                            "author": "Ze-Manel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Japan is a first world country with a minimum wage and food safety laws. You're imagining it wrong. ",
                                            "score": 9,
                                            "author": "its_real_I_swear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "are you saying there's nobody on the street selling food in japan?  cause that's wrong.",
                                                    "score": 12,
                                                    "author": "jeffersun8",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not commonly, and certainly not at Thailand prices \n\nWhen people are talking about asian street food, they're not thinking of the jagaimo guy, or expensive matsuri food. ",
                                                            "score": 7,
                                                            "author": "its_real_I_swear"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hopefully for everything. On Agoda I saw hostels and capsules for $20-$25 and then I was going to spend $30 on food and transport ",
                                    "score": 3,
                                    "author": "sara_godsword",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you can definitely get rooms(pods) for less than $20.  Everything I've stayed in has been remarkably clean, safe and quiet.  Once you land, in either NRT or HND, when you buy a train ticket into the city, you can add on a 24, 48, or 72 hour unlimited subway pass.  For 72 hours, it's less than $5 a day to take as many subways as you want (only subway line, not keio or JR, but you can get anywhere).  You can also buy them at some of the camera and department stores.  Bowl of ramen or sukiyaki is like $5-8.  Food can be cheap.  It can also be stupid expensive.  It's all delicious tho.  You can do plenty with $50/day      ",
                                            "score": 6,
                                            "author": "jeffersun8"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It might be a bit tight, but doable. As a reference, I paid 2800 yen/night in Tokyo so that leaves you with 2700 yen (~25$).\n\nTip: don't forget to include temple/garden entre fees in your budget, they might be small (~300 yen) but in the end they add up. Plus all other entertainment expenses (ex. in Tokyo: robot restaurants, tokyo tower, skytree, museums, arcades, maid/owl/cat/etc cafes etc).",
                                            "score": 4,
                                            "author": "Ze-Manel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Appreciate it",
                                                    "score": 1,
                                                    "author": "sara_godsword"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you're not in main centers/right next to the main train station actual hotels are pretty cheap",
                                            "score": 2,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yep, that's about correct.",
                                            "score": 1,
                                            "author": "SurgicalInstallment"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wanna chime in on street food - at train stations further away from the city centre (basically not the busy stations like shibuya and shinjuku), you'll be able to find illegal ramen carts parked in the area where you can get a nice bowl of pipping hot ramen while surrounded by a bunch of tired salarymen slurping up their noodles. A seriously fantastic experience. ",
                            "score": 9,
                            "author": "Depaysant"
                        },
                        {
                            "level": 2,
                            "comment": "Places to see:\n\n- Lake Kawaguchi (Take a bike ride around the lake, really beautiful)\n- Arashiyama in Kyoto\n- Minoo Falls / Park in Osaka (Hike is around an hour from train station)\n- Harajuku in Tokyo\n- Arcade in Kawasaki (if you're into that)\n\n\nAs far expenses, I set aside 30 bucks for hostel a day, and 20 bucks for food. That's excluding transportation. Transporation can be pretty expensive between cities (Tokyo to Osaka / Kyoto or Kawaguchiko) especially if you're using Shinkansen (Bullet train)\n",
                            "score": 3,
                            "author": "SurgicalInstallment"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I couldn't imagine anything better than waking up to that view every day. It's incredible.",
                    "score": 6,
                    "author": "KittyCatfish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't let you sleep in trains",
                            "score": 3,
                            "author": "its_real_I_swear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s Japan, people sleep anywhere",
                                    "score": 3,
                                    "author": "effyonline",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not overnight ",
                                            "score": 2,
                                            "author": "its_real_I_swear"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Haha yep, here's the view from the hostel I was staying at:https://imgur.com/a/nPeoIpw",
                            "score": 2,
                            "author": "SurgicalInstallment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The garden + the view, that's a ridiculously beautiful view to wake up to",
                                    "score": 2,
                                    "author": "xavierkoh"
                                },
                                {
                                    "level": 3,
                                    "comment": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\n**https://i.imgur.com/yG5rOTK.jpg**\n\n^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=ignoreme&amp;message=ignoreme) ^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=delet%20this&amp;message=delet%20this%20dz1j9nu) ",
                                    "score": 2,
                                    "author": "imguralbumbot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just money-related questions, feel free to ignore me if you consider these too sensitive.\n\n- How much did you save up to be able to travel for so long?\n\n- What's your budget for a day?",
                    "score": 9,
                    "author": "bem13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't answer for OP but I recently did a month in Japan also, and my budget was about 3k yen a day. The whole trip cost me about $2,000 plus flights. Not sure what the other places they went were like, but Japan is a cheap trip!",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How much was it including flights, if you don't mind me asking? I've been to Japan twice: last year for two weeks and this year for a week. The first trip cost me about $2158, the second about $1966, though I *did* splurge on stuff like music CDs, and the hotel wasn't the cheapest one either. Still, 2k for a month is pretty great.\n\nEdit: I mostly asked because OP said they've been traveling for the past 6 months.",
                                    "score": 5,
                                    "author": "bem13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well I flew from the other end of the world than you would, so it's not very relevant xD The first time I went to Japan I spent a bit more even though I was there for half the time, this time I wanted to stay longer which meant finding cheaper options :)\n\nKonbini dinners cannot be beat.",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "cheap compared to W. Europe.\n\nWhat type of lodging did you use ?\nDo you know much Japanese ?",
                                    "score": 1,
                                    "author": "andtherefore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hotels. Yes I would call myself conversational in Japanese.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wait...3k yen a day ($30) budget allowed you to stay in hotels ??? (i.e. private own room)\n\n",
                                                    "score": 1,
                                                    "author": "andtherefore",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Correct. I wasn't in main centres.",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But these places where you lodged have easy public transportation from/to centres ? \nHow long is the the average commute between these lodgings and centres ?\n",
                                                                    "score": 1,
                                                                    "author": "andtherefore",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In Japan everything has public transport access lol. I wouldn't say they were super far out, e.g. in Tokyo I was about ten stops from Tokyo Station, so less than an hour on the train.",
                                                                            "score": 1,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I second this. He's been traveling for 6 months in different countries. \n\nDoes one just spend all their savings doing this or is there a secret to solo traveling and managing all the expenses? \n\nI want to jump on this boat and see the world.",
                            "score": 3,
                            "author": "leflower"
                        },
                        {
                            "level": 2,
                            "comment": "People are saying $50 a day, I did around $65 just to be on the safe side and it turned out to be correct. I was there for a full month. TBH, Japan can be expensive or cheap, depending on what you wanna do. So even $40 will be fine.",
                            "score": 4,
                            "author": "SurgicalInstallment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! I actually meant your budget for the whole trip not just Japan, since you mentioned you've been travelling for 6 months. Was $65 for a day enough in each of the 9 countries?",
                                    "score": 3,
                                    "author": "bem13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh sorry I misunderstood. No, $65 is only for Japan. \n\nAustralia was way more expensive, I was there for 2 months and stayed in Airbnb for a full month. Then lived in Sydney (most expensive city I've been to) and then to Tasmania.\n\nMalasyia, Indonesdia, Vietnam, Cambodia and Thailand were all much cheaper, around $30 a day and you can be very comfortable. \n\nSo no, not $65 a day. I work online (software dev) and so I like to be very comfortable while I travel  so my daily budget is a bit more on the expensive side, as I mentioned, you can drag that $65 for Japan budget down to $50 easily. \n\nLet me know if that helped and if you've got any other question, feel free to ask!",
                                            "score": 5,
                                            "author": "SurgicalInstallment",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That helped, thank you very much!",
                                                    "score": 1,
                                                    "author": "bem13"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I first saw Mount Fuji, it was on the train to Tokyo (back from Kyoto) during the last light of the day. It was incredible. \n\nAnyone interested in Art who's visiting Japan, I'd highly recommend a trip south to Naoshima / Teshima Island(s) - near the Coastal city Uno. \n\nJapan was the only place I've visited (so far) that I immediately wanted to go back to as soon as I got home. ",
                    "score": 3,
                    "author": "king_in_yelloh"
                },
                {
                    "level": 1,
                    "comment": "How did you finance the 5 weeks. and how much did it cost? I fly for almost free with my miles, so I'm really only concerned with living expenses in Japan. ",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work online as I travel (software engineer) and so I've been travelling for the past 6 months, that's how I finance my travels.\n\nFor living expenses, as I mentioned above, Japan can be really expensive or cheap, depends on you and what you wanna do. You can get away easily with $50 a day (accommodation + food). Transportation is expensive though.",
                            "score": 4,
                            "author": "SurgicalInstallment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "$75 a day would be a reasonable budget for both?",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. The only expensive transportation is between the main cities \\(Tokyo \\&lt;\\-\\&gt; Osaka or Kytoto or Hokkaido\\). On Shinkansen \\(bullet train\\), it costs $140 between Tokyo and Osaka. ",
                                            "score": 3,
                                            "author": "SurgicalInstallment"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Solo traveler?\n\nLoves Mt. Fuji?\n\nI think I know [who](https://i.imgur.com/ZsaWWrU.jpg) you are. ",
                    "score": 2,
                    "author": "Blinky128",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1](https://i.imgur.com/ZsaWWrU.jpg) - Previous text \"who\"\n\n\n\n----\n^Please ^PM ^/u/eganwall ^with ^issues ^or ^feedback! ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&amp;subject=delete&amp;message=delete%20dz0tbvj)\n",
                            "score": 0,
                            "author": "FatFingerHelperBot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you happen to visit Arashiyama in Kyoto? That was my favourite landmark of my visit :) ",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, Absolutely loved it. Probably the place where I felt like I was the most in Japan: https://i.imgur.com/XhFeh0D.jpg",
                            "score": 3,
                            "author": "SurgicalInstallment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhhh so many memories. Best place ever.",
                                    "score": 2,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "How did you get an empty shot?",
                                    "score": 1,
                                    "author": "SkillsDepayNabils",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "5 AM.",
                                            "score": 1,
                                            "author": "SurgicalInstallment",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah. Worth it though",
                                                    "score": 1,
                                                    "author": "SkillsDepayNabils"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you visit Japan during climbing season, you can climb up Mt Fuji. I went up twice.",
                    "score": 1,
                    "author": "lattakia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Climb as in the very top / summit? Wow. You have any photos? How long did it take you? Is it very physically challenging? Tell me more please, I plan on doing this.",
                            "score": 1,
                            "author": "SurgicalInstallment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you're in even moderate shale it's really not hard at all. Can be done in a day but most people go up to the camp the first day, sleep, and wake up early the next morning to summit and watch the sunrise ",
                                    "score": 2,
                                    "author": "cool_chris"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't remember a bug museum. ",
                            "score": 1,
                            "author": "SurgicalInstallment"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This picture makes me excited for November.  ",
            "score": 10,
            "author": "cass210"
        },
        {
            "level": 0,
            "comment": "Going to Japan in exactly 10 days and can't wait. Dope picture ! ",
            "score": 6,
            "author": "diplomatic212"
        },
        {
            "level": 0,
            "comment": "Hello, it appears you are posting a travel image! First and foremost /r/solotravel is a place to foster discussion. Please update with a comment telling about your photo. Where did you take the photo? (Google Maps link would be awesome!) What is it about this photo that prompted you to take it? (Amazing scenary, emotional response, etc) When was it taken? If you are so inclined tell us the camera gear used. The gear heads will love that! We'd also appreciate it if you don't just post and run. Stick around to answer other solotravelers questions!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "score": 6,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "How is it to solo travel? ",
            "score": 2,
            "author": "WoahThereBuddy101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not OP but it's really easy, transportation options are aplenty (unless you're going to super rural areas), the Japanese are friendly, Google Maps work fine, food is good, views are awesome and crime is very low. It's a perfect place for solo travel.",
                    "score": 1,
                    "author": "xavierkoh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah!! Great shot! We lived 2 weeks in a camper and traveled down south from Tokyo to Hiroshima and came across Mt. Fuji! ",
            "score": 2,
            "author": "FREETOUSESOUNDS"
        },
        {
            "level": 0,
            "comment": "i had the perfect view of figi on my first shinkansen ⛰ ",
            "score": 2,
            "author": "vayleen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shinkansen doesn't run to / near Fuji though. I could be wrong but I was told that specifically. Had to take regular JR. ",
                    "score": 1,
                    "author": "SurgicalInstallment",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not going to say you’re wrong, i saw it on the train to kyoto, so either way...",
                            "score": 2,
                            "author": "vayleen"
                        },
                        {
                            "level": 2,
                            "comment": "You can still see it on a clear day",
                            "score": 1,
                            "author": "SkillsDepayNabils",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool, thanks for correcting me.",
                                    "score": 1,
                                    "author": "SurgicalInstallment"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My Samsung S8 :D",
                    "score": 2,
                    "author": "SurgicalInstallment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This picture wants me to go back to Japan. Hopefully I can go in November/December",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "do you know much Japanese ?",
            "score": 1,
            "author": "andtherefore"
        },
        {
            "level": 0,
            "comment": "That's an empty train! \nAt my place trains are this empty only when they are not running!",
            "score": 1,
            "author": "AkshayD110",
            "replies": [
                {
                    "level": 1,
                    "comment": "Na, this was running. Just that it was sunday morning 5 AM. ",
                    "score": 1,
                    "author": "SurgicalInstallment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a trip in early June and it bothers me that there is still snow on top. Have you hiked the mountain? I'm thinking to start at 8-9pm and hike till 4am to catch the sunrise. Would this be not *extremely* dangerous?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The trails don't open until July",
                    "score": 1,
                    "author": "its_real_I_swear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it’s off season but I just cant make it in July hence I’ll be hiking off season. ",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There will probably still be snow. The trails are closed. The huts are closed. There’s no bus for the time you want. If you are not an alpinist, early June is almost impossible ",
                                    "score": 1,
                                    "author": "its_real_I_swear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah that sucks then :(",
                                            "score": 0,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That mountain wouldn't look amiss on as part of a logo on a bottle of water/beer",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a glass bottle of sake with Mt Fuji on the label, looks pretty dope",
                    "score": 1,
                    "author": "xavierkoh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I spent a month in Japan a couple years ago visiting Tokyo, Kyoto, Osaka, Mt Koya, Takayama, Shirakawago, Hiroshima, Miyajima, and Okunoshima. I can say without a doubt that it was the most amazing place I've travelled to, and I can't wait to go back in a few years!",
            "score": 1,
            "author": "kaitybubbly"
        },
        {
            "level": 0,
            "comment": "Going to Japan for 2 weeks in September - this makes me super excited! 😁😁 Any recommendations for places to eat in Tokyo at a cheap/ reasonable budget??",
            "score": 1,
            "author": "raiigiic"
        },
        {
            "level": 0,
            "comment": "I just left and I'd do anything to go back there to raise children and bring people to visit. I fell in love with the culture, the people and the scenery! That view is unlike anything I've seen! *le sigh*",
            "score": 1,
            "author": "gypsy_nurse_25"
        },
        {
            "level": 0,
            "comment": "I remember seeing Fuji from the Shinkansen on my first trip in Japan. I don't think my second trip will take me through there again but that view is absolutely unforgettable. Japan is such an amazing country. I can't wait to visit again.",
            "score": 1,
            "author": "saltr"
        },
        {
            "level": 0,
            "comment": "Do you speak Japanese? Do you think is it a concern/issue if we don't know Japanese at all when solo travel in Japan? ",
            "score": 1,
            "author": "ivanwayne",
            "replies": [
                {
                    "level": 1,
                    "comment": "It will not be a concern, the Japanese are really friendly people and willing to help as long as you are not rude/demanding. The people in big cities (especially younger people) tend to know basic English, and restaurants have English menus. You can also use hand gestures/Google translate if they really do not understand. Just learn some basic phrases like thank you (arigato) and excuse me/sorry (sumimasen) to show courtesy",
                    "score": 2,
                    "author": "xavierkoh"
                },
                {
                    "level": 1,
                    "comment": "Nope, I only know three words in Japanese. Not a concern at all. People are really friendly and willing to help \\+ Google translate.",
                    "score": 2,
                    "author": "SurgicalInstallment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the photos and videos of Mt Fuji couldn't beat the moment when I saw it personally... it's beauty and size are unparalleled. The views of Mt Fuji from the lake and Chureito Pagoda were pretty darn amazing",
            "score": 1,
            "author": "xavierkoh"
        },
        {
            "level": 0,
            "comment": "But do you every get lonely? Why did you choose to solo travel if you don’t mind me asking? ",
            "score": 1,
            "author": "WoahThereBuddy101",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;But do you every get lonely?\n\nIt depends on the person I guess, but for me it's perfect. I stay at hostels most of the time and there's plenty of people to socialize with. You can use apps like meetup to meet new people too.\n\n&gt;Why did you choose to solo travel if you don’t mind me asking?\n\nDon't mind at all. I'm from Canada where winter is really cold, dark and depressing. I can work from anywhere and so getting the hell out is the only sane choice. My first time doing it, and I'm wondering why I didn't do this 5 years earlier. But why I choose to solo travel? I wouldn't mind travelling with other people, but it's hard to come across a travel buddy who can travel for 6 months. I did find someone to travel with though in Cambodia, Vietnam and Australia so that was cool. \n\nLet me know if that answers your questions.",
                    "score": 1,
                    "author": "SurgicalInstallment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would actually be Mt Fuji",
                    "score": 1,
                    "author": "Kkerby1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you get in? Aren’t Japanese borders closed for travel?",
            "score": 1,
            "author": "skittleteeth",
            "replies": [
                {
                    "level": 1,
                    "comment": "i posted this 3 years ago, sir.",
                    "score": 1,
                    "author": "SurgicalInstallment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, /u/SurgicalInstallment  \n\n\nDo you remember where you took this picture? Which train line?",
            "score": 1,
            "author": "PermafrostPerforated",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's been 4 years wow, i honestly don't remember. It was coming back from Lake Kawaguchiko station to Tokyo on a bullet train.",
                    "score": 2,
                    "author": "SurgicalInstallment",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! I'm into scenic railroads and might soon travel to Japan, so your answer is helpful!",
                            "score": 1,
                            "author": "PermafrostPerforated"
                        }
                    ]
                }
            ]
        }
    ]
}