{
    "id": "alu9vo",
    "score": 1274,
    "title": "I decided to create some books to document all of my travels, and this is the final result!",
    "author": "The-Smelliest-Cat",
    "date": 1548968999.0,
    "url": "https://www.reddit.com/r/solotravel/comments/alu9vo",
    "media_urls": [
        "https://i.redd.it/xvwpd125ntd21.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Some more pictures here: https://imgur.com/a/S7i65Ee\n\nI originally had some 6x4 pictures printed out and put in a little cheap photo book, which was nice, but decided I wanted something better. So I spent a week learning how to use Adobe inDesign, then spent way too long making these. \n\nWas just supposed to be a photo book at first, but turned into more of a diary type thing. Im really happy with them though!! Im hoping to add one or two new ones every year, and keep them forever. One day I can pass them down to my cats and inspire them to go off on journeys of their own! \n\nOban was the first (2 days), then Barcelona (6 days), then London/USA/China (115 days, mild escalation), then Portland a few months back (12 days). Oban and Barcelona are completely solo, London/USA/China is mostly solo, and Portland I was visiting a friend, so no solo travel there. \n\nIf you wish you can read them here: (works best on a desktop/laptop)\n\n[Oban](https://indd.adobe.com/view/2e1d9106-742b-4f21-acca-ae9a3df692d3)\n\n[Barcelona](https://indd.adobe.com/view/49182f4c-87c8-48a1-b3a6-ea3e94f9fe98)\n\n[London/USA/China/Hong Kong](https://indd.adobe.com/view/e83a1997-21a0-468a-9996-4230acc1b2fc)\n\n[Portland](https://indd.adobe.com/view/b3af70d1-da78-4d19-91e2-6253a3640eaa)\n",
            "score": 109,
            "author": "The-Smelliest-Cat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Oban, Mull and Iona, I would love to go back one day ",
                    "score": 5,
                    "author": "RestlessFA"
                },
                {
                    "level": 1,
                    "comment": "These are amazing! However long you spent making these was worth it.",
                    "score": 5,
                    "author": "MsPoopyButtholePhD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was thinking of doing something similar with all my travel pictures and stuff I kept from my trips!! These look great!! ",
            "score": 30,
            "author": "thomw8675309",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should!! Going back and doing multiple trips at once was a pain. Especially when you cant remember everything you got up to. Better to start sooner",
                    "score": 16,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’m was thinking of a hybrid between what you did and a scrapbook ( I’m not crafty) but I do have items like ticket stubs, brochures, invitations etc that I want to add along with the insane amount of pictures I took. I am behind, I have stuff from my trip to Ireland from two years ago I need to get busy on and my trip last year to Italy. ",
                            "score": 7,
                            "author": "thomw8675309"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are amazing, great job!\n\nWhat's the cost to have these printed?",
            "score": 7,
            "author": "Meoler9",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used Blurb. Very expensive, but I didn't see anywhere cheaper, and Blurb are pretty good, they've even got a plugin for inDesign so making them print ready was really easy. \n\nI paid £115 for the four of them, which was with a 50% discount cost. The normal price for the big book is £113! Smaller ones are about £25-30. But there's always a decent sale on, so it'll never be that much. Can lower it by going with cheaper paper and smaller sizes also. \n",
                    "score": 15,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kudos on actually getting them printed!! I journal when I travel using good old fashioned pen and paper, but have been going back and typing them up lately (wildfires got me worried about losing memories!) I’ve been thinking of copying and pasting into a book template, adding maps and pics from the trip and maybe even taping a few mementos into the finished book...but then I get distracted by Netflix and my free time gets sucked into a vortex! 😏",
            "score": 8,
            "author": "_gonewandering",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not scan them? Would save a lot of time. ",
                    "score": 2,
                    "author": "blindedbythesight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s its own kind of therapeutic remembering to type, I find it relaxing and have the time to read them and reflect as I go. ",
                            "score": 5,
                            "author": "_gonewandering"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know the feeling haha. After my big trip last summer I had plans to make these books and put together all of my videos into a big video. Only just got the books finished, and now im thinking about the video. It's almost been a year since the trip.. procrastinating so hard. ",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are amazing! As a Scot I obviously love the Oban one the most",
            "score": 10,
            "author": "PuddingOfEarl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oban was my first ever trip!! The other three never would have happened if I didn't go to Oban so it is special to me also",
                    "score": 10,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those pictures take me right back to childhood summers in the Highlands and Islands",
                            "score": 3,
                            "author": "PuddingOfEarl"
                        },
                        {
                            "level": 2,
                            "comment": "I have some good memories from the place as well. It was only one day though. I went to eat some of the seafood the place is famous for (I was already familiar with the whisky from there), went to a ceilidh session and then our group went to one of the pubs there with some local youths who dragged us along from another pub they found us at.\n\n",
                            "score": 2,
                            "author": "karimr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a great idea and really inspirational, maybe it will finally make me do something with all my travel photos ! Thanks for sharing",
            "score": 6,
            "author": "extinctpolarbear"
        },
        {
            "level": 0,
            "comment": "Dude make a calendar! It is easy one time setup that produces long term money! That way, the next adventure you go to, you still have a source of income!  \n\n\nThe push further with the idea, you could make a site that sells custom large prints, calendars, mugs, etc. I am not familiar with any sites that are best for photos so I can't help there, it's more food for thought.  \n\n\nAnother random idea could be to send a copy of these books to the city council of each city and see if they would buy bigger prints! Tug on those emotional chains for a while and let the cha-ching fall straight into your pocket!!!!!!!  \n\n\nI've been learning ways to monetize art for long term profit and photographers have a lot of content that doesn't get used. That is my goal once I get a new set of camera equipment :)  \n\n\nHope you enjoy the brain food!",
            "score": 4,
            "author": "wonderboi_777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Some good ideas. Im not really a photographer, just mainly stick to auto mode most of the time, but some of the pictures probably turned out really well! ",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those look amazing!!  Looking through your photos makes me think about my trips.  I've been thinking about doing something like that for a few different occasions (my U.K. trip, a general one for my time in the military, and then one specifically focused around my time spent living in New England-I'm a Midwestern boy).  I have a feeling I'm going to go off the deep end in Adobe (I need to see if Design is included in my current subscription).    \n\n\nWhere did you get them printed at?  \n\nThe Oban book reminds me of my day trip there. ",
            "score": 3,
            "author": "CMac86",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!! inDesign isn't so bad! It can get really advanced, but if you just learn the basics you can create good enough stuff. I printed them with Blurb!",
                    "score": 4,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I’m going to look into it. Your books made me think of the souvenir books I got at various museums &amp; Stonehenge. ",
                            "score": 1,
                            "author": "CMac86"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what service/printer did you use and what was the cost?",
            "score": 2,
            "author": "teddytravels",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used Blurb. Very expensive, but I didn't see anywhere cheaper, and Blurb are pretty good, they've even got a plugin for inDesign so making them print ready was really easy. \n\nI paid £115 for the four of them, which was with a 50% discount cost. The normal price for the big book is £113! Smaller ones are about £25-30. But there's always a decent sale on, so it'll never be that much. Can lower it by going with cheaper paper and smaller sizes also. ",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What did you use to make these? It’s a great idea and I want to do this for my upcoming trip:)",
            "score": 2,
            "author": "buxbitty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Designed with with inDesign and printed them via the Blurb website!",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been using the Polarsteps app to get a sort of similar experience - the app tracks you or you can manually add your location and then add some photos / words if you want too. You can keep it private or share the link of your trip to anyone who wants to check in on you and then when you've completed the trip they have a service to turn your journey into a scrapbook - I haven't followed up on this though cos I enjoy having them on my phone /web enough.",
            "score": 2,
            "author": "solidgrease"
        },
        {
            "level": 0,
            "comment": "I've started getting photo books made from my travels too. It's great because with digital photos, everything just stays tucked away in the cloud.  I've used Shutterfly in the past and been very happy with the results. ",
            "score": 2,
            "author": "purpleblazed"
        },
        {
            "level": 0,
            "comment": "Woohoo Portland! That’s where I’m from! The books look like great quality. ",
            "score": 2,
            "author": "PM_ME_UR_FUDES"
        },
        {
            "level": 0,
            "comment": "This may be a weird question, but which font are you using? I really like it! Suits the books very well.",
            "score": 2,
            "author": "Cedrinho",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree! It's called Amithen ",
                    "score": 2,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome, thanks! Too bad I already some photobooks made and wanted to keep the same lay-out for all the ones I'm making, but I'll try to find a way to incorporate this. It's a really nice font to use for this!",
                            "score": 1,
                            "author": "Cedrinho"
                        },
                        {
                            "level": 2,
                            "comment": "Other question, if you don't mind. I've just checked your 4 books, which look really good (seriously, great lay-out). And I think it's great that you also add text and info. I do so too in my books, although it's more travel diary style than actual information on what's in the pictures, but I've seen so many people only put in pictures... I mean, I doubt they'll still know what everything is when they check out their books 50 years from now... Text is so useful! Also when showing the books to other people..\n\nAnyway, what I wanted to ask: your maps. You seem to make custom maps of your journeys (or have them custom made?). How do you do it? So far, I've not been able to do better than just copy/paste a screenshot I take from GoogleMaps.. But you make them exactly the way I'd love to so I'm curious.  \n",
                            "score": 1,
                            "author": "Cedrinho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! I agree the text adds a lot of context and will be good to reminisce on later in life. \n\nI used MapBox to create the map backgrounds, pan to where i want the map to be, then screenshot it, paste the screenshot into photoshop, and add the markers/path/text and such in with photoshop\n\n[This was the style i was using](https://api.mapbox.com/styles/v1/johnfrace95/cjo31flds69b82rpl115x1qyi.html?fresh=true&amp;title=true&amp;access_token=pk.eyJ1Ijoiam9obmZyYWNlOTUiLCJhIjoiY2pucGE2OW1mMGdzZDN4cGZ1bTd3aGNoZSJ9.vCRM0o_sP_O3wT1Kobpx_Q#4.49/54.17/-9.63). You can style it quite a lot, and create your own map styles aswell which is neat!\n\n",
                                    "score": 2,
                                    "author": "The-Smelliest-Cat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks! Hadn't heard of MapBox yet, but looks very useful.",
                                            "score": 1,
                                            "author": "Cedrinho"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is magnificent!!!!\n",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is awesome. Imagine the value of these in the distant future when you look back on them - such a great idea!",
            "score": 2,
            "author": "Freyjasmi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! That's the idea. \n\nAlso keeping digital versions incase the house ever gets flooded and I lose all my memories. Seems like a typical old person tragedy ",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Neato!",
            "score": 2,
            "author": "itsme_cassie"
        },
        {
            "level": 0,
            "comment": "Love this - I need to start. Everything is on my iPhone 😫",
            "score": 2,
            "author": "whoknowzz"
        },
        {
            "level": 0,
            "comment": "Nice! I've been wanting to make something similar as well!",
            "score": 2,
            "author": "Whatsername868"
        },
        {
            "level": 0,
            "comment": "That’s a great idea!!!",
            "score": 2,
            "author": "gonewiththewhat"
        },
        {
            "level": 0,
            "comment": "I just spent the last 45 minutes looking through all your books, that is such a wonderful thing to have! I had fun reading through them and seeing your thoughts about California especially, I can't believe how much you did and saw! Amazing.\nI need to do something like this haha.. all my pictures are just sitting in a box.\n\n",
            "score": 2,
            "author": "terrific_film",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! :) \n\nYes California was awesome. ",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Badass! I did this for my 6 week Euro trip in 2016 and it sits on my coffee table. Totally worth it and fun to make. ",
            "score": 2,
            "author": "_DirtyYoungMan_"
        },
        {
            "level": 0,
            "comment": "Thank you so much for sharing the inside of the book with us. That’s really amazing. I love making photo books too but it never has any context like yours haha. ",
            "score": 2,
            "author": "lawplanet"
        },
        {
            "level": 0,
            "comment": "this is awesome man! i was looking at your US/China book and it seemed so so familiar, so I went into your post history and realised that I read your posts about this trip before. Nice to see the photos from it too! ",
            "score": 2,
            "author": "antisarcastics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah doing the trip report was really fun and sort of inspired me to do the books!!",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks great! Fantastic idea. What camera did you use?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!\n\nThe Oban one was a Fujifilm S9250, Barcelona was a Canon 550D, and the other two were a Sony RX100V. Plus a few different smartphones over that time",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome I am really tempted to do this as well",
            "score": 2,
            "author": "ivr56"
        },
        {
            "level": 0,
            "comment": "Ohhhh I love this idea! Taking it!",
            "score": 2,
            "author": "Dolliesimpson"
        },
        {
            "level": 0,
            "comment": "Nice. I did one as well on my first solo trip to Europe (Prague, Berlin, Liverpool, Amsterdam) and it came out pretty great. My longer term aim is to eventually travel to all 47 prefectures of Japan and turn my photos into one single huge photo book, currently on 4 trips and 6 prefectures completed",
            "score": 2,
            "author": "metalleo"
        },
        {
            "level": 0,
            "comment": "Wonderful project, I love your idea",
            "score": 2,
            "author": "webnetcat"
        },
        {
            "level": 0,
            "comment": "What did you use to create the map imagery?",
            "score": 2,
            "author": "cbunn81",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used MapBox to create the backgrounds, then screenshotted it and added the markers and such in with photoshop\n\n[This was the style i was using](https://api.mapbox.com/styles/v1/johnfrace95/cjo31flds69b82rpl115x1qyi.html?fresh=true&amp;title=true&amp;access_token=pk.eyJ1Ijoiam9obmZyYWNlOTUiLCJhIjoiY2pucGE2OW1mMGdzZDN4cGZ1bTd3aGNoZSJ9.vCRM0o_sP_O3wT1Kobpx_Q#4.49/54.17/-9.63)",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been making shadowboxes with a map, photos, shells or rocks, and other trip souvenirs, but this would be a great idea for when be I run out of wall space... Which is probably soon",
            "score": 2,
            "author": "Saraswatispock"
        },
        {
            "level": 0,
            "comment": "Don’t know if this is offtopic but how did you like Portland?\n\nI’m pretty much halfway across the world but PNW looks like the most beautiful place on Earth and I want to visit there so bad.\n\nAlso how many days would you recommend and what are some must sees?",
            "score": 2,
            "author": "puga1505",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was awesome! It's a lot smaller than Los Angeles or San Francisco or the other cities I've visited. A lot of 'hipster' and 'indie' stuff going on. I was visiting a friend and we didn't actually do too much in the city itself, mainly seeing places around the city. \n\nI think Trillium Lake/Mt Hood are great places to visit, and the Columbia River Gorge. Cannon Beach is also really nice. But you'll need to have a car to reach those place (I think).\n\nI wouldn't say it's one of my favourite cities, but it is located in one of the most beautiful parts of the country, it's perfect if you like nature/mountains!",
                    "score": 1,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The whole US looks so tempting haha but if I had to go, I think I'd opt for the route you went to there. Just gotta save up for everything now.\n\n&gt;it's perfect if you like nature/mountains!\n\n\nI do, which is why it seems ideal.",
                            "score": 1,
                            "author": "puga1505",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Maybe this sort of route could work! Best of both worlds](https://d1tzgotdnv3fcd.cloudfront.net/files/agency/trekamerica/uploads/map/pacific-dream-map.jpg)",
                                    "score": 2,
                                    "author": "The-Smelliest-Cat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Add Vancouver/Whistler/Victoria to that as well if you are going that far north. Definitely worth the 3 hour drive/bus from Seattle!",
                                            "score": 1,
                                            "author": "mr_2_awesome",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you and thanks to /u/The-Smelliest-Cat for this suggestion.\n\nThis looks like an ideal way to visit the US, hopefully I'll have the chance to pull this off in the next few years.",
                                                    "score": 1,
                                                    "author": "puga1505"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this idea, and loved reading about your California adventures. :) Always interesting to see it from the eyes of someone not from this part of the States. ",
            "score": 2,
            "author": "bunnyystar"
        },
        {
            "level": 0,
            "comment": "Top work! Love all the photos especially your Portland one.  Give us an update when you make more!\n\nPs. Epic you got to see Messi score four! When I went to the Nou Camp he scored a beautiful freekick to beat Atleti.  ",
            "score": 2,
            "author": "cloudprince"
        },
        {
            "level": 0,
            "comment": "Great job! These look amazing! Inspiring me to do the same with the pics!\n\nI enjoy doing little 2 min videos of my trips, using footage, but might do some stuff like this with the photos!!",
            "score": 2,
            "author": "stewardplanet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! You should!!\n\nI took nearly as many videos as pictures. Watching some tutorials on Premiere Pro just not and hoping to start editing them together soon!",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very cool and inspiring. ",
            "score": 2,
            "author": "HappyRyan31"
        },
        {
            "level": 0,
            "comment": "You inspired me and look what has just arrived\nhttps://imgur.com/a/W0WJVtx",
            "score": 2,
            "author": "ismeralda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome!!! Hopefully the first of many books for you :)\n",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                },
                {
                    "level": 1,
                    "comment": "who did you order through",
                    "score": 2,
                    "author": "Mybeardisawesom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I ordered this on a website called \"cewe Fotobuch\", but it is a german website so I doubt that it will be available in your country. Just look for an online store in which you can design and order your own photo books if you're not familiar with Adobe (me neither so I ordered through this website) and it still looks insanely good :)",
                            "score": 1,
                            "author": "ismeralda"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is the best online site to store pics? flickr? I'm looking for ease of use, and cheap storage",
            "score": 1,
            "author": "anxietyokra",
            "replies": [
                {
                    "level": 1,
                    "comment": "I use OneDrive. It links in with the file explorer on my computer really well. Pretty expensive on its own depending on how much space you need, but you get 1TB with an Office 365 subscription which is nice",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is next level",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Are you writing them in and pasting pics you took to them? I want to do that too ",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No it's all designed on the computer and then just printed out, here's a picture of the insides https://i.imgur.com/WGcLcAn.jpg",
                    "score": 2,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those basically look like exactly what I'd like to do. Sell your template, haha",
            "score": 1,
            "author": "its_real_I_swear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no I can barely navigate around the template I've made. It's such a mess lol. One day maybe ",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What camera did you use in your travels in the books? I use a DSLR and an iPhone and was wondering if my iPhone pictures are good enough quality.",
            "score": 1,
            "author": "everylittlebeat",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Oban one was a Fujifilm S9250, Barcelona was a Canon 550D, and the other two were a Sony RX100V. Plus a few different smartphones over that time\n\nI found the difference in quality between my cameras and my phones to be really quite big, but there's no reasons just an iPhone wouldn't work!",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great keepsake. I recently printed 24x36 Posters from my backpacking trip. Still thinking about books myself",
            "score": 1,
            "author": "ivr56"
        },
        {
            "level": 0,
            "comment": "What camera do you use?",
            "score": 1,
            "author": "ASpanishTeacher",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Oban one was a Fujifilm S9250, Barcelona was a Canon 550D, and the other two were a Sony RX100V. Plus a few different smartphones over that time",
                    "score": 1,
                    "author": "The-Smelliest-Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did this for my first big solo trip. Mostly photos, with excerpts from my handwritten journal typed up throughout. Can't wait to do it again for my Japan trip!",
            "score": 1,
            "author": "thefrillyhell"
        },
        {
            "level": 0,
            "comment": "Nice! Much better than those screen savers of Microsoft : )",
            "score": 1,
            "author": "newmankj"
        },
        {
            "level": 0,
            "comment": "where did you get the maps that they're all the same style like that?",
            "score": 1,
            "author": "OensBoekie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used MapBox to create the backgrounds, then screenshotted it and added the markers and such in with photoshop\n\n[This was the style i was using](https://api.mapbox.com/styles/v1/johnfrace95/cjo31flds69b82rpl115x1qyi.html?fresh=true&amp;title=true&amp;access_token=pk.eyJ1Ijoiam9obmZyYWNlOTUiLCJhIjoiY2pucGE2OW1mMGdzZDN4cGZ1bTd3aGNoZSJ9.vCRM0o_sP_O3wT1Kobpx_Q#4.49/54.17/-9.63)",
                    "score": 1,
                    "author": "The-Smelliest-Cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Saw your other comment about it and started on tweaking the default style a bit, thanks",
                            "score": 1,
                            "author": "OensBoekie"
                        }
                    ]
                }
            ]
        }
    ]
}