{
    "id": "cprelm",
    "score": 1638,
    "title": "Currently at the airport - it's beginning to hit me!",
    "author": "xFellowHumanBeingx",
    "date": 1565693202.0,
    "url": "https://www.reddit.com/r/solotravel/comments/cprelm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Flight is boarding.\n\nOne way ticket to New Delhi.\n\nEverything i own fitted in my 38L backpack.\n\nIndefinite amount of time to travel.\n\nNo restrictions, nothing tying me down.\n\nOpen heart, clear mind. \n\nReady for adventure. \n\nFreedom!",
    "comments": [
        {
            "level": 0,
            "comment": "Good luck man, you'll never regret your first solo trip! Mine was to Switzerland and the Alps which was an amazing experience!",
            "score": 254,
            "author": "lewis153203",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mine is to switzerland and alps too! Leaving next week- where did you go/what were the highlights? I have no plans",
                    "score": 64,
                    "author": "augusttrip2019",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mainly stayed in Zurich, but also visited Lucerne and stayed at the hotel on top of Pilatus which was an amazing experience. Hiked up most of the way to Pilatus which was hard but worth it! Never had the chance to go to Geneva although that was the plan, will definitely be visiting at some point though! Naturally Beautiful, clean and traditional country is Switzerland. Pricey but worth it!",
                            "score": 38,
                            "author": "lewis153203"
                        },
                        {
                            "level": 2,
                            "comment": "Here was my my 8 day itinerary:\n\nZurich: \n\nDay 1 - Rhine falls and Zurich City\n\nDay 2 - Pizol Lake hike (fairly difficult but really cool teal lakes)\n\nLucerne:\n\nDay 3 - up Burgenstock (easy hike and pretty) and Lucerne City\n\nDay 4 - Mt Titlis and Engelberg Lake Hike (The lake hike was really really beautiful, not too difficult)\n\nDay 5 - Lucerne and Recuperate from hikes \n\nZermatt:\n\nDay 6 - City and Gorner Gorge and hiking around the city mountains\n\nDay 7 - got rained out of everything \n\nDay 8 - 5 Lake Hike (picture perfect spots for the Matterhorn on a clear day), also hiked back to the city rather than using the lift.",
                            "score": 17,
                            "author": "kilsage"
                        },
                        {
                            "level": 2,
                            "comment": "Lauterbrunnen",
                            "score": 8,
                            "author": "drivingacrosskansas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "LAUTERBRUNNEN. definitely try to make a visit if you can!!!",
                                    "score": 2,
                                    "author": "shaeliloh"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just came back! It’s amazing. We camped in Lauterbrunnen, took the train to Junfrau (train ride alone is worth it, plus if you go in summer there is still snow up there). We went paragliding in Interlaken and did the high ropes adventure park. Took the gondola up to mount Pilatus, it’s beautiful!Plus they have a pretty fun alpine slide up there. Depending where you stay, the main city’s aren’t too far away by train. We were able to go to Bern and Zurich (bear in mind everything is closed on a Sunday, we made that mistake once!). We booked accommodation near lucerne and interlaken, so spent most of our afternoons were spent by the lakes with some wine and cheese. \nSwitzerland was by far my favourite place, I hope you enjoy it too ☺️",
                            "score": 3,
                            "author": "450braise"
                        },
                        {
                            "level": 2,
                            "comment": "It looks like you want to go hiking and people suggested some great ideas already. Generally, going to Grisons, to Lucern/central Switzerland, to the Bernese alps and Valais will give you plenty of hiking options with stunning views too. www.wandern.ch has like, all the information, just not in English unfortunately. www.schweizmobil.ch however does have an English page, as does myswitzerland.com - for the easy inspiration. (I'm not much of a hiker, but I live in Switzerland. Feel free to shoot me a DM if you want some non-hiking specific tips/recommendations!)",
                            "score": 2,
                            "author": "coatofarmour"
                        },
                        {
                            "level": 2,
                            "comment": "I loved the flums area. I stayed at this awesome bed and breakfast in grapplang.",
                            "score": 1,
                            "author": "Adorna"
                        },
                        {
                            "level": 2,
                            "comment": "If you want to stay in the Alps more, there are SO many places to go! Personally, I am in love with eastern Switzerland as it's more old style Switzerland with small towns and homie vibe. There's an amazing place to hike up to from a small town (you can even drive part of the way if you don't want to do the full hike) called Ebenalp, in the region of Appenzell (where the cheese originally came from - Appenzeller). Theres a small hostel/restaurant you can eat at or even stay. I love that place very much in the summer/fall. \n\nAnother one of my favorites is the Säntis. You take a cable car up to the top or hike and the view is breathtaking. Plus at the base there's an old school cheese making store/factory (really small....not really factory) that is amazing. The delicious ripe cheese scent smacks you like a brick wall when you enter....glorious cheese.",
                            "score": 1,
                            "author": "CaCO3_miami"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you very much! I'm glad to hear you had an amazing time during your solo travels :)",
                    "score": 3,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get on that plane, fucker.  \n\nI’m saying it in a fun way, but that’s my only real input.  It’s all up in the air until you are up in the air, and then you’re in no turning back, “bought the ticket, taking the ride” territory.  \n\nI get very anxious before a trip, so browbeating myself into just getting on there is a thing I have to do, and the second the plane’s off the ground is the first moment I can really relax and look forward to the thing I decided to do.  You don’t seem to have this problem, but just in case it’s in the back of your mind, get the fuck onto that plane.",
            "score": 119,
            "author": "tapthatsap",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; It’s all up in the air until you are up in the air\n\nIt's all up in the air until you're past immigration and customs!",
                    "score": 31,
                    "author": "rhllor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My fingers were all sorts of messed up from working at a garden center before flying to India. There's nothing more stressful than not having the finger print scanner work for you at customs. Luckily they pretty much just laughed at me after trying for 10 minutes or so and let me through.",
                            "score": 6,
                            "author": "ImThaired"
                        },
                        {
                            "level": 2,
                            "comment": "I am the most uninteresting person and I still hate going through all that. I just get really anxious about being stopped.",
                            "score": 3,
                            "author": "SheeEttin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you saying they stopped you *because* you didn't have a hotel reservation/return flight?",
                                            "score": 2,
                                            "author": "They_Are_Wrong",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's a similar thing whenever I've been to the USA from the UK. Normally the first question they ask if where your staying and what date is the flight back.\n\nFunnily enough last time I went in June, I've shaved my head so my passport picture is pretty different, I was a bit nervous that it would cause issues but me and the customs guy, who was very close to balding also, just took the piss out of each other while he checked everything haha",
                                                    "score": 3,
                                                    "author": "strodey123"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love your comment haha I'd be the person to give the same advice.\nI got on the plane, I've arrived. No turning back ;)",
                    "score": 3,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love you both",
                            "score": 2,
                            "author": "agree-with-you"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope you have a great time in my country! Stay safe. I've been to Delhi once and immensely enjoyed the food there! Don't forget to try the kesar lassi!",
            "score": 61,
            "author": "madraskaari",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Okay I'll keep Kesar lassi in mind :)",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                },
                {
                    "level": 1,
                    "comment": "Dude...kesar lassi is the bare minimum, TRY THE MANGO LASSI!",
                    "score": 2,
                    "author": "longlivekingjoffrey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m going on my first big solo trip soon in a similar manner! Hope I don’t get homesick or miss my friends!",
            "score": 35,
            "author": "paulloveslamp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both will happen.  Your friends will mostly be where you left them if you aren’t planning on being gone for many years.  You’ll miss some stuff from home for sure, but just like friends, home doesn’t change that much if you’re visiting every so often.\n\nGetting back is *sweet,* too.  You can bring home a bunch of stories and photos and trinkets and consumables that aren’t sold where you’re from, and your cooler friends will want to hear everything that happened.",
                    "score": 50,
                    "author": "tapthatsap"
                },
                {
                    "level": 1,
                    "comment": "I wish you the best with your trip dude! I'm sure if you do get homesick or miss your friends, it'll make it that much sweeter when you reunite :)",
                    "score": 2,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! You too.\n\nI have not much keeping me home these days anyway so i'm guessing I wont miss it too much, looking forward to the next chapter in my life!",
                            "score": 1,
                            "author": "paulloveslamp"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go for it man!!! Remember to say NO to many vendors. It will be a great experience for sure. Being an Indian, I would say if you can manage yourself in India, you can manage anywhere in the world hahaha",
            "score": 41,
            "author": "Sathwikrongala",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remember to say “No thank you” rather than just “no”. :)",
                    "score": 16,
                    "author": "exodotus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes!!",
                            "score": 1,
                            "author": "Sathwikrongala"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And hustle prices from like 20 or 25% ! I thought halfway was enough but even that is way higher than actual prices.",
                    "score": 13,
                    "author": "totally_k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, That's true!! \nBut we are trying to get back our fortune which was taken away by British East India Company 😜 JK!",
                            "score": 15,
                            "author": "Sathwikrongala",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha, I’m with you there bhaee! I’m from South Africa and colonialism got us pretty hard too. Buuuut don’t rip the tourists so hard haha \nAnd at least colonialism left you with trains and good English :)",
                                    "score": 12,
                                    "author": "totally_k",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahaha can't deny!!",
                                            "score": 4,
                                            "author": "Sathwikrongala"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hahaha great advice man!",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey I’m in New Delhi at the moment! Be prepared for amazing sights, sounds and smells!",
            "score": 30,
            "author": "funkkay",
            "replies": [
                {
                    "level": 1,
                    "comment": "And also the opposite. Delhi is brutal for the first days till you get used to the pace of things",
                    "score": 13,
                    "author": "Wiggly96",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’m a pretty seasoned traveler but I was not ready for the intensity of India. The smells and sounds are relentless. Go into your trip knowing this, embrace it, and you’ll have a great time.",
                            "score": 3,
                            "author": "Chris_Hansen_AMA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you’re not into all three, you’re not going to cities correctly.",
                    "score": 6,
                    "author": "tapthatsap"
                },
                {
                    "level": 1,
                    "comment": "I'm prepared! Loving it :)",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hit me up if you need any help, I live in Delhi.",
            "score": 12,
            "author": "I_KnowThings",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "HAVE FUN!! I’m so stoked for you — solo trips are always simultaneously terrifying and exhilarating, but always always memorable! You’ll always end up having either a great time or a great story.",
            "score": 5,
            "author": "ediblepetals",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;You’ll always end up having either a great time or a great story.\n\nThat is so true.",
                    "score": 3,
                    "author": "neuron-"
                },
                {
                    "level": 1,
                    "comment": "Haha I love this, great time or a great story, very true:) Thank you",
                    "score": 3,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once set out to see the world. Went to several countries. Met tons of people.  Went on some amazing adventures. Yet didn't really find that elusive freedom that I was so deeply craving. Wherever I went, whatever I did - There I was! Then a light bulb  turned on in my head. I realized that the path to true freedom is not outside in the world but within. So began my journey into myself. I am more free now working a 9-5 job than I ever was travelling the world. No longer a slave to my mind, I am (In Yoda's voice) :p\n\nHaving said that...nothing like the feeling of starting an amazing adventure! Good luck amigo!",
            "score": 6,
            "author": "desimaalbruaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "'I' hear 'you'. Keep sharing your story with people to remind them :)",
                    "score": 3,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your reply makes me happy. Reminds me of a Ram das story - he ducks out of work to beat the after work rush. Runs down the subway stairs and gets to the bottom, turns and sees a sign saying 'This ain't the way'. Starts making his way back up and by now the after work crowd is starting to make its way down the stairs. He tries to tell them that they are going the wrong way but to no avail. His progress is slow going against the sea of people rushing down the stairs. But once in a while, someone makes eye contact with him. Understands him. So much said while saying so little. Happy trails bud and thanks for your reply.",
                            "score": 2,
                            "author": "desimaalbruaa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoy!!\nSmall tip as well: If you want to book train tickets at the New Delhi train station, make sure you go into the train station and walk up the stairs to find a tourist bureau office where you'll be able to book train tickets that are reserved for foreigners. Lots of people may try to scam you on the way but just keep walking!",
            "score": 10,
            "author": "bowsheron",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great advice, thank you so much :)",
                    "score": 1,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also redbus.in is a great website to use to book buses. Much cheaper to do it yourself compared to going to a tourist agency :)",
                            "score": 1,
                            "author": "bowsheron"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently on my trip, safe travels &amp; amazing adventures fellow human being",
            "score": 9,
            "author": "DBsaidwhat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much fellow human being! Hope you're enjoying your trip and having the time of your life",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m heading to New Delhi in couple weeks! Can’t wait to experience India :)",
            "score": 7,
            "author": "Mlrk3y",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its awesome, I’d advise to be very firm with the touts, they never take no for an answer lol, they drove me mad!",
                    "score": 2,
                    "author": "zalupanavorotnik"
                },
                {
                    "level": 1,
                    "comment": "Good luck and have fun :)",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy travels!\nI’m an American living in South Delhi right now and it’s been an incredible experience so far.",
            "score": 9,
            "author": "anhug",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm in Hauz Khas atm! Love New Delhi",
                    "score": 3,
                    "author": "Jayhcee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just a couple metro stops away! I love it here!",
                            "score": 2,
                            "author": "anhug"
                        },
                        {
                            "level": 2,
                            "comment": "Wow well done! Take care of yourself, as in don’t go to secluded places at night and remember to have fun!",
                            "score": 1,
                            "author": "catodi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have fun! My advice: Take your time! You don't need to see everything, so don't beat yourself up if you miss something :)",
            "score": 12,
            "author": "imroadends",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great advice! I found the best things happened when I just relaxed and took my time. Also, I wasted a lot of time thinking about what I could or should be doing rather than just being where I was. Other people will always try and and connect based on the cool experiences they had and sights they saw, but that doesn’t make your experience any less valid or interesting.",
                    "score": 6,
                    "author": "totally_k"
                },
                {
                    "level": 1,
                    "comment": "Loved this! Thank you :)",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to the club may find friends, find food and freedom that most normal humans will never know.",
            "score": 7,
            "author": "drqxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please please please, go south of India.\n\n(note: monumental rains pouring down though, should be fine in a couple of weeks)",
            "score": 10,
            "author": "sriramineurope",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally, the food I had in Chennai was astonishing, and people are very warm down south! Kerala is amazing!",
                    "score": 1,
                    "author": "zalupanavorotnik"
                },
                {
                    "level": 1,
                    "comment": "I've had a few messages about heading south! I've been to India twice before this but have spent my time up north. I'll be here for a few months so once the monsoon dies down I'll consider heading south as people seem to have really enjoyed their time",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck and enjoy it! Many people would love to be doing just that right now, me included. Have fun!",
            "score": 4,
            "author": "zzz_red",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you :) I hope you can make it happen (or happen again) soon",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What fun! Big adventure! Remember that with those exhilarating peak experiences, you will also have some valleys. Remember to be kind to yourself and build in some rest days. \n\nEnjoy the ride.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wise words, thank you!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reading this just gave me chills... it's super exciting! I hope you have an amazing time!",
            "score": 9,
            "author": "tinmanbyamerica",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I'm sure you know the feeling i described!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Delhi is a great place to throw yourself into a long travelling adventure. Enjoy.",
            "score": 3,
            "author": "RedHeadRedemption93"
        },
        {
            "level": 0,
            "comment": "India is amazing, just went this year. Take your time and experience the culture as much as possible!",
            "score": 3,
            "author": "sashammie"
        },
        {
            "level": 0,
            "comment": "Giddy up! Enjoy the way. Remember you can be anyone you want to be. The pen is yours. Write your next chapter.",
            "score": 3,
            "author": "onemanfromaustralia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very awesome words my friend! I'm writing it with every breathe and every move ;)",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hook up to that airplane wifi and watch Karl Rock videos on YouTube until you get there! lol",
            "score": 3,
            "author": "LurkBrowsingtonIII",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I've been watching a bit of Harald baldr and bald and bankrupt as well, love it",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have never been to New Delhi! Please do another post, OP, and tell us how it is!\n\nBest of luck!",
            "score": 3,
            "author": "4ananas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will for sure in the coming days:)",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to [atlasobscura.com](https://atlasobscura.com) and you'll find so many hidden gems and amazing places to see in India. India is probably one of the most underrated historical countries and country with the most amount of hidden gems in the world. The architecture of all the temples and palaces are a must.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I will check it out",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't shy away from Indian food. It's amazing.",
            "score": 3,
            "author": "spypower2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loveeeee Indian food, definitely won't be shying away haha",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you've done a little homework, everyday in India will be an enjoyable challenge.    \n\n Don't be afraid to change up from the back pack.   \nI spent nine months solo there. You won't understand the heat until you arrive. The experience of moving about in the heat with that pack on my back soon had me looking for alternatives. I changed to trolley pull bag and could enjoy the travel experience a lot more.    \nThere's no shortage of people to load or carry your bag when you're on the move. You really don't need a backpack in India (maybe a small one for shopping is all). Have fun.",
            "score": 3,
            "author": "disposabelleme"
        },
        {
            "level": 0,
            "comment": "Welcome to India.. hope you have an amazing time !",
            "score": 3,
            "author": "amazingman_"
        },
        {
            "level": 0,
            "comment": "Just left New Delhi yesterday. You’ll leave soon too haha",
            "score": 3,
            "author": "ryanl23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where you heading?",
                    "score": 2,
                    "author": "TroopersSon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "8 days in Bhutan and then back to the US for work sadly",
                            "score": 1,
                            "author": "ryanl23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn sounds lovely! Enjoy!",
                                    "score": 1,
                                    "author": "TroopersSon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is going to be me very soon.  I’m also very open ended as I’ll have remote work to do to cover my costs.  I’m excited and scared at the same time!\n\nWhere all are you planning to go (if you have a plan)?",
            "score": 2,
            "author": "whib96",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds great! What remote work do you do?\n\nI don't have a plan yet, figured I'll go where the wind blows haha most likely head up north to Pavarti Valley, but open at this stage to what comes my way :)",
                    "score": 1,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will be some data analytics stuff, among other tasks needed to be done.  But yeah, I have a very loose plan...kinda thinking the same thing as you.   Never been in a hostel but I’m excited for it.  It will be adventurous and hopefully just a nice detox.",
                            "score": 1,
                            "author": "whib96"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be safe!",
            "score": 2,
            "author": "massgirl1"
        },
        {
            "level": 0,
            "comment": "Go go go!",
            "score": 2,
            "author": "Zooroaster"
        },
        {
            "level": 0,
            "comment": "Varanasi is pretty mind blowing. And in the North you can live in a cave for a few months. That’s an experience for sure.  \n\nThink India is such a mind blowing time, you can get yourself into life and death experiences fairly easy. Right now, myself, would try to get into Kashmir. \n\nReport back, what’s the scoop there. That’s a mission for sure. Your photos could pay for your next experience if you make it out alive.  \n\nLife is so short, make it an experience.  :-)",
            "score": 2,
            "author": "ejpusa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll definitely visit Varanasi, not sure if I'll head that far north to Kashmir but I'm open to what comes my way :)\nThanks for the comment my friend",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That sounds pretty darn amazing!! All the best!",
            "score": 2,
            "author": "jane_avril"
        },
        {
            "level": 0,
            "comment": "Yooo I did the same almost one month ago.  Came to London and have just been cruising around the country! It's amazing!!",
            "score": 2,
            "author": "Softmessagex"
        },
        {
            "level": 0,
            "comment": "welcome to you in India. A lot of things is here, you can explore. Also, you can use Couchsurfing for stay. Good luck for  Indefinite amount of time to travel.",
            "score": 2,
            "author": "Fresh_Example"
        },
        {
            "level": 0,
            "comment": "I got butterflies in my stomach reading this! Go have a blast!",
            "score": 2,
            "author": "sigdiff",
            "replies": [
                {
                    "level": 1,
                    "comment": ":)",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck to you! I did lots of solo travelling around Southern Europe over the last couple of years. It was a brilliant experience, and certainly changed my life. Good luck!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Firstly, welcome to India. I did my first solo trip at Europe for a couple of weeks and I would give anything to go back to those times.   \n\n\nWishing you a roller coaster of fun and adventure. I'm from southern part of India called Chennai and DM me for any possible help you need whilst your stay !",
            "score": 2,
            "author": "Evil333",
            "replies": [
                {
                    "level": 1,
                    "comment": "My first experience in India was this year, two months living in Chennai. I liked it!",
                    "score": 1,
                    "author": "SWentley"
                },
                {
                    "level": 1,
                    "comment": "Thank you:)",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "India is incredible! I'll never forget seeing a camel pulling a cart with a brand new refrigerator in it! Memories!",
            "score": 2,
            "author": "MickLittle"
        },
        {
            "level": 0,
            "comment": "Imagined myself saying that and I got all giddy and excited. The possibilities!",
            "score": 2,
            "author": "iioonnaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Staring into the infinite!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where are you staying?! Stay at Madpackers. Best hostel I've stayed in.",
            "score": 2,
            "author": "Jayhcee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I'll check out madpackers",
                    "score": 1,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm actually here right now haha",
                            "score": 1,
                            "author": "Jayhcee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck! Literally booked my flight to Mumbai in a month today! Nervous but very excited!",
            "score": 2,
            "author": "SupremeLeaderE"
        },
        {
            "level": 0,
            "comment": "Hell ya! Enjoy the ride!",
            "score": 2,
            "author": "Jetnation24"
        },
        {
            "level": 0,
            "comment": "Congrats, Good Luck and Stay Safe!",
            "score": 2,
            "author": "Naturally_Smitten"
        },
        {
            "level": 0,
            "comment": "I didn't realize I was going anywhere until I was halfway there, over the ocean. Just looking at the seatback in front of me \"wow, this is really my life right now. huh. wild.\"",
            "score": 2,
            "author": "nicholt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Incredible realisation to have!",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing!! Welcome to delhi. DM me if you need any assistance or want to have a cup of coffee. Enjoy the trip!!!",
            "score": 2,
            "author": "ujjwalwahi"
        },
        {
            "level": 0,
            "comment": "Did the exact same thing, had an amazing trip but get a proper cap at the airport because I got scammed by my cap driver",
            "score": 2,
            "author": "chhhhristian"
        },
        {
            "level": 0,
            "comment": "Nice. Congrats. My open ended trip to asia starts next Monday. Crazy times",
            "score": 2,
            "author": "elliotep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good luck and have fun!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck! I am so jealous.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "same for me bro..i had covered shimla-manali-kasol-spiti valley-dharamshala-haridwar-rishikesh-agra for 1 month..manali is a must..leh ladakh i missed because road was road and its really beautiful especially bike ride there in ladakh..even north east india is beautiful...many tourist go to nepal from north india..even bhutan but it may be a bit expensive for non saarc countries..all this will take around 4 to o months depending how long you wish to stay at a place..select a cheap hostel for a up and use public transport..cheers bro and have a safe travel !!",
            "score": 2,
            "author": "bharat03",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am leaning toward heading to Pavarti Valley area and doing similar path to you. Thanks man!",
                    "score": 2,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "cheers bro !",
                            "score": 1,
                            "author": "bharat03"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck and have a great adventure! How are you able to afford this? I want to do something similar, but I want to know whether I should save enough money for a year or get a online freelancer job",
            "score": 2,
            "author": "congas415",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done 2 long term solo trips before, always on a shoestring budget. I've found it quite easy to average around 15-20 USD per day.\nSo I personally use saved up money rather than online work.",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "clear eyes, full hearts, can’t lose",
            "score": 2,
            "author": "NewYearsD",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know it, fearlessness.",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, Delhiite here, give hygiene the top priority when looking for food, especially in monsoon season. \nHit me up if you want some recommendations. Enjoy your trip!",
            "score": 2,
            "author": "theindianhybrid"
        },
        {
            "level": 0,
            "comment": "Yessssss!!! So jealous!! Tryna get back to India when I can!!",
            "score": 2,
            "author": "samuelveritas"
        },
        {
            "level": 0,
            "comment": "My envy is deep, stay safe and take every opportunity you can! Have fun!",
            "score": 2,
            "author": "Moedig25"
        },
        {
            "level": 0,
            "comment": "Don’t drink tap water! But you probably know this.",
            "score": 2,
            "author": "crazed_again"
        },
        {
            "level": 0,
            "comment": "You are going to have the time of your life.   \nBack in 2014, I had my first solo backpacking traveling. I was young and curious. social and anxious.   \nI was traveling for 1 year eventually. I had adventures that in the hard time, when I am down - those adventures remind me why we living for, and how lucky I am to be brave enough to try.   \n\n\nI send you my bless,  \nLet yourself be yourself!!",
            "score": 2,
            "author": "GlobalCitezen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the beautiful words!",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm from New Delhi. Do you need any recommendations or anything?",
            "score": 2,
            "author": "ilovegirlsinheels"
        },
        {
            "level": 0,
            "comment": "Quick question for everyone.  Does it count as “solo travel”. If you go there alone but when you arrive you’re meeting business people you are there to see but don’t know them at all?",
            "score": 2,
            "author": "KB3488"
        },
        {
            "level": 0,
            "comment": "Enjoy, open up, soak it all in, and leave plenty of room for spontaneity and random events/encounters!\n\nMy first solo trip was to India as well. Five weeks, and particularly fell in love with Varanasi and Dharamsala. There are a hundred other cities I'd still love to see as well.",
            "score": 2,
            "author": "banyanoak"
        },
        {
            "level": 0,
            "comment": "Welcome to India. You're in for an insane treat. Keep an open mind and stay safe. Feel free to hit me up if you need anything.",
            "score": 2,
            "author": "khantaloupe"
        },
        {
            "level": 0,
            "comment": "Don't worry if in a couple of days or a couple of weeks your mood changes or even does a 180. It doesn't happen to everyone, but it's pretty normal. Just remember that travel is still life. Everything you've always felt, you'll still feel.",
            "score": 2,
            "author": "koottravel"
        },
        {
            "level": 0,
            "comment": "FYI, it may still take 2 weeks to a month to truly break that feeling that you need to be somewhere or that you need to do something every day.  To truly get into the groove of traveling.  What’s the longest you’ve gone without an alarm clock!?   How long has it been since the most important decision in your day is whether or not to have the chai or coffee.   \n\nGood luck out there.  It’s a wonderful world.",
            "score": 2,
            "author": "indigothirdeye"
        },
        {
            "level": 0,
            "comment": "Enjoy the freedom!",
            "score": 2,
            "author": "traveljg"
        },
        {
            "level": 0,
            "comment": "Be the ball.",
            "score": 2,
            "author": "el_ojo_rojo"
        },
        {
            "level": 0,
            "comment": "Insanely envious, have fun!",
            "score": 2,
            "author": "GSA990"
        },
        {
            "level": 0,
            "comment": "I'm doing the same, but heading to Iceland",
            "score": 2,
            "author": "bridge220"
        },
        {
            "level": 0,
            "comment": "All the best dude! Positive attitude, openness and following your intuition will lead the way.",
            "score": 2,
            "author": "ESWAE-LDN"
        },
        {
            "level": 0,
            "comment": "Congrats! I hope you enjoy your time there. Pretty hot right now, but it will cool down.",
            "score": 2,
            "author": "someLinuxGuy1984"
        },
        {
            "level": 0,
            "comment": "You're going to experience a lot of ups and downs, but ultimately you're going to have a wonderful time.",
            "score": 2,
            "author": "kingmakyeda"
        },
        {
            "level": 0,
            "comment": "Have a blast!!!!!",
            "score": 2,
            "author": "lisaNY1965"
        },
        {
            "level": 0,
            "comment": "Mine was hawaii",
            "score": 2,
            "author": "TheSaiyajinTraveler"
        },
        {
            "level": 0,
            "comment": "GO GO GO GO GO!\n\nEnjoy the heck out of your freedom, the adventures, and your life.",
            "score": 2,
            "author": "99Sienna"
        },
        {
            "level": 0,
            "comment": "Good job. You won't regret a thing and if things get tough, hang in there. It will all be worth it in the long run.",
            "score": 2,
            "author": "Solo_Wanderluster"
        },
        {
            "level": 0,
            "comment": "Everything you own? How does one make this adventure into a lifestyle?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found that by removing my depency upon / attachment to, other people and things, I became fearless. With that, I realised that I am free and that tomorrow isn't guaranteed. So I figure, why not go hard right now and live the adventure?",
                    "score": 1,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree but I mean like eventually I'd run out of money. How does on mitigate that?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I let the future version of me worry about that.",
                                    "score": 1,
                                    "author": "xFellowHumanBeingx"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck I want that",
            "score": 2,
            "author": "evil_fungus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Take it.",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First solo trip and you going to New Delhi?\n\nBold move, let’s see how it unfolds.\n\nGood luck",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good luck on your bro! One way ticket is a dream for a lot of us i guess Have fun !",
            "score": 2,
            "author": "takiskanab"
        },
        {
            "level": 0,
            "comment": "Good luck and enjoy this experience of a lifetime. This kind of post fills me with happiness and excitement for you!",
            "score": 2,
            "author": "herbert_camacho78"
        },
        {
            "level": 0,
            "comment": "I envy you m8. A finanacial setback pushed back my plans. Positive side is I have more time for research!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If you have time, do plan a trip down south. Go visit Bengaluru - my hometown :) . Take the Rajdhani Express train from New Delhi. It's gonna be a ride of your lifetime, I promise :)",
            "score": 2,
            "author": "rakeshk24",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally agree! The south has a completely different vibe than the north. The food is completely different too! If you're staying up north, I would recommend visiting Varanasi. It can be a little overwhelming at first but if you survive Delhi, you'll be fine! I lived in Varanasi for a year :)",
                    "score": 2,
                    "author": "mountainmaud11"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's gonna be amazing!!! \n\nIt's New Delhi, so beware though. Most stuff isn't actually as expensive as those guys will tell you.\n\nBut yeah, it's gonna be an amazing experience!!",
            "score": 2,
            "author": "rohmish"
        },
        {
            "level": 0,
            "comment": "Me too!!!",
            "score": 2,
            "author": "thatjc"
        },
        {
            "level": 0,
            "comment": "Cool, that's a real happinness",
            "score": 2,
            "author": "FreeMe_underTheSun"
        },
        {
            "level": 0,
            "comment": "I went for my first solo trip in Zanzibar in February... For those who don’t know it’s a island in the east side of Africa l. Results: perfect trip, nice people, I’ve enjoyed every single minute of it!!",
            "score": 2,
            "author": "janamalyyy"
        },
        {
            "level": 0,
            "comment": "Good luck! \n\nBreath, take it all in. And give yourself time to adjust. Delhi is hard to adapt to if you are not used to it. I experienced culture shock the first time (first time out of Europe to be fair). Took me a couple of days to get used to the heat, humidity, chaos. \n\nBut once I took some time to chill (and wore sunglasses to avoid making eye contact with every guy selling something) I really loved it. Special memories of a Chat house for breakfast every morning. \n\nJealous!",
            "score": 2,
            "author": "i_am_phil_a"
        },
        {
            "level": 0,
            "comment": "Best of luck man. Welcome to the home of Mughlai cusine. Culture, food and vibrance are the takeaway.\nP.S. Do visit the forts and Agra nearby.",
            "score": 3,
            "author": "khamzah22"
        },
        {
            "level": 0,
            "comment": "Delhi is gonna be hot as fuck",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cleanest air in August? Or cleanest air in India? Have things changed in the last few years?",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This made my Reddit day OP 😁 \nThank you for sharing this!",
            "score": 2,
            "author": "035790",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love it!",
                    "score": 2,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Indefinite amount of time to travel.\n\nHoly moly, I'm so jealous.\n\nDo you have an idea of where you want to go, or are you winging it?\n\nHave fun!",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm just winging it! I'll probably make my way up north, for the time being I'm just going to chill at a hostel in Delhi, explore a bit and meet people, see where the road leads :)",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please don't spam.",
                    "score": 1,
                    "author": "peachykeenz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, what's in the bag?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A weeks worth of clothes, toiletries and a phone charger. Carrying about 8kg",
                    "score": 1,
                    "author": "xFellowHumanBeingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoy your experience in India. It's challenging but very spiritual and enthralling. I'm from Southern part of India. If you need any advice on anything regarding India just drop me a message, I'm happy to help.\n\nHave a great adventure!",
            "score": 1,
            "author": "The_crow_from_heaven"
        },
        {
            "level": 0,
            "comment": "WOOOOH! Living vicariously through you!",
            "score": 1,
            "author": "Wetstocks"
        },
        {
            "level": 0,
            "comment": "Budget is a restriction... Just saying",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why New Delhi?",
            "score": -2,
            "author": "Jazeboy69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably cheapest and most common route into India. Also very central so it's 12-18 hours train from everything. Himalaya's to the North, Rajastan desert west, mumbai south, goa beaches south , taj mahal SE, ganges varanasi east, Nepal a little north of varanasi etc",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "That's where the cheapest flight to India was landing",
                    "score": 1,
                    "author": "xFellowHumanBeingx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok cool. Have fun. How long are you spending there?",
                            "score": 1,
                            "author": "Jazeboy69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure really, probably a couple of days.",
                                    "score": 1,
                                    "author": "xFellowHumanBeingx",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}