{
    "id": "h8jl2q",
    "score": 1502,
    "title": "Advice from a solo introvert traveler with anxiety",
    "author": "HelixTheCat9",
    "date": 1592095061.0,
    "url": "https://www.reddit.com/r/solotravel/comments/h8jl2q",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an introvert and I have anxiety about new things, but most of my acquaintances  would never believe it.\n\nI once bought a $7 hotel room in the middle of no where China (\"cabbage with engine oil\" on the English room service menu), taken a train to get there using my horrible Chinese and amazing miming skills, ate breakfast smacking and sucking my teeth like a local to show appreciation, and had a fabulous time (even if most breakfast dishes had fish in them ugh). I have also gone out of my way to go to a restaurant I already know or spent an hour on my phone looking at reviews, just so that I'm not going into a restaurant blind. A restaurant. In America. In English. \n\nThis will be a rambling talk on solo travel, taking chances, fear and anxiety, joy, an introvert talking to strangers, and whatever else comes up. \n\nI have now traveled to 26 countries, 11 last year, on 6 continents many of them alone, and I Still get sweaty palms thinking about catching a bus without knowing how/how much/what to pay. The internet is a godsent crutch for these things, but I'm very slowly working on just winging it. Sometimes people are impatient for a minute but then the encounter is over! No harm done, no matter how silly/idiotic you look or sound. Sometimes, it breaks the ice and there is a fun moment. Like in Australia, a guy shouted \"bike coming through\". I went to step to the right out of habit, but then froze, \"Is it right in Australia or left?\". I made my self as small as possible like a hare with an owl nearby. I must have said the last bit out loud, because he stopped, and we had a conversation (it's left), then we had a beer together at a local watering hole. He also recommended cane toad racing that night where I proceeded to be paid in beer to be a rather unfortunately distracted scorekeeper. Good times.\n\nI am an introvert, in that I recharge alone, but with effort I'm also fairly outgoing. To make travel work without loneliness, you have to/get to break out of your shell and meet new people. You don't get to stay in the comfy bubble of your travel companions. From ladyboys in Bangkok, to Irish rugby fans in Hong Kong, to a young Chinese boy in Chongqing so excited to practice his English; you can learn and grow by meeting others. It's amazing, horizon opening, and EXHAUSTING. It's still hard for me to break into a group or conversation without an opening. The random Norwegians on my Spanish sailing outing? Sure, we have a reason to talk as we share a cheese plate! We chatted, then ended up meeting their other friends for hookah and Persian food. The idea of just walking up to a stranger to see if they want to hang out? Kill me now. Even a cold phone call to order a damn pizza gives me anxiety, let alone approaching a stranger. I'm working on it. \n\nThe most important thing with meeting new people, is to try to move from \"how are you\", weather, bs, as soon as possible and get to deeper conversation. Sometimes, I'm good at this but sometimes I'm not. I'm currently reading I'm Sorry I'm Late, I Didn't Want To Come, about a shy introvert pretending to be an extrovert for a year. She covers a lot of these topics but spends a lot of time on asking real questions and trading real information. No one likes the \"ya, fine, ya fine\" conversation. I recommend her book, especially if you are shy as well as introverted. \n\nAllowing myself to be silly and curious has really helped with my joy in life. Dress up for the party! Put on war paint! Dance! Turns out most people are just waiting for \"permission\" to do things themselves or at least admire you for doing so. Really, what's the last embarrassing thing that you remember someone ELSE doing? I'll wait. \n\nThere is a lot of joy in my life, but there is a lot of forcing it. Forcing myself to get out of bed, out of the door, scheduling/committing to things I'm not sure about (sometimes without allowing myself to think about it too much), and putting myself in situations where I HAVE to go spread my wings. It doesn't feel natural or comfortable, especially when anxiety manifests as exhaustion, but I almost never regret it. A lot of people say \"I wish I could...\" to me, but they usually, well, don't, at least not enough to put the work in. I once met a guy who was a white water rafting guide during the summers (3-4 months), said he made his own clothes, ate out of garbage cans, and saved every penny so that he could backpack around thailand every year without working for 8-9 months. Obviously this is an extreme example and has some serious drawbacks, but if he can make \"it\" happen, so can you. What do you want and how much do you want it??\n\nAll of this brings us to now, as my anxiety has me procrastinating HARD. I am glad that my job of 9 years has laid me off. It was the kick in the butt I needed, and I KNOW there's so many great adventures, a more interesting job, new friends (while keeping the old), etc. I attempted to quit last year for this very reason (they talked me into a sabbatical instead). I'm even in a financial situation to allow me to explore and enjoy. I'm ECSTATIC... and terrified. I'm finding zero motivation to wrap up the last bits of work, build my resume, and pack; because, damnit, then I have to do it. I'm afraid of failure, of being somewhere I hate, not finding a job, losing all of my friends and dying alone. Yup. I'll get it done because I always do, way more last minute than necessary, more anxiety than necessary, but it'll happen.\n\nI don't know if anyone is still reading this, but I hope it inspires someone to give something a shot. An amazing life doesn't just happen, its not luck, or even a personality type. The people you see gallivanting the world don't have it as easy as they make it look (or maybe not at all with Photoshop). Also, if you're genuinely happy staying home and doing your thing, good for you. We need all types. This is aimed at someone who ISN'T happy, who is in a rut, lonely... Take a chance. Don't settle. Force it and keep forcing it. Wring every drop out of life's anxiety-inducing neck whether that means quitting your miserable job, taking your first solo trip, or moving to China (I've done all of these). \n\nLove to all. Good luck!\n\nEdit: Wow! Thanks for the gold and all of the awesome comments. The book also suggests being vulnerable, so here I am and here are all of you. Hugs!",
    "comments": [
        {
            "level": 0,
            "comment": "Oooh fellow introvert traveller here. I find that I am much more open when the chance of embarrassing myself in front of people I will see again is reduced. When I’m across the world, it definitely helps those chances. The same reason is why I travel alone; I love my friends but the stresses of travel make me afraid that it could cause us to have quarrels that would not be ideal when you’re stranded with no one but each other. They also have a biased opinion of me and I am more afraid to break out of my shell with them around. \n\nBut when I’m alone, I can approach random people and be as open as I want because I’ll probably never see them again. So when I’m at a hostel, I’ll make friends with everyone in the room and grab a few drinks or meals together and it’s truly great fun. You get to share each other’s experiences and personal favourites. \n\nBig thing also is that it’s much harder to integrate into local culture when you bring your home culture in the form of people. Sure you’re more comfortable around people you know, but you’re not exactly forced to blend in as much since there is nothing pushing you to speak to people or try new things.",
            "score": 80,
            "author": "ReasonableBeep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point! The anonymity part definitely makes it easier, though I still challenge you to remember the last time a coworker or vague acquaintance did something embarrassing. No one cares that much, too wrapped up in their own stuff. (Tell that to the anxiety lol)\n\nHave you ever talked to your friends about things that don't fit their idea/mold of you? It could cause you to grow apart, but it could cause you go grow together more too as you admit to \"weird\" likes. \n\nEither way, you're right, no matter how close or open your friends are, its a MUCH different experience traveling without them, eating when you want, ready to jump on whatever opportunity. \n\nI've always avoided hostels because its usually only a few bucks more to get an airbnb room and I can go recharge and get a good night's sleep. I think I'm missing out on the community though. Next appropriate trip, its a goal to try it at least once.",
                    "score": 24,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah I definitely need to work on my relationships. But the common denominator is me and I don’t want to be the reason friendships falls apart. When I’m in a bad mood, I can have a short temper and take it out on others around me so I try to limit my exposure when I’m having a bad day. But I’m working on it! \n\nI definitely love the spontaneity being solo brings on trips too. Everything is up to me; even if I originally had a major attraction planned and had tickets payed for and everything, I’m the only one it affects if I were to change plans so it’s great. \n\nI definitely prefer airbnbs for comfort but I actually love hostels because everyone there is so open and friendly to others since many are also solo. One of the best experiences I had was at the generator hostel chain; it’s basically like a hotel size building and it is very clean since they have a reputation. Many of them also have rooftop bars so it’s great to meet people! Hostels are a definite must try when travelling solo",
                            "score": 8,
                            "author": "ReasonableBeep"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Next appropriate trip, its a goal to try it at least once.\n\nYou can also book private rooms in hostels nowadays. They're more common now.",
                            "score": 1,
                            "author": "Takiatlarge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're always more than a hotel room somehow. At least every time I've seen it.",
                                    "score": 1,
                                    "author": "HelixTheCat9"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the post! I just saved the quote from Anthony Bourdain ‘I understand there’s a guy in me that wants to lay in bed all day, smoke weed, watch cartoons and old movies. My whole life is a series of stratagems to avoid and outwit that guy”\nI will check out the book!!",
            "score": 307,
            "author": "pmiller61",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a great quote! Thanks for sharing. What a cool guy. I wish he could have outwitted the monkey on his back.",
                    "score": 64,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. I saw this quote on the anniversary of his passing. And I was thinking..maybe he tried too hard . Life’s a struggle no matter what tho.",
                            "score": 24,
                            "author": "pmiller61"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This post is inspiring and indeed a must read for every introvert soul and looking for a solo travel in their life. \n\nAfter a broke up with my 10yrs SO, I'm planing a trip to Eastern Europe and Turkey to get pass this. I'm living in Asia. Not a native English speaker, with broken English, I always feel shy when talking to local person (Always think I will bother them). Your experience is very valuable to me, it ease my certain anxiety of travel alone. Thank you!",
            "score": 24,
            "author": "blizingtime",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is a quote in the book, \"no one waves, but everyone waves back\". Almost everyone want to talk to you/someone if they aren't busy. You're a traveler. You're \\*interesting\\*. Do it!!! I hope you have a wonderful time &lt;3. It's the same way I got over my long term relationship breakup. Great choice.",
                    "score": 23,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly this post must be a sign from the universe. Just got out of a relationship with \"the one\" and really feeling to urge to travel but I now have no one to go with. Time to plan a trip.",
                            "score": 9,
                            "author": "_Ginger_Beef_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m with you! This is yet another sign for me. I too have recently ended what I thought was “my one” and have had nothing but signs the past few days to pack up and head off on a solo trip with the dog. I’ve been fighting it as I have never done anything like it! And as someone who was once extremely extroverted and currently the opposite, the thought is terrifying but I also suspect it is exactly what my soul needs.",
                                    "score": 4,
                                    "author": "NaughtyNellie9"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for sharing. I can totally relate. I have diagnosed GAD and depression but travel as often as I can afford. I lived by myself in Greece and volunteered for 3 months plus took many weekend Europe trips. My mom said “you are so anxious, how do you do that?” And my answer is... that’s how much I love to travel. I’ll literally torture myself with anxiety because once I’m traveling, I have never felt better or more alive. Traveling is anxiety inducing for me but so incredibly worth it. And has also helped me overcome anxiety and perfection tendencies- I am learning to go with the flow! \nAgain, thanks for your post! I’m really glad you brought this to light.",
            "score": 20,
            "author": "notdumbjustpanicking",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so glad that it's helped you! Once I'm out there, my anxiety tends to decrease too. Not quite down to my usual routine levels, but better than when I'm planning/thinking about the trip. \n\nLearning to go with the flow is SUCH a valuable skill. Still working on that. I sorta managed it in Spain last year. I had a week to get from Barcelona to Lisbon. Each night I figured out where I was going the next night. It was fun but it was exhausting too.",
                    "score": 7,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is beautiful, and really spoke to me because I too am the last 5 words of your title. I actually started my solo travels as a way to conquer my social anxiety. My first trip was when I was 18, and I got lost in New York City for 6 hours until I built up the courage to ask for directions (of course when I mustered up the courage they didn’t even speak English!) I eventually found my way. \n\nMy second trip was to San Francisco, where I came better prepared and struck luck when I stumbled across the ticket booth for Alcatraz. I waited for half an hour in line and got the last ticket of the day. If I had been traveling with someone I wouldn’t have gotten to go! \n\nA solo trip near and dear to my heart was a hellish train trip from Portland, Maine to Los Angeles in January. A 3 day trip took 5. \n\nThank you for sharing your journey.",
            "score": 20,
            "author": "hollowsofmymind"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "...and here I thought I was alone...\n\nHow did you like Cambodia? I LOVE Thailand, and Cambodia is high on my list. Highlight?",
                    "score": 3,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cambodian highlights for me: Angkor Wat and the Kep crab market.  Enjoyed your post.  I also think that it's easier to find a reason for a conversation while travelling.",
                            "score": 3,
                            "author": "baskaat"
                        },
                        {
                            "level": 2,
                            "comment": "It’d be awesome to find some physical way to identify each other as introverts! We’d all be instant friends. Or not!!!",
                            "score": 2,
                            "author": "pmiller61"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "💜 This is beautiful! I can relate so much - the bit about taking an hour to read google reviews before going into an American restaurant is so me, but when I travel I’ll just show up. \n\nI started reading “Sorry I Was Late; I Didn’t Want to Come” over Christmas break but didn’t get past the first chapter. Ill have to pick it up again. \n\nGood luck on your travels!\n\n(Also, when are you going to hit that 7th continent?)",
            "score": 32,
            "author": "dkailer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good question! I planned a trip to Torres del Paine in southern Chile at the end of the year, it's on standby now of course, and I was considering a cruise to Antarctica, but it's so expensive! More than 5k for a bare bones cruise even once you're down there. \n\nI'm much prefer doing than just watching. I don't want to just check the box, so I'm going to wait until hopefully something comes up where I can volunteer on a research vessel or something. Fingers crossed.",
                    "score": 12,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you come to Buenos Aires shoot me a DM and I'll tell you absolutely everything there is to know about this city.",
                            "score": 7,
                            "author": "grigial",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Will do! Bariloche is one of my favorite places on earth (lived there for 6 months or so) so I will more than likely go through Buenos Aires on one end of the trip or the other.",
                                    "score": 2,
                                    "author": "HelixTheCat9"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know of an acquaintance that hung out in Puerto Natales for a few weeks and got to join a resupply mission from the Chilean Army.. However, she was very much the extrovert and I suspect flirting with the officers in the bars (not to get on the boat, just because she enjoys a night out dancing with guys).\n\n&amp;#x200B;\n\nIf you're from the US, have a look at the jobs posted for McMurdo (now is a horrible time to do this because of Corona), but they have very short contracts of about 3 months and need people from all professions. You do need to be a US citizen though.",
                            "score": 3,
                            "author": "BerriesAndMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll have to check this out. I'm a us citizen and a mechanical engineer. They could probably find a used for me!",
                                    "score": 1,
                                    "author": "HelixTheCat9"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Volunteering on a research vessel sounds absolutely fascinating. Fingers crossed for you! 🤞I hope you keep the reddit world updated on your travels.",
                            "score": 3,
                            "author": "dkailer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I have also gone out of my way to go to a restaurant I already know or spent an hour on my phone looking at reviews, just so that I'm not going into a restaurant blind. A restaurant. In America. In English. \n\nI feel called out. Don't have time to read all of this now but I've saved it. And damn it, if this isn't me.",
            "score": 10,
            "author": "speedycat2014"
        },
        {
            "level": 0,
            "comment": "Anyone who is a girl on this post have advice for female solo travel? I’d really like to start. I’m in a new city with not many friends, so it’d be nice to get away and not be tied down by “I don’t have anyone nearby to go with me.” I’ve technically traveled alone before, but I usually meet up with people I know, so it kind of doesn’t count.",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm female so all of that \\^.\n\nIt gets back to fear. I thought I would get there but my post was long. Things can happen anywhere: even if you lived in a baby proof house with ninja guards you could slip in the bath. The illusion of safety isn't worth cramping your life.\n\nThat being said, I do a lot of little things that help mitigate risk that take very little time. Something along the lines of: \"If its 90% as fun, pick the safer option\".\n\nWhen I overland alone, I have an InReach, a lot of extra food and water, first aid supplies, and recovery gear. When I hike somewhere remote, I carry enough gear to get me through a night out there just in case.\n\nIf I'm eating or drinking alone, I will take my drink to the bathroom, or ask 1 or even TWO people with good vibes to watch my drink.\n\nI check in with my best friend back home. He knows where I should be hotel wise anyway, and we have a 24 hour check in rule. Ive sent him details of who I'm with a couple of times when I was going to their homes. Note that I have the same rule at home. Things can happen anywhere.\n\nI don't drink past tipsy alone. Not much fun anyway.\n\nI have my \"obvious\" wallet with small money and one atm card, and a money belt with the rest of my cash, an ATM card to a different account, and my passport (if it isn't in a safe). Don't flash money. Don't wear expensive jewelry.\n\nBe aware. Make eye contact with anyone who looks too interested or might be following you. Never use more than one headphone.\n\nDress appropriately for the local culture.\n\nEdit: a word.",
                    "score": 18,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome, thank you for the tips!",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was so inspiring. Thank you. \nI'm from London but just sold my house after a divorce and for the first time in my life I've got no ties.\nI put all my stuff in storage and I was just going to rent a flat for a while till I found somewhere to buy but then I thought - I'm furloughed till the end of summer, why not try living in another country.\nSo I've come to Portugal to an air BnB I've stayed at before in the Algarve.\nIt would actually be so easy just to stay here for three months and then go home but I really want to travel around the country. I want to spend time in Lisbon and Porto.\nThis post has inspired me to force myself to do that. To actually push myself and have an adventure. Thank you so much.",
            "score": 8,
            "author": "Gingerpett",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, awesome! 💜. Maybe you can drop back someday and let me know what you ended up doing?",
                    "score": 2,
                    "author": "HelixTheCat9"
                },
                {
                    "level": 1,
                    "comment": "&gt; Algarve\n\nDo you mind me asking, how is Portugal at the moment? and compared to London? Peaceful?",
                    "score": 1,
                    "author": "Balkrish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's very quiet here. I'm in Lagos and there are no tourists at all. Well, hardly any.\nI don't know how London is, I didn't go further than a ten minute walk from my house for the whole of lockdown.",
                            "score": 1,
                            "author": "Gingerpett"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"im am an introvert with anxiety\" Proceeds to travel trough 26 countries..\n\nDude, if you were extrovert I image you would be on Mars right now..",
            "score": 6,
            "author": "Vita-Detestabilis",
            "replies": [
                {
                    "level": 1,
                    "comment": "This made me laugh! Mars isn't...you know...Out of the question. Space X might have a spot for an ME like me 😛.\n\nThanks for the GOAT!",
                    "score": 3,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve always struggled to convey how I can be a deeply anxious person but still manage to travel alone around the world. Anxiety still manages to take a part in my decision making process, some places seem scary and I still struggle to mingle with locals and tend to keep to myself, however, I’m way more me and more free when I’m traveling than when I’m home. Planning new trips is always super scary to me, and I tend to imagine everything that can go wrong, but when I’m actually traveling, and living and doing new things, I just feel happy.",
            "score": 5,
            "author": "sslisa"
        },
        {
            "level": 0,
            "comment": "Just went to Europe for the first time in January. I spent way too much time mentally convincing myself that everything would be fine if I went to local coffee shops. Some people just do, whereas I have to mentally convince myself that everything will be good before I do anything. The process can take an absurd amount of time. My anxiety feasted on language barriers. With that said, I am already looking forward to my next trip to Europe lol.",
            "score": 4,
            "author": "Awanderingleaf",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's funny how something so seemingly simple can be so hard. \n\nThe time it takes to convince yourself will reduce dramatically with time. Just keep flexing those \"muscles\"",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beautiful post. This is totally me. I have this spontaneous urges and I just go with it while people around me ask me why I'm doing it, I'm just like cause I want to and don't really have a reason not to.\n\nI feel you on the reviews, I've driven 2 hours to check out a restaurant before and it was awesomely bad(Thai cuisine is definitely not for me). I love meeting strangers cause I can bring out my alte personality to them and be a fun stress free human for that period.\n\nSaving this piece to remind me that I shouldn't wait for a group of friends to \"plan\" that outing and just do it!",
            "score": 3,
            "author": "babygaleva7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be free!",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "what a great post! I used to and still get anxiety when I have to order pizza or call somebody haha but it's much much easier after I've gotten lost at night in the middle of nowhere, swam in a cave with giant spiders or scariest of all having to introduce myself to random people at the hostel. if i could do all these things, I can definitely survive a phone call. my anxiety almost disappears when I travel because I am free from my identity of my work/background/status at home and can actively create a new identity every day. I'm now kinda stuck in the middle of a very career focused part of my life and I miss that feeling which you so accurately described. one thing I worry about is in the future and I find a partner....will I miss solo travelling? even with an amazing partner, I feel not being alone takes away some of the challenge that pushes you to be a better person. do you ever think about that in your future?",
            "score": 4,
            "author": "hamburgermenu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the time I just fold up the anxiety and put it in a little box. It's the same thing I do with my fear of heights when I want to zip line, or my claustrophobia on a crowded elevator. Its tiring but it works.\n\nOof, thats a question. I have a lot of concerns about dating. I do a LOT. Almost every weekend is camping, hiking, kayaking, game night or something. I have a determination to do a \"trip of a lifetime\" every year. Thanksgiving is always on a beach in Baja with my friends..... I don't know how someone else fits into all of that. I mean, compromise of course, but that can only go so far. How many people have the time, money and inclination to travel even half as much as I do? And to your point, do I get some independent travel even then? I'm in my early 30s so there is plenty of time (I don't want kids), but I have considered that I may just never have that. I don't know.",
                    "score": 3,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who’s bad at starting convos, what are some convo starters that you guys usually use (esp to skip the “how are you” stuff that OP mentioned)? do you guys just randomly go up to someone else who’s alone or do these encounters with people usually just happen by chance?",
            "score": 3,
            "author": "coconutthings",
            "replies": [
                {
                    "level": 1,
                    "comment": "One older lady on a plane once came up to me and said, \"I grew up in Russia. Would you like to see a picture of my pet bear?\" Best icebreaker ever! Old sepia toned picture of her family and a small bear in a harness. She then used that to start a conversation to practice her english. Bomb old woman. \n\nI'm not that cool. One of my favorite standbys is \"Every glass deserves a cheers\" when I'm dining or drinking alone. It's simple, kind, and breaks the ice. Everyone will cheers and smile, and then turn away if uninterested or pause long enough for you to say something along the lines of \"what is one site or food that I can't miss in this city?\" or \"what brings you here?\"  \n\nGrab on to anything interesting they say or is around you and ask a non yes/no question about it. \n\n\"Is it weird that I haven't seen a single Irish person drink whiskey?\"\n\n\"What book are you reading? What is your favorite book?\"\n\n\"I was just out at Aran Islands and the last ferry of the day left 5 minutes early stranding half a dozen people...Is that normal?\"",
                    "score": 10,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oooh those are great suggestions, thank you :)",
                            "score": 7,
                            "author": "coconutthings"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's basic but I usually just hit em with a 'my name is what's yours?' and indicate that I am open to chatting and from there we cover the bases and you can probe deeper based on how you want to navigate the conversation. yall from the same country? great! there's a connection. are they from a very foreign place? ask them about their culture etc. are they very well travelled? ask them for tips or advice on what to do.",
                    "score": 2,
                    "author": "hamburgermenu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I see, thank you as well!! :)",
                            "score": 2,
                            "author": "coconutthings"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this has really inspired me!! I've always wanted to travel and have been to a few places w my s/o but ive never plucked up ths courage to do it alone. things like this make me believe I can do it!!!!",
            "score": 3,
            "author": "amylouisemcvey",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe in you too!",
                    "score": 3,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm really happy for you, managing everything even though it's hard w anxiety and actually making yourself do things. also it sucks about your job sorry to hear that but I definitely think itll be a good thing for you :)",
                            "score": 2,
                            "author": "amylouisemcvey"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome post. Can relate to a fair bit of that. \nIf you’re wanting to do Antarctica, why not see if you can work there. They usually do trips over summer(winter above the equator) for 3-6 months. \n\nMy biggest fear is language. Earlier this year in France, trying to find info on where a certain platform was in a train station, greeting them with ‘bonjour, where do I find platform x’ seemed to work.",
            "score": 3,
            "author": "clotheslessnz"
        },
        {
            "level": 0,
            "comment": "Nice write up. \n\nI enjoy talking to people who are more on the introverted side but they seem harder to find or more difficult to make connections with. When I do though, they seem to be most of my best travel friends. Sometimes I have to remind myself to do this.",
            "score": 3,
            "author": "deeptravel2"
        },
        {
            "level": 0,
            "comment": "I needed to read this after being stuck in an small apt for 3 months due to covid.  now can resume some travel as restrictions lift.\n\nThank you, you reminded me of great memories in my last 2 years and counting of traveling.  I laughed, cried and chuckled with you as I relate to every word.",
            "score": 3,
            "author": "supapaesunaperra",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope that we can all be back to the joys of traveling soon! Hugs friend.\n\nWhere was your favorite place? Or funniest story :p",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great video! And yes, exactly what I'm talking about.",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best thing I've read on Reddit for some time. \n\nAlso an introvert, and very occasional traveller - but when I do, I tend to ghost through places, interacting rarely. I need to work on that.",
            "score": 3,
            "author": "digdilem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww thank you! \n\nTraveling can be fun completely in your bubble, but the magic happens with interaction. It's worth the effort, I promise! The great thing is if you don't like someone, you can leave! There's no worry about offending someone you may see again. Same thing with embarrassment.",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post OP. I’m an introvert who has struggled with social anxiety in the past. I’m mostly on top of it now and lead a “normal” life, however there are times when I’m travelling overseas and it still holds me back from doing certain things. Even though naturally, like so many others here, I am naturally way more confident and extroverted abroad. \n\nI prefer to travel solo and it’s still a constant battle to force and push myself to go that extra mile and throw myself into situations which my anxiety is telling me not to do. In doing so I have missed out on doing some really cool things which I totally could have participated in on my travels.\n\nWhen it’s safe to travel again I am determined to travel again and to push myself further and further out of the grasp that anxiety holds.\n\nCan relate to a lot of the common themes both in your post and in the comments. So many like minded people on here I love it :)",
            "score": 3,
            "author": "beforeyoureyes",
            "replies": [
                {
                    "level": 1,
                    "comment": "My anxiety is always present, even when I successfully push myself to do something. For example, I recently had to overcome anxiety to go to the park alone... I forced myself to go, but ended up sitting at the edge of the park where there were fewer people lol. Gotta keep on it at all times",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i’ve come to accept that it will always be a part of my life, like it’s never something that will completely leave. For instance currently in my life it’s almost non existent, but I just know that it’s hiding under the surface. Isolation hasn’t helped though because my routine that forced me to be more social went out the window... \n\nLike OP said these days from the outside people wouldn’t even know I have anxiety. It’s just about always being on top of it and pushing against it so that it doesn’t control my life. \n\nI can relate to your park story. Yep gotta keep on it at all times, doing so we get better every day :)",
                            "score": 2,
                            "author": "beforeyoureyes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wasn't sure what to expect opening this, but im glad I did. Many thanks",
            "score": 3,
            "author": "dubalpha"
        },
        {
            "level": 0,
            "comment": "Based as fuck",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow thanks for this post, you really inspired me. I admire you.",
            "score": 2,
            "author": "ro_ci"
        },
        {
            "level": 0,
            "comment": "Great post. Ive felt all of these emotions when travelling. I always come back for more ;)",
            "score": 2,
            "author": "landoonter"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing, this is exactly what I need at this point of time! Having the courage to give things a try, overcoming my inner fears that people will be judging or laughing at you. \n\nAnd as a reminder to not settle at this current stage but to push myself out more. I'm truly inspired by your post and thank you for your encouragung words :)",
            "score": 2,
            "author": "agentpeaches",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's so worth it! I very much recommend the book (I read it free on overdrive from my library). The silly things become great stories, and the rest is living your best life!",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much for this. I just got out of a 10yr relationship and took my first solo trip pre-virus and really struggled to push myself out of my comfort zone to talk to strangers. It's really comforting and encouraging to read this. I hope to one day reach where you're at!",
            "score": 2,
            "author": "omgitsedwin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think that it will ever be easy if you are an introvert, but it *definitely* gets easier. I find that my brain is on board now. We've been there, done that, and everything has worked out over and over. Heart still thinks we might get laughed at though. \n\nThe only way to get here is to do it! Where did you take your first trip?",
                    "score": 3,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're absolutely right. I'm hoping with practice it won't feel so unnatural, so I just have to throw myself into those situations to get that practice in. \n\nI did a pass through Tokyo, Osaka, and Kyoto alone after some friends backed out. Looking at South America or Africa for my next trip and will definitely try harder to chat up some strangers!",
                            "score": 1,
                            "author": "omgitsedwin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In S America, Bariloche and Torres del Paine are my favorites. Not sure how much you like hiking?\n\nIn Africa...big place btw lol... I felt surprisingly safe and didn't get catcalled much in Morocco. Most people were SO nice. I wore flowy tops that covered my shoulders and had to-the-knee shorts but obviously wasn't as covered as many local women. No problem at all. White water kayaking through the Atlas mountains is in my top ten experiences. \n\nTanzania, climbing kilimanjaro and going on safari in the serengeti were also SPECTACULAR. Also top 10. I had a couple of friends with me that time including a male, so I have less of a feel for if I would have been comfortable as a white woman alone there.\n\nHow did you like Japan? I spent a couple of nights in Tokyo once with a friend but we didn't experience much local culture beyond some killer ramen and teppanyaki.",
                                    "score": 3,
                                    "author": "HelixTheCat9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'll keep those in mind for when travel opens up again! Kayaking in the Atlas mountains and the safari in the Serengeti sound amazing.\n\nI didn't get to spend much time in Tokyo since it was right when the virus hit, but highlights of the trip for me were checking out the big and small temples in Kyoto and spending a weekend visiting the bathhouses and walking the streets at Kinosaki-onsen.",
                                            "score": 1,
                                            "author": "omgitsedwin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I be you?! Haha, but really, thanks for the advice and I think I will buy that book. Why is it that traveling is so soul changing? I've finally decided what I want to do with my life and after a lot of honesty with myself (I mean, would I really be happy climbing some corporate ladder?), I've decided to be a teacher. 50% because I love kids and 50% so I can travel all summer. If I didn't have my own kids, I would teach abroad.",
            "score": 2,
            "author": "lizshepherdess"
        },
        {
            "level": 0,
            "comment": "Thanks for this; this is a great post! I've dealt with a lot of anxiety in my life, and am planning to move countries for this very reason. I'm feeling very stagnant right now and feel like I have to make a drastic change to force myself out of my comfort zone and grow as a person.",
            "score": 2,
            "author": "gitsandshiggies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gutsy move. I like it! Can you say from where to where? And/or how you picked your destination country?",
                    "score": 2,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks Haha. Honestly it's a fairly recent commitment I've made, but it's something I have wanted to do for a long time but never seriously attempted to set it in motion, because of worries and anxiety and mental barriers. \n\nSo I'm currently working out the details, but I'm from Alberta, Canada, and I'm planning to move somewhere in Europe. Europe because I'd like to move for a year, and within that time, get to know whatever country I'm in, and travel around some other countries as well.\n\nRight now, just off a gut feeling, France or Spain seem to appeal to me the most for whatever reason. They're both beautiful countries. I think I like the idea of France because I know a little French, some of my favourite bands are French, and I've seen some French movies that I really enjoy. But I'm an indecisive person so I know I'm going to need to look into it more than just having a gut feeling Haha.\n\nJust talking about it seems crazy because people who know me probably don't see me as the type of person to move to a country where the main language isn't english Haha.",
                            "score": 2,
                            "author": "gitsandshiggies"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This post really encouraged me to start thinking more into my travels because i love traveling i was just always so scared to do it alone because there might be times when i won’t have a travel buddy or companion, but after reading this it really gave me the motive because i myself am a socially awkward introvert. So, hearing someone have the same issues as me and still being able to enjoy what the world has to offer has really encourage me :)",
            "score": 2,
            "author": "_ccforeverr2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope you do! You only have one life (probably), don't spend it waiting for someone else! If it wasn't for the virus right now, I would say just book something before you talk yourself out of it. Soon enough.",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for your post. It reminded me why I love to travel. I'm saving this.\n\nI'm an introvert myself and I guess you can say I have anxiety. When I was 19 I went on a solo trip for a few months through South America and while there were many great moments I was lonely for the most part and that was no one's fault but my own, but I'm just so used to it by now. Just the idea of being vulnerable terrifies me...I'm slowly working on that. Maybe it's about time for another solo trip you know once this all blows over.",
            "score": 2,
            "author": "ItsYaBoiDJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "Learning to laugh at yourself helps a lot. No faster way to a fun conversation than admitting some random travel snafu that you had. The other person then feels more comfortable AND the need to reciprocate. I mean look at this post. I admitted to my anxiety to frankly some silly things (ordering a pizza), and look at the responses I got! Reciprocation of feelings of anxiety and fear and other personal things. We're sure past the weather conversation.",
                    "score": 4,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahah we sure are. I mean it's easy to start conversations with the few friends I have, but with people I don't know too well not so much. Sheeeet it's easier to start conversation with strangers when I do have friends around. It doesn't make much sense. I'm more confident with them around. I feel accepted. When I'm alone, out there, not so much. I feel like a reject. I just keep to myself and do my own thing. I will say I'm a lot better than I was a few years ago thanks to travel, the few people around me, and as silly as this sounds, my YouTube channel. Those three things encourage/force me to put myself out there. Thanks again for the post + the extra advice. Safe travels.",
                            "score": 2,
                            "author": "ItsYaBoiDJ"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post thank you! I haven't been anywhere outside of Europe and am currently saving for a solo trip to Australia once lockdown has lifted.  It's literally on the other side of the world but I'm excited by the challenge and I have some old school friends out there I need to catch up with",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Australians are suspiciously nice. I showed up at my airbnb/hotel a day early and the owner didn't even charge me! He and I got happily wine drunk and talked about our lives another day. Lots of other great people too. I only went to Port Douglas, but I imagine this is common across the country. I would love to go back and see more of the country! Great destination choice!",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Early 30s. My parents moved a lot domestically and to internationally when I was a kid so I was kind of used to that. I became a mechanical engineer, and within six months at my job I took a short-term transfer to China for 6 months. I've just never stopped traveling for a business or pleasure. I prefer traveling and then coming home to a home base unlike what my parents did, but they definitely gave me the travel itch. I speak good conversational Spanish and I've forgotten most of my basic Mandarin.",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was one of the things I learned very quickly (although I'd consider myself more of an extrovert than an introvert nowadays): Those party hostels and the hostel chains don't work for me. Too many people, too many social expectations. I do much better in small hostels where you may (keyword may) run into someone while cooking and who may (keyword may) want to spend dinner with you, but where it's totally fine to slurp your pasta while scrolling through your facebook feed.\n\nAnd like you, I needed to trick myself to get going. I told everyone I was going to go on a world trip for 4 years, because I knew come the day, I'd be faced with either going on the trip or facing the tremendously embarrassing (to me at least) task of telling everyone that I chickened out. When the day arrived, I chose the lesser evil and flew to South America.",
            "score": 2,
            "author": "BerriesAndMe"
        },
        {
            "level": 0,
            "comment": "Thank you so much for this! Not exactly an introvert but definitely in a rut/unhappy and in need of a kick up the ass to get me going 💓",
            "score": 2,
            "author": "doberanerin"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the time I just fold up the anxiety and put it in a little box. It's the same thing I do with my fear of heights when I want to zip line, or my claustrophobia on a crowded elevator. Its tiring but it works for me. Breathing control and suppression. It allows me to nip it in the bud before it becomes a panic attack.\n\nI'd say just book something... And think about it later, but that's hard right now. When it's safe to travel, just do it! Flexing the muscles helps a lot.",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "wow thanks so much for this! i have social anxiety and in certain situations i’m very introverted but i can be extroverted as well if i know the people. \n\nsolo travel has always scared me because it means i would have to talk to new people and have the possibility of looking like an idiot. this actually encouraged me a lot to try and get out of my shell and meet new people! hopefully someday i’m planning on buying and van and converting it for solo travel and i can’t wait for the memories i’ll make doing that. this has convinced me it’s good to get out of my shell and meet new people and make new friends! \n\ni have a couple questions as well lol, would you say you’ve made any long term friends because of your travels? and have you ever met up with them again or traveled somewhere else together? also did you ever get sick of traveling and constantly being on the move? what was your best memory from traveling and meeting new people? what was your favorite trip or country you traveled to? and finally where there days that you didn’t have the drive to talk to new people and spent by yourself? i’m afraid i will get burnt out and wind up leaving before i can discover the real beauty of the place i’m in!\n\nthanks so much for sharing this and helping a fellow introvert, hopefully soon i can start getting more out of my box and meeting new people:)",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are a couple of people that I have met traveling that I am still in contact with on Facebook, but only one that I have ever seen again. I visited a lady I met in Bangkok at her home in New Zealand. I honestly haven't tried that hard because I have friends at home, but on my next adventure I'm going to see if I can get past just having a fun evening together or whatever. It's hard to have a favorite, because all of them were little snapshots into somebody's life which were all amazing because of their colorful variety.\n\nA favorite trip is kind of the same way. How do you pick between diving to great barrier reef, climbing Kilimanjaro, Whitewater kayaking through the atlas mountains of Morocco, pit crewing for the Baja 1000, tracking the Peruvian Andes to get to Machu Picchu, accidentally stumbling on the Trevi fountain in Rome....\n\nThere are absolutely days, especially on long trips, did I just sit on a balcony, or beach, or even in bed all day and read. It's hard, because they feel like wasted days when you may never come back, but at some point I have to. Damn it it's supposed to be fun and a vacation!",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beautiful.  I can relate with that initial anxiety when I started solo travel. Thoughts that people would think of me as someone without any friends for traveling alone. \n\nBut over the years I realized that a lot more people are scared and fascinatiled by solo travel. If anyone does judge you, it's not your problem.\n\nLastly, if someone needs help breaking into a group\\making friends, a simple \"Hi\" or \"Hey Guys!\" works surprisingly well.",
            "score": 2,
            "author": "kbthewriter"
        },
        {
            "level": 0,
            "comment": "This reminded me of a piece of advice I received about anxiety: that the most important thing is to be scared but do it anyway, because fear is what makes things seem huge and unconquerable, but once you've set things in motion they are rarely as bad as you expect and often much better.\n\nI'd like to ask whether anyone out there actually finds talking to strangers while travelling far EASIER than talking to people close to home...? I'll start a conversation with someone in the street or in a cafe and get high off it, but the social interaction required by the day-to-day often washes me out. I've never really figured it out. Something to do with strangers not expecting or demanding anything of me, I think.",
            "score": 2,
            "author": "sun_sea_salad",
            "replies": [
                {
                    "level": 1,
                    "comment": "It seems to be a common theme that it's easier to break out of your shell when traveling. I think it's a mix of \"they'll never see me again so who cares if they don't like me\", you're already out of your shell and comfort zone, and a desire to explore",
                    "score": 3,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this. is. amazing.",
            "score": 2,
            "author": "jiminykitkat"
        },
        {
            "level": 0,
            "comment": "Thank you for the post. I can relate to this a whole lot and have saved this post to reread when I need a good kick up the arse",
            "score": 2,
            "author": "AlternativeTea8"
        },
        {
            "level": 0,
            "comment": "Thank you for the post. As others have stated, I can really be more outgoing and another person when traveling. Being in hostels has really made this easier since we are all travelers. It seems a lot more difficult if I wasn't already in that situation. Though you make it work, so must be possible. Thank you for bringing up the point that being home doesn't mean you have to turn off trying to crush anxiety. I need to really work on that.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing. I’m also very introverted. \n\nI suddenly had enough of the routine. Quit and moved to another country. I told myself it was to learn another language. Every decision up to that point was a good decision as judged by society. Work hard. Study. Get a good job. Climb the corporate ladder. Buy a house. Get married. Have a kid. \n\nI was on that path and hated knowing my future. \n\nThe best decision I ever made was to quit and travel. It brought me out of the shell. I’m still an introvert but I worked through the avoiding conversation to actually enjoying it. While living abroad I also traveled to +25 countries. Being in foreign in another country is a great icebreaker. It’s much easier than you think to meet people. In every country I met someone very cool. \n\nIt was suppose to be 1 year and turned into 5. If I could do it again I’d have found a way to work remotely first. Or at least teach English somewhere. There are so many ways to earn money remotely but I saved up so much I didn’t have too. But that cane to an end so I came back to work. \n\nReturning to work was a mixed bag of feelings. I was actually ready to come back because the lifestyle was getting old. Living from a large bag and backpack for old. A new beautiful beach was just like any other at some point. Hanging out was feeling like I had no purpose. Living all over the place. I miss it at times and will definitely do it again. But for now I’m definitely much happier working and building back up for the next adventure. I know how to set it up now and not dwindle savings. The plan will be 2 years and I’ll be ready for round 2. No more wasting money either because I know how far it can go while traveling.",
            "score": 2,
            "author": "lodobol",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love being a engineer so I will always come back, but I was getting 4 weeks of vacation a year and buying a fifth plus holidays, and travel for work plus comp time, plus the times I moved overseas for work. Then last year I took an unpaid sabbatical. I'm glad I chose a profession that allows so much travel while still having a home base and pay.\n\nThere is definitely such a thing as travel fatigue. Big cities all start looking the same... Beaches, waterfalls, lakes, mountains can do it too to a certain extent. The fourth or fifth temple or church or museum start to blur together. To combat this, I try to see very different places after each other, but it's definitely more expensive that way. I would much rather see Rome for three days a dozen times than be there a month, but 🤷‍♀️\n\nShoestring travel is something I want to work on while I don't have to. I usually travel low-med budget.",
                    "score": 2,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im gonna leave this comment here so I can always come back to your post and motivate myself. People think Im an extrovert, because I will talk when most people won't. The thing is Im always getting anxious before saying something, but I guess I have that \"Chandler syndrome\" I make jokes/say something when I feel nervous. \nAnyway well done!!! Im gonna check that book",
            "score": 2,
            "author": "marcepiwe"
        },
        {
            "level": 0,
            "comment": "I’m so happy I read your post. Thank you for sharing this. Really.",
            "score": 2,
            "author": "ElCuloTuyo23"
        },
        {
            "level": 0,
            "comment": "Wow!! I needed to see this. Thank you so much for being vulnerable and sharing your feelings. The older I get the more I want to travel but it’s the anxiety that’s holding me back. I’m looking forward to checking out that book!",
            "score": 2,
            "author": "thelalaliz"
        },
        {
            "level": 0,
            "comment": "Omg thank you. Thank you! 💙",
            "score": 2,
            "author": "everblu___"
        },
        {
            "level": 0,
            "comment": "Wow, finally another person saying their anxiety manifests as exhaustion. I never fight it. I've never heard of anyone having the same thing.",
            "score": 2,
            "author": "Postcardtoalake"
        },
        {
            "level": 0,
            "comment": "thank you so much! I really appreciate it so much and i’m still saving up for it but i am most definitely going to get started soon.",
            "score": 2,
            "author": "_ccforeverr2"
        },
        {
            "level": 0,
            "comment": "ty 4 this",
            "score": 2,
            "author": "justvibing1337"
        },
        {
            "level": 0,
            "comment": "Tremendous little write up.",
            "score": 2,
            "author": "funfwf"
        },
        {
            "level": 0,
            "comment": "To what book are people referring in comments?",
            "score": 1,
            "author": "immiglaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry I'm late I didn't want to come\n\nIt was referenced somewhere in the middle of my post",
                    "score": 1,
                    "author": "HelixTheCat9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shorter Advice from a solo introvert traveler with anxiety:\n\n&amp;#x200B;\n\nGet beta blockers.  Transact business.  Practice mindfulness.\n\n**📷**",
            "score": 1,
            "author": "Ducklefuckler"
        },
        {
            "level": 0,
            "comment": "Really cool story 👌",
            "score": 1,
            "author": "bigmanlymark"
        },
        {
            "level": 0,
            "comment": "I'll have to check out that book.",
            "score": 1,
            "author": "MasonTaylor22"
        },
        {
            "level": 0,
            "comment": "That was a rollercoaster of a post.",
            "score": 1,
            "author": "Takiatlarge"
        },
        {
            "level": 0,
            "comment": "Well done sir!",
            "score": 1,
            "author": "robot_duzey"
        },
        {
            "level": 0,
            "comment": "Inspiring.  I’m literally gonna pack a small bag, my little dog, and make the 13 hour drive to Mt. Rushmore right now.  Damn the anxiety and damn COVID.  I’ll just sleep in my truck.  I’ll post an after-trip report here.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome. Do it!",
                    "score": 1,
                    "author": "HelixTheCat9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Done it.  Saw the Jolly Green Giant in Blue Earth, MN:   [https://www.roadsideamerica.com/story/2127](https://www.roadsideamerica.com/story/2127)\n\nSaw the Badlands:   [https://www.nps.gov/badl/index.htm](https://www.nps.gov/badl/index.htm)\n\nSaw Mt. Rushmore (no link needed)\n\nHung out in Deadwood:   [https://en.wikipedia.org/wiki/Deadwood,\\_South\\_Dakota](https://en.wikipedia.org/wiki/Deadwood,_South_Dakota)\n\nTook my tiny dog for a walk around Sheridan Lake in the Black Hills:   [https://en.wikipedia.org/wiki/Sheridan\\_Lake\\_(South\\_Dakota)](https://en.wikipedia.org/wiki/Sheridan_Lake_(South_Dakota))\n\nDrove to Devil's Tower:   [https://www.nps.gov/deto/index.htm](https://www.nps.gov/deto/index.htm)\n\nStayed at the Devil's Tower KOA Campground in a cabin.  They showed Close Encounters of the Third Kind outside with the actual Devil's Tower right behind the screen:   [https://en.wikipedia.org/wiki/Close\\_Encounters\\_of\\_the\\_Third\\_Kind](https://en.wikipedia.org/wiki/Close_Encounters_of_the_Third_Kind)  and  [https://koa.com/campgrounds/devils-tower/](https://koa.com/campgrounds/devils-tower/)\n\nAnd stayed at another KOA cabin in Sioux Falls:   [https://koa.com/campgrounds/sioux-falls/site-type/lodging/](https://koa.com/campgrounds/sioux-falls/site-type/lodging/)\n\nAll in all a fun trip that provided some much needed stress relief and introspection.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow so many countries. \nYou must of worn out so many shoes. \nPersonally I visit heaps more but I use a plane it’s much easier. No problem. \nThank goodness. Hey most do also use planes it’s easy. And anyone can,even children:alone!\nGive it a crack mate. 😜 Marco Polo rebourn Impressive.",
            "score": 0,
            "author": "pommieCrys"
        }
    ]
}