{
    "id": "i2zw83",
    "score": 1496,
    "title": "AMA: I have visited every country in the world and every county in Texas!",
    "author": "valeyard89",
    "date": 1596471275.0,
    "url": "https://www.reddit.com/r/solotravel/comments/i2zw83",
    "media_urls": [
        "https://www.reddit.com/r/solotravel/comments/i2zw83/ama_i_have_visited_every_country_in_the_world_and/"
    ],
    "other_urls": [
        "http://imgur.com/a/FUeim)",
        "http://imgur.com/a/dPVoI)",
        "http://imgur.com/a/cTeUP)",
        "http://imgur.com/a/Itdgd)",
        "http://imgur.com/a/YMueN)",
        "http://imgur.com/a/3UVeW)",
        "http://imgur.com/a/09g2E)",
        "http://imgur.com/a/v2mWi)",
        "http://imgur.com/a/oB5MV)",
        "http://imgur.com/a/ikH18)",
        "http://imgur.com/a/5TEr0)",
        "http://imgur.com/a/B9K3D)",
        "http://imgur.com/a/KZvdN)",
        "http://imgur.com/a/PxSYI)",
        "http://imgur.com/a/6ngUC)",
        "http://imgur.com/a/yyqoe)",
        "http://imgur.com/a/zGWfv)",
        "http://imgur.com/a/jen2h)",
        "http://imgur.com/a/H8bOJ)",
        "http://imgur.com/a/Mkjfg)",
        "http://imgur.com/a/zwXOH)",
        "http://imgur.com/a/rBC3x)",
        "https://imgur.com/a/StbEWeG)",
        "https://imgur.com/a/SWwqEXP)",
        "https://imgur.com/a/qXtq2)",
        "https://imgur.com/a/1JaUp)",
        "https://www.reddit.com/r/texas/comments/cz989n/254_texas_courthouses_pt_8_final/"
    ],
    "postText": "Sorry I'm late on the link.  I have been traveling both solo and with travel buddies for over 20 years.  In that time I have visited every country in the world and every county in Texas (254) and had some incredible adventures. AMA!\n\nTexas counties idea came about when I was close to finishing every country and needed a new project to work on. So I picked visiting every county courthouse in Texas, there are more counties than countries!\n\nHere's the list of my initial visits to each country.  ()'s indicate countries visited on the same trip.\n\n* 1972 - UK, USA\n* 1977 - Canada\n* 1985 - (France, Spain, Belgium, Luxembourg, Germany)\n* 1988 - China\n* 1996 - Mexico\n* 1998 - (Peru, Bolivia, Chile, Argentina, South Africa, Zimbabwe, Zambia, Malawi, Zanzibar, Kenya, Seychelles)\n* 1999 - (Tonga, New Zealand, Brazil), Australia\n* 2001 - (Switzerland, Italy, Vatican), Japan, Ireland, Taiwan\n* 2002 - (Botswana, Namibia, Mozambique), Uruguay, (Thailand, Myanmar, Cambodia)\n* 2003 - Egypt\n* 2004 - Monaco, (Singapore, Indonesia, Malaysia, Sri Lanka, Ghana, UAE, Oman), Trinidad, Ecuador\n* 2005 - Costa Rica, (South Korea, Mongolia, Russia, Azerbaijan, Georgia, Armenia)\n* 2006 - (Lithuania, Latvia, Iceland), (Cyprus, Greece), Paraguay, Morocco, Portugal, (India,\n* 2007 -  Bahrain), (Barbados, St. Vincent, Grenada, Guyana, Suriname, Haiti), (Panama, Colombia), Netherlands, North Korea, Bahamas\n* 2008 - Ethiopia, (Norway, Sweden, Finland, Denmark, Liechtenstein, Austria), San Marino, (Brunei, East Timor), (Honduras, El Salvador, Nicaragua), Guatemala\n* 2009 - Jamaica, (Estonia, Belarus), Philippines, (Andorra, Turkey), Venezuela, Bhutan\n* 2010 - Qatar, (Togo, Benin, Burkina Faso, Mali, Cote d'Ivoire), (Dominican Republic, Antigua, St. Kitts, Dominica, St. Lucia), (Palau, Micronesia, Marshall Islands)\n* 2011 - (Jordan, Lebanon, Syria, Israel, Kuwait, Bangladesh, Nepal), (Pakistan, Afghanistan), (Vietnam, Laos)\n* 2012 - (Nigeria, Cameroon, Sao Tome, Gabon, Equatorial Guinea), (Kazakhstan, Kyrgyzstan, Uzbekistan, Tajikistan, Turkmenistan, Iraq, Albania, Montenegro, Kosovo, Macedonia), Iran\n* 2013 - (Yemen, Somaliland, Djibouti, Uganda, Rwanda, Burundi), (Eritrea, Saudi Arabia), (Sudan, Congo\n* 2014 - DR Congo, Angola, Cape Verde), (Tunisia, Algeria), Belize, (Fiji, Kiribati, Vanuatu, Solomon Islands, Papua New Guinea), Malta, (Swaziland, Lesotho), (Bulgaria, Romania, Serbia, Hungary, Slovakia), (Czech Republic, Madagascar, Mauritius, \n* 2015 - Comoros), (Maldives), (Chad, Mauritania, Senegal, Niger), (Poland, Ukraine), (Moldova, Slovenia, Bosnia, Croatia), Central African Republic\n* 2016 - (Gambia, Guinea-Bissau, Guinea, Sierra Leone, Liberia, South Sudan), Cuba, (Samoa, Tuvalu, Nauru)\n\n\nEdit. Some pictures.\n\n[Palmyra, Syria](http://imgur.com/a/FUeim)\n\n[Syria](http://imgur.com/a/dPVoI)\n\n[Chad](http://imgur.com/a/cTeUP)\n\n[Swaziland (nsfw)](http://imgur.com/a/Itdgd)\n\n[Bolivia](http://imgur.com/a/YMueN)\n\n[Algeria](http://imgur.com/a/3UVeW)\n\n[Sudan](http://imgur.com/a/09g2E)\n\n[Ethiopia](http://imgur.com/a/v2mWi)\n\n[Eritrea](http://imgur.com/a/oB5MV)\n\n[Saudi Arabia](http://imgur.com/a/ikH18)\n\n[Yemen](http://imgur.com/a/5TEr0)\n\n[Socotra](http://imgur.com/a/B9K3D)\n\n[Somaliland](http://imgur.com/a/KZvdN)\n\n[North Korea](http://imgur.com/a/PxSYI)\n\n[Afghanistan](http://imgur.com/a/6ngUC)\n\n[West Africa](http://imgur.com/a/yyqoe)\n\n[Kyrgyzstan](http://imgur.com/a/zGWfv)\n\n[Turkmenistan](http://imgur.com/a/jen2h)\n\n[Myanmar](http://imgur.com/a/H8bOJ)\n\n[Iran](http://imgur.com/a/Mkjfg)\n\n\n[Faces of the World](http://imgur.com/a/zwXOH)\n\n[Money](http://imgur.com/a/rBC3x)\n\n[Chatham Islands, New Zealand](https://imgur.com/a/StbEWeG)\n\n[Canadian Maritimes + St. Pierre](https://imgur.com/a/SWwqEXP)\n\n[Kairouan, Tunisia](https://imgur.com/a/qXtq2)\n\n[Haiti](https://imgur.com/a/1JaUp)\n\n\nCourthouse photo sets:\n\nhttps://www.reddit.com/r/texas/comments/cz989n/254_texas_courthouses_pt_8_final/",
    "comments": [
        {
            "level": 0,
            "comment": "How many countries had you visited before you decided it, fuck it, let's do them all?",
            "score": 143,
            "author": "amyandgano",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was about 80 or so.  I started getting serious around 2007, after visiting North Korea it was downhill from there!!",
                    "score": 227,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How were you able to visit North Korea? Did you have any issues while you were there?",
                            "score": 55,
                            "author": "h0use_party",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Booked a tour out of Beijing. Was supposed to go for the Mass Games but they canceled them like the day before we got there.  I'd still like to go back to see them at some point.\n\nno issues, the tour keeps you busy all day basically.  The guards on the train back to China flicked through a few peoples cameras then got bored.",
                                    "score": 93,
                                    "author": "valeyard89"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 56,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Officially, the US forbids its citizens to be tourists in North Korea. People don't realize that NK doesn't care. It well let anyone in. May be hard to get any help from the US of there's trouble.",
                                            "score": 47,
                                            "author": "pototo72",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Although the government has a “ban” on us going to North Korea, they can’t enforce it. Tour companies based in China will take Americans to North Korea, I believe.",
                                                    "score": 17,
                                                    "author": "Jayyykobbb",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "At the moment, yes Americans can't visit. But they were able to visit in the past, though with more restrictions.  I used my UK passport for my visit as the tour was cheaper and I could take the train out.  Left my US passport in China just to be safe.",
                                                    "score": 5,
                                                    "author": "valeyard89"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah Americans are technically on the list of people who can’t go. Canadians and (most?) Europeans can.",
                                                    "score": 12,
                                                    "author": "Chris_Hansen_AMA"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is the average time you spent in each country.",
            "score": 238,
            "author": "genini1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most visits were quite short.... 1-3 days, but traveling overland between them.  I only had 4-7 weeks vacation, so most trips were in the 2-3 week range, maybe visiting 4-6 countries.  Longest time in any country other than UK and US is Australia at 54 days combined and India at 48 days combined (I've been to both multiple times).",
                    "score": 252,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What made you decide each country very shortly rather than one country extensively? And as a follow-up: are there countries you want to go back to because you want to see more of them?",
                            "score": 57,
                            "author": "BerriesAndMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just like getting a taste to see if I like a place and can always come back.  I've revisited some countries multiple times (Chile, Argentina, South Africa, China, India, Australia, NZ, Turkey, etc).  The ones I'd like to revisit for more in-depth currently are Vietnam, Laos, India, China, Indonesia, Israel, Brazil, Croatia.",
                                    "score": 115,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's fascinating to see an approach so diametrically opposed to mine.. as I lalways try to visit a country 'fully' because I most likely won't be back. I too would enjoy going back to Laos and Croatia.. and would like to visit the other countries you've mentioned as I've never been.\n\nVietnam has made it pretty close to the top of my list by now.",
                                            "score": 69,
                                            "author": "BerriesAndMe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is my approach too - I'm from New Zealand and the flights to get anywhere from here are so damn expensive I feel like I have to do and see everything in one trip because I'm not likely to be able to come back.",
                                                    "score": 3,
                                                    "author": "rbphoto123"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a follow up do you use a high end camera or just take phone pictures?",
                            "score": 52,
                            "author": "genini1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've had a Nikon DSLR in the past but now have a mirrorless Sony A6000.  My phone takes potato quality photos so I only use it sparingly.",
                                    "score": 83,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Potato quality",
                                            "score": 14,
                                            "author": "aohabehr",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most of my overlands are in Africa and South America.  My first major solo trip was flying into Cusco, Inca Trail to Machu Picchu, then overland via Lake Titicaca, La Paz to Arica, continuingdown the length of Chile via Calama to Santiago (I've also gone La Paz via Salar de Uyuni to Chile on a separate trip) where I came down paralyzed, 10 days in the hospital and had to return home.  Flew back to resume the trip, Easter Island, then across to Mendoza in Argentina.  Flew to Buenos  Aires then to Cape Town, South Africa.  Went overland to Johannesburg.  Then took a month-long overland safari truck via Zimbabwe, Zambia, Malawi, Tanzania before ending in Kenya.  Flew to the Seychelles for a week before returning to the USA via France and the UK.",
                    "score": 50,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, paralized? What happened?",
                            "score": 15,
                            "author": "monosuave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Came down with Guillain-Barre syndrome, was paralyzed in the hospital for 10 days.. had to go back to the USA to recover and get physical therapy.",
                                    "score": 42,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you developed a strategy to fully experience a country? If so what is it?",
            "score": 56,
            "author": "uvuwo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mostly I am seeing some of the touristic highlights... I like architecture, so forts, museums, mosques, churches, etc.  I will visit local grocery stores to see what they have on offer.  Street food (in some places), and just wandering around.  The Lonely Planet guides would often have walking tour maps of cities, I would follow. When going between countries I prefer to go overland, via bus or share taxi.",
                    "score": 96,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really enjoyed looking through your pictures, looks like you've had some great experiences! \n\nWhat's your biggest regret?",
            "score": 45,
            "author": "92-LL",
            "replies": [
                {
                    "level": 1,
                    "comment": "Visiting Algeria instead of Libya in 2014. Looked like Algeria was going bad in Libya was getting better. Had a failed attempt to visiting Libya in 2015 but finally made it in 2017 but didn't get to see as much as I would have liked\n\nAlso we missed Djenne mosque in Mali as the taxi broke down coming back from Timbuktu and we didn't have enough time to make it there",
                    "score": 65,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how your travel history was built over decades, as opposed to the trendy ‘I quit my job and traveled over the world! blogs these days’. Nothing wrong with those, but it was inspiring to see a perhaps more realistic approach to this. Kudos.",
            "score": 396,
            "author": "irrelevanthings",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't even have my own blog really! I post trip reports on flyertalk sometimes, and photos on Facebook. But I don't have my own page or insta.  Which is odd as it was an early blog I came across in 1995 that got me interested in going on solo trips in the first place....",
                    "score": 138,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just gonna ask if you had Instagram haha. Would have been interesting to see some more of your photos",
                            "score": 20,
                            "author": "lllllllllilllllllll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have stuff on Flickr but I'm way behind on posting and I never organized or fixed up the photos.\n\nhttps://www.flickr.com/search/?user_id=hauteboy",
                                    "score": 23,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which country is the hardest to enter?",
            "score": 37,
            "author": "thefida",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me, Libya. Took several failed attempts to get the visa. Actually made it across the border once in 2015 but our guide had abandoned my travel buddy and I in Tunisia and the border guards wouldn't let us in. Finally made it two yrs later.",
                    "score": 93,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What did you think of Tunisia? What did you do there?",
                            "score": 7,
                            "author": "ace32229",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tunisia is fab. Have been a few times now, Tunis, Sidi Bou Said, Kairouan, Hammamet, El Jem, Djerba, last visit was 2 yrs ago.  Still would like to go back.",
                                    "score": 5,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which ones were the biggest surprises?",
            "score": 61,
            "author": "peachykeenz",
            "replies": [
                {
                    "level": 1,
                    "comment": "(Northern) Algeria was so green and fertile.. I definitely wasn't expecting that.  I really loved Syria... visited just before the civil war in 2011.  Great food and history.  I sort of knew what to expect going into India but it was still overwhelming (I loved it).  A lot of countries in a region tend to be fairly similar, so after seeing so many it got to a point where there weren't a lot of new standout surprises unfortunately.",
                    "score": 162,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re very fortunate to have seen Syria before the war!",
                            "score": 11,
                            "author": "techno_queen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, you never know these things!  When I was starting out travel in the 1990s, even Peru and Cambodia were kinda off limits then!",
                                    "score": 14,
                                    "author": "valeyard89"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As an Indian, anytime you are back,hit me up. Can help you explore",
                            "score": 29,
                            "author": "saphiki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks.  I've covered southern India pretty well but would like to see more of the north. Amritsar/Kashmir/Jaipur/Darjeeling",
                                    "score": 9,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What about eastern India?",
                                            "score": 2,
                                            "author": "saphiki"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I really loved Syria... visited just before the civil war in 2011\n\nSomebody won super jackpot. Syria and Yemen are on top of my list.",
                            "score": 6,
                            "author": "SwingNinja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Got lucky with Yemen/Socotra too... went in 2013 during a quiet time.  Libya was the only one I missed out on pre-war.  But the parts of Libya I visited at least you wouldn't know there was one.",
                                    "score": 2,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For countries with low to non-existing tourism infrastructure did you use some sort of local guides (such as Couchsurfing) or did you just do it all on your own?",
            "score": 23,
            "author": "benni_mccarthy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prefer to do on my own when possible... some countries needed a guide/tour to get the visa (Turkmenistan, Iran, Algeria, North Korea).  I have started using local guides a bit more often though, they will take you places that you wouldn't have heard of otherwise.  My last solo trip in January to Sulawesi I booked a tour last minute up to Torajaland.. they handled all the driver+guide+etc.",
                    "score": 38,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How come your photos are available on this Romanian website from 2014? \n\nhttps://www.romaniatv.net/fetele-lumii-cum-arata-fetele-din-turkmenistan-copiii-din-benin-sau-batranii-din-sf-lucia-foto_125136.html\n\nhttps://media-cdn2.romaniatv.net/unsafe/0x400/smart/filters:contrast(5):format(webp):quality(80)/https://beta.romaniatv.net/wp-content/uploads/2014/02/18_44735800.jpg",
                            "score": 2,
                            "author": "AllenkeyAllenkey"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you feel now?",
            "score": 22,
            "author": "estreoka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now I need a new list to work on :)\n\nCovid definitely has thrown a wrench in things, normally I am traveling every 3-4 months somewhere.  So I'm quite antsy at the moment... my last trip was back in January.",
                    "score": 78,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You still have 49 other states to go. :-p",
                            "score": 28,
                            "author": "purplestarsinthesky",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Visit all the national parks in NA ?",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, that would be a good one to try",
                                    "score": 17,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which is your favourite European country?",
            "score": 21,
            "author": "Jackinky123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tough call there. I've spent by far the most time in the UK and France.  France wins for food.  But the Balkans were gorgeous, Slovenia and Croatia in particular.",
                    "score": 64,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/stinsicles asks:\n\n&gt; Hi, first off I want to say thank you for doing this.\n\n&gt; I have a few questions and please feel free to answer as many as you can.\n\n&gt; 1.\t⁠What type of job do you have that allows you to travel so often. I find it hard to work around my job, besides the normal personal time off.\n\n&gt; 2.\t⁠How do you determine when and where to go?\n\n&gt; 3.\t⁠What is your best advice for travelers?\n\n&gt; Thank you again",
            "score": 43,
            "author": "peachykeenz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a software developer, full time job and family, but had 4-7 weeks vacation time.. Most of my trips were fairly short, 2-3 weeks at most, other than combined work/vacation trips (India) where I'd spend a month.\n\nChoosing destinations, usually it would just depend on if I could find a good fare somewhere. I found a mistake fare to Ethiopia for $274 roundtrip, and another one to Taiwan for $100. Other times I was traveling with travel buddieWes so we would pick a region (Caucasus, West Africa) and go there.  Off season can be a good time to travel to places, cheaper and less tourists... but also some things are closed and weather isn't ideal.  Visited Iceland in April one year, Guianas in May (rainy season).\n\nThere isn't one 'correct' way to travel. Some people like to lie on a beach for a week, others (like me) prefer to zoom around and see lots of things in a short period... it's rare for me to be in a city more than 2 nights before moving on. Doing whatever you are comfortable with is OK.",
                    "score": 100,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "4-7 weeks of vacation in the US? Do you work at some fancy startup with unlimited vacation?",
                            "score": 30,
                            "author": "BlackShadowv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I'd just been at my job long enough to get 4 weeks, plus a week at Christmas. Plus I can work remote so got some flex time.",
                                    "score": 51,
                                    "author": "valeyard89"
                                },
                                {
                                    "level": 3,
                                    "comment": "did he say he's in the US in another comment? maybe his company isn't and he gets different vacation times based on that. 4-7 weeks sounds not unreasonably long to me.",
                                    "score": 11,
                                    "author": "punkisnotded"
                                },
                                {
                                    "level": 3,
                                    "comment": "4-5 weeks is pretty standard in com sci because more people are needed than people available. Same reason why they also make about 80-100K as a starting salary.",
                                    "score": 8,
                                    "author": "Error87C",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Color me surprised. As an European I thought Americans were lucky to get 2 weeks PTO.",
                                            "score": 5,
                                            "author": "BlackShadowv",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In the USA this is common for hourly-lower salary: Usually 1-2 weeks upon start, 2-3 at 5 years, 4 at 10years and 5 at 15+. And unfortunately if they leave to another hourly job it starts over which is sad. (Your Walmarts, large grocers, manufacturing/distribution warehouses, car plants, etc)\n\nHowever, my circle of friends  from college are all wayy more because we are lucky to be engineers/managers/etc. Mine is unlimited (which kinda means 4-5 lol), friend at Tesla is unlimited, friend that is project manager gets 4-5 working there for 2 yrs. Etc. Management (regardless of years worked) can easily get 4ish+\n\nBut this is true for my experience. Tons of small businesses may be nicer or not since it is totally their call.",
                                                    "score": 7,
                                                    "author": "UbiquitousThoughts"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In CA, 100k can be below starting salary",
                                            "score": 6,
                                            "author": "pototo72"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. How come it was just Egypt in all of 2003? (please don't feel I'm nagging if it was personal reasons)\n\n2. Weirdest/most dangerous situation you encountered?\n\n3. Thoughts on Poland?\n\n4. Would you say Texas has enough to provide for a 1-2 week sólo road trip?\n\nAlso, I'm definitely jealous. What an amazing achievement and you must have some great memories.",
            "score": 17,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those are just initial visits.. I did other trips in 2003 to the UK (3X), France (2X), China (Three Gorges cruise), Alaska, and Australia.  But we also remodeled the house that year..... \n\nDangerous would probably be the attempted mugging in Angola.  And in Mali the driver started driving offroad into the desert, during a time when foreigners were being kidnapped.\n\nI've only been to Krakow/Auschwitz and Warsaw. I liked it though so wouldn't mind a revisit.\n\nDefinitely plenty to do in Texas. Galveston, Houston museums, Hill Country, Big Bend and Guadalupe Mountains parks, Palo Duro Canyon, and of course BBQ...",
                    "score": 20,
                    "author": "valeyard89"
                },
                {
                    "level": 1,
                    "comment": "Not OP but I was in Poland to visit Auschwits (I butchered the spelling sorry). \n\nAnyone who wants to visit it, it’s unbelievable. Do it. \n\nThere are Jewish charities that subsidise trips to Poland and Auschwits in order to spread awareness. I only payed £35 for the whole trip. I’m definitely going back",
                    "score": 6,
                    "author": "imSeanEvansNowWeFeet",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are your 3 favourite memories? :)",
            "score": 17,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah hard to pick just 3! But here are a few:\n\nIn Tuvalu, was looking for somewhere to rent a motorcycle but stopped at the wrong house and started talking with the guy there.  I'd met a Norwegian dude on the flight in and he invited us to have a kava drinking and jam session later that evening.  We were only able to get one motorcycle but the guy managed to find us at the south end of the island and had ridden all the way down there to give us another scooter.  Later that night we spent 4 hrs drinking kava while he and his buddies played music.  Ow my head the next day though....\n\nAnother good experience(s) in Paraguay. I was taking photos of the slums/barrio down below the Presidential Palace.  A guy was down below playing football with his kid and we got talking (in Spanish).  Ended up spending the whole afternoon with the guy, meet his whole extended family and got a tour of the barrio including climbing down the cliffs on ladders.  Later that night he went with me to the bus station as  'there are bad people there'.   He and his wife/three kids lived in a claptrap one-room shack, a bare naked lightbulb and a tiny 5\" black and white TV.  I sent them a care package with blankets, legos, toys, etc when I got home but never heard back.   On the same Paraguay trip coming back on the bus I was sitting next to a cute young blonde woman, turns out she was a local (German descent) and spoke German, Spanish, Guarani.  So we sat chatting for a long time.\n\nIn Swaziland I was there for the Reed Festival, where 50,000+ topless girls dance for the king.  Before the dances started I was standing around the field and some younger girls came up to me and were chatting with me, they probably hadn't seen a white person up close before.  I was wearing sunglasses and they all jumped back 3 feet when I removed them... they hadn't seen blue eyes before.  Then then asked why my arms were hairy, was I some sort of monkey, lol.",
                    "score": 108,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds amazing, thank you so much for sharing! :)",
                            "score": 17,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any countries you felt like you were in danger/not safe to wonder around the streets?",
            "score": 16,
            "author": "RFive",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Afghanistan, my travel buddy and I had booked a tour and had an armed guard walking around with us in Kabul.  The travel books made Guyana seem really dangerous (take a taxi if only going two blocks, etc).  In Luanda, Angola I had an attempted mugging right outside my hotel.  Some places are just DARK at night... I fell in a hole in the sidewalk in Nairobi.  Probably wouldn't have walked around there on my own at night, but was with my safari group.",
                    "score": 45,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any places that feel special for some reason? and/or places where you could see yourself living forever? (or for an extended period of time).",
            "score": 15,
            "author": "almagemela",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like mountains/scenery/food.  Argentina (Buenos Aires), New Zealand (my cousin moved there) I could probably live in either place.  For special feeling places, Ethiopia, Myanmar were fabulous.",
                    "score": 33,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is amazing and I found it very inspiring! I'm in my 30s and sometimes look back feeling depressed that I never took off a couple of years to travel freely around the world in my 20s. Seeing a post like this makes me hopeful that there continues to be an ample amount of time left in my life to travel and experience as much of the world as possible.\n\nWhich country had the best cuisine in your opinion?",
            "score": 14,
            "author": "black_zubr17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plenty of time! Yes I know travelers in their 60s and 70s.  Certainly is easier to do some of the more physically demanding activities (Inca Trail, Kilimanjaro, etc) when you are younger, there's older people taking these on.\n\nFavorite countries for food are Turkey, Argentina, France, South Africa, Taiwan",
                    "score": 19,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where did you usually sleep? Hotels/hostels, sleeping in nature or somewhere else?",
            "score": 13,
            "author": "Bullseye61",
            "replies": [
                {
                    "level": 1,
                    "comment": "A mix... Guesthouses, cheap hotels, hostels.  Camping mostly was for my overland safari trips in Africa.  Went overland from Johannesburg to Nairobi, including a 3-day canoe trip down the Zambezi river where our group camped wild on islands in the river..  Mostly hostels in New Zealand/Australia.   I'll often book a splurge hotel during a trip, staying in a 5* somewhere for one night.",
                    "score": 27,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool, thanks for answer.",
                            "score": 2,
                            "author": "Bullseye61"
                        },
                        {
                            "level": 2,
                            "comment": "For the overland Africa trips which company did you use?",
                            "score": 2,
                            "author": "nug-princess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Drifters, they're South African company (https://www.drifters.co.za/) and have their own lodges scattered around.  First trip was 30 days Johannesburg to Nairobi via Zimbabwe, Zambia, Malawi, Tanzania (but I don't think they do that route anymore).  Second trip was 24 days Johannesburg loop via Botswana, Zimbabwe, Zambia, Malawi, Mozambique (Several places were repeats with 1st trip).\n\nThey're a good mid-budget option.  The driver does most of the cooking though we helped out with prep.  There wasn't a separate kitty like with some other companies.",
                                    "score": 3,
                                    "author": "valeyard89",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will you visit any new country that eventually comes into being?",
            "score": 12,
            "author": "penguinintheabyss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I would have to do this....",
                    "score": 13,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How has the world changed over the course of your travels?",
            "score": 22,
            "author": "uxhelpneeded",
            "replies": [
                {
                    "level": 1,
                    "comment": "My first visit to China was in 1988.  No Western companies (other than KFC), no traffic on the roads, everyone rode bicycles and wore functional clothes.  Visited in 2003 just 15 years later and things had completely changed. Beijing was all blinged out with neon lights, massive traffic jams, high end fashion, skyscrapers, Starbucks, etc.\n\nI visited Tulum in 1999. Back then it was just simple shacks along the beach. Now there's resorts and Starbucks.\n\nMost of my travels were from the late 1990s onwards. So there were Internet cafes in places, but no wifi or cell phones.  Not much information online either other than in places like the Lonely Planet thorntree, and even that was scarce for less traveled places.  Hotels and hostels you had to show up and hope they had room.  You might send an email once a week or so.",
                    "score": 98,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can relate; Tulum in 1988 was the ruin and almost nothing else.  Beijing in 2000 still had majority of the street traffic was bicycles, but there were still traffic jams in the evening.",
                            "score": 7,
                            "author": "kvom01",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Try China in 2020, or whenever they open up again, for a similar feeling.  Especially in cities you might not expect.",
                            "score": 2,
                            "author": "MrBeverage",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was your experience like in Bhutan?",
            "score": 12,
            "author": "Tybalt941",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had a great time in Bhutan.  You have to be on a tour to get the visa, but the daily fee covers everything, the hotel, food, transport, guide, etc... so think of it more like an all-inclusive vacation.  We spent 10 days there over Christmas one year to attend one of the festivals (Trongsa).  I hadn't been to the Himalaya before so the architecture there was very unique.  They paint (quite detailed) penises on the buildings to keep away evil spirits.... The festival was very much a local affair, maybe a handful of western tourists and hundreds of locals.  The dances go on for several days with amazing costumes of skeletons, demons, lords, etc.",
                    "score": 24,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I was initially surprised to see the ejaculating penises everywhere. Even little wooden penises in all the shops. Despite being one of the most foreign places I've been, in Thimphu there's still clever business names that would make westerners smile like 8 Eleven. I was lucky enough to visit as a guest of the extended royal family so my experience was local but very much the 1% if not more 0.001%. I'm curious how intrusive the tour guide experience was. Were you able to wander the city unsupervised? Did you have dining options or was everything prearranged? I would definitely love to go back and see some more of the mountain country, driving through some of the passes was spectacular.",
                            "score": 12,
                            "author": "Tybalt941",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The tour was super low key. You can wander around the towns fine on your own.  Most of the dining was already prearranged at the hotel (not a lot of choice) or restaurants.  We went to the Swiss bakery on our own as it was near our hotel.",
                                    "score": 8,
                                    "author": "valeyard89"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did you feel as though you were getting a \"real\" experience? I'd love to go but my boyfriend is hesitant because everything seems to be picked for you so he doesnt think it would be authentic",
                            "score": 7,
                            "author": "gymgal19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oops sorry you mean Bhutan.. yes it's an authentic experience even on the tour... the tour is very low key.",
                                    "score": 8,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now that you’ve gone to all of them, which ones do you feel most compelled to return to?",
            "score": 12,
            "author": "OddSyllabub",
            "replies": [
                {
                    "level": 1,
                    "comment": "Top of the list for want-to-revisit are Vietnam, Laos, Israel, Brazil, Indonesia, India, Turkey, Croatia.",
                    "score": 33,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which place did you think was the most scenic (mountains, lakes, clouds, greenary etc..) among south american, EU countries, norway,iceland, greenlad etc..\n:)\nWith views on easily livable (sry English is  not my first language)\n(I know im asking a lot 😅 but  i always wanted to meet a person like you)",
                            "score": 6,
                            "author": "lolqwert156",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chile is the most gorgeous in South America... the deserts in the north, central valley, then the glaciers in the south.  Torres del Paine park has to be one of the most stunning places I've seen.   Faroes and Iceland in Europe were my favorites (Svalbard too but only saw with snow cover).  I haven't been to Greenland",
                                    "score": 14,
                                    "author": "valeyard89",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have children? If so, has it impacted your travels?",
            "score": 12,
            "author": "GrandHighWorm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, a 9yo daughter. She's been on several trips, about 16 countries so far including Morocco, Japan, Fiji and Turkey.",
                    "score": 30,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any countries you absolutely wouldn't go back to?",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have revisited at least 80 countries.  There are not any I /wouldn't/ go back to... but some of the smaller/island nations I don't feel a need or desire to revisit.  Probably won't be back to San Marino, Tuvalu, Burundi, Guyana, etc.",
                    "score": 73,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep in mind tourism in Saudi wasn’t even possible until a few years ago. It’ll get there. \n\nPrice I don’t really know as I’ve never tried to take a rental from one country to another. It was 7.5 Kuwait dinar a day four years ago",
            "score": 10,
            "author": "beastiezzo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I managed to score a double-entry transit visa somehow..... I stopped in Jeddah twice on my way to Eritrea.  Now that things have opened up I'd like to go back to visit Riyadh and Medan Saleh.",
                    "score": 17,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Likewise for me.  The Maidan Saleh would be the attraction.",
                            "score": 3,
                            "author": "kvom01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What did u think of Ghana?",
            "score": 9,
            "author": "carlosx86-64",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ghana was great. A good intro country to Africa in general (English speaking, relatively easy to get around, interesting stuff to do/see, etc).  My travel buddies and I flew into Accra, went overland to Togo and Benin, then up to Burkina Faso before crossing into Mali.  Visited the Dogon Country, Mopti and Timbuktu before crossing back into Burkina Faso and back down to Ghana, stopping in Tamale, Kumasi and the Cape Coast slave castles before continuing over to Cote d'Ivoire.",
                    "score": 18,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At what point did you decide to travel to every country, and how has your life changed since then? (Any sacrifices made, different perspectives, etc)",
            "score": 9,
            "author": "negative_delta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was in 2007 or so, after around 80 countries.  I think the original goal was 100, but when going for them all I wanted to finish before turning 45.\n\nNever was career focused... I had the same job for over 25 years until I got laid off this year  My former bosses didn't mind my travel, but my more recent ones didn't care too much for it.",
                    "score": 25,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How was your experience in Pakistan and how was it different from other countries in subcontinent?",
            "score": 9,
            "author": "ansShahza",
            "replies": [
                {
                    "level": 1,
                    "comment": "I scored a great airfare deal into Lahore and out of Kabul.  I'd been to India before so was familiar with the Mughal style architecture, so Lahore specifically was amazing. The Fort was stunning, Shalimar Gardens, Jahangir's tomb, etc.  Went to the border closing ceremony at Wagah which was mental.  I'd still like to see it from the Indian side one day.  \n\nAlso visited the Khewra salt mines on the way to Islamabad. We were there during Ramadan.  Went up to Pir Sohawa and the Monal restaurant for iftar meal.   Everyone we met was friendly and was saying the 'barbarians in the hills' were giving the country a bad name.  This was in 2011 just a few months after they'd caught bin Laden.",
                    "score": 8,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the commenters seem to forget you've been to every county in Texas! Which was your favorite? What took you all around the greatest state?",
            "score": 50,
            "author": "tillandsia_takeover",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was close to finishing visiting every country and was looking for the next challenge.  One of my travel buddies is a geography professor and he said one of his colleagues had been to visit every county courthouse in Texas.  So that seemed like a unique and interesting challenge as I love old architecture.  Started that project in 2015 and finally visited #254 over Labor Day weekend last year.  Over 18000 miles of solo roadtrips around Texas, eating as much BBQ as I could.... I was working on the Top 50 Texas BBQ passport as well.\n\nLink here, you can see the courthouse photos on each marker.\nhttps://www.google.com/maps/d/viewer?mid=1Rucp16eXjLGIsLtfMjSVdERRIQ8&amp;ll=32.89244093653872%2C-98.090097015625&amp;z=7\n\nhttps://www.reddit.com/r/texas/comments/cz989n/254_texas_courthouses_pt_8_final/\n\nI love all the late 1880s/90s Richardson Romanesque ones.  Sulphur Springs and the old one in Marshall are gorgeous. Same architect. James Riely Gordon",
                    "score": 49,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After finishing a month in Colorado I'm headed through Western Texas to the Dallas area. Any recommendations for stops along the way? Coming from El Paso.\n\nAfter Colorado it just seems rather flat and unremarkable, can you prove me wrong? (Hopefully you can!)",
                            "score": 6,
                            "author": "MechE314",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A bit of a detour, but there's Guadalupe Mountains National Park, (not far from Carlsbad Caverns),  Big Bend Ranch State Park, Terlingua, Big Bend National Park, Davis Mountains, Balmorhea State Park.  Further north is Palo Duro Canyon but that's quite a detour.  There's not a lot between Midland and Dallas though.",
                                    "score": 14,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doubling down on this comment. West Texas (west of Midland anyway) might be my absolute favorite area in texas. There's an instrumental band named after Balmorhea. I highly recommend you listen to their song \"San Solomon\" while visiting the state park. \n\nIf you end up coming through the panhandle (read Amarillo) instead, Palo Duro State Park is a very common stop. It's right off Route 66 so there's always international visitors as well (except during Covid..). Cadillac Ranch too. Then stop into Caprock canyons state park and say hello to the state bison herd! The native Americans called this area the \"mountains below the plains\".",
                                            "score": 7,
                                            "author": "tillandsia_takeover"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "gimme your best BBQ in Austin or within driving distance of Austin (\\~30 mins)",
                            "score": 5,
                            "author": "doubleUTF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Valentina's (shh...)  Get their breakfast taco.",
                                    "score": 11,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was your experience like in Zimbabwe?",
            "score": 8,
            "author": "nenishe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been a few times, in 1998 and again in 2002.  Great Zimbabwe Monument, Matopos/Hwange parks and of course the incredible Victoria Falls.  I've jumped off the bridge with rubber bands around my ankles....  went out clubbing in town and a prostitute (too naive to know she was one) bought me a drink.   (Nothing else happened).   At the lodge later that night though got woken up by a woman yelling 'White man give me the money!' at someone else.\n\n1998 (and even 2002) was pre hyper-inflation. I still have Zimbabwe pennies.",
                    "score": 11,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow ; the places you mentioned are incredible. Am scared and l am yet to jump off the bridge ,. \n\nI am a Zimbabwean ,and thank you for the beautiful review of my country .",
                            "score": 5,
                            "author": "nenishe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What languages do you speak?",
            "score": 7,
            "author": "snowburd14",
            "replies": [
                {
                    "level": 1,
                    "comment": "English, and enough Spanish and French to get by (I can read them and Portuguese much better than speaking).  I also had learned some basic travel Russian for Central Asia.",
                    "score": 14,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I grew up in the US but I've also lived in Australia, Mongolia, and Ecuador. Of those three, which did you enjoy the most and why?",
            "score": 7,
            "author": "SatanLordOfDarkness",
            "replies": [
                {
                    "level": 1,
                    "comment": "Australia, then Ecuador.  I could live in either one.  Australia a lot to see/do and Ecuador is cheap...",
                    "score": 7,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel that. I moved to Mongolia in January and fuuuuck it was freezing, like -40 every night. Australia was paradise, if a bit expensive.",
                            "score": 5,
                            "author": "SatanLordOfDarkness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey! I also lived in Mongolia, where were you based?",
                                    "score": 3,
                                    "author": "peachykeenz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What countries do you think are best prepared for the future, based on what you've seen?",
            "score": 18,
            "author": "uxhelpneeded"
        },
        {
            "level": 0,
            "comment": "What have you learned on your travels?",
            "score": 6,
            "author": "uxhelpneeded",
            "replies": [
                {
                    "level": 1,
                    "comment": "People are the same the world over. Just want to make a living and raise their kids.  So the world's not as scary a place as some make it out to be.",
                    "score": 8,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any standout scary moments? Whether it's to do with mode of transport, people you encountered, misunderstandings, weather, hotels... Anything that unnerved you despite being such an experienced traveller!",
            "score": 6,
            "author": "rckd",
            "replies": [
                {
                    "level": 1,
                    "comment": "A few.... in Mali we were coming back from Timbuktu and the driver veered off the road and drove out into the sand dunes.  Tourists had been kidnapped so we were worried we were getting dragged off somewhere. Of course no cell phone signal out there.  But he was just taking a shortcut of some kind.\n\nThe dark and dim hotel I stayed at near the bus station in Asuncion Paraguay was pretty creepy.... walls didn't go all the way up to the ceiling (more like a horse stable!) so I felt I'd be murdered in my sleep.\n\nGot pickpocketed in Rio de Janeiro and St. Petersburg Russia, and had an attempted mugging outside my hotel in Luanda, Angola.",
                    "score": 10,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much for doing this AMA and answering so many replies. I have a million questions I want to ask you but I'll try and stick with one:\n\nWhat were your highs and lows of Iceland? It's my dream country to travel to and It's interesting to hear what it's like from someone who has been... to literally every country.",
            "score": 6,
            "author": "Lather",
            "replies": [
                {
                    "level": 1,
                    "comment": "Iceland was just so gorgeous. I love the mountain and glacial scenery in particular. It was bizarre being in a place with so few trees though.  Plus it was just so vast and empty.... you could drive for an hour and not see another car (well in 2006, maybe different now with the tourism boom).  Downside is wife got bad food poisoning the morning we were supposed to fly out.",
                    "score": 3,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who's itching to visit Iran but discouraged by Visa restrictions (am Canadian), how would you rate the experience of being accompanied by a guide the whole time? Did you feel overall comfortable/welcome?",
            "score": 6,
            "author": "bluesshark",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't need a guide at the time, but I booked one to be efficient and I found the guide quite helpful actually.  Had a female guide and she'd just wave cars down to catch a lift.  She also talked our way into the main mosque in Esfahan which was closed at the time.  I walked around Esfahan and Shiraz some on my own",
                    "score": 6,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am so jealous of you",
            "score": 20,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This may be an odd question but, how’s your love life? Asking because it seems that answering the call to adventure this hard could be really lonely.",
            "score": 5,
            "author": "Beastw1ck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh.. no comment. Married, but yes it takes a toll.  Many of the hardcore/longterm travelers are single.",
                    "score": 10,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which country has the coolest coins, and why is it Denmark?",
            "score": 4,
            "author": "Arctureas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Suriname/Aruba have square coins!",
                    "score": 6,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually haven't yet been to any of those.... I've only been to the independent countries + American Samoa.  The vast chunk of my remaining TCC regions are in the Pacific.  I always wanted to take the LAX-Rarotonga flight.",
                    "score": 7,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which country you advice for solo travel?",
            "score": 12,
            "author": "zirlatovic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd say most of them are fine, 116/197 were solo countries for me.  Europe/North &amp; South America/Australia/NZ/SE Asia are all fairly easy.  Africa and Central Asia can be a bit more difficult as a solo traveler",
                    "score": 35,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/sierranevada007 asks:\n\n&gt; How was your experience, especially as it relates to beaches and diving, in Havelock (Andaman Islands) and how would you compare to other popular beach/diving destinations in Southeast Asia? Also, since you spent a night in Port Blair, what did you think of the city?",
            "score": 7,
            "author": "peachykeenz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beaches were great. On Havelock, we stayed three nights at the Barefoot Resort right behind Radhanagar Beach, which had been rated #1 beach in Asia in 2004 (visited Jan 2007). Basic but nice huts. Other than a campground it was the only place to stay on that side of the island at the time, so definitely lacked the rampant development you probably would see anywhere else in SE Asia. Certainly there were no hotel chains there back then. Looks like there is a Taj resort there now though....\n\nThe beach was great, flat, smooth clear bathtub temperature blue water and empty, though not necessarily secluded as local fishermen would walk by. Super soft white sand with ghost crabs scuttling everywhere. Turtles had come up nesting on the shore, though dogs were digging up the eggs :(\n\nDiving was... primitive. Two of the three dive shops were full the week I was there so didn't have a choice (stuff wasn't bookable online then....) The boat was one of the long local canoes (dunghi), VERY rough once out in the open water and it took us 3 hrs just to get to the dive site. Diving was good and pristine coral, though the water clarity was pretty bad. The 2nd dive was much better.\n\nSpent two nights in Port Blair for the first/last night as the flight didn't connect with the ferry, which was a floating roach motel. There are a few interesting things to see, the Circular Jail of course and the Anthropology museum, but don't have too much else to say about it.",
                    "score": 13,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 3,
                            "author": "sierranevada007"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have many questions about some places. \n\nHave you been to unrecognised countries like Abkhazia? I’d love to visit it.",
            "score": 8,
            "author": "dracosilop",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I have been to Transdneister and Somaliland.  Have not yet been to Abkhazia or South Ossetia. Though at the time I was in Georgia (2005) South Ossetia was still accessible... I was about 1 mile from the border so kicking myself over that one.",
                    "score": 14,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah that’s such a missed opportunity! I’ve heard that the only way in rn is from North Ossetian republic. \n\nAlso what’s your opinion on the ME? I’m planning on visiting most states there, so I’d love to hear your opinion!",
                            "score": 6,
                            "author": "dracosilop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes it is closed off from the Georgian side.  At the time the Russian border was closed to foreigners... my buddies and I went up to the border from Kazbegi but couldn't cross over.  \n\nI love (most) of the Middle Eastern countries.  Turkey/Syria/Oman were my favorites.  Bahrain, Qatar and Kuwait were just OK.  Egypt my least favorite (actually one of my least favorite countries overall).  Israel was just a daytrip so would love to get back there for a follow up visit.",
                                    "score": 7,
                                    "author": "valeyard89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah I see! Returned from Turkey two days ago and I really liked my trip! \n\nGod I would’ve loved to see the historic sites in Syria/Iraq before they went to hell(also before the us made restrictions against travellers who had been there). \n\nWhat’s your opinion on Lebanon and Jordan? Was thinking of going Leb&gt;Jor&gt;Bah&gt;Kuw&gt;Bah&gt;Sau&gt;Maybe further. \n\nIs there public transport from Kuwait to Bahrain(except flying)? \n\nAlso why did you dislike Egypt so much? Haven’t been, but I’m also interested in seeing all NA countries.",
                                            "score": 3,
                                            "author": "dracosilop",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes Turkey is amazing. LOVE the food there.  I've been 3 times so far, visited Istanbul, Capadoccia, Ephesus and Troy/Gallipoli.  \n\nSyria is damaged but a lot is still there... Damascus really wasn't affected by the war, Krac des Chevaliers castle is still there, (most) of Palmyra ruins are still intact, etc.  Aleppo is in bad shape though.  \n\nLebanon and Jordan were great as well.  Had some of the best hummus ever in an old school cafe in Beirut.  My route was mostly overland:  Beiruit -&gt; Baalbeck -&gt; Hama -&gt; Krac des Chevaliers -&gt; Aleppo -&gt; Palmyra -&gt; Damascus -&gt; Amman -&gt; Jerusalem -&gt; Amman -&gt; King's Highway -&gt; Petra -&gt; Wadi Rum -&gt; Amman.  Then flew to Kuwait, then to Bangladesh (was a Round-the-world ticket).\n\nEgypt has great history, but the food and people not so much.  The food mostly sucked, and got food poisoning on top of it, super hot (went in July 2003 during Iraq war), super hassle (baksheesh), dirty/polluted, etc.\n\nYeah North American countries are all fairly easy.. nothing really challenging there.  Favorites are USA, Costa Rica, Canada, Cuba.",
                                                    "score": 10,
                                                    "author": "valeyard89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It really is great! Ended up going to many places around the country including Izmir, Bursa and Ankara! It was my first longer trip( around 2 weeks)! \n\nWould love to see Syria and Iraq when things get better(though for southern Iraq, this really depends on two countries...). Your route between the countries sounds like a great trip! \n\nSad to hear that Egypt disappointed, especially considering its amazing historical sites. Your account of it does make me less eager to go there... For someone who’s only non European visits are to Japan and Turkey, how overwhelming would a solo trip to Egypt or Lebanon be?",
                                                            "score": 3,
                                                            "author": "dracosilop",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lebanon was fine, never had a problem there.  Most of the people I talked with spoke some English or French.  Egypt is just overwhelming/exhausting in comparison.  I never made it out to the Red Sea coast though.  Route was Cairo -&gt; Luxor -&gt; Aswan -&gt; Abu Simbel and return.",
                                                                    "score": 4,
                                                                    "author": "valeyard89",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for doing this!! Which country had the most hospitable people?",
            "score": 3,
            "author": "nicolitis99",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uganda and Nigeria had some of the friendliest. And Sierra Leone everyone was waving and saying hello.",
                    "score": 6,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is possibly one of the best things i've seen on the internet. I can't wait to sit down with some more time and look through the pictures.\n\nThe simple fact that the whole things is done for YOU, YOUR way.......not done just to write about it on your blog or to get views on your YouTube channel, is liberating.\n\nCongrats my man.",
            "score": 3,
            "author": "ex_president",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How was Tuvalu? I've always wanted to go.",
            "score": 4,
            "author": "imanimiteiro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had a much better time in Tuvalu than I'd hoped.. I didn't expect too much there.  But I ran into another traveler on the plane in and we hung out mostly... and met a local who invited us that evening for a kava drinking and jam session (oof my head the next day).  Hired a fisherman boat to take us out to one of the surrounding uninhabited islets and he cooked us fresh fish with coconut juice.",
                    "score": 5,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey as an algerian, i wonder what did you think about the country since we don't have that many tourists here.",
            "score": 4,
            "author": "foufou51",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was surprised how lush and green it was there in the North. I only managed to make it to Algiers and Tipasa... had hoped to visit the interior Hoggar / Tamanrasset but it was a bit iffy at the time.  So cheap there too, I was eating too many milles feuilles in the pastry shops.",
                    "score": 8,
                    "author": "valeyard89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's definitely green in the north thanks to the mediterranean sea especially near tunisia. \n\nAt least you got to visit one of the best city of africa, algiers.\n\nYou should come to visit again the rest of the country, the biggest country of africa / mediterranean sea has many things to offer from the western part of the country (Oran, tlemcen, etc) to the southern part (tamanrasset, djanet, hoggar, asekrem, and especially Tassili n'ajjer). And i'm not talking about other cities such as Constantine, etc...\n\nBtw, i see you ate like a local lol, our mille feuilles are really great (and even better than the french one, i'm french akgerian and i can assure you lol)",
                            "score": 5,
                            "author": "foufou51",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were so cheap! Like $0.30. In the USA you will pay 10X more.",
                                    "score": 2,
                                    "author": "valeyard89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Top stuff man, really amazing project!  \nMy question:  \nIf you could say one phrase in every language, what would it be?",
            "score": 5,
            "author": "Francis_Dollar_Hide",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where is the toilet....",
                    "score": 9,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any countries you would never visit again even if given the opportunity?",
            "score": 3,
            "author": "flying_pussyfoot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably none I wouldn't revisit, but some I don't feel the need or desire to...  I might have to go for visiting them all twice (but it's already been done...).",
                    "score": 8,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are some sights you still want to see? I remember you mentioning Danakil in Ethiopia so I'm wondering what else is still on the bucket list.\n\nWhat country had the worst food? As in like little to no options. Best?\n\nNicest people in your experience?\n\nCountry with the worst infrastructure tourist or otherwise?",
            "score": 3,
            "author": "RICH_PINNA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, quite a few places I'd still like to see, mostly in Africa.  Top of the list is  Antarctica (I've done a sightseeing flight over it but haven't stepped foot there).  A big Sahara trip would be good. Djenne Mosque in Mali (missed visiting it), Gerewol festival in Niger, visiting Ennedi in Chad, Danakil in Ethiopia.  Was supposed to go on an Amazon trip this past June but that got cancelled obviously.....\n\nA lot of island nations can be limited on food options, especially in the Pacific.  I can't remember anything good about Egyptian food, /maybe/ one of the street falafel vendors.  But compared to the other country food options in the region I wasn't impressed.  Some places the food can get monotonous (Central Asia).  Best might be Turkey... I love the kebabs.  Though for high end Michelin star restaurants, France is hard to beat\n\nIn Africa, Uganda and Nigerians will talk your ear off.  They've probably been the friendliest of the bunch.\n\nSome parts of Georgia, Zambia, Malawi had horrendous roads (the potholes had potholes).. but that was ~15-20 years ago. They've probably been repaved by the Chinese by now.   Really a lot of west/central African countries don't have much in the way of tourist infrastructure... hotels are expensive for what you get.  I've always been able to get around in places OK though.",
                    "score": 14,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you visited mainland Equatorial Guinea? If not, any plans to? When researching travel to EG I find ample information about visiting the island of Bioko and the capital Malabo, but very little about the mainland which makes it tricky to plan.",
            "score": 3,
            "author": "sierranevada007",
            "replies": [
                {
                    "level": 1,
                    "comment": "No I missed mainland EQ! I was there in Malabo for the Cup of Nations football games in 2012 (Saw Ghana vs Mali).  There were some matches on the mainland too.  It was only afterwards the Traveler's Century club made Rio Muni a separate place....  yes it was very tricky to find any info at all, much less info on flights.",
                    "score": 4,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Software developer, primary Linux and embedded stuff.",
                    "score": 6,
                    "author": "valeyard89"
                },
                {
                    "level": 1,
                    "comment": "OP mentions in a reply that he's a full-time software developer!",
                    "score": 4,
                    "author": "intoxicatedmidnight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you could go back to one place for 3 days what would it be? 3 weeks? 3 months? 3 years?",
            "score": 3,
            "author": "Archeriize",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Have you been to all the US States?",
            "score": 3,
            "author": "indil47",
            "replies": [
                {
                    "level": 1,
                    "comment": "No... have only 41! My last new one was Idaho and that was already 9 years ago... Basically missing everything north of Oklahoma, plus Delaware.",
                    "score": 4,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m interested in your 2013 trip. How did you find these countries? What was Djibouti like?",
            "score": 3,
            "author": "JokersLeft",
            "replies": [
                {
                    "level": 1,
                    "comment": "2013 trip (The Yemen one I assume) was fabulous.  Visited Sa'ana the capital and a few small towns nearby, plus the Rock Palace.  We were the first tourists in two years in one of the villages.\n\nThen flew to Socotra and spent a few days camping there before going to Ethiopia.  Fed hyenas from sticks in the old town of Harar, then went overland to Somaliland, visited the cave paintings at Las Geel and saw camels on the beach in Berbera.  The airport in Berbera had to be one of the most disorganized/chaotic ones I've been to.   \n\nFlew from there to Djibouti where we went out to Lac Assal.  The local guide we got was a hoot... 4 wives and 12 kids!  We couldn't find an open gas station so were running on fumes getting back into the city.  The old French quarter had some nice Franco-Moorish style buildings.\n\nI'd wanted to visit Eritrea on that trip but couldn't make it work out.  My travel buddy flew home from Djibouti and I continued onwards solo to Uganda.  Went white-water rafting the White Nile \nat Jinja then took an all-day bus to go do a gorilla trek in Bwindi Impenetrable Reserve.  Expensive but incredible to see the gorillas up close.  Quite a slog though! Took about 3 hrs hiking mostly steep uphill through the jungle to find the group.\n\nI'd also wanted to visit the DRC that trip but the rebel group was active still in Goma.  So I continued down to Rwanda, visited the tearjerking genocide museum and stayed at the Hotel Rwanda.\n\nAfter Rwanda I took a bus to Burundi.  Ended up getting stuck there an extra day after the airline changed the flight but didn't change my ticket.... the only time I've gotten stuck in a country. Luckily was able to get a flight out the next day.\n\nA few months later I did visit Eritrea and Saudi Arabia on a separate trip.  Only was in Jeddah but saw the old city and had Al Baik fried chicken, and metup with a Couchsurfing group there (none were Saudis).  \n\nEritrea was fascinating, an old Italian colony and Asmara has some great architecture from the 1920s.  It wasn't damaged during the independence war (I was actually there during their Independence day).  Hired a guide/driver to go to the coast at Massawa where it was stinking hot.",
                    "score": 3,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "No paraguay? :(\n\nEdit: missed it on 2006. \nWhat did you like the most there?",
            "score": 3,
            "author": "BoringlyFunny",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is amazing. Two questions, North Korea?!?!? Were you the only person on the plane lmao?\n\nAnd secondly why so much time spend on Texas? I am fascinated.",
            "score": 3,
            "author": "IamKiva",
            "replies": [
                {
                    "level": 1,
                    "comment": "You had to be on a tour to go to North Korea... there were ~15 in my group, mostly Europeans. I was the only American (but traveling on my UK passport).  We flew into Pyongyang, 4 nights there, then took a 24-hour train back to Beijing.  The plane was an old Soviet jet, I wasn't sure we'd be able to take off.... it took forever to get airborne.\n\nI live in Texas.. so it was just convenient.  I'd been here for years but hadn't gone outside the Dallas/Houston/San Antonio triangle.",
                    "score": 6,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please tell me your thoughts on Albania!",
            "score": 3,
            "author": "KDZags913",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was only in Tirana, then took a bus up to Shkoder before crossing into Montenegro.  The pyramid building was bizzare.",
                    "score": 3,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which one would you say was the most beautiful country? \nWhich one would you say is worth living in most? For someone that isnt too poor/too rich, just normal avarage. \nWhich one is worth visiting the most?\n\nBased on your propably very short visits in most. Try not to be biased towards/against your home country, or to the countries where you were the longest... if possible lol",
            "score": 3,
            "author": "RaTheRealGod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kyrgyzstan, Chile, New Zealand, Norway are some of the most gorgeous countries, but I'm partial to mountains/glaciers.  Kyrgyz and Chile are the more affordable ones.  Chile will get you most everything from desert to glaciers (though they don't have the rainforest), plus Easter Island.",
                    "score": 6,
                    "author": "valeyard89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the dream! Wondering if you held the same career during this time or did it vary?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same job... over 25 years.",
                    "score": 3,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Respect for going to Afghanistan in 2011... I would not have gone there at as a tourist at that time.",
            "score": 3,
            "author": "storander",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have always heard that traveling opens up the mind. What has resonated with you the most during this period in your life? What was something that you experienced that shaped your fundamental understanding of life and answers to its big questions?",
            "score": 3,
            "author": "7arekbas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wouldn't say I've had any earthshattering realizations.  Travel just makes you more comfortable and confident in finding your way around.  People are the same the world over.  A monk can be an asshole too.  Taxi drivers uniformly suck....",
                    "score": 6,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any remaining communities that you visited or know of where Texas German is spoken as a first language in Texas Hill Country?",
            "score": 3,
            "author": "dandwhitreturns",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Have any tips for some of the harder to enter countries / countries to get visas for?",
            "score": 3,
            "author": "invalidmail2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "The hardest ones for me were Uzbekistan, Tajikistan, Angola, Saudi Arabia, Libya, Algeria.  All of them required follow up calls and documentation (in addition to the stated requirements), booking a tour, actual visits to the consulate, etc.  I never used a visa service unless the embassy required it.  Some places make you get the visa in your home country, others you can get on the road.\n\nI make my own visa photos then print out 6 pictures on a 4x6 photo at CVS for like 30 cents.  I sometimes write my own cover letter when requesting a visa.\n\n'Dear consulate section. I would like to request a tourist visa for the Republic of Joe for the following dates XXX-XXX. I will be visiting XXX and staying at XXXX hotel'\n\nI adjust the dates a few days before intended arrival (plans can change unexpectedly - want to make sure my visa is already valid).",
                    "score": 3,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What did you think of tarrant county",
            "score": 3,
            "author": "comrade602",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can't say much about it. I kept getting lost in Ft. Worth trying to get to the courthouse with all the construction on I35W.  I mean I guess I've been through it hundreds of times connecting at DFW...",
                    "score": 4,
                    "author": "valeyard89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really don't want to diminish your experience because it's absolutely amazing, but what do you think of the meaningfulness of traveling to different \"countries\"?  For example, I've found a lot more variety of culture &amp; experiences &amp; even languages in China alone than across about 15 countries in Europe.  Geographically of course, each of Brazil, USA, Russia, China have more diversity/size than all of the EU put together twice (Russia about 4 times).  Do you find the only thing really unique about a country is a shared level of government?  Or do you think there's something else that makes a \"country\" special?",
            "score": 6,
            "author": "rakuu",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ones that have a richer and more varied culture are the ones I end up wanting to revisit.  When visiting them all I get a taste to see which ones I like and want to explore more.\n\nThere's basically 11 'cultural' regions around the world. There is some variability within each region of course but an overall combined commonality with them.\n\nhttps://itsallaboutculture.com/wp-content/uploads/2014/02/world-cultures-map-670x340.gif",
                    "score": 3,
                    "author": "valeyard89"
                }
            ]
        }
    ]
}