{
    "id": "iyc8we",
    "score": 1179,
    "title": "Hey r/solotravel- its me Kyra-AMA from No Country For Moving and Black Solo Female Traveler. Get at me with Q/ if you dare! I'm an open book!",
    "author": "untethered8916",
    "date": 1600874769.0,
    "url": "https://www.reddit.com/r/solotravel/comments/iyc8we",
    "media_urls": [
        "https://i.redd.it/mfqatsk01xo51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Kyra's Intro:\n\n&gt; My name is Kyra, and I'm the 34 year old SOLO BLACK FEMALE traveler, who calls Brooklyn her home. Although these days, most of my travel has been stateside, I always aim to take a good walking tour along with a deep dive of the history of every space, city and locale that I frequent. I'm a passionate urbanist who enjoys creating spaces in the arts and culture with a social justice framework and through the elevation of unheard voices of marginalized communities.\n\n&gt; Case in point, I started a podcast called **@nocountryformoving**. On my podcast, I interview immigrants and migrants from across the globe about their story, political and socio-cultural differences between their native country and their host country, and even what it's like to date outside of their culture! \n\n&gt; What is driving this AMA is that I have been traveling solo since I was 20. First to my parent's motherland of Ghana, and then to countries such as Morocco, Argentina, Spain, Colombia, Ecuador, India, and the list continues! Each time I have traveled solo, I received similar responses from friends and family, \" Are you traveling with friends? Why not choose another country to go to? Are you sure that is a good idea? And each time my response was adamant, \"I'm going and I will be safe.\" Of course, sometimes I wasn't that safe or made the best decisions, but I learned from them, and one thing that I was very sure about was that I needed to share my story and experiences with whomever I could so I could become a resource to the community as well. As a single Black woman, there have been a lot of insurmountable obstacles that I have faced that should be shared and learned from and I'm ready and willing to do that with you!\n\n&gt; My travel timeline for reference:\n\n&gt; * May-July 2008 - Ghana\n&gt; * April - August 2010- India\n&gt; * September 2010- July 2013 - Madrid, Spain\n&gt; * July 2013 - August 2016 - Buenos Aires, Argentina\n&gt; * Patagonia, Colombia, Ecuador April - October 2016\n\n\n&gt; Highlights from the Kyra Tour\n\n&gt; * Running with the bulls twice in Pamplona and only falling asleep once\n&gt; * Getting lost in Las Fallas\n&gt; * Being denied entry on the Moroccan and Spanish border\n&gt; * Chamuyando (charming) my way back into Argentina after a return flight from America\n&gt; * Getting trapped on the Ecuadorian and Colombian border\n&gt; * Trapped in Buenos, Argentina due to a financial snafu\n&gt; * Bloodwork debacles in the era of Zika\n&gt; * Almost going to jail India\n&gt; * Malaria in Ghana\n&gt; * Falling in love in Buenos Aires/Patagonia\n&gt; * Psychotic bosses in NYC\n\n\n&gt; Check out my travel content via:\n\n&gt; [Instagram] (https://www.instagram.com/kymab/?hl=en)\n\n&gt; [Facebook]  (https://www.facebook.com/kyra.bonsu)\n\n\n&gt; Join me for the AMA and follow up by listening to my podcasts @nocountryformoving on iTunes and Spotify and follow on IG @nocountryformoving and [Facebook] (https://www.facebook.com/groups/nocountryformoving) for stories of immigrants, travelers, and people like you. When you do watch an episode, please #nocountryformoving and reference the episode as well as @kymab on IG. \n\n&gt; Do not hesitate to ask me all of the questions, no matter how creepy or off-putting or uncomfortable. Since I'm gainfully fun-unemployed, I'm overeager to answer your questions. So get at me here, IG or Facebook.\n\n&gt; PSA: I'm doing this AMA to dispel the myth that Black women do not travel and to  provide an entrance into a door of a Black female travel experience. **Representation matters!**\n\n&gt; PSA2: I'm open to collaborations in the future around my podcast, so slide into my DMs or PMs.",
            "score": 1,
            "author": "SoloTravelMods",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hi Kyra, thanks for doing this! Is Argentina chill for solo black women? It sounds like it is since you fell in love with Buenos Aires/Patagonia! Any tips for staying safe and enjoying it?",
            "score": 34,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Argentina is hella chill for solo blatck women. Also- there is a lot to see. Of course people will stare and assume but that will happen to you anywhere. Staying safe means- having a plan but also being open to rolling with the vibe.",
                    "score": 44,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great! Thank you so much!",
                            "score": 7,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Assume what? \n\nI've followed you on IG.",
                            "score": 2,
                            "author": "Micro-Fiber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Assume- every stereotype associated with being Black when they see your face😅",
                                    "score": 16,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, got it.",
                                            "score": 2,
                                            "author": "Micro-Fiber",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you want to hear more of my stories feel\nFree to listen to the pod and give me a Rex https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959",
                                                    "score": 5,
                                                    "author": "untethered8916"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You've traveled to a lot of places that women often get told they can't visit solo--e.g., Morocco, India. What were your experiences like there, and what advice would you have for women who want to go but are feeling dissuaded by all the push-back they get from friends, family, and the internet?",
            "score": 52,
            "author": "peachykeenz",
            "replies": [
                {
                    "level": 1,
                    "comment": "My experiences there were incredible! Yes, there were times when I wondered is this safe? But each time, was aware of my surroundings and respectful of the culture. Also, friends and family often feed into the negative stereotypes of traveling to these countries due to media, so take what they say with a grain of salt.",
                    "score": 46,
                    "author": "untethered8916"
                },
                {
                    "level": 1,
                    "comment": "Is Morocco really supposed to be unsafe or just a hassle for women? I never felt unsafe. I got a lot of people wanting money or to sell me something but I’ve been followed in several American cities and used to get harassed every day when I lived in nyc. I guess I shouldn’t operate on the assumption that American cities are considered safe for women though.",
                    "score": 8,
                    "author": "taurist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't feel unsafe in Morocco either, but if you search \"Morocco\" or \"India\" on this sub, it's a common theme.",
                            "score": 2,
                            "author": "peachykeenz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well I’ve seen a lot about being hassled but not necessarily feeling unsafe",
                                    "score": 1,
                                    "author": "taurist"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry if you already answered this, but do you work while you’re traveling or do you save up for a trip and then leave? I’m also a black female solo traveler (well I’ve on one solo trip, so I guess I’m an aspiring one!), and I’d love to travel as much as I can in life, so I was wondering how you manage it financially.",
            "score": 27,
            "author": "brit1228",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do work while traveling and being virtual is supper important! There are so many platforms and roles available for travel. Such as remote.ok and remote woman and flexjobs. I recommend over saving if you intend on saving enough to travel- have a budget and try your best to stick to it and have a surplus fun just in case something goes array and you don’t end up trapped in Buenos Aires, like me😹",
                    "score": 38,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha! I know EXACTLY what you mean. I don’t judge and I always offer to split the bill, however, the conversation will come up at some point that your mommy and daddy paid for your education /student loan/pocket money/savings account and if it doesn’t we aren’t real friends and I’m just going to enjoy alllll the free things.",
                                    "score": 5,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly why I chose to live outside of the country for so long because extended stays are not feasible with a 9 to 5. Also, it’s deeply frustrating to work like a fiend, take vacay and come back to a hellacious amount of emails. Sad reality of moving back to the states. I was not afforded money, comfort, or a relaxed atmosphere ever prior to travel which is why I left.",
                                                    "score": 10,
                                                    "author": "untethered8916",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have seen some serious shit in hostels. Sex in my shared bathroom because that is what happens when you work and live in a party hostel.\n\nOne time I went to a hostel inSweden and the stove didn’t work and the showers were broken and it was supposed to be extended stay💩\n\nAnother time I stayed in a hostel in India and the landlord moved in, then his wife, then their pet. This all happened when I moved to Bihar for two weeks and when I came back, I had my room but it was only a matter of time until they increased the price of our apartment and I luckily was moving back to the states.\n\nAnother time we stayed at a hostel in southern Spain with my visiting sister and my friends and it felt like someone was murdered there- in fact there was a faint blood splatter in the wall🤮\n\nThere is always a too drunk girl too- and every once in a while that girl is 👈🏿\n\nI would go to 🇧🇷 Brazil post Covid. I haven’t gone yet and like you I crave the people and the opportunity to surf",
                                                                    "score": 6,
                                                                    "author": "untethered8916"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for answering!! I’ll check those sites out asap. Getting a remote job is the ultimate goal, I’m going to school for graphic design and am learning web design, so I hope those two skill sets will be enough to support me while traveling. \n\nAlso your podcast sounds dope and I plan on checking it out!!",
                            "score": 8,
                            "author": "brit1228",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You have the PERFECT job for traveling! Bring a drive and get comfortable with your computer!",
                                    "score": 9,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "why were you denied entry into the spanish-morocco border?",
            "score": 12,
            "author": "skylineaptitude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because I forgot a certificate that took me weeks to get before I left the country and without it you are denied entry. It was Spain’s way of monitoring the border during the Arab Spring and making sure ppl don’t come back with drugs I imagine...",
                    "score": 19,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which countries did you find it's people to be the friendliest towards you as a black person **without knowing you're from the west and therefore that not being a factor for the love**?",
            "score": 10,
            "author": "x_Freesoul_x"
        },
        {
            "level": 0,
            "comment": "Hell yeah girl, you inspire me and I’m not black or female. Keep doing your thing 🤟🏽",
            "score": 29,
            "author": "merlejahn56",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right back at you🤘🏿🤟🏿👍🏿",
                    "score": 21,
                    "author": "untethered8916"
                },
                {
                    "level": 1,
                    "comment": "Give the pod a listen when you have the chance https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959",
                    "score": 1,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which city gave you the biggest culture shock?",
            "score": 16,
            "author": "natod12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Delhi and Kumasi Ghana",
                    "score": 16,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm from India I'm genuinely curious. What shocked you? What did you hear that was different from what you saw?",
                            "score": 11,
                            "author": "LoveTatForMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What shocked me how different it was from what I heard and saw in films, friends photos, and stories. I knew it has 1/5 or 1/6 of the worlds population but had no idea what that truly meant. It means there are more people than can be counted in the country. I heard it was racist towards darker skinned people but felt it more as I traveled to areas were the caste system is alive and well. Curry was waaaaaay better and colors were just as vibrant.",
                                    "score": 26,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you experience any racism while you were there?",
                                            "score": 8,
                                            "author": "zUltimateRedditor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes. I did! Fair to say, it’s common everywhere I travel to.",
                                                    "score": 16,
                                                    "author": "untethered8916"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "why did kumasi give you culture shock? i was supposed to travel there in march but it got cancelled due to corona, i would love to live vicariously thru you",
                            "score": 3,
                            "author": "crunchybags",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahah! Family is from there and I imagine it would be so much bigger. But what was big were the personalities and the food and family I met! The city itself is pretty small. Also, I ran into family who knew me on the bus and I hadn’t a clue of who they were.",
                                    "score": 8,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a woman and I travel solo quite a bit, too (not as much as you)! I find myself defending it quite a bit, and over explaining how I keep safe because folks seem more interested in reminding me that I could get murdered than in hearing about all the cool ass places I’ve been. Do you experience that, too? Do you have a go-to response? Do you entertain it, or do you just shut it down? I get progressively more annoyed about it the older I get, and I feel particularly sad about women who are too afraid to travel alone because of all the naysayers. In a similar vein, have you ever actually encountered a place that you didn’t feel safe enough to travel to, or wouldn’t return to? I definitely take safety precautions, but I’ve never let it stop me from going somewhere, so maybe I should be more cautious.",
            "score": 7,
            "author": "boneyjoaniemacaroni",
            "replies": [
                {
                    "level": 1,
                    "comment": "So I forgot to respond yesterday and I’m sorry! But I will say this- every city I have lived in and visited there is one place where I don’t feel comfortable. It is frustrating to explain that you can be more unsafe in your hometown then in a foreign city. I usually\nJust shutdown the convo because they are projecting. For those who are afraid to travel alone I encourage them to take a leap and entertain going somewhere nearby for a night and seeing how it feels. Not all travel needs to be long distance! I haven’t traveled to a lot of places so perhaps one day I can say I was too afraid to go somewhere but as of now there isn’t one that is crossing my mind.",
                    "score": 4,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you ever wanted to pet a shark? Would you do it if you've given a chance to do so?",
            "score": 8,
            "author": "SwingNinja",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would do it but would need to make sure the company hadn’t had any shark biting issues in the oast",
                    "score": 8,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you manage to get by financially during your travels?",
            "score": 7,
            "author": "Xale1990",
            "replies": [
                {
                    "level": 1,
                    "comment": "Savings and working remoteky",
                    "score": 7,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you speak Twi, Ga or any other local languages before you went to Kumasi? I really want to visit Kumasi, Accra and a few places in Volta region but I don’t speak any local languages (“ete sen” “ey3 papa” and “medaase” is pretty much the full extent of my twi). I have distant family there and family here who travelled there more regularly in the past who tell me that everyone speaks English but I’m a little worried that this is kind of a class thing and wouldn’t necessarily apply if I tried to live more normally than they do (maybe taking public transport, shopping in markets, etc)? \n\nAlso how did you find India and where did you go? I’ve heard a lot of negative stories about experiences in India from other black women (mainly those who went to places other than Goa). I’ve recently been considering applying for a job that requires 2 weeks of training there but having to go there alone(ish) for training is one of the few things making me reconsider even applying. If you had a really different experience I’d love to hear it!",
            "score": 7,
            "author": "coconae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey- your twi is pretty awesome for traveling around the region solely!You are correct- speaking English is a class thing here and almost everywhere else in the world. \n\nYou are correct India is difficult for a Black woman due to their caste system (and ours too) and presumptions about us. I would still go! I went to Delhi, Bihar, Jaipur, Agorra, and a few other places.",
                    "score": 8,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the response, it’s really helpful! I don’t think India is for me, I‘m not sure I have the patience tbh. Staring I can handle but taking pictures? That’s a whole lot 😂 but I’ll definitely be heading to Ghana, I’ll just need to accept it won’t be like when I travel elsewhere - maybe I’ll come in December with friends instead! Thanks, I hope you continue to have an amazing travel journey, I’ll def be checking out the podcast",
                            "score": 4,
                            "author": "coconae",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awesome and happy to hear you will check out the podcast! And I do recommend Ghana- with our without friends it will be a sensuous trip!",
                                    "score": 4,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My experiences were people stared and gawked and took photos- but that is nothing new for a Black woman traveling in India or anywhere else. It is an unfortunate factor of being Black. You can choose to ignore , take that damn photo, or decide educate in whichever way you see fit. Sometimes I was exhausted by the photos and I got angry by them, then I realized majority of these people are fed what the media defines as a Black woman and this is their first encounter and unfortunately the adage is true- you represent the epitome of Black woman so choose based on your beliefs.",
                    "score": 15,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting. Sorry you had to for through that. But to be fair, White women go through the same picture taking stuff too.\n\nAlso have you been to Bangalore? Some sections of Bangalore are super diverse. There is an African colony there and many North Indians and ethnic Chinese also have a significant presence there!",
                            "score": 0,
                            "author": "zUltimateRedditor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair White women do, however, caste system propels white women as the holier and better group then Black women and I don’t think degrading comments based on the sexuality I exude as a Black women is as common as for a White woman.\n\nI really wanted to go to Bangalore and hope one day I will! Not only to explore the culture but the enclaves of people who live there.",
                                    "score": 15,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you research your locations before you go or just \"wing it\"?\nWhat do you use for protection as you travel?",
            "score": 7,
            "author": "recklessdagger",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do like a cultural activity, treat of the region, and historical background of where I’m going. Winging it is fun but if it’s a downpour of rain and their is an uptick in kidnappings maybe think twice👾",
                    "score": 10,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! Im from Argentina, and i would like to ask you what place did you liked most from Capital Federal (CABA)?\nSaludos che!",
            "score": 5,
            "author": "xXKamarasovXx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boludo/a me quede en villa crespo y tmb por el\nParque. Sali por Palermo San telmo, caballito, y las afueras",
                    "score": 8,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Que lindo! Gracias por la respuesta, por curiosidad, en que parte de villa crespo te quedaste porque justo vivo en villa crespo jajajaj",
                            "score": 4,
                            "author": "xXKamarasovXx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jaja cerca de Córdoba! Con mi familia Argentina. donde vivis vos?",
                                    "score": 6,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahhh buenisimo yo estoy cerquita, por corrientes y scalabrini ortiz, que loco, estabamos cerquita jajajaja",
                                            "score": 3,
                                            "author": "xXKamarasovXx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "El destino fue! Recuerdo el local que vende solo chocolates en scalabrini Ortiz?",
                                                    "score": 4,
                                                    "author": "untethered8916",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Siiii ya se cual decis!! Alto lugar! Pensas volver a Bs As algun dia?",
                                                            "score": 3,
                                                            "author": "xXKamarasovXx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Un dia segura😍",
                                                                    "score": 4,
                                                                    "author": "untethered8916"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Si queres -escucha el pod y dame una rec por itunes https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959",
                                            "score": 2,
                                            "author": "untethered8916"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can hear the accent so clearly in my mind with “que lindo,” even more than “boludo”",
                                    "score": 4,
                                    "author": "bootherizer5942"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey OP I have a couple questions.  I am by no means a solo traveler however I just moved from California to Chicago on my own.  By far the biggest step I've made.  How did you break down your barriers and decide to do this?  Will I feel alone and out of place for very long?",
            "score": 9,
            "author": "inLikeCyn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg! Moving to a new city is massive!!! Congratulations😛I broke barriers by networking and going to meetups and reaching out to any friends or friends of friends in the new cities I moved to. I remember feeling so alone when I moved and a bit sad but little by little I got familiar with the city and the establishments in the city and my surroundings and then it felt right to stay. Other times - the city and I weren’t a vibe and that’s okay too and I moved on to another.",
                    "score": 14,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes!  Thank you.  Some days I have never felt so lonely and other days I'm so proud of myself.",
                            "score": 3,
                            "author": "inLikeCyn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel proud of you and happy that you made the change! The next weeks and months will show just who you are🤩Embrace it! Sending you love and light🥰",
                                    "score": 5,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey thank you!  It was necessary.  I was home in California, homeless.  [My wife did this](http://imgur.com/gallery/sD7kJQW) and I found myself in a battered women's shelter and I was hopeless to say the least.  My mom offered me the apartment attached to her house here in Chicago and so I left my kids (15f &amp; 17m) in California with their dad and hopped on the Greyhound.  It's been a nightmare and this was all in this month of September.  To say I'm lonely is an understatement but I promised my kids and myself this is the last time anyone will abuse me.  I'm a 36 year old woman and having to restart my entire life.  So yeah like I said some days are harder than others but I'm alive.  And yes I pressed charges.  And I miss California badly but I'll be home once I get back on my feet.  My kids are coming to visit in October if I can get a couple more hundred together for their tickets and if they decide they like it here, this will be our new home.  If not, they will go back to California and I'll be back (different city just closer to my kids) next year.",
                                            "score": 1,
                                            "author": "inLikeCyn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey- thank you for sharing your story you are a truly inspirational person. It take courage to remove yourself from an abusive relationship, so kudos. I hope you get the money you need to help you and your kids readjust. All the love and sending you positive vibz",
                                                    "score": 3,
                                                    "author": "untethered8916",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey thank u so much!  I will be okay financially.  I have a second phone interview tmrw with a big company that is transferrable after 6 months so my fingers are crossed for that.  Everything will come together in time and all 3 of us will be ok and safe.  For now I'm just gonna learn to readjust our lives for the better and find solace in a safe place!  Love to you and safe travels!!",
                                                            "score": 3,
                                                            "author": "inLikeCyn"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How difficult is it to move to another country? Did you live in Spain and Argentina for three years?",
            "score": 4,
            "author": "Marvelous14",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spain 3 and Argentina 4 and traveled through various cities and countries in South America and  Europe",
                    "score": 5,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did you do that? Did you get works visas for those places?",
                            "score": 3,
                            "author": "koreamax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Spain I had a work visa- while in Argentina I was a contractor and paid under the table.",
                                    "score": 7,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting. You were in Argentina on a tourist visa for four years?",
                                            "score": 6,
                                            "author": "koreamax",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I left the country ever 3 months and went to Uruguay to renew😫",
                                                    "score": 3,
                                                    "author": "untethered8916",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Damn, all those border runs must've been expensive. Especially since Argentina charges so much for Americans with tourist visas.",
                                                            "score": 3,
                                                            "author": "koreamax",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sure as hell was! Towards the end I was definitely\nIllegal and stayed in the country unless I was going to Chile or Ecuador or Uruguay by bus.",
                                                                    "score": 5,
                                                                    "author": "untethered8916"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don’t forget to listen to the pod when you get the chance https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959",
                                                                    "score": 2,
                                                                    "author": "untethered8916"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How’d you get a work visa for Spain?",
                                            "score": 2,
                                            "author": "bootherizer5942"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Applied through the government- I was teaching English.",
                                            "score": 2,
                                            "author": "untethered8916"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you want to hear more of my story give my\nPod a listen https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959",
                                            "score": 2,
                                            "author": "untethered8916"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Kyra! As a solo female traveler based in NYC, I feel like a lot of the things I do to stay safe abroad are the exact same things I would do walking city streets alone at night. Meanwhile I have family who boggle at the idea of doing either and give me comments similar to the ones it sounds like you get.  \n\nWould you agree? Or have you found in your experience that one requires a little more caution than the other? Really curious!",
            "score": 3,
            "author": "EclipsedForest",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you completely! No matter where you go and what time it is the same rules apply. And it boggles my mind people are surprised that is the case.",
                    "score": 2,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, after checking the minutes I didn't expect an answer, but you've been active on this for over ten hours!  Kudos!  \n\nAlways really happy to see fellow solo female travelers both on the internet and all over convincing other women it is entirely possible to go it alone. I'm absolutely adding your blog to my list. \n\nAnother question if you have the time? I have a close friend who also travels quite a bit (relevant context: I'm white, she's black, I do a lot of solo traveling, she prefers to go with groups of friends, both of us early 30s) and when comparing stories, she's said how while \"traveling while black\" when passing by another black traveler, like walking on a trail, there's this moment of connection where eyes meet and there's this sort of \"I see you.\" I mean, I do the smile and head nod thing to pretty much anybody I pass by (I'm a New Yorker, I appreciate them doing their thing, me doing mine and we'll all be happily alone together) and I'll admit I do feel it in my gut more whenever it's a solo woman of whatever age and background on the trail that I'm smile-nodding to.   \n\nDoes this match your experience? Also, do you find yourself intentionally seeking black folks in a hostel-like group gathering, or intentionally avoiding/seeking out folks from the states? I know when I travel I purposefully avoid \"the other Americans\" especially since they tend to be quite loud and group-y and I usually want to keep to myself. I've chatted at length with others (admittedly mostly white) about their travel-connection preferences and would love to know yours!\n\nApologies if this is rambling and makes no sense, I truly appreciate you volunteering yourself as the Reddit window into the black female travel experience. And I get to tell my family that other solo female travelers agree; if you know how to be safe in New York, you know how to be safe anywhere in the world!\n\nThank you for taking the time!",
                            "score": 3,
                            "author": "EclipsedForest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes! I’m consistently impressed with the comments and refuse to miss any of them!\n\nHappy as well to see fellow solo female travelers and encourage others to do the same.\n\nTraveling while black is a thing and when you do cross a Black female traveler it’s like crossing a unicorn so I always smile and hell I may even have a chat!\n\nI do like to engage with Black ppl while traveling as well but I don’t always- depends on the day and where I am. I do often hide loud and aggressive American tourists , which are 90% of the American population because my experience and how I act is not the norm and often ppl don’t think I’m from the states, which I don’t mind. PROUD to be an American NOT proud of our foreign policy, nature when we travel, nor historical precedence in many countries from LatAm to Africa.\n\nIf you know how to be safe in NY you can handle yourself anywhere!\n\nYou didn’t ramble at all btw👏🏿You were clear and direct! Thanks for sharing your thought👂🏻And check out the podcast when you get the chance and share along!",
                                    "score": 6,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I kind of want to hear the almost going to jail story!",
            "score": 10,
            "author": "peanutbutterblossom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wellll- I went to this party in a mansion/castle in central Delhi - and Important to note nationalities were Turkey, Mozambique, and me .We wanted to step outside and smoke weed so we left the castle. Fun fact-that is a no-no in India in particularly if you are a woman. We walked to our car. We just finished rolling and we’re lighting up a j and then two policemen showed up and started asking us what we were doing. Then they said this is illegal to do on sacared grounds and they were taking us to the police station. We freaked! I said I was leaving the city soon and my Turkish friend said the same. My Mozambique friend/boyfriend started to plead with him. The cop said- you come to my country and smoke weed here! What’s wrong with you! There was another cop behind him silently as well, a bit larger. I almost started to cry and right when he could see my friend , beginning to curse and pray in Turkish he let up. He said”\nHaha it’s not illegal but you really should t smoke ! It’s not becoming on a woman! I won’t take you to the police station, but give me your names and I better not see you do it again!”",
                    "score": 24,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ugh, yes. *Please* be respectful of the legality of drugs in the countries you visit.\n\nAs a Hostel owner that lives in Mexico, this is a constant problem. Guests and staff can leave on a dime, but if narcos come knocking bc people are using/owe them/have a problem, guess who needs to talk to them?\n\nThis isn’t a laughing matter and we frequently have to kick people out for refusing to understand/be respectful.",
                            "score": 34,
                            "author": "daurgo2001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Understood!! And completely agree! I was foolish and I haven’t made that mistake again!",
                                    "score": 16,
                                    "author": "untethered8916"
                                },
                                {
                                    "level": 3,
                                    "comment": "You should consider doing your own AMA too! I can't imagine how many countless times you've experienced that",
                                    "score": 2,
                                    "author": "TresFacilement",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Heh, you’re right! Ive thought about it multiple times actually. Not really sure how I’d go about doing it though",
                                            "score": 2,
                                            "author": "daurgo2001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm pretty sure the mods from here or from /r/TravelNoPics would allow it if you message them (:",
                                                    "score": 1,
                                                    "author": "TresFacilement"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Solo female traveler here. So far I've been all over the US, with two trips to (English-speaking) Europe. I'd love to visit a wider variety of places, but I only speak English. \n\nHow do you manage around language barriers?",
            "score": 5,
            "author": "Marti_Tenpost",
            "replies": [
                {
                    "level": 1,
                    "comment": "People are typically friendly if you don’t speak the language. I have had complete conversations with people non-verbally and we understand each other😆Dont be afraid of a European country where you don’t speak English! They like to see you try and respect for trying",
                    "score": 10,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I’m 21 (M) and I’m looking to go solo for a little while (anywhere from 12-36 months) once I finish with school in the spring. Any advice on how to make a little cash while doing so? I have some experience bar tending so I was thinking that might be able to get me work abroad. Also, what are places you have been that you would consider must visits. You mentioned you are an urbanite and while I like cities for short periods of time I really want to be one with nature. Any advice on meeting people outside of densely populated areas. Thanks for doing this AMA very cool of you :).",
            "score": 5,
            "author": "mrLarry8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats on graduating!!!🍭🍭⚡️For nature recs I would check out meetups in the location you are going also couch surfing is one of my fav things to do. Finally, check out hiking in Nepal,Swiss Alps, Parque Tayrona- Colombia, Amazon in peru/Brazil, dunes in Bolivia,and outside mexicon city",
                    "score": 10,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! Wondering what extra safety precautions you make as a solo female traveller? Any tricks up your sleeve “just in case”, that you’re willing to part with for a fellow femme?",
            "score": 6,
            "author": "iwearsoftsocks",
            "replies": [
                {
                    "level": 1,
                    "comment": "1.Call ahead for housing\n2.Check your transport is arriving (when applicable)\n3. Look up what you want to do prior and see if it’s possible\n4.Do what you need to do emotionally to prepare, whether that is meditate, go on a walk, pack your bags, etc.\n5. What are the cultural norms of the place you are going? \n6. If you have any food allergies - plan Ahead with snacks. In some spaces - food allergens are almost unheard of.",
                    "score": 10,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Super helpful! Thank you",
                            "score": 2,
                            "author": "iwearsoftsocks"
                        },
                        {
                            "level": 2,
                            "comment": "You are welcome👍🏿",
                            "score": 2,
                            "author": "untethered8916"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you deal with traveling with your period?",
            "score": 6,
            "author": "orange_blossom_soda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Menstrual cup.",
                    "score": 5,
                    "author": "Sub-Blonde"
                },
                {
                    "level": 1,
                    "comment": "Agreed",
                    "score": 3,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry if this is a repeat. You inspire me though! \n\nHow do you stay safe while traveling solo as a woman? I always wanted to solo travel, but was afraid to because of this.",
            "score": 2,
            "author": "Flickthebean87"
        },
        {
            "level": 0,
            "comment": "Hi Kyra...best wishes from another solo travel junkie. Maybe we’ll cross paths one day when the world opens up again. :)\nJulie",
            "score": 2,
            "author": "GorgeousUnknown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely Julie! And in the meantime- feel free to have a listen to the pod https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959\n\nPeace and 💕",
                    "score": 3,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lot of good questions in here, but honestly haven’t seen the real tough hard hitting question yet.... pie or cake ?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahah! Depends on the day of the week. Today- I want 🥧",
                    "score": 6,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What part of Columbia did you stay in? How was the experience there?",
            "score": 2,
            "author": "tredaddy666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Loveeee Colombia! I was in parque tayrona, bogota, Cali, Cartagena. All wonderful ! I recommend parque tayrona and Barranquilla especially.",
                    "score": 7,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, you’re well traveled",
                            "score": 2,
                            "author": "tredaddy666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ty🚴🏿‍♀️ if you are down to listen to my pod-https://podcasts.apple.com/us/podcast/no-country-for-moving/id1530446959 give it a listen",
                                    "score": 2,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best dish you have had abroad?",
            "score": 2,
            "author": "natod12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh god! That is so hard! It’s a tie- drunk schnitzel in Munich, fufu with palmnutt soup in Ghana, or tacos in Plano, Texas. Ooo also- love a Moroccan tajin!",
                    "score": 10,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tacos in Plano, TX?! Glad we made your list! Also, thanks for being an inspiration for female solo travel. Your experiences have opened my eyes to longer term travel than I thought possible! (I lived in Japan 4 years, w a dependent visa, but don’t qualify anymore. #divorcetotallyworthit)",
                            "score": 5,
                            "author": "crocodialdentist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m from Plano👋🏿And extended travel rocks! Also- just bopping from country to country as well which I did when I made another country my home base",
                                    "score": 3,
                                    "author": "untethered8916"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Generally speaking, do you know how hard it would be to travel like this and remain vegan? We're considering moving to portugal but I know they love their seafood and pork there!",
                            "score": 2,
                            "author": "marxr87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean every space you travel to has some obstacles regarding food needs but there are vegan restaurants and a lot of foreigners moving to Portugal due to it being a hot spot so I believe the industry is booming. But again the best way to find out would be to use meetup or just google vegans in argentina",
                                    "score": 3,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what books do you like to read/are reading now",
            "score": 2,
            "author": "ucksawmus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished reading Trevor Noah’s book born a crime and highly recommend it! Also reading growth hackers and have been reading Americanah. Also finished the fire within last month and loved it",
                    "score": 6,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beautiful",
            "score": 1,
            "author": "JoAnn1961"
        },
        {
            "level": 0,
            "comment": "Hi Kyra,\n\nI hope you will consider your travel activities next time, animals used for tourist activity are usually abused and tortured. They don't have a good life. Please don't support this industry. Looking at this picture made me feel sad..",
            "score": 2,
            "author": "tropicaloveland",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed and fully noted!",
                    "score": 4,
                    "author": "untethered8916"
                },
                {
                    "level": 1,
                    "comment": "I don't know why you're downvoted, it's so true.",
                    "score": 2,
                    "author": "thestorys0far"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any essential advice for new solo female travelers out there?",
            "score": 1,
            "author": "the-sumpjuit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recommend planning your housing as best as you can prior to travel and having a plan b. Also, be open to the changes that a trip can provide nothing will go exactly as planned. Finally, be willing to learn and adapt into the culture around you.",
                    "score": 10,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For traveling I recommended shared housing because you meet a lot of people and there are cross cultural exchanges. However, if you like your own space then live by yourself !",
                                    "score": 6,
                                    "author": "untethered8916"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where did you get the idea for No Country for Moving and what's getting a podcast off the ground been like?",
            "score": 1,
            "author": "berlinbaker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got it from a name generator because I was scared of copyrighting issues and  chose the name because - there isn’t just one country to move to for moving. Moving is in your mind and the struggle is adjusting your frame of mind. Getting a podcast off the ground is not easy. I swear it has so many pieces of the puzzle that I’m still figuring out! But I love it so far and happy to be sharing the info. Hope you enjoy it! Just uploaded a few new episodes",
                    "score": 6,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No name calling please! You are correct, animals shouldn’t be ridden - they don’t have a choice.",
                    "score": 4,
                    "author": "untethered8916"
                },
                {
                    "level": 1,
                    "comment": "HEY. You can quit that nonsense right now. This is your only warning, next time it’s a ban. Comment removed.",
                    "score": 2,
                    "author": "peachykeenz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not currently! But flattered nonetheless",
                    "score": 1,
                    "author": "untethered8916"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because there are inherent differences in how the world treats Black and White women and systemic racism is alive and well wherever you travel to.",
                    "score": 10,
                    "author": "untethered8916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not Kyra (and not attempting to answer for her), but here's a few things that happen frequently enough:  \n\n* others not respecting physical boundaries (touching hair, grabbing arms, etc without permission)\n* ignorant questions (whatever the intention, they can still hurt)\n* photos being taken of you (if you just want to be left alone, it can be difficult to be forced into a spotlight, whether verbally or physically)\n* being considered the representative of your entire race (a heavy burden to always get placed on your shoulders and something black people, especially black people who are the only black person in that location/group, have to constantly deal with)\n* not taking \"no\" for an answer, or ignoring obvious discomfort (this happens to women and people with darker skin tones all over, doubly so if you happen to be both, plenty of people have it drilled in their heads that they get to have a say over anyone who fits the above description)\n\nThere's much more that can be listed, but the above points are all typical signs of systemic racism seen in different countries around the world.",
                                    "score": 10,
                                    "author": "EclipsedForest"
                                },
                                {
                                    "level": 3,
                                    "comment": "To reply to one specific point, a single white person is very, very, unlikely to be called upon to be the representative of their entire race. Their country/culture/religion/social group maybe, but those things are not race. \"Black\" has many, many countries/cultures/religions/social groups, and yet a single black person will often be forced into the role of ambassador for all of them, especially when they're the only black person around.  \n\nI'm not going to disagree that women have been subjected to the above, but a disproportionate number of black people constantly continue to be. And while most of the world is starting to swing towards \"it's not okay to do this to women,\" most cultures and people all over the world are still giving excuses when it happens or thinking it's okay to do these things to black people.  \n\nYou said you were looking for some enlightenment and I hope the above will answer your original question. Please understand that sometimes black people are exhausted from explaining this sort of thing over and over again. Plus, considering how often these sorts of explanations are responded to with a defensive lashing out by the person who asked, sometimes black people need to be in the right mental and emotional headspace to prepare to start a conversation. And sometimes, they just don't have the energy, which is completely their right. After all, if you didn't want to bring an issue up with your co-worker/roommate/family member because you knew it would end in a long drawn out argument from them, it is completely within your rights to disengage early or never start the conversation in the first place.  \n\nThis might be why Kyra may not have responded to you as quickly as you wanted and also why I jumped in. Plus, she was very kindly answering questions on this thread for over 10 hours, so once she saw somebody else already expressed the sentiments she had, she only had to give an affirmation of \"yes\" to lend her authenticity.  \n\nI've had people very nicely explain all of the above to me before and I hope you can read this with an open mind and heart. You made a misstep on the internet, but hopefully this will help give you some of the context you said you were looking for.",
                                    "score": 5,
                                    "author": "EclipsedForest"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes yes yes- to alll of the above",
                                    "score": 6,
                                    "author": "untethered8916",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thought you might be tired of re-explaining (cause doubtless you've said this too often).",
                                            "score": 4,
                                            "author": "EclipsedForest"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your comments have been removed for racism. This is your only warning, next time is a ban.",
                                                    "score": 3,
                                                    "author": "peachykeenz"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wow- and you are going to say that you don’t see color either? https://www.merriam-webster.com/dictionary/racism please read the definition and get back to me. Maybe if people like you read a book or two and  knew what racism meant it would be understood?",
                                                    "score": 3,
                                                    "author": "untethered8916"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Here we go...",
                    "score": -6,
                    "author": "juneburger"
                }
            ]
        }
    ]
}