{
    "id": "l11qss",
    "score": 1501,
    "title": "Rest Easy Anthony Bourdain",
    "author": "Charmycole",
    "date": 1611117142.0,
    "url": "https://www.reddit.com/r/solotravel/comments/l11qss",
    "media_urls": [],
    "other_urls": [],
    "postText": "\"Travel isn't always pretty. It isn't always comfortable. Sometimes it hurts, it even breaks your heart. But that's OK. The journey changes you; it should change you. It leaves marks on your memory, on your consciousness, on your heart, and on your body. You take something with you. Hopefully, you leave something good behind.\" - Anthony Bourdain",
    "comments": [
        {
            "level": 0,
            "comment": "Just finished Kitchen Confidential. Love the way he tells stories",
            "score": 207,
            "author": "LoudShovel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, curious if his other book, Medium Raw, is comparable.",
                    "score": 38,
                    "author": "DevonOO7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Medium raw is a tad bit comparable, he talks more about the industry and still mentions traveling.\nThere's a chapter where he just talks about what it sounds and looks like when you're getting food in certain places like Vietnam, Japan, a few other places.",
                            "score": 36,
                            "author": "NevrAsk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Those chapters made me incredibly hungry",
                                    "score": 2,
                                    "author": "golfzerodelta",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That chapter alone gave me the idea of going to Vietnam",
                                            "score": 4,
                                            "author": "NevrAsk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Highly reccomended",
                                                    "score": 2,
                                                    "author": "N0wayjose"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Me too... I've been 3 times since. My favorite country to visit!",
                                                    "score": 1,
                                                    "author": "iamclarkman"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Completely different set of subjects and writing style. Not the same thing as Kitchen Confidential.",
                            "score": 2,
                            "author": "golfzerodelta"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks I literally just downloaded Audible and used this book as my first free book. Looking forward to the listen, he was one of my idols.",
                            "score": 11,
                            "author": "CuriousConvict",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Its great to hear him read it. You will be sad when it's over.",
                                    "score": 1,
                                    "author": "N0wayjose"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Audiobook is killer. Always best when it's narrated by the writer. Amazed by how great a writer he was. Like seriously talented in the vividness of how he paints images with words",
                    "score": 10,
                    "author": "acompletesmeghead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was watching his Indonesia episode of Parts Unknown the other day. He was talking about what he wants to happen to him when he dies and how he’d want to be remembered. \n\n*feels bad man*",
            "score": 126,
            "author": "nolan_is_tall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always got the vibe that he battled with depression on a daily basis, and the thought of killing himself had probably replayed in his mind all the time.  Whenever he used to talk about his daughter though, I got the hope he'd stick it out for her.  In the end though its only the person going through it that can make the change.  The way he talked always gave me the impression it was just a matter of time, but I hope he's at peace now, he certainly deserves it.",
                    "score": 76,
                    "author": "BasiliskSlayer1980",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depression is weird. Just because someone has patterns of self harm, or even regularly fantasizes about killing themselves- DOESNT mean he had those thoughts all the time. Its just depression that sometimes, or an evening or a moment that gets so bad you actually have the urge to do it. Its very likely most of the time he actually would describe himself as happy, depression isn't an emotion is a rot that infects you no matter how you feel, no matter how much you love your life.",
                            "score": 32,
                            "author": "wheatfields"
                        },
                        {
                            "level": 2,
                            "comment": "He shared some of his issues in the Buenos Aires episode of Parts Unknown with the psychologist, he said something like hes got the best job in the world but somehow he feels sad. \n\nThis and the Asturias episode was the saddest episodes for me, the part where he would have a closing monologue was just left blank.",
                            "score": 56,
                            "author": "parttimebackpacker"
                        },
                        {
                            "level": 2,
                            "comment": "He had a lot of demons, I was watching the Azores episode the other day and caught the quip in S5E4 @ 18:50 (see below). Its a shame, his shows were the only honest ones on TV anymore. I still watch them even though I've seen them many times.\n\nPosted byu/autobored\n2 years ago\n\n\"I determine not to hang myself from the shower stall of my lonely hotel room.\" -No Reservations, S5E4 @ 18:50.\nI've been watching Bourdain shows over the past two weeks, and I've lost count of how many times he's made a passing and seemingly humorous reference to suicide (and self-loathing, another regular theme). It's hard to imagine a more prophetic statement than, \"I determine not to hang myself from the shower stall of my lonely hotel room.\"\n\nEDIT: Bourdain referencing suicide by hanging himself in the shower:\n\n\"When you wake up feeling like you're really just not sure whether you want to curl up into a fetal ball and start crying, projectile vomit, or hang yourself in the shower.\"\n\nNo Reservations, S1E2 @ 39:15\n\n\"I determine not to hang myself from the shower stall of my lonely hotel room.\"\n\nNo Reservations, S5E4 @ 18:50\n\n\"The painful story of my life and less than distinguished career ended up as five episodes of a sitcom on Fox, at the end of which I pretty much wanted to hang myself in the shower.\"\n\nNo Reservations, S5E13 @ 7:00\n\n“Generally after these events I want to hang myself in the shower stall, and tonight's no different.”\n\nNo Reservations, Season 1, Episode 9",
                            "score": 25,
                            "author": "elnet1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's been oddly and consistently specific about the hanging himself in the shower part",
                                    "score": 14,
                                    "author": "Feral0_o"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I still haven’t been able to watch since he went. Maybe someday soon.",
                    "score": 21,
                    "author": "OrbitRock_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven't either.  I honestly thought it was just me. It hit me a lot harder than I ever thought something like this would have.",
                            "score": 4,
                            "author": "vossxx"
                        },
                        {
                            "level": 2,
                            "comment": "I'm with you. I didnt know a celebrity passing would hit this hard.",
                            "score": 3,
                            "author": "aripp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven’t been able to watch his shows either. He was a bit more than a celebrity to me, he was much more real. I don’t know how else to put it.",
                                    "score": 1,
                                    "author": "snarkapotamus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Similarly, my last conversation with a friend was about how he wanted a Viking burial, but they aren’t legal in his country, and I said that would be interesting to witness, so he jokingly invited me to attend.\n\nHe wasn’t sick or thinking of taking his own life, it was just a random turn of conversation.\n\nTwo months later he unexpectedly passed away in his sleep, due to a sudden drop in his blood sugar. He was 25.\n\nHis funeral happened the day I flew into his country from half way around the world (for entirely unrelated reasons). We met his parents at the cemetery, and got to pass on our condolences.\n\nBut there was something really strange about standing there at his grave, knowing that he'd *invited me* to do so, months earlier, with no idea that it would actually happen, and happen so soon.",
                    "score": 12,
                    "author": "Misrabelle"
                },
                {
                    "level": 1,
                    "comment": "Been letting it play in the background and catching parts here and there. It’s amazing how magnified the experience is watching during a pandemic lol can’t wait to travel again soon.",
                    "score": 3,
                    "author": "JohrDinh"
                },
                {
                    "level": 1,
                    "comment": "I did too! I actually found it comforting as he didn't fear it and didn't seem to care. Didn't he say he wanted his remains sprayed in walmart or something 😂 lots of love for that guy",
                    "score": 5,
                    "author": "PadfootProngs123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in Keysersberg, France, in December of 2019, and I was lying in bed in the hotel and decided to look up the town's wikipedia entry.  And that's when I learned my wife had hidden the fact that we were, unfortunately, staying in the hotel where Mr. Bourdain had hung himself",
            "score": 73,
            "author": "crash_over-ride",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck.",
                    "score": 16,
                    "author": "wellthismustbeheaven"
                },
                {
                    "level": 1,
                    "comment": "Oh my god that’s horrible!",
                    "score": 1,
                    "author": "LegitimateShift8"
                },
                {
                    "level": 1,
                    "comment": "not by coincidence, surely?",
                    "score": 0,
                    "author": "Feral0_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to watch No reservations constantly before his death, then gave it up when he passed. It was too painful to watch. Just this week I started watching again",
            "score": 61,
            "author": "chloe_yo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh man I’m still not ready. My family thought I was silly for this but he truly was amazing.",
                    "score": 18,
                    "author": "DoofGoot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I caught part of one accidentally in a hotel lobby. Very bittersweet to see him. It must be such a double edged thing for his family.",
                            "score": 5,
                            "author": "RelativelyRidiculous"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "same here, it hurt too much the first year and a half or so. have spent a lot of time this pandemic with parts unknown/no reservations rewatching and discovering episodes i hadn’t seen. the man was such a treasure. RIP",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Same! Both No Reservations and A Cook's Tour.",
                    "score": 4,
                    "author": "azestyorangeskin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I miss travelling so much. I swear I’ll never take it for granted again😢",
            "score": 80,
            "author": "loralailoralai"
        },
        {
            "level": 0,
            "comment": "I still follow him on Instagram... I miss his IG stories. He had such an eclectic taste in music and art. whenever he posted a new photo of himself in some exotic location, I would get so excited because I felt like I was seeing a sneak preview of an upcoming parts unknown episode. I was quite interested in what he did in his everyday life, he was always up to something awesome. I miss him so fucking much. He's the reason I'm always thinking about where I wanna go next, what hidden gem to discover that ordinary people wouldn't dare to go. God damn I love him.",
            "score": 30,
            "author": "kaycee1992"
        },
        {
            "level": 0,
            "comment": "Weird did you post in another travel forum about him?  I know I'm on reddit too much but this is the second post I've seen about him today. I love and miss him too but where he could go?  His art is made, his heart was given, and he'll live forever in every person he inspired and will continue to inspire",
            "score": 20,
            "author": "Bad_Karma21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I posted on another travel group—yes. I just miss him so much. I miss his interviews and series. And I miss traveling so damn much.",
                    "score": 26,
                    "author": "Charmycole",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He changed the way I travel. The way I view the people I meet along the way. Even how I approach the planning. So many awesome things I have tried are because of him.",
                            "score": 6,
                            "author": "RelativelyRidiculous"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was both my inspiration as a chef, and to get out and see the world (remember when we could do that?). Without him, I wouldn’t be An American living in Australia with my Kiwi partner. I wouldn’t have seen the parts of the world I have. I wouldn’t have been completely lost in rural Japan and been confident enough to try the food of a welcoming stranger. Tony is missed. I recommend everything Bourdain to everyone I know",
            "score": 16,
            "author": "sturgeon11"
        },
        {
            "level": 0,
            "comment": "Is Anthony Bourdain some sort of American god?",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes and deservedly so",
                    "score": 26,
                    "author": "JayPetey"
                },
                {
                    "level": 1,
                    "comment": "If you like food and travel, and maybe worked in the restaurant industry, yes.\n\nThere's an entire subreddit dedicated to him",
                    "score": 9,
                    "author": "NevrAsk"
                },
                {
                    "level": 1,
                    "comment": "I’ve heard him described as the American James Bond.  Sorta right - James Bond with a big heart.\n\nEdit: typo",
                    "score": 1,
                    "author": "bumblebarb"
                },
                {
                    "level": 1,
                    "comment": "No he is a coward who left children fatherless.\n\nEdit: Downvote me to hell! Please! So I can personally bitch slap bourdain.",
                    "score": -26,
                    "author": "dicknut420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I won’t downvote you because I understand where this comes from, but I encourage you to not be so quick to harsh judgement. Life is impossibly messy.\n\nDavid Foster Wallace on the topic: \n\n&gt;*”The so-called ‘psychotically depressed’ person who tries to kill herself doesn’t do so out of quote ‘hopelessness’ or any abstract conviction that life’s assets and debits do not square. And surely not because death seems suddenly appealing. The person in whom Its invisible agony reaches a certain unendurable level will kill herself the same way a trapped person will eventually jump from the window of a burning high-rise. Make no mistake about people who leap from burning windows. Their terror of falling from a great height is still just as great as it would be for you or me standing speculatively at the same window just checking out the view; i.e. the fear of falling remains a constant. The variable here is the other terror, the fire’s flames: when the flames get close enough, falling to death becomes the slightly less terrible of two terrors. It’s not desiring the fall; it’s terror of the flames. And yet nobody down on the sidewalk, looking up and yelling ‘Don’t!’ and ‘Hang on!’, can understand the jump. Not really. You’d have to have personally been trapped and felt flames to really understand a terror way beyond falling.”*\n\nHe loved his daughter. It isn’t about bravery or cowardice or that life’s debits and credits do not square. The flames were just too hot for too long.",
                            "score": 20,
                            "author": "2yrnx1lc2zkp77kp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You have kids? If yes, I hope you find the strength to never leave them and can’t fathom how you sympathize with anyone that does. If no, you’ll get it one day, hopefully.",
                                    "score": -18,
                                    "author": "dicknut420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So if you have kids, you should just simply brush aside mental health and crippling depression? You don't sound like you've experienced it before its not that easy. \n\nI understand where you're coming from but unfortunately life isn't plain and simple as that.",
                                            "score": 5,
                                            "author": "Jmcur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No. Absolutely not, but we’re not talking about an individual who worked in the coal mines and struggled to provide for his children. This chicken shit of a human legitimately had ALL THE MEANS AND ACCESS in the world to get help and chose not to ask for help and instead did the most selfish thing he could’ve. I would never quit on my children no matter how deep the pain was. I used to adore bourdain until this. \n\nNow. If you’re in the camp that he was going to expose pedophiles and got epsteined then I hope you’re right and hate that he was taken. However I don’t really think that’s the case.",
                                                    "score": -7,
                                                    "author": "dicknut420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It appears you have little to no understanding of how mental health problems actually work. Your comment is ill informed and also offensive to people who have lost loved ones to suicide.\n\nInstead of all the hate maybe try and work on developing a bit of compassion for someone who was in that much unbearable pain it made no longer being alive feel like the only available option. If you’re struggling to comprehend this then you’ve probably never experienced it - in which case count yourself lucky.",
                                                            "score": 3,
                                                            "author": "CrispyShreddedQueef",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don’t care what my internet comment appears like to you. You assume I haven’t lost anyone close myself. How ignorant of you. Like I said. This man had all the means and access to any help he could’ve imagined. Legitimately. This isn’t a struggling father who is drowning in debt and can’t see the light at the end of the tunnel. This was a self absorbed man who only thought of himself. Kids need warriors to protect them. He couldn’t battle on and doesn’t deserve adoration in my opinion. Whether you like it or not that’s how I feel. Thanks for your judgment.",
                                                                    "score": -3,
                                                                    "author": "dicknut420",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You clearly do care or you wouldn’t have replied.\n\nI sincerely hope you haven’t lost anyone close to this - and I do genuinely mean that. But if you have do you hold them with the same contempt you do for Bourdain? \n\nMental health issues have little to do with wealth so I don’t see the connection you’re trying to make with being in debt. Phrases like “light at the end of the tunnel” and “battle on” make me think you’ve not got a true appreciation of just how bad things can get when you’re in that place. Therapy and medication are definitely powerful tools and have helped a lot of people (including myself) but sadly it’s not just a matter of “reaching out for help” and you’ll suddenly be fixed. \n\nIt’s fair to say the world does have a lot of adoration for Bourdain - but it’s for the things he did when he was alive not the fact he took his own life.\n\nUnfortunately when you make comments on the internet people will judge you, especially when they come across as ignorant as yours. If you don’t like that then maybe refrain from making inflammatory comments in the first place, particularly in a forum where the majority of people will find them offensive.",
                                                                            "score": 2,
                                                                            "author": "CrispyShreddedQueef"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Say that to his face, coward.",
                                                            "score": 1,
                                                            "author": "BiskyJMcGuff",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I will. Maybe not call other living redditors names in respect of the rules of this sub u/biskyjmcguff \n\nDid you see my edit up there? If you downvoted me to hell I will bitch slap that weakling of a man myself. I hope he’s choking on the devils tube shaped meat.",
                                                                    "score": -1,
                                                                    "author": "dicknut420",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wow you mentioned my name. I’m not harrassing you. I could make a better case for you subtracting from the inclusive environment by posting your mental health hot take, u/dicknut420\n\nMental health is a real problem. Suicide isn’t a good thing, but illness can take away any feeling that you can escape or even use the resources you may have to get help.",
                                                                            "score": 1,
                                                                            "author": "BiskyJMcGuff"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like someone left you fatherless",
                            "score": 7,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Suck my dick you piece of shit.",
                            "score": 2,
                            "author": "jester070993",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awwww. Did your feelings get hurt by a stranger on the internet?",
                                    "score": -5,
                                    "author": "dicknut420"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"I remember the moment I first realized I've been living my whole life in black and white. It was like discovering a color I never knew existed before. A whole new crayon box full of colors, that was it for me. From then on, there was no putting the pieces back together. No going home. Things were different now. Asia had ruined me for my old life.\"\nThis is the quote that always gets me and helped frame my love for Southeast Asia. Watching him now is too painful-",
            "score": 9,
            "author": "hipposea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its like the giver!",
                    "score": 1,
                    "author": "lookiamapollo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was actually on a bus to Granada when I found out he had died so will never forget that day, he wasn't my main 'idol' when it comes to travelling but the way he expressed his love for exploring cultures through his shows and quotes really validated the things I loved about travelling. \n\nTo me, he didn't go to all those places just to film generic tourist things, it felt like he was there to experience their daily lives even just for a few days - something I admired with his shows and approach to travelling.\n\nRIP Tony.",
            "score": 8,
            "author": "parttimebackpacker"
        },
        {
            "level": 0,
            "comment": "He always seemed to be so insightful, worldly wise and such a humble man, who had his demons.\n\nSometimes I wonder if his depression manifested itself from his days of being a heroin addict but after getting clean it just sucked all the joy out of his life and no matter where he was or what he was doing, he could not feel happy.  \n\nHeartbreaking and a special man gone too soon💔",
            "score": 3,
            "author": "Poneke365"
        },
        {
            "level": 0,
            "comment": "It’s a tragedy to me that he’s not well known outside of North America. Lots of other travelers have no clue what they’re missing.",
            "score": 6,
            "author": "JayPetey",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's pretty well known in this part of the world (south America), it's just that perhaps his influence isn't that big travel wise because it's not easy for people to relate to his kind of traveling (white rich guy), at least in most of SA. I loved him though, it ruined my entire week when I found out he died.",
                    "score": 2,
                    "author": "fuckyouyoufuckinfuk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I could see that. He provides an introspective and thoughtful take, while still trying to have an authentic experience.\n\nI feel like I can experience it in people. Its like they think deeply about the world and provide insight you often never see. \n\nHe does a good job at that insight, which I appreciate",
                            "score": 1,
                            "author": "lookiamapollo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How is that even possible? I wonder if parts unknown isn’t distributed globally very well",
                    "score": 1,
                    "author": "winterspan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They put it on Hulu and HBO max recently, but I don’t know about Australian availability. It’s worth pirating from bittorrent if you have to.",
                                    "score": 2,
                                    "author": "winterspan"
                                },
                                {
                                    "level": 3,
                                    "comment": "As an Australian I can assure you that we know who Mr Bourdain is! His shows have been on repeat on SBS (free to air) for most of my adult life.",
                                    "score": 1,
                                    "author": "Ok-Row3020"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Travelling is a passion for me. It always changes my perspective, my outlook on life. Anthony said it well.",
            "score": 5,
            "author": "1-smallfarmer",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was a poor single mom I took my children places. Family felt I misspent my meager funds. I wanted my kids to feel that change. I felt it made them better citizens of the world. You cannot travel and meet local people and do local things without opening your mind to feelings and possibilities. It makes your life ever after better.",
                    "score": 2,
                    "author": "RelativelyRidiculous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldn’t agree more! My daughter and I have taken road trips together as well as to Scotland in 2019. We make the best travel companions...and I think I’ve passed my love of travel and adventure on to her. Travel is never a waste of money, because it’s always educational.  😊",
                            "score": 1,
                            "author": "1-smallfarmer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a channel on twitch which plays no reservations and parts unknown episodes 24/7.\n\nHere's that link of the channel:\nhttp://www.twitch.tv/anthonybourdainrip",
            "score": 4,
            "author": "vocalistsXD"
        },
        {
            "level": 0,
            "comment": "I am 48 hours away from getting a portrait of him tattoo'd on my chest above my heart &lt;3 can't wait to share it",
            "score": 16,
            "author": "Pat-y-Sal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd stage an intervention but I'm also not sure what other monstrosities you wear on your body already",
                    "score": 14,
                    "author": "Feral0_o"
                },
                {
                    "level": 1,
                    "comment": "Don’t do it man...",
                    "score": 31,
                    "author": "AphexBau5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s probably what he would say",
                            "score": 29,
                            "author": "OrbitRock_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree. if you didn't know him that's more than a bit weird and he would probably think so most of all. He was not about hero worship at all",
                                    "score": 18,
                                    "author": "starmartyr11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I almost bought a t-shirt with a photo of him on it the other day and then didn't for exactly this reason.",
                                            "score": 2,
                                            "author": "toxic-optimism"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yikes",
                    "score": 1,
                    "author": "Key-Championship3462"
                },
                {
                    "level": 1,
                    "comment": "wow I can't wait to see that!",
                    "score": -1,
                    "author": "SoakieJohnson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not someone who normally idealizes celebrities or is particularly affected by the deaths of celebrities I don't know. Anthony Bourdain may be one of the only exceptions. His death hit me like a ton of bricks and it still feels raw today. His love of exploring, of discovering cultures, of being open to experience, is truly what travel is all about. His shows were about far more than food; they were about people.\n\nHe battled his demons back time and time again until they finally got the best of him. I hate that. But I love the legacy that he gave all of us.",
            "score": 4,
            "author": "segacs2"
        },
        {
            "level": 0,
            "comment": "Didn't even know the man, but my heart hurt when he passed. He made doing what does best seem cool and inspiring.",
            "score": 2,
            "author": "MegaManFlex"
        },
        {
            "level": 0,
            "comment": "There will never be another Anthony Bourdain. He clearly read a lot of literature, thought deeply about stuff, didn't grow up surfing the web, took lots of horrendous drugs, and was a by product of a very specific era. Also, you can tell he lived with a lot of regrets, didn't glorify himself. I miss him a lot. More than Christopher Hitchens, another guy I really enjoyed listening to, his neo con defending aside.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "a man I looked up to and learned a lot from. Thank you for the inspiration!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I got caught in a torrential rainstorm in Atlanta, Georgia while out biking around the city and on my way to a bridge for cover something got caught in my front spokes and sent me flying. Picked up a scar that runs nearly the length of my forearm and one on my knee also but it’s nearly faded now. So, yes, it can and will leave marks on your body as well 😄\n\nIt’s alright though, they tell me chicks dig scars",
            "score": 3,
            "author": "Parradog1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Getting caught in a downpour you hadn’t anticipated? Sounds like you had an authentic Atlanta experience, at least for a certain time of year",
                    "score": 1,
                    "author": "WalkingEars"
                }
            ]
        },
        {
            "level": 0,
            "comment": "aw, i miss anthony 😞",
            "score": 2,
            "author": "eeba18"
        },
        {
            "level": 0,
            "comment": "I think enough time has passed that I can now resume watching the last season of Parts Unknown.",
            "score": 1,
            "author": "dxtos"
        },
        {
            "level": 0,
            "comment": "Chefs, and restaurant workers in general, know how superficial and fake the hospitality industry really is. We bend over backward to make it how you want it and truly want to only give you the best possible experience. And when you work in a joint that has that extra spark, then you become like family. Catch is, within 2 years you, or half the staff, will likely move along to someplace else. It’s a transient lifestyle. Not saying that you can’t put down roots, but unless you own the business you work in? It’s probably not gonna last. We are sadomasochistic at the heart. Working 80+ hrs a week doing drugs and drinking booze to keep going and then to shut down. The mental health problem in restaurants is second to none. But we love these broken culinary assassins. They are our kin. So pay attention when you go out to eat to how the back of the house is if you can get a peak. And a quick word to one of the cooks will light him up like Christmas. This pandemic has crushed many of our dreams. And my heart goes out to all my brothers and sisters out there chained to a fryer. Love y’all!",
            "score": 1,
            "author": "Dfreshie"
        },
        {
            "level": 0,
            "comment": "RIP one of the realist",
            "score": 1,
            "author": "unsociallydistanced"
        },
        {
            "level": 0,
            "comment": "Chantix. Wasn’t that the culprit? One of them at least?",
            "score": 1,
            "author": "Trixietrue"
        },
        {
            "level": 0,
            "comment": "definitely my inspiration for travel and new experiences, dude had an amazing persona to him. Very personable, humble and open.  \n\nWhat are some of his top show - or specific episodes you guys would recommend? Specifically websites online  watch?",
            "score": 1,
            "author": "jester070993"
        },
        {
            "level": 0,
            "comment": "I’ve been working my way through parts unknown for about a year now and more recently I’ve become more fond of bourdain. I really liked him and feel genuinely upset that he’s gone now. There’s a part of me that relates to quite a lot of what he says, it can be hard to stay positive when you see what some people are going through. But you gotta!",
            "score": 1,
            "author": "thefacesitter"
        },
        {
            "level": 0,
            "comment": "His passing crushed me and I wasn’t able to watch his shows either like a few others have posted. Still haven’t gotten around to it. He was so bad ass. Maybe I’ll get to watching soon.",
            "score": 1,
            "author": "ladyknowssumstuff"
        },
        {
            "level": 0,
            "comment": "Has there ever been a better travel blogger? I just find whatever he says to be captivating. He could be talking about the most mundane aspect of the society he is visiting and I am glued",
            "score": 1,
            "author": "P0NCHIK"
        },
        {
            "level": 0,
            "comment": "Sometimes when I was lonely traveling he would narrate places in my head, I couldn't understand at first why it hit me so hard when he died. In retrospect I guess I lost a travel buddy in some weird way.",
            "score": 1,
            "author": "SOHJohnBoner"
        },
        {
            "level": 0,
            "comment": "He was a truly amazing person\n RIP Anthony.\n\nI need to watch the show again.",
            "score": 1,
            "author": "GothWitchOfBrooklyn"
        },
        {
            "level": 0,
            "comment": "It's weird I just started watching his series on HBO last night. Knew he had passed away but tried not to think too much of it. I definitely remember always checking the travel channel as a kid to see if his show was on. He definitely helped nurture the travel bug that I still have to this day.",
            "score": 1,
            "author": "homie_down"
        },
        {
            "level": 0,
            "comment": "Harvey Weinstein had him killed.  They destroyed his body without an autopsy.  Allegedly",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why is nobody questioning his death?\nHe hated the Clinton's and Harvey Weinstein. Watch his last interview and his last Twitter posts. \nI know he battled inner demons, but you know what they say - Cross the Clinton's and get killed\n\nR.I.P Anthony🥀",
            "score": 0,
            "author": "187spiderweb"
        },
        {
            "level": 0,
            "comment": "When are you guys going to stop treating an average guy who made average tv shows like a god? Get out there and travel, I promise that you can have way more authentic and adventurous experiences than Bourdain and his camera crew.",
            "score": -1,
            "author": "Brokenhardstyler"
        },
        {
            "level": 0,
            "comment": "Dude, he’s been dead a while.",
            "score": -7,
            "author": "MechaGojira3000",
            "replies": [
                {
                    "level": 1,
                    "comment": "about 2 years ago... not that long ago..",
                    "score": 2,
                    "author": "jester070993"
                },
                {
                    "level": 1,
                    "comment": "Bro Godzilla is old, why is that your user name, don’t you know it’s not real ?",
                    "score": 1,
                    "author": "BiskyJMcGuff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a dumbass question. No, mother fucker, I really believe it was real and not a guy in a costume.",
                            "score": 1,
                            "author": "MechaGojira3000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know. I’m being facetious. I’m trying to imply that none of that matters. You’re being a dick. This guy can miss Anthony Bourdain 2 years after his death just as you can use Mecha Gojira- which hasn’t seen the screen prominently in maybe more time- as your username.",
                                    "score": 1,
                                    "author": "BiskyJMcGuff"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude was a lil bitch",
            "score": -6,
            "author": "[deleted]"
        }
    ]
}