{
    "id": "vnmmg1",
    "score": 1430,
    "title": "What's the biggest mistake you've made while traveling?",
    "author": "cwkid",
    "date": 1656527273.0,
    "url": "https://www.reddit.com/r/solotravel/comments/vnmmg1",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm a dumbass who thought he booked tickets to go to Machu Picchu, but it turns out I forgot to pay, and my reservation was cancelled 5 hours after I made it a few weeks ago.  And for those of you who don't know, Machu Picchu is basically booked weeks in advance and I'm leaving Peru before the next spot is free.  But I didn't realize this until I was at the train station and decided to ride the train and test my luck, which didn't work.  And now I'm sitting in a restaurant in Agua Calientes contemplating my poor attention to detail lol.  Though on the plus side, I was able to snag a table with a good view, and the train ride itself was fun.\n\nAnyways, it would make me feel a lot better to hear about other mistakes people made, ideally of this same nature.",
    "comments": [
        {
            "level": 0,
            "comment": "Arrived in Mozambique with only South African Rand. I thought I’d be able to withdraw some cash from an ATM or pay for the visa on arrival with card, but for some reason my card wasn’t working. I couldn’t get into the country because I didn’t have the correct currency to pay for the visa, and my cards weren’t working to withdraw any cash. Luckily a kind person behind me offered to pay for my visa and I was able to get into contact with a family member to help check on my cards and activate them. It was one of the most touching moments of kindness I’d experienced, and also a lesson to always always always carry enough cash on you while traveling.",
            "score": 720,
            "author": "Explorer_Waste",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was in Barcelona with my family, my backpack with my US Passport got stolen the day we were leaving Spain to head back to the US - my family took the flight without me (no need to waste 3 tickets, impossible to schedule last minute) and I stayed with a friend for the next 2-3 days until the US Embassy opened so I could get a new temporary passport.\n\n\nAnyway, when I got to the US Embassy when it opened on Monday morning, there was an American girl who also had everything stolen, including her phone - she was calling her mom from the Embassy phone asking her mom to wire transfer money (Western Union) so that she could pay for her Emergency Passport.\n\n\nI overheard the conversation (waiting room is pretty small, I had nothing else to do), heard that it would take days for the transfer, and then I offered to pay for her emergency passport as I still had my wallet on me (I had to pay for my emergency passport too).\n\n\nThe way her face lit up and how she told her mom the good news was incredible.\n\n\nEven the lady working at the Embassy desk responsible for paperwork &amp; processing thanked me as she also overheard the conversation.\n\n\n\nShe obviously got my contact information and paid me back within 2 days, but we got to spend some time walking around Barcelona that day before she headed back and then me the next day",
                    "score": 266,
                    "author": "whateverisok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very very cool of you!",
                            "score": 43,
                            "author": "throwawaylurker012",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you though! The part that sucks the most about it (I didn't mind the inconvenience) was losing my passport that had ~7 years of immigration/country stamps, which is always cool to look at.\n\n\nLike all over Western and Northern Europe (17 countries), I did a Southeast Asia trip (7 countries), Morocco",
                                    "score": 40,
                                    "author": "whateverisok"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is a good lesson. I always prefer to carry my debit card which has free ATM withdrawls world wide. (So I don't get a lot of cash stolen). But coming into the country with some cash on hand to start with is a good idea.",
                    "score": 96,
                    "author": "De5perad0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's essential to get out of the airport in many places.",
                            "score": 27,
                            "author": "tinyorangealligator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is why I travel with back up currency in a sock in my medical bag",
                    "score": 22,
                    "author": "145bit",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've got a similar one:\n\nThe first time I went to Japan, I couldn't find any exchanges which had Japanese Yen at home (in Budapest, Hungary). Seriously, I tried like 6. I got to the airport, tried 2 exchanges there, no luck, but one of the clerks swore they had to have some in another booth \"inside\", after you go through the passport check. I went through, found the \"inside\" one, surprise: no Yen. About 16 hours later, I arrived to Tokyo without any Japanese Yen in my wallet.\n\nFortunately, the visa is free and easy for us Hungarians, so I got into the country, but had no money I could use. I needed to take a bus into the city, but the bus people only took cash. It was evening and every shop and exchange was closing at the airport one after another. My right ear also got clogged during descent and *really* didn't want to unclog, and I was wearing my glasses which are a bit weaker than I need because I usually wear contacts when I leave the house. I was practically half-deaf and half-blind.\n\nI asked like 3 attendants if they knew where I could exchange Hungarian Forints to Japanese Yen, but I think one didn't even understand me, and another one sent me to an exchange which didn't want my Forints (can't blame them). Finally, the 3rd one actually pointed me to an exchange at a far corner of the terminal, I got there like 10 minutes before it closed and finally managed to exchange some money at a horrendous rate.\n\nNow here's the fun part: I had about 50 Euros in my wallet. I'm preeeeetty sure any exchange would've happily taken them, but in my half-deaf, half-blind, panicked state, I hadn't event thought about trying.\n\nLive and learn, I guess.",
                    "score": 167,
                    "author": "bem13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess in many countries you can exchange Dollars or Euros easily.",
                            "score": 33,
                            "author": "Europe-an",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh man that's rough! Were there no currency exchange options on arrival? How were you supposed to get the right currency??\n\nI always carry extra USD because I had a similar mishap in Thailand where my debit card was locked on arrival and there was no Wifi in the airport to contact my bank. I had some USD but not quite enough for a taxi to my hotel, luckily they accepted it anyways after a bit of begging on my part.",
                    "score": 44,
                    "author": "ghostyduster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes I also forgot to mention that the amount of Rand I had wasn’t enough to cover the visa. After I was struggling for 15 minutes they offered to accept the rand, and I embarrassingly realized I didn’t have enough. 😵‍💫😭",
                            "score": 32,
                            "author": "Explorer_Waste"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had something similar crossing into Northern Laos quite a few years ago.  \n\nWheres the nearest ATM please? \n\nOh we have two\n\nCool where please?\n\nVientiane.",
                    "score": 13,
                    "author": "Not_invented-Here"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Partied the whole night at LKF, Hong Kong and went back to my hostel at 6 am. I had a 9:30 am flight home but figured I'd take a ^tiny nap since my backpack was all packed and I'm already checked in anyway. \n\nI woke up at at 9:45 am.",
            "score": 441,
            "author": "unanatkumot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have this nightmare the night before I leave for every trip I take.",
                    "score": 262,
                    "author": "jjonez18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. Especially for early flights as not an early bird at all…",
                            "score": 49,
                            "author": "SamaireB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I will never not ask an acquaintance (gf, mom, friend) as a plan B when I need to wake up early for a flight. \n\nNot even a week ago I flew to SFO from AMS and I had to take the first train at 5:15 or something. I asked my mom (who is a morning person) to give me a call at 4:45 just in case. \n\nShe didn't have to call, but at some point someone will have to :)",
                                    "score": 23,
                                    "author": "Taronyuuu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha I hear you. My brother works shift and often gets up at 2:30/3:00am, so on more than one occasion I asked him to give me a call at 6 or so to make sure I got up on time for whatever early-ish flight I was on. 99% of the time I wake up before he calls, however one time, I was still jetlagged from returning from US Wedt to Europe and had to fly to DXB two days later for work. Unfortunately jetlag hit that night. My flight was at 1 and I live a good hour from the airport. I woke up at 3am, fell back asleep, and then startled awake at 10.30. I literally dashed out of the house, drove like a maniac to the airport and miraculously made the flight. It was the one time I hadn't ask my brother to call me as it wasn't actually a super early flight - and I've been ultra paranoid ever since 😅",
                                            "score": 11,
                                            "author": "SamaireB"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you haven’t gone too big in LKF the night before your flight, have you even really been to Hong Kong 😂",
                    "score": 26,
                    "author": "whine-drinker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in Hong Kong and I've done the same thing 😂 hangover on a flight to Singapore is not ideal 🤮 they have this patch of area that always has turbulence.",
                            "score": 13,
                            "author": "Extreme_Week2727"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hi, A noob here, what's LKF?",
                    "score": 17,
                    "author": "stupidbitch69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lan Kwai Fong - Hong Kong's downtown bar district.",
                            "score": 26,
                            "author": "Benjamin_Stark",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This one hits so hard - I also partied in LKF before a 7am flight. Got back at 3am, drunk me decided to wake up at 5am (?). Was at the airport 50 minutes before flight left, check-in counters where empty (what a surprise). There I was, worst hangover, having missed back my flight to London. Ah well. Lesson learned.",
                    "score": 42,
                    "author": "danfl44",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "First ever trip on my own to Nepal and Thailand. Got instructions of whst to do on my 16 hour layover in Hong Kong. Was so nervous and anxious being alone for the first time that I followed everyone to the transit and when I realized, I was told I couldn’t get out. Spent the next 16 hours exploring every single nook and cranny of that airport. It’s pretty sweet, but not 16 hours sweet lol",
            "score": 139,
            "author": "Mpiga_Mapepe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol I had the opposite problem, first trip to Thailand, first time out of my small country. Had an hour in Hong Kong airport to catch my connecting flight, running around like a headless chicken, somehow made it.",
                    "score": 37,
                    "author": "ToastFaceKiller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Using points, I booked a one way flight to get me to Nepal: AMS - FRA - DEL (Delhi) - CCU (Kolkata) - KTM.  Lots of stops, but basically a free flight (points!). Great!\n\nI had done tons of solo travel all over at this point, and never thought anything further about my flight until I arrived at AMS airport. \"Do you have an India visa?\". \"No, I'm just transiting on my way to Nepal and I can get that on arrival.\" I guess they didn't think anything further of it either.\n\nSo I arrive in Frankfurt airport, get to my gate, and the Air India agent asks to see my India visa. \"No, I'm just transiting on my way to Nepal.\" He lets me on the flight. Clearly he didn't think anything further of it.\n\nOn my flight to Delhi, I start to think more about this. I'm transiting, yes, but I'm also taking an intra-India flight to do so. I hadn't thought about this when booking or so confidently explaining my situation to the gate agents. I looked through the information in the booklet on the flight and it explained that some flights were transiting internationally (with XYZ flight numbers), but some were considered domestic (with  other ABC numbers). My ongoing flight was ABC. Uh oh.\n\nI arrive to Delhi and sure enough, someone does think further or my situation. There is a man directing people to either immigration or sterile transit (no customs needed for a transfer). He looks at my flight number on my next flight and points to customs. \"So you see, that's not going to be possible...\".\n\nSo instead, I ended up in a room full of people who also made visa fuck ups and were awaiting deportation. In the end, Air India eventually came through for me and got me on a direct flight to KTM. Huge props to them.",
            "score": 142,
            "author": "edgeoftheworld42",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's absolutely amazing they did that",
                    "score": 26,
                    "author": "we_wuz_nabateans"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ran to the train station in Amsterdam. Got on the train to Frankfurt, put my suitcases on their spot and stepped off to have a smoke. Immediately the doors closed behind me and my possessions (minus passport, wallet and phone which were in my pocket) went to Frankfurt without me. A couple of trains and a flight later, I was in Frankfurt waiting for my suitcases but they weren’t on the train. A few long days spent calling around and finally found them in Utrecht (Netherlands conductors took them off before entering Germany). Rented a car and drove the 12 hours round trip from Frankfurt to Utrecht and back to Frankfurt and all was well when I started work on Monday morning.  \n\nI don’t tell this story often 🤦🏻‍♂️",
            "score": 501,
            "author": "AlwaysUpvoteMN",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best ad against tobacco",
                    "score": 331,
                    "author": "Drakuk_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly my thoughts too lol.",
                            "score": 40,
                            "author": "darkmatterhunter"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you talk to the station staff before heading off to Frankfurt? They could have called the staff on the train.",
                    "score": 28,
                    "author": "account_not_valid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s exactly what I did. I immediately ran to lost and found and told them what an idiot I was. They contacted the conductors on the train and told them I would meet the luggage in Frankfurt. And that is exactly what alerted the train conductors to those suitcases being mine and removing them from the train during the shift change between the Netherlands and Germany :/\n\nI think the luggage would have actually made it if I didn’t tell anyone but I didn’t want them thinking it was something dangerous",
                            "score": 70,
                            "author": "AlwaysUpvoteMN",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\nDu hast die Situation noch verschlimmbessert.",
                                    "score": 15,
                                    "author": "account_not_valid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100% the truth with hindsight. I should have done everything different that day :)",
                                            "score": 12,
                                            "author": "AlwaysUpvoteMN"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yo, those trains are no joke.  Took the train from Amsterdam to London earlier this year, and they do not wait.  They will shut the door on you without care.  When it’s time to get on the train, you better get your ass on the train asap.",
                    "score": 67,
                    "author": "Vegetable-Double",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s always someone entering the platform and running on such a busy train station. Where do you draw the line? Easiest choice is at the scheduled departure time",
                            "score": 37,
                            "author": "glennert"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You sound like Mr Bean.",
                    "score": 17,
                    "author": "standupsitback"
                },
                {
                    "level": 1,
                    "comment": "This is a story to tell!",
                    "score": 8,
                    "author": "unbeardedman"
                },
                {
                    "level": 1,
                    "comment": "I can't imagine not holding onto my luggage.",
                    "score": 16,
                    "author": "transferingtoearth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was Amsterdam. I had a long night the night before. No excuses for that move and I remember the anxiety well",
                            "score": 11,
                            "author": "AlwaysUpvoteMN"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nightmare!!",
                    "score": 9,
                    "author": "georgoat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Completely self inflicted",
                            "score": 14,
                            "author": "AlwaysUpvoteMN",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had this fear in Japan. I ordered hot chips from a vending machine (the novelty!) but didn't consider that they'd take minutes to cook. Stood anxiously by the machine watching the open train doors with my friend inside. I figured they'd close pretty quick chips or no chips. Luckily the vending machine dinged, I snatched the chips and got on the train.",
                                    "score": 24,
                                    "author": "georgoat"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My first ever solo trip I booked my hostel and when I showed up they had no reservation because I had booked for July, not June... day 1 of solo travel in a small town and no accommodation left in the area. Managed to get saved off a local from couchsurfing \n\n---\n\nTook a shortcut against the advice of my hostel receptionist and got mugged. 500 euro taken. Had to go home early. \n\n---\n\nStarted to book a ^trip ^^to ^^^Russia ^^^last ^^^January\n\n---\n\nAte very oddly smelling chicken wings and had 4 days of food poisoning which included a 12 hour trip on a bus with no toilet.\n\n---\nAnd on a bad luck for other people note...\n\n\nWas in Germany for the 2002 world cup final - they lost. \n\nWas in France for the 2006 World Cup final - they lost. \n\nWas in the Netherlands for the 2010 world cup final - they lost.\n\nWas in Croatia for the 2018 world cup final - they lost.\n\nI'll be in Brazil and Argentina later this year....",
            "score": 623,
            "author": "MoHataMo_Gheansai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Note to self: do not bet on Brazil or Argentina winning the world cup this year",
                    "score": 281,
                    "author": "ilovecheeeeese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even better, bet on them to reach the finals",
                            "score": 176,
                            "author": "FtG_AiR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Found the gambler",
                                    "score": 52,
                                    "author": "Vegetable-Double"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A girl I met in Lisbon had originally planned to do a study abroad trip to Ukraine.... oof",
                    "score": 153,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Tell me more about the food poisoning and bus situation. That is probably one of my worst nightmares. How did you manage that?",
                    "score": 91,
                    "author": "8days_a_week",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aight strap in. \n\nSo this was in the mid 2010s and I had been doing Workaway placements in Central Europe. Some were good, some were awful, but what they all had in common was that all the hosts were veggies. At the time I was a voracious meat eater and the whiplash-like change of diet was tough for the few weeks that I was doing it. \n\nFor my last host, I was staying in rural Czechia. On finishing that one, I decided to move on to Budapest and do a bit of hostelling there. I took the night train from Prague to Budapest, arriving around 8am and got to my hostel. \n\nAfter a month of eating salads and lentils, I just wanted chicken wings. I didn't care. All I wanted was some spicy buffalo sauce and a mountain of wings. \n\nI got to my hostel at 9am, they allowed an early check in - and then I googled where in Budapest did chicken wings. \n\nNow it was only around a decade ago, but Google was certainly a bit more rustic back then and didn't give a lot of results. According to Google, the only nearby place in Budapest that sold chicken wings was Hooters...\n\nI'm not the type of person to ever go to a Hooters, however I really wanted those wings, and nothing was going to stop me, so off I went. \n\nI got there at 09:45 and that's when I realised that the place didn't open until 10am. So now I looked like a pathetic weirdo who was desperately waiting for Hooters to open. There wasn't even a café nearby so I literally sat on a bench across the road from the place. Young guy. Alone. Outside Hooters. 09:55. I must have looked so desperate (Which I was, albeit for wings...)\n\nWhen it did open, I walked in and the waitress began trying to talk to me (as I suppose they do there). I didn't want to appear standoffish but I was literally only there for wings and not the Hooters experience. She couldn't really speak English and I absolutely cannot speak Hungarian. I tried to say that I had been to the town of Szeged before but she thought I was talking about the Sziget festival. \n\nThrough much pointing and gesturing I end up ordering the largest plate of wings on the menu. It came out wayyyy too fast. In retrospect they probably heated up whatever was left behind from the night before, but I didn't care. I was ravenous. I inhaled the wings and left as fast as I could. They smelled a bit odd, but I put it down to me not having meat for a few weeks. \n\n2 hours later I was in the hostel bathroom dying. This was at one of the old great Budapest Party Hostels so I had signed up for the Danube Party Boat that night. Poor idea. I spent the entire evening in the undulating toilet cubicle which I had to keep closed with my leg. \n\nI was only doing a layover in Budapest as I was meeting a friend in Dubrovnik. I got a slow train to Zagreb and then an excruciatingly slow night bus to Dubrovnik. \n\nThe bus left at 11pm and was due in at 8am. The bus had no WiFi, no reclining seats, no toilet, no seatbelts, and no power chargers. \n\nI was feeling so very ill and my stomach was churning. I was too afraid to cough. I got some sleep for 30 mins before a British Stag party got on in Split at 5am. It was hellish. I was too afraid to use the 1 rest stop we had as I knew I would probably take too long. \n\nJust when I thought it was over, we hit that little strip of Bosnia which requires everyone to do passport checks (once leaving Croatia, then driving a few KM and then another check when entering Croatia again). It was a busy day and we were delayed 3 hours. I won't be too vile but there was a stage where I was utterly convinced I had shat myself and I was waiting in sheer terror for the smell to emanate through the stuffy packed bus. \n\nVile warning: &gt;!It was a fart so wet, heavy, and juicy I was convinced it had come out as a solid, or at least liquid. Somehow it didn't even smell. Guardian Shit Angel was looking out for me 100%!&lt;\n\nThe worst part was my friend who I was to meet in Dubrovnik was still in Dublin when I was in Split, but arrived via aeroplane an hour before me.\n\nBy that stage the sickness was wearing off but Dear God I only recall misery from that Budapest - Dubrovnik couple of days.",
                            "score": 168,
                            "author": "MoHataMo_Gheansai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was a surprisingly enjoyable read haha\n\nI think sometimes, much like a country in wartime, the body sets aside it's differences in cases of extreme need to work harmoniously together in ways previously unfathomable, in pursuit of not completely and utterly shitting yourself in the most humiliating way imaginable.",
                                    "score": 31,
                                    "author": "TheGruesomeTwosome"
                                },
                                {
                                    "level": 3,
                                    "comment": "I took a bus from Bucharest to Budapest with the worst hangover I've ever had in my life. \n\nIt too was 15 hours on a packed bus with seats that didn't recline and the temperature swung from Arctic to Saharan depending on how the driver was feeling. At every stop I had to run to the bathroom to throw up. My stomach was in bits and I have no idea how nothing came out of me during the journey. At one stop there was a hotel and I asked how much to stay for the night, it was over €100 so I dragged my sorry ass back onto that godforsaken bus. \n\nWe finally crossed the border to Hungary and I could finally cope with a croissant and coffee and started to recover.",
                                    "score": 18,
                                    "author": "theolrazzzledazzzle"
                                },
                                {
                                    "level": 3,
                                    "comment": "first off awesome storytelling. second, I think i’d find myself in the exact same situations if my surroundings were similar",
                                    "score": 35,
                                    "author": "Hugo-Drax"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh wow, I could feel your pain from reading that. Nothing will ever be so bad for you!",
                                    "score": 8,
                                    "author": "PatrickGoesEast"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don’t know why, but I just could not stop reading.",
                                    "score": 9,
                                    "author": "Its_Really_Cher"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m wondering about that too. Did you wreck your pants? Did you find a barf bag? Did they pull over for you?",
                            "score": 5,
                            "author": "trynot2screwitup"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Concerning the world cup, this seems to be a service that you could charge a lot of money for.",
                    "score": 30,
                    "author": "weirdbutinagoodway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was based in Scotland last year and my landlord offered to pay me to go down to England for the Euro 2020 final because they were in it. \n\nI was actually heading down to London anyway and wouldn't you know, England lost.",
                            "score": 38,
                            "author": "MoHataMo_Gheansai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit, you have the weirdest super power ever",
                                    "score": 16,
                                    "author": "Icecold121"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What city were you mugged in?",
                    "score": 17,
                    "author": "telescope11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tirana. Very safe city, but there was a particular area near the bus station that I was told to avoid and I didn't so that's on me.",
                            "score": 34,
                            "author": "MoHataMo_Gheansai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I lived in Albania for 1.5 years and I know exactly which area you’re talking about 😬",
                                    "score": 23,
                                    "author": "vegasgal_inTX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Im going there for a few weeks in September - October, which area we talking about? 👀",
                                            "score": 9,
                                            "author": "Extreme_Week2727",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It is called zogu i zi “black bird”",
                                                    "score": 10,
                                                    "author": "vegasgal_inTX"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;and Argentina later this year....\n\nWHY WOULD YOU DO THIS TO US\n\nBrazil, go to Brazil, beautiful beaches, everything is better there\n\n🤣🤣",
                    "score": 70,
                    "author": "PuppyDontCare",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Can you move to England, permanently, or at least during the world cup?\n\nAsking on behalf of Scotland (and judging by your username, your home country too...).",
                    "score": 45,
                    "author": "PeterPawlettsBaby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was actually in London for the Euro final last year and Newcastle for the Rugby World Cup final  2019...",
                            "score": 29,
                            "author": "MoHataMo_Gheansai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good, good, keep it up!",
                                    "score": 23,
                                    "author": "PeterPawlettsBaby"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That last thing could be well used to fund all our travels.",
                    "score": 6,
                    "author": "elperroborrachotoo"
                },
                {
                    "level": 1,
                    "comment": "Never come to England!",
                    "score": 4,
                    "author": "ederzs97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Booked a train ticket from Rome to Venice, drank way too much the night before, rolled into the train station with about 10 minutes to spare, only to find out that it was daylight savings and I was actually 50 minutes late",
            "score": 88,
            "author": "Snazzypants11"
        },
        {
            "level": 0,
            "comment": "I drove to Canada from Kentucky and forgot my passport. Not as big a deal as you but still a similar sinking in the pit of the stomach.",
            "score": 398,
            "author": "Aggravating-Bunch590",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did the opposite  couple of years ago. Was going to drive to Buffalo for some shopping, forgot my passport and turned back to shop at overpriced outlets in Niagara falls.",
                    "score": 55,
                    "author": "CrazyYYZ"
                },
                {
                    "level": 1,
                    "comment": "Did you get into and out of Canada?",
                    "score": 23,
                    "author": "sayiansaga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope turned away at the border I thought it was in my backpack. It was like 2002. I was an young idiot.",
                            "score": 77,
                            "author": "Aggravating-Bunch590",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Can't go to Canada without a passport",
                            "score": 17,
                            "author": "Mmeraccoon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Residents in Michigan, Minnesota, New York, Vermont and Washington can get an enhanced license which allow travel to Canada, Mexico or the Caribbean through a land or sea port.  You still need a passport if you fly.",
                                    "score": 19,
                                    "author": "LemmySix"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Underestimated how long it would take to get from my hostel to the train station in Berlin and missed my train to Prague by about 5 seconds. Had to purchase a new train ticket for the next train at a heftier premium price.",
            "score": 79,
            "author": "MpMeowMeow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Barcelona, few months ago, realized last min that I’d booked the train route backwards several weeks earlier (ie from Girona to Barcelona not the other way round). Luckily it wasn’t sold out I just booked another ticket for next day. Dust hands. Alls well. Only out 20 euro. \n\nBut my dumb ass was a day off. I checked out of my hotel the next am and the lady was like, “Orly? I think you’re booked in here til tomorrow?” but I was waayyyy too confident: “lol yah I mean my train is for today so I’m pretty sure….”\n\nYah. I rebooked my train for the WRONG DAY. Idk why I just had it in my head it was a Sunday train and I checked out of the hotel to go to the station fully convinced she was the crazy one. \n\nAnyway got paranoid and checked my rental dates in Girona: she was right. I wasn’t due to check in til next day. I immediately turned around and she let me back in my old room since it hadn’t been cleaned yet. \n\nAll in all worked out fine, and was really glad for the extra beach day. A bit embarrassing and more adrenaline than I needed, but a good lesson on attention to detail for my adhd brain 😬",
                    "score": 11,
                    "author": "SoManyShades"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I solo traveled in India and was ready to fly out of the country, I didn’t include my middle name when booking the flight ticket. Since the name on my ticket didn’t fully match the name on my passport without the middle name, I wasn’t allowed to board the flight until I called the airline company and had them change it. It was like 4 AM and the company phone lines weren’t open until a later time, but luckily I had like 4-5 hours before my flight departed and was able to have it changed in time.",
            "score": 77,
            "author": "JollyManufacturer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I absolutely hate this, on some airline websites the middle name is optional, yet the check-in counters will give you hell for it",
                    "score": 46,
                    "author": "Chapungu"
                },
                {
                    "level": 1,
                    "comment": "New to traveling overseas. This is an issue that can happen if you don’t include your middle name? Thanks for the heads up!",
                    "score": 16,
                    "author": "ohsoradbaby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends if it’s on your passport. Some places are really weird about making sure your booking and passport name are exactly identical",
                            "score": 11,
                            "author": "yezoob"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to see the pyramids and just kinda forgot about the god damn sphinx. Not really sure how that happened lol",
            "score": 63,
            "author": "yezoob"
        },
        {
            "level": 0,
            "comment": "Got pickpocketed hours before my flight out of the Philippines to Australia. Couldn't board my flight because I had to pay the fee for overstaying my visa. Had to spend whatever little change I had at an Internet cafe to email my brother asking for a western union transfer. And shame-eat some Jollibee spaghetti. While waiting for my bro's response (due to the completely different time zones) I didn't know what to do so I slept in a park that night. Seemed alright. Some people walking through the park later that evening were like wtf are you doing, one offered that I could sleep at his place for the night, I accepted. We arrive at his home, which was more like a collection of shacks with all the extended family there. I ask where I'm sleeping, as it looks like there's no extra space, and he says I can have his bed. Of course once I'm in bed he also climbs in bed. Turns out his wife left him because he's (can you guess?) - gay. He's trying to get me to fool around with him, wants to give me a blowjob as he's better than girls anyway. I could just close my eyes and pretend it’s a girl lol. I give him the ultimatum to stop trying or I'm leaving, which was a bluff bc I have no fucking clue where I am, he gets all huffy and turns over to the other side of the bed and well, that was that. I didn’t really sleep, but didn’t feel any pokey pokings either. We eat cereal in the morning and his cousin who drives a tuk tuk takes me to the western union and the money is there! I rebook my flight and get out of there. The end.\n\nDon’t get pickpocketed with all your cards and cash in one place!",
            "score": 245,
            "author": "yezoob",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best one so far lol",
                    "score": 44,
                    "author": "mastadonmon"
                },
                {
                    "level": 1,
                    "comment": "Wow.",
                    "score": 21,
                    "author": "tinyorangealligator"
                },
                {
                    "level": 1,
                    "comment": "Nice story. A good one for the grandkids.",
                    "score": 14,
                    "author": "gwendolynjones"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Left my passport in the hotel safe when flying out of Prague. Didn't realize this until I was at the airport, 90 minutes away from my hotel and no way to do the round trip in time to keep my flight. Contacted the hotel, made arrangements for another cab to bring me my passport. Got my passsport and tried to check in for the flight, but they wouldn't let me because it was now less than an hour to departure and an international flight. I could have just checked in on my phone while waiting, but didn't realize it would be an issue. Ended up spending another night in Prague.",
            "score": 235,
            "author": "ford_chicago",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I could have just checked in on my phone while waiting\n\nThat made me really sad to read. as it is something that I could see myself doing.",
                    "score": 137,
                    "author": "UTchamp",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Several years ago when I was still in college I planned a trip over winter break to Mexico to meet a friend; I flew into Cancun to meet him, and then several days later we both flew to CDMX (so I'd booked three one-way flights in total, which is about to become very important). When it came time for me to fly home, I got to the airport and went to use the check-in kiosk, which didn't work for some reason.  I went over to the desk, gave them my info, and after a bit of confusion they dropped the horrible truth on me.\n\nI'd booked my flight home for the correct day of the week and time, but a week prior.\n\nI'd probably made the fuck up by selecting the correct date while booking, then the page getting reloaded or something and I was in a rush to get through my previous steps, though I'm not sure how I missed the date in the emails the airline sent me.  Regardless, after panicking for a bit, I actually managed to get a flight only a few hours later (with some help from my parents who were actually in front of a computer), but it was definitely a costly mistake, in money and definitely in my pride.\n\nWorst part is this is far from the only time I've mixed up dates with online booking, none have had such high stakes but some have been even more embarrassing, I seem to have a hard time learning this particular lesson.",
            "score": 39,
            "author": "SuperSquashMann",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Got really drunk alone in Hokkaido after a breakup. Got lost, phone ran out of battery, spent the next hour asking random passers-by to give me directions to my hostel, they'd look it up on Google Maps, tell me, then I'd walk a bit and promptly forget it, repeated this about 10 times and inconvenienced a lot of people. Finally arrived, the hostel was closed at night and locked with a 4 digit code which I had saved ... on my dead phone. By some miracle, despite having only seen the code once, I was able to remember it and let myself in.\n\nI'm usually much more prepared, the breakup really compromised my reasoning. So if you're gonna drink in that situation, do it in your room :P",
            "score": 29,
            "author": "therico",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not my mistake, but I've heard from a friend who was the victim of the Belarusian Ladder Scam. There are regional version, but it allegedly originated in Belarus.\n\nThe gist of it is that my friend saw a man in peril hanging onto the side of a building that he was painting. The man was holding onto the scaffolding, clearly in distress. My friend, a good Samaritan, runs to the ladder and climbs up to help the guy. Unbeknownst to him, another man comes out from around a street corner and begins vigorously shaking the ladder, demanding money. They lost 200 euros this way.",
            "score": 30,
            "author": "The_Outlyre",
            "replies": [
                {
                    "level": 1,
                    "comment": "The hell lol is this for real?",
                    "score": 27,
                    "author": "ToastFaceKiller",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's less common now that everyone has phones, but it used to happen a lot in the 90s. Back then though, they would just knock over the ladder and take your wallet while you were incapacitated on the ground. Now, they usually have the decency to leave the ladder up after you throw your wallet down",
                            "score": 11,
                            "author": "The_Outlyre"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to the wrong airport and had to get a taxi that cost more than 100 euros. worst day of my trip so far.",
            "score": 26,
            "author": "AnybodyContent1361"
        },
        {
            "level": 0,
            "comment": "Once I was flying from San Cristobal de las Casas to Cancun and I had booked the flight for the right day just the following month. Exact same flight. I didn’t realize until I basically got to the airport (2 hrs from the town) … tried to switch it but there was nothing they could do. Mind you, I had a broken foot so that whole thing was not fun to deal with with a boot in a wheelchair/crutches. I’d never done anything like that. I now always triple check the dates and times.",
            "score": 69,
            "author": "macejoin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did the same a few months ago. Got drunk on a Friday night and decided I’d fly from Naples to Venice for the weekend. Bought a ticket, passed out, woke up at 4 am and went to the airport only to learn I bought a ticket for the next weekend. My €30 flight turned into €350 because I was definitely still going at that point",
                    "score": 28,
                    "author": "AlwaysUpvoteMN"
                },
                {
                    "level": 1,
                    "comment": "I did this in Paris!",
                    "score": 9,
                    "author": "West-Mulberry-5421",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my horror stories begin and end in Paris.",
                            "score": 23,
                            "author": "proseccofish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had this day where I took the train to the airport. Didn't realize/couldn't figure out the airport ticketing for the train. Bought a regular fair. Got fined 50 euro open arrival. Found out my plane ticket was booked for exactly a month away. They couldn't refund me (cheap airline). Paid an extra 200 euro for a plane ticket back to my desitination. Went to lounge and got drunk.",
                                    "score": 10,
                                    "author": "West-Mulberry-5421"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did this too on my first trip, but luckily realised the day before! Makes me feel a lot better to know that I'm not alone in that mistake, it was just the worst feeling at the time",
                    "score": 5,
                    "author": "moldoggo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The whole ''I want to go to out-of-the-way places, see how people really live'' thing, you can get away with it in some countries or regions, in others it verges on stupidity.\n\nThe time I ''took some back-streets'' in Ho Chi Minh City, was followed by a guy that was out to rob me (stupidly had a new digital SLR slung around my neck), I ended up getting lost in the tangle of streets with this guy following me the whole way, ended up in a live-kill market. Saw and heard things in that market that should have put me off animal products forever.\n\nThe worst though was in Cambodia. Stopped in Battambang for one night. I learnt later that Battambang has another nickname which made total sense to me when I learnt it. I hate touristy areas so went for a wander to the outskirts and found this hotel that looked okay, at least externally. Went in and asked for a room, the owners spoke no English and I certainly don't speak Khmer. Still, I managed to convey that I wished to stay there. They looked horrified, which totally confused me. I was tired, hot and persistent however so they let me take a room for the night.\n\nGot to the room, which I could only describe as being built for orgies. Bed almost in the centre of the room, a weird hexagonal shape and raised up on like a dais. Mirrors everywhere, including on the ceiling. I thought it was hilarious, but made sure I checked the bed linen. Really, I should have just gone back and said ''no thanks'', and kept going. I was absolutely dog-tired though and you get some really bad rooms everywhere you go, so whatever. I had a shower and thought I would head out for something to eat.\n\nIt had gotten dark, and just up the road from this hotel was a side street which had lots of fluoro lighting and karaoke pumping from various establishments. Sweet, I like watching karaoke so I decided to head down. You're accustomed to getting looks as a pasty-redhead tourist, especially in SE Asia, but I started to get a little unnerved by just how much I seemed to draw attention. I quickly headed into this karaoke hall that had patrons drinking beer and eating food. Right, let's just go in and get a feed and get the hell out of here back to my Porn Studio room.\n\nOnce again, it was like those old Westerns where a stranger walks into the saloon. A buzz kind of went through the place, and *everybody* turned to look at me. I sat quickly, a lovely woman (who spoke no English, and I speak no Khmer) quickly came over with a bucket of Angkor beer bottles in ice. I gestured for a menu, which seemed to cause her some alarm but she came back with one. Menu was written in Khmer so I just picked something off one of the pictures. The food arrived quite promptly, which was merciful, so I just tucked in. \n\nAnyway, in strode this man with an older teenage boy in tow. This caused quite a lot of hushed chatter among the locals and averted gazes. This man was well-dressed, and I thought he looked like some official-type. He looked over at me and then proceeded to stride straight over to me. The next few minutes was one of the most bizarre times of my life. He said ''hello'', and I responded in kind. He said ''you're very handsome'' and then proceeded to reach out and start stroking my head with his hand. I froze completely, my eyes darted to those around me and all I saw were horrified faces peering back at me. I muttered a ''thanks'' and just proceeded to keep eating, my mind racing the whole time. He then said ''very handsome'', and (I'm not kidding)  he pushed his groin at me so that, basically, sitting on my left shoulder was his crotch. I flashed a look at the boy and he looked horrified and repulsed. I just sat, stared ahead, and just pretended I wasn't there - his hand stroking my head the whole time. This seemed to take forever, and honestly it took longer for him to register my disgust than it ought to have. He did stop however, just turned and left. I just sat dazed, with pitying looks being shot my way from everyone. The lovely woman came, I paid without finishing my food and just left.\n\nTalking to another traveller about this in Siem Reap, he kindly let me know that Battambang has the nickname of ''Bottombang'' and is quite the sex tourist town, albeit for men who prefer the company of other men. I believe the town has tried to clean up its image in recent years though (my little encounter was about 7-8 years ago).\n\nAfter that little foray, I decided it best to not venture beyond the ''safe'' touristy areas in my travels. Not by myself at least anyway.",
            "score": 22,
            "author": "OkeyDoke47",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m a bit scatterbrained but haven’t had any major mishaps when travelling. \n\nI lost my phone when I was on a night out in Budapest but luckily I was with a friend so I could still get in contact with people.\n\nAt Monterey airport, I realised at check-in that I didn’t have my phone - all my flight and hotel details were on it so I was starting to panic a bit. I knew it would either be in the taxi (ran outside and the driver was still there - we searched the taxi but no sign) or I’d left it at the guesthouse I’d been staying in. The lovely man at check-in phoned the guesthouse and the manager found my phone on a bench outside. Hopped back in a taxi to collect it, then back to the airport. Managed to make the flight and kept a very close eye on my phone for the rest of the trip.",
            "score": 20,
            "author": "Independent_Coast901",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are very lucky!",
                    "score": 6,
                    "author": "tinyorangealligator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was in Paris. Took a train to CDG to catch a flight that cost me round $450. Got to CDG, didn’t realize there was a shuttle between terminals. Took a bus to get to Terminal 2b. Bus took me back to the city center and I had to get another flight for the next morning. \n\n$600 mistake.\n\nEDIT: really it’s a $1050 mistake",
            "score": 91,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anyone going to Paris - there is a very cheap bus service called Roissybus that takes you from the airport to the city center.  Last time I took it they didn’t even charge me (I didn’t speak French and the bus driver could tell I was a tourist so let it slide).",
                    "score": 40,
                    "author": "Vegetable-Double",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just took the train from CDG into Paris and it cost like 10 Euro.",
                            "score": 21,
                            "author": "standupsitback"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " Booked a tour in Nicaragua that was supposed to cost $52 USD. The guy who was working the credit card machine had no idea how to enter the converted rate amount. Ended up with a $5200 charge on my card. Luckily my CC company easily reversed the charge.\n\nBesides that.... eating strange street food that pretty much knocked my stomach  and everything attached for the next day.",
            "score": 61,
            "author": "da_london_09"
        },
        {
            "level": 0,
            "comment": "Not researching destinations enough. \n\nI like travel photography and I try to map out potential shots before I get there. In 2008 I went to Japan and spent three days in Hakone, a rural respite from the mega-cities. I planned to take photos at Lake Ashi, hoping to catch a shot of Mount Fuji with a long lens. But it was too humid for Mount Fuji so I walked the trails and roads around the lake. Just south of Hakone-En I walked along the lake but it didn't look like much so I went back. \n\nIf I had carried on for another five hundred meters I would have bumped into the [Torri of Peace](https://i.imgur.com/GkV2yFZ.jpg), the most photographed site at the lake and one of the most beloved icons in Japan. It wasn't till I got home that I realized it. \n\nI've missed a lot of stuff because of this. So research your destinations, people! Don't be like me.",
            "score": 18,
            "author": "CitizenTed",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Miscommunicating with the co-driver, almost getting killed by a truck, sweet age 21.\n\nAlmost walking into a crime rehab center on a remote island near the mexican coast.\nclimbed the island's hill, got a bit \"dereailed\" on the way down, and the center's area was open on that side - there was just nothing to run away to.\n\n^(got stopped by two friendly guys telling me I barely missed the \"inmates\" going for a swim - on their own, which, as they said \"could be a little problem\".)\n\nDriving in Dushanbe - forgetting my drivers license and car papers in the hostel. Getting into a police checkpoint. Realized it the very moment I saw the cops. but them checking on each car created a jam, no way to turn around.\n\n^(Immediately asked how to get to my destination, which switched the cop to \"help the tourist\" mode. Got directions, and a friendly goodbye, no papers asked.)\n\nTaking a wrong turn at the Absheron peninsual near Baku, THEN trying to take a photo with one of the pumps, *THEN* handing over my passport to the guard (instead of just showing it). AZ is very paranoid there esp. about Armenian spies. \n\n^(lucky me, no armenian stamp in my passport)\n\nTaking on a hitchiker in Tehran, getting into a scam that I still have to wrap my head around. \n\n^(Cost me four hours and nothing else, but still.)\n\nGetting lost in a posh(!) Buenos Aires subburb, then getting surrounded by a pack of dogs. Free roaming dog in Argentina are *not* afraid of sticks and stones. Getting a hands-on experience on how they hunt \"big game\". \n\n^(some local saved me.)\n\n\n\n\nPhew. That's kinda cathartic.",
            "score": 83,
            "author": "elperroborrachotoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The dogs in Argentina are crazy! Even down in Ushuaia, they would run across the street to nip at my ankles and would cause cars to honk/swerve. And the ones in Calafate run right next to the cars and just lounge in the street like they’re trying to get run over. It was really frustrating to observe.",
                    "score": 27,
                    "author": "darkmatterhunter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Those fucking south American urban dog packs..fucked.",
                    "score": 9,
                    "author": "light24bulbs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My first time flying out of the country I was 16 and traveling alone. It was my first time on a plane. I got up to use the restroom and the woman beside me told me to take my passport (not sure why she couldn’t have watched it for me). I somehow promptly dropped my passport into the toilet where it slipped through the toilet crack and into the… well…\n\nA flight attendant tried to retrieve it (god bless her) but with no luck.",
            "score": 17,
            "author": "Kokomo_27",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's rough! What happened when you landed and didn't have your passport?",
                    "score": 4,
                    "author": "neuralzen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also need to know what happened after this person lost their passport.",
                            "score": 4,
                            "author": "amyandgano"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First international trip I was so excited, I walked right out of the airport without getting a sim card.  The tram was fairly new, so they had lovely employees helping the tourists get on their way, so it still didn't hit me.  I was staring out the tram window with child-like wonderment the entire trip, just a happy little moron.  Then I pulled my phone out for the walking instructions to the hotel and that's when I realized my mistake.  \n\nI had looked up the instructions the night before, but it was quickly obvious that I did a piss poor job remembering them.  I hadn't slept on the flight, because of the excitement and I found out Edinburgh has some San Francisco-esque steep streets, which is a blast with luggage.  Thankfully a wonderful local was kind enough to point me in the right direction after about 30 minutes of trying on my own.  All I could do was laugh at myself, good lesson to learn early on, always have paper back ups of important info.  You know, common sense.  I will always love Edinburgh for the stupidity it inspired in me and the kindness of the people who helped me.\n\nI have to say, you've got a great attitude about this.  While I'm sorry it happened, I think your attitude will likely help in still making the most of this trip.  I hope it's better than you expect, and I hope that some day you hit a jackpot of good luck on your travels.  And this may be naive of me, but could you call in and check, maybe someone has cancelled or got sick and you can squeeze in?  Fingers crossed a miracle is in your near future!",
            "score": 107,
            "author": "UnpaintedHuffhines",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can download offline google maps for free and save locations, so you don’t need service. Works well in many places.",
                    "score": 65,
                    "author": "darkmatterhunter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do that now, but appreciate you mentioning it.  If you have a working flux capacitor, I'd appreciate it if you could go back 10 years and inform me.  I'm the wide-eyed dumbass about to board at O'Hare, can't miss me.",
                            "score": 49,
                            "author": "UnpaintedHuffhines",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heheh… fun story! I’m a Chicago resident too and will be doing the solo euro travel starting Saturday!",
                                    "score": 9,
                                    "author": "Aliboomaye007",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Have fun &amp; learn from all of our mistakes!",
                                            "score": 6,
                                            "author": "UnpaintedHuffhines"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you buy the SIM before you leave or after you arrive at your destination?  (I seriously don't know.)",
                    "score": 10,
                    "author": "tinyorangealligator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When you arrive, usually you can at the airport of your destination.\n\nThis site is really useful for figuring out what the best deals are in whatever country (or countries) you're visiting.\n\nhttps://prepaid-data-sim-card.fandom.com/wiki/Prepaid_SIM_with_data",
                            "score": 17,
                            "author": "Merkarov"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I booked a room in Paris for the 22nd but booked my train there for the 21st so I needed emergency accommodation for my first night there. I put in a hotel reservation online, chose the cheapest non-refundable option and then, once it was paid for, realized I had booked it for the next month by accident. $100 dollars I couldn't get refunded, I ended up staying in a smelly, crowded 12 bed hostel room with a bunch of teenagers which cost $70, but it was all I could find 😞",
            "score": 97,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For some of us that would an upgrade lol.",
                            "score": 10,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "* Took a tour group to Railay, Thailand. Place is well known for having rampant water quality issues causing food poisoning. Spent two days cleaning up poop and puke from our guests. \n\n* Went down the wrong road, spent ~1hr getting chased and cornered by street dogs in the middle of the night. \n\n* Took a random pill in Mexico. Almost threw myself off a building. Had serious anxiety for ~2 years afterward. \n\n* Forgot my passport in a hostel while trying to leave Romania - had to leave the bus and thumb my way back 2hrs. \n\n* Forgot my passport in a cab in LA while transiting to go to Australia. \n* Booked a hotel in the wrong year for my entire family in Vietnam",
            "score": 127,
            "author": "wherethewifisweak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Curious about the Mexico pill",
                    "score": 82,
                    "author": "SoftpackOfPorts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "more curious about the wrong YEAR booking",
                            "score": 55,
                            "author": "motorcycle-manful541",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wonder if the two are related",
                                    "score": 36,
                                    "author": "Vegetable-Double"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Friend went out to a beach, somebody had 'ecstasy' that all had different colours. Me, being dumb, accepted one and took it. Rarely, if ever do drugs. Hit me very poorly. Spent ~8 hrs hallucinating people as goblins, and ghosts in my mirror. \n\nStarted getting in my head about how I might be that one case where the person took drugs once and lost their marbles, thought I'd end it. \n\nOnly reason I didn't is because the hotel I was in was shaped like a pyramid. Odds were that if I jumped, I'd probably just land two stories down on a railing and paralyze myself. \n\nThinking about being a looney quadriplegic made me laugh, then I stuffed my head in a pillow for 20hrs, didn't sleep for two days, and shook it off a couple of years later!",
                            "score": 62,
                            "author": "wherethewifisweak"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You need a caretaker.  Can someone please help this man???",
                    "score": 30,
                    "author": "standupsitback",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is dangerously accurate. Currently quadruple checking my bags for my flight tomorrow",
                            "score": 21,
                            "author": "wherethewifisweak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anyone??  Please!!  We need to help this guy!",
                                    "score": 15,
                                    "author": "standupsitback"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " I hope you have very many more wonderfully enjoyable trips in future! But I think the Gods have spoken, and unfortunately they have not seen fit to  bless you with any organisational skills whatsoever. Someone suggests something? Just say yes, never volunteer to organise anything, kick back and relax.",
                    "score": 25,
                    "author": "GerUpOuttaDat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except when that person is suggesting taking a random pill in mexico",
                            "score": 17,
                            "author": "guido405"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whoa. Any theory as to what was in the pill? So sorry you had to go through such a traumatic experience.",
                    "score": 7,
                    "author": "iMancinelli",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "On my first solo trip my departing flight was from Budapest early in the morning. I had a lot of physical forints left over that I wanted to spend... I went to bar with a friend and spent the lot. When we stood up to leave, I realised I'd had a bit too much, considering the fact that I had to go back to my hostel, pack my bag silently, find the bus and navigate the airport. I managed to do ALL of this completely zonked. But as soon as I sat down, I nodded off to sleep. All my hard work, down the drain. When I woke up, I was sober and promptly realised I'd missed my flight. I'm a bit more seasoned now, and if this happened again, I would take it as a sign to stay in the city a little bit longer and take the next cheap flight. But I was 18 at the time and scared shitless, so I booked a flight for the same day. A couple of hundred euros I'll never get back :(\n\nI also went to Auschwitz recently with my boyfriend. We are both living in the Benelux region and are used to efficient and regular public transport. We didn't even think to check the train schedule back to Krakow. We almost got stranded there because they stop at around 7pm.",
            "score": 35,
            "author": "Anonhoumous",
            "replies": [
                {
                    "level": 1,
                    "comment": "Almost got stranded? How did you return?",
                    "score": 4,
                    "author": "tinyorangealligator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. The schedule wasn't clear on whether the last transport was a bus or a train, and finding where the bus stop was took some serious internet digging. A local ended up pointing it out to us. Without her, we would have missed the last transport to Krakow. It was very stormy that day. Stuck in Oswiecim in the pouring rain sounds less than palatable haha.",
                            "score": 10,
                            "author": "Anonhoumous"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh I also had trouble getting back to Krakow from Auschwitz. I got there on a random bus and when I wanted to go home I couldn't find the bus again for some reason? So my friend and I found a train and were congratulating ourselves on resolving the problem. Until it got to our stop and then the train doors wouldn't open!? Ran down the carriage to another door and squeezed out onto the platform.",
                    "score": 4,
                    "author": "sodababe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I landed in Lisbon on my birthday only to find my driver's license expired on the same day. Discovered this at the car rental agency. \n\nI still had a great time - just took buses and train.",
            "score": 10,
            "author": "Ifch317"
        },
        {
            "level": 0,
            "comment": "I took a road trip to San Luis Obispo, arrived at the hotel and popped my trunk to get my suitcase out only to find I forgot to put my suitcase in there. \n\nOn the bright side I got to go shopping for new clothes and whatnot and I love shopping! \n\nI got home and found my suitcase sitting *right* next to my front door.",
            "score": 10,
            "author": "bain_de_beurre"
        },
        {
            "level": 0,
            "comment": "Catalina island, CA. Random day of the week during their off season, late October. Thought we could just camp on the remote end of the island, Two Harbors, though the ferry we booked on a whim in the middle of the day took us to Avalon, the high-end tourist town with very little camping accommodations. No luck getting to Two Harbors from there. A taxi to the other side of the island was $200+. And there weren’t anymore ferries back to the mainland that day. We were basically stranded with too much camping gear in some strange, deserted tourist town. Managed to camp very primitively across from a football stadium. Later in the night a bunch of permanent locals (think line cooks, hired help, etc) had a big tailgate party nearby. And the local deer were VERY friendly, almost aggressive. Felt very surreal.",
            "score": 44,
            "author": "everydaymaenad",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a campground just up the road from Avalon called Hermit Gulch.  It's a 1.6 mile walk.",
                    "score": 12,
                    "author": "tinyorangealligator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry to hear what happened. You have a good attitude though so good on you for that! \n\nMy funny mistake: I carefully bought some preloaded travel cards before traveling and then used them to rent a couple bicycles in Paris. Unbeknownst to me, the bike rental company took a temporary deposit of many hundreds of euros per bike in case you lost or damaged them.  They were kind enough to return that deposit…..\n weeks after I was home. \n\nlesson learned and it was a very frugal trip after that. had fun anyway and never bought those dumb currency cards again.",
            "score": 9,
            "author": "LTTP2018"
        },
        {
            "level": 0,
            "comment": "Spent money recklessly in Berlin while drunk and didn't have enough money to get out of Europe, but I figured it out.",
            "score": 9,
            "author": "Ipetallthecats"
        },
        {
            "level": 0,
            "comment": "Thinking that a 12 hour overnight layover in Abu Dhabi airport was doable without an airport hotel room. Good lord I was wrong. Worst 12 hours of any travel experience I’ve had thus far. I never skip the travel hotel now lol",
            "score": 37,
            "author": "Taido_Inukai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was it the 12 hours that sucked, or the fact that the airport is bad for layovers?\n\nLast month I had a 12.5 hour layover in Atlanta. 7 a.m -&gt; 7.30 p.m with no sleep the night before.\n\nI was dreading it but it went way better than I thought. The airport is a zoo but it's also huge, so I was able to find a section where no flights left the entire time. No other people within like 200 feet of me, and a good phone charging spot.\n\nBasically a guilt-free 12 hours of looking at my phone, reading, and having 15 minute periods of horrendous \"sleep\"",
                    "score": 43,
                    "author": "Wafflelisk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Back when I was in Abu Dhabi they are renovating the airport so half of it was closed. The normal amount of people was squeezed into half the space. There was not a chair, bench, or charging station open. I basically walked around for the whole time. \n\nI did pay to get into a premium lounge but that was only for 4 hours. \n\nI’m sure it’s better now but then it was hell.",
                            "score": 17,
                            "author": "Taido_Inukai"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m curious too lol",
                            "score": 5,
                            "author": "golddreamz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Back when I was in Abu Dhabi they are renovating the airport so half of it was closed. The normal amount of people was squeezed into half the space. There was not a chair, bench, or charging station open. I basically walked around for the whole time. \n\nI did pay to get into a premium lounge but that was only for 4 hours. \n\nI’m sure it’s better now but then it was hell.",
                                    "score": 6,
                                    "author": "Taido_Inukai"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Leaving my shit on the beach while I went into the ocean",
            "score": 7,
            "author": "brothesdan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I mistakenly assumed \"Departure time\" was \"Boarding Time\". Luckily there was bad weather at the airport so the flight was delayed and I was able to board.",
            "score": 49,
            "author": "ergosumdre"
        },
        {
            "level": 0,
            "comment": "My first solo trip and first time out of Europe (to South Korea in 2012). The only pair of shoes I took was the new shoes I just bought and was wearing, which turned out to be very low quality. They had these air chambers in the soles which broke pretty much on the first day and cut into my soles, so both had like 3-5 big blisters spread across them. So I could barely walk, only had those shitty shoes, and it turned out they didn't have my size at any of the nearby shoe stores. Eventually figured out that there was shoe stores with bigger sizes near the American military base. I had a taxi take me there, and the largest shoes they had fit me perfectly. After that the trip was great, but I lost at least 3-4 days to that lol.\n\nLesson learned: make sure to wear proper shoes and bring backup shoes if you're planning to walk a lot.",
            "score": 21,
            "author": "wggn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also don't ever buy new shoes for a trip. Buy shoes that are already broken in.",
                    "score": 18,
                    "author": "theresnome",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Flew to India without a visa. It's visa on arrival but only at like 4 airports. I wasn't at one of the 4. Spent the night in airport jail and had an armed escort out the next day. Poor attention to detail here too.",
            "score": 6,
            "author": "centwhore",
            "replies": []
        },
        {
            "level": 0,
            "comment": "New Delhi, wanted to fly to Leh in Ladakh. Lonely Planet advice was that the only way to buy the plane ticket was to go to the airport at 5am on the day of the flight. Well that sounded too risky to my friend and myself, and Indians we spoke to said we should buy tickets at a travel agent instead. We spend hours going from travel agent to travel agent - each one has a story about why we can't fly to Leh but need to fly to Kashmir instead e.g. flights are sold out /  Leh destroyed by recent avalanche etc. At this time there is active fighting going on in Kashmir so we weren't interested. Near the end of a wasted day, a travel agent says he can sell us the last two tickets available for Leh. Great! Twice the cost we were expecting but ok. We pay the money then wait for two hours in the travel agency waiting for the tickets to be 'printed'.\nNext morning we're at the airport for our flight. Only four passengers on the flight - rows of empty seats - us and 2 Germans. The Germans had bought their tickets at the airport that morning as instructed by Lonely Planet. Paid exactly half the cost of our tickets.\nLeh was amazing though",
            "score": 7,
            "author": "jacdot"
        },
        {
            "level": 0,
            "comment": "Showed up to the Uffizi musuem with reservations for the wrong day… turns out it was the next day which i had already booked a wine tour. \n\nI called the wine tour and they moved me to the same day, luckily! Barely made it .  Think it was meant to be, met some people from the Uk that I talk to regularly now and plan on visiting next year.",
            "score": 18,
            "author": "JohnDoee94"
        },
        {
            "level": 0,
            "comment": "Thankfully don't think I've made any actual major mistakes with bookings etc (maybe once I booked the wrong date because of an issue with the payment and had to start again and rushed it).\n\nI was scammed very badly though while in Istanbul (although freshly travelling after 2 years probably didn't help and I was a bit rusty).\n\nI was needing a haircut, so googled places for reviews. Passed one but it was full, so kept walking. Saw a sandwich board sign on the street and some guy standing there - he noticed me looking, asked if I needed a haircut and I said yes, then followed him. This probably should have been the first red flag. We go down the alley a bit, then up these stairs to a little salon (basically 2 chairs and a table for the till). Another guy was finishing up being done so that sort of settled my mind a little. Had the haircut, then he wanted to do a little of my beard. I said no, but he just trimmed a little and then suddenly did more so he had to keep going to keep it even. Then while I was being distracted doing that he called a woman over to do wax for my ears and face (very hot and not enjoyable and didn't want it). But hot wax was on me so it had to come off. Then suddenly she's putting this mask thing on my face, and at that point it felt off, but I couldn't do much about it. Then blackhead removal (very painful) and kept doing more and more - but always started the next thing before the current step was done so I couldn't really stop it easily. It still felt off but at that point I was thinking 'just go with it, it must be just part of the haircut'.\n\nIt finally ends and I come to pay. It should have been about £12. They put the amount in Lira on a calculator, and it seems a lot, so I go to my phone to convert it. And it comes to £150! I said I only came for the haircut, I didn't ask for all the other stuff, they just gave it to me as part of the service. Complain a while, but they point to te camera up in the corner saying 'no, you got all this stuff...' basically threatening me a bit. Eventually they reduced the price, but to £120 or 130. I don't have anything near that amount of cash on me so said I had to go to an ATM (planning on legging it). They said no, so gave them what cash I had, about £50 worth (hoping that would be ok while I go to the ATM and leg it). They then say I can pay by card. I didn't want to as I had to pit in my PIN so basically screwed by trying to make any claims after. They weren't being friendly, and at that stage I just wanted out of the situation, so just paid the remaining on my card and left feeling very angry and pissed off.\n\nLater I found them on google maps and see the reviews were all basically saying it's a scam and they rip everyone off. Annoyingly see some people refused to pay or threatened to call police (which worked for them). But left my own negative reviewd everywhere I could warning people.\n\nDefinitely should have trusted my gut more as I knew it felt off early on. And then should have stuck to only paying the original haircut price (but being an introvert doesn't help with that). That's the worst I've been scammed while travelling - so definitely check google reviews before going certain places.",
            "score": 20,
            "author": "Organic_Armadillo_10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha damn. I would have probably put down the 50 and told them to call the police. \n\nSomething like that happened to me in Nepal where the barber added a head massage and warm towel and and wanted like $25 instead of $3 as advertised. I paid 😂",
                    "score": 7,
                    "author": "yezoob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was so close to just paying the haircut cost and walking out of there, but my shy/introvert personality made me cave in. And I also didn't want to have to be looking over my shoulder the whole time as you don't know what people will do. \n\nGrowing up in places where life is cheap and you could supposedly have someone killed for a few hundred (not that that would likely happen over this). I just wanted out the situation at the time rather than escalate things. \n\nNeedless to say I will hopefully never get scammed (at least like this) again. The most annoying thing was that was basically a huge chunk of my spending budget for the trip.",
                            "score": 5,
                            "author": "Organic_Armadillo_10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea it’s a high pressure spot, you never really know what could happen, especially if there’s no other people around",
                                    "score": 5,
                                    "author": "yezoob"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I booked a flight to Cairo with a layover in London during COVID. I show up at the airport and only meet the requirements for my destination... totally oblivious to the PCR test required for my layover at Heathrow. 💀💀💀💀💀 \n\nNeedless to say, I've been using [Sherpa](https://apply.joinsherpa.com/travel-restrictions?affiliateId=sherpa&amp;language=en-US) religiously ever since then lmao",
            "score": 16,
            "author": "Trident3553",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was in Cornwall on a Saturday (nothing open) when I realized their over-the-counter COVID test was not sufficient for my Monday flight. Luckily I had enough time to get to Heathrow on Sunday night and get a scheduled test but I was certainly in panic mode!",
                    "score": 8,
                    "author": "mrsisaak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So these two mistakes happened on the same trip to Mexico.\n\nI landed in the airport groggy from an early flight. I go to an ATM machine. It’s all in Spanish and idk what it says. I stick the card in…and it doesnt come out. I’m flipping out. It turns out its a wireless withdrawal sort of machine and it ate my card. Had to get money from Western Union which was ok but a drag.\n\nI also bought a ticket to a soccer match. It was like $259 mexican pesos I thought which was like 10 or 15 dollars or something cause people told me tickets were cheap. Only…it was $260 USD actually. I couldnt get rid of the ticket.\n\nI was recently in Istanbul and a driver said the location on my map was hard to get to for some reason). it was a mile away). He wanted 70 for it…I was not gonna be fooled this time. I asked if he meant Lira (70 lira is 4 dollars). He meant dollars. I got out and said to fuck off. I WIN THIS TIME.",
            "score": 16,
            "author": "ben1204"
        },
        {
            "level": 0,
            "comment": "Not me but myself and 2 friends were in New Zealand and the day before we were leaving for Australia my mate lost his Passport. 2 of us left him but the idiot turned up in Sydney a week later with a new passport",
            "score": 6,
            "author": "KingKhram"
        },
        {
            "level": 0,
            "comment": "I got black out drunk in Kauai and lost my wallet on the beach. My flight was the next day👍",
            "score": 6,
            "author": "niboy88"
        },
        {
            "level": 0,
            "comment": "Solo travelled with a 60l backpack and therefore had to check it in at the airport. Forgot to take my wallet out of the hip bag and only realized after checking it in. At first I thought oh well I don't necessarily need my wallet in the airport so not that big of a deal..\n\nUntil i realized I left the zipper open. So I flew to my destination not knowing what to do if it wasn't in my hip bag anymore. Luckily it didn't fall out but damn this mistake will definitely not be repeated",
            "score": 6,
            "author": "AwkwardMud9349"
        },
        {
            "level": 0,
            "comment": "I shown up at the wrong airport a few times. And I once showed up at the right airport 2 days early.",
            "score": 6,
            "author": "iamjapho"
        },
        {
            "level": 0,
            "comment": "Not a huge mistake but one time I just lapsed and forgot about my flight time and where I was living it was a 2 hr. drive to the airport. I arrived as the flight left. Fortunately the ticket counter was able to put me on standby for the next flight out. I was able to get on that flight and get where I was going.",
            "score": 15,
            "author": "De5perad0"
        },
        {
            "level": 0,
            "comment": "Not me but a funny story \nWe were all flying to Las Vegas for a weekend trip \nMy friend (also flying to Vegas) called and said hey where is everyone I’m at gate 6. \n\nI was like no we’re at gate 6. \n\nShe booked her flight to Los Angelos California! \n\n😂😂😂 funny now to look back on",
            "score": 15,
            "author": "LowTide_1818",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bought $400 worth of festival and gig tickets for the wrong month and they were all non refundable.\nI thought it meant 7/6 meant 7th of June but apparently on these European tickets it means 6th of July. Deeply frustrating - these events were the whole purpose of the trip! Didn't realise til I turned up 🤦‍♂️🤦‍♀️",
            "score": 14,
            "author": "Busy-Shelter6383"
        },
        {
            "level": 0,
            "comment": "Booked bus tickets online for a Prague-Berlin trip. Bus at 3:30. Show up at the bus station and...no bus. Went to info desk and they gently reminded me they use 24 time in Europe. My bus left 12 hours earlier! Cost me another $20 to buy another ticket. Cheap lesson learned there.  \n\nOnce in Krakow I let two sleazy girls lure me to a clip joint, where they tried to charge me about $110 for 3 drinks. I was able to bully and bluster my way out of it. \n\nUsed hotels.com to book a room online. No refunds, unlike booking.com Lost about $200 when I changed my plans.",
            "score": 31,
            "author": "Franklin1967000",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Got annual travel insurance for Europe, got a chest infection in Israel = no insurance... That was a super crappy holiday. Lesson learned",
            "score": 21,
            "author": "shineyink"
        },
        {
            "level": 0,
            "comment": "Applied for a visa with my entry and exist dates flipped, it was approved like that, and I didn’t notice until I tried to cross the border and was denied. It was resolved by “paying a fee” to a border guard lol.",
            "score": 5,
            "author": "unkempt_cabbage"
        },
        {
            "level": 0,
            "comment": "Not my bad experience, but a girl on the same flight as me. I was going from London to Atlanta. We both got pulled into US immigration, they let me through. Girl thought she could work for her uncle without a work visa. She got sent back on the same plane, plus she had come from Spain. She must have been traveling for hrs for nothing!",
            "score": 4,
            "author": "mikiex"
        },
        {
            "level": 0,
            "comment": "I arrived in Rome on Easter weekend and didn’t prebook tickets to see the Coliseum for some reason. Maybe I had checked and noticed usually tickets were available same day. Anyways, went to see the Coliseum, but it closed early that day because of Easter weekend celebrations. That was my last day in Rome so yay.",
            "score": 13,
            "author": "quasisa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Similar thing happened to me at Versailles. Friend and I took a train from London to Paris, but seeing Versailles was my big to-do, especially the gardens. We had a fancy dinner and eat too much wine the night before so we got to the palace late in the afternoon. They were closing early that day to film the show Versailles so while we did see a lot of it we didn’t get into the gardens. It was our last day in France, I was so sad.",
                    "score": 8,
                    "author": "buffalonixon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in Vietnam with a friend for a few days. We were splitting, she to go home and I was going to another city... One I thought was like an hour away called Hoi An.... Not to realise that when I'd booked my hostel, it was is Hanoi. \n\nThis distinction is a little clearer in Vietnamese but just typing in quickly in Booking.com... I didn't realise. When we were checking out and the receptionist was asking about our plans and she was like \"well that's a long journey how are you getting to the airport?\" Needless to say I was very confused and stressed.\n\n But I decided to just go to Hanoi since the booking was non-refundable. A quick Skyscanner search, £45 and an overpriced taxi and I was in Hanoi. Felt so stupid though because my friend asked about my side of the trip 3 times before we left.",
            "score": 27,
            "author": "Wanderlust0219",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hoi An is nice but if you weren't planning to be in Hanoi anyway, I'd say things worked out for the best!",
                    "score": 3,
                    "author": "wh_atever"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you for sharing this - I am going to Machu Picchu next week and this made me double check that I had paid online already!! Sorry for your bad luck but you helped someone else avoid the same mistake.",
            "score": 28,
            "author": "chicltchic"
        },
        {
            "level": 0,
            "comment": "I had a few days in Japan and I wanted to go to Kyoto and Tokyo. One day in Kyoto and I think I 2 in Tokyo. So my plan was to sleep over night on the bus from Kyoto to Tokyo. So I booked a hostel for Kyoto, then the next night we’d go on the bus to Tokyo..... however.... I ended up booking the hostel in Kyoto for the same night that I booked the bus to Tokyo. I got confused and thought we’d be there a day longer than we really would be. I was with my friend and she really wanted to go to Tokyo so we ended up taking the bus and skipping Kyoto :( Oh well bc I definitely plan on going back one day :’) and I can see Kyoto and a lot more. Tokyo was really cool too",
            "score": 5,
            "author": "beepboop-bap"
        },
        {
            "level": 0,
            "comment": "I guess I sort of got scammed at Don Mueang airport in Bangkok.   \nI was going through self check-in for Air Asia to Chiang Mai when this official looking woman came up and asked me if she could assist. She checked me in, got me my pass and said that if I needed a ride to my guesthouse she could assist with that. This whole time I thought she worked for Air Asia so I said sure and she took me to a desk not far away from the check-in area. She got me a ride to my guesthouse booked and also said I could book tours for a discount if I wanted. I booked a trip to an Elephant Sanctuary and the Golden Triangle. \n\nSome time after I paid I realized she didnt work for Air Asia at all and was concerned that I paid for nothing. Thankfully a ride was ready for me when I landed and sure enough I was picked up for the tours as well. I believe I paid more than I might have had I booked the tours in Chiang Mai, but it wasnt too much more and they were still worth it. The only reason I'd say it was a scam was that the lady presented herself like she worked for Air Asia. That and I dont think she really had the authority to check me in haha.",
            "score": 4,
            "author": "BelkanWarHero"
        },
        {
            "level": 0,
            "comment": "My family and I stayed for a night in Leon, Guanajuato, not the safest city in Mexico but it was only a night. I found this hotel that looked really nice but I forgot to check the comments \nIt was in a bad part of the city, and yeah the lobby looked nice but the rooms???? Irl it was AWFUL, my mom and sister genuinely thought someone was one to kill us while we slept (it didn't happen) \n\nThe good news is, in our next stop, the hotel was amazing so I redeemed myself",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "In America right now, came from Ireland. Decided to go out drinking the day before my flight with my bus to the airport that night. Was gonna go home early but I was having so much fun so I decided to stay out longer.. then I ran into someone I knew and really needed to talk to and by then I was seriously cutting it short.\n\nI practically ran home to get my things, had a quick shower whilst throwing up and was still super drunk on my bus. It was fun in the moment until reality set in and I would never stress myself out like that again.",
            "score": 3,
            "author": "Kawala_"
        },
        {
            "level": 0,
            "comment": "This was not solo, it wasn’t even me, exactly, but it’s a similar travel story that I hope you’ll all let me share anyway:\n\nI studied abroad in France. Some friends and I (8 of us to be exact) were traveling to Kitzbuhel, Austria. It was a 3-hr train ride, where we rented cars, and 6 or 7 hours of driving, IIRC. \n\nNo hotel booked (we were young, dumb, and broke, so we planned on sleeping in the cars). \n\nNight one, got there successfully. Party started the next morning at 8 am. Eventually that evening we split up, I was off falling in love with a man I just met and having the time off my life. \n\nI arrived back to my car with 7 friends trying to sleep in it (instead of the more reasonable 4 in each car). \n\n(It was also below freezing, so sleeping outside was not an option)\n\nConfused, a few wake up to let me in, and explain why there were 7 in there. \n\nIt turns out that in the hours we were separated, the keeper of the “other” car keys put his $500+ jacket down with the keys in it, got a little too wasted, and left it a little too long. Not only was his prized jacket stolen, but so were the keys to the other car. \n\nThe biggest catch? You may have already realized from details earlier: We rented the cars 7 hours drive away in Switzerland.  They had to convince the company to drive a key out to them to get back into the car. \n\nWhile I wasn’t in the car that had to stay the extra day, it sounded like a good time, since they made a new friend who welcomed them into his home, and continued partying til they brought the key back. \n\nOh to be 20 years old and so foolish again.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I would recommend getting out of Aguas Calientes ASAP - go to Ollantaytambo or Pisac and make the most out of your time in the Sacred Valley!  I spent six weeks there, and had an amazing day at Machu Picchu, but really the whole area is so special and worth spending time exploring and hiking (fewer tourists too!). Can't think of my biggest mistake off of the top of my head (actually... maybe booking a month's worth of accomodations at a sketchy travel agency in Thailand!) but wanted to add some encouragement for your time in Peru. ☺️",
            "score": 9,
            "author": "jjjadevine"
        },
        {
            "level": 0,
            "comment": "I’m in a new place in England and want to keep my wallet safe so I move it from my back pocket to the inside pocket of my jacket.\n\nAt a pub, about to sit down in a deep chair and notice a wallet on the seat. I took it to the bartender. \n\nMy friend buys a round and we decide to move on to the next place. This round is on me, and I reach for my wallet….gone. I’m sure It’s on the bus or maybe lifted someplace along our walk. I retraced my steps for two hours with no luck. \n\nFinally thought to try the first pub for the hell of it. I asked the bartender, “you remember when I turned in a wallet earlier tonight?” She says, “yeah, now you’ve lost your own?” and handed it it over to me. It had come out when I sat in that deep chair. \n\nI’ve got many examples like this where some “extra precaution” like keeping my wallet somewhere I wouldn’t usually, leads to a screw up.",
            "score": 10,
            "author": "gcg2016"
        },
        {
            "level": 0,
            "comment": "Not me, but my friend on a trip together. Booked dates for Patagonia backwards (say we needed a campsite for February 8. He booked 2/8/2015 which was actually august 2nd). We caught the mistake with just enough time to still find campsites, although we couldn’t stay in Italiano as it filled up. \n\nMost of my mistakes are staying in the wrong neighborhoods in cities. Never made a catastrophic mistake like that personally.",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do you avoid the wrong neighborhoods when you don't know a city?",
                    "score": 3,
                    "author": "tinyorangealligator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ask online, or read online reviews. Or, ask around for people who've been somewhere you're going.",
                            "score": 4,
                            "author": "czech_zout"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "so two major mistakes my husband has made (please dont judge him):\n\n\\-flight from Orlando to Paris was printed as military time on our tickets. He fudged up the time we were suppose to be there versus take off, so we ended up GETTING to the airport when in reality the flight was taking off so we missed our flight. \n\n\\- totally separate trip, again Paris related: **Not budgeting**. Right after our wedding, we took off on a 10 day excursion that went to London, Paris, Berlin and Venice. Because we didnt have a joint account set up, he deposited a majority of the money made out to us in his account. I didnt think the wiser. Well that back fired because we were yolo'ing the hell out of our trip and were broke by the time our Paris leg was up. Thankfully I had my own money but because of that we do not share money at all lol. Mind you, this was 8 years ago so he has grown up a lot since then but on a side note I will tell you, not sharing money makes for a happier marriage IMO. Dont beat yourself up too much OP. Happens to the best of us.",
            "score": 25,
            "author": "proseccofish"
        },
        {
            "level": 0,
            "comment": "Thinking I could get away with 4.5 hours of sleep after a night of drinks while still a bit jet lagged and get up early the next day to go on a tour. \n\nOverslept by 30 minutes and had to move my whole itinerary around. \n\nI slept",
            "score": 3,
            "author": "lioneaglegriffin"
        },
        {
            "level": 0,
            "comment": "On my first trip to Europe, I was overly ambitious and planned on going to six different cities in just over two weeks. After a night layover in Reykjavik and two days in London, I was headed to Cologne! So I woke up early, took the 45 minute train to the airport, and was ready to fly over the channel. I get to the entrance of the airport and try scanning my ticket, but I kept getting an error. I walked over to a helpdesk explaining my situation, and one of the guys grabbed my ticket and looked at me in bewilderment as he said that my ticket was for June. It was April. I ended up staying in London five more days, then spent a week in Berlin. It ended up working out far better that way, despite losing money on that ticket. And the train ride (x2) through the English country was lovely!",
            "score": 3,
            "author": "blindMAN219"
        },
        {
            "level": 0,
            "comment": "In Florida. Had around $10 in cash the morning of my flight. Had some free hours and dont typically like carrying cash because it’s a liability. Spend every cent I had in cash on things I didn’t need. Didn’t pay for a toll pass when I got the rental. \nOn the way to drop off the rental of course I encounter THREE tolls after not going through a single one the entire trip. \nI don’t have cash  and the tolls don’t take card and you can’t pay after the fact. I’m looking at a $75 toll bill all because I didn’t have less than $4 in cash…ALWAYS. CARRY. CASH",
            "score": 3,
            "author": "plantmom98"
        }
    ]
}