{
    "id": "11rezlr",
    "score": 3,
    "title": "Has anyone taken MATH 2400 over the summer?",
    "author": "Optimistic_Dependent",
    "date": 1678820249.0,
    "url": "https://www.reddit.com/r/UPenn/comments/11rezlr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm thinking about taking MATH 2400 over the summer (Currently in MATH 1410 and it is going fine overall). I was aiming to take MATH 2400 in the first summer session so that it would be online for 2 hours at night MTWH. I am working remotely this summer and would not be aiming to take any other summer classes. I want to know how feasible this is/ If anyone has taken MATH 2400 or any math course in the summer. Does it follow the same quiz setup? How do they structure it if it is online?",
    "comments": [
        {
            "level": 0,
            "comment": "I took MATH2400 online over the summer last year, and we had a (asynchronous) midterm and final, and 5 homeworks. There were pre-lecture quizzes based on the videos as well, but if I remember correctly we had two attempts on those and they were worth a very small percentage of the grade",
            "score": 3,
            "author": "BrazilianPandemonium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was the pacing of the course difficult to keep up with or was the workload fair? Did you think that the midterm and final were fair... or because they were a-synchronous were they more difficult?",
                    "score": 1,
                    "author": "Optimistic_Dependent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the key is to not let material accumulate across days, because the pace is definitely accelerated. I was working full-time during that summer and the one before when I took MATH104 and MATH114 (not sure what the numbers for those are now, sorry), and I could manage as long as I was being intentional in doing homework problems/studying consistently instead of right before the exam.\n\nI also think the exams were fair, and the professor did give us a time limit (90min for the midterm and 120min for the final once you start the canvas quiz) so it wasn’t designed to be a 24h exam or anything like that, but I appreciated the flexibility to take it when it was most convenient for me. He also gave us plenty of practice problems beforehand\n\nPS: My Professor was Davi Maximo (he is great)",
                            "score": 2,
                            "author": "BrazilianPandemonium",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool! Thank you! This gives me more information!!!",
                                    "score": 1,
                                    "author": "Optimistic_Dependent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No problem, happy to help!",
                                            "score": 1,
                                            "author": "BrazilianPandemonium"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "where there class recordings etc?",
                                    "score": 1,
                                    "author": "Admirable-Ad-5192"
                                },
                                {
                                    "level": 3,
                                    "comment": "where there class recordings etc?",
                                    "score": 1,
                                    "author": "Admirable-Ad-5192"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't feed the bots.",
                            "score": 2,
                            "author": "FormalManifold"
                        }
                    ]
                }
            ]
        }
    ]
}