{
    "id": "11ubuiq",
    "score": 20,
    "title": "Cheap diners in Philly?",
    "author": "riverratsreturn",
    "date": 1679106251.0,
    "url": "https://www.reddit.com/r/UPenn/comments/11ubuiq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Craving some biscuits and gravy but already know it’s gonna be some bougie nonsense coming from anywhere on Penn’s campus… give me your recommendations for good diners, preferably in West Philly but I’m willing to go anywhere I can get to by SEPTA",
    "comments": [
        {
            "level": 0,
            "comment": "Morning glory!! My absolute favorite little diner in Philly. More towards south Philly but you can still get there by septa (subway or #40 bus)!",
            "score": 16,
            "author": "Timely-Relationship1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or Fitzwater Cafe right next door. Both great options in south Philly",
                    "score": 2,
                    "author": "toupis21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cedar Park Cafe on 49th and Baltimore. Not exactly a diner per se, but it's one of the few places here in West Philly where I've able to find diner staples like shit on a shingle.\n\nMelrose, Oregon, and Sam's Morning Glory are better proper diner fare, but you're going to have to trek down to South Philly for those.",
            "score": 2,
            "author": "captainblackout"
        },
        {
            "level": 0,
            "comment": "Hamilton diner is probably what you’re looking for, it’s on 40th near the crown fried chicken, or atleast used to be",
            "score": 1,
            "author": "Brovakiin"
        },
        {
            "level": 0,
            "comment": "midwest white ppl problems 😭",
            "score": -21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Biscuits and gravy come from the south bozo",
                    "score": 5,
                    "author": "watwatinjoemamasbutt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wait Im a midwestern white person lol and i crave gravy (maybe not biscuits) and Diners esp.... Diners are really biggest in the midwest",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well they're not like, chrome or anything, but as a white person from the south, i know Waffle House is huge \n\nhttps://www.scrapehero.com/location-reports/Waffle%20House-USA/\n\nand is very much a diner with the same kind of food but it's known to be CHEAP. And I do actually miss it from time to time! Also the demographic skews mostly Black.",
                                    "score": 1,
                                    "author": "Wooden_Resident7814"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}