{
    "id": "11xgwzy",
    "score": 8,
    "title": "Does anyone have experience doing a fall swe internship? Either remote or at a philly-based company",
    "author": "tolstoysymphony",
    "date": 1679405399.0,
    "url": "https://www.reddit.com/r/UPenn/comments/11xgwzy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I would really like to be a software engineer after graduation and unfortunately have had no luck getting an swe internship this summer. I at least have a data science internship for this summer which is nice, but I’m not as interested in data science. \n\nI would love to get some experience working as a swe in a professional setting  in order to set me up for summer 2024 internships and recruiting for jobs (I graduate spring 2025).\n\nSo I was wondering if anyone has done a fall swe internship while in school here and where you happened to do it at. Any advice would be appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which companies offer finance internships during the fall?",
                    "score": 3,
                    "author": "ckv501",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Excuse my ignorance, but if there’s no application, what’s the best way to reach out about the opportunity especially if one’s all new to this and just starting out? \n\nOn your point of PWM, or really any other group, at a BB, I’ve only really seen summer positions. Am I missing something here? \n\nThanks!",
                                    "score": 2,
                                    "author": "ckv501"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What’s the D-plan",
                    "score": 1,
                    "author": "Dependent-Fisherman2"
                }
            ]
        }
    ]
}