{
    "id": "1284c1k",
    "score": 0,
    "title": "Best UPenn Freshman Dorms 2023/2024",
    "author": "[deleted]",
    "date": 1680306695.0,
    "url": "https://www.reddit.com/r/UPenn/comments/1284c1k",
    "media_urls": [],
    "other_urls": [],
    "postText": "My daughter is a part of the Class of 2027!!  As I crawl, exhausted, across the finish line, it has just sunken in that it has all just begun for her. Do you have any tips on the best freshman dorms? Please let me know how *you* define \"best\" as well.  I don't want to lead anyone.  Thank you for the insight!!",
    "comments": [
        {
            "level": 0,
            "comment": "Congrats! Now let her take it from here, mom",
            "score": 50,
            "author": "Helpful_Blueberry_58",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn. Mom made a whole ass new account to stalk her kid’s campus. Hover much, u/SignalStop1891?",
                    "score": 4,
                    "author": "Odd_Badger_9088",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wishing you a great day!",
                            "score": -4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How about loving mom?",
                                            "score": 0,
                                            "author": "Exact-Emergency-4672"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lmao i agreeeeee",
                    "score": 1,
                    "author": "New-Nefariousness-80"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lauder is basically the best option by a mile",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "lauder for sure",
            "score": 4,
            "author": "StrangeLingonberry43",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!  Your thoughts are much appreciated.",
                    "score": -5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations to your daughter 🎉 I'm sure all of you are super excited and happy. My fav is Lauder because it has suites and everyone gets their own room and suitemates. Each suite has a living room and bathroom(s) that suitemates share. I lived in lauder and it is clean. It is also the closest to engineering so if that matters to her then it's even more worth it. \nCVS, food carts and Drexel campus are the closest to lauder. Van Pelt library is also pretty close to lauder. But distance isn't a huge deal because Penn campus isn't huge. The hill which I assume is also a freshman dorm for next year is in front of lauder. Hill has a huge dining hall. Lauder also has a dining hall but it's smaller and more \"bougie\" so it has long lines. Lauder dinning hall times are always Changing. Lauder also has a great courtyard and community BBQs.\n\nEverything is gonna work out eventually for her dont worry too much :)",
            "score": 6,
            "author": "CISbond007",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you CISbond007 for your insight.  Thank you for reminding social media *can* be supportive.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome! My D is class of 2026. The freshman dorm situation is changing for next year as they are refurbishing parts of the Quad (this is the traditional freshman dorm quad. Very very old historic bldgs. With many issues - mold, bugs, mice, too hot or too cold). Mine is in Lauder this year and loves it. Lauder was a 4 year dorm but is changing to all freshman next year. It’s the newest of freshman dorms. And each person gets their own room but it is in a suite with 1, 2, 3, 4, or 5 others. Mine is in 6 Person suite so 6 small bedrooms, 2 bathrooms, and a living area with small fridge and microwave. These suites are on a hall so you meet others same as you would in a regular dorm. Penn is tough so it’s helpful to have your own room at times. The Quad will still be the place most freshman live but it’s a traditional dorm with 2 to a room and some are very small. Quad is also kind of a party place and is close to frat houses. Lauder is in a great location for engineers as classes are just across street. It borders Drexel but it’s still very much on campus. Hill house is also next to Lauder and that will be all freshman as well. Hill is OK but rooms are doubles and small. She will only get to provide her top 3 choices and then it’s luck. The other option (which mine did) is to apply to a community program that is based in that house. You have to write essay but if u get in then you automatically get that dorm. As to “best” I would say Lauder. And reason is that you get your own room but still have suite mates. Plus it’s newer and much nicer. There’s also dining hall in the building and at Hill. And it’s super close to engineering classes.",
            "score": 0,
            "author": "Purplegemini55",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn. What’s with these parents lol",
                    "score": 15,
                    "author": "Odd_Badger_9088",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why are you so pissed lol? I get it over-parenting is counterproductive but searching for dorms and helping your kids out in making a decision isn't. In most cultures outside of the West it is actually very common.\n\nNo need to be using harsh words like snowplow and smothering for no reason when you don't even know them. It's discouraging and disrespectful for no reason. Also gotta respect the elders",
                                    "score": 0,
                                    "author": "CISbond007"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you Purplegemini55!  Wishing your D an exhilarating journey.  Take good care.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Which community program you mentioned?",
                    "score": -1,
                    "author": "Antique-Focus-5162",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look on Penn residential site. It will list which ones are in which dorms. And for those other commenters, my D did absolutely everything for both her application and post acceptance to Penn and continues to do so. I was merely trying to help another parent.",
                            "score": 1,
                            "author": "Purplegemini55"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lauder",
            "score": 1,
            "author": "sherpenn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you sherpenn",
                    "score": 0,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Absolutely agree- new, spacious, easy access to food, classes and courts.",
                    "score": 1,
                    "author": "ATGAI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The campus housing site tells you how many doubles, singles, etc.  Other poster makes it seem like quad is just doubles.  That’s  not true.  \n\nThe site tells you which group stays in which building so you can get the feel of the environment  too.\n\nAlso, YouTube is your friend. Lots on there. Good luck.",
            "score": 1,
            "author": "TermAlarming256"
        },
        {
            "level": 0,
            "comment": "Lauder or hill with a slight edge to hill just cuz it will likely have more of a freshman community vibe. Lauder can be isolating since people don't really hang out as much in the common areas--it is more like an apartment and you will hang out with the people in ur room 99% of the time. However, lauder is much nicer in terms of food/amenities if that is more important to u. \n\nI had quad. Hated it. Basically lived in hill cuz I disliked it sm. None of my friends are from my dorm. I think I just got a really bad floor tho.",
            "score": 1,
            "author": "Place_Then",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, I'm an incoming freshman at wharton and was wondering why you hated the quad? I know I'll put lauder as my first choice but was struggling with where to place the quad and hill.",
                    "score": 1,
                    "author": "Visible-Customer-767",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This totally just my opinion, but I felt hill had a much stronger community and was more tight knit. Hill has an atrium (huge common area + study lounges) where ur basically seeing all ur friends all the time. Quad is more disconnected and people split off into their own smaller groups. On my floor there was close to no dorm interaction, and I barely knew the people next to me. Quad tends to attract more partier types while hill attracts people who are a little more academic-focused (and kinda more friendly/less exclusive from my expereince lol) -- so this was just my preference. \n\nI honestly think hill is the safer option. Ur basically guaranteed to make friends there cuz everyone knows eachother. People def still go out to parties. In quad, u can easily go the entire year not knowing the vast majority of people in ur dorm/hall just due to the way quad is constructed (little common areas, kinda a maze). Quad is only good for like the first couple weeks during NSO.\n\nThis is a hot take but I would rank hill over lauder. Lauder is much nicer in terms of what the dorm looks like. However, lauder is more apartment style so it isnt really condusive to meeting lots of people. Lauder is great for sophmores and above, but for a freshman where u really just want to meet tons of people, I would not necessarily recocomend it.  \n\nDM me if you have more questions.",
                            "score": 2,
                            "author": "Place_Then",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I sent you a DM with my response :) thank you for your insight",
                                    "score": 1,
                                    "author": "Visible-Customer-767"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Join Penn parents Facebook group. It’s much friendlier than Reddit.",
            "score": 0,
            "author": "Purplegemini55"
        }
    ]
}