{
    "id": "12l7d2s",
    "score": 7,
    "title": "How reliable is College Butler?",
    "author": "sweetfungus",
    "date": 1681423081.0,
    "url": "https://www.reddit.com/r/UPenn/comments/12l7d2s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t have anyone to store things for me this summer, so I was trying to find the best storage service option.\n\nWhat are your recommendations? (could be College Butler or others)\n\nI was just slightly worried that these services would lose my items 😭😭",
    "comments": [
        {
            "level": 0,
            "comment": "Idk if they still do it but when I was on campus Penn Hawaii used to do summer storage at fairly reasonable prices.",
            "score": 2,
            "author": "Ninjaboi333",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. Is the full name \"Penn Hawaii\"? Can't seem to find anything about it.",
                    "score": 1,
                    "author": "sweetfungus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.facebook.com/pennhawaiiclub\n\nNot sure if it's still a thing since it looks like according to this the last time they did the storage was 2019 pre pandemic",
                            "score": 1,
                            "author": "Ninjaboi333"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The College Butler is definitely reliable and last year they said most the delays were due to new parking rules for trucks that made them park many blocks away from the residences. This year they are officially the recommended company through Penn ResLife and will have better access to parking and the dorms and all compared to last year which caused a lot of the delays. I’ll give them the benefit of the doubt and assume they will probably be more punctual this year",
            "score": 2,
            "author": "vtrack1"
        },
        {
            "level": 0,
            "comment": "They’re the cheapest option but they’re always super super late with pickup and drop off lol, so don’t schedule them the day of ur flight",
            "score": 1,
            "author": "cutyfish11",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they have never lost any of me or my roommates stuff! They give you free boxes and tape",
                    "score": 1,
                    "author": "cutyfish11"
                }
            ]
        }
    ]
}