{
    "id": "12ozdfh",
    "score": 2,
    "title": "formal reasoning req for a humanities kid",
    "author": "woopdiddyscoop2000",
    "date": 1681700229.0,
    "url": "https://www.reddit.com/r/UPenn/comments/12ozdfh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm usually directed to ideas in mathematics, music theory, and intro to environmental science, but I have GOD AWFUL experience in math-- last time I took a math class it was Geometry during my junior year of high school (arts school, lmao). \n\nI also kind of suck at music. I took piano and cello lessons for a couple of years when I was younger but it didn't really stick.  \n\nThis generally led me to ENVS, but I was recently told there's a new prof this semester that is pretty intense and a lot of people are kinda struggling. I honestly just want the most painless experience possible. any tips for this?  \n thanks yall!",
    "comments": [
        {
            "level": 0,
            "comment": "I will also I also really really hate math and had absolutely no problem in ideas in mathematics \n\nIt’s literally if you know 1+1 you’re good. We were learning pictographs at one point lol. You might have to try a little bit but honestly it’s so chill",
            "score": 0,
            "author": "zh_13"
        },
        {
            "level": 0,
            "comment": "Do not take ENVS, I dropped it after 2 weeks and I heard that most of my friends have Cs in the class and are working their asses off. \n\nI think some common ones that people tend to take are MATH 1070, which you mentioned, ASTR 0001, and MUSC 1700.\n\nI have friends that have taken MUSC 1700 with no background and have liked it. I also know a ton of humanities majors that have taken MATH 1070 and been fine, I think it's geared towards people who aren't inclined towards math. For ASTR 0001, your experience depends on your professor heavily and I don't know a lot about it.\n\nAlso from someone that didn't really play instruments and took a lot of Music Theory classes, Music Theory is more puzzle-like and not really artistic, like the experience you would get from playing an instrument. I really enjoy it but I don't know a lot about it at Penn.",
            "score": 0,
            "author": "friendliestfrog",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ENVS you are referring to ENVS 1000?",
                    "score": 1,
                    "author": "residenttin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes",
                            "score": 1,
                            "author": "friendliestfrog"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oceanography!! Very tolerable, not as much math and actually interesting. Just be mindful that this is for Physical Science req.\nFor formal reasoning also intro to formal linguistics was great for me",
            "score": 0,
            "author": "laurasaurious"
        },
        {
            "level": 0,
            "comment": "Ideas a math isn't even really a math class, i don't think youd struggle with it",
            "score": 0,
            "author": "derivativetriangles"
        }
    ]
}