{
    "id": "12tgdd6",
    "score": 28,
    "title": "Does Penn offer strong startup and entrepreneurship culture",
    "author": "SnooTigers5778",
    "date": 1682027447.0,
    "url": "https://www.reddit.com/r/UPenn/comments/12tgdd6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m between UCBerkeley EECS and Penn m&amp;t. It seems like Penn wins in most categories aside from, at least I think, startup culture. By this I mean the ability to work for or to found your own startup at a university. Can anyone give me some insight into penn’s startup programs, as from an outsiders view, the school seems heavily business oriented, with not much engineering reputation.",
    "comments": [
        {
            "level": 0,
            "comment": "I feel like I've said this a billion times. But no part of the Berkeley experience will compare to Penn, let alone M&amp;T. The reason that elite private schools are revered is because of the amount of funding and resources they have and while flagship state schools can top subject rankings due to department size, the undergraduate experience will remain superior and better funded colleges. \n\nLike you can argue about it all day but a college that spends 100k per student will provide better resources than one that spends 40k per student, it's just reality.\n\nExplain to me how a class with 1500 people can be as well taught as one with &gt;200 (that's just some intro level classes at Penn and some grad level CS classes).\n\nSource: I also turned down Berkeley EECS and do not regret it one bit based on what my friends tell me about it.\n\nPS there are a couple of things at Berkeley that might compete, namely Math department (ours is garbage) and weather.",
            "score": 39,
            "author": "Individual-Pattern26"
        },
        {
            "level": 0,
            "comment": "We are more superior than berkeley in every way. We have opportunities like VentureLab and Pennovation where if you have an idea, you can nurture it into a working business model. There are also hackathons and awards like PennApps and the President’s Engagement Prize that allow for this. There are people who also drop out to do startups full time. For example, there’s a group of Penn dudes building a decentralized cryptocurrency market place and they’re based in center city. Berkeley is cool with the silicon valley proximity and all, but nothing beats being exposed to the most driven people who I wholeheartedly believe you’ll meet here in Penn. There’s a reason why we are the #1 or #2 spot for the most billionaires in the country, whereas Berkeley isn’t.",
            "score": 19,
            "author": "hopefulbance36"
        },
        {
            "level": 0,
            "comment": "I'm not an outgoing or entrepreneurial person at all and I kind of accidentally started a startup after making a simple app people liked once at Penn for fun. I ultimately prioritized graduating and it fizzled out after we got some investment but I really wasn't even trying and was just hacking some projects together to learn. Berkeley is probably solid too in this regard and I wouldn't know about that, but I can't really imagine many places being that much more favorable to student startups or entrepreneurship than Penn. I have lots of criticisms for the school but that is the one thing that I would single out as a particular strength of Penn.",
            "score": 6,
            "author": "rtc9"
        },
        {
            "level": 0,
            "comment": "Nah bro, the entrepreneurship environment here is complete shit. To everyone saying that that we have the \"largest entrepreneurship lab\", please show me where these entrepreneurs are.",
            "score": 3,
            "author": "caneganggang",
            "replies": [
                {
                    "level": 1,
                    "comment": "penn wants to be startup heaven but it’s not (yet)\n\nwhat this does mean though is a lot of money going into “entrepreneurship” is up for grabs and few students are seriously trying to captialize on those opportunities",
                    "score": 3,
                    "author": "V3R53"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did Berkeley EECS for my undergrad and am now at Penn for my postgraduate studies.  IMO, Berkeley is superior in the startup culture.  This is especially evident watching CS faculty here have a relatively more difficult time trying to create startups (compared to what I saw at Berkeley).  Berkeley has one of the best incubators in Silicon Valley, SkyDeck, directly affiliated with the school.  And most EECS alum go on to make it into top incubators such as YC.  I would also say from my observation that the EECS department is much more startup motivated than the CIS department here (considering both faculty and student).   Lastly, Silicon Valley proximity is important for a whole host of reasons that perhaps fields an entire different discussion.\n\nI know this may get downvoted since this is Penn’s sub.  Don’t get me wrong, I love this school. In reality, if you are motivated enough, you can succeed in startups at either place, but the opportunity is better at Berkeley.",
            "score": 1,
            "author": "Cute_Marionberry_6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Berkeley has a lot more startups\n\nPenn has a lot more successful / acquired/ highly funded startups (per capita)\n\npeople dont realize the number of industries that undergrad Penn alum have founded in, everything from Venmo to Cisco was founded by former Penn ugrads, if you count MBAs then its even more... and we are a school of less than 10k undergrads compared to Cal which is 3x that I believe",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Berkeley also has a lot more students, so per student Penn has a lot more startups",
                            "score": 4,
                            "author": "Individual-Pattern26",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yes exactly, per capita we are the highest after Stanford/MIT/Harvard",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So i’m a student at neither of these places (though i strongly considered berkeley, but I have founded and exited startups with backing from top tier VCs and angels, and I have also spent time in VC. \n\nUPenn M&amp;T is pretty fire — know some really smart guys/girls out of that program building cool stuff or otherwise chasing cool opportunities.\n\nThat said, I think a lot of the penn students here, either due to not having been in the game or being prideful, are overestimating/hyping the entrepreneurial     environment and startup world clout @ penn. Someone here was bragging that upenn has the biggest eship lab in the world. First of all, doubt that is even objectively true. Second of all, are you really gonna tell me that Penn can even begin to compare to the entrepreneurial resources/culture found at places like stanford/harvard/mit or even berkeley for that matter lol — can tell you that’s a hard fucking no. Thirdly, i can tell you from experience that the guys who are building actually cool/promising shit are very very rarely found at their school’s “entrepreneurship lab”. Shit like pennventures or pennovation or whatever the fuck that even is is a net zero value add at the end of the day.\n\nAs per the “wharton” clout people are throwing around… no one in vc/startups gives a fuck about wharton. If anything, lots of ppl look down on wharton/bschool kids. Wharton is for IB/PE/consulting hardos and its network outside is a drop off. I think the m&amp;t program in particular lends itself to some unique credibility in certain circles (maybe that’s just my sample bias though cuz i certainly respect m&amp;t kids), but even then those guys will tell u that wharton was useless and a waste of time.\n\nListen, Penn is just in no way the engineering/startup hotbed that berkeley is. In a raw sense, I personally don’t think there is a program in the world that will give you the technical foundation that EECS will, save for maybe MIT. Berkeley is synonymous with tech/startups in a way the more preprofessional penn just isn’t. When u think startup schools, literally nobody is going to be bringing up upenn — the answer is always berkeley/stanford/mit &amp; sort of harvard. Idk these penn kids just need to fuck off they r being so naive — berkeley’s vc/ startup network &amp; heritage run so much deeper.\n\nThat said, here’s what you genuinely need to think about at the end of the day, because the truth is you can build anywhere and good products will get funded.\n\nWhat kind of person are you. Are you super technically minded / gifted, do you want to be the guy who is building the tech stack and basically an engineering weapon? Like is the hard skillset there ur priority? If so, berkeley EECS is where you should be headed.\n\nOn the contrary, if you fuck with engineering and want to have that skillset but you arent “that” like go to technical guy… if you want to be like a ceo that knows whats going on in the stack but has a more dedicated cto type co founder breaking ground on that side… like generally if you expect to be leveraging your soft skills more/maybe maybe some more flexibility to pursue a variety of other career paths, then penn m&amp;t makes a ton of sense. There is no comparison when it comes to the ease of getting mbb consulting/IB/PE other top private sectore roles between penn &amp; berkeley. Less spots and way more competition @ berkeley.\n\nPersonally, I would probably take m&amp;t because i’m more of a generalist/ops guy. But if you want to get super deep into engineering, berkeley will take you there and also give u a ton of respect when u get to fundraising.\n\nThe reality is you will be totally fine at either of these places. It is going to completely come down to what you as an individual are capable of. Neither of these places are going to hand you some billion dollar idea, or otherwise make entrepreneurship some easy path. You need to come to the table with the heat. You need to build your own network. And you need to hone your skillset.\n\nSo it really doesnt matter tbh. Just all these penn kids suggesting that penn is more plugged into the startup/vc world than berkeley, or otherwise the real kings — being HSM, is a joke dude. \n\nTldr, pure tech / u know u want to found — berkeley. Flexibility to pursue a lot and have broad prestige — penn.",
            "score": -1,
            "author": "St0mb",
            "replies": [
                {
                    "level": 1,
                    "comment": "you can go super deep into engineering at Penn too lol, you are right Berkeley has the objectively better engineering program but Penn engineering since 2010 has been growing very fast and pretty much compares to Cornell and Princeton engineering today (which it did not say 10 or 15 years ago).\n\nyour statement here is so vague: \"are you really gonna tell me that Penn can even begin to compare to the entrepreneurial resources/culture found at places like stanford/harvard/mit ...\"\n\nbut YES, the answer actually is YES. look at this list: [https://www.businessinsider.com/top-colleges-for-startup-founders-pitchbook-2018-9#1-stanford-university-25](https://www.businessinsider.com/top-colleges-for-startup-founders-pitchbook-2018-9#1-stanford-university-25)\n\nPenn is ranked # 5, Cornell is #6, Harvard #4, Stanford #1, Berkeley #2, MIT #3...\n\nbut Penn is literally 3x smaller than Berkeley and if you do a per capita computation, the number of startups / VC connections per student for Penn is much higher than Berkeley (per capita means corrected for population in case you ddnt get that).\n\nBerkeley obviously is the best public school for entrepreneurship but it simply doesn't have the number of resources Penn has per student for VC funding and startup building. In fact, both the faculty director of Berkeley M.E.T and head of Berkeley's main accelerator are former Penn professors or Penn alum founders lol. I follow Saikat Chaudhuri on Linkedin so I know that much. Berkeley literaly has needed inspiration from Penn (and Stanford) to help build their programs.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude you also act like getting vc funding is a quota or resources per student thing. Like what are you even talking abt lmao.\n\nYou think shit ideas at penn get funding while top berkeley ideas don’t because penn has some fairytale set of slots allocated to them? U think VC fundraising works like that lmao? This isn’t recruiting for banking spots or finaid allocations. You can’t apply that logic here. Its so dumb and shows you don’t have any idea how things actually work in the real world.",
                            "score": 3,
                            "author": "St0mb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "this is what im saying... everything you are writing begins with shit penn, top berkeley. there's no evidence in what you are saying, no names, no stats, you are just making condescending remarks with full confidence and providing no rationale.\n\nObviously, great ideas get funding period but Penn actually funds its undergrad founders through its various programs. Berkeley has an acceleator too and some funding opportunities, but they are going to be extremely difficult to acquire due to sheer population of school. Penn even funds recent alumni founders through our Venture lab and sets recent alumni up in SF (Wharton has an SF campus believe it or not).",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think what’s nice about his post is that he’s telling you the subjective sentiment of Silicon Valley.  Which I believe is pretty accurate.",
                                            "score": 3,
                                            "author": "Cute_Marionberry_6"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hahaha yeah dude i didn’t get that per capita meant per person haha yeah dude. I was gonna respond thoughtfully to this until you said that condescending shit lol. \n\nBut ye man, Cool article bro. Super sick. I’ve actually raised millions of dollars though and been in these circles and can tell u penn kids have a harder time than stanford/mit/harvard. \n\nI know that the numbers go down in a linear sense. 1 —&gt; 2 —&gt; 3… yes very good u get it.\n\nBut as it turns out, the real world differences seeking to be represented by these numbers are not in fact linear, but gasp, at times exponential. \n\nDid you know that there is a difference between just “getting funded” by some no name vc and being a statistic vs getting a lead check from Sequoia. Why don’t u go look at a breakdown of school representation at sequoia, a16z, KP on linkedin and tell me what u find.",
                            "score": 1,
                            "author": "St0mb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you've been saying things without going into evidence. Penn students often meet Sand Hills Road folks, we have trips that go down there and they come to us too. I've met the Wealthfront founder (Andy, former Penn undergrad) when he came to visit and we had intimate conversations. I've also quite literally seen the Venmo founders in NYC at a Penn alumni event (but didn't speak with them unfortunately). Its very easy for Penn folks to help fellow Penn folks. It starts at the college level in classes and alumni events, and goes all the way up to asking partners at KP like Ted Schlein (former Penn undergrad) for guidance on funding. Ted literally visits an engineering entrepreneurship class every year to give advice on startups. AND thats the thing, Penn literally produces founders across all its schools. We have Physics majors like Michael J. Biercuk starting the world's top quantum computing company and Elon Musk obviously, to former Bio/Chem majors starting Life science/Therapeutics startups (there's too many to note lol). Without Penn alum, there literally wouldn't be everything from electric cars (Tesla) to simple p2p payments (Venmo)\n\nI do 100% agree than MIT/Stanford/Harvard have more resources and probably easier time than Penn, but we are comparable to those 3 institutions and Berkeley is a distant fifth or sixth. I'd argue Cornell CMU or Columbia are probably better than Berkeley when you correct for population.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah i never said those resources weren’t there. I go to gtown which is shit compared to penn/berkeley eship and even I can get on calls with founders fund / a16z partners who are alum. You are painting this picture that like doing well in the startup world is a matter of these arbitrary things like oh the venmo founders went here. Its either u build something valuable or u don’t. And the research and talent at berkeley is higher than at penn eng.\n\nTo win in the startup game you have to be exceptional.\nLike u need to be the best. I doesn’t matter what the averaged out ratio of opps is. At the top level, the peak opps out of berkeley eng are higher, and if u aren’t at a level where u can compete for those then you don’t have a chance regardless. Its absolute.",
                                            "score": 2,
                                            "author": "St0mb"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Whatever this is fucking arbitrary both these programs are about as good as it gets. I know it seems like im penn bashing but thats rly not my angle. Its more ur ego , naivety that erks me",
                                            "score": 1,
                                            "author": "St0mb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "no, its your jealousy that erks you. im sorry you don't understand Penn. we aren't your average elite school. we are a giant.",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude u are such a tool. Keep holding onto ur “school” it turns out i’ve actually achieved the things you pretend to do.",
                                                            "score": 1,
                                                            "author": "St0mb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "also, you go to georgetown (based on your past comments).\n\nI would never go on the georgetown reddit and start making condescending remarks about a university i dont understand. you barely know anything about Penn or Berkeley for that matter, and everything you said was based on imaginary stereotypes with no evidence or rationale provided. you just came on to our thread, and started making false comparisons to Berkeley.\n\nGeorgetown quite literally went from being considered a top 15 school to now comparable to Boston college and UVA. you should be spending your efforts asking your admin and professors why that decline happened in the last 30 years instead of coming on to our page, and making absurd comments.",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "yeah i probably will stop giving a fuck about my penn status a few years from now too, most good entrepreneurs dont care. but at the same time, i will have benefited tenfold from my time at penn and the penn name whether i care about it or not. your georgetown alumni status is probably giving you a slight edge too and you dont realize it",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "i havent achieved anything in this sphere, i'm honest about that.\n\nim a student right now, i like mathy/sciency/techy things and im exploring that at the intellectual level. but once i graduate, i intend to use the Penn network for my benefit.",
                                                                    "score": 1,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My thoughts exactly.  And I went to both of these schools for CS.",
                    "score": 2,
                    "author": "Cute_Marionberry_6"
                },
                {
                    "level": 1,
                    "comment": "&gt;couldn't thank you more for the explanation. this reddit things is full of meat riders, and people like you who spit cold facts are really valued.",
                    "score": 0,
                    "author": "SnooTigers5778",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah man fs. But when i say these things abt berkeley eng &gt; penn eng, do remember its still penn engineering. Like its still one of the best and will serve you well. But when it comes to being in a culture of engineers/tinkerers, you will just find way more company at berkeley where those things r the dominant overtone on campus. It’s gonna be way easier to find yourself in convos about complex AI/ML topics or you know whatever the fuck at berkeley vs penn. EECS is THE thing at berkeley, and the kids there are some of the most talented in the world (its like a 2% acceptance rate now lol no?). Penn engineering is good but its just a part of penn, not the focus or source of the school’s culture in such a dominant way. K im off my soap box now i got locked in there for a sec. Stay strapped bro",
                            "score": 2,
                            "author": "St0mb"
                        },
                        {
                            "level": 2,
                            "comment": "he didnt spit a single fact, he just vaguely stated: \"are you really gonna tell me that Penn can even begin to compare to the entrepreneurial resources/culture found at places like stanford/harvard/mit \"      ....and gave no evidence... read my comment",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}