{
    "id": "13o6qn4",
    "score": 4,
    "title": "KCECH Bathroom Questions",
    "author": "hungrybreakfast01",
    "date": 1684704119.0,
    "url": "https://www.reddit.com/r/UPenn/comments/13o6qn4",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi, was wondering:\n\n1. whats the bathroom setup in kcech? (how many stalls, showers, urinals, etc)\n2. how many people do you share a bathroom with in kcech?\n3. are they generally clean?\n\nplease lmk :)",
    "comments": [
        {
            "level": 0,
            "comment": "1. there’s 3 communal showers then a bigger full size tub that for handicap only but that was typically what most people used. there’s 4 toilets stalls. i dont think there was any urinals for the men’s restrooms  lol im a female\n2. u share with all of the same gender in ur hall which will be about 20 people, but most of the tome i usually was all alone when using the bathroom and there was probably only one other person showering\n3. once again im a female, the bathrooms were typically clean except at the very end of the year where i guess my hallmates stopped caring lol. but my boyfriend did visit once and said the most of the stalls were dirty in the men’s restroom’s so not sure",
            "score": 5,
            "author": "SnooHobbies2181",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!!",
                    "score": 1,
                    "author": "hungrybreakfast01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ofcc! i just lived there this past semester so pm me for anymore questions",
                            "score": 1,
                            "author": "SnooHobbies2181"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Men's room is always clean, not sure why your boyfriend experienced that but definitely an anomaly.",
                    "score": 1,
                    "author": "Individual-Pattern26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was on kc2. It's cleaned pretty often so was usually OK. Nothing egregious, occasionally some lack of aim on the mens side. Showers were also reasonably clean.",
            "score": 2,
            "author": "Entropywolfy"
        },
        {
            "level": 0,
            "comment": "echo what the other commenter said pretty much. i'll add that my boyfriend found EH5's men's restroom surprisingly clean.",
            "score": 1,
            "author": "thifting"
        },
        {
            "level": 0,
            "comment": "Agreed with all above. Worth noting KCECH has always had the subcontracted Penn Jersey cleaners that are on great terms with the house staff and seem to do a better job than the Penn employees that clean the rest of campus.",
            "score": 1,
            "author": "neurosci_student"
        }
    ]
}