{
    "id": "13tl1zh",
    "score": 7,
    "title": "Math 1410: Fall vs Spring",
    "author": "Itsmoehere",
    "date": 1685229105.0,
    "url": "https://www.reddit.com/r/UPenn/comments/13tl1zh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming freshman here. Should I take math during the fall/spring? Is there any difference?\n\nMy schedule would be better with math in the spring so I can adjust well into college, but also I am planning on taking Gen Chem 2, NRSC 1110, and a writing course along with 1410 in the Spring... which is a lot? \n\nAny thoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "From a former 1410 TA: it’s typically slightly easier to get a better grade in the spring (the content stays the exact same) - likely because freshmen have a chance to experience Penn for a semester in the fall and are now more used to the workload, TAs gain more experience, fewer students in the spring, and those who take in the fall usually have more math experience. \n\nAccording to students, Ghrist is typically the best prof (he did write the new course tbf) but getting a good TA and going to office hours/study sessions is much more valuable for mastering content so would HIGHLY recommend those.",
            "score": 5,
            "author": "Fine_Avocado9615",
            "replies": [
                {
                    "level": 1,
                    "comment": "To add to this, in the fall there are less sections so not a lot of TAs and professors are available who teach the course compared to the spring. Spring is more favorable bc you have more resources (professors and TAs )",
                    "score": 1,
                    "author": "NiceReview42069"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spring is much easier, competiton isn’t as good.",
            "score": 2,
            "author": "Place_Then",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alright! Is it too much to handle with two other stem classes and writing",
                    "score": 1,
                    "author": "Itsmoehere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idt so. There’s not much work and I found it fairly easy if u have a study group.",
                            "score": 1,
                            "author": "Place_Then"
                        },
                        {
                            "level": 2,
                            "comment": "Oh also: get the calculus blue book. If u do all the problems in that u will def do well on all the quizzes cuz they r taken right from there.",
                            "score": 0,
                            "author": "Place_Then"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's no competition. It's not a curved class.",
                    "score": -1,
                    "author": "FormalManifold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take it any semester in which you can have Rimmer, and make sure to attend his Math Tables!",
            "score": 1,
            "author": "DistinctAccountant34",
            "replies": [
                {
                    "level": 1,
                    "comment": "Different take, Rimmer answers questions based on what people ask and entertains what they ask. His lectures weren't helpful for preparing for quizzes at all as he didn't review actual concepts, only answered questions. It really depends on how you learn, but this didn't really work for me.",
                    "score": 3,
                    "author": "Leangze",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s why I recommend going to his math tables above all. His actual lectures were not helpful at all as he only went over homework questions and barely covered new content. However his office hours were also helpful and his videos were 10 times better than Ghrist’s. But yea, I understand where you’re coming from",
                            "score": 2,
                            "author": "DistinctAccountant34",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I took it, he never advertised math tables or maybe it wasn't a thing.",
                                    "score": 2,
                                    "author": "Leangze",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea I learn about it through a friend but he does have posters up in his office",
                                            "score": 1,
                                            "author": "DistinctAccountant34"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rimmer or Ghrist?\nDuring the spring, rimmer might be my only option!",
                    "score": 1,
                    "author": "Itsmoehere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rimmer for sure",
                            "score": 0,
                            "author": "DistinctAccountant34",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any reason? And wdym by Math Tables",
                                    "score": 1,
                                    "author": "Itsmoehere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most of the worksheet and quiz questions are made by Rimmer himself so you have a better idea of the content if you learn it from the him directly. He’s also more engaging. Also, math tables are basically little sessions he holds in the Africana building Thursdays at 11am in which he goes over content that might be present on the upcoming Friday quiz, basically it’s a review session. (HIGHLY recommend if you want to pass the class with a good grade)",
                                            "score": 2,
                                            "author": "DistinctAccountant34"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agree with above on spring. Wrt to ur other classes, writing sem is j sth u needa sit down and do but wont be that bad. Nrsc isnt tht bad, you just wanna make sure to be relatively consistent (its j a lot of memorization) and gen chem will vary depending on ur background coming in, but as long as you understand everything properly you'll be fine",
            "score": 1,
            "author": "SouthernAd8828"
        }
    ]
}