{
    "id": "1455ow0",
    "score": 3,
    "title": "Scheduling Question—CAS/Wharton Uncoordinated Dual Degree",
    "author": "quacker5",
    "date": 1686318322.0,
    "url": "https://www.reddit.com/r/UPenn/comments/1455ow0",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi! I'm an incoming freshman in CAS and was wondering if there's anyone doing an uncoordinated dual degree between CAS and Wharton that would be willing to answer some questions. I'm looking into PPE in CAS and Legal Studies and Business Ethics Concentration in Wharton(the legal studies aspect looked interesting bc I want to be a lawyer, but idk if it's really worth it...would appreciate any input on that as well).",
    "comments": [
        {
            "level": 0,
            "comment": "Not worth it.\n\nLegal Studies is discouraged if you're applying for law school.  (Apparently law school committees don't like it?)\n\nLaw school admissions largely comes down to GPA and LSAT.  A dual degree means more coursework (possibly sacrificing GPA) and Wharton GPAs are, on average, lower than PPE grades.\n\nKeep things simple and stick to PPE to max your law school chances.",
            "score": 4,
            "author": "RecruitersAreDumb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I talked to a pre-law advisor about this topic. studying a lot of law in college just to study even more law in law school makes you a bland candidate (not bringing that much diversity of thought to your law class). Law school would much rather accept candidate with ancillary interests in like tech or international relations or something of that sort that can be applied to law.",
                    "score": 2,
                    "author": "Aggravating-Freedom7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can PM me! But Most people don't do PPE in CAS when they are doing a Wharton Dual Degree.",
            "score": 3,
            "author": "yeetusmcgjesus",
            "replies": [
                {
                    "level": 1,
                    "comment": "What’s the reason why most people don’t do PPE and Wharton dual degree?",
                    "score": 3,
                    "author": "Antique-Focus-5162",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ITs a 16 CU major so its hard to complete within 4 years as an uncoord dual degree. Also there is an overlap in econs. You can do it but I haven't seen anyone do it.",
                            "score": 1,
                            "author": "yeetusmcgjesus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have the same question!!!",
            "score": 2,
            "author": "livelaughlovekonan"
        },
        {
            "level": 0,
            "comment": "Here’s what most don’t tell you about uncoordinating with Wharton, it’s a total game. First and foremost, of you’re uncoordinating, you better have a good reason. Remember that a Wharton concentration CU is about equivalent to minor, and if Wharton already has a dedicated minor for what you want to uncoordinate with (statistics, legal studies, etc.) there’s actually no point. Let’s say you’re past this and still down horrendous for that wharton degree. It becomes a three step process: 1) Take hellla Wharton classes including all the uncoordinate prereqs (this goes without saying but get a good gpa plz), 2) join hellla Wharton clubs — “demonstrated interest”, 3) pick one of the less popular concentration (NOT FINANCE you can always switch later) and churn up some garbage story about it’s your life and everything you’ve done in hs and Penn relates to it. Then Boom, with a little luck, you’ll probably get it. At the end of the day, there’s probably not that much value add if you want to become a lawyer, but if you want to sell or out and become a consultant or banker, this might help",
            "score": 1,
            "author": "brownjesus04"
        }
    ]
}