{
    "id": "ik4bnl",
    "score": 174,
    "title": "Heard it here from Elon Musk, Best and Hardest classes at Penn",
    "author": "platonic_checkmate",
    "date": 1598900818.0,
    "url": "https://www.reddit.com/r/UPenn/comments/ik4bnl",
    "media_urls": [
        "https://i.redd.it/vai7e6wdzdk51.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Pretty sure Alexander and Rise of Hellenism is ANCH 323 which is now \"The Greek World after Alexander.\" Professor McInerney who teaches the class is one of the best lecturers I've ever had and although the Alexander class isn't taught every year, he usually teaches ANCH026 (Ancient Greece) every fall and I highly recommend it. I still remember everything from that class even though it's been a year because it was taught in such a captivating way.\n\nAll the CLST/ANCH classes out there are good quality and somehow I've ended up with a Classics minor because I loved them all so much and they filled so many of my gen-ed reqs.",
            "score": 24,
            "author": "shiinzou",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second everything you’ve said about Professor McInerney. I took anch026 and it was an amazing experience and he made it so interesting, it was almost my favorite class that semester.",
                    "score": 2,
                    "author": "SeaCyclist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as a cims major.... film studies is not a class",
            "score": 40,
            "author": "headassincorporated",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 31,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol I suppose, the whole major is film studies but there’s not like one singular Film Studies Course",
                            "score": 1,
                            "author": "headassincorporated"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m guessing that he means he took multiple CIMS courses lol",
                    "score": 3,
                    "author": "Nancy_drewcluecrew"
                },
                {
                    "level": 1,
                    "comment": "It's ok. Elon likes to lie a lot. It's because he's a pedo guy",
                    "score": -29,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah QFT1 in first semester senior year was where I gave up on my dual degree, good times.",
            "score": 3,
            "author": "Miserycorde"
        },
        {
            "level": 0,
            "comment": "God, he's just the worst.",
            "score": 4,
            "author": "InternationalCupcake"
        }
    ]
}