{
    "id": "ox8xu2",
    "score": 154,
    "title": "I’m so scared for this semester",
    "author": "jack0223",
    "date": 1628013350.0,
    "url": "https://www.reddit.com/r/UPenn/comments/ox8xu2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Penn’s silence is eerily similar to this time last year. I quite literally cannot do this again. I want to go to classes, I want to go to parties, I want to perform, and I want to enjoy just one normal year of college. That’s not selfish to ask. The selfish people are the ones who deliberately aren’t getting vaccinated despite being eligible and frankly it’s not our responsibility to indulge stupidity.\n\nThis whole situation is making me feel so hopeless. This is never gonna end.",
    "comments": [
        {
            "level": 0,
            "comment": "The unfortunate thing is that Penn is most likely just going to do whatever the rest of the Ivy League decides to do. I’m hoping that means a return to normalcy, but I’m not sure if that’s realistic at this point (because let’s face it, from the beginning this has been about avoiding lawsuits, and Infections From The Delta Variant feels like a lawsuit waiting to happen).",
            "score": 35,
            "author": "riverratsreturn"
        },
        {
            "level": 0,
            "comment": "You gotta be vaccinated to go back",
            "score": 61,
            "author": "wellknowncrackgnome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly which is why we shouldn't have restrictions.",
                    "score": 33,
                    "author": "jack0223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lack of restrictions -&gt; worse COVID stuff\n\nThe way to get back to normal as quickly as possible probably involves things like mask-wearing and social distance.",
                            "score": 25,
                            "author": "FormalManifold",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\^This.",
                                    "score": 7,
                                    "author": "PuffinPassionFruit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me reading this thread:\n*crunches popcorn*",
            "score": 33,
            "author": "Milderf"
        },
        {
            "level": 0,
            "comment": "FYI - a lot of my buddies at Penn are fully vaccinated and still got the delta variant",
            "score": 40,
            "author": "vp314",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure, obviously you can still get it if you're vaccinated despite your chances being much slimmer. However, the risk of serious medical complications for vaccinated people is so mathematically improbable that it would be insane to upend another year over something that should essentially be no worse than a cold for those who are vaccinated.",
                    "score": 33,
                    "author": "jack0223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wharton Lauder group already has about 10ish folks who got the delta variant out of 50 ish students. All of them fully vaccinated. Most of them have symptoms. It's not that improbable.",
                            "score": 32,
                            "author": "vp314",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure, but vaccinated people are still capable of infecting others.",
                                            "score": 13,
                                            "author": "tbo1992",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "not nearly as much tho",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is unfortunately no longer accurate with delta which has changed the game and moved the target :(\n\nhttps://www.npr.org/sections/coronavirus-live-updates/2021/07/30/1022867219/cdc-study-provincetown-delta-vaccinated-breakthrough-mask-guidance",
                                                            "score": 10,
                                                            "author": "itsjustjb123"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And what about the faculty, staff, or students who have someone in their life who can't be vaccinated? Like children?",
                            "score": 14,
                            "author": "AccomplishedWord6484"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm on campus right now, and there's no mask mandate, the openpass checkpoints are gone, and you can go into most buildings. I believe this bodes well for the next semester, and I agree. I really won't be able to deal with another semester online. \n\nI really hope Penn realizes that the detrimental mental health damage that doing another semester online would have on the students is much greater than the possible other risks that, like you said, stem from the actions of a few greedy individuals who we shouldn't be forced to make sacrifices for",
            "score": 31,
            "author": "dumbassQuaker24"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. This is endemic, and health officials need to realize that.",
                    "score": -3,
                    "author": "miniraise",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Polio was endemic; what's your point?",
                            "score": 6,
                            "author": "DavidBits",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We didn’t lock down for centuries because of polio. What’s your point?",
                                    "score": 3,
                                    "author": "miniraise",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it's only been a year",
                                            "score": 7,
                                            "author": "derivativetriangles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Polio was here for centuries though. And covid will be too",
                                                    "score": 1,
                                                    "author": "miniraise"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We \"locked down\" for a year, not centuries. My point was that proper measures can be taken to iradicate an endemic virus, despite you claiming the opposite. The measures are extreme (not really, but with vaccine hesitancy, the only other option is extreme), but the danger this virus poses is commensurate.",
                                            "score": 5,
                                            "author": "DavidBits"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This virus is endemic. It will never be gone, so we need to live with it. Vaccines allow us to live with it, even if it spreads - like the flu. Fuck Penn if it makes a rash decision.\n\nThe initial lockdowns were to stop hospitals from being overwhelmed and school shutdowns were to stop students from getting seriously sick, and with the number of vaccinated people we have they won’t be, so I sure as hell hope Penn isn’t planning to mess things up…",
            "score": 12,
            "author": "miniraise"
        },
        {
            "level": 0,
            "comment": "If I have to weigh \"a normal year of college social life\" against \"extending a global pandemic\" in the moral balance, I think the choice is obvious. And it's not the one you seem to have made.",
            "score": 18,
            "author": "FormalManifold",
            "replies": [
                {
                    "level": 1,
                    "comment": "This pandemic will never end, as covid is now endemic. The best we can do is get vaccinated and live so that if we’re infected the symptoms are mild.",
                    "score": 7,
                    "author": "miniraise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The residents of West Philly are also scared for this semester because of this “I want to do whatever I want cuz I’m sick of being responsible” attitude. \n\nIt does suck. We’re all tired of it. But you’re only going to make it worse by being careless.\n\nEdit: I guess we should all start preparing for more restrictions.",
            "score": -19,
            "author": "MHM5035",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sorry, quit the high horse attitude. If people are vaccinated, they're protected. They have almost 100% protection against being hospitalized, even if they do end up contracting it which is also unlikely. The careless people are the ones who are not taking the vaccine, which is the best tool we have to fight the virus. Do not call me careless for no longer feeling the social responsibility to upend my life for people that refuse to listen to science and instead think Facebook is the most reliable source of information.",
                    "score": 14,
                    "author": "jack0223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear you and your frustration - I'm faculty at Penn and it makes me want to cry at the thought of potentially teaching into the void on Zoom again this year, but I'm also someone who comes home to kids ineligible for the vaccine every night. The recent news about the Ro of Delta possibly being 6-8 is way worse than many people realize. There's a great thread from an epidemiologist [here](https://twitter.com/EpiEllie/status/1422595200615133189?s=20) that goes through the (very approximate) math of it continuing to spread, and it doesn't look great. I'd be shocked if we aren't at least in masks and somewhat distanced this fall.",
                            "score": 38,
                            "author": "jonqdoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But the virus is entirely nonlethal for your children?? And its outcomes are a fraction as dangerous for you and penn students with vaccination? People who are unvaccinated in America (who are old enough to face actual risk from covid) have chosen to forgo vaccination voluntarily. Why should we continue to stop our lives when both the vaccinated are at insignificant risk and the unvaccinated have accepted their risk? ESPECIALLY at Penn, where there's a vaccinations requirement.",
                                    "score": -13,
                                    "author": "pyre3137",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's not true. Lots of kids have died from COVID.",
                                            "score": 12,
                                            "author": "FormalManifold",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A rounding error have died. In England for example, some studies put the survival rate for children as high as 99.995%.\n\nStop stoking fear.\n\n https://www.google.com/amp/s/www.wsj.com/amp/articles/in-children-risk-of-covid-19-death-or-serious-illness-remain-extremely-low-new-studies-find-11625785260",
                                                    "score": 1,
                                                    "author": "pyre3137",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There's lots of evidence that Delta is worse for kids. In the US there are currently full pediatric ICUs.",
                                                            "score": 13,
                                                            "author": "FormalManifold",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great I'd love a non-anecdotal rumor-has-it source for that information, that will also show the danger for children to be at a significant threshold.",
                                                                    "score": 4,
                                                                    "author": "pyre3137",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "https://www.nbcnews.com/news/us-news/delta-variant-spreads-medical-experts-warn-risk-young-children-n1274126\n\nhttps://www.forbes.com/sites/roberthart/2021/07/02/kids-among-most-vulnerable-to-infectious-delta-variant---heres-why-you-should-be-more-worried/",
                                                                            "score": 10,
                                                                            "author": "FormalManifold",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "From your first article:\n\n\"Still, there is no evidence that children are more susceptible to the delta variant of the virus than others who are unvaccinated or that it causes more severe illness.\"\n\nEverything in there is anecdotal or statistical sophistry. As children become a larger percent of cases, they naturally become a larger percent of hospitalizations.\n\nYour cited articles don't even back up your claims. I'm done with this argument.",
                                                                                    "score": 2,
                                                                                    "author": "pyre3137"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Also I mean, parents aren't known for being totally cool with their kid being the 'rounding error'.",
                                                            "score": 17,
                                                            "author": "FormalManifold",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don’t really have an opinion on most of this thread but just sticking my head in here to say this statement is ridiculous. You can’t inform public policy and regulations based on a mortality rate this low.",
                                                                    "score": 2,
                                                                    "author": "Botek",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Okay, so what number of dead kids is a \"normal college life\" worth?",
                                                                            "score": 8,
                                                                            "author": "FormalManifold",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m not responding to a straw man. The covid mortality rate in children is estimated to be &lt;0.01% in the US. At it’s lowest point this summer (when restrictions were virtually nonexistent in all 50 states), the overall mortality rate across ALL age groups in the US did not get that low. Unless there’s data indicating that Delta changes this (which there very well could be), this should not even be part of the conversation.",
                                                                                    "score": -2,
                                                                                    "author": "Botek"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You're right. All the kids should stay at home so they don't get sick and die. And nobody should go outside because some people will be struck by lightning.",
                                                                    "score": 1,
                                                                    "author": "pyre3137"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There's more consequences to spreading covid than mortality. How many 9s of security do you need to risk your kids' long term health? \n\nI do get what you're saying; I know they'll \\*probably\\* be fine even if they got it, but it's really not such an easy call to make.",
                                                            "score": 6,
                                                            "author": "jonqdoe"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is careless and it is selfish. Is it *less* careless and selfish than some other people are being? Sure, if you want to put it on a scale to make yourself feel better about your decisions. But it *is* careless and selfish, and you are only making things worse for yourself and others.",
                            "score": 2,
                            "author": "MHM5035",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You sound angry and spiteful. There's no need for that. There has to be an end to this, and Penn requiring vaccinations is the best thing they could have done. Should people who interact with children or those with medical exemptions on a regular basis exercise an abundance of caution? Of course. However, for the rest of us, who almost exclusively engage with eligible people 12 years and above (usually 18+) on a daily basis, should no longer be required to spend another year in isolation or restrictions. It's ludicrous that you would even suggest we do this again.",
                                    "score": -3,
                                    "author": "jack0223",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The ad hominem attacks begin…\n\nIt’s clear I’m not going to convince you, but it seems like you think Penn exists in a bubble. You think the only people you’re going to interact with in West Philly are Penn students and faculty? Where are those parties you want to go to? Where do you shop? Where do you go out to eat? I get that everyone is emotional and stressed, but please think this the whole way through before you act on any of these feelings you’re having.",
                                            "score": 19,
                                            "author": "MHM5035",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;It’s clear I’m not going to convince you, but it seems like you think Penn exists in a bubble. You think the only people you’re going to interact with in West Philly are Penn students and faculty? Where are those parties you want to go to? Where do you shop? Where do you go out to eat? I get that everyone is emotional and stressed, but please think this the whole way through before you act on any of these feelings you’re having.\n\nMy point is that if the ADULTS we're interacting with at restaurants, stores, and anywhere else that we go are not vaccinated despite every PSA telling them to (even goddamn Mitch Mcconnell) and every public resource at their disposal to get the shot, then they have exercised their right to live with the potential of contracting COVID at their own risk. What more can we do for those people but hope for the best? I don't wish death, but I don't think it's our responsibility to act as if they're helpless when they've made the active decision to avoid being vaccinated.",
                                                    "score": 2,
                                                    "author": "jack0223",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I know what your point is. Please try and understand mine.\n\nI get that you don’t feel like you have to care about those people. That’s fine, that’s whatever it is. But they exist, they *will* get sick, and there *will* be more restrictions unless the responsible among us make the effort. That’s the careless part - that you’re only thinking in the short term about your happiness over the next three months.\n\nE: I assume you’re not going to reply to me, u/jack0223 but please consider the spread of the delta variant (that you acknowledged above) as well as the prof with unvaccinated children. The combination of those two points is exactly why we have to stay vigilant.",
                                                            "score": 19,
                                                            "author": "MHM5035",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "100% agree. Even vaccinated people are getting sick, and the Delta variant's highly transmissible. It's awful that people can be so selfish to others. Maybe they don't care about Philly because they come from other cities they can go home to, while leaving a mess behind here. People need to be forced to act right with a mandate, but when it turns into a recommendation they act like it's no big deal to get others sick and that the vaccine protects everyone completely. And no, this won't be a normal academic year, no matter which angle you look at it from.",
                                                                    "score": 9,
                                                                    "author": "PuffinPassionFruit"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "when the imposter is sus!",
                                                                    "score": 7,
                                                                    "author": "epic_gamer_4268",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Hmm…interesting account.\n\nE: ohhhhh. I said among us.",
                                                                            "score": 1,
                                                                            "author": "MHM5035"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, we all want an end to it. But declaring \"oh it's over\" is some Michael Scott bankruptcy shit.",
                                            "score": 6,
                                            "author": "FormalManifold"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The truth",
                            "score": 3,
                            "author": "pyre3137",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The ignorance",
                                    "score": 1,
                                    "author": "MHM5035"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What about their kids who they’ll pass it to?",
                            "score": 6,
                            "author": "MHM5035",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not *your* concern. But kids can get it and some will die. So how many kids are you willing to let die so you have a fun semester?",
                                            "score": 8,
                                            "author": "MHM5035",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think I’m not interested in whiny teenagers (-23) whose brains haven’t fully formed putting everyone’s freedom at risk cuz they’re emotional about not being able to attend a party during rush. Go to therapy.",
                                                            "score": 8,
                                                            "author": "MHM5035",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 1,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}