{
    "id": "pnp3jh",
    "score": 165,
    "title": "FFS Do NOT come to class if you're sick",
    "author": "Mildlyconfuused",
    "date": 1631569259.0,
    "url": "https://www.reddit.com/r/UPenn/comments/pnp3jh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Jesus christ all my classes are full of people coughing, can you stay the fuck home? If you cough more than once every 20 minutes consider yourself sick and don't come to class spraying your germs everywhere! It's disgusting and self-centered behavior. There really is no excuse especially if the class is recorded.\n\nEdit: I have 2 classes where attendance is mandatory and both of my professors explicitly said that being sick is a valid excuse to miss class as long as they're notified so maybe try that? If you're just worried about content, people have been missing class and getting notes from a friend and they've been doing fine even before covid. If you're still confused email your professor/TA or go to OH. It's not the end of the world even if lectures aren't recorded. ",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 117,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. I’m unfortunate enough to have only 1 class that records lectures. And one that actively records attendance.\n\nI think people should still stay home and use the Course Absence Report but unfortunately not all professors are understanding.",
                    "score": 23,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm so upset that Penn basically dropped the ball on this. The instructors literally had all the resources to accommodate sick, injured, and quarantined students this year while still being able to teach live and in person if they wanted to, and the university basically shut them down and endorsed in-person learning only. Like did you learn nothing from the last year and a half??\n\nThis isn't even just a COVID/pandemic issue. You just in general should not be expected to go to school or work when you are sick, for the sake of yourself or others. You are putting a mental and physical stress on you and your classmates by doing this. All you hear from professors and the university is about putting your mental and physical health first, and then when you want to do that you are penalized essentially. \n\nI'm thankful that most of my teachers are trying to be accommodating, offering virtual office hours and recording lectures when possible, but they can only do so much.",
                    "score": 34,
                    "author": "fresh-potatosalad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard the admin told professors not to record lecture. I don't know why. Perhaps they saw student's performance/learning drop last semester. It's difficult to go to class if you can just watch the recording at 2x speed while doing homework at home.",
                            "score": 6,
                            "author": "Damowerko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's what I heard too, but the way I see it is that we are adults and someone abuses recorded lectures to stay in their dorm all day, that's on them. Discouraging such a beneficial tool overall for students because it could encourage laziness or lower performance in some is just sad.",
                                    "score": 7,
                                    "author": "fresh-potatosalad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You could make the same argument about assigning/grading homework assignments. They could be all optional and ungraded, just practice for an exam. This would benefit the students who work hard so they do not need to practice and can focus on other work instead.\n\nI don't think students are lazy in general. However it's just a human tendency that we view things that are due soon as a priority. We tend not to prioritize long term learning, but will focus on a paper due this week. People aren't lazy, they are still working hard, just prioritizing different things.\n\nUnfortunately this hurts students who attend class as well. In the end they have fewer students to discuss the material with and they might be working on a group project with 3 other students who aren't engaged in the course.\n\nEngaging students is an important part of teaching and a responsibility of an instructor.",
                                            "score": 3,
                                            "author": "Damowerko",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a valid conclusion too, I know from experience last year how frustrating it was to try to discuss and do group work remotely. \n\nIt seems like overall the situation just sucks.",
                                                    "score": 1,
                                                    "author": "fresh-potatosalad"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Professors weren’t told not to record, but most classes and classrooms (outside of the large lecture classes) don’t have the tech capabilities to record classes - in order to record seminars, labs, any kind of interactive class, the prof would have to be speaking and teaching directly to their laptop the entire time, and it would be almost impossible to record any group work, discussion, etc. Classrooms also aren’t set up for hybrid delivery (ie some students in person, some students online). Part of the reason profs pushed for online options was because it’s much easier to accommodate students who need to be out of class or attend class remotely - even if most wanted to offer remote options, there are significant limitations to doing so.",
                                    "score": 2,
                                    "author": "westwingfanatic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have a class in an interactive learning classroom which is equipped with several cameras and microphones for this purpose, but lectures aren't recorded.",
                                            "score": 1,
                                            "author": "Damowerko",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s a shame if they have the capabilities and don’t use it - just highlighting that most regular classrooms don’t have the option!",
                                                    "score": 1,
                                                    "author": "westwingfanatic"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even if lectures and participation is optional, missing even one lecture can be detrimental to your progress in class, you're missing a huge chunk of context going forward.",
                    "score": 8,
                    "author": "catcatcatcatcat1234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is why they should be recorded. :)",
                            "score": 11,
                            "author": "PuffinPassionFruit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that's what I'm saying",
                                    "score": 2,
                                    "author": "catcatcatcatcat1234"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are all these professors requiring mandatory instruction also not allowing people to email ahead and say they're sick? It would definitely be nicer to have all classes be recorded but I honestly don't think that missing one lecture is really a big deal if you can get notes from a friend or something.",
                    "score": 2,
                    "author": "Mildlyconfuused"
                }
            ]
        },
        {
            "level": 0,
            "comment": "also would be great if you don’t run into the bathroom to demask and cough.",
            "score": 48,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Literally none of my classes are recorded…\n\nI haven’t gotten sick so far but I usually do around this time and idek what I’ll do when I do. Like I feel like I’ll have to balance like how much sickness is acceptable, like pre-covid",
            "score": 7,
            "author": "zh_13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try to push for them to be recorded. A classmate was able to do it for my class (via Piazza, but I'm sure email would work just fine).",
                    "score": 3,
                    "author": "PuffinPassionFruit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this applies to the gym also!!!! the amount of people hacking up a lung in pottruck….. unreal",
            "score": 30,
            "author": "persephone-aflame",
            "replies": [
                {
                    "level": 1,
                    "comment": "The amount of people not wiping down the equipment after using it is equally disgusting….",
                    "score": 14,
                    "author": "supremeleaderbub"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It would be great if each of the school departments could send form emails telling students not to come in if they’re coughing and sneezing excessively.",
            "score": 9,
            "author": "Tossed_Away_Acct"
        },
        {
            "level": 0,
            "comment": "People have allergies.. that’s why there’s masks and COVID tests.. I would have to stay home everyday because of my allergies if I listen to u",
            "score": 16,
            "author": "TexTacos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most allergies don't cause excessive coughing.\n\nSource:  I live with allergies. Sometimes barely survive with them.",
                    "score": 8,
                    "author": "PuffinPassionFruit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "mine do - postnasal drip unfortunately causes coughing",
                            "score": 14,
                            "author": "closeencownter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like I said: \"most\". I also get postnasal drip, which can get quite unbearable. Still, I doubt that the sudden increase in coughers and sneezers is due to allergies (seasonal or otherwise). There has been something going around ever since NSO.",
                                    "score": 3,
                                    "author": "PuffinPassionFruit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ok true if you meant literally every minute or so then yea.",
                            "score": -1,
                            "author": "TexTacos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "@@@ CERTAIN PEOPLE IN MY STAT102 IM TALKIN TO YOU",
            "score": 2,
            "author": "pennpalstudent",
            "replies": [
                {
                    "level": 1,
                    "comment": "@@@ PEOPLE IN BIO 121",
                    "score": 1,
                    "author": "Cautious-Ad766"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hell nah we paying to pass gas, cough and spread covid around campus. We can’t afford to stay home.",
            "score": -4,
            "author": "imagearkansas"
        }
    ]
}