{
    "id": "1yy6cp",
    "score": 40,
    "title": "Will Spradling has hit the 1000 point mark. Congratulations Will!",
    "author": "[deleted]",
    "date": 1393379501.0,
    "url": "https://www.reddit.com/r/KState/comments/1yy6cp",
    "media_urls": [
        "http://imgur.com/algOpqq"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "And just started his 100th game tonight at K-State. Will go down as one of the all time greats. Just an all around solid college player.",
            "score": 2,
            "author": "SouthernYankeeOK",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't understand sports well enough to form my own opinions. Why do people keep telling me he sucks?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, Spradling is pretty average at shooting, but that's because of his spot on the team. He can take it inside and score on reverse layups all the time..that's just not why he's out there. Besides scoring (which is what everyone looks at) he has been one of our most consistent players and one of the best defensive players in the Martin/Weber era.",
                            "score": 2,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "He does not suck. However, he is just as good now as he was as a freshman. There'd be some arguments that he was better as a freshman than he is now. I think people just had higher expectation for such a great ball player early in his career. He ended up being quite mediocre. Also, 1000 points for four years in college basketball is not that many points. As far as three point shooters go, he's great. I personally am disappointed in his lack of improvement over the years. Never reached his potential. ",
                            "score": 1,
                            "author": "dblaker24"
                        }
                    ]
                }
            ]
        }
    ]
}