{
    "id": "52g77h",
    "score": 3,
    "title": "How do I get there from Kansas City?",
    "author": "Alskdj56",
    "date": 1473708864.0,
    "url": "https://www.reddit.com/r/KState/comments/52g77h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm visiting from out of state and I'm landing at Kansas City. Is there public transport available from the airport to the university? A bus maybe?",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I'll look into it.",
                    "score": 1,
                    "author": "Alskdj56"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes.\n\nRent a car for the day. Usually a small economy sized car from Enterprise is about $33/day. Gas is about $2/gal. I would expect it to cost about $50 altogether.",
            "score": 3,
            "author": "wiseoracle"
        },
        {
            "level": 0,
            "comment": "These shuttle websites have options - both are kinda hard to navigate but \n\nthis[ one](http://www.economyshuttle.com/) I found an ~$80 quote\n\nand [here](http://kciroadrunner.com/reservations/) was a ~$100 one\n\nLike the other guy said, flying into MHK is an option if you haven't booked a flight yet - we get 2 flights a day from both Chicago ORD and Dallas DFW. No flights to KC - once you're here you can uber around tho.",
            "score": 1,
            "author": "Dodocogon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can I take an Uber from Kansas city airport to Manhattan?",
                    "score": 1,
                    "author": "Alskdj56",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Theoretically, probably be super expensive though - Not sure if you'd find a driver to do it either. I plugged MCI into my app here and the rate it estimated was $220-290 - if you have a car full of people that could work. It sucks but Kansas is made to drive a car in!",
                            "score": 4,
                            "author": "Dodocogon"
                        },
                        {
                            "level": 2,
                            "comment": "If you want to spend hundreds of dollars, I am sure you might find an Uber driver to do that.",
                            "score": 1,
                            "author": "wiseoracle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "pretty sure there's a shuttle from the airport all the way to manhattan, might do some google searches",
            "score": 1,
            "author": "DRKNSS"
        }
    ]
}