{
    "id": "55lyge",
    "score": 8,
    "title": "Graduate student employees will lose health care subsidies, Kansas universities say",
    "author": "Officer412-L",
    "date": 1475466658.0,
    "url": "https://www.reddit.com/r/KState/comments/55lyge",
    "media_urls": [
        "http://cjonline.com/news/2016-09-29/graduate-student-employees-will-lose-health-care-subsidies-kansas-universities-say"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So... is everyone still in agreement that the ACA was a good move? I'm not seeing who it benefited other than the insurance companies.",
            "score": 3,
            "author": "the_flynn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know quite a few people who have health insurance for the first time thanks to the ACA.",
                    "score": 2,
                    "author": "emknird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also wonder how many may have lost/lost the ability to pay for it, as well. ",
                            "score": 3,
                            "author": "Bigtuna546",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "According to the RAND Corporation, somewhere between 0 and 1.6 million people lost insurance. (They estimate 700,000 with a margin of error of 900,000.)\n\nConversely, they estimate 9.3 million newly insured individuals, with a margin of error 3.5 million, placing the total at between 5.8 and 12.8 million. (That doesn't include 3.5 million young adults who were able to be added to their parents policies because of the change in age restrictions.)\n\nSo using the worst case scenario for both numbers, there are 4.2 more people insured than before ACA. Using the best case scenario, there are 12.8 million more insured than before. And using the most likely numbers, it's 8.6 million more insured than before.\n\nSome Republicans are claiming that millions of people lost their health insurance, but that's some heavy spin. A lot of people lost the *specific* policy they had previously, because it didn't meet the law's minimum requirements, but they were able to switch to an eligible plan with the same provider.\n\n[Source](http://www.factcheck.org/2014/04/millions-lost-insurance/)",
                                    "score": 3,
                                    "author": "emknird"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}