{
    "id": "66q4n2",
    "score": 10,
    "title": "Mac or PC?",
    "author": "Scramblase",
    "date": 1492790693.0,
    "url": "https://www.reddit.com/r/KState/comments/66q4n2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently a senior in high school and will be attending K-State next fall. I am just wondering if there seems to be a preferred operating system on campus. (i.e., will I have problems with compatibility if I am using an Apple computer?)",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, yes.  If they're going into architecture, we have requirements for desktops at the third year level, but if he/she is getting a laptop now, it won't matter.  Architecture is 95% PC (at least in school).",
                    "score": 3,
                    "author": "FR3SH_W1LL"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably not. What college/program?\n\nEdit: Also, who the hell downvotes a simple and useful question like this?",
            "score": 6,
            "author": "Officer412-L",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't speak to agronomy's requirements. There may be specialized software (soil analysis or whatever) that would likely require Windows. If there's any sort of specialized software in Agronomy, it'll be Windows based.\n\nRegardless, if you already have a Mac, you're probably okay as long as it has an Intel CPU (which if it isn't nearly a decade old, it will) and you can run Windows on a Boot Camp partition.\n\nIf you don't yet have a computer, I'd suggest buying a PC, depending on your personal needs.",
                            "score": 3,
                            "author": "Officer412-L"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nope you're good, don't worry",
            "score": 3,
            "author": "undrwatersquad"
        },
        {
            "level": 0,
            "comment": "I've noticed that most PC laptops tend to be cheaper than mac laptops. They both do pretty much exactly the same thing, so if cost is your deciding factor, I'd go with PC.",
            "score": 3,
            "author": "AceEntrepreneur"
        },
        {
            "level": 0,
            "comment": "K-State provides MS Office licenses for free, and that + a reasonably modern web browser is all the vast majority of students will need. Also, you can get a copy of Windows for free via K-State as well, so if you do need to use Windows you can set up Bootcamp or use virtualization software on a Mac to do so.\n\nThe only programs AFAIK where an Apple device won't work for everything is architecture and human ecology design programs that expect you to procure a higher end Windows workstation that can handle required CAD work.",
            "score": 3,
            "author": "kramer314"
        },
        {
            "level": 0,
            "comment": "I studied Management Information Systems and not having a PC meant I had to go to the business building for all of my assignments. This sucks if you're going for efficiency, but it did help me make friends with others from class. ",
            "score": 3,
            "author": "Roflcawptur",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a pc that at least was powerful enough to play half life during 366 lecture. (greetings fellow MIS!) ",
                    "score": 3,
                    "author": "kazoni",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I played Shining Force on an emulator on my phone. Borth was a hell of a teacher. ",
                            "score": 1,
                            "author": "Roflcawptur"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should be fine with either in a general sense. Check to see that your major doesn't require you to run programs that need a certain OS though (would probably necessitate buying a PC). Could also impact your decision for a laptop or desktop.\n\nYou can also always run windows on Apple hardware if you like.",
            "score": 2,
            "author": "CLU_Three",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! I'm not sure if you have enrolled yet (not sure when enrollment begins) but I know in my major we had a counselor for our grade before classes even started. If you have enrolled already you can log into ksis and see who your counselor is. They would have the information for this and any other question and would be more than happy to help. You could also call your department and they could find someone that would be able to help you.\n\nAlso not sure if it's worth it price-wise for you but I bought a laptop before coming to school on tax free day in Missouri and also got some extra deals for being a student. This was a few years back of course...",
                            "score": 1,
                            "author": "CLU_Three"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "either one but give consideration to a Chromebook too.  99% of what you will be doing is web based and Chromebooks are perfect for that.  ",
            "score": 1,
            "author": "ksuwildkat"
        }
    ]
}