{
    "id": "7cppd5",
    "score": 22,
    "title": "The last time classes at K-State are believed to have been canceled for non-weather related reasons was in 1916, when students worked to realign the old football field where the Alumni Center sits today.",
    "author": "kstatecollegian",
    "date": 1510602502.0,
    "url": "https://www.reddit.com/r/KState/comments/7cppd5",
    "media_urls": [
        "http://www.kstatecollegian.com/2017/11/12/field-day-in-1916-paved-the-way-for-ksunite-a-century-later/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So they're canceling classes because of a fake antisemetic incident and two fake racist incidents?\n\nhttp://ksnt.com/2017/11/13/police-say-k-state-noose-may-not-be-racist/",
            "score": 10,
            "author": "VdogameSndwchDimonds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty sure the homophobic graffiti and the white supremacist posters were real.",
                    "score": 4,
                    "author": "CLU_Three",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Give me a break.  The \"homophobic graffiti\" could have been written by anyone (and it doesn't mean anything) and the \"white supremacist posters\" were just trolling from 4chan type guys.  The only incidents that you can legitimately point to as being racist are the snapchat pictures of the white rain coats that look like Klan robes (and they do, it was a dumb joke, but they do look like that) and that fat chick who put on blackface a couple of years ago.  That's it.  A couple of dumb and mildly racist jokes from snapchat.  There is no problem with racism at K-State or in Manhattan, there are just people who want to make it look that way so that they can benefit from it.",
                            "score": 5,
                            "author": "VdogameSndwchDimonds"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They were cancelled in 2015 due to a guy wearing a dirty white t-shirt. ",
            "score": 5,
            "author": "Fisto6336",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's the story on this one?  I don't remember hearing about it.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was a guy in town who was thought to have a gun. He was close to campus so they just cancelled classes until it was sorted out. I don’t think anything bad actually happened. ",
                            "score": 5,
                            "author": "Fisto6336"
                        },
                        {
                            "level": 2,
                            "comment": "http://www.k-state.edu/media/newsreleases/sept15/lockdown9415.html",
                            "score": 4,
                            "author": "Fisto6336",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the info.",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And it probably did a much better job of uniting the students than trying to get them to sit through something equivalent to a sexual harassment seminar. Especially when the odds are that the only people attending will be people who already strongly share the same beliefs. The odds are pretty good that the people they are trying to reach with their message will be as far away from that event as they can get. ",
            "score": -6,
            "author": "techieman33",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the main point is to bring a large group of students, faculty and community members together to show our minority population that they are welcome here at KSU. You’re right, racists won’t show up and that’s probably a good thing. ",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Billionaires are considered minorites?",
                                    "score": 1,
                                    "author": "CapnEmaw"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m glad you feel comfortable on campus! That’s great to hear. But others do not. And we would be doing our community a disservice by not addressing these issues. Today isn’t going to “solve” anything but we are letting the entire MHK community know that hate has no home here. ",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 8,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People do feel uncomfortable and people do see this as a problem, otherwise nobody would have showed up today. There was a noose found on campus. There were white supremacy fliers found on campus. There were gay slurs found on campus. Two women at a KSU football game made reference to the KKK. These are the said issues that need to be addressed. This is the hate that I’m speaking off. ",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The only verified incident that you listed - the Snapchat - wasn’t addressed to anyone in an intentionally racist or hateful way. It was, at worst, a bad joke. That incident aside, can you say what is making “people feel uncomfortable” because it seems a little vague. Crime is down on campus...\n\nI find it a little odd to use the “people showed up so it must be a problem” argument since it’s hardly without confounding variables. I’d imagine a lot of people showed up for a lot of different reasons. I’ve never seen anyone try to give any sort of concrete, quantifiable measure for roughly how many people feel uncomfortable. I’ve seen under a dozen people say they feel uncomfortable in quotes in the collegian and I’ve also seen people - in sort of a racist way - assume those people represent their various minority groups, but no one has offered any evidence that being uncomfortable is a wide spread problem on campus much less how to solve the problem.",
                                                            "score": 7,
                                                            "author": "spect0rjohn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We’re just going around in circles now and I’m not gonna debate you all day about this. You are free to believe what you like. Just know that there are concerned students and concerned members within our community. Again, happy you feel welcome at KSU. ",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How are we going around in circles? That’s certainly not my intention. I have no doubt there are concerned students. However, without understanding the real scope of the issue it will be pretty impossible to suggest remedies.\n\nWhat strikes me about all of this is that no one has offered any sort of quantifiable evidence that X number of students feel Y way. There is a lot of vague talk about how “students” feel “uncomfortable” but no real attempt to come to terms with what that means. Why? One can barely ask the question without being accused of being an insensitive racist. \n\nWithout understanding the problem - assuming it exists - it’s impossible to think about solving it. I’ve seen a lot of universities throw money at similar issues and the problems seem to only intensify which suggests that those solutions don’t work. I’m not sure where that leaves KSU.",
                                                                            "score": 5,
                                                                            "author": "spect0rjohn"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; Just know that there are concerned students and concerned members within our community.\n\nConcerned about what?  Fake hate crimes?  Manhattan and K-State have always been welcoming to minorities.  If there really was something to be concerned about you'd have more than two dumb jokes on social media to point to.",
                                                                            "score": 5,
                                                                            "author": "VdogameSndwchDimonds"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Are you even on campus?",
                                                                            "score": 4,
                                                                            "author": "Reedfrost"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}