{
    "id": "7mznds",
    "score": 19,
    "title": "How conservative is KSU?",
    "author": "JoshuaHimemiya",
    "date": 1514609493.0,
    "url": "https://www.reddit.com/r/KState/comments/7mznds",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Decently ",
            "score": 22,
            "author": "Pittcrew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed.",
                    "score": 3,
                    "author": "nasty_fish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Basing my response off your comment history, if you're worried about LGBTQ stuff, it's actually a decent place, I think. There's active [LGBTQ] (http://www.k-state.edu/lgbt/) groups. Counseling services has dedicated [LGBTQ and trans-specific] (https://www.k-state.edu/counseling/student/group.html) group therapy sessions. The LGBTQ community in Manhattan is larger than I would have ever guessed before I came out and started getting involved and on the apps\n\nOne of the happiest things for me I've seen was two guys casually holding hands in between the Engineering complex and Seaton Hall a few months ago. A grad student in my lab is also gay (came to the holiday party with his boyfriend) and at least one of my engineering students is also gay.\n\nThere are going to be ignorant people, but they're shut down fairly quickly, mostly by others in their peer groups. Realize that many rural kids without much exposure to differences come here. There were some [cowards who grafittied some anti-LGBT] (http://www.kwch.com/content/news/Slur-continues-diversity-related-vandalism-at-Kansas-State-450278103.html) stuff a while back, but the campus is definitely becoming more [LGBTQ friendly] (https://www.campuspride.org/campus-prides-2017-best-of-the-best-top-25-lgbtq-friendly-colleges-universities/), if not alreay there.",
            "score": 13,
            "author": "Officer412-L"
        },
        {
            "level": 0,
            "comment": "More than most universities. But it is still a university, so there are many liberal idea floating around. I think it's a good balance overall. It depends on the specific college though. The College of Agriculture will tend to be more conservative than the College of Architecture, for example. ",
            "score": 28,
            "author": "Largue",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my experience it’s person to person. I knew Agg guys that were pretty liberal as well as some who were not so. But your assessment of it being well balanced is pretty spot on. For the most part there’s a good level of tolerance and civil exchange of ideas. \n\nThe surrounding townies though, that’s a different story. Lol. ",
                    "score": 9,
                    "author": "EMAW2008"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a godless liberal at a conservative university, yet I'm very happy here. Some of the religious groups get on my nerves from time to time, but that's just because they'll try and recruit you, and that happens on every campus. \n\nThe culture here has a very relaxed, live-and-let-live vibe. Honestly, its a breath of fresh air. I feel very comfortable here. \n\nI wouldn't let politics be a major concern. I'd be more worried about K-State's recent budget problems or just Manhattan in general. If you're not into partying, it can be pretty boring. ",
            "score": 12,
            "author": "DestructiveLemon"
        },
        {
            "level": 0,
            "comment": "I am a liberal and openly share feminist opinions with little to no backlash, the only thing I notice is very strong Christian influences, I am an atheist and have been for a while but do not feel comfortable sharing this with most because I have been shamed and campus has many large very religious Christian groups ",
            "score": 8,
            "author": "poisedpotato"
        },
        {
            "level": 0,
            "comment": "Like others have noted, it kinda depends on what classes you’re taking and where you live. I have friends in my dorm who took English 100 and they said the only way to get an A is to write as liberally as possible... so it kinda just depends. A lot of the students here are either from big towns in Kansas like KC or Wichita, or from really small farm towns in the middle of nowhere, so the student population is pretty diverse in their beliefs. Hope that helps",
            "score": 3,
            "author": "Apex_dream"
        },
        {
            "level": 0,
            "comment": "I can speak as an openly gay male I only had a handful of issues and overall the campus was very accepting. ",
            "score": 3,
            "author": "Samwellwayne"
        },
        {
            "level": 0,
            "comment": "I'm a raging liberal, who started here in 2016, and can tell you that Kstate is less liberal than i thought coming in, but it isn't conservative.  Ag majors and business majors tend to be more conservative, but I've never met one conservative in the college of psychology, or theater.  My favorite HS teacher was a kstate alumnus mega liberal bernie supporter.  If i had to put a number on it, Kstate is 45% liberal leaning, 30% conservative, and 25% moderate/undecided.",
            "score": 2,
            "author": "Diehardksu"
        },
        {
            "level": 0,
            "comment": "It's conservative by state university standards, which means campus groups generally prefer Fabian socialism to the fast glory of revolutionary anarcho-communism.\n\nSeriously, it depends on the department. Humanities are always left wing, engineering and ag not so much. KState is no different.",
            "score": 4,
            "author": "Caz1982"
        },
        {
            "level": 0,
            "comment": "It is pretty conservative, but there are still many liberals. If anything, it it mostly religious.",
            "score": 3,
            "author": "Grammarnazzzi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw very little outward religious culture when I was there a decade ago.",
                    "score": 4,
                    "author": "DarwinsMoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a student there now. It's huge. ",
                            "score": 7,
                            "author": "Grammarnazzzi"
                        },
                        {
                            "level": 2,
                            "comment": "As an alumnus who was also there a decade ago, I can tell you that there were tons of Bible studies in the coffee shops (and a few in bars as well). ",
                            "score": 2,
                            "author": "bmnz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, this. They had a habit of monopolizing Blue Stem. One of them would buy a coffee and the rest of them would get waters then they’d sit there for hours talking about non-denominational bro Jesus.",
                                    "score": 4,
                                    "author": "spect0rjohn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nonbronominational",
                                            "score": 1,
                                            "author": "bmnz"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hahaha so guilty of this man. Being broke but needing to meet had me desperate. Good news was many of the employees of bluestem are Christians and didn't bother us",
                                            "score": 1,
                                            "author": "Roflcawptur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah but you do realize there are plenty of actual *free* meeting spaces in any college town, right? Also, you understand that even though they don’t bug you, every person taking up a chair for hours is costing them (and the servers) money. Yeah, I get it, the place isn’t full 100% of the time but I’ve seen it pretty full where “broke” college people are totally oblivious to their impact.",
                                                    "score": 7,
                                                    "author": "spect0rjohn"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol",
            "score": 1,
            "author": "CurbCat_27"
        },
        {
            "level": 0,
            "comment": "More liberal than conservative.  All of the people saying it's conservative are comparing to schools like KU, Cal's University system, etc.  Yes, there are conservatives here, but no they're not the majority in my opinion.",
            "score": 1,
            "author": "jmartn23"
        },
        {
            "level": 0,
            "comment": "I'm a liberal leaning white straight male, so my opinion may not mean much, but KSU is in Kansas in an agriculture dominant community. I'm an engineering student, so we mainly keep to ourselves, as engineers do, so I don't run into anybodies views either way. English classes, and some economic classes, will go more into politics and personal opinions but even then most people here at KState are respecting of everyone's views that I've seen. I would say out of the vocal groups on all sides of any political affiliations, it's about 50/50, you'll hear just much from a conservative view point as you will a liberal view point walking through the union or down the street.\n\nFunny story, a couple semesters ago, just after Sanders dropped out of the democratic race, my econ professor put up a poll with who the class would vote for if the election  was that day, there was Trump and Hillary and then 2 or 3 third party candidates. A surprising amount of people, to me, voted for Trump, but that was also when conservatives and liberals alike thought he had no fighting chance of winning, so I wonder how many of those votes were joke votes?",
            "score": 1,
            "author": "BBrown7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fewer than you'd like.",
                    "score": 2,
                    "author": "jldugger"
                }
            ]
        }
    ]
}