{
    "id": "99702p",
    "score": 16,
    "title": "I'm a K-State Grad running for State House in Manhattan",
    "author": "vandykeforkansas",
    "date": 1534885334.0,
    "url": "https://www.reddit.com/r/KState/comments/99702p",
    "media_urls": [
        "http://secure.actblue.com/donate/vandykeforkansas"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "good luck!",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Help me out by upvoting and liking and sharing my pages :) or donating if you have the means!",
                    "score": 4,
                    "author": "vandykeforkansas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You only linked to a donation page... Who are you? What policies are you running on? Why should we donate and vote for you?",
            "score": 4,
            "author": "ten23",
            "replies": [
                {
                    "level": 1,
                    "comment": "The “link” post only allows that. But great question! My website is www.vandykeforkansas.com and my Facebook page is /VanDykeForKansas\n\nMy key platforms are\nEqual Pay for Women\nMedicaid Expansion\nEquitable Taxes\nFully-funded education which includes universal pre-K and expanded funding to higher ed. ",
                    "score": 2,
                    "author": "vandykeforkansas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.eeoc.gov/laws/statutes/epa.cfm\n\nIt appears your 55 years too late. How can you be \"progressive\" and be so far behind. ",
                            "score": 1,
                            "author": "the_crx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Equal Pay Act has numerous loop holes which companies have used for a long time, such as creating new title names to get around paying women the same for the same job or shoe-horning them into more \"feminine\" positions and career tracks. The state of Washington recently made updates to the equal pay law ([https://www.fisherphillips.com/resources-alerts-equal-pay-for-equal-work-washington-updates](https://www.fisherphillips.com/resources-alerts-equal-pay-for-equal-work-washington-updates)) which I am wanting to bring to Kansas.",
                                    "score": 3,
                                    "author": "vandykeforkansas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you're claiming that a difference in pay is based on gender then why is it single, childless women earn more?\nhttp://content.time.com/time/business/article/0,8599,2015274,00.html\n\nMaybe there is more to the differences in pay. Maybe it's [hours worked](https://www.bls.gov/opub/ted/2015/mobile/time-spent-working-by-full-and-part-time-status-gender-and-location-in-2014.htm), [career](https://www.the-american-interest.com/2016/05/09/men-and-women-choose-careers-differently/) [choice](http://gap.hks.harvard.edu/gender-competitiveness-and-career-choices), [family priority's](http://www.pewresearch.org/fact-tank/2015/10/01/women-more-than-men-adjust-their-careers-for-family-life/), or maybe women choose [safer jobs](https://www.forbes.com/sites/timworstall/2016/12/21/heres-your-gender-pay-gap-fatal-occupational-injuries/).\n\nEven after all of that let me lay out a scenario for you.  Say you own a business.  You are looking to hire a worker that will be the best fit. You have two applicants. One man and one woman. Both have equal education and experience. Both of them are in the mid 20s and married.  Given the statics are data available it would show for the same money the male would be the better choice given that statistically men work more hours, are more dedicated to their job, and due to biology will not need to be on leave for child care after birth. So given the law requiring both to be paid the same, and given that there is, statistically speaking, a greater return for hiring the male, the woman then is either not able to compete or your company will be worse off by having a lower return. \n\nJust like right now. Three weeks ago I had a child and my wife is currently home on maternity leave while I went back to work at the start of the next week and have been working overtime to stay caught up. \n\nIt is entirely possible that the entire world isn't sexist and that it's the choices people make that lead them to the result they have. ",
                                            "score": 1,
                                            "author": "the_crx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Point being: The decision shouldn’t be “you might birth a child, so I’m not going to hire you.” I never intended to imply the whole world is sexist. Only that the current system is geared to benefit men over women.\n\nWhile we disagree on this point, there are many platforms I am championing which I'm sure we can agree on (if not, also fine, just don't vote for me). If you have any further questions, remember that I have an [AMA](https://www.reddit.com/r/littleapple/comments/99d4vp/im_a_local_engineer_running_for_ks_house_67_as_a/) on Monday.",
                                                    "score": 4,
                                                    "author": "vandykeforkansas",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Only that the current system is geared to benefit men over women\n\n\nMen statistically work more hours, work more dangerous jobs, have almost all workplace fatalities, but no one ever talks about leveling out the numbers there.  Notice how everyone talks about the gender disparity with CEOs, but no one mentions the numbers with oil yard workers, or trades workers who also make good money. There is just more work involved in often unclean conditions. \n\nA society that works toward equality over freedom will end with neither equality nor freedom. \n\nI just feel with all of the problems that the state faces it may not be wise to spend time and effort chasing a problem that doesn't really exist anymore. \n\nIn closing I would just say thanks for responding instead of just ignoring like so often happens. \n",
                                                            "score": 2,
                                                            "author": "the_crx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You are exactly right on.",
                                                                    "score": 2,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}