{
    "id": "bhuzs8",
    "score": 6,
    "title": "Public dorm bathrooms?",
    "author": "Ehere",
    "date": 1556335187.0,
    "url": "https://www.reddit.com/r/KState/comments/bhuzs8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Moving in next year as a freshman, are the public bathrooms sanitary and useable?",
    "comments": [
        {
            "level": 0,
            "comment": "Depends on your hall generally, but yes. The community dorm bathrooms are cleaned daily by housing staff during the week, but not during the weekends so they can get a tad messy then. I didn’t mind using them during my 3 years in the dorms.",
            "score": 8,
            "author": "Mitzeman"
        },
        {
            "level": 0,
            "comment": "Lived in goodnow.  We were a bit rowdy, so Sunday's were rough because they arent cleaned on weekends.  Other than that, the only problem was athlete's foot and all you need to counter that is a pair of dollar store shower shoes.\n\nBest of luck on your first year dude.",
            "score": 4,
            "author": "zmironman",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s where I might be going, Goodnow. I’m mostly worried about the showers but I’m thinking after a year or two I’ll do an apartment with a couple friends, so if it isn’t too bad i won’t worry!",
                    "score": 1,
                    "author": "Ehere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I loved living in Goodnow and never had any problem with the cleanliness of the showers/bathrooms. The housekeepers came everyday to clean (except weekends) which was WAY more than I probably would have cleaned myself. I have also heard horror stories about gross roommates in suites and I’m SO glad I never had to clean someone’s vomit 🤢",
                            "score": 1,
                            "author": "thehotkettlecafe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lived in Moore for a semester. Bathrooms were rarely unusable, but I never walked in there barefoot. Also worth noting that the water pressure was fantastic in the showers.",
            "score": 7,
            "author": "Herp_Derp_Merp",
            "replies": [
                {
                    "level": 1,
                    "comment": "And don’t forget the unlimited hot water 👌",
                    "score": 9,
                    "author": "kckeller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As others said, some Sundays it can be really bad. Drunk people make a mess. We had shit in a shower, puke in the sink etc happen on Friday nights a few times and you get the joy of it sitting there until Monday.\n\nOther than that, it’s great. I’d wear sandals when showering though.",
            "score": 3,
            "author": "diddlyumpcious4"
        },
        {
            "level": 0,
            "comment": "They are generally fine but the worst bathrooms I've ever seen were during 2 semesters in Haymaker.  Sunday mornings could be absolutely horrific. The cleaning staff actually threaten to quit cleaning them if things continued as they were.",
            "score": 2,
            "author": "linuxfiend"
        },
        {
            "level": 0,
            "comment": "I lived on the community side of haymaker last year. It was disgusting. It was all dude in a community bathroom so what do you expect? Although they cleaned it everyday. If you time showers right it will always be clean lol",
            "score": 2,
            "author": "ThehutchFromKc"
        }
    ]
}