{
    "id": "gi1ljq",
    "score": 4,
    "title": "Anyone know when freshmen can buy ICAT passes?",
    "author": "ksu_rjf",
    "date": 1589248346.0,
    "url": "https://www.reddit.com/r/KState/comments/gi1ljq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I saw one source from a few years ago say June 1st, but I'm not sure if it's any different this year and haven't heard anything about it. When I tried getting it through KSIS a few days ago, it said I wasn't a student yet. Anyone know the situation? I'm really excited to get one, so any info would be mega appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "I believe when I bought my athletics pass my freshman year (2016) it was after enrollment/orientation, they also had a booth set up with athletics staff assisting sign ups at it. Typically freshman don’t end up with ICAT because of this, but with everything going on in the world right now who knows if ICAT will sell out early!",
            "score": 9,
            "author": "Misguidedcanvas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe they set aside at least some ICATs for freshmen and they have an opportunity for a four year ICAT, but yeah who knows what's going on with COVID now",
                    "score": 5,
                    "author": "slayer_in_the_night",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that sounds about right, but from what I’ve been seeing about large events is that there wont be any with fans until 2021 so it will be interesting to see how the KSU and the NCAA handles football and basketball games.",
                            "score": 4,
                            "author": "Misguidedcanvas"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should definitely be able to buy them after orientation. Icat also shouldn't sell out, it didn't last year. Make sure to buy them when you can and follow @Kstate_students on Instagram and twitter",
            "score": 3,
            "author": "blake1506"
        },
        {
            "level": 0,
            "comment": "I believe you can. Lots of people I know had one as a freshman. I would try again, and if it didn’t work I would call the athletics department and ask. They can definitely point you in the right direction.\n\nNext year for football and basketball are kind of rebuilding years, so you probably have a better chance of getting one before they sellout.",
            "score": 3,
            "author": "HorseRacingGuy"
        }
    ]
}