{
    "id": "h9rr4e",
    "score": 5,
    "title": "How common is it to graduate in 4 years?",
    "author": "Smoky_biscuit",
    "date": 1592264509.0,
    "url": "https://www.reddit.com/r/KState/comments/h9rr4e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello guys! I am a K-state student going into my senior year. I used to think most people would typically graduate in 4 years, but it seems honestly that most are taking more than that. What are your perspectives what makes people take more than 4 years to graduate and how common is it for people to graduate in 4 years?",
    "comments": [
        {
            "level": 0,
            "comment": "I took 5 lol",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I took 3, so together we average out. High fives, my dude! \n\n(In truth I rushed for reasons that in hindsight were silly, and would have rather taken the full 4)",
                    "score": 6,
                    "author": "JAFERDoc"
                },
                {
                    "level": 1,
                    "comment": "I did too, changed my majors twice. Really enjoyed my 5th year.",
                    "score": 1,
                    "author": "KC_Canuck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "4 for my undergrad and then another 4 for my doctorate\n\nLove Manhattan and miss it but I was ready to leave at year 6 lol",
            "score": 8,
            "author": "miosgoldenchance"
        },
        {
            "level": 0,
            "comment": "Took 5. Felt like I had seen and done everything I wanted. Buddies who did it in 4 came back every weekend and wished they did 5.",
            "score": 5,
            "author": "petepetep",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're making me really want a time machine. Good on you!",
                    "score": 2,
                    "author": "JAFERDoc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously will depend on what you get in to, but if you don't switch majors and stick with the right classes from the start, 4 is common. I could have been done in 3 1/2 if I would have done it right, but graduated in 4.",
            "score": 5,
            "author": "KSU_10"
        },
        {
            "level": 0,
            "comment": "Took 4",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Took 5. Needed 2 odd classes to graduate so I made a victory lap about it. Like others said I would not have mentally been ready to leave mhk after 4. Miss it a ton now!",
            "score": 3,
            "author": "noirepinephrine"
        },
        {
            "level": 0,
            "comment": "Some majors will require 5",
            "score": 4,
            "author": "p3zdisp3nc3r"
        },
        {
            "level": 0,
            "comment": "Just finished in 4. Nothing wrong with taking an extra semester or two. Plenty of my friends are doing it and it just gives me another reason to go back to MHK!",
            "score": 4,
            "author": "mustard-_-"
        },
        {
            "level": 0,
            "comment": "it really depends. I think it's common to do it and 4 and it's common to do it in up to 5 or 5.5 years. I'm taking 4.5 and graduating this December. I know multiple other people who are going beyond 4 too.",
            "score": 3,
            "author": "ecocomrade"
        },
        {
            "level": 0,
            "comment": "I did 4.5",
            "score": 2,
            "author": "thedankbank1021"
        },
        {
            "level": 0,
            "comment": "I took 4 in an engineering degree. It's possible but you have to retake minimal classes, and make sure you plan ahead for classes that are only available in spring/fall and be ready to take summer classes if something happens like failing or not getting into a class. \n\nWhen I first went to college I was told that it's common for degrees to take 5 years now. Probably stems from no overworking yourself, summer classes aren't required, likely you'll fail a few classes, etc. But it's absolutely possible to do it in four, even less if you try really hard.",
            "score": 2,
            "author": "BBrown7"
        },
        {
            "level": 0,
            "comment": "honestly depends on what your major is, if/when you change it, and how many college credits you’re starting out with. my major was fairly easy and i graduated high school with 19 credit hours under my belt so i graduated in 3.5 years. i know someone who has graduated in 3. but in other majors, i’ve seen people take 6 or 7 years.",
            "score": 2,
            "author": "vectorvex"
        },
        {
            "level": 0,
            "comment": "Completely depends on how many credits your program is, how many credits you take per semester and how many credits you brought in with you. I brought in very few credits with me and my first semester my counselor told me to continue taking 13 hours / semester. \n\nI divided my program’s credit hours by 13 and realized if I followed their advice I’d be at KSU for over 5.5 years (which is not necessarily a bad thing)! Just saying it is helpful to look critically at advise that people, even your academic counselor, give you.",
            "score": 1,
            "author": "flyingmonkeyboy"
        },
        {
            "level": 0,
            "comment": "It’ll be 4 1/2 for me. Added a minor and my counselor fucked up a little bit so I couldn’t get done in 4 because of how classes were scheduled",
            "score": 1,
            "author": "tcthomas1110"
        },
        {
            "level": 0,
            "comment": "Just asking because I’m on track to finish in 4 years and it feels like I’ve been in this town for about a century.",
            "score": 1,
            "author": "Smoky_biscuit"
        }
    ]
}