{
    "id": "kup9ae",
    "score": 2,
    "title": "Question about Co-Ed dorms",
    "author": "limphintrant",
    "date": 1610319302.0,
    "url": "https://www.reddit.com/r/KState/comments/kup9ae",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is there a rule against being in a co-Ed dorm with a person that you are in a relationship with.",
    "comments": [
        {
            "level": 0,
            "comment": "I lived in Goodnow in the Kramer community (shoutout to the penthouse) and the building has 3 wings. On my floor (6th) we had 2 boy wings and 1 girl wing. I assume it ran thru the building as boys living in A and B wings and girls all C.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As others have said, there are no coed dorms. Wefald is the closest you’ll get and that has alternating rooms. My now fiancée and I lived in Marlatt and she was a floor up from me. It worked pretty well.",
            "score": 1,
            "author": "NO-IM-DIRTY-DAN",
            "replies": [
                {
                    "level": 1,
                    "comment": "KSU once had co-ed dorms. Van Zile girls were mostly honors students and widely considered the most sexually advanced. (This is all hearsay from my dad.)",
                    "score": 1,
                    "author": "hipsterfromhell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wefald has coed wings, as in your neibors can be opposite gender. However you are not allowed to live in the same room as an opposite gender. But to echo others here, try to have good boundaries from your significant other moving into college. A lot changes and you'll both want to have space to grow.",
            "score": 1,
            "author": "Oucho2pierce"
        },
        {
            "level": 0,
            "comment": "When I lived in Moore there were co-Ed floors with males on one side and females on the other. Bathrooms were NOT co-ed. I did have a fling with a guy on my floor - do not recommend.",
            "score": 3,
            "author": "LaPete11"
        },
        {
            "level": 0,
            "comment": "I know the 2nd floor of West has both male and female rooms. You can have a relationship with anyone, though I would advise against living in the same room with a same-sex partner.",
            "score": 2,
            "author": "Charinabottae",
            "replies": [
                {
                    "level": 1,
                    "comment": "strongly agree. never date your roommate. it's a lot easier to break up than it is to break your housing contract and it's really unpleasant to end up living with your ex unexpectedly",
                    "score": 3,
                    "author": "Winter_King1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "there are no co-ed dorms at K-State. buildings may have both male a female floors but rooms are not co-ed. there is no rule against having a relationship with someone else in your building/floor.",
            "score": 8,
            "author": "Winter_King1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you that helps a lot",
                    "score": 3,
                    "author": "limphintrant"
                }
            ]
        }
    ]
}