{
    "id": "nsf1y1",
    "score": 13,
    "title": "Incoming freshman!",
    "author": "lgo21",
    "date": 1622839518.0,
    "url": "https://www.reddit.com/r/KState/comments/nsf1y1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I’m an incoming freshman this fall at K State and just reaching out for any advice y’all may have.. I’ll be in the Mass Com/Journalism school, I’m on the rodeo team, &amp; I’m living in a traditional in West Hall. \nI’d love to hear whatever you guys have to share about your experiences, the good, bad and the ugly, any tips or advice, etc! Also curious on what The Aggieville scene and party scene is like. TIA!",
    "comments": [
        {
            "level": 0,
            "comment": "I lived in West Hall, it was a great community. Make sure to go to floor events, it’s a great and easy way to meet people. I’m sure you’ll enjoy the rodeo team, there’s a lot of rural/ag people at KSU. The other commenter’s experience was like 40 years ago, don’t be worried, K-State’s a friendly place. Unfortunately, can’t help you with the party scene.",
            "score": 4,
            "author": "Charinabottae"
        },
        {
            "level": 0,
            "comment": "Hi! I’m a December 2019 grad. I lived in Moore, which is in the Derby complex for my freshman year. The Derb is the best! West was under construction when I was on-campus, so I think it looks quite a bit different now and The Derb also is newly renovated! You’ll want to get involved in your dorm and community; I met so many good friends in the dorms. “Floor dinners” were of the best times. I really recommend doing the cheesy back to school activities and taking advantage of free Call Hall at any events and booths. I also can’t recommend enough - if you’re wanting to work part time to find an on-campus job. They can be a great ways to get involved, meet people, and work with your schedule while also making a bit of money! \n\nWhile you’re under 21, the true party scene will likely be house parties. Dirty Dawgs, Kaws House Party, and Tubby’s were some of the 18+ bars while I was there and it can be a lot of fun just to go out with friends and dance. I’ll be vague - be safe and smart, the bouncers are pretty good at doing their jobs in MHK. The Ville is a ton of fun to bar hop when you do turn 21, but I recommend pregaming to save money. \n\nYou HAVE to go the Varsity Truck after a night out. My other favorite spots are Top of the World, Manhattan hill, KS hill, So Long Saloon, The Chef, cookie bakes @ Mr. Ks, Arrow Coffee, Bluestem Bistro, and Public Hall. \n\nManhattan is a special place. I wish I could be in your shoes again! Go ‘Cats.",
            "score": 5,
            "author": "By_theseaside"
        },
        {
            "level": 0,
            "comment": "Feel free to message me! I just finished my freshman year, I lived in West and Im polysci and history!",
            "score": 2,
            "author": "spectacularlykate"
        },
        {
            "level": 0,
            "comment": "I was also Mass Comm and lived in West three of my four years. I loved it so much. I was also really involved in the Collegian, so pick your student media of choice and hop in, because it’s a great way to get valuable experience, clips, and meet people!\n\nParty scene involves a lot of house parties. I’ve lived in a lot of college towns and Aggieville is the only place to do a proper pub crawl, imo.",
            "score": 2,
            "author": "nomadicfangirl"
        },
        {
            "level": 0,
            "comment": "Depending on what you want to do with Mass Comm/ Journalism I would recommend checking out K-StateHDTV. We do the TV production for every home game and every sport.",
            "score": 1,
            "author": "Oskeylin"
        },
        {
            "level": 0,
            "comment": "Repost from [this thread](https://www.reddit.com/r/AskReddit/comments/4uuky5/whats_one_thing_you_wish_you_knew_before_starting/) (which is excellent)\n\n1 - Go To Class. I know, no one has mentioned this but its important.\n\n2 - Sit in the front, toward the middle. It makes you have eye contact with the professor which in turn keeps your mind engaged and helps keep you awake.\n\n3 - Talk to your professors BEFORE there is a problem. If you feel like you dont understand something, let the prof know right away. Keep doing this until you understand. If you wait until you fail a test to go to the prof, its too late. If you go early, there is a VERY good chance you can retake a test because you identified the issue and he/she was unable to overcome your not understanding. That makes it a teaching problem.\n\n4 - Go To Class. Seriously. You are PAYING to be there. Show the F up.\n\n5 - Sit in the front, toward the middle. The prof will recognize you as someone who shows up, is awake and is engaged. If you approach them about an issue learning, you dont want them to say \"which class are you in?\"\n\n6 - Talk to your professors. I had to miss a ton of class because of ROTC commitments. I let my professors know early and rescheduling stuff, getting different deadlines, etc was not a problem. My son is also in ROTC and because I beat this into him he did the same. Toward the end of last semester he was going to miss a quiz in a class he had an A in. The professor said \"You have an A. Im going to assume you will ace this quiz\" and gave him credit for taking the quiz.\n\n7 - Go to class, sit up front, talk to your professors.\n\n8 - TWO HOURS. Dedicate two hours a night to homework/study. Two honest hours. That means no phone, no TV, no reddit for two hours of solid study. Do this 5 nights a week - Sunday to Thursday. No Studying Friday night. Your brain needs a rest. Saturday is optional or additional study. You might need to study more some days/nights but never go less. ALWAYS do your two hours. ALWAYS.\n\n9 - Hear it, write it, use it in context. Hear what the professor says. Write down what you hear. Use that in context. Do this and you will LEARN. if you take notes in class, rewrite them after class and your retention will skyrocket. Use it in context and you will internalize.\n\n10 - Seriously, two hours. If you do that from the first day of the term to the end you will not have to cram at the end of the semester. Two good hours every day. Two good hours. Trust me. It works.\n\nAnd 11 - Go. To. Class.",
            "score": 1,
            "author": "ksuwildkat"
        },
        {
            "level": 0,
            "comment": "I'll bite.\n\nMy college experience began in the fall of 1985 when I started college at Wichita State University for 3 semesters, then transferred to KSU in the spring semester of 1987 and went until I graduated from veterinary school in May of 1993. Manhattan was NOTHING like it is now: think ratty old buildings, nothing to do except go to bars or Tuttle Creek. I hated every second I was there, never went to bars because I didn't have a fake ID.  I was in a sorority for 2 years and made some pretty good friends. The most fun I had was going to KU to visit my best friend from high school and my crush.\n\nI cannot go to Manhattan to this day without having PTSD from worrying about studying enough. I go to Oklahoma State University for continuing education meetings so I won't have to face Manhattan.\n\nMy recommendation to you since you are a journalism major and don't need super great grades is to find a way to balance school with a fun college experience.",
            "score": -13,
            "author": "i-touched-morrissey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry you are getting downvoted.\n\nI graduated in 1994 so I know what you are talking about.  I tell people I drove out of town waiving but with only one finger.  Manhattan was a small town filled with small people and a small worldview. That changed almost as I was driving away.\n\nFrom 94 to 2013 I was in MHK once for about 3 hours when I drove from Leavenworth to the Octagon for a basketball game.  \n\nIn 2013 I went back to watch the Cats play UMASS.  The West Stadium had just opened and my daughter was a UMASS student so it seems like destiny said to go.  I was honestly gobsmacked at how much Manhattan had changed.  It went from Applebees being fine dining to a foodie town with amazing options.  Dinner at Coco Bolos, breakfast at The Chef and doughnuts at Varsity.  The friendliness of campus had spread to the city and it was no longer a \"townies vs gownines\" atmosphere.   \n\nMy son just graduated in May and I was honestly sad to drive away.  You should go back.  Its really worth it.\n\nEdit - just checked my Marriott records.  Since 2013 I have spent 68 days in MHK.",
                    "score": 1,
                    "author": "ksuwildkat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had to go back twice this last winter with my mom and her dog who had cancer. I walked across town and campus one morning and it looked nice, but I really felt sad that some of the old houses were torn down and big apartments were there. That place is cursed to me. PS. I don't care if I am downvoted. I never won any popularity contests anyway.",
                            "score": 1,
                            "author": "i-touched-morrissey"
                        }
                    ]
                }
            ]
        }
    ]
}