{
    "id": "oizfqz",
    "score": 3,
    "title": "Planing on becoming a student next year any early advice to help my chances of getting in or anything else I should know?",
    "author": "Wildlife_biology_",
    "date": 1626120972.0,
    "url": "https://www.reddit.com/r/KState/comments/oizfqz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "as long as you have a 2.0 GPA you'll get in",
            "score": 17,
            "author": "wwinny7"
        },
        {
            "level": 0,
            "comment": "I loved my time at kstate, but they honestly have one of the highest acceptance rates of any school (&gt;99% applicants accepted), don't sweat about getting in.",
            "score": 9,
            "author": "rectal_cunilingist"
        },
        {
            "level": 0,
            "comment": "Pay attention to the ACT score required to gain admission to the university vs. automatic acceptance into the specific college/program you intend to go through (may not be the same).  Also, look at scholarships you can get automatically through ACT score and re-take ACT to get to next level if you're close.  Could be worth an easy few thousand dollars.",
            "score": 8,
            "author": "cyberphlash",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a transfer and I thought I read I won't need my act scores if I'm a transfer? Not sure jw",
                    "score": 2,
                    "author": "Wildlife_biology_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is true: transfer students do not need to take the ACT or SAT.",
                            "score": 3,
                            "author": "hallipeno"
                        },
                        {
                            "level": 2,
                            "comment": "Call college admissions before rolling the dice.  Maybe the admissions form will say.",
                            "score": 3,
                            "author": "DroneStrikesForJesus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry I should have clarified I'll be going in 2022 but I will definitely call admission long before it gets this late",
                                    "score": 2,
                                    "author": "Wildlife_biology_"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't take the act or sat and got accepted for business adm",
                    "score": 1,
                    "author": "tuttyfruttyjf"
                }
            ]
        }
    ]
}