{
    "id": "xaug4p",
    "score": 13,
    "title": "Trans woman deciding between K-State and KU.",
    "author": "ComradeOctopus",
    "date": 1662829614.0,
    "url": "https://www.reddit.com/r/KState/comments/xaug4p",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know for a fact that K-State has gotten much friendlier over the years, but I’m still held up on a few things. Probably my first concern is housing. I’ve toured KU and they seem to offer a variety of gender-diverse housing options. The closest thing that I know exists at K-State is that Wefald has a few coed wings, but I don’t think KSU offers such a living arrangement like KU does. \n\nSecondly, I know in terms of population, KSU tends to be a more republican school than in Lawerence, so if anyone has some pointers or insights into that, it would be wonderful to hear.\n\nThere are parts of KSU that appeal to me, primarily the compact campus, but I’m worried about the social environment there. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "I am a trans who has worked as an educator in Manhattan, though I can't speak much to K-State. People have generally been pretty ok, I know K-State has gender neutral restrooms in a lot of area.\n\nMight also get more answers on the Manhattan Discord if you ask about stuff there. \nhttps://discord.gg/S2t8EXJu",
            "score": 14,
            "author": "raisinsfried"
        },
        {
            "level": 0,
            "comment": "I'm MTF half/half in and out of the closet, and for being in the middle of Kansas, Manhattan is super friendly to LGBTQ+ folks.",
            "score": 6,
            "author": "Nayrash5",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did housing work? Did you live in a dorm with a guy or a girl for a roommate?",
                    "score": 2,
                    "author": "ComradeOctopus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live with my parents in a house. I haven't gone to K-State, but figured it was worth mentioning that the town is very LGBTQ+ positive.",
                            "score": 3,
                            "author": "Nayrash5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, okay. Thanks for the input!",
                                    "score": 2,
                                    "author": "ComradeOctopus"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.wibw.com/2022/08/25/k-state-named-most-lgbtq-friendly-campus-kansas/\n\nhttps://www.k-state.edu/today/announcement/?id=75482\n\nI'm a straight cisgender dude, but in my experience, LGBT people seem to feel comfortable enough here to be visible. There's same-sex couples holding hands in public, people put pride flags on their houses and apartment windows. Again, this is my straight, cis perspective, but I don't think people would be doing those things if they didn't feel safe.\n\n\n&gt;KSU tends to be a more republican school than in Lawerence\n\n\nOne thing to keep in mind here is that Lawrence is very liberal not just by Kansas standards, but by national standards. That doesn't mean that KSU is \"more Republican\". Only in comparison to one of the most liberal campuses in the country. It's still an average college town and those ALWAYS skew left, even in extremely rural places. You could probably go to a college town in a place even more rural than Kansas like Wyoming or Alaska and you'd still be in the same town, basically. To some extent, all college towns are the same.\n\nAlso, notice that according to the surveys I linked at the beginning of this comment, we're actually ranked higher than KU at least in regards to campus resources for LGBT folks.\n\nI would suggest reaching out to K-State's LGBT center  for more information.\n\nhttps://www.k-state.edu/lgbt/",
            "score": 14,
            "author": "mglyptostroboides"
        },
        {
            "level": 0,
            "comment": "Maybe you could connect with some people in this organization that can answer that for you! \nhttps://www.facebook.com/truecolorsflinthills/",
            "score": 3,
            "author": "EMAW2008"
        },
        {
            "level": 0,
            "comment": "First and foremost in my opinion: what is your field of study? I endured 6.5 years at KSU to go to vet school. My friends, sister, and boyfriend went to KU, and it seems like it's more my style because I'm a liberal. KSU has lots of boots and big belt buckles and rednecks, and IMO, this affects your outlook on college, so choose wisley, I think no matter your lifestyle, you will find your people when you decide your major. \n\nI lived in sorority for a couple years and no one ever saw me naked, so if that's the only hang up with being trans, you should find a group of people to hang out with.",
            "score": 3,
            "author": "i-touched-morrissey",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m doing an engineering major, so I can go pretty much anywhere. I was just corpus if anyone could attest to the friendliness of the area.",
                    "score": 1,
                    "author": "ComradeOctopus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ksu is a much better engineering school. I’m lgbt and went to Ksu for engineering. I never had any issues with anyone. Everyone was just there to learn and we had a fun time doing it. There were lots of queer folks on campus even 10 years ago. Not so many in engineering at the time but I’m noticing more young queer engineers entering the workforce where I work. Good luck in your schooling and career!",
                            "score": 3,
                            "author": "Itchy-Mind7724",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Say, I’ve heard that. I think KU and Lawrence just have a different vibe. For instance, I’ve heard that K-State really isn’t a party school as much as KU is. But I’m well aware that KSU has a good program with lots of students.",
                                    "score": 2,
                                    "author": "ComradeOctopus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh KSU can be a party school if you want it to be. I did partying at both places in the late 80s.",
                                            "score": 2,
                                            "author": "i-touched-morrissey"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The University of Kansas' engineering school is actually ranked higher than K-State's. \n\nAnd both are ranked lower than Wichita State's.",
                                    "score": 2,
                                    "author": "jaynovahawk07"
                                },
                                {
                                    "level": 3,
                                    "comment": "Much better? In what way? I thought the two programs were pretty comparable. I know KU has more comp sci students at the very least. I’m doing computer science, forgot to mention.",
                                    "score": 1,
                                    "author": "ComradeOctopus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Computer science may be comparable but there’s a lot more donor money going toward engineering at kstate and a lot more program options.",
                                            "score": 2,
                                            "author": "Itchy-Mind7724"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A few years ago, KSU's Comp Sci program basically got a completely new wing with completely new equipment almost entirely just for themselves ([on the map it's called \"Engineering Hall\"](https://map.concept3d.com/?id=731#!ct/44382,11701)). I used to steal over there from Rathbone because their elevators and bathrooms were in much better shape, lol. Paired with Wefald being right across the street from the engineering complex, I think it might be a good fit.",
                                            "score": 2,
                                            "author": "Officer412-L",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, I’ve seen that building during a previous visit. It’s very nice. I’d say the main advantage left for KU while writing this is it seems to be a more pleasant, walkable town, r/fuckcars style. But thanks for the input.",
                                                    "score": 1,
                                                    "author": "ComradeOctopus"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who has queer friends in KU, as much as I love K-State, KU is well known for being much more open and diverse. K-State has made really good strides, such as having a Multicultural Building with only gender neutral bathrooms, but compared to KU, it’s not much.\n\nHowever, both universities have better programs for different degree plans so your major might affect this as well.",
            "score": 4,
            "author": "de_lane"
        },
        {
            "level": 0,
            "comment": "If diversity and acceptance is extremely important to you, go to KU. They love boasting diversity stats like it’s what makes an education good. If you are looking for everyone to accept and love you for who you are, go to KU.",
            "score": -4,
            "author": "Novel_Feedback3053"
        }
    ]
}