{
    "id": "146i20q",
    "score": 627,
    "title": "Mega city is honestly bad",
    "author": "Killin4ssault12",
    "date": 1686450227.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/146i20q",
    "media_urls": [],
    "other_urls": [],
    "postText": "When I first saw it, I thought it was gon be like a revamped Neo Tilted (chapter 1 season 9 anyone?). But nah, barely anyone lands there, it doesn't feel as colourful and lively as Neo Tilted, you can't break down the buildings, it just feels unwelcoming after that.   \n\n\nSure the grinding rail system is cool but that's all I can say. As for comparing it to Neo Tilted? Reason I'm doing so is cause it just feels wrong that the same team that could make one of the coolest futuristic POIs ever with the wind turbine, the holograms, the futuristic clock tower couldn't do a better job with Mega City.",
    "comments": [
        {
            "level": 0,
            "comment": "I land the little island then go to the ship and launch pad to MC. By the time I get there like 3 minutes in it is empty and has like 50 chests there and the boss and vault.  It is wild how empty it always is.",
            "score": 244,
            "author": "RPuts5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly what I've noticed, even if no one says it out loud, the lack of people landing there explains enough.",
                    "score": 88,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The issue really is that you can not go through all the floors. Imagine if the POI was cut in half but you could access every floor. Including the rails and lines it would be great. Lots of ways to move in fights.",
                            "score": 75,
                            "author": "RPuts5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The SECOND I landed on the roof top and saw the rope thing you use to get from top to bottom floor, I thought exactly that, that there'd be multiple floors you could explore.\n\nSafe to say I was disappointed. It maybe be 3x the regular POI but doesn't have the essence of even 1.",
                                    "score": 42,
                                    "author": "Killin4ssault12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The random levels you can't get to without the specific ropes and cables is maddening too.  Tilted was something I had wanted to see in video games since Halo 1. I would tell my friends imagine a city environment with buildings that would break apart and you could access every room.  It is amazing how they went from that to shilted.",
                                            "score": 22,
                                            "author": "RPuts5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Like I said myself in my post, how is it that Epic can design Neo Tilted with a futuristic basketball court, holograms, accessible restaurants and what not, complete with wind turbines and hoverboards, but just put low effort into Mega City? You might think a POI they based a whole season off of would have so much more work put into it but nah, they just \"eh'd\" the whole thing.",
                                                    "score": 2,
                                                    "author": "Killin4ssault12",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's kind of what I feel about all the new POIs. Everything seems so lifeless  \n\"Is this worth fighting for?\"  \nNo. You expect me to believe anyone lives there?\n\nObviously it's a video game but it's weird how things that should be cool are ending up underwhelming.",
                                                            "score": 12,
                                                            "author": "zdakat",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Exactly \n\nWhat I used to love about this game was mainly the life in each apartment they used to try to create, with messy beds, sofas, kitchens etc. Back in chapter 1 we had the disco stages and I think in Neo Tilted we even had a room with gaming PCs in it. It just feels so lifeless now.",
                                                                    "score": 1,
                                                                    "author": "Killin4ssault12"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Imagine how tedious it would be to fight if every floor was accessible in these buildings. It would just be rats hiding in corners the whole time.",
                                    "score": 1,
                                    "author": "GoblinObscura",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then make less floors, OG tilted was cool and had less floors. No one would care if it was less, if there were more details it would be better liked and received.",
                                            "score": 1,
                                            "author": "Killin4ssault12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly half the size and half the floors and all the internal movement that is there now would make it great.",
                                                    "score": 1,
                                                    "author": "RPuts5"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Literally when it came out, it felt to empty",
                            "score": 2,
                            "author": "edlewis3035"
                        },
                        {
                            "level": 2,
                            "comment": "It's the new Rave Cave to me in that it was having all this mess made about it in promo materials and then I go there and it's just a few stragglers waiting for Highcard",
                            "score": 1,
                            "author": "r3volver_Oshawott",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man Rave Cave was garbage",
                                    "score": 3,
                                    "author": "BryNYC"
                                },
                                {
                                    "level": 3,
                                    "comment": "Rave cave also could've done better, there was too much on the outside and very little area to actually \"rave\" in.",
                                    "score": 2,
                                    "author": "Killin4ssault12"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait where’s the boss?",
                    "score": 4,
                    "author": "thegunner137",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Highwire and his cronies.",
                            "score": 0,
                            "author": "LilRedChefInTheHood"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What rank are you at? In Gold 1/2 people always camp for the vault. At least 3-4 every match.\n\nAlso: If there would be every floor available to explore, it would be impossible to find someone / super easy to escape. Fortnite can't have too many layers for that reason. Gameplay wouldn't benefit from it.",
                    "score": 10,
                    "author": "FabianDR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are right at its current size. I would cut it in half size wise and shrink a few buildings a floor or 6 and then have them all accessible. With stairs and grind rails and zip lines it would make fights great. All the different ways in and out.  Just my thought.",
                            "score": 3,
                            "author": "RPuts5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dislike it because it's absolutely obnoxious to fight there.  Buildings that you inexplicably cannot cut through, grind rails everywhere for people to escape or ambush you, tons of ziplines everywhere, and it's just way too big.  Something like tilted was reasonable, mega city just has too much crazy stuff going on.",
            "score": 253,
            "author": "Trapped_In_Utah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if it is big, its quantity that it is prioritizing over quantity. 6 buildings with 2 floors each to explore? Very \"Mega\" indeed. Make maybe 3 or even 2 buildings, but design their interiors for christ's sake, or just make like 5-10 floors with good interiors.\n\nTo this very day tilted towers is still loved by the community despite not having a shit ton of floors. Why? Because epic used to have a little dose of fun and creativity.",
                    "score": 57,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or they could’ve done more buildings, and just opted for no interiors to them. Have just one main building, the one with the statue on top, with all accessible floors and full verticality to it. Maybe one or two building next to it with the base floor.\n\nImagine all the shootouts and mayhem within that building! I used to love landing at sweaty sands because it had a multilevel apartment building. It was a simple building, but it had like five floors and hearing peoples footsteps thundering up and down the stairs was such a rush!\n\nZiplining up through the buildings makes them feel so hollow.",
                            "score": 29,
                            "author": "Leonydas13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;It was a simple building, but it had like five floors and hearing peoples footsteps thundering up and down the stairs was such a rush!\n\nThis right here. This is exactly what I meant with the \"just add 5-10 floors\". Its quality over quantity we should be thinking of.",
                                    "score": 16,
                                    "author": "Killin4ssault12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "IIRC Daily Bugle and No Sweat had complicated interiors. (and weren't oddly indestructible)  \nSure those were single buildings compared to a city with a dozen buildings, but it feels like that effort being spread over that larger area left it feeling half finished.",
                                            "score": 15,
                                            "author": "zdakat"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "One thing I liked about PUBG is that all the buildings had fully realized floor designs, no matter how tall they were. Of course, you get a lot of camping.",
                            "score": 1,
                            "author": "soup2nuts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mega city is way too empty",
            "score": 311,
            "author": "Night_Tac",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my games, a solid 10-15 people land there and it feels so empty even with 10% of the lobby centered around there. OG tilted was always super contested and the same with Neo Tilted. On console your frames drop to 30-45 fps the second you land there too so this whole POI is plagued with a bunch of problems",
                    "score": 43,
                    "author": "Icy_Pack_6170",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; on console your frames drop to 30-45 FPS\n\nThis is my biggest problem with Chapter 4. Epic has focused more on visual spectacle than gameplay performance. Even on PC, I used to run Fortnite at 120FPS in Chapter 2 and 3, had to cap at 60 for Chapter 4 with all the new visual bloatware Epic added.",
                            "score": 21,
                            "author": "Sonicfan42069666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My laptop used to play it fine and now I gotta turn 3d to 80% for it to hit 45",
                                    "score": 5,
                                    "author": "UnstoppablePhoenix"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "OG Tilted is where I’d go to practice before properly playing for the night",
                            "score": 7,
                            "author": "AlbionEnthusiast"
                        },
                        {
                            "level": 2,
                            "comment": "OG Tilted was always the spot to drop if you were looking for a fight. Only the good ones (or lucky ones) make it out alive with great loot. Well… unless you land and bail to a new POI.",
                            "score": 1,
                            "author": "kingshadow75"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it’s giving 2020 city life",
                    "score": 86,
                    "author": "bbk8z"
                },
                {
                    "level": 1,
                    "comment": "There are more chests at racetrack than megacity",
                    "score": 14,
                    "author": "sub-hunter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "me when i lie:",
                            "score": 1,
                            "author": "AvianAscent"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Feels like it wasn’t used to it full potential.",
                    "score": 7,
                    "author": "Spear_speaks007"
                },
                {
                    "level": 1,
                    "comment": "Thats my issue with it. And for a city it feels so... tiny.",
                    "score": 2,
                    "author": "theeley"
                },
                {
                    "level": 1,
                    "comment": "![gif](giphy|26FLgGTPUDH6UGAbm)",
                    "score": -6,
                    "author": "redditavies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "See, this is the exact reason why I *love* Mega City.\n\nIt’s a great location gameplay wise at any point in the game. If you land there right off the bat, very few people will usually join you, despite the massive amount of loot there. There’s plenty of mobility in the area too, so moving around is easy.\n\nLate game? Mega is such a big, twisty and vertical location that you can hide from people in a virtually indestructible room and they’ll never find you. I’ve won multiple fights by giving people the run-around with doors, ascenders and grind rails and just shooting them while they’re bamboozled.\n\nAs for the design of Mega City vs Neo Tilted…I consider them about the same. Neo Tilted had more futuristic things, like the blimps, and holograms. But Mega City fits the “Neo” theme a bit more due to how densely packed and massive it is.",
            "score": 17,
            "author": "Dexchampion99"
        },
        {
            "level": 0,
            "comment": "i think it was a doomed idea from the start, which is a shame since it's also such a freaking awesome idea. if you try to furnish every building fully, the game will probably lag to death, and there will be so much space to hide that the city will be pretty much empty. but if you only leave part of the buildings accessible, people complain about the lack of areas to explore and it not being lively enough. it's just a lose-lose situation to create such a big and detailed POI on a game meant to be able to be played on a variety of platforms and with varying quality of internet connection. i applaud epic for trying, and they definitely did a solid job all things considered, but such a big POI just isn't meant for a game like this in the first place.",
            "score": 15,
            "author": "CYBORG3005"
        },
        {
            "level": 0,
            "comment": "I wish we could breakdown the buildings and that more floors were available. Imagine a 50-floor story building full of loot that can be knocked down.",
            "score": 76,
            "author": "DarthBen_in_Chicago",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even I thought we could do that, which is what hyped me up, but the ground floors being the only accessible ones drained out any good feelings I had.",
                    "score": 23,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems like there's basically 2 zones: Rooftops, and ground, with noting in between.",
                            "score": 9,
                            "author": "zdakat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Technical limitation is probably the most likely reason it is the way it is",
                    "score": 21,
                    "author": "SELECTaerial"
                },
                {
                    "level": 1,
                    "comment": "Breakable and collapsible buildings would have been awesome",
                    "score": 3,
                    "author": "Joshhwwaaaaaa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ideally, yes. In actuality, Mega City as of now would drop your frames, and having like five to six 50-floor collapsible buildings, would also make your GPU collapse.",
                            "score": 4,
                            "author": "seattlesound1004"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i hate the fake buildings and the fact that it's always dark and rainy there",
            "score": 28,
            "author": "KcHecKa"
        },
        {
            "level": 0,
            "comment": "Gotta agree. It’s pretty boring. After the first couple of days, I got pretty damn tired of getting sniped from the rooftops.",
            "score": 55,
            "author": "Tandril91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Conversely, I’m getting tired of sniping people from the rooftops.",
                    "score": 18,
                    "author": "Leonydas13"
                },
                {
                    "level": 1,
                    "comment": "It’s really painful lol",
                    "score": 6,
                    "author": "Spear_speaks007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing mega about it really, on one side the buildings only exist by the river without any buildings to break up the transition to a mountain",
            "score": 24,
            "author": "LongAndShortOfIt888",
            "replies": [
                {
                    "level": 1,
                    "comment": "mega lag for us switch players",
                    "score": 11,
                    "author": "jeanprox876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even on ps5 the performers is really bad",
                            "score": 4,
                            "author": "JaySTAR"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It does have one mega thing… mega frame drops",
                    "score": 5,
                    "author": "Charlie02134"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the point in a giant tower if it's only going to have 2 or 3 floors?",
            "score": 24,
            "author": "bruh1092",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes sense. Imaging being like 7 floors up of a 15 floor building with all floors available and getting the footstep visual audio. What a nightmare that would be. A few floors here and there seems to fit the flow of a 15 minute game where that section of the map may only last a couple minutes anyway before storm rolls in.",
                    "score": 3,
                    "author": "Skywalker3221"
                },
                {
                    "level": 1,
                    "comment": "Aesthetics. They don't want a building with 50 floors anyway",
                    "score": 5,
                    "author": "Joshua2560Plays"
                },
                {
                    "level": 1,
                    "comment": "My point exactly",
                    "score": 2,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I enjoy it, very rarely do I find it empty. \n\nI am annoyed at the inability to destroy it though. I was sooooo hoping to flatten it with tank like tilted and the daily bugle :-)",
            "score": 13,
            "author": "madredr1"
        },
        {
            "level": 0,
            "comment": "I think the really problem is that the buildings have practically no interior to them, its a boring glorified set piece with nothing particularly interesting about it beyond the aesthetics",
            "score": 4,
            "author": "Mobster-503"
        },
        {
            "level": 0,
            "comment": "I love it because no one ever lands there. Easy loot.",
            "score": 11,
            "author": "Hobbitberry"
        },
        {
            "level": 0,
            "comment": "i’ve always felt like this place was very underwhelming, but the way i try to make sense of it from a game design perspective is that it’s intentionally meant to be an unconventional poi. it’s almost like a stronghold/win condition location. devs seemingly went out of their way to make the biggest poi imaginable with less loot than you’d expect, indestructible buildings, zip lines and rails to allow alpha team to apply pressure quickly, the vault, center map, and so on.\n\nmy main rationale behind this theory: i hate hot dropping mega city cuz it’s mostly ratting to avoid off spawn 3rd parties or vault campers, but in a mega city endgame however, rotating early and griefing from height is the most free dub almost every time.\n\nstill not a fan though lmao",
            "score": 3,
            "author": "Suspicious-Ninja-387"
        },
        {
            "level": 0,
            "comment": "Lack of floors make it shite",
            "score": 3,
            "author": "ThisIsNotTokyo"
        },
        {
            "level": 0,
            "comment": "If it was destructible it'd be popular.  Like the old daily bugle.  Miss that drop.",
            "score": 3,
            "author": "MojyaMan"
        },
        {
            "level": 0,
            "comment": "Fortnite slowly adding more and more unbreakable buildings is sort of the antithesis of one of its core tenants, being that you could break anything you want. I don't care if you're too lazy to design 10 floors of a building so you add Ascenders but you need an indestructible post to put an Ascender on it. Either design the 15 floors so you can break the whole thing down, or don't make the buildings that fucking tall 🤷🏿‍♀️",
            "score": 3,
            "author": "Marleyzard"
        },
        {
            "level": 0,
            "comment": "I'm genuinely surprised to read this, because I remember people (especially on here) talking about how lame Neo Tilted was compared to the original. Also, wasn't it a dead drop pretty quickly into the season? I could be biased since I wasn't a fan myself, but I swear I remember it being panned.\n\nMega City could be better, it's just way too big.",
            "score": 12,
            "author": "jaqenjayz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sorry, what? Neo tilted was an amazing drop spot! This community has the worst takes",
                    "score": 5,
                    "author": "naska84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't recall enjoying it very much tbh! What made you like it so much?",
                            "score": 3,
                            "author": "jaqenjayz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loved the slipstreams and some of the buildings were my favorite drop spots because of the surplus of floor loot and things. In the “One Shot” game mode, me and my best friend got so many wins landing there!",
                                    "score": 5,
                                    "author": "naska84",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ooh I completely forgot about One Shot LTM! That was pretty fun!",
                                            "score": 2,
                                            "author": "jaqenjayz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Chapter 1 One shot was immaculate imo. Got so many nice shots in the game mode",
                                                    "score": 3,
                                                    "author": "naska84"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For me personally? (even though you weren't asking me) it was the life and colourful vibe the whole place seemed to emit, with the transportation, the basketball court, the hoverboards and just the overall feeling it gave me was like no other.  \n\n\nMaybe I miss it too much lmao :\")",
                                    "score": 3,
                                    "author": "Killin4ssault12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "same here. i think the nostalgia is getting to us a bit. at the end of the day, neo tilted was special because of its extreme hot drop status giving it life. mega city just doesn't draw players the same for whatever reason, so it feels empty and lifeless. i honestly think that's the root cause of the issue here. although, considering the cyberpunk-ish nature of the POI, maybe that was epic's intention.",
                                            "score": 3,
                                            "author": "CYBORG3005"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm surprised too that people didn't like it man, I'd love to go back there !",
                            "score": 3,
                            "author": "Killin4ssault12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably just bias, but i’d love to go back to Wailing woods. Neo tilted and tilted town are in my top 10 though",
                                    "score": 3,
                                    "author": "naska84"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, to each their own.",
                    "score": 2,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry, didn't mean it as a dig at you. It's just not something I've seen said anywhere.",
                            "score": 3,
                            "author": "jaqenjayz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even if you did, I wouldn't have minded it, it's the beauty of arguments and discussions anyways :)",
                                    "score": 3,
                                    "author": "Killin4ssault12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you think part of the issue is that the buildings themselves don't seem very futuristic? The interior of all the Mega City buildings is pretty standard (besides the sushi spot which is neat). I don't wanna get slapped in the face with neon lights everywhere but I think they copy-pasted a little too much with the buildings and made them bland.",
                                            "score": 4,
                                            "author": "jaqenjayz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The exterior does look okay but only for the first couple of floors. Then it feels like they want to shut you out for the rest what, 30-40 floors? I haven't counted but it does feel off.   \n\n\nI mean, if y'all have an issue with designing a lot of interiors, then no issue, maybe make a 5-10 storey building, but design a nice interior for each floor.  \nIts quality over quantity.",
                                                    "score": 2,
                                                    "author": "Killin4ssault12"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly prefer it over Neo Tilted because of the verticality and the livelier vibe what with the various music and ads that play but that's just me.",
            "score": 7,
            "author": "BebeFanMasterJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "I respect your opinion but I find Neo Tilted livelier.",
                    "score": 1,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It as such a waste. We didn’t even get a kaiju event",
            "score": 4,
            "author": "AlbionEnthusiast"
        },
        {
            "level": 0,
            "comment": "If the simply just made the elevator shaft unbreakable, the 4th-6th floor a blank area, and the top 1 floor/roof filled with loot, then it would have been nice and we could have cow catchers.\n\neven neo tilted had more than mega. mega barely has anything and tries to use the aesthetics more than function and looks.",
            "score": 2,
            "author": "Cularia"
        },
        {
            "level": 0,
            "comment": "I like it personally, it’s my squad’s favourite landing spot",
            "score": 2,
            "author": "aguy1221"
        },
        {
            "level": 0,
            "comment": "I like it honestly, hate POI where everyone lands, just a huge mess to avoid, it's nice to end up in mega city and have to fight through buildings that you can't break or cut through",
            "score": 2,
            "author": "Alarmed_Recording742"
        },
        {
            "level": 0,
            "comment": "I've found it to be a snipers paradise. Those high ass towers give you visibility for miles surrounding the city. People zip up to surprise you, easy prey. People landed here for quests only, or to get a bike. Dont grind rails, your movement is way too easy to track and headshot with that heavy.",
            "score": 2,
            "author": "DisastrousSchool8033"
        },
        {
            "level": 0,
            "comment": "I think with its size it woulda been the best if it had actual buildings like neo tilted and titled towers instead of just frames with 1 or 2 real floors",
            "score": 2,
            "author": "hertwij"
        },
        {
            "level": 0,
            "comment": "I think the problem with mega is it’s just too big to fight in, too many buildings to and rooftops to have a decent fight in, too little open space.",
            "score": 2,
            "author": "alaincastro"
        },
        {
            "level": 0,
            "comment": "Miss a grind rail, fall to my death.\n\nMiss the zipline, fall to my death.\n\nStep too close to the edge, fall to my death.\n\n\nAnd tonight, I discovered you can get caught in the updraft on the mechadragon building  while dropping in off the battle bus and just hang in air with your glider for however long you want.\n\nI really hope it gets leveled with the next update.",
            "score": 2,
            "author": "nerdycatt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly falling often from these is 110% a skill issue. You are also protected from fall damage coming off the rail and zip.\n\nSo like, unless you just jump at them randomly without looking?\n\nEdit: dragon things is hilarious though.",
                    "score": 14,
                    "author": "Icy-Fig7331",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well shit, here I thought I sucked because my gaming chair. 😅\n\n(I play too causally to have any skill.)",
                            "score": 1,
                            "author": "nerdycatt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh the mechadragon?After the first day I forgot it was even there lmao, they put so much work into designing it just for it to be inaccessible.\n\nAfter seeing all this, I'm still wondering how epic could mess up THIS bad.  \nEven I hoped stuff would get better with updates but if epic really wanted to fix anything they would've done it from the very start.",
                    "score": 1,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol epic can’t make up for someone jumping over the rail to their death 😂 I love how that’s a HORRIBLE mess up…. Like you can fall from any high up location and die if you just jump without a plan",
                            "score": 2,
                            "author": "j-peachy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easily the worst POI",
            "score": 2,
            "author": "zackrulez01",
            "replies": [
                {
                    "level": 1,
                    "comment": "citadel is a close second",
                    "score": 6,
                    "author": "Wild_Plant9526",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Citadel was fr a dope spot back in c4s1 when the Infinity Blade guy was walking around &amp; it was full of oathbound chests. I agree it sucks now though",
                            "score": 11,
                            "author": "Educational_Book_225",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was briefly okay again with grind rails \n\nAnvil and  the bowling alley we some of the best pois \nAnd they are gone",
                                    "score": 2,
                                    "author": "sub-hunter"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I will only go to  Citadel if it's final zone and it is only at those times I realise it still exists, I have erased it from my mental map entirely",
                            "score": 2,
                            "author": "youthchaos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lmfao same. i wish they could've added something in place of the boss. Like maybe have it crumble down and make it a new poi or something. Or add more loot in return for his absence.",
                                    "score": 3,
                                    "author": "Wild_Plant9526"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aside from quests/challenges, I avoided that area like the plague.  And I’m actually wanting to avoid the jungle too.",
            "score": 2,
            "author": "SpadesOfDarkness"
        },
        {
            "level": 0,
            "comment": "Neo Tilted is superior even while being half the size of Mega City, heck even Mega Mall was better than Mega City",
            "score": 2,
            "author": "UnironicallyMe37",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know right, and so many people here don't even like Neo Tilted which is what surprises me the most, the vibe was like no other.",
                    "score": 0,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same vibe as the apartments in c3 s4. Here’s food for though: epic wanted to try something new instead of remaking something they already did which people would also complain about.",
                            "score": 2,
                            "author": "j-peachy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they add floors to mega city your game will lag so much because it will try to load in the floors and chances are your game will crash.",
            "score": 2,
            "author": "weapondaily",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I fail to see how that would be the case ngl",
                    "score": 2,
                    "author": "CactusFucker420"
                },
                {
                    "level": 1,
                    "comment": "Then make the buildings a lot smaller with 5-10 floors or less buildings, its quality over quantity.",
                    "score": 0,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|EVbEdEW3kuu0o)\n\n**I just disagree**",
            "score": 1,
            "author": "Icy-Fig7331",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd like to hear why!",
                    "score": 1,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disagree that it’s bad. And I disagree that nobody lands there. \n\nI regularly land there and have to wipe 3-5 people to secure the POI. Then I take the vault and get shot at the whole way out (even staging my escape car) as I just barely stay in front of the storm. \n\nIt’s a rush. A heist every-time. \n\nRegarding the city itself, there is loot everywhere, an upgrade station, and plenty of gold. Plus multiple mobility options on the ground for rotations (trampoline at docks, jumping from rails, cars, bikes). And then rails and vents for fast movement. \n\n—-\n\nRegarding the vibe, it’s spooki. I love it. It feels like a city that was transported without its people a few seconds before a disaster. And lore wise, it essentially was; the city and waring factions were transported to save them from a war. It’s well executed per the lore.\n\n**I truly believe a lot of the hate is motivated by subconscious reactions of terror to the prospect of an empty city. It’s disturbing**\n\nIt’s just being coded as complaints about the map. Tbh aside from the buildings not busting apart to prevent obvious scenes and imagery, I just don’t see what everyone hates.",
                            "score": 8,
                            "author": "Icy-Fig7331",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, Mega City isn't really as \"empty\" as people say it is.  Even today I found a little area of one of the buildings I had never seen before despite looting the POI dozens of times last season.  It is pretty deserted this season though, but that's just due to the new season and most players preferring to explore the new areas.",
                                    "score": 3,
                                    "author": "Effective-Interest28"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i fully agree it's horrible, most of the time i only visit it in the middle of a match and even then it's a ghost city filled with loot.",
            "score": 1,
            "author": "AttorneyNo5646"
        },
        {
            "level": 0,
            "comment": "Popular opinion",
            "score": 1,
            "author": "Mysterious_Test7688"
        },
        {
            "level": 0,
            "comment": "it’s not colorful nor empty, it’s too big so nobody goes there. it’s 10 times better than neo tilted in visuals but the vibe ruins it.",
            "score": 1,
            "author": "jeanprox876",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still feel like Neo Tilted looked better, it had all sorts of colour combos (which were majorly light colours) but Mega City is just filled with these big, black coloured inaccessible buildings.",
                    "score": 1,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never landed there once, only rotated through when I have too.",
            "score": 1,
            "author": "vexxw"
        },
        {
            "level": 0,
            "comment": "You guys are all crazy. It’s like top 5 locations ever.",
            "score": 1,
            "author": "JjGuyy0",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you ignore every other location maybe",
                    "score": 2,
                    "author": "FloatinPineapple"
                },
                {
                    "level": 1,
                    "comment": "I agree",
                    "score": 1,
                    "author": "BlackUchiha03"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmfaoo the fact that everyone is saying that Mega City is boring hasn’t even landed there and got killed off spawn. \n\nI’ve seen and have witnessed so many people land at Mega City and kill players off spawn. \n\nPeople will literally try to third party players who kill the Highcard boss to get legendary and mythic weapons and slurps and you mean to tell me that Mega City is boring??? \n\nIt’s clear that you haven’t landed there that often and it shows. This is coming from a person who got killed multiple times off spawn in Mega City.",
            "score": 0,
            "author": "YBLXIS",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did land there, sometimes got killed off spawn and sometimes cleared it up, stayed there till highcard walks in and looted the vault and run off, which can be fun but eventually gets boring after the first few runs. \n\nAnd honestly just aside from maybe 1 or 2 sweats who come in to take down highcard I don't see any insanely high third partying.",
                    "score": 1,
                    "author": "Killin4ssault12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because you haven’t gotten third parties before. The vault and loot Island is literally sought after and on both times I’ve been third partied on multiple instances and 9/10 I get killed. Saying that Mega City is boring is literally saying that unicorns are real but even though unicorns are not real and are pretty overrated, Mega City is the complete opposite of that and despite me getting killed multiple times I genuinely enjoy the Cyber Neo Japan Aesthetic plus the anime references with Imani and AOT as well as samurai and Japanese based characters. I’m still playing as Imani and Crossheart till this day, but I digress",
                            "score": 1,
                            "author": "YBLXIS"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah it’s an annoying spot. Too many levels &amp; rails..",
            "score": 1,
            "author": "Tomkid88"
        },
        {
            "level": 0,
            "comment": "I feel like in previous seasons poi's would get some sort of changes but Mega doesn't seem to get any new changes over time. I do like the place but having seen other poi's get improvements leaves me to think Megacity gets neglected.",
            "score": 1,
            "author": "Bluetreeheli"
        },
        {
            "level": 0,
            "comment": "Thought it was an ass spot last chapter, still do. I honestly thought it wasn't even there anymore or revamped completely because nobody dropped there in like 20 games lol.",
            "score": 1,
            "author": "TheUglyCasanova"
        },
        {
            "level": 0,
            "comment": "Yeah, the city Is pretty good in the beginning, but It has got pretty annoying, i wanted the volcano ti destroy It, but It didn't appear, so i'm a bit dissappointed and the map didn't have many changes",
            "score": 1,
            "author": "Then-Cauliflower3378"
        },
        {
            "level": 0,
            "comment": "Tbh I did like the neo era",
            "score": 1,
            "author": "Em0kit"
        },
        {
            "level": 0,
            "comment": "I never went there if there wasn't a quest simply because it lagged my game down from 144 to 60fps.",
            "score": 1,
            "author": "QuadVox"
        },
        {
            "level": 0,
            "comment": "I like it but it really could be sooo much better.  Even when other players are there good luck finding them.",
            "score": 1,
            "author": "banjoface123"
        },
        {
            "level": 0,
            "comment": "Mega City is shit, as is the new forest area.\n\nDo these people not test their games first...?",
            "score": 1,
            "author": "Ko_ogs72"
        },
        {
            "level": 0,
            "comment": "i don’t call it “mega-shitty” for nothing",
            "score": 1,
            "author": "thanoswife"
        },
        {
            "level": 0,
            "comment": "It would of been cool if the jungle biome had spread through it and wrecked some of the buildings. Could of had the vines going through the buildings",
            "score": 1,
            "author": "Elrickooo",
            "replies": [
                {
                    "level": 1,
                    "comment": "have",
                    "score": 0,
                    "author": "christophlieber"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If Epic wants players to go to Mega City, they should put a boss there (permanently) and add a few other features that makes players want to occupy the city. But it doesn't seemed like even Epic gives a damn about it, same thing with Citadel.",
            "score": 1,
            "author": "mad_titanz"
        },
        {
            "level": 0,
            "comment": "Its cool for stressfull endgames if the circle goes there\n\nThe vault helps too but otherwise i never go there is just too dangerous",
            "score": 1,
            "author": "throwaway-ldr-"
        },
        {
            "level": 0,
            "comment": "Mega city is one of the worst POIs of the season, followed up by citadel. \n\nBoth points suffer because they have disconnected verticality. Verticality is great and increases the skill gap, but when it is disconnected it does not play nice. \n\nThis season had to rely on movement items to make up for the poor map design.",
            "score": 1,
            "author": "CanadianTurkey"
        },
        {
            "level": 0,
            "comment": "Everywhere I land feels empty, and the map is smaller I don't understand it.",
            "score": 1,
            "author": "YoungBlueJ"
        },
        {
            "level": 0,
            "comment": "It’s empty yet it’s one of my favorite POI. I only wish people actually went there more instead of the typical Slappy Shores and Frenzy Farm or some random gas station. I don’t get the hype for those locations other than thinking some wannabe pro players watched some streaming channel and are trying to emulate them",
            "score": 1,
            "author": "waitmyhonor"
        },
        {
            "level": 0,
            "comment": "I don't like the area because I think it's too big and hard to fight in it.",
            "score": 1,
            "author": "CN122"
        },
        {
            "level": 0,
            "comment": "I must be in the minority, but I like it. I enjoy the high ground and the ability to find areas to snipe from. There’s tons of loot and every drop isn’t insanely hot like some other POIs. Plus the boss loot. Solid POI IMO.",
            "score": 1,
            "author": "Peter_Yanker"
        },
        {
            "level": 0,
            "comment": "I don't land there because I get 50-80fps around it or if I look at it 😔",
            "score": 1,
            "author": "No_Championship6401"
        },
        {
            "level": 0,
            "comment": "Endgames there are the worst. Just people camping on top of buildings",
            "score": 1,
            "author": "spookystrawberry2"
        },
        {
            "level": 0,
            "comment": "Mega City is unwashed ass. Always has been. I thought for sure it would come out this season change.",
            "score": 1,
            "author": "SockFullOfNickles"
        },
        {
            "level": 0,
            "comment": "They need to add more incentives to go there. Personally, I love it! But it can be totally boring when it’s always like an abandoned city. Would be way more fun if there was a proper boss there (not that week ass group of cards). But really that’s true for the whole game. We need better bosses that drop more rare loot. By more rare I mean, it’s too easy to get rare loot all over. There should be less of it and y should have to fight for it more. \n\nI’m not sure what other incentives could be, but for sure as it is… there’s not enough reasons to go there. Would be a great zone wars map though. Do they have that in creative. If it was busy and bumping with people it could be super fun!",
            "score": 1,
            "author": "bettiep3838"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also it’s clear epic is wanting to give alittle more structure and cover for zero-build mode. The jungle is almost the same in concept that there are tons of places to hide and seek shelter during a fight. People don’t like it because there are some of us who use the walls and confusion to our advantage 🤷🏼‍♂️",
                    "score": 1,
                    "author": "j-peachy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a pain fighting there and never memorable",
            "score": 1,
            "author": "Sir-Greggor-III"
        },
        {
            "level": 0,
            "comment": "The huge buildings feel meaningless, i much prefer the “smaller” buildings that are completely playable on the inside",
            "score": 1,
            "author": "Infernal_139"
        },
        {
            "level": 0,
            "comment": "I like it overall, it could use some npc’s , quest hub or something to that effect.",
            "score": 1,
            "author": "Few_Tough6044"
        },
        {
            "level": 0,
            "comment": "My friends and I never go there because it's entirely too easy to get separated from each other",
            "score": 1,
            "author": "buttstuffbuffmuff"
        },
        {
            "level": 0,
            "comment": "I don’t like how my frames drop significantly in this place. On Xbox I drop form 60 to around 40 fps and on switch it’s around 15 fps. I avoid this place because as you said most of it isn’t lootable. It looks like a really cool poi but once you start exploring it kinda isn’t.",
            "score": 1,
            "author": "ConsequenceApart4391"
        },
        {
            "level": 0,
            "comment": "I call it mega shitty for a reason the figth in there matter nothing cause running away its too easy and whats more problematic for me specific its thw grindrail and all the effects make it turn in a power point presentation on my switch",
            "score": 1,
            "author": "marco-boi"
        },
        {
            "level": 0,
            "comment": "The buildings are like 50 stories tall with 3 accessible floors of loot. What could’ve been the coolest POI ever was instead a huge let down. I love rotating there from Steamy to get high card though.",
            "score": 1,
            "author": "rodermelon"
        },
        {
            "level": 0,
            "comment": "Fighting around giant fancy looking cement blocks definitely isn't as fun as fighting in and out of buildings.",
            "score": 1,
            "author": "zoroddesign"
        },
        {
            "level": 0,
            "comment": "Much prefered the daily bugal that served almost the exact same purpose",
            "score": 1,
            "author": "Wingedwolf111"
        },
        {
            "level": 0,
            "comment": "Yeah the only argument you need is \"no one lands there\"",
            "score": 1,
            "author": "BryNYC"
        },
        {
            "level": 0,
            "comment": "You're so wrong about mega city. I honestly think it's my favorite POI aside from the glory days of tilted, as well as when tilted had blimps. Mega City has a dope theme, tons of buildings to loot, actually feels like a big city, and now with the jungle stuff, less people land there so it is even easier to stack up on a ton of loot having super low risk. I honestly think mega city is underrated, but it's nice that way so I don't mind.",
            "score": 1,
            "author": "MonsterMerge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, I do respect your opinion but I gotta disagree.\n\nThose \"tons\" of buildings include the ground floors of 9 buildings, and honestly it doesn't feel like a big city, feels more like a network of grind rails with platforms provided, I get that adding floors would've been a technical difficulty, but why didn't they do what they did in the past with OG Tilted, Neo Tilted, Sweaty Sands and Lazy Lake? Those locations had few floors but cool interiors. \n\nIf anything is underrated, I would say Neo Tilted is. So many people hate on it for no apparent reason but I haven't seen a SINGLE person on here come out and say that Mega City is bad which is why I felt the need to.",
                    "score": 1,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do you guys think epic decided not to make mega city destructible? Serious question.",
            "score": 1,
            "author": "bloolynxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "As other people said, technical difficulties.\n\nMost refer to severe frame drops they encounter even when there is minimal destruction to be done. \n\nNow imagine the state with destructible buildings. \n\nAll the more reason why they should've just designed a bunch of smaller buildings with few floors and nice interiors.",
                    "score": 1,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s too dark, I even feel that way about the jungle area",
            "score": 1,
            "author": "Meryl_Streep69"
        },
        {
            "level": 0,
            "comment": "I never go there unless a quest or the circle makes me.",
            "score": 1,
            "author": "The_Fortunate_Fool"
        },
        {
            "level": 0,
            "comment": "I never had much issue with it, just didnt have a good enough hook to attract players. The vault was meh. Like Slabs is crappy location but people flocked to it for the easy to get to ODM boxes and it's vault was better solely because the floors were destroyable for quick looting",
            "score": 1,
            "author": "KawaiianxPunch"
        },
        {
            "level": 0,
            "comment": "ive only landed at mega city a couple times. the few times i did, i got some solid gear, highcard and the vault had some good stuff, and vehicles for when i need to haul ass. and occassionally a scrap to start my day.  usually if im solo, ill pick a random place and land there. my mates prefer to land at the hotspots, like the farm, the quarry, the slap factory, mostly because theyre actively looking for a fight. honestly, i might make mega city my regular landing, considering the number of people landing there. \n\nsidenote: i tend to play unranked zero build, if that matters.",
            "score": 1,
            "author": "FireInHisBlood"
        },
        {
            "level": 0,
            "comment": "Mega city can totally handle fully furnished insides at that size, however if epic decided to make an actual large scale city that isn't just 9 towers (which I pray one day can actually happen), then the missing middles can be justified.\n\nLast season was incredible, but Mega City was a letdown for me because it's just too small.",
            "score": 1,
            "author": "Apart-Step",
            "replies": [
                {
                    "level": 1,
                    "comment": "Something I've learnt after making this post is, it's not that Mega City can't handle it, but can your device handle it? \n\nEven now with no interior it causes frame drops,  all the more reason why they should've just made few buildings with few floors.",
                    "score": 2,
                    "author": "Killin4ssault12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wish it took more from Neo-Tilted. Grind rails WITH slipstream would have been amazing.",
            "score": 1,
            "author": "HollowInsomnia"
        },
        {
            "level": 0,
            "comment": "In ranked (zero build duos), it's the best spot to land, I think.\n\nMAYBE you have 3 teams landing there so you basically get the entire place to yourself.\n\nGet fully kitted, maybe grab the vault for the slurps (the Pancake Gun in No build still can't compete with the Red Dot, IMO -- beast in build mode, however), get a car and start rotating into the zone!\n\nSIDE NOTE: Given that there are no swords, ODM or Spidey's, is it possible to get on top of the middle building to glide away anymore (the Building where the Dragon sits on top)? If yes, how do you do it!?",
            "score": 1,
            "author": "WestmontOG07"
        },
        {
            "level": 0,
            "comment": "I agree totally, but when I am in a match and do not feel like fighting, it is a perfect place to camp...",
            "score": 0,
            "author": "TheJonnieP"
        },
        {
            "level": 0,
            "comment": "Finally someone who agrees, the buildings are mostly hollow, it's not even that large for something called \"mega city\" it only has height",
            "score": 0,
            "author": "randomer_guy_person"
        }
    ]
}