{
    "id": "147gllx",
    "score": 72,
    "title": "To all the people dying to storm I'm going to tell you a little trick",
    "author": "Night_Tac",
    "date": 1686550269.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/147gllx",
    "media_urls": [],
    "other_urls": [],
    "postText": "When you see the first circle come up, ping it. See how far you should run, if its anything higher then 500 rotate before the process begins closing. Because (not sprinting) it will take you 166 seconds to travel that distance on foot. Always check how much damage the storm will do (its on the map) and what circle is coming back. If I remember correctly moving circles start at 5th zone with half and half and the next circles fully move. \n\nWe live without mobility in Chapter 1 and Chapter 2, we can live without it now. Instead of fighting rotate early and get a good spot. Also if your team isn't rotating, ping where you want to go on the map and leave them. You will die way more storm fighting and there's no siphon in game to bail you out. Good luck on the battle bus.",
    "comments": [
        {
            "level": 0,
            "comment": "The game has always been about risk vs reward.  Drop some place on the edge of the island?  Loot away, but be mindful that you've got 1-2 minutes, tops, to loot before you need to get going.  Give yourself 1 minute each circle thereafter to loot in your new locale and keep going.\n\nWhenever you stop to loot, have a storm escape plan.",
            "score": 12,
            "author": "vandilx",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The game has always been about risk vs reward\n\nSo many people dont understand it and shows, especially when it comes to balancing",
                    "score": 11,
                    "author": "Night_Tac"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for posting this. I think people got way too reliant on mobility items and stopped valuing basic awareness. All they need to do is read posts like yours, adapt, and they'll be fine. Plus, imo the storm is really forgiving for the first four phases and getting caught in it isn't that big of a deal as long as you can either stay out of fights or end them quickly.",
            "score": 34,
            "author": "jaqenjayz",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who started playing at the start of chapter 1 season 3 I can tell you the people complaining about having no mobility now should have seen what it was like back in the day. \n\nWe've still got better mantling, boars &amp; wolves, sliding, vehicles and bounce pads laying around the map. We used to have none of that. \n\nPeople need to learn how to play the storm and use it to their advantage. One of my oldest tactics w/ fortnite has been to land on the outskirts of the map and ride the storm in as it closes. It cuts off a good portion of map I can be attacked from and I'm always on the lookout to move in. Can get top 15 quite consistently if not top 5",
                    "score": 10,
                    "author": "indecisiveusername2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post. Hopefully helps people. \n\nPersonally I don't miss the mobility. Time after time I got into decent positions last season, got the drop on people only to end up having a 10 minute chase sequence that culminates in getting 3rd partied 700m away from where I got the drop on someone. \n\nWith no mobility it's much harder to do that and as a result teams are getting punished for making poor decisions in games.",
            "score": 7,
            "author": "madcow87_"
        },
        {
            "level": 0,
            "comment": "Also before you say we need mobility in fights, there are ways to fight without heavy mobility. 3 Rules I follow\n\n, dont push in alone,\n\n if you get surprised don't just start running without a plan, that increases your stress and heart rate not allowing you to focus. Your goal is to quickly think what happened, what can I do, and what are they doing. They expect you to be scared, go on the defensive, but and I repeat do not just focus on running. Try for example to do a little bit of damage, this will stop over aggro playstyles\n\nand finally, if you know you cant kill them, dont push. I'm not saying to hide, but so many bad players I fight just walk up to my wall and start pickaxing trying to replace it, or just box. When I play zero build (once in every blue moon) I see players do the same thing, just run at you. Look at your opponent, if they are clearly good, and are in a good position to kill you. STOP AND TURN AWAY.",
            "score": 12,
            "author": "Night_Tac"
        },
        {
            "level": 0,
            "comment": "I love how not being able to instantly travel 500 meters through the sky is really making people actually think about their position while playing.\n\nIt's an added dimension to the game now that has flustered a lot of people.",
            "score": 11,
            "author": "Loha_Rune",
            "replies": [
                {
                    "level": 1,
                    "comment": "bro that’s always been the point of the game",
                    "score": -12,
                    "author": "Mysterious_Test7688",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bro what has always been a part of the game?",
                            "score": 3,
                            "author": "Loha_Rune",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“it’s an added dimension” going to the circle? that’s always been the point",
                                    "score": -8,
                                    "author": "Mysterious_Test7688",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting take considering I never mentioned the circle in my original comment:\n\n\"I love how not being able to instantly travel 500 meters through the sky is really making people actually think about their position while playing.\n\nIt's an added dimension to the game now that has flustered a lot of people.\"",
                                            "score": 4,
                                            "author": "Loha_Rune",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think while in 2017 and early 2018, the player base did not need mobility items, I think the 2023 player base and skill level and the way the game is played now needs some mobility items by choice. I think we need (some type) of mobility items. For people who can’t adapt to the fact that there is no web shooters or ODM gear, that just shows how many privelged players there are, however on the flip side of the coin i do think in 2023 and with this specific map we should have some mobility item options available. (I’m not doscounting the mobility that is already built into the map), because early to mid game there is no excuse, we got cars, geysers, mud, vines, rails, zip lines, launch pads, rifts, dinosaurs, augments, and the simple fact that we can sprint and slide (game used to have none of these). But again on the other side of the coin i think late game, with the way this map is shaped with all the cliffs, there should be something like a simple stack of shockwaves or shadow bombs.",
                                                    "score": -2,
                                                    "author": "Mysterious_Test7688",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I start playing last year and am adapting just fine.   Personally I feel it's a really great idea for Epic to continually change the mechanics of the game to make people adapt to the new reality on the island.   It's refreshing and it makes you completely rethink your strategies.",
                                                            "score": 3,
                                                            "author": "Loha_Rune"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somebody has died to the circle a few times. These calculations seem self tested.",
            "score": 2,
            "author": "FadedFigure"
        },
        {
            "level": 0,
            "comment": "wait, people are actually dying to the storm early on? \n\nthe only time i get it is if it's near final circle, the storm is doing max damage and you get zoned out by another player/group. any earlier than that is just... wow...",
            "score": 1,
            "author": "Asas621",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re dying to the storm before it’s doing 5 there’s something wrong. There’s plenty of heals and vehicles to make it any distance",
                    "score": 5,
                    "author": "chiefsfan_713_08"
                },
                {
                    "level": 1,
                    "comment": "Most games i've played end before the 6th.",
                    "score": 1,
                    "author": "Night_Tac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haven't had a chance to play this season but if this is true, jeeze...\n\nPeople be struggling hard without a plethora of mobility items, lmao.",
                            "score": 1,
                            "author": "Asas621"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not the first circle or second circle killing me. I’ve played fortnite since the very beginning and I don’t remember the late game circles moving this fast. Usually when the storm starts hitting for 5 it becomes slower and easier to outrun but lately when I try to rotate to the circle in ranked if I get in a single fight the circle will already be moving and even if I win the fight quickly I won’t be able to catch up with the circle. Back in the day I’d rotate and avoid the fight by building but in zero build with no movement you have to take the fight most the time and can never catch up. We always used to have shockwaves, bounce pads, launch pads, and seasonal items to move faster. So I get the argument to just rotate earlier but when the circles starts moving every 40 seconds and you have to take a fight, revive a teammate, and heal it becomes impossible for the winner of a fight to keep up with the circle.",
            "score": 1,
            "author": "Nagini824"
        },
        {
            "level": 0,
            "comment": "Thanks for the tip! Honestly, sometimes the storm even does the work for you. Easy dub! There have been AT LEAST 6 times where we’ve died by the storm and placed top 5 so we’re just a little better on that. Not complaining about taking out the mobility such as ODM and webs - animals and slaps are just fine - people can’t be scaredy cats when it comes to fighting now 😌",
            "score": 1,
            "author": "Global-Blackberry139"
        },
        {
            "level": 0,
            "comment": "👀 I just prefer to do my challenges in peace while in the storm. Like looting 25 chests in a named location is sooo much easier when the storm has passed mega city. I can literally complete it in one trial without having to fight anyone. Same thing goes for the challenge to destroy 250 items.",
            "score": 1,
            "author": "Aq_pA"
        },
        {
            "level": 0,
            "comment": "My method, every round is to mark the center  of the circle and always be moving towards it. Keep checking every minute or so and re mark the center because it changes. \n\nI never see the storm",
            "score": 1,
            "author": "DesignerAppeal1548"
        }
    ]
}