{
    "id": "148na1b",
    "score": 1253,
    "title": "Why can't we move after winning the game anymore?",
    "author": "thidi00",
    "date": 1686683992.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/148na1b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Back when I played in Chapter 3 S1 and S2, I remember I could move around during the Victory Royale pop up, and go next to my friend to use 2-player gestures. It was fun.\n\nThen I stopped playing FN for a while, and came back to it in Chapter 4 S2.\n\nNow I couldn't move after winning anymore , just make some standing still emote. I thought it was a bug and they would fix it soon, but now we're in Chapter 4 S3, and it is still the same.\n\nWhy is that? Did they disable it on purpose? Is it bugged? Did they say if it's going to return?",
    "comments": [
        {
            "level": 0,
            "comment": "For the entire last season I couldn’t even emote after winning lol",
            "score": 483,
            "author": "screamicide",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I still sometimes can’t. Makes no sense to spend all this $ on emotes and I can’t use them lol. \n\nI’m kinda grateful bc it’s saving me money. Haven’t bought vbucks in months until the end of the season when I bought crew (it was too good of a deal not to buy. 1950 vbucks + 2 crew skins + new bp) then canceled it lol",
                    "score": 77,
                    "author": "CityOfSins2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same i stopped buying emotes once i couldn’t use them anymore- i spent a ton on them - I literally have all of the ones i ever liked  from the item shop\nI play on x box and the key bind for augments seems to take over the emote key even though they are different directions on the dpad\n\nEvery time i try to emote i have to use all the augments  before i can emote. \n\nI guess thats why i didnt buy battle pass this season either.",
                            "score": 20,
                            "author": "sub-hunter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;the key bind for augments seems to take over the emote key even though they are different directions on the dpad\n\nSeriously, that NEEDS to be fixed.",
                                    "score": 18,
                                    "author": "CatMobster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "FOR REAL. I DON'T WANT TO AUGMENT AFTER ELIMINATING SOMEONE I WANT TO DO THE GRIDDY ON THEM",
                                            "score": 7,
                                            "author": "Blue_bell88"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Commented i stopped spending money on the game due to an issue. \n\nHope they read this post",
                                            "score": 2,
                                            "author": "sub-hunter"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same! ThAts probably why I stopped buying, cus I’m seemingly never emoting. Maybe I’ll change my binds but I’m o. Switch so idk any buttons that aren’t already taken lol",
                                    "score": 5,
                                    "author": "CityOfSins2"
                                },
                                {
                                    "level": 3,
                                    "comment": "change binds",
                                    "score": 2,
                                    "author": "Mysterious_Test7688",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They are already bound to different things -\n\nwhen augments are available it takes over the whole d pad. (Left might still work on it)\n\nI suppose i could try to bind augments elsewhere but there are no more free keys  and i do sometimes use augments  so i dont want to totally unbind them.\n  \n\nAlso i don’t know if its my controller  because it works fine everywhere else - but i cant select through the emote wheel either. \n\ni had a nearly impossible time  playing the arcade game  because it only likes to select left or right.\n\nI have 4 controllers and the issue is across them all",
                                            "score": 7,
                                            "author": "sub-hunter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Put emotes inside your build/edit mode binds.",
                                                    "score": 1,
                                                    "author": "Mr_Odwin"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I had that problem too but i figured if you dont select all your augments it wont let you emote unless you change the button mapping. I have the progamer controller with the two extra buttons on the back of the handles. I used those to emote before I figured that out. If someone already said this sorry to repeat.",
                                    "score": 1,
                                    "author": "biggiex_xtiddies"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I want my darn emote sounds back. I paid for movement and sound, where is it?  I guess only lawyers get heard.",
                            "score": 2,
                            "author": "SimpleSnoop"
                        },
                        {
                            "level": 2,
                            "comment": "Makes no sense to spend $ on emotes.",
                            "score": 1,
                            "author": "351838"
                        },
                        {
                            "level": 2,
                            "comment": "bro is spending money on emotes",
                            "score": -4,
                            "author": "Icy_Factor_6834",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cus I’m a grown ass adult making a lot of money so I CAN 😂😂",
                                    "score": 1,
                                    "author": "CityOfSins2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "the fact that ur an adult makes it even more sadder 😂",
                                            "score": 1,
                                            "author": "Icy_Factor_6834",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lolll ok lil kid … you’ll see hahaha",
                                                    "score": 1,
                                                    "author": "CityOfSins2"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "^ this is what an immature kid with no responsibilities look like 💀",
                                                    "score": 1,
                                                    "author": "Saauna"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you use your augments? If you have an augment ready to use it won't let you emote.",
                    "score": 2,
                    "author": "TKO9k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did always find it odd that they designed so many team emotes, but you can't really do them properly for a victory\n\nKinda defeats the point of an \"emote with your entire squad\" emote when... You can't",
            "score": 1213,
            "author": "InvestigatorUnfair",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? It sucks : /",
                    "score": 50,
                    "author": "KawaiiKaiju55"
                },
                {
                    "level": 1,
                    "comment": "Sometime around Chapter 4 Season 1 there was a glitch where you could tab out of the screen on PC and click back in and that allowed you to have full capabilities for walking, sprinting, jumping, emoting, etc. and Epic disabled movement as a response to that. Since then, the ability to move for \\~3 seconds after the official viccy flash hasn't been added back *\\*shrug\\*.*",
                    "score": 40,
                    "author": "Saix255",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why did that need to be fixed? Didn't seem like to was harming anyone.",
                            "score": 9,
                            "author": "Kill_Kayt"
                        },
                        {
                            "level": 2,
                            "comment": "I remember doing that all the way back in Chapter 2. It was funny to be the only one moving around after the end of a Team Rumble match back then.",
                            "score": 4,
                            "author": "nullsmack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I couldn’t have said this better myself. You can’t do this emotes in the lobby either so it’s super dumb imo",
                    "score": 184,
                    "author": "Det3tive_JM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes you can?",
                            "score": 23,
                            "author": "culverrryo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They mean doing team emotes together, where you’d have to physically press e to join the emote in game",
                                    "score": 126,
                                    "author": "grimbarkjade",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But you can do them together in the lobby",
                                            "score": -53,
                                            "author": "culverrryo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The pre game lobby? No you can’t",
                                                    "score": 58,
                                                    "author": "grimbarkjade",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ahhhh I was thinking the lobby before the bus launches while it’s counting down, not the very first pregame party lobby. You’re right!",
                                                            "score": 71,
                                                            "author": "culverrryo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That would be spawn island",
                                                                    "score": 9,
                                                                    "author": "KATBOI667-0_0"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Only sea shanty",
                                                            "score": 3,
                                                            "author": "Hobbes_XXV"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s more of a room than a lobby",
                                                            "score": -11,
                                                            "author": "poyat01",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it’s where you go when you click “return to lobby” so i’d say it’s a lobby",
                                                                    "score": 23,
                                                                    "author": "HerbieLemon"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or is it a lobby room",
                                                                    "score": 14,
                                                                    "author": "easymachtdas"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How annoying would it be to always be forced Into doing team emotes when all you want to do is laugh it up or phone it in",
                                            "score": -10,
                                            "author": "Efficient-Science-80"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s even a skin that only lets you do an emote after you win (Doom and the firecracker one) now you can’t even do them",
                    "score": 29,
                    "author": "Zeustah-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m pretty sure you can still do them, you just have to do it really fast after the victory. I might be wrong though.",
                            "score": 7,
                            "author": "rhuebs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe but what’s the point of having to hurry?",
                                    "score": 4,
                                    "author": "Zeustah-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did the firecracker emote recently... like the end of last season.",
                            "score": 4,
                            "author": "RabbitHold8"
                        },
                        {
                            "level": 2,
                            "comment": "How does this have 23 upvotes when it's patently incorrect? Lol, Reddit, always redditing.",
                            "score": 4,
                            "author": "SangestheLurker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This sub makes more sense when you realize it's overwhelmingly a bunch of actual kids vying for clout.",
                                    "score": 2,
                                    "author": "ObamaLovesKetamine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Could not agree more if I tried.\n\nIt's the herd (mob) mentality it's what kills me the most though.",
                                            "score": 1,
                                            "author": "SangestheLurker"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How can you tell me something didn’t happen when it happened to me? Lol, Reddit, always redditing.",
                                    "score": 0,
                                    "author": "Zeustah-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn't say it didn't happen to you (or.. did happen to you, however you're positioning this), I'm saying the victory emotes still work as normal. Pretty sure more people upvote something they like than they do when they agree something is true, especially on this sub.",
                                            "score": 2,
                                            "author": "SangestheLurker"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really wish apex had a winner screen like apex does where you see team stats and can emote",
                    "score": 12,
                    "author": "chiefsfan_713_08",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can imagine the backlash they would get if they copied Apex Legends like that, haha, would be great tho",
                            "score": 7,
                            "author": "sspark92",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Apex wasn't the first to do that tbh",
                                    "score": 5,
                                    "author": "Ambitious-Bed3406"
                                },
                                {
                                    "level": 3,
                                    "comment": "The only people who’d be salty would be people who exclusively play apex so I doubt it’d matter lol",
                                    "score": 2,
                                    "author": "chiefsfan_713_08"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yea but it's Fortnites thing to copy so I'd say I'd be welcome.",
                                    "score": 1,
                                    "author": "Inevitable_Golf_4292"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Meant Fortnite oops",
                            "score": 1,
                            "author": "chiefsfan_713_08"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Every game is like this where they are slowly removing any communication or opportunities to be \"toxic\". Just let us be toxic!!!!",
                    "score": 11,
                    "author": "Brilliant-Throat2977",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol fr they haven’t brought laugh it up back in like a year! My nephews been religiously checking every day lol",
                            "score": 10,
                            "author": "CityOfSins2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair epic is doing then a favour on that front. Laugh it up instantly makes you a target. When someone uses laugh it up after killing me, I hate them with a burning passion. Thankfully they usually get sniped a couple seconds later, but if they do it after winning a game it makes me want to punch my monitor in.",
                                    "score": 9,
                                    "author": "Jofus002",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha I know I think that’s why they don’t add it back. But my nephews 11 and would loooove to be that toxic.",
                                            "score": 4,
                                            "author": "CityOfSins2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You know what, considering a lot of the behaviours of people I've met in random games (probably around the same age as them) I don't doubt that one bit.",
                                                    "score": 4,
                                                    "author": "Jofus002",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Totally around the same age. Those kids love to be toxic and call us older ppl trash pandas lmao. He tones it down with me but when I hear him playing creative in the other room I’ll hear him like BOZO lol",
                                                            "score": 2,
                                                            "author": "CityOfSins2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I can almost guarantee that I was one of those other people. You have just described every other random with a mic I've played with lol. And in creative even more so.",
                                                                    "score": 3,
                                                                    "author": "Jofus002",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It gets even better when they're the worse players, both in normal games and in creative. How often did I hear little kids being toxic and boisterous and then they die nonstop or get left behind in puzzle/deathrun creative games.\n\nEven funnier when they start acting surprised that we \"old people\" even play video games, because clearly we're not supposed to be playing *games* in our free time. Let's ignore the fact that at least my generation (Gen Y / Millenials) grew up with Video Games of all kinds and the Internet. Of course pointing that out doesn't help usually.",
                                                                            "score": 5,
                                                                            "author": "Myhrros",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I tell my nephew that all the time. He’s like “I bet you’re the only person at your work that plays video games” I’m like uhhh no???? We grew up w this shit I. Our hands. We know much more about tech and technological advances than you do bc we went from Sega to the shit we have now lol",
                                                                                    "score": 5,
                                                                                    "author": "CityOfSins2"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The fact that people get so mad is why it's the best emote ever. You even pretend that god smites down who ever uses the emote which is cope because the emote is awesome",
                                            "score": -1,
                                            "author": "Brilliant-Throat2977"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ha! I have Laugh It Up and Take The L permanently in my #1 and #2 emote slots! People get so mad with those and I love it! 🤣",
                                    "score": 2,
                                    "author": "AstroMoon17"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Man I don't even do it for toxicity. I just throw in a GG emoticon (or the free GGWP emote) then sometimes follow up with a Rick Roll (which I feel is the least hurtful dance taunt).",
                            "score": 1,
                            "author": "Jessency"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It makes me sad, I wanna group up with homies and do the Shout! Emote together",
            "score": 133,
            "author": "Samandre14"
        },
        {
            "level": 0,
            "comment": "They don’t even let you move the camera lol",
            "score": 229,
            "author": "bitchmob69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes they do! It's really sporadic though.",
                    "score": 62,
                    "author": "Saffronation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I was able to run around in circles with my hands posed like I was still holding a gun for like 30 seconds this past weekend. It was pretty ridiculous, but also fucking hilarious. The next win I couldn't even emote.",
                            "score": 17,
                            "author": "lordnachos"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can if you use gyro controls btw",
                    "score": 6,
                    "author": "AxlSt00pid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The key is you've gotta be using controller for that. And in the nicest possible way, Imma stick to my keyboard and mouse.",
                            "score": 5,
                            "author": "Jofus002",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't say you should switch, I'm just saying Epic has to revert being unable to move both the camera and your character during a vicroy because there's no reason for it to be how it is now (They didn't think to disable gyro to move the camera so it's either a half-assed job, or the most likely answer, there's no reason for the movement to be locked)\n\nFunny enough I won while gliding over Mega City's lake this season and it caused me to instantly sink to the bottom of the lake",
                                    "score": 1,
                                    "author": "AxlSt00pid"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you do a spray or emoticon, it unfreezes your camera movement.  \n\nYou still can't move your player character, though.",
                    "score": 3,
                    "author": "nineinchgod"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Master of puppets with the whole squad made people feel bad I guess",
            "score": 411,
            "author": "Kurthusslle",
            "replies": [
                {
                    "level": 1,
                    "comment": "#Master\n\n#Master\n\n#Just call my name, cause I'll hear you scream!",
                    "score": 138,
                    "author": "frogiscat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MASSTWR OF PUPPETS IM PULLIN YOUR STRINGGGGGGGSSSSS",
                            "score": 38,
                            "author": "-lonelyboy25"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "MoP never fails to pump up the strangers i meet in squad",
                    "score": 50,
                    "author": "AnimaTrapDelaSangre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gets me going everytime 🤣🤣",
                            "score": 17,
                            "author": "Azkrayy"
                        },
                        {
                            "level": 2,
                            "comment": "Love just seeing what kind of 4 man band I can make",
                            "score": 11,
                            "author": "-sharkbot-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had one before where it was me and two others then somebody came up and did their own with two other people.",
                                    "score": 5,
                                    "author": "kingshadow75",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is one reason I got that emote lol",
                                            "score": 2,
                                            "author": "ifuckinghateschooll"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My favourite emote don’t see it too much in the wild tho I love it",
                    "score": 9,
                    "author": "Chickenofthewoods95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven't laughed this hard in a while, but we found out that you can drive a truck through a rift...while you play MOP in the back with a full drum set and someone else on guitar. Hit the Island and the team just kind of stared at us for a solid second before all hell broke loose.",
                            "score": 12,
                            "author": "QuickSilverII",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's even funnier if the person on the back of the motorcycle starts doing it. The drum kit is just floating as you speed around",
                                    "score": 10,
                                    "author": "RoseColoredRiot"
                                },
                                {
                                    "level": 3,
                                    "comment": "I need to get on kinetic ore with my pals and shred away.",
                                    "score": 6,
                                    "author": "Wermine"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I completely agree with you. I have to believe this is a bug because if it's intentional it's dumb and makes no sense. We used to have between 5 and 10 seconds to position ourselves after a win before it \"locked in\". It gave us time to position ourselves and find the perfect emote and take the perfect screenshot. \n\nNow it feels like you have milliseconds to select an emote, and not only that, the entire screen turns a faded shade of blue so you really can't even keep taking good screenshots of the scenery or background of your victory. Major bummer.",
            "score": 185,
            "author": "Automatic_Cancel5693",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not to mention dr doom victory emote is almost impossible to use now",
                    "score": 59,
                    "author": "Kingmasked",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why is that? I did it just a week ago",
                            "score": 5,
                            "author": "1attemptpause",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think because you can’t always move the camera for some reason so you’ll be looking at it in weird angles",
                                    "score": 3,
                                    "author": "bob1111bob"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Weird updates aren't they?",
                    "score": 8,
                    "author": "Alpine_Oxygen157"
                },
                {
                    "level": 1,
                    "comment": "I don't think it's a bug because otherwise it wouldn't go this long without being fixed, unfortunately. I want them to refund my group emotes and traversal tbh but I can't anymore.",
                    "score": 45,
                    "author": "ForbiddenDarkSoul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I can't remember the last time I used a traversal emote. Tried it once after a game just to realize I can't move. Full sprinting doesn't look so good when you are running in place",
                            "score": 4,
                            "author": "Man_Machine_Meme"
                        },
                        {
                            "level": 2,
                            "comment": "Kid named Hurdling:",
                            "score": 2,
                            "author": "brawler_ideas"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's awful but I don't think that it's a bug. Back when this started to happen, it was listed as \"players can't emote during victory screen\" they fixed that but didn't fix the fact that you can't move after winning...",
                    "score": 16,
                    "author": "BaridiBlueberry"
                },
                {
                    "level": 1,
                    "comment": "It’s absolutely a bug. I play team rumble a fair amount and see people using emotes after winning while I’m stuck sitting still and waiting for the next match. Occasionally I’ll be able to do it myself, but it’s rare. \n\nNever had any issue emoting after a win in Battle Royale modes though.",
                    "score": 4,
                    "author": "Drunksqurrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The winning team in rumble can emote, the losers just get to watch. It's been like that for many many seasons, if not since Rumble's introduction.",
                            "score": 1,
                            "author": "SangestheLurker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m aware of that. What I’m saying is that I cannot emote after winning when I am on the winning team. Sometimes it works, sometimes it doesn’t. I know that you can’t emote if you’re on the losing team.",
                                    "score": 2,
                                    "author": "Drunksqurrel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting. I've never come across that (unless I'm floating down from just being eliminated lol).",
                                            "score": 1,
                                            "author": "SangestheLurker"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huge L imo.",
            "score": 178,
            "author": "SirPugly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just how big a Limo are we taking?",
                    "score": 136,
                    "author": "Brotoss-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "HUGE",
                            "score": 20,
                            "author": "xSnakeSlayerx"
                        },
                        {
                            "level": 2,
                            "comment": "😂",
                            "score": 15,
                            "author": "introvHERted"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It could be redesigned for sure it needs it. I play trios a lot so having a 3 way split screen would be awesome. I would like to see the celebration my team is doing too. And for my team members that got killed they could be ghosts. And for team emotes there should be an option to join.",
            "score": 53,
            "author": "Joshhwwaaaaaa"
        },
        {
            "level": 0,
            "comment": "They don't even have it in a list of fixes/bugs on their Trello now.\n\nBefore, there was a \"card\" named \"Players can't emote after a victory royale\" (really similar to that), they fixed the emoting part, they marked the bug as fixed, but we stil can't move, it was a job half done.\n\nSync'd emotes are pretty useless now.",
            "score": 16,
            "author": "OneoAce",
            "replies": [
                {
                    "level": 1,
                    "comment": "How can you see their trello?",
                    "score": 1,
                    "author": "Queasy_Finance_5143"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back in chapter 1, you were able to move for a solid 5-10 seconds. People would cycle through several emotes or start cranking 90s. Sometimes people would be toxic with it and build a big \"L\", or spray paint the dead body outline and do Take The L, but that's just part of the goofing off.\n\nI used to buy emotes specifically because I liked them and wanted to use them after a win. Now I don't buy emotes at all. Not worth it if I can only use them in front of bots in the starting island.",
            "score": 63,
            "author": "Kjc2022",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh God I remember watching the other guy crank 90s after taking the dub off you",
                    "score": 19,
                    "author": "Zirconium_Pants_"
                },
                {
                    "level": 1,
                    "comment": "dude remember the slowdown effect you’d get that was so fun",
                    "score": 12,
                    "author": "Pokevan8162"
                },
                {
                    "level": 1,
                    "comment": "they didnt make this change until ch3 i think, you could definitely still crank 90s after winning in ch2",
                    "score": 4,
                    "author": "lilbelleandsebastian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I miss being able to run up to my brother &amp; high five him after a Victory.\n\n\nThey've had it turned off/bugged for so long that I can't even remember when was the last time I could move after a Win.",
            "score": 12,
            "author": "PMMeUnwantedGiftcard"
        },
        {
            "level": 0,
            "comment": "You can’t even emote at all in team rumble. So fucking stupid. Let us use our emotes that we paid for",
            "score": 12,
            "author": "BrianDawkins"
        },
        {
            "level": 0,
            "comment": "It sucks. I just wanna do a death drop when I win!",
            "score": 8,
            "author": "livonyote"
        },
        {
            "level": 0,
            "comment": "They want to tease you with that dropped gold!\n\nFeels bad for Doctor DOOM not being able to use his inbuilt emote though.",
            "score": 7,
            "author": "Bu1ld0g",
            "replies": [
                {
                    "level": 1,
                    "comment": "Release battlepass cosmetic where his only shtick is a built-in emote to use after victory, but you can't emote after victory. Doom is my favorite skin, but I am a little bummed that I can't use him to his full potential",
                    "score": 5,
                    "author": "Man_Machine_Meme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love the Doom and Iron Man skins, but the metalic noise when you walk puts me off using them sadly.",
                            "score": 1,
                            "author": "Bu1ld0g",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's one of my favorite parts, different footstep sounds back then.",
                                    "score": 2,
                                    "author": "Man_Machine_Meme"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it’s a bug that still hasn’t been fixed sadly, the victory screen has been broken as hell in many different ways for a few seasons now. it started off as you losing the ability to move after you started emoting, then completely wiping your ability to emote entirely, now you just can’t move at all (though you can emote again)\n\nreally hope they fix it but i doubt it more and more with each update",
            "score": 18,
            "author": "tetro247",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Bug”. \n\n\nLmao if you believe that. It’s a feature to protect people’s delicate feelings.",
                    "score": 5,
                    "author": "watts2988",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk end screen has been buggy a lot recently. Had a lot of issues with host and party readying up, not too long ago. But maybe they wanted to stop someone from being able to T-bag or something.",
                            "score": 3,
                            "author": "-sharkbot-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was originally a bug, but they removed it from their Trello bug tracker when they made it so you could emote (but left the movement disabled).",
                    "score": 1,
                    "author": "Mr_Odwin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not only can I not move but I can no longer emote either 🫤",
            "score": 4,
            "author": "InvMz"
        },
        {
            "level": 0,
            "comment": "I sent an email to epic complaining about this, saying the whole reason I bought the synced emotes was for after winning matches.\n\nThey said it is INTENDED it's not bugged they decided to stop letting us move, and that they would pass the feedback to the developers.\n\nMaybe if we all complain and send emails like I did, we can bring them back.",
            "score": 4,
            "author": "Ivaanflores"
        },
        {
            "level": 0,
            "comment": "I feels very strange they never commented on it. I miss it so much",
            "score": 9,
            "author": "Sun-Bro-Of-Yharnam"
        },
        {
            "level": 0,
            "comment": "They didn't like good players flexing on people after winning.  I do miss cranking builds and then dancing on top.",
            "score": 16,
            "author": "OGMcgriddles"
        },
        {
            "level": 0,
            "comment": "This",
            "score": 3,
            "author": "lucianorc2"
        },
        {
            "level": 0,
            "comment": "Yeah I noticed this too, random as.. now when someone wins they just do their favourite emote from any angle.",
            "score": 3,
            "author": "JZA8OS"
        },
        {
            "level": 0,
            "comment": "I hope this gets boosted and Epic sees it. It's so dumb to take it out.",
            "score": 3,
            "author": "TheXerebro"
        },
        {
            "level": 0,
            "comment": "You can still do it, it just has to be fast like right as the slow motion is going BOOM do an emote. Don’t understand why they made it this way now though",
            "score": 3,
            "author": "DatBoyKB"
        },
        {
            "level": 0,
            "comment": "I remember when you could Emote for atleast a cpl mins before the game would send you back to the Lobby!!! I would assume it's to keep people from taunting other players at the end of games which is stupid if that's the case! If people don't want to be taunted they can just leave the game and either start a new one or go back to the Lobby!!! Half the fun of Emotes is doing them after you or your squad get a Vic Royale, plus what's the point of having those Celebratory group emotes if you can't use them after a Win?!?!?!?!!!",
            "score": 3,
            "author": "mi11zee"
        },
        {
            "level": 0,
            "comment": "Epic making unnecessary changes to the game for no reason that benefit nobody. Just like removing trios and nerfing the heavy sniper and grenades",
            "score": 3,
            "author": "SpicyLunaDog99"
        },
        {
            "level": 0,
            "comment": "Ya its been like that for a while now. For a few months last season I couldn't even emote after a vicroy.",
            "score": 2,
            "author": "Shit_the_bedd"
        },
        {
            "level": 0,
            "comment": "At least this sub is still here lol",
            "score": 2,
            "author": "Efficient-Science-80"
        },
        {
            "level": 0,
            "comment": "Most times I cannot emote immediately after a win.",
            "score": 2,
            "author": "stompah2020"
        },
        {
            "level": 0,
            "comment": "i think it is so you cant pick up the last persons crown after you won",
            "score": 2,
            "author": "yaoifeet"
        },
        {
            "level": 0,
            "comment": "Stop winning, then you don't get this issue haha",
            "score": 2,
            "author": "sladen1985"
        },
        {
            "level": 0,
            "comment": "Psst don't tell anyone but you can look around and emote if you open and close the map after winning",
            "score": 2,
            "author": "ZealousMusicNZ"
        },
        {
            "level": 0,
            "comment": "I completely agree with you. I have to believe this is a bug because if it's intentional it's dumb and makes no sense. We used to have between 5 and 10 seconds to position ourselves after a win before it \"locked in\". It gave us time to position ourselves and find the perfect emote and take the perfect screenshot. \n\nNow it feels like you have milliseconds to select an emote, and not only that, the entire screen turns a faded shade of blue so you really can't even keep taking good screenshots of the scenery or background of your victory. Major bummer.",
            "score": 2,
            "author": "Automatic_Cancel5693"
        },
        {
            "level": 0,
            "comment": "To cater to sensitive people",
            "score": 2,
            "author": "Farmerbutterscotch",
            "replies": [
                {
                    "level": 1,
                    "comment": "This but unironically",
                    "score": 1,
                    "author": "acid_rogue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Epic Games figured out how to remove the best free emote any victory player can ever do. T-BAGING! It's money always money.",
            "score": 1,
            "author": "digitalbladesreddit"
        },
        {
            "level": 0,
            "comment": "From previous seasons I had the same experience but on my last win this season my character was frozen but I was able to emote, so maybe try again?",
            "score": 1,
            "author": "Shazzam001"
        },
        {
            "level": 0,
            "comment": "Because we live in the snowflake timeline when even doing fortnite dances over your dead fortnite body is considered too offensive for the children, in a game with literal guns...",
            "score": 1,
            "author": "CricketFriend"
        },
        {
            "level": 0,
            "comment": "Honestly I'm fine with it cause I don't want to see small children flexing their le epic edit course skills after one pumping someone",
            "score": -7,
            "author": "PigsInTuxedoes"
        },
        {
            "level": 0,
            "comment": "In the end my full squad do the same emote so it doesn't matter if we're side by side.",
            "score": 1,
            "author": "Lilcommy"
        },
        {
            "level": 0,
            "comment": "All my friends have this problem but for some reason I don't. It's not affecting everyone and we can't figure out why.",
            "score": 1,
            "author": "DugBuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Neither can Epic apparently",
                    "score": 1,
                    "author": "ElectriCole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "bring this back and ill buy every group emote.",
            "score": 1,
            "author": "iamtomcruisereally"
        },
        {
            "level": 0,
            "comment": "I was able to emote on wins on the first day of the season but not anymore 🤷",
            "score": 1,
            "author": "utookthegoodnames"
        },
        {
            "level": 0,
            "comment": "Just have to do it within a certain time.",
            "score": 1,
            "author": "thefoxishere16"
        },
        {
            "level": 0,
            "comment": "I just won a game a few hours ago and could move? I was there for 15 seconds after the win emoting and running around",
            "score": 1,
            "author": "DeadlyRetr0_"
        },
        {
            "level": 0,
            "comment": "I've only played a year or so but I dont recall ever being able to move ones banner pops",
            "score": 1,
            "author": "sspark92"
        },
        {
            "level": 0,
            "comment": "It's epic guys and gals.",
            "score": 1,
            "author": "LibraryAgreeable5720"
        },
        {
            "level": 0,
            "comment": "I remember back in C2 or C3 I had a glitch where I won the game but it didn't freeze me after 5 seconds. It let me run around the map in the storm on the winning screen. I had a blast until it timed me out and sent me back to the lobby.",
            "score": 1,
            "author": "ipmacs"
        },
        {
            "level": 0,
            "comment": "I would always tap auto sprint and see how far I would go.",
            "score": 1,
            "author": "Fluid-Alternative-22"
        },
        {
            "level": 0,
            "comment": "That's odd because I can emote after winning &amp; a few people who've won when I came in 2nd did an emote and it worked. Could it possibly be a bug for some people? Because all last season I couldn't ready up I had to alway return to lobby after each match.",
            "score": 1,
            "author": "CourtneyAnn199048"
        },
        {
            "level": 0,
            "comment": "Epic doesn’t fix buts anymore, that’s why. They just add temporary solutions, or straight up remove the feature.",
            "score": 1,
            "author": "I_Quazar_I"
        },
        {
            "level": 0,
            "comment": "There is emotes that you can't actually use until you get a victory royale like the emote for Dr. Doom his emote requires a win",
            "score": 1,
            "author": "TheDarkWeb697"
        },
        {
            "level": 0,
            "comment": "It was a bug now they made it intentional",
            "score": 1,
            "author": "ZeRo_WC"
        },
        {
            "level": 0,
            "comment": "Yeah I can barely pick a emote and it's kinda lame",
            "score": 1,
            "author": "Miltankslurpee"
        },
        {
            "level": 0,
            "comment": "I can emote after every win. Always the master of puppets emote",
            "score": 1,
            "author": "MyroIII"
        },
        {
            "level": 0,
            "comment": "I’m having a problem this season where I can’t emote at all after a vr now :/",
            "score": 1,
            "author": "PurposeExpensive4783"
        },
        {
            "level": 0,
            "comment": "On PC you can still move even with the screen that shows the results",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "everything fun gets vaulted, silenced or just flat out removed. Thats the Fornite way.....",
            "score": 1,
            "author": "SimpleSnoop"
        },
        {
            "level": 0,
            "comment": "@epicgames",
            "score": 1,
            "author": "Queasy_Finance_5143"
        },
        {
            "level": 0,
            "comment": "Is it possible to finish first in this game ?😁",
            "score": 1,
            "author": "Anarcheeses"
        },
        {
            "level": 0,
            "comment": "\"It's toxic.\"",
            "score": 1,
            "author": "ZakTSK"
        },
        {
            "level": 0,
            "comment": "I wish there was a way to find out who has this problem… m thinking it’s mostly console players? for example, I’m a PC player and changed my key binds and I can always emote after a win.",
            "score": 1,
            "author": "KangarooDisastrous"
        },
        {
            "level": 0,
            "comment": "I’m more concerned with trying to emote and my augments pulling up since I don’t win every game. It feels like it’s actually a “feature” since it’s two completely different buttons on controller",
            "score": 1,
            "author": "this_isnt_lemonade"
        },
        {
            "level": 0,
            "comment": "I don’t remember being able to walk around after the dub I’ve always frozen up where I took my last shots or step when the final player was killed , however I’ve NEVER not been able to Emote.",
            "score": 1,
            "author": "_BlueCollarGamer"
        },
        {
            "level": 0,
            "comment": "Word!!!",
            "score": 1,
            "author": "Ok-Comb-2187"
        },
        {
            "level": 0,
            "comment": "imagine a Doctor Doom enjoyer can't do his sync emote when it's only available when you win 💀",
            "score": 1,
            "author": "pudimdemeh"
        },
        {
            "level": 0,
            "comment": "might have been because people were making an entire edit course",
            "score": 1,
            "author": "caped_crusader44"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the best part, you run up to your friend(s) and do a synched emote, or you just show off some of your emotes (mobile or not), or you just run around for fun.\n\nOr you wait.",
                    "score": 13,
                    "author": "DoctorJordi_"
                },
                {
                    "level": 1,
                    "comment": "Cmon it was fun to run up to your friend and use a synced emote to celebrate",
                    "score": 18,
                    "author": "thidi00"
                },
                {
                    "level": 1,
                    "comment": "Cringe",
                    "score": -1,
                    "author": "0zer0zer0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They want games to end faster so you get into the next game faster. It is about the player pool having shrunk. You can yada yada about the millions of people who play FortNite, but they are divided among many, many different games within FortNite, especially Creative (which I almost exclusively play now). It's why Team Rumble was carved up and bled to death because there were so few players, and so on.",
            "score": -2,
            "author": "fizzysnork",
            "replies": [
                {
                    "level": 1,
                    "comment": "BR modes still contain the vast majority of players. Each one constantly maintains at least 150-200k players (except for ranked zero build). I don't understand the huge impact that 5 seconds has.",
                    "score": 3,
                    "author": "Jollygoldfish11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Five seconds is important when I'm waiting 90 seconds or more to get into a match.",
                            "score": 1,
                            "author": "fizzysnork"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think there may be a bug, it always happen every few seasons, its never permanent that change",
            "score": 0,
            "author": "Swimming_Mountain"
        },
        {
            "level": 0,
            "comment": "You can’t move because you didn’t select all of your augments",
            "score": 0,
            "author": "Cheezymac2"
        }
    ]
}