{
    "id": "148to2e",
    "score": 5,
    "title": "New “bugs”?",
    "author": "RustyChicken16",
    "date": 1686701757.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/148to2e",
    "media_urls": [],
    "other_urls": [],
    "postText": "So since the newest update, I’ve had a few games where I die because someone seems to stop taking damage. What I mean is, I run up to third party, and shoot a dude in the back at point-blank range with a 30 round smg. It looks like I get hit markers until the enemy’s shield breaks, then nothing - it’s as if my bullets just stop connecting. I don’t appear to lag/clip/stutter/rubber band or anything when this happens, and it isn’t *too* often, but it’s frustrating when it does. Does anybody know what causes this? I think it’s a bug because even though I’m not the best player, I’m not going to go from hitting most of my shots to missing literally everything in the span of a second.",
    "comments": [
        {
            "level": 0,
            "comment": "This happened to me with shotguns and assault rifles. I know other players are experiencing it too. It’s soooooo frustrating.",
            "score": 2,
            "author": "UDontKnowMe784",
            "replies": [
                {
                    "level": 1,
                    "comment": "\nHonestly, it’s just nice to know it isn’t only me :/",
                    "score": 1,
                    "author": "RustyChicken16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it’s definitely not just you. I’ve experienced the same with the sniper. However, can we be surprised about bugs in Fortnite? Haven’t played a single season without bugs.",
                            "score": 1,
                            "author": "UnicornSitter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for helping the team at Epic swat these bugs! If you haven't provided the information already, please share the following to help Epic Games:\n\n    How can this bug be reproduced?\n    \n    What platform are you playing on?\n\nShould there be a need, members of the Epic Games Community Team may reach out to you with additional questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FortNiteBR) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}