{
    "id": "148tske",
    "score": 36,
    "title": "Anyone else dislike how the milestone quests rotate this season?",
    "author": "LostMiddleAgeMan",
    "date": 1686702137.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/148tske",
    "media_urls": [],
    "other_urls": [],
    "postText": " **Anyone else hate how the milestone quests rotate this season?**  Maybe its just me.",
    "comments": [
        {
            "level": 0,
            "comment": "Yes I don't like it, I used to pretty much ignore the milestones and they would complete themselves.\n\nNow I find I play for longer to concentrate on them and get them done. Which is what they want I presume.",
            "score": 24,
            "author": "ComprehensiveBee2202",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like that as well but sometimes I will just grind like 5-6 \"Drive xxx meters\"  Just out of boredom.",
                    "score": 5,
                    "author": "LostMiddleAgeMan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could start them all at once before. Now it takes longer as you have to complete one before you get another.",
            "score": 8,
            "author": "Little_Timmy_is_Back"
        },
        {
            "level": 0,
            "comment": "I like the old system but am not super annoyed by the new version.  I just hope we get some new categories as the season progresses.",
            "score": 11,
            "author": "MaDCapRaven"
        },
        {
            "level": 0,
            "comment": "You get 30 total levels by completing everything and interestingly enough the combat ones are super easy to grind in team rumble (so 10 levels right there). The ‘challenge’ ones suck though. But at least people have been finding loopholes for the annoying ones (e.g. you can spam picking up a gas pump for the collect 500 items one)",
            "score": 3,
            "author": "JohnCavern24",
            "replies": [
                {
                    "level": 1,
                    "comment": "also destroy the bottom floor of buildings or destroy a gas pump",
                    "score": 2,
                    "author": "Cularia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I do the spamming gas pump one. Also drive round blowing up gas stations, that's quite fun.",
                            "score": 1,
                            "author": "ComprehensiveBee2202"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t mind it per se but I think the old system was easier. Only playing BR I’ve finished 17 combat quests and only 5 of the challenge quest. Picking up 500 items or destroying 250 structures can take several matches but 25 eliminations or 25 headshots have been completable in 2-4 matches",
            "score": 2,
            "author": "dollysanddoilies",
            "replies": [
                {
                    "level": 1,
                    "comment": "the items and structures are easily doable in a single match. gas pump and destroy bottom floor of a house.",
                    "score": 2,
                    "author": "Cularia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do they last all season or will they run out in the end",
            "score": 1,
            "author": "nick_shannon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know but from memory I think at the top each category is out of 20. Presume when you have completed 20 stages they will finish.",
                    "score": 2,
                    "author": "ComprehensiveBee2202"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They really need to just focus on things that are actually broken or need attention… the milestones were not a priority.",
            "score": 1,
            "author": "thatsMRjames"
        },
        {
            "level": 0,
            "comment": "It pisses me off more than words can express. This is my second season and I'm leveling up way slower because of the stupid milestones that take way longer and can't all be done simulataneously. The 2k xp reward is a joke and it takes for fucking ever to get the 30k xp.",
            "score": 1,
            "author": "thE_OG_wEak_saucE"
        },
        {
            "level": 0,
            "comment": "Honestly, I don't even pay much attention to them. Never have. They usually just completed on their own over the course of a season in the past, and even if they stop doing that now, the XP they would give is fairly insignificant to my overall result. I've typically hit lvl 300-400+ every season for years now, so I don't really need whatever they offer.",
            "score": 1,
            "author": "SirMy-TDog"
        }
    ]
}