{
    "id": "148x7sy",
    "score": 2,
    "title": "Return of spider-verse skins?",
    "author": "Redditgobrrrrrr",
    "date": 1686713014.0,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/148x7sy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anybody have a guess when they’ll bring back the spider-verse skins since I wasn’t able to purchase them due to going on a vacation before I could get them so I would hope to catch them on next release",
    "comments": [
        {
            "level": 0,
            "comment": "Not guaranteed Sony is kind of weird. They haven’t brought back Eddie Brock and they barely bring out MCU Spider-Man and another question when you were on vacation did you have a phone/iPad tablet device you can use Xbox gaming I forgot what it’s called. It’s a cloud service you might not be able to play depending how your device is but you should be able to at least get into the item shop.",
            "score": 5,
            "author": "DerekMilewski"
        },
        {
            "level": 0,
            "comment": "It’s not guaranteed but they almost always bring back skins for a day or two after about 30 days then they are gone for awhile.",
            "score": 3,
            "author": "BlakMarker_Amber_Ale"
        },
        {
            "level": 0,
            "comment": "Before you get roasted I’ll try to give a bit of help. Usually collab skins only come back for certain events, so there’s a good chance those will be back with the release of the final movie. They could also come back with marvel skins in the shop, but those haven’t been seen for a while and there’s no event happening that would make me think they would return.",
            "score": 2,
            "author": "Hurin_the_Steadfast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remember, Sony doesn’t release no way home with marvel all the time they only have three sets right now Eddie Brock, who hasn’t returned since I don’t know actually but it’s been a while no way home Spider-Man, which comes out once in a while with marvel but usually later, but not all the time and now spider verse but who knows if it will return",
                    "score": 4,
                    "author": "DerekMilewski",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eddie Brock hasn’t been in the shop since December 29 2021, 532 days ago. Which is sad because I really like the skin. Hopefully it will return at some point.",
                            "score": 1,
                            "author": "Aq_pA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The best thing I like about it was the contrail, because I main Inkquisitor and would love to get those inky stuff while falling.",
                                    "score": 1,
                                    "author": "seattlesound1004",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I got that but not the glider. I have everything but the glider.",
                                            "score": 1,
                                            "author": "DerekMilewski"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I got Eddie cheap as I had the original Venom, hopefully it comes back for the good people on here that's wants him",
                                    "score": 1,
                                    "author": "NormanBates2023"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Marvel shop is rumored for secret wars at the end of the month.",
                    "score": 0,
                    "author": "Iloveitguy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe when beyond the spider-verse releases",
            "score": 1,
            "author": "KID-spidr"
        },
        {
            "level": 0,
            "comment": "You're on shakey ground with the Sony marvel stuff honestly(they've yet to bring back the eddie Brock skin from the movie) could come back with the planned marvel shop or it could be vaulted till spiderverse 3 next year.",
            "score": 1,
            "author": "Iloveitguy"
        },
        {
            "level": 0,
            "comment": "at the very latest next year when third film gets released",
            "score": 1,
            "author": "National_Reward2050"
        }
    ]
}