{
    "id": "147rro6",
    "score": 2406,
    "title": "If for some reason you were offered the opportunity to live rent free, free utilities, free housekeeping, free furnishings, free maintenance, etc., would you be willing to live in a hotel room instead of your own apartment/house?",
    "author": "Doodlebug510",
    "date": 1686588796.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/147rro6",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The average hotel room isn't much smaller than my apartment/condo so ... sure?",
            "score": 1846,
            "author": "IHOP_007",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, looks like someone's already living the dream of never having to clean their own bathroom.",
                    "score": 171,
                    "author": "vale199890ov"
                },
                {
                    "level": 1,
                    "comment": "No kitchen though, which would annoying more as time went on.",
                    "score": 345,
                    "author": "system_deform",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TBH I'd just buy a hot plate or an electric pan, I do like 80% of my cooking in a single frying pan anyway.  The small fridge would be more annoying but I think I'd get by with my extra like $1500 a month lol.",
                            "score": 385,
                            "author": "IHOP_007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; TBH I'd just buy a hot plate or an electric pan, I do like 80% of my cooking in a single frying pan anyway. The small fridge would be more annoying but I think I'd get by with my extra like $1500 a month lol.\n\nBuy a larger fridge, buy a rice cooker, an air fryer, etc.  OP never said you can't add to the room.",
                                    "score": 85,
                                    "author": "somedude456",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rent out the room to other people for extra money, live in an airport restaurant",
                                            "score": 52,
                                            "author": "Impregneerspuit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "1000 a month and I can pay friends to cook at their houses.",
                                            "score": 6,
                                            "author": "DesktopWebsite",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Where does one find these… “friends”",
                                                    "score": 2,
                                                    "author": "Thrownintrashtmw"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hot plate and countertop oven. \n\nThey said free furnishings, so this should definitely be a part of it.\n\nTiny fridge would literally be the worst part, and i lived in an efficiency 1bd for years- small fridges help you to cook more.",
                                    "score": 110,
                                    "author": "ManYourStillHere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just stayed in a shitty $90 hotel in Daytona that had a full fridge, stove, oven , sink, etc. A full, while small kitchen is not out of the question here. I would def do that deal.",
                                            "score": 34,
                                            "author": "Daddy_Nardo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’d just buy a bigger fridge Idgaf.",
                                            "score": 2,
                                            "author": "DeeboTheWise",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, idk- i just dont need a bigger fridge. Like mine right now looks empty af, just because i got used to the tiny fridge life. I got eggs, salad, cherries, water bottles, almond milk and a few condiment bottles lmao it could be a problem only  after the holidays or cookouts where there's left overs\n\nProbably helps that I don't like cheese or meat though. Both smell terrible(IMO) &amp; i genuinely don't get how people eat that stuff.",
                                                    "score": -4,
                                                    "author": "ManYourStillHere",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m gonna blow your mind then. It’s because it smells good to other people.",
                                                            "score": 5,
                                                            "author": "G00mi",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "you could probably go out for dinner every day for that 1500$",
                                    "score": 27,
                                    "author": "Anoukkes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can go out to dinner everyday for a lot less than 1500 a month lol",
                                            "score": 24,
                                            "author": "ItGradAws",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I expect to pay minimum $15 for lunch and $20 for a dinner if I eat out cheaply (anything but fast food). That's a solid $35/day (I don't eat breakfast) which is an easy $1,000/month. Probably more to get more variety and healthier food etc. So it's weirdly close to breaking even on that rent or mortgage payment. You can do cheaper, but I'm not shooting for a *Supersize Me* lifestyle here.\n\nAlso, I'd feel sick eating restaurant food all the time. Though maybe that's just because I'm used to cooking at home for 80-90% of our meals.",
                                                    "score": 13,
                                                    "author": "chairfairy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Restaurant food is usually super high in fats, salts, and sugars. Tastes so damn good",
                                                            "score": 6,
                                                            "author": "GlobalMonke",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "i could probably live off an air fryer tbh",
                                    "score": 31,
                                    "author": "hanscons",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Youd have to eat a lot of fried air to get enough calories though",
                                            "score": 53,
                                            "author": "MountainCourage1304",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Everyone's so honest about how they'd cook. I hate when people lie about that.",
                                            "score": 4,
                                            "author": "kingeryck"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "All the spare money you could probably just eat out a lot more, or use the hotels dining area if it had one.",
                            "score": 67,
                            "author": "Charon2393"
                        },
                        {
                            "level": 2,
                            "comment": "I lived in a studio that was basically a hotel room. It sorta had a kitchen if you count an oven that my 13x9 cookie trays won't fit in and a single stove top burner a kitchen. Can confirm, it sucked and I want a full kitchen everywhere I choose to live in the future.",
                            "score": 8,
                            "author": "imreallynotthatcool"
                        },
                        {
                            "level": 2,
                            "comment": "Always have a kitchen in my hotel rooms",
                            "score": 3,
                            "author": "iizxchii"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived that way for a decade in a hotel on the beach in Costa Rica. I was the chef of the restaurant and had free room and board, house keeping, laundry service etc. It was the best ten years of my life. \n\nThe hotel was on a sleepy surf beach and only had 14 rooms. I read books, surfed, jogged on the beach and smoked pot all day. \n\nI'm in in NY now with a wife and 4 kids and seriously thinking about doing it again but with the whole family.",
            "score": 176,
            "author": "buffalogoldcaps",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m unfortunately getting divorced and thinking about doing the same thing next. Lol",
                    "score": 35,
                    "author": "okthatsfineman"
                },
                {
                    "level": 1,
                    "comment": "Wow",
                    "score": 6,
                    "author": "matt675"
                },
                {
                    "level": 1,
                    "comment": "Living the dream! Did you give it up because you met your wife or did you meet her after deciding to change lifestyles?",
                    "score": 3,
                    "author": "NineRoast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I eventually moved to the Philippines to teach at a culinary school for 3 years, then moved into the mountains to farm before eventually moving back to Costa Rica. I had designed some simple wind powered auger presses to extract coconut oil without using electricity or fossil fuels and moved to NY to work and raise money for the project with the objective to move back to CR within 2 years to start a small coconut oil company. \n\nI met a girl within a few months of being back in NY (she had a 5 year old) and since then we have had 3 kids in 5 years. Covid, kids, job instability, cost of living, health insurance etc... You know, American dream stuff...have kept us in NY for longer than anticipated. \n\nWe won't move back until we have enough money saved to open our own little eco resort in the mountains, so it will be some time. \n\nI had originally moved to CR in my mid twenties with $100 cash and a backpack, a pair of flip flops, a swimsuit, a pair or shorts and a couple of white t-shirts. I was a broke kid who decided that I would rather be broke on the beach than broke in the snow. It was the best decision I ever made.\n\nMoving back to NY was a horrible decision. But I did get a wonderful wife and a slew of children out of it. I just can't wait to move back and raise my kids in the jungle, far far away from all the BS that's going on daily in the United States. I hate it here.",
                            "score": 9,
                            "author": "buffalogoldcaps"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did do this for a year.\n\nA lot of people thought I was crazy.\n\nWife and I had just sold a house and were looking for a new one.  Our stuff was in storage.  It was 2005 so the housing market was insane before the crash.\n\nWe did not want to sign a lease on a new place in case we found something.  We did not want to move our stuff out of storage then back in.\n\nWe found a residence inn near the neighborhood where we wanted to live.  The long term rent (minimum 3 months, but still cancelable with 24 hours notice) was only about 20% more than a comparable apartment.  It was two bed, two bath, utilities, housekeeping, furnishings, repairs, cable TV, internet, and breakfast all included...and still I could check out at any time.\n\nTook us a year to find a place, closed, moved our stuff in, and checked out.\n\nFunny thing is, while we were staying there, we actually went on vacation!  We kept paying the room because we did not want to risk getting a different room when we came back (and reset the three month discount clock).\n\nWe also have lifetime status with that chain and for the year after, I got the greatest looks from hotel staff when I checked in, because I had the absolute highest status and many had never seen that before.\n\nOne time I went to a newer hotel in the chain, hotel was new and the staff was new.  Probably only open for a month.  I went to check in and said I think the travel agent forgot to add my member number to my booking (this was true, it was a last minute trip).  I gave my number... instant mini-chaos.  I could see the wheels turning and panic set in.  There were special ways they were supposed to greet me l and weird stuff like that which I did not care for anyway.  I told her, it is okay, just give me the extra points for the award and I will go up to my room.  I think she was supposed to offer me an upgrade room but I had already checked in, and was traveling alone anyway, so I did not care.",
            "score": 1043,
            "author": "haemaker",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long ago was that? With the rollout of Bonvoy, did you lose that status, since they now have annual status maintenance requirements of 100 nights or $26000 for top status, or were you grandfathered in?\n\nEdit: wow I'm dumb. You said 2005 in your comment. Yeah so you probably lost your status now. :⁠-⁠(",
                    "score": 233,
                    "author": "wsc-porn-acct",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When Starwood Starpoints switched to Bonvoy (I forgot when) we didn't lose a single point! Our at the time travel agent took care of it. It was nice to be hands off, and have this transition seem smooth and easy.",
                            "score": 88,
                            "author": "londonschmundon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "time travel agent? i need to get one of those!",
                                    "score": 52,
                                    "author": "emosy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha ha, maybe I should edit in dashes. But I'd like one of those too!",
                                            "score": 19,
                                            "author": "londonschmundon"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I meant the annual upkeep requirements versus having perpetual benefits. I wasn't implying anything was lost at the transition.",
                                    "score": 5,
                                    "author": "wsc-porn-acct",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, gotcha",
                                            "score": 3,
                                            "author": "londonschmundon"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nope, Gold Elite, have not had a stay since 2018.\n\nThere was a time when I lost it for awhile while still Marriott, but then it came back.  Maybe Grandfathered in.  Not sure.",
                            "score": 25,
                            "author": "haemaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately that's mid-level now. Still has a lot of perks but there's much higher status. \n\nI had ambassador elite from 2017 to 2021. Loads of great perks but now I'm back to Platinum it's still good but not nearly as good",
                                    "score": 10,
                                    "author": "capecodcaper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Never had lifetime platinum only lifetime gold.  Most of the perks I want are there.",
                                            "score": 2,
                                            "author": "haemaker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah Life Time is basically a way for you to not loose ALL of your ranks due to not staying, but it still leaves you with lower ones in a permanent way, i think gold IS the second best though, before platinum.\n\nHope you enjoyed your stay, it most have been pretty comfy!",
                                                    "score": 3,
                                                    "author": "Victorinoxj"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Had a long term stay at the residence inn in DC back in 2015 for the military and ended up like 10 days short of lifetime silver status. I'm still salty about that.",
                                    "score": 7,
                                    "author": "Geodude532"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not even close to a year but I just relocated for a new job and they put me on in a Residence Inn for 90 days while I searched for a house as part of the relocation package.\n\nIt got a little tiring by the end but it was nice to have a few months of just not caring about cleaning, breakfast was meh but it was always there for free no hassle, was a weird but interesting period lol.\n\nAnd it had a full fridge+oven+dishwasher so that was nice.",
                    "score": 57,
                    "author": "peon2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what’d do it for me. No cooking breakfast, no cleaning, no stress. I’d love this honestly 😂",
                            "score": 12,
                            "author": "Feeling-Football5604"
                        },
                        {
                            "level": 2,
                            "comment": "Washing machine though? I only stay in hotels with in unit WD now. Packing enough clothes to get by with no WD suuuuucks when you have little kids.",
                            "score": 2,
                            "author": "milkandsalsa",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I could check out at any time.\n\nBut you could never leave...",
                    "score": 226,
                    "author": "fnuggles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Such a lovely place",
                            "score": 35,
                            "author": "Other-Crazy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mirrors on the ceiling",
                                    "score": -3,
                                    "author": "andi-amo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He did say people thought they were crazy….",
                            "score": 4,
                            "author": "irrational_design"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; A lot of people thought I was crazy.\n\nHey, if it seems crazy but it works, it's not crazy.",
                    "score": 37,
                    "author": "V9N3SS9"
                },
                {
                    "level": 1,
                    "comment": "Why would someone think you are crazy for living rent free? /s",
                    "score": 9,
                    "author": "SwampOfDownvotes"
                },
                {
                    "level": 1,
                    "comment": "Could you have continued living there forever? If not, what would be the reasons?\n\nThanks for sharing!",
                    "score": 5,
                    "author": "Hefty-Wrongdoer6282",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now it would not be as economically feasible.  Also, it feels even less like \"your space\" in a hotel rather than renting.\n\nI live in an area where home ownership is an extremely good investment.   So, I would be leaving a lot of money on the table doing that.",
                            "score": 3,
                            "author": "haemaker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you kindly for your biography sir.",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for listening to my TED talk.",
                            "score": 2,
                            "author": "haemaker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For free rent, I'd live in a pod.",
            "score": 271,
            "author": "cuphead_holder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Limited time offer: sleeping pod, endless nutrient pellets, and limitless water on tap- all for the low price of FREE!*\n\n*Participant must agree to advertisements broadcast into their brain.",
                    "score": 95,
                    "author": "goatfuckersupreme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If there is a bathroom with unlimited toilet paper or a bidet &amp; a bathtub &amp; unlimited soap &amp; I am allowed to leave or I have internet access &amp; can talk to the outside world I would do that happily.",
                            "score": 21,
                            "author": "NotATrollSerious"
                        },
                        {
                            "level": 2,
                            "comment": "Large exercise wheel available.",
                            "score": 15,
                            "author": "ReporterOther2179",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly I’m surprised this hasn’t taken off more. I’m like I just need a room with a shower, toilet and some power.",
                    "score": 14,
                    "author": "RedSonGamble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the Netherlands they've built complexes of shipping container apartments, for university housing",
                            "score": 12,
                            "author": "chairfairy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Definitely suffice for me and so much money saved for later",
                    "score": 7,
                    "author": "itsastart_to"
                },
                {
                    "level": 1,
                    "comment": "Yeah, idk why this is even a question lol. Where I currently work, I have free accommodation, no bills and a car to use for free, the apartment is tiny but there's no way in hell complaining about it would even cross my mind lol",
                    "score": 2,
                    "author": "pseudoportmanteau"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can live off delivery, microwave food and instant noodles cooked with the kettle. So yes I'd happily live in a hotel room",
            "score": 237,
            "author": "LowBottomBubbles",
            "replies": [
                {
                    "level": 1,
                    "comment": "As some one who has often had to live in hotel rooms for work trips (often in tiny towns with little amenities) you can easily keep a toaster oven in a hotel room too if you want to cook actual food. The nicer ones are functionally just small ovens. You can easily get a portable stovetop too (I’ve seen coworkers do so)\n\nYou aren’t making giant 4-course dinners but you can still easily make yourself meals. And that’s if you aren’t ‘cheating’  the question and just getting yourself a kitchenette hotel room",
                    "score": 88,
                    "author": "-GregTheGreat-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;The nicer ones are functionally just small ovens.\n\nEven better than that, the nicer ones are generally convection ovens (with fans,) which cooks things a lot faster since they're not limited to natural convection currents to move the heat around.  Since that's all an \"air fryer\" is, that single toaster oven is now a toaster, oven, and air fryer.",
                            "score": 19,
                            "author": "JJHall_ID"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just need an air fryer, slow cooker and grill with hob ring on top. \n\n\nMaybe a waffle maker.  \n\nAnd a desk top dishwasher.....",
                    "score": 22,
                    "author": "Gertrudethecurious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Black and decker toaster ovens now can be bought with an air fryer in them and a basket",
                            "score": 10,
                            "author": "notlikelyevil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a sexy little thing but it's more expensive than a full size oven!",
                                    "score": 2,
                                    "author": "Gertrudethecurious"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uh. Do I get to keep my existing house, or am I suddenly and permanently dependent on someone else’s good will?",
            "score": 21,
            "author": "beobabski",
            "replies": [
                {
                    "level": 1,
                    "comment": "It doesn't say you have to quit your job or sell your possessions or anything. Rent out your house or something.",
                    "score": 11,
                    "author": "IdealDesperate2732"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As long as it has a pool or a hot tub. I can do most of my hobbies in a motel room or put in a storage unit.",
            "score": 57,
            "author": "Henchforhire"
        },
        {
            "level": 0,
            "comment": "what the fuck are these questions\n\n\"if you were able to have all your expenses paid, would you?\"",
            "score": 46,
            "author": "castleclouds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. They're really testing out the subreddits title.",
                    "score": 11,
                    "author": "uwuskskskkk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends on how big hotel room are we talking about. Lot of hotel rooms are smaller than my appartment, but there are also lot of bigger ones.",
            "score": 120,
            "author": "blackwe11_ninja",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah this is key information. Hard no if I have to live in a single small hotel room with just a bed, TV and desk! Might consider it if it’s a suite style set up and I can have a living room with a door that shuts between the bedroom.",
                    "score": 27,
                    "author": "Responsible-Walrus-5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP, square footage??",
                            "score": 2,
                            "author": "sirhandstylepenzalot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I can pick the hotel sure, if I have to sign up and take whatever you give me, no thanks.",
            "score": 12,
            "author": "Secretnaughtycouple"
        },
        {
            "level": 0,
            "comment": "INFO: Would I have approximately the same square footage (so I could take most of the things I’d want, which is like half of the crap I currently have)? Would it be in the same city (or one of my choice)? For how long?",
            "score": 57,
            "author": "Hefty-Wrongdoer6282",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, average sized hotel room which is pretty small. Same city. Forever.",
                    "score": 11,
                    "author": "oby100",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hotel rooms usually dont have kitchens and you kinda need a kitchen to sustain yourself. If food was provided as well with the hotel room, yea sure, you would save so much money",
            "score": 47,
            "author": "h0rny3dging",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some hotels with suites do have kitchens or at least kitchenettes, like a Homewood Suites. But the opportunity cost is that your spending for rent and utilities are eliminated, so you can eat our and order in more while still saving more than you were before.",
                    "score": 16,
                    "author": "Bludandy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Regardless, it's still cheaper to cook in than eat out everyday. Just for the health reasons I'd personally want to make sure it's a room with a kitchenette or something at least.\n\nBesides suits, there are hotels with long stay options and those usually have kitchens. But I'm also pretty sure the long stay ones don't come with a cleaning service.",
                            "score": 5,
                            "author": "UnNumbFool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tRegardless, it’s still cheaper to cook in than eat out everyday. \n\nBut it’s even cheaper to not pay rent than it is to pay it",
                                    "score": 2,
                                    "author": "kurtanglesmilk",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But you would get free breakfast for life!",
                    "score": 34,
                    "author": "Adventurous-Job647s3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Incontinental breakfast?",
                            "score": 17,
                            "author": "CharlieShyn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Incontinental\n\nNot sure what that word means.",
                                    "score": 15,
                                    "author": "Adventurous-Job647s3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its an obscure reference to a Key and Peele sketch, the real word is continental breakfast. And being incontinent mean you cant hold ur poops i think.",
                                            "score": 14,
                                            "author": "CharlieShyn"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Incontinentia ....buttocks!",
                                    "score": 5,
                                    "author": "its_bununus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pratchett right?\n\nEdit, nvm, hope mr. DICKUS is allright",
                                            "score": 2,
                                            "author": "CharlieShyn"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Everything is free man. You’ll have bucket loads of spare money every month. Surely you could fix the food problem with a combination of buying some small appliances for use in the hotel room (electricity is free, go nuts) and going out to eat, etc. Someone else will even clean up after you. \n\nSign. Me. Up.",
                    "score": 7,
                    "author": "CoffeeHQ"
                },
                {
                    "level": 1,
                    "comment": "Most hotel rooms at least have a microwave so as long as you bought a mini fridge that came with a freezer and didn't mind eating frozen dinners every day, it's manageable.",
                    "score": 4,
                    "author": "gate_of_steiner85"
                },
                {
                    "level": 1,
                    "comment": "If breakfast was included then I'd only be eating dinner. The money saved I'm sure could go towards nice takeaway.",
                    "score": 3,
                    "author": "Cyberprog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived long-term in hotels in several different countries including the US, for anywhere from six months to a year, due to my employment. I found hotel living to be really relaxing. Having less “stuff“ to worry about was a nice change of pace. I also didn’t keep much in the way of personal items with me at the hotel, other than clothes, and lightning that load was also oddly freeing. Luckily, my hotel rooms were always quite nice, though not very large or in super grand hotels. All had at least a microwave and sink for cooking, and a small refrigerator. Having a house keeping was really great. My biggest problem living long-term in a hotel was the lack of laundry facilities in some of the residences.",
            "score": 10,
            "author": "msmickimac"
        },
        {
            "level": 0,
            "comment": "only if i can keep my cat, smoke copious amounts of cannabis products, and play my stereo and electric guitar as loudly as i can in my current apartment which has concrete walls.",
            "score": 7,
            "author": "dubkitteh1"
        },
        {
            "level": 0,
            "comment": "I'd pay double to not have to share a hotel room with my two young children.",
            "score": 20,
            "author": "CLG91",
            "replies": [
                {
                    "level": 1,
                    "comment": "$0 x 2 = $0.. math checks out",
                    "score": 11,
                    "author": "kingeryck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I didn't have the kids and a mortgage? Fuck yes.",
            "score": 4,
            "author": "DangerMacAwesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've got 3 kids and no money. Why can I have no kids and three money??",
                    "score": 6,
                    "author": "kingeryck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And a free hotel room?",
                            "score": 3,
                            "author": "DangerMacAwesome"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depending on the Hotel. What about roaches? Cleanliness? Location..is there a place to eat nearby, a safeway, a target, CVS or Walmart close by? Are there any amenities? A gym, a POOL, a hot tub?",
            "score": 4,
            "author": "Lazy-Lawfulness3472"
        },
        {
            "level": 0,
            "comment": "suite life of zach and cody? Damn right",
            "score": 18,
            "author": "_Dingaloo"
        },
        {
            "level": 0,
            "comment": "Depends, what's the quality of the hotel? A rat motel, no way. But a modest hotel, oh absolutely",
            "score": 15,
            "author": "thatonechick172"
        },
        {
            "level": 0,
            "comment": "While working with high net worth investors, I met an interesting man who checked into a hotel 30 years ago and never left. \n\nHis housekeeping and utilities are covered, he enjoys complimentary breakfast every morning and he gets comps when he travels around the world. He made a deal with the hotel where he pays monthly. Works brilliantly for him",
            "score": 3,
            "author": "Krispyhat420"
        },
        {
            "level": 0,
            "comment": "I'd live in Silent Hill at this point to get away from rent and utilities.",
            "score": 3,
            "author": "lovefeast"
        },
        {
            "level": 0,
            "comment": "It's free? What is there to decide",
            "score": 3,
            "author": "Thatsayesfirsir"
        },
        {
            "level": 0,
            "comment": "I mean, if I can modify the room to my liking, yes",
            "score": 3,
            "author": "Leneord1"
        },
        {
            "level": 0,
            "comment": "Yes, I don't need much, a bed kitchen,bathroom, and internet.",
            "score": 3,
            "author": "Khfreak7526"
        },
        {
            "level": 0,
            "comment": "A year living in a hotel would save me about 20k dollars. So… if it was a nice hotel room, yes. I’d save that money and be a year closer to being able to buy a house.",
            "score": 3,
            "author": "medren37"
        },
        {
            "level": 0,
            "comment": "The army has many new officers do that while they are at their initial training. Mine was a skosh over 4 months. \n\nIt gets annoying, from a “I accept the privilege” point of view. All you have is a hot plate and a microwave, and a tiny refrigerator. \n\nBut in a much bigger sense, we didn’t have to worry about rent, maintenance, or utilities, so we could focus on training. That was nice for sure. Much more than 4 months would be bad I think.",
            "score": 3,
            "author": "Amster_damnit_23"
        },
        {
            "level": 0,
            "comment": "If living in the hotel also means free food in their restaurant, than sure.",
            "score": 10,
            "author": "TheWardenDemonreach"
        },
        {
            "level": 0,
            "comment": "Yes for sure! \n\nAs long as I can bring my cat!",
            "score": 8,
            "author": "hellnahandbasket7"
        },
        {
            "level": 0,
            "comment": "Nope.\n\nI'm a country gal, and living in a hotel is kinda the opposite of living in the country.",
            "score": 10,
            "author": "concentrated-amazing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tents are rent free too",
                    "score": 9,
                    "author": "fnuggles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True. Not great at temperature control though.",
                            "score": 7,
                            "author": "concentrated-amazing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fantastic temperature control, its just not you that controls it",
                                    "score": 8,
                                    "author": "MountainCourage1304",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Temperature control a more important to me that most people. I have MS, and I have heat sensitivity (common with MS) and very little ability to sweat (more rare) as a result of it.",
                                            "score": 2,
                                            "author": "concentrated-amazing",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Country gals make do.",
                    "score": 3,
                    "author": "kingeryck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have done this to a point but still had to pay for the food for nearly 6 months instead of being basically homeless(long story). It's pretty nice really, other than having to pay for the room, which wouldn't be the case in your scenario, I had nothing to worry about. It was a basic room with bed, TV, kettle with free coffee and tea, and a bathroom with shower, toilet, sink. So no fridge so I could have proper milk in my hot drinks and bowl of cereal in the morning which sucked but I just went out and bought other ready made food out or takeaway for other meals. It isn't cheap to do it this way as no kitchen or fridge means you can't store or prepare other food. I did my clothes washing at a local store which had the machines outside. They cost about £30 for a 20kg load washed, dried with soaps and softners. \n\nOverall, I wouldn't have a problem being in this situation again but I'm single with no kids so that makes my situation a lot simpler than others",
            "score": 2,
            "author": "-Boole-"
        },
        {
            "level": 0,
            "comment": "I've never stayed in a hotel room smaller than the room I live in currently. I think I could manage.",
            "score": 2,
            "author": "Gabibaskes"
        },
        {
            "level": 0,
            "comment": "Absolutely, that's a shitload of money saved. But it kind of depends on the hotel and the other guests staying in there. There's a big difference between say a Quality Inn and an Embassy Suites. If we're talking any Four Star or better hotel, that's better living arrangements than most people will ever have. Plus you also get free security, pool, workout room, guest office center, breakfast, and usually most hotels come with streaming services provides provided as well as decent enough internet.\n\nThis is only a downside for those with detached homes or lots of land.",
            "score": 2,
            "author": "Bludandy"
        },
        {
            "level": 0,
            "comment": "Suite life of Zack and Cody.",
            "score": 2,
            "author": "Yet_Another_Paranoid"
        },
        {
            "level": 0,
            "comment": "As a temporary means to save money  I think I would, but it’s not definite. Aside from the free housekeeping, this is what living with my parents was like, but that wasn’t enough to stop me from wanting a better place with more room that I have to pay for.",
            "score": 2,
            "author": "kamekaze1024"
        },
        {
            "level": 0,
            "comment": "Hell yeah. Spend so much less money and can still enjoy life.",
            "score": 2,
            "author": "needs_more_yoy"
        },
        {
            "level": 0,
            "comment": "YES!",
            "score": 2,
            "author": "Trust_Fall_Failure"
        },
        {
            "level": 0,
            "comment": "Yes. My stuff would fit, I'd get extra locks and I'd get takeout with that saved rent and utilities money.",
            "score": 2,
            "author": "SoundTight952"
        },
        {
            "level": 0,
            "comment": "depends, is it the Stanley Hotel?",
            "score": 2,
            "author": "popeh"
        },
        {
            "level": 0,
            "comment": "It would be a significant downgrade from what I have now, but I'd definitely take that offer (dunno about my husband and kid, or my pets though) \n\nI would stay until I had enough to move onto property with enough land for me to garden and farm",
            "score": 2,
            "author": "Live-Paramedic-353"
        },
        {
            "level": 0,
            "comment": "This is the most obvious yes of my life. Of course I don't have a family so that's why. People with kids would of course find this way harder and im assuming the OP is a parent.",
            "score": 2,
            "author": "gvon89"
        },
        {
            "level": 0,
            "comment": "fuck yes.",
            "score": 2,
            "author": "awesomeroy"
        },
        {
            "level": 0,
            "comment": "For sure. I don’t even like to cook so I don’t need a kitchen or anything. As long as I have a mini-fridge for snacks and drinks and a good wi-fi connection, I’m set.",
            "score": 2,
            "author": "Yollm"
        },
        {
            "level": 0,
            "comment": "I lived in the Econo lodge in Farmington NM for about 4 months back in 98. I had just graduated college and got an engineering job with Halliburton that paid a ridiculous amount plus a housing stipend but there wasn’t any short term leases in town. I ate out for basically every meal.  As a 22 year old, I thought I had cracked the code.",
            "score": 2,
            "author": "Chitown_mountain_boy"
        },
        {
            "level": 0,
            "comment": "Yes.",
            "score": 2,
            "author": "Claque-2"
        },
        {
            "level": 0,
            "comment": "Yep.",
            "score": 2,
            "author": "Allcyon"
        },
        {
            "level": 0,
            "comment": "I live in a hotel room so yes!!!!!",
            "score": 2,
            "author": "melysechoes2016"
        },
        {
            "level": 0,
            "comment": "That's what I'm doing right now.\nTbh it sucks.  I miss my home and my family",
            "score": 2,
            "author": "lvndr131"
        },
        {
            "level": 0,
            "comment": "I've always liked a hotel room more than a house anyway",
            "score": 2,
            "author": "Ok-Bodybuilder-5723"
        },
        {
            "level": 0,
            "comment": "Sure. I have questions. Any hotel room, or just one? Can I move?",
            "score": 2,
            "author": "K_Sleight"
        },
        {
            "level": 0,
            "comment": "Depends on the hotel and the location. If it has roaches, nope.",
            "score": 2,
            "author": "noweirdosplease"
        },
        {
            "level": 0,
            "comment": "For sure. It would still probably be bigger than my place",
            "score": 2,
            "author": "PM_me_coolest_shit"
        },
        {
            "level": 0,
            "comment": "Absolutely. You’d have a ton more money.",
            "score": 2,
            "author": "TheHolliday1"
        },
        {
            "level": 0,
            "comment": "Sure, if I can bring my cats.",
            "score": 2,
            "author": "TheSaltRose"
        },
        {
            "level": 0,
            "comment": "One hundred percent.",
            "score": 2,
            "author": "CloudyCreek"
        },
        {
            "level": 0,
            "comment": "Sign me the duck up",
            "score": 2,
            "author": "Minute-Mountain7897"
        },
        {
            "level": 0,
            "comment": "I would. I'm not sure my wife and kids would agree though.",
            "score": 2,
            "author": "mymumsaysno"
        },
        {
            "level": 0,
            "comment": "How many people share the room? Councils sometimes house entire families with young children in a single hotel room and no amount of money would make me want to live like that. I've also heard of strangers being forced to share which is clearly a safety issue.",
            "score": 2,
            "author": "HoundParty3218"
        },
        {
            "level": 0,
            "comment": "Already living rent free. Im a student in finland 😊",
            "score": 2,
            "author": "AvesOfPrey"
        },
        {
            "level": 0,
            "comment": "Only if my doggy can come!!!!!!!!",
            "score": 2,
            "author": "Top_Self_8032"
        },
        {
            "level": 0,
            "comment": "There is a reason some people do this exact thing. By the numbers:\n\nIf rent is, say, $1700/month (average nationally), and utilities are another $250 (national average), that's $1950/month right there, or $65/day.\n\nAdd free housekeeping, maintenance, etc. for another, let's say, $250 per month. Also, if the hotel has a pool and a gym, add another $75 for those two things.\n\nPlus, hotels are usually located far closer to the middle of a town than houses are, so you are within walking distance of most places. If you are smart about buses and trams and stuff, no need for a car, so take off car maintenance and gas costs (that's like $300/month right there). and you've probably got a average monthly savings of roughly $400, including oil changes and the yearly maintenance that costs like $700. \n\n&amp;#x200B;\n\nSo far, we're at around $2675/month, or $89.50/day, which is approaching the lower end of hotels. (I've stayed at budget hotels/motels that are as low as $55/night, but I would not live there.)\n\nBut it keeps going. If the hotel has a free breakfast like most do, that's 1/3 of your daily meals taken care of. The average monthly food cost is around $400 for one person, so 1/3 of that is around $133. \n\nThat brings us to around $2811, or $93.7/night. The fancy 3-star hotel I stayed in overlooking the Arch was $160/night.\n\nBut we are still missing some things: namely, discounts. Any hotel worth it's salt will have a rewards program for frequent stayers. You would be surprised how quickly you accumulate points.\n\nOne final thing: In most states, you are legally a tenant after a specified time period of continual occupancy with no attempts to evict. So if you stay in a hotel room for a month or two, you are legally no longer a guest who can be kicked out at will. You are, in essence, a daily renter of an apartment.",
            "score": 2,
            "author": "Particular-Cry-778"
        },
        {
            "level": 0,
            "comment": "If I was single, I totally would.\n\nWith my family, we would need a suite.",
            "score": 2,
            "author": "IncredulousPulp"
        },
        {
            "level": 0,
            "comment": "You guys have your own appartment/house?",
            "score": 2,
            "author": "Jaffiusjaffa"
        },
        {
            "level": 0,
            "comment": "If I was single? In a heartbeat. I’d do it for a year or two and save every cent I could.",
            "score": 2,
            "author": "SapperMotor"
        },
        {
            "level": 0,
            "comment": "Junior suite or bigger, pet friendly and with a private outdoor space, sure.",
            "score": 4,
            "author": "EskayMorsmordre"
        },
        {
            "level": 0,
            "comment": "fucking absolutley",
            "score": 3,
            "author": "Karlor_Gaylord_Cries"
        },
        {
            "level": 0,
            "comment": "Why do people constantly post/ask things like this if they have neither the intention nor even the ability to bring such a situation to fruition? I'm not trying to be a jerk, I just literally can't see the point in such posts.\n\nThat said, my answer is yes, most certainly, especially if I had my gaming console and a library/collection of books.",
            "score": 3,
            "author": "Melodic_Necrotic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remove the fact it says free and it's pretty possible. There are plenty of long stay options at a lot of hotels, and they do come with kitchens. Granted I don't think they come with cleaning staff, and it's probably more expensive than a lot of people's rent but still.\n\nBut, realistically this is a reason there's actually a legitimate population of retirees that wind up living on cruise ships year round. They get free food and all their needs taken care of for them, as it's usually just as expensive as a retirement home.",
                    "score": 5,
                    "author": "UnNumbFool"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will there be hookers and beer? Then yes.",
            "score": 2,
            "author": "1959Chicagoan"
        },
        {
            "level": 0,
            "comment": "Depends if I'm allowed to smoke in the room. Being able to smoke at home is kinda a deal breaker for me",
            "score": 2,
            "author": "Slambodog",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No. My family wouldn’t fit in a hotel room.",
            "score": 1,
            "author": "TheHappiestJew"
        },
        {
            "level": 0,
            "comment": "No, I only just moved into my house and a hotel room wouldn't cut it. Besides I don't have to pay rent anyway, I only pay for utility costs since my Mom is the actual owner of this house. She inherited it from Granny",
            "score": 0,
            "author": "MrsWhiterock"
        },
        {
            "level": 0,
            "comment": "Yes, but I think I have to go to Mexico first and then cross the southern border in El Paso.",
            "score": 0,
            "author": "Jomarble01",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There is a big drawback to this you have to be on call 24/7",
            "score": -1,
            "author": "ReapersRealms"
        },
        {
            "level": 0,
            "comment": "Sure.  It wouldn't be permanent but I could save about $4k/mo doing that.",
            "score": 1,
            "author": "BusyLight32"
        },
        {
            "level": 0,
            "comment": "Oh yes.",
            "score": 1,
            "author": "robbiesac77"
        },
        {
            "level": 0,
            "comment": "All sorts of depends . .   \nhow close to various services, libraries ( etc . . . )  \ndoes this room come with free WiFi ?  \nis it in a good neighborhood, or am I likely to be mugged if I go for a walk?",
            "score": 1,
            "author": "MenardGKrebbz"
        },
        {
            "level": 0,
            "comment": "Depends on what hotel we are talking about. I probably would considering I'd get free breakfast for life.",
            "score": 1,
            "author": "Adventurous-Job647s3"
        },
        {
            "level": 0,
            "comment": "Hm. Are we talking just a room with a bed and private bath, or one of those full en suite that's basically a studio apt?\n\nI mean, maybe. My only concern is that I'd be forced to eat out constantly. But yeah, I'd probably take it.",
            "score": 1,
            "author": "mayflyDecember"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Cautious-Tell8625"
        },
        {
            "level": 0,
            "comment": "What's the catch?",
            "score": 1,
            "author": "gundi_salvus"
        },
        {
            "level": 0,
            "comment": "uhm i would stay in a motel 6 room for this deal",
            "score": 1,
            "author": "Reasonable_Praline_2"
        },
        {
            "level": 0,
            "comment": "Depends where in the world that would be.",
            "score": 1,
            "author": "Signal_Tomorrow_2138"
        },
        {
            "level": 0,
            "comment": "YES",
            "score": 1,
            "author": "IGoThere4u"
        },
        {
            "level": 0,
            "comment": "Depends on the location of the hotel and the size of the room/suite.",
            "score": 1,
            "author": "FlamingPileOfKidneys"
        },
        {
            "level": 0,
            "comment": "Fuck yeah.",
            "score": 1,
            "author": "DarkManifolds"
        },
        {
            "level": 0,
            "comment": "Spent 3 months in a hotel for work. Sucked not being able to cook though but I could do it.",
            "score": 1,
            "author": "fuck_me_in_the_ear"
        },
        {
            "level": 0,
            "comment": "Hey mom, when did you get a hotel???",
            "score": 1,
            "author": "Flaky_Tumbleweed3598"
        },
        {
            "level": 0,
            "comment": "Oh absolutely",
            "score": 1,
            "author": "LovesickInTheHead"
        },
        {
            "level": 0,
            "comment": "Without a second thought",
            "score": 1,
            "author": "TokiDoki30"
        },
        {
            "level": 0,
            "comment": "As long as I can bring my crockpots (I have two lol) and my instapot, my boyfriend and our laptops, sure. Only downside is I work from home",
            "score": 1,
            "author": "angeldestler08"
        },
        {
            "level": 0,
            "comment": "If the hotel room had appliances than hell yeah",
            "score": 1,
            "author": "keylo-92"
        },
        {
            "level": 0,
            "comment": "Do I get to bring my cat?",
            "score": 1,
            "author": "brak-0666",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Depends on who else is living in the hotel.   If it was good people and safe and you are single... why not?",
            "score": 1,
            "author": "EternallyImature"
        },
        {
            "level": 0,
            "comment": "Only if I get to bring my cat. If he's not going, I'm not going.",
            "score": 1,
            "author": "Nirane_Seyyi"
        },
        {
            "level": 0,
            "comment": "Depends on the condition of the hotel ppl do weird things in those",
            "score": 1,
            "author": "Tricky_Particular833"
        },
        {
            "level": 0,
            "comment": "depends on size",
            "score": 1,
            "author": "UnableLocal2918"
        },
        {
            "level": 0,
            "comment": "Why would I live in a hotel instead of the free living house?",
            "score": 1,
            "author": "Z_a_l_g_o"
        },
        {
            "level": 0,
            "comment": "I'll take the room any day of my life. Imagine how many things you can do with your rent and utilities money.",
            "score": 1,
            "author": "lobsangr"
        },
        {
            "level": 0,
            "comment": "When I was single I lived in a bachelor apartment. Basically like a hotel room but with a kitchen.",
            "score": 1,
            "author": "songinheart17"
        },
        {
            "level": 0,
            "comment": "Do I get to pick the hotel?  I've seen hotels with Maseratis parked in front, and I've seen hotels with hookers parked in front.  So as long as I get to choose, where do I sign up?",
            "score": 1,
            "author": "Plus_Share_6631"
        },
        {
            "level": 0,
            "comment": "LOL, yes.",
            "score": 1,
            "author": "44035"
        },
        {
            "level": 0,
            "comment": "An average 4 Star room, Absolutely! Not having to clean or worry about fixing anything, while having a small space to come and sleep?\" Yup! 100%   \n\n\nI don't spend much time at my own place, so it matters not the size or whether I own it or not.",
            "score": 1,
            "author": "Last_Eggplant3277"
        },
        {
            "level": 0,
            "comment": "Sure, I love hotels",
            "score": 1,
            "author": "Recent_Literature_22"
        },
        {
            "level": 0,
            "comment": "100%",
            "score": 1,
            "author": "RedditUserCommon"
        },
        {
            "level": 0,
            "comment": "baby i will live anywhere rent free",
            "score": 1,
            "author": "hhunterholmm"
        },
        {
            "level": 0,
            "comment": "Absolutely! I'd be saving over 2500 a month so yes please lol",
            "score": 1,
            "author": "kryotheory"
        },
        {
            "level": 0,
            "comment": "YES!",
            "score": 1,
            "author": "LoadOk5992"
        },
        {
            "level": 0,
            "comment": "No. I have to much stuff",
            "score": 1,
            "author": "Sellier123"
        },
        {
            "level": 0,
            "comment": "As a single man, absolutely yes.  Currently I own a 4 bedroom house and have a wife and 2 kids.  So hotel living isn’t really on the table.",
            "score": 1,
            "author": "Ranch-Boi"
        },
        {
            "level": 0,
            "comment": "Penthouse yes, hotel room no",
            "score": 1,
            "author": "myownfugacious"
        },
        {
            "level": 0,
            "comment": "If it's a decent size in a 5-star and I can have my pets, a place to walk them (or have a dog walker) a safe and free room service or a hot plate, mini fridge and microwave and a place to wash my clothes sure.",
            "score": 1,
            "author": "Southern-Comb-650"
        },
        {
            "level": 0,
            "comment": "I went to high school with someone who's dad was general manager of a fancy hotel and they lived at the hotel in basically a large apartment. I think they eventually bought a house and moved out of the hotel but and whatever age we were at the time living in a hotel seemed like a cool thing.",
            "score": 1,
            "author": "Numerous_Program1060"
        }
    ]
}