{
    "id": "148grns",
    "score": 11,
    "title": "What is a paradox?",
    "author": "Mangothunder777",
    "date": 1686666635.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148grns",
    "media_urls": [],
    "other_urls": [],
    "postText": "English was not my first language but I know it very well I’ve done all my schooling in English however I can’t fully grasp the concept of a paradox. I asked Siri to give me an example of a paradox and I got “I always lie” is a paradox. How so? can someone explain this to me",
    "comments": [
        {
            "level": 0,
            "comment": "Follow the logic on that. If Siri always lies, then saying “I always lie” is a lie. That means she’s always honest. And if she’s always honest then she can’t lie about lying. There’s no logical way for this statement to be true one way or the other.",
            "score": 30,
            "author": "fullmetal_yogi",
            "replies": [
                {
                    "level": 1,
                    "comment": "So if Pinocchio were to say “My nose will grow now!”, he’s created a paradox.",
                    "score": 7,
                    "author": "02K30C1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg that was so helpful!!",
                            "score": 1,
                            "author": "Mangothunder777"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's kind of bad though because there's an out of \"sometimes lying\".  It's not a great example.  I always lie being false could merely mean I sometimes lie.",
                    "score": 7,
                    "author": "Ghigs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, the paradox is supposed to be \"this statement is a lie\", I believe. It gets rid of the sometimes issue.",
                            "score": 7,
                            "author": "iMogwai"
                        },
                        {
                            "level": 2,
                            "comment": "\"The following statement is true\"\n\n\"The previous statement is false\"",
                            "score": 4,
                            "author": "Leader_Bee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ah, the classic Siri paradox - the ultimate mind-boggling mystery that will leave you questioning everything, including your own existence.",
                    "score": 2,
                    "author": "Time_Camera4298"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A paradox is basically a statement that contradicts itself.\n\n\"I always lie\" means that when I said \"I always lie\", I was lying. Which means I was telling the truth. Which means I was lying. Which means I was telling the truth. Which means I was lying. Etc, etc.",
            "score": 14,
            "author": "sterlingphoenix"
        },
        {
            "level": 0,
            "comment": "It's a contradiction that creates a loop.  Like \"this sentence is false\" is probably a better example.  If it's false then it's true, but it can't be true because it's false.",
            "score": 9,
            "author": "Ghigs"
        },
        {
            "level": 0,
            "comment": "A paradox is a statement that contradicts itself. “I always lie” is a paradox because, if that statement was true, then you always lie but that would mean that you told the truth with that statement and so you don’t always lie and so the statement would be false, which would mean that the statement is true and false so it’s a paradoxical statement.",
            "score": 4,
            "author": "Extra_Age2505"
        },
        {
            "level": 0,
            "comment": "A paradox is logically self-contradictory event. In even more simpler terms, a paradox is something that is true and false *at the same time.* Since true and false are opposites, it is logically impossible for both to occur at once, but in a paradox, that's what happens.\n\nThe most famous paradox is \"this statement is false.\" Let's say I accept the statement as true. In doing so, the statement has to be assumed false. It is true and false. Let's say I reject the statement and assume it is false. If I assume it is false, then the statement is actually true. It is false and true. Something cannot be true and false, or false and true, so a paradox occurs.",
            "score": 5,
            "author": "deep_sea2"
        },
        {
            "level": 0,
            "comment": "It is a statement or a concept that directly contradicts itself. \n\nA man in ancient Greece sells a spear and a shield: the spear he says will go through anything and is stopped by no material on earth. The shield he says is immovable and stops any object on earth. The concept of both of these things exiting as described is impossible, so he must be lying.",
            "score": 4,
            "author": "WesternWave0_0"
        },
        {
            "level": 0,
            "comment": "a paradox is something that cannot exist. a basic example is called the grandfather paradox. if you time travel and kill your grandfather before he has your parent, then you wouldn’t be alive to kill him, and then you would be alive.\n\nit can definitely be a confusing concept. saying “i always lie” is a paradox because if you DO always lie, then saying so would mean you are telling the truth, and therefore you don’t always lie",
            "score": 3,
            "author": "Femme-Angel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay Fry, lets get you back to the 31st century.",
                    "score": 4,
                    "author": "Jackel1994",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hey listen i didn’t fuck my grandma",
                            "score": 1,
                            "author": "Femme-Angel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This word is used in multiple languages. I can only assume that it means the same in all of those languages. \n\nAre you sure your language doesn’t have word paradox?",
            "score": 1,
            "author": "HVP2019"
        },
        {
            "level": 0,
            "comment": "If you always lie, and say you always lie, that means you are telling the truth, so you don't actually always lie, but it would assume that you are lying if you don't actually always lie, so you actually do always lie, but that means your statement isn't true etc..\n\nIt goes in a circle.\n\nIt's supposed to be confusing because paradoxes are impossible.",
            "score": 1,
            "author": "latsneo"
        },
        {
            "level": 0,
            "comment": "A paradox is a logical contradiction.\n\nIf siris statement is true(allways lies) then this statement (i allways lie) is false, because its a true statement and not a lie.",
            "score": 1,
            "author": "EveningSea7378"
        },
        {
            "level": 0,
            "comment": "It's a self-contradicting statement. If you can start from an affirmation, and then use deductive reasoning to reach the opposite of that affirmation. Then it's a paradox.\n\nSo when you say \"I always lie\", if that's true, that means you are saying the truth when you say \"I always lie\". So it's not a lie. So you don't always lie. So it's a valid paradox.\n\nMost paradox are just more or less disguised version of that same one. Like Pinocchio saying \"my nose will grow now\". If it's true, then it's false, and conversely.\n\n&amp;#x200B;\n\nThe word \"paradox\" is also used for time travel scenario, for a similar idea. It's when going back in time prevents the conditions that made it possible for that person to go back in time. You get a loop of causality that can't be solved. The most famous example of that would be \"Some guy goes back in time and kill their grandfather. So their grandfather doesn't have childs. So the guy is never born, and cannot kill the grandfather.\"",
            "score": 1,
            "author": "Andeol57"
        }
    ]
}