{
    "id": "148ic3m",
    "score": 2,
    "title": "Why do many people see food from countries like England, Norway, Sweden, Finland and such as \"bad\" cuisines?",
    "author": "WhoAmIEven2",
    "date": 1686670954.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148ic3m",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Traditional Northern European cuisine is influenced by the climatic conditions in the area. Historically it was hard to access fresh fruits and vegetables or spices during the long winter months. Many foods were canned or salted for preservation in the winter. \n\nThat’s no longer true, but many of the restaurants in Northern Europe use the availability of fresh fruits and vegetables and spices to serve traditional dishes from other countries. Thus you can now eat Italian, French, Indian, or Asian foods in London or Stockholm.",
            "score": 5,
            "author": "wjbc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure, but that doesn't really explain why people see it as \"bad\". It's still super tasty, well for me as a Swede at least. \n\nI can accept that it's limited, but it's when people equate limited to \"bad\" I get slightly annoyed.",
                    "score": 3,
                    "author": "WhoAmIEven2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s an overblown stereotype, I’ll grant you that. I’ve had great meals of traditional English of German food. But there’s not as much variety and even Englishmen recommended Indian restaurants in London or taking a quick trip to Paris to eat at world-famous restaurants.",
                            "score": 1,
                            "author": "wjbc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where's the variety in \"bury the meat under a pound of spices\"?",
                                    "score": 1,
                                    "author": "John_Sux",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's not how countries with lots of spices use them. Look at Indian recipes, for example. They put together lots of different combinations of spices. I just Googled a random recipe for chicken tikka masala and it calls for yogurt, garlic, ginger, garam masala, turmeric, cumin, Kashmiri chili and salt on the chicken and butter, onions, garlic, ginger, garam masala, cumin, turmeric, coriander, tomato puree, Kashmiri chili, red chili powder, salt, cream, brown sugar, and cilantro or coriander for the sauce.\n\nhttps://cafedelites.com/chicken-tikka-masala/",
                                            "score": 1,
                                            "author": "wjbc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How is that anything other than a pound of everything that's available, poured on top? Add a handful of curry per day the meat has rotted.  \n\nThis notion that more ingredients and more spices are what determines how good a dish is, is simple culinary elitism by the people that live in the best growing regions.  \n\nThese people want to taste spices, not the food itself. I want to taste those new potatoes and smoked salmon, not the dill and lemon pepper I dumped on top of it. That's bad, say these anti-northern types.",
                                                    "score": 1,
                                                    "author": "John_Sux"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "don't blame you for being annoyed.  nevertheless \"bland and limited\" is the probable straight-faced answer to your question.   \n\nfor Nordic cuisine anyway.   when it comes to the UK there may be other factors.  *she said tactfully*",
                            "score": 1,
                            "author": "Dazzling-Ad4701",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just can't accept that a bit of rotten meat buried in curry is somehow \"better\" than something \"bland\" like a smoked salmon with new potatoes. It's like the more spices you have the better your food is.",
                                    "score": 1,
                                    "author": "John_Sux"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because they haven't actually been to those countries and tried their food and as a result, they are going off pictures/memes.",
            "score": 4,
            "author": "TheWardenDemonreach"
        },
        {
            "level": 0,
            "comment": "Two words: pickled fish",
            "score": 2,
            "author": "Thequestionablemoon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for reminding me it's midsummer in less than two weeks. Can't wait for all the mustard herring!",
                    "score": 1,
                    "author": "WhoAmIEven2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "roll mops were my eat-the-whole-jar food as a kid.",
                            "score": 1,
                            "author": "Dazzling-Ad4701"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a combination of a few different things I think. \n\n1) Foods from that part of Europe are reputed to be cooked with few, if any, spices. People imagine unsalted and unseasoned breads and meats and fish. \n\n2) Some of the more famous foods from that part of Europe tend to involve fermentation of fish. Most people in other countries, like the U.S., are largely unfamiliar with fermented fish (except maybe in some sauces). Many people know that rotting fish smells bad and can cause illness, so people presume that fermented fish will likewise be smelly and foul. The reaction videos for surstromming reinforce this belief. Seriously, the majority of English-language videos that discuss Nordic food are gross-our videos; at best, the host says \"it's not as bad as I thought it would be.\" \n\n3) Some people presume that any culture that eats piss-soaked shark (hakarl), rotted fish (surstromming), jellified fish (lutefisk), and similar foods must have a really odd sense of what tastes good. So they naturally distrust claims about other, more approachable cuisine from the region. \n\n4) Some of the most approachable foods and food terms from these regions have been so widely adopted and enjoyed that people don't think of them as foreign foods. For example, I don't think many Americans know that the term Smorgasbord refers to a particular kind of meal; it's just used as a synonym for \"feast\" in the U.S. Likewise, lox is ubiquitous in American delis alongside bagels and corned beef and pastrami. If people in the U.S. think of their favorite deli foods, they are more likely to make the association with Jewish communities in New York than with a region in Europe. \n\n5) With the exception of some Jewish delis, Nordic chefs never really opened up shops in the U.S. (I can't speak for other places). This means the food that does make its way over to us has to compete with established dishes that fill roughly the same culinary niche. For example, the classic British meat pie competes with empanadas in the Americas as a whole and with Natchitoches meat pies on the Gulf Coast. The pastries and breads of the Nordic countries compete with ubiquitous French and Austrian breads and pastries. The deli meats of the UK and the Nordic countries compete with American BBQ and german-inspired hotdogs and hamburgers. \n\n6) Great Britain, and presumably other countries, actually did go through a period of terrible cuisine that began roughly around WW2. Rationing limited foods, and so cookbooks were distributed that contained rubbish recipes that prioritized nutrition over flavor. And there was one guy, I forget his name, who was involved in the cookbook project and who hated fresh vegetables for whatever reason. He advocated for excessive boiling of vegetables until they felt and tasted like sad mush; I vaguely recall it was down to his erroneous beliefs about the best way to extract nutrition from veggies. These cookbooks were standard fare for many households, so many people who visited friends or family in the UK would find very disappointing plates of food unless they went to a specialty shop. \n\n7) There are several famous chefs from the UK who are well known in the U.S., and they almost all cook french cuisine. It's not a great endorsement of the food and culinary tradition if you feel the need to cross an ocean channel to learn how to cook.",
            "score": 2,
            "author": "Justicar-terrae"
        },
        {
            "level": 0,
            "comment": "There is lots of great food in England, but it's all cooked by Asians. :)\n\nAmerican, and have been all over Europe and lots of other places, but the only European cuisines I'll actually look for are Italian and Greek.  The rest are edible, but just kind of dull to me. The best food I've had in Europe was a Pakistani restaurant in Frankfurt. :D",
            "score": -1,
            "author": "GEEK-IP",
            "replies": [
                {
                    "level": 1,
                    "comment": "False. Pork pie, steak and ale pie, chicken pie, steak and kidney pie, ( granted a lot of pies but can you really get sick of pies?) Fish and chips ( best from the sea side) roast dinner chicken or beef, trifle, apple pie, bread and butter pudding, apple crumble, \nSausage rolls, Good cheeses, ( bad fish I'll grant you)  \n\nNeed I reiterate Steak and ale pie.\nCornish pasty\nScones with cream and ham ( or jam and cream!)\n\n\nToad in the hole... a countless more I am forgetting.\nNone of which invented by Asian's\n( I do agree however They do do great food!, although partial to a Chinese)\n\nAlthough perhaps traitorous the Crapaud's do cuisine the best.",
                    "score": 1,
                    "author": "Thousandgoudianfinch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's because of stereotypes or memes, but I don't know the reason why these stereotypes or memes spread like wildfire. It can be both though.",
            "score": 1,
            "author": "FluidEntrepreneur309"
        },
        {
            "level": 0,
            "comment": "It's bland and the texture is mushy.",
            "score": 1,
            "author": "millac7"
        },
        {
            "level": 0,
            "comment": "Why did the Vikings plunder elsewhere?\n\nBecause their land SUCKED!",
            "score": 1,
            "author": "High-Powered"
        }
    ]
}