{
    "id": "148i1it",
    "score": 2,
    "title": "Do you think hitting one's kids is acceptable under any circumstances? Why, why not?",
    "author": "Mad_Season_1994",
    "date": 1686670157.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148i1it",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Nope. I think hitting anyone at any time is hardly _ever_ justified, let alone _children_.",
            "score": 11,
            "author": "sterlingphoenix",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a good answer here! Hitting other people is only justified if they both consent to a boxing match. Otherwise, no, don’t intentionally hurt people.",
                    "score": 6,
                    "author": "One_Hungry_Artist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. It’s proven to not be more effective than other methods.",
            "score": 6,
            "author": "TheHappiestJew"
        },
        {
            "level": 0,
            "comment": "As a child who was spanked I can say it has 100% no purpose. It didn’t teach me anything I just learned an asssociated pain for an action. \n\nIt wasn’t “i shouldn’t do this” it was “is this worth the beating”",
            "score": 6,
            "author": "zman245"
        },
        {
            "level": 0,
            "comment": "I mean, I'm sure we could contrive a really weird scenario in which I could agree that hitting would be justified (\"and the only way to get him off the train tracks is to smack him off just as the train gets there\", etc.) but, no, not as punishment/discipline/etc.",
            "score": 1,
            "author": "Various_Succotash_79"
        },
        {
            "level": 0,
            "comment": "Nope. \n\nIf you hit a stranger, that’s assault. \n\nIf you hit your partner, it’s domestic violence. \n\nIf you hit your dog, it’s animal abuse. \n\nSo why the FUCK do people think it’s okay to hit children?!?!? There are MOUNTAINS of evidence that show spanking doesn’t, AND it is bad for your relationship with the child and causes them long term harm. \n\nLook- if a child is too young to be reasoned with, they are too young to understand why you are hitting them. And if they ARE old enough to be reasoned with, WHY THE HELL WOULD YOU RESORT TO HITTING THEM?!\n\nNope. No good reason to spank.",
            "score": 1,
            "author": "ClickClackTipTap"
        },
        {
            "level": 0,
            "comment": "Nope…i was hit severely throughout my entire childhood. All it brought was trauma, resentment, insecurity and bitterness. And even those who promote hitting children aren’t aware that they themselves are callous and extremely narcissistic",
            "score": 1,
            "author": "Sharonfromhell"
        }
    ]
}