{
    "id": "148idl3",
    "score": 3,
    "title": "My dad died yesterday. Am I a horrible person for feeling nothing?",
    "author": "adt1129",
    "date": 1686671070.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148idl3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got a call from my sister yesterday, in tears, saying our dad had died. He apparently fell asleep and never woke up. \n\nA little background about my relationship with my dad. It was never good. He knocked up my mom and from what I understand, was a decent father for the first year of my life. But then he started using drugs. My mom wanted non of that so she ended things with him. My mom made me see him every other weekend. He lived with my grandparents and never really paid any attention to me. His parents were basically my dad. I did everything with them. \n\nIn the early 2000s, he got married. And this is where things really started to go downhill. What little attention I got from him was completely thrown out the window for his wife. She was a horrible person. She never wanted me there and told these things to my face. In their house, I had a room with a bed and that was it. No toys, no books, no anything. He didn’t physically abuse me by any means, but it was obvious to me, even at the time, that all he wanted to do was be with her and I was kind of in the way. I was over there because I had to be, not because he wanted me there. \n\nAs I got older, around 14 or 15, I was able to decide whether or not I actually wanted to go and I never did. He never called me or texted me asking how I was or showed any care. My sister and I made it clear how we feel about his wife, and how much we wanted to see him and do things with him. I was still willing to put in work for his attention. But it never worked. He still chose his wife. \n\nFast forward 10 years, after basically no contact from him and I have a daughter. So does my sister, except my niece was 10 years older than my daughter. He is divorced from his “bitch of a wife” (his words). And he apparently regretted the time he lost with me. But here’s the thing, he never told me any of this. He would tell my sister, but not me. He would tell my other family members, but never me. \n\nMy sister spent as much time with him as she could. He seemed to love being around my sister and absolutely adored his first granddaughter (sisters daughter). But he never even tried to care about my daughter. He’s seen her maybe 2-3 times in the 5 years she’s been alive. In that same stretch he went to go see my sister and niece, who now live in a different state, more than that. \n\nI’ve always felt ignored and abandoned by him. My mom died 6 years ago and she literally was the only one who took care of me and paid for everything. My dad never gave her money. \n\nAm i a horrible person for feeling nothing about his death?",
    "comments": [
        {
            "level": 0,
            "comment": "Nope, not at all. You're entitled to feel however you feel. You don't owe him or anyone else any \"feelings\" simply because you're blood",
            "score": 3,
            "author": "Lucy_Jo"
        },
        {
            "level": 0,
            "comment": "No, it's actually common to have that experience, especially if you weren't close. But also, sometimes grief just happens at weird times, so don't be surprised if you end up having a lot of feelings at some random time in the future",
            "score": 2,
            "author": "TheApiary",
            "replies": [
                {
                    "level": 1,
                    "comment": "This actually happened to me. My grandpa died, and I felt nothing; I just said to myself that he had died and ignored it like nothing happened.",
                    "score": 1,
                    "author": "FluidEntrepreneur309"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This will not hit you at once. \n\nGive it time. \n\nIt's very common for people in your situation to not be hit emotionally all at once. Fathers and relationships with them are complicated.\n\nFeelings are going to come. I don't mean \"I miss him, I love him\" but they will come. Sometimes like a freight train, maybe like a crippling sadness, maybe jealousy or bitterness. but one way or another you'll process this.",
            "score": 2,
            "author": "Wolvenfire86"
        },
        {
            "level": 0,
            "comment": "Even if you were close, numbness in response to the death of a loved one is pretty common. When my beloved grandmother (who was my 2nd mom) passed, I felt nothing for like a week. Then it hit me like a load of bricks.\n\nYou might feel something as things sink in. There's no \"incorrect\" way to feel in response to someone passing. Let yourself feel whatever you feel and work through it at your own pace.",
            "score": 2,
            "author": "Educational-Candy-17"
        },
        {
            "level": 0,
            "comment": "Can’t help how you feel. Nothing wrong with that at all",
            "score": 1,
            "author": "PromptAwkward"
        },
        {
            "level": 0,
            "comment": "Nah",
            "score": 1,
            "author": "pragmaticpomegranate"
        },
        {
            "level": 0,
            "comment": "It's fine.",
            "score": 1,
            "author": "FluidEntrepreneur309"
        },
        {
            "level": 0,
            "comment": "If he was never good to you then I wouldn't feel bad.  If my mom died tomorrow I wouldn't bother going to the funeral.",
            "score": 1,
            "author": "ParkerGuy89"
        },
        {
            "level": 0,
            "comment": "Not a horrible person, you are a survivor of a uncaring person and you don't have to make excuses for his behavior. Him expressing regret but not doing anything is just a manipulation to humanize himself and manipulate people around him.\n\nIf you have 2 hands and 2 feet and a work ethic, you can make your own life and you own him or his memory nothing. His existence is just a chapter of your life that is in the past, turn the page and live your best life.\n\nSome of us have to persevere and overcome situations in life that change how we see life or people around us. How we deal or the baggage we carry forward tells a lot of our coping and learned skill's, the older you get the quicker you see peoples true intent and the implications of their behavior.\n\nTomorrow you wake up and it's the first day of the rest of your life, make the best of it.",
            "score": 1,
            "author": "GrayMountainRider"
        },
        {
            "level": 0,
            "comment": "As many here have said so well already, grief may find you sometime later - or maybe not at all.  Either is fine.  I want add that if you do find yourself grieving, don't resist it, dismiss it, or hide it.  You did not have a good relationship with your father which, from what I read in your post, caused disappointment and hurt.  Sadly, the time to make amends has passed.  As the permanence of that settles, you may find heartache in missing what could have been.  That is something to mourn.  Be well, and my condolences to your family.",
            "score": 1,
            "author": "ackthecat"
        }
    ]
}