{
    "id": "148jtpa",
    "score": 24,
    "title": "Why isn't there grape ice cream?",
    "author": "Interesting-Purple-7",
    "date": 1686674901.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148jtpa",
    "media_urls": [],
    "other_urls": [],
    "postText": "I like grapes. There is strawberry and blueberry ice cream, but no grape ice cream. Why? We are missing out on grape flavored ice cream that is light purple :(",
    "comments": [
        {
            "level": 0,
            "comment": "Form what I've found, it's hard to come by because freezing grapes makes them hard and ruin the texture, and artificial flavoring isn't made because the flavor isn't heavily desired.\n\n&amp;#x200B;\n\nhttps://www.tasteofhome.com/article/reason-you-can-never-find-grape-ice-cream/",
            "score": 25,
            "author": "sterengk7"
        },
        {
            "level": 0,
            "comment": "Grapes have a high water content, if you freeze grapes to make ice cream they turn into icy chunks.\nThe ice chunks do not make a good creamy ice cream.",
            "score": 6,
            "author": "Eldergoth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could you make grape jelly ice cream?",
                    "score": 1,
                    "author": "Callmedrexl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably. I've made ice cream using wine before - it was okay, but the texture was a bit off in a way I never had with dozens of other liquors, liqueurs, and extracts.",
                            "score": 1,
                            "author": "SJHillman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I also tried to make ice cream with wine and the texture was off.",
                                    "score": 1,
                                    "author": "Eldergoth"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The other answers don't make any sense bc strawberry ice cream is artificially flavored. Banana ice cream is artificially flavored. Orange creamsicle, etc.\n\n\nI think it has more to do with tradition. A major ice cream brand would need to introduce new flavors and see how they do. They won't do that bc it's a risk and they could lose money. They stick with chocolate caramel and praline and peanut butter swirl toffee crunch fudge marble cookie because they have data on it. It sells. Apple a la mode ice cream has no data. Grape berry ice cream has no data. I'd personally love a lemon curd, nectarine, or plum ice cream, but oh well.",
            "score": 6,
            "author": "tigerCELL",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eww if you are buying a good ice cream it should be made with real fruit. Change your ice cream shop.\n\nBut some flavours are easier to fake than others. Grape soda for example tastes nothing like grapes.",
                    "score": -3,
                    "author": "CalgaryChris77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "there is, its just not that common.",
            "score": 4,
            "author": "The_Quackening",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, I was watching a food program the other day talking about it and they were saying its extremely popular in specific places but it's hard to manufacture so they keep it exclusive.",
                    "score": 1,
                    "author": "Navikus_Twitchtv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've had peanut butter and grape jelly ice cream. It's delicious.",
            "score": 3,
            "author": "Jesse_James666"
        },
        {
            "level": 0,
            "comment": "Get an ice cream maker and make you own. It’s fabulous.",
            "score": 9,
            "author": "KrankySilverFox"
        },
        {
            "level": 0,
            "comment": "its possible but there's too much  water, so its hard to make, same reason there's no melon ice cream. cherry ice cream only exists because people put cherries on sundaes",
            "score": 6,
            "author": "AreaProfessional7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, I guess we'll just have to settle for grape-flavored popsicles and second-rate sorbets like peasants.",
                    "score": 4,
                    "author": "whatsthis2throwaway"
                },
                {
                    "level": 1,
                    "comment": "You mean watermelon icecream? Because melona is super tasty",
                    "score": 3,
                    "author": "outcastedOpal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ube is sort of purple",
            "score": 2,
            "author": "Olive_Magnet"
        },
        {
            "level": 0,
            "comment": "Someone does make grape ice cream! I was reading all these replies and thinking that I’d definitely eaten artificial grape ice cream before so I found it \n\nhttps://www.foothillscreamery.com/products/ice-cream/hard-ice-cream/64024-114-l-ic--grape-float\n\nThey also make a flavour called wet paint that is fantastic",
            "score": 2,
            "author": "Psychological-Ad2207"
        },
        {
            "level": 0,
            "comment": "Supposedly the original Ben And Jerry of Ben And Jerry Ice Cream, one of the duo made a bet with a woman that he could make any flavor of ice cream she wanted in exchange for daring him. \n\nShe asked him to make grape flavor knowing that it’s impossible because grape juice doesn’t freeze, But he gets to work anyway. \n\nA long while later, he does indeed find a way to make grape flavored ice cream. By mixing grape skin into the grape juice it allows the concoction to freeze to make ice cream. \n\nHe goes to back to her all jolly and, having fulfilled her request, she agrees to date him. \n\nBut just before they can enjoy their newfound relationship, her cat jumps up on the table and takes a bite of the grape flavored ice cream and DIES instantly. It turns out that the chemical makeup of grape flavored ice cream is super potent to animal. \n\nThey do not get together and instead the poor guy sends his findings to a government agency (CDC or some veterinary science group that can do something with the information) and there is a ban in place on any grape ice cream for the foreseeable future. The grape concoction is still used today for putting down animals because of how quick and painless it is.",
            "score": 2,
            "author": "Live-Common1015"
        },
        {
            "level": 0,
            "comment": "I really don't like grape ice cream. Or raspberry.",
            "score": 3,
            "author": "JimBones31",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are never going to be friends in life.",
                    "score": 2,
                    "author": "Dinilddp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry!",
                            "score": 3,
                            "author": "JimBones31"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read a trivia fact once about it.   Some guy made grape ice cream but used mainly the skin of the grape (something to do with the way grapes freeze) Then he gave some to his daughter who shared with her dog.  The dog died pretty much immediately because grapes are toxic to them. Then the story kind of got out and no one bothered again.",
            "score": 1,
            "author": "StaFont",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've heard this too, the version I heard was it was one of the founders of Ben &amp; Jerry's",
                    "score": 1,
                    "author": "boofus_dooberry"
                },
                {
                    "level": 1,
                    "comment": "I heard a slightly different version of this story. \n\nIt was not his daughter...it was a love interest.  The dead dod c#ck blocked the Ben and Jerry guy.\n\nI think this one proved to be an urban legend",
                    "score": 1,
                    "author": "Otherwise_Bill_5898"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like to freeze my grapes, it gives them a nice popsicle-like texture. You can also freeze them and blend them up with some milk and vanilla to make your own grape ice cream/smoothie",
            "score": 1,
            "author": "hippy_potto"
        },
        {
            "level": 0,
            "comment": "I specifically remember getting \"grape ice\" flavor at Baskin Robbins as a kid.",
            "score": 1,
            "author": "Callec254"
        },
        {
            "level": 0,
            "comment": "It's not fair :(",
            "score": 1,
            "author": "Grapes15th"
        },
        {
            "level": 0,
            "comment": "In Nova Scotia they have Grape Nuts ice cream. Which isn’t grape, of course. But there you go.",
            "score": 1,
            "author": "redskyatnight2162"
        },
        {
            "level": 0,
            "comment": "well shit. artificial grape flavor is common and easily replicable without much effort, but youre right. i dont think ive ever even seen grape ice cream... and now i want it, lol.",
            "score": 1,
            "author": "EE7A"
        },
        {
            "level": 0,
            "comment": "Add some codeine and you could make ice lean.\n\nI’ll show myself out",
            "score": 1,
            "author": "SaintCorgus"
        },
        {
            "level": 0,
            "comment": "There is. It’s called rum and raisin.",
            "score": 1,
            "author": "Tobybrent"
        },
        {
            "level": 0,
            "comment": "People like grapes",
            "score": 1,
            "author": "Dethjaw"
        },
        {
            "level": 0,
            "comment": "Sounds disgusting",
            "score": 1,
            "author": "BravesMaedchen"
        }
    ]
}