{
    "id": "148llkv",
    "score": 2,
    "title": "How to get relief from whatever bit me",
    "author": "mrsjiggems2",
    "date": 1686679505.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148llkv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was at a cookout on Saturday and while I was sitting  in a camping chair with my feet on the ground, I got a bunch of big bites on my ankles. They itch like crazy but if I scratch them at all they also burn like crazy. I can't sleep because they are making me miserable. Does anyone have advice? I put peroxide on it and tehm use Tecu poison oak stuff which said it could also be used on bug bites. It looks like calamine lotion. I tried chigger bite cream which has benzocaine in it. I'm so miserable I need some other ideas. I also take an antihistamine daily.",
    "comments": [
        {
            "level": 0,
            "comment": "Sounds like chiggers. Take a shower and use some calamine lotion. That should help with the itch no matter what bite you have.",
            "score": 3,
            "author": "FurrenParagon"
        },
        {
            "level": 0,
            "comment": "Have you visited any doctor ? It would be much better for you to visit nearest clinic and get some first aid / prescription",
            "score": 1,
            "author": "Future_Line_4253"
        },
        {
            "level": 0,
            "comment": "See a Dr. Many biting insects carry diseases.",
            "score": 1,
            "author": "LoveBurr",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if the local Dr. Many is busy?",
                    "score": 2,
                    "author": "-NGC-6302-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depending on how you feel the emergency room is a choice. There's also plenty of help online to be found if you know what bit you, so you can measure risk. Local wildlife groups can offer guidance too",
                            "score": 1,
                            "author": "LoveBurr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in the South and we were always told to use nail polish on chiggers. They’re tiny mites that burrow into the skin and the nail polish suffocates them. Now, I wouldn’t do this if your bites are oozing or open sores in any way. You could try an over the counter hydrocortisone cream for the itching. \n\nYou could go to the doctor. I once got poison ivy from some mulch we ordered and I took a bath without realizing it. It got EVERYWHERE. And I had large hives from it. I tried stuff like calamine but it wasn’t strong enough. They gave me a Rx cream that helped with swelling. I kept using calamine or Benadryl itch gel along with it.",
            "score": 1,
            "author": "Aggravating-Menu6702"
        }
    ]
}