{
    "id": "148nvhe",
    "score": 2,
    "title": "Do kids in American high school still have to deal with there being 20 super popular jocks/cheerleaders dominating every single student group and school play while everyone else is expected to be their audience?",
    "author": "Teledoink",
    "date": 1686685601.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148nvhe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am old (54) and don’t have any kids of my own. And most of my nieces and nephews live far away, otherwise I’d ask them. So I’m asking you all. I went to a big high school in the 80s where there was a core group of jocks and “popular people” who pretty much dominated every single school activity. They were in AP classes, in student body leadership roles, in all of the theater productions, wrote for the school paper, were the stars of every class assembly, etc. If you weren’t part of this core group, you got relegated to the sidelines where you were kinda expected to just be happy not participating in anything, and just watching the small group of people do everything. \n\nWe formed our own little side niche groups like the art weirdos, the goths, the new wavers, the stoners, the band kids, the kids that ran the school radio station. And of course every once in a while a “weirdo” would rise above and get a lead role in a school play, or become homecoming queen, just from sheer talent or undeniable beauty. But, for the most part, most of us had to lower our expectations and ambitions until we were out of that weird little bubble of high school. They’d even have flower days when a local florist would hand out roses that students had bought for eachother in 2nd period, and walk around with their flowers all day showing everyone how flower-worthy they were. The first few semesters it would be only the few most popular girls and boys walking around with a huge bouquet of roses while the rest of us were walking around empty handed. Until we finally figured out that if we sent flowers to eachother it would be a lot less humiliating. \n\nAnyway, I’m just curious - did all of the anti bullying campaigns and push to make things more inclusive change all of this? Are American schools less prone to being dominated by one core group, leaving almost everyone else out? Or has nothing changed?",
    "comments": [
        {
            "level": 0,
            "comment": "When I was in high school in the 1970's the \"leader\" students tried to lead us all, but were ignored.  I remember one girl screaming at us all, then breaking down in tears because we had no interest in their school functions.",
            "score": 2,
            "author": "Technical_Airline205",
            "replies": [
                {
                    "level": 1,
                    "comment": "That must have been nice! In Reagan era, and post-Reagan era high school we had a bunch of people with money walking around like they owned the school, and a bunch of other people looking up to them and gossiping about them like they were celebrities. I remember even one of my goth friends knowing who all of the jocks and cheerleaders were dating, and talking about them as if they were Hollywood elite",
                    "score": 1,
                    "author": "Teledoink"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry about my disorganized writing.\n\nI would say its true for the most part but people seem to be a lot less cliquey. I graduated a few years ago so it might not be super accurate. We had the asb kids who also did the school news, there was no newspaper, and no theater unless I missed it. The asb students were usually the ones taking mainly AP classes. I think they were also the ones you set up and did all the presenting of the assemblies but I think that was part of the role of the ASB class. They were also always the popular kids. They were easily forgettable unless you were part of their group though. \n\nFor the cliques, I don't remember it super well, each sport had their own group, even track and field had their own groups for each sport and they usually stuck together but outside of practice they didn't really hang out. It was mostly separated by race and grade. There was a small group of weird kids, but they were also sperated by race, a group of the trouble makers, the popular kids, the band kids, the FFA kids, there were like 3 goth kids, the lgbt kids, other than that the vast majority were just the normal kids who didn't really stand out.\n\nThe homecoming king and queen were the last ones you would expect but I think the queen was part of ASB.\n\nI don't remember anything like flowers but I am sure there was something similar that I just don't remember.\n\nAll in all it was a very boring experience even with 5,000 people nothing went on at all. Bullying was almost non-existent and the only the only fighting I heard of was an autistic kid kicking someone and the wannabe gangsters fighting over god knows what.",
            "score": 2,
            "author": "latsneo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting! Sounds a lot less toxic than my high school experience. No theater and no newspaper? Interesting. These were very big deals in my school. We even had a couple of kids in the theater program go on to work in Hollywood (minor bit parts, but still,) and the editor of the newspaper went on to be a reporter with the news in San Francisco.\n\nI’m starting to realize that it might have been my high school also had some over achievers (one of my friends Dad was a weather man on the same channel in San Francisco. Another girl got driven to school in a limo every day) and a huge wealth disparity, as well as this being the 80s",
                    "score": 1,
                    "author": "Teledoink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Once a month there was a news program with the \"news anchors\" where they talked about stuff going on. I'm guessing that took place of the newspaper. I don't think anything was ever really a big deal for anyone but the ASB kids, no one really cared and just wanted to go home lol. I don't know what anyone's done after highschool really besides college or work.\n\nI think I just went to a poor area maybe? there wasn't one person that really stood out like that. Everyone kept to themselves really and all the people acted fake and just trying not to stand out for the most part.",
                            "score": 2,
                            "author": "latsneo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It must have been kinda nice to grow up in an area where everyone had a similar level of money. I was middle income, couldn’t afford designer clothes, but there were some very wealthy people, and some much less well off, in my high school. And the wealthy people didn’t hesitate to flaunt it with designer clothes with labels on them, and their parents choosing to give them new cars in the school parking lot for all to see for their 16th birthday. This being the 80s the designers had their names emblazoned on their clothes. One of my friends shoplifted all of her clothes to try keep up with the rich kids.\n\n&gt; Once a month there was a news program with the “news anchors” where they talked about stuff going on: I’m guessing that took place of the newspaper. I don’t think anything was ever really a big deal for anyone but the ASB kids,\n\nSee, that’s how it should be! Super scholarly or AV nerd type kids doing the broadcast. Not the most popular jock in school being chosen for every single frikken activity. I know I should be over this by now, but my sister and I were talking about this a few months back, about how trying out for stuff we knew we were good at, but not making it, in high school really negatively affected our self esteem and our desire to even bother trying in life.",
                                    "score": 1,
                                    "author": "Teledoink"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m just shy of 30 and I did not have this experience in high school. But I also grew up in a small town, my class was around 130 people. \n\nVery few “popular” people or jocks participated in things like theatre, band, art, etc. Very few of them took AP classes. They tended to flock to the more “prestigious” things like student government and the clubs that allowed them to do “fun” things. Most extracurriculars other than sports were the “non-popular” kids.",
            "score": 2,
            "author": "Illprobtalkabmypets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting. Maybe the sheer size of my high school made this all worse, feeling like you were always on the sidelines watching just a few people get to enjoy high school \n\nThe “popular” people preferring to be in prestigious activities makes sense, due to college admissions. It seemed like in my high school experience they were in every single activity. I got chosen to be the editor of my schools annual literary and arts magazine. Very few of my more studious (less “popular”) friends chose to submit poems or artwork, so, once again the submissions were dominated by the cheerleaders writing about how awesome friendship is",
                    "score": 1,
                    "author": "Teledoink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think size definitely effects it. Our town was small enough that we all went to kindergarten and graduated with all the same people. Everyone families are connected somehow if you look hard enough. The small town dynamic kind of curbed some of the stereotypical high school situations from what I saw",
                            "score": 2,
                            "author": "Illprobtalkabmypets",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That must be nice",
                                    "score": 1,
                                    "author": "Teledoink"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im 61 and my hight schools was a little bit like that but not nearly as bad, i moved to a small town as an adult . My sons graduating class only had 12 students . It was pretty tight . My graduating class had abot 350 .",
            "score": 2,
            "author": "413mopar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah my graduating class was over 500 students. 12 students must have been nice! I have nephews who grew up in a small town in Alaska. They hated it in some ways and couldn’t wait to get out, but they were involved in all kinds of sports and activities that my siblings and I tried out for our first few semesters and didn’t bother trying for things again. My moms high school experience was even worse. Giant high school in Las Vegas where all of the owners of casinos sent their kids. They had a professional level dance troupe that rivaled any casino",
                    "score": 1,
                    "author": "Teledoink"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm 65 and never had the experience you describe.  The cheerleaders and jocks were one group, the music/drama/art people were another, the techies were yet another group. Nobody was sidelined except through choice.",
            "score": 1,
            "author": "refugefirstmate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well then I guess I went to a very different high school than you, and had a very different experience. At a different time. \n\nThe jocks/popular kids, and those who worshipped them hung out in the quad and took up all of the picnic tables in the quad. My subculture (goths and new wavers) hung out on the amphitheater just off of the quad. The Mormons all spent lunch period inside the cafeteria. The stoners hung out between the D and the F wing. One day the jocks all got together and threw food at the goths and new wavers. Someone wrote an article in the school paper interviewing several of the jocks about why they did that. They said “Because the alternative kids think they’re so much better than us.” How dare we have found our own niche and not worship them.\n\nMy older siblings told me that ten years before I went to high school the amphitheater was where everyone hung out, as the 70s were different times.\n\nI was just wondering if the whole 80s jock culture thing had lingered at all today.",
                    "score": 1,
                    "author": "Teledoink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope. Nothing like that at all.",
                            "score": 1,
                            "author": "refugefirstmate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe this was an 80s California thing. Although John Hughes made an entire genre of movies about this exact thing",
                                    "score": 1,
                                    "author": "Teledoink"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some people are just highly motivated and good at interpersonal relationships. I'm not sure what else you're saying here, though my school 30 years ago was probably a lot smaller than yours so maybe you're talking about something I just didn't experience because of that.",
            "score": 1,
            "author": "BulldMc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of these core group people had parents that were highly involved in the school, and had all gone to the same schools (elementary, middle school, then high school) together. My siblings and I were in leadership roles at our previous private Catholic schools before we moved. My older sisters were cheerleaders and class President, I was class secretary and the school mascot. I just thought that was the natural order of things until we moved. In middle school I was a cheerleader. But in high school none of my siblings or I got chosen to be in any of the school groups or activities we tried out for. My older brother did get lead roles in school plays years before I went to the same school\n\nI was just asking younger folks if things had changed and this hierarchy doesn’t exist anymore. Maybe I went to a weird school. But I don’t think so. There were a ton of movies about this kind of thing in the 80s",
                    "score": 1,
                    "author": "Teledoink"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Popular kids don't do theater.",
            "score": 1,
            "author": "slash178",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my school and in my era they did, unfortunately. In my brothers era (a decade earlier) they didn’t. Only the theater geeks did. But the jocks decided this looked like fun and a good way to get more attention, and took that over too",
                    "score": 3,
                    "author": "Teledoink"
                }
            ]
        }
    ]
}