{
    "id": "148nnz5",
    "score": 425,
    "title": "Is it true that trauma causes you to grow more as a person?",
    "author": "Candlelover1",
    "date": 1686685041.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148nnz5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Rather the steps you take to overcome the trauma is what grows you. The trauma itself is a catalyst.",
            "score": 88,
            "author": "Aggravating-Menu6702",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Its like saying getting hit in the head with a hammer stenghtens your scalp. While its eventually does it, as bone and muscle adapt to it. it causes lasting damage.",
            "score": 516,
            "author": "Zynthonite",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah... Trauma is just trauma. There's no life lesson in it, no prize at the end... You suffer, sometimes for your whole life, then you die. At least then it's over.",
                    "score": 164,
                    "author": "Jumpy_Sorbet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "you're right. I have years of persistent childhood trauma behind me and my therapist considers my emotional growth stunted. nothing good about being a traumatised child in an adult's body.",
                    "score": 46,
                    "author": "hazevanilla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea exactly the same. There’s nothing empowering about living with trauma, it just sucks. And has a negative impact on my whole life, that’s not growth, that’s holding me back.",
                            "score": 8,
                            "author": "Zeefzeef"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sure, if you survive and put a metal plate in your bones, then your scalp will be stronger. Your brain function might be severely impaired though.",
                    "score": 17,
                    "author": "Lower_Ad_5532",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your wrong, skull plating is a secret that the bones industry doesn’t want you to know",
                            "score": 17,
                            "author": "dorian_white1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sshhhhh. Adamantium bones are still classified.",
                                    "score": 8,
                                    "author": "Lower_Ad_5532"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "that is an interesting way to put it..  (but i assume you mean your skull?) \n\ni guess some may say getting hit with a hammer strengthen you and some may say getting hit with a hammer cripples you.",
                    "score": 7,
                    "author": "Severe-Possible-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just don’t hit a soft spot",
                            "score": 3,
                            "author": "Independent_Ad_8915"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;i guess some may say getting hit with a hammer strengthen you\n\nMost of the people who would say that probably were not hit with a hammer.",
                            "score": 3,
                            "author": "PhotoIll"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fun fact, adult humans cranium does not naturally regenerate. \n\nMakes the metaphor even better in a way.",
                    "score": 4,
                    "author": "whypvmersmadge"
                },
                {
                    "level": 1,
                    "comment": "It can make you hypervigilant against it happening again though, which is debatably a strength and could arguably be labelled as wisdom.",
                    "score": 8,
                    "author": "dullgenericname",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hypervigilance will also make you miss out on a lot of great stuff while you're trying to make sure the trauma doesn't happen again.",
                            "score": 45,
                            "author": "No_Tamanegi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Too much truth to this.",
                                    "score": 4,
                                    "author": "FryChikN"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i can see where you're coming from, but this statement is predicated on you having control over the traumatic things that may happen in your life, which i don't think is the case the majority of the time.",
                            "score": 8,
                            "author": "Severe-Possible-"
                        },
                        {
                            "level": 2,
                            "comment": "Hypervigilism sucks tho… I want to shop at the store without almost crying or not jump and yelp every time a coworker enters a room from behind.",
                            "score": 3,
                            "author": "CopernicusSnail",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think this is a very perpetuated untruth that i actually have really strong feelings about.",
                            "score": 2,
                            "author": "Advisorrof1280"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Perfect answer.",
                    "score": 1,
                    "author": "determinedtobeok"
                },
                {
                    "level": 1,
                    "comment": "This is amazing. Thank you. 😊",
                    "score": 1,
                    "author": "Hydronic_Hyperbole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think this is a very perpetuated untruth that i actually have really strong feelings about, especially as a person who has been told this by many people.\n\ntrauma doesn't make you stronger, trauma makes you traumatized. what makes you stronger is learning about your trauma, assessing it, processing it, working on it (for a long time), re-assessing it and yourself, re-processing it, and working on it probably for the rest of your life. the trauma itself doesn't make you stronger.",
            "score": 863,
            "author": "Severe-Possible-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well corrected, and lucidly explained.",
                    "score": 122,
                    "author": "Midnight_Crocodile"
                },
                {
                    "level": 1,
                    "comment": "love this comment. trauma sucks man",
                    "score": 30,
                    "author": "-sanriowhore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agreed &lt;3",
                            "score": 6,
                            "author": "Severe-Possible-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty much this. This \"what doesn't kill you makes you stronger\" is survivor bias. What we see and focus on is the person who managed to recover, and the tools they used to recover now give them more strength than they had before. What we don't see or think about is the person who struggles their whole life and never gets better, the person who ends it all, the person who turns to drugs to cope. And then there are the people who manage to pretend to be recovered but all they've done is bottled things up until they pop back up when you're not ready.",
                    "score": 94,
                    "author": "Baelaroness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's worth noting that \"What does not kill me makes me stronger\" comes from Friedrich Wilhelm Nietzsche - who spent his final years in an insane asylum.",
                            "score": 21,
                            "author": "Journeyman-Joe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I read somewhere that a lot of his work is taken out of context.",
                                    "score": 13,
                                    "author": "Baelaroness",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm far from an expert.  But there's a lot of suffering borne by people trying to live up to this bit of bravado when they should get help.",
                                            "score": 8,
                                            "author": "Journeyman-Joe"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "most of it is.",
                                            "score": 5,
                                            "author": "Severe-Possible-"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "that is true, and it is from a work of his called twilight of the idols: how to philosophize with a hammer, which was arguably written when he was most manic, he wrote the entire thing in a week.",
                                    "score": 8,
                                    "author": "Severe-Possible-"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Adding on, you don't need to have gone through trauma to get stronger. I've experienced a lot of trauma. Some of my growth as a person has been related to processing that trauma, and some of my growth was not at all related to anything bad happening to me. Both are valuable to me, but I would've liked to grow without needing to go through any trauma in the first place.",
                    "score": 16,
                    "author": "TheMcGirlGal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is a good point as well, thanks for mentioning it.",
                            "score": 2,
                            "author": "Severe-Possible-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think people confuse trauma and adversity.\n\nTrauma is like injuring a muscle, adversity is like exercising a muscle.\n\nThey are not the same thing, but it's an easy mistake to make.",
                    "score": 8,
                    "author": "Essex626",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Actually...what this girl said. (Edited due to referring to her as \"this guy\"...my bad!).",
                    "score": 6,
                    "author": "mattyo360",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "haha no worries, i wasn't going to correct you &lt;3",
                            "score": 5,
                            "author": "Severe-Possible-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, dealing with it.  Not having it",
                    "score": 6,
                    "author": "lucas_bahia"
                },
                {
                    "level": 1,
                    "comment": "💯\n\nI personally HATE this idea that trauma just magically grows people. It's so unnecessary and harmful. It takes conscious work and sitting with the trauma and therapy sometimes for years etc etc before growth can come from it. The average person who has a full time job or a household to run or children to look after may not afford the time and resources to transform their trauma into some growth edge. I see this even in my own family where that transformation process is so unattainable or scary so many of us just numb (alcoholism, drug use, taking on highly stressful careers etc)",
                    "score": 6,
                    "author": "itsjustphe"
                },
                {
                    "level": 1,
                    "comment": "This is very well said. Trauma in and of itself cannot make you stronger. \n\nHowever, healing from trauma can make you both stronger and weaker. You become stronger as you develop resilience and grow from having gone through trauma and go through healing. You also gain insights, knowledge, learnings, and growth that you may not have otherwise. \n\nYet at the same time, healing is not linear and you can be triggered and it is hard for the trauma to permanently go away (think Humpty Dumpty). And you may very well live with a bit of shadow over you, even if you logically know that you are more than your trauma, it does follow you through life.",
                    "score": 8,
                    "author": "tropicalcannuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; You also gain insights, knowledge, learnings, and growth that you may not have otherwise.\n\nThis is true, but I think often times, at least in my life, it was always an unfair exchange: the lessons learned and the insights gained costed a lot more than they were worth. Like to be honest, most of the biggest insights I had happened after I irredeemably fucked up something important, something that someone without this and that baggage wouldn't ever have come close to fucking up. \n\nFor instance, for the longest time, I had issues bonding with people and getting close to them. I remember two times around when I was like 21 or so that someone told me they loved me, and I had to distance myself from them because of immense discomfort from merely hearing those words from them. But even when I would sense someone was getting to close to me, I would back off and intentionally distance myself from them for a period of time.\n\nOkay, half a decade later and I had some insights and experiences that now allow me to feel more comfortable getting close to people.... And? The insights and backstory of overcoming intimacy issues is... useless to basically 99% of people because 99% of people don't have intimacy issues. The backstory and insights costed me countless numbers of meaningful relationships in my life that I won't get back. That's not an insight worth having in anyone's life if the cost is fucking up a dozen relationships. \n\nI feel like overcoming trauma is just learning to be average / normal again. Like we can use a very concrete example of getting bitten by a dog. Most people aren't scared of dogs. When you get bit, you might now be apprehensive of dogs. Getting over that trauma is just becoming not scared of dogs again, in other words: being average, normal again.",
                            "score": 5,
                            "author": "solsolico"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. I know lots of people who experienced trauma and didn't deal with it. They are actually the weakest people I know in a lot of ways.  That is why you see people who struggle with addiction after trauma. Because they refuse to deal with that crap. So it festers. But even if it isn't an addiction there are a 1000 ways it still screws with your life when you just ignore it.",
                    "score": 6,
                    "author": "No-Fishing5325",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Childhood trauma can take a lifetime to work through.",
                            "score": 15,
                            "author": "senorglory"
                        },
                        {
                            "level": 2,
                            "comment": "When I was in my worst alcoholic days my dad told me \"you're the strongest person I know\" and I'm like, that's such bullshit. A strong person doesn't get blackout drunk every moment of every day lmao",
                            "score": 2,
                            "author": "Real-Lake2639"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "and then there’s my dad who insists trauma is self-inflicted because it’s all about your take on it or some shit like that",
                    "score": 5,
                    "author": "DwemerSmith",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well for suffering one can acquire wisdom , but one must learn from it , not Let be consumed by it",
                    "score": 2,
                    "author": "United_Reality4157"
                },
                {
                    "level": 1,
                    "comment": "Thissss, still trying to get over child death, and I know I never will.... I just hope it at least makes me a better person because I'm on higher alert  all the time. \n\nIt sucks because i know I will never fully heal but you can't just give up. I remember before I lost my niece I didn't understand trigger words... now it's pretty triggering to me just to mention house fires... lol\n\nBut yes I love your response!",
                    "score": 2,
                    "author": "FryChikN"
                },
                {
                    "level": 1,
                    "comment": "Excellently explained. I'd love to get your thoughts on [my own response](https://www.reddit.com/r/NoStupidQuestions/comments/148nnz5/is_it_true_that_trauma_causes_you_to_grow_more_as/jo27lui?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) elsewhere in the comment section as I think you'd have some excellent insights.",
                    "score": 2,
                    "author": "Valirys-Reinhald",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree 100%",
                    "score": 2,
                    "author": "ChekhovsWhiskey"
                },
                {
                    "level": 1,
                    "comment": "\"You don't callus to trauma...that shit stacks!\"\n\n--Some guy in a discord channel--",
                    "score": 2,
                    "author": "Downtown_Caramel4833",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "this is the most correct answer",
                    "score": 2,
                    "author": "armahillo"
                },
                {
                    "level": 1,
                    "comment": "Very well put.",
                    "score": 2,
                    "author": "Kintsukuroi85"
                },
                {
                    "level": 1,
                    "comment": "it I traded in fake gold I'd give you some",
                    "score": 2,
                    "author": "Dazzling-Ad4701"
                },
                {
                    "level": 1,
                    "comment": "Yes. Well said.",
                    "score": 1,
                    "author": "its_all_good20"
                },
                {
                    "level": 1,
                    "comment": "agreed.",
                    "score": 1,
                    "author": "kl889"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assuming you find a way to process it, accept it, learn from it, pick yourself up and move forward... instead of self-destructing in a mushroom cloud of regret, misery and self loathing, then...yeah, sure!\n\nI'm still working on the processing part.",
            "score": 21,
            "author": "mattyo360",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Adversity can make you stronger, but adversity is not trauma. Trauma is damaging beyond its benefits (if any) by definition.",
            "score": 16,
            "author": "GuardingGuards",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.\n\nPeople confuse trauma and adversity and its a huge error, though a subtle difference. \n\nI compared them in another comment to the difference between injuring a muscle and exercising that muscle.",
                    "score": 4,
                    "author": "Essex626"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It literally causes brain damage if it happens in developmental years.",
            "score": 69,
            "author": "13thmurder",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate the fact that I laughed at this eventhough I have trauma 🤣",
                    "score": 20,
                    "author": "Silver_Pop_2862",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Laughing is a great way to cope.",
                            "score": 15,
                            "author": "I_Like_Cheetahs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It do be like that sometimes 😂",
                                    "score": 9,
                                    "author": "Silver_Pop_2862"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s fair, nobody has to cope with their trauma through laughing. I really only laughed because I’m not sure if it’s multi-traumas, ADHD, or both that caused my forgetfulness.",
                                    "score": 2,
                                    "author": "Silver_Pop_2862"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Brain damage is a chance to learn 🙌\n\nI'm mostly kidding, but the brain is incredibly adaptive and people have re-learned to talk after blowing the speech centre along with half their brain out with a shotgun, or lived normally with 90% of their brain missing etc\n\nJust don't want anyone to think they're fatefully fucked for life because of a shitty childhood",
                    "score": 7,
                    "author": "Brrdock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My sister in law just had an episode today, she's 45 and works herself up into screaming fits about one time when her dad kicked her. She's on disability for being a nutcase but she's a perfectly capable individual who can travel, go on vacation, has hobbies, literally goes rock climbing, but identifies as a cripple with spine damage who can't walk because of childhood trauma. Idk who told her it's a lifelong thing because I got the shit kicked out of me for years and I don't explain that to everyone I meet. \n\nI just wish she would get out of the victim mindset, shes so screwed when her mom dies and stops paying for her to live. I'm not giving her money. I tell her the local grocery store is hiring and she responds, \"you don't understand, when I was 3 my dad stomped on my body until my spine broke, I wish I could work a normal job but I can't.\"",
                            "score": 1,
                            "author": "Real-Lake2639"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, it just gives you brain damage and unhealthy coping mechanisms, also a need for a lot of therapy.",
            "score": 93,
            "author": "VraiLacy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This!! And I'm short AF.",
                    "score": 8,
                    "author": "Reyemreden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this a WSB comment?",
                            "score": 2,
                            "author": "mis-Hap"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, not always. I’m sure it can, but a lot of times it just permanently damages you as a person. Combat-related PTSD definitely doesn’t cause soldiers to grow, they were better off before they saw combat",
            "score": 10,
            "author": "Swordbreaker925"
        },
        {
            "level": 0,
            "comment": "No it does not. It hurts you as a person. It does cause you to have to grow in order to progress to the point a non traumatized person would achieve without trying. People can grow and move past a trauma and even learn unique things, but it's not \"good for growth.\" As a parent, my highest goal is to raise a non traumatized child to adulthood.",
            "score": 49,
            "author": "Sunshine_Analyst",
            "replies": [
                {
                    "level": 1,
                    "comment": "I commend you for having that goal as a parent. As someone whose parents traumatized me, I still struggle now sometimes even as a 26 year old whose healed a lot.\n\nIt affected my sense of worth so badly that I even attracted traumatizing relationships and friendships which made it all the worse (plus getting bullied/ostracized at school didn’t help).  Even tho my new relationships are healthier now,  I had to go through unnecessary pain in order to reclaim my worth which is something a parent should do for their children to begin with.\n\nYour kids will be happier, healthier and more self-sufficient as they’re raised with love, protection and empathy :).",
                    "score": 5,
                    "author": "SpiritualSag96"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trauma changes you. If you overcome it, it makes you stronger. If you succumb to it, it makes you weaker. People who have faced no hardship in life are fragile; something bad comes along, and it shakes them. They have no grid to process it. People who have overcome hardship aren't shaken. They've seen worse and they're not caught off guard. People who have been crushed by hardship and never overcome it are crushed. It's another defeat, they don't stand a chance, why even try. These people usually have coping strategies that worked well as a child, but aren't serving them well anymore, and yet they run back to what doesn't work anytime things get tough. I've seen plenty examples of the last group, and I've been that person more often than I'd like to admit.",
            "score": 23,
            "author": "Rephath",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can’t applause this enough. I have a childhood full of trauma and whenever I have someone going nuts or yelling I’m able to be calm and just navigate it. It’s just yelling, whatever. It’s just alcoholic behavior, whatever. It’s just crazy, whatever. Other people are wrecked by this sometimes. It’s part of the world. Some of us have seen the underbelly.",
                    "score": 7,
                    "author": "riverbend10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very weird going from DCF custody and general underbelly shit to adulthood and dating normal girls from healthy families, they can't wrap their head around the reasons I do things certain ways, and very \"shaken\" when there's hardship. A minor inconvenience is a catastrophe. I had to literally kick a girl out on the side of the road because she wouldn't stop complaining about how her dad was 2 months late with her $130k Mercedes upgrade as we're driving my unregistered uninsured shitbox with a misfire on 3 cylinders out of 8. \n\nAlso going to high school and having a teacher catch me microwaving raw chicken, thinking I'm being a punk, until I got really mad, like aggressively mad she threw it away because that raw chicken was the only thing left to eat in the DCF house and the gas was shut off so I took it to school to try to cook in the microwave so I could eat that day. The look in the teachers eyes when it clicked that like, she threw away my only food, she was shook. Like yes bitch I don't have any other options I'm too young to work to buy my own food, I can bring the raw meat we can't cook to school to microwave or I starve. I'll take the raw chicken at 12 minutes on high over hunger, that's not even a question. Who do you call as a mandated reporter when the child is being neglected at home but it's the government agency who rescue neglected children that aren't feeding them? \n\nAs a result im married to an ex heroin addict, I can't deal with people who aren't aware how fucked the world is, they seem like children.",
                            "score": 2,
                            "author": "Real-Lake2639"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "interesting. do you think that hardship is the same thing as trauma?",
                    "score": 4,
                    "author": "Severe-Possible-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not in of itself, no.\n\nTons of people who are recluses or \"shut-ins\" who do very little with their lives are such because of trauma they have experienced.",
            "score": 9,
            "author": "Zennyzenny81"
        },
        {
            "level": 0,
            "comment": "Watch Bojack Horseman. Sometimes trauma is only trauma. You get no prize. You get no lesson. You just get self destructive copping mechanisms.",
            "score": 8,
            "author": "AGuyWhoBrokeBad"
        },
        {
            "level": 0,
            "comment": "No, I've been traumatised from 8 months old and it developmentally delayed me.",
            "score": 6,
            "author": "ShadedPsyche",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A friend of mine did a study on this in med school. Unsurprisingly, jail sentencing correlated positively with adverse childhood events (like abuse, foster care, neglect, etc). \n\nOne of our dumbass instructors tried to argue that it’s all in “how you frame your problems” and then talked about how the Jews flourished after the holocaust. My friend and I were dumbfounded. This attending was very well known as a researcher and it just struck me how willfully ignorant people can be.",
            "score": 6,
            "author": "banananananafona",
            "replies": [
                {
                    "level": 1,
                    "comment": "*How the jews flourished after the holocaust...* except for the 6-10 million dead ones.",
                    "score": 2,
                    "author": "PhotoIll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It can but wouldn't recommend it",
            "score": 16,
            "author": "Ratakoa"
        },
        {
            "level": 0,
            "comment": "The truama alone doesn't but if your able to heal from it there's something about the healing process that takes you to a deeper place than you ever would have gone if you hadn't needed to.",
            "score": 6,
            "author": "BallKey7607",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No",
            "score": 4,
            "author": "mesnupps"
        },
        {
            "level": 0,
            "comment": "Hahahaha no.\n\nI grew up autistic, bullied, and as a result learned zero social skills. Now, I'm 26, live in my car, and an incel (even though my attitude isn't that of one). I literally sabotage everything for myself and have nobody to help me when I fall flat.\n\nI yelled back and forth at myself today. I feel like I'm shattered into pieces most days.",
            "score": 4,
            "author": "HerestheRules",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aww I am so sorry you have such tough days. Peace be within you when you can find it. I would share a compassionate hug with you if I could.",
                    "score": 2,
                    "author": "PhotoIll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty sure that's what bad parents say to justify things.",
            "score": 4,
            "author": "sirdavos95"
        },
        {
            "level": 0,
            "comment": "Whatever doesn't kill you, makes you stronger?  Nah, whatever doesn't kill you, just maims and disfigures you for life!",
            "score": 9,
            "author": "Rynor77",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everything makes you grow for better or worse. For trauma it’s usually for worse. It causes actual brain damage.",
            "score": 3,
            "author": "tawayrabbitrat"
        },
        {
            "level": 0,
            "comment": "It definitely causes you to grow but instead of growing straight and upwards, you grow in several different competing directions, sometimes blocking the light to anything that's immediately next to you.",
            "score": 3,
            "author": "boostwtf"
        },
        {
            "level": 0,
            "comment": "What doesn’t kill you, makes you horribly maimed for the rest of your life.\n\nIn all seriousness, trauma doesn’t make you grow more; in fact, it usually has the opposite effect. Working through that trauma is very often what causes personal growth.",
            "score": 3,
            "author": "Individual-Post-6389"
        },
        {
            "level": 0,
            "comment": "As a trauma survivor, this is complete bs.The trauma doesn't make you stronger,the choice to deal with it and move on from it takes real strength. To allow yourself to remain in a victim mentality and claiming it's strength is self destructive to yourself and those around you",
            "score": 3,
            "author": "Background-Ad-343"
        },
        {
            "level": 0,
            "comment": "No lmao who tf told you that?",
            "score": 3,
            "author": "RengokuoftheAbyss"
        },
        {
            "level": 0,
            "comment": "\nPain does not help you grow, it scars you and brings everyone suffering. What truly makes you grow is being loved and sharing it to people that need it",
            "score": 3,
            "author": "Luftwaffle17"
        },
        {
            "level": 0,
            "comment": "As someone with several layers of trauma, no, I don't believe it does. All I've gotten from it is anger issues, possible bi-polar disorder/PTSD, and extreme trust issues, paired with abandonment issues, which also cause me to push people away, so they can't *abandon me*",
            "score": 3,
            "author": "Lopsided-Card-9152"
        },
        {
            "level": 0,
            "comment": "As a psychologist I can say absolutely not, no. That's a false idea that I hate to see perpetuated. Trauma is something awful that people shouldn't have to suffer through. It doesn't make you tougher or more of a person because you've gone through it. Because it's something you never should have had to go through in the first place.",
            "score": 3,
            "author": "Any_Psychology1172"
        },
        {
            "level": 0,
            "comment": "That’s the crap narcissistic abusers say to you when you confront them as an adult with your own agency and power.",
            "score": 3,
            "author": "seymour5000"
        },
        {
            "level": 0,
            "comment": "*Some* people experience Post-Traumatic Growth, but only through a process of h resolving and healing from trauma. And many people just stay stuck in their trauma. It’s not a given that trauma cultivates resilience—the opposite is more likely true.",
            "score": 3,
            "author": "Category-Top"
        },
        {
            "level": 0,
            "comment": "It can. It can also fuck you up.\n\nIt depends on how resilient you had learned to be you were when the trauma occurred, what support you had afterward, and how you chose to deal with it.\n\nSort of like growing up with alcoholic parents.  You can become a teetotaler, just plain old middle-of-the-road, or a drunk like them.",
            "score": 7,
            "author": "refugefirstmate"
        },
        {
            "level": 0,
            "comment": "It's not a rule set in stone.",
            "score": 5,
            "author": "Send-Me-Tiddies-PLS"
        },
        {
            "level": 0,
            "comment": "Not for me.",
            "score": 2,
            "author": "frealfr"
        },
        {
            "level": 0,
            "comment": "Depends—can you work through it or not?",
            "score": 2,
            "author": "today_is_pretzel_day",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if you can work through it, it takes so much time, energy, money and re-experiencing the trauma that it consumes you a second time in your life -- it eats away at your time on earth when you would DEFINITELY rather be doing something fun or productive or rewarding or loving or adventurous... healing from trauma is a reward and growing experience, but you miss other parts of your life while trying to heal.",
                    "score": 2,
                    "author": "PhotoIll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, if anything it's likely to make people regress.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "No. You choose whether or not you grow as a person. A perks can use trauma as a means to grow, just as they can use a new experience as a chance to grow. Growth comes from within.",
            "score": 2,
            "author": "Inside-Big-8158"
        },
        {
            "level": 0,
            "comment": "I wouldn't say it makes you grow more as a person.\n\nI think it scars you in a way you learn not to go to certain paths and make the same mistakes again in the future.\n\nIt could also help you deal with future traumas since you already know how it was.\n\nOn the downsize, it can take you to very dark places where it's hard to get out.",
            "score": 2,
            "author": "AllonssyAlonzo"
        },
        {
            "level": 0,
            "comment": "Depends on how you deal with the trauma.",
            "score": 2,
            "author": "mrseddievedder"
        },
        {
            "level": 0,
            "comment": "*Adversity* can lead to growth and resilience, but trauma level events shouldn’t be treated as mere adversity.  “Trauma” has long lasting negative effects.",
            "score": 2,
            "author": "senorglory"
        },
        {
            "level": 0,
            "comment": "No. It causes brain damage. Literally. Yeah it may make you more empathetic and such but it’s not without major personal cost.",
            "score": 2,
            "author": "KittenIttle"
        },
        {
            "level": 0,
            "comment": "For some people it stunts them and stops them from growing. Many sexual abuse victims feel stuck in their trauma and age at which they were abused.\n\nIt *can* help somebody grow by moving on from it, but there are a million other things which also force people to grow",
            "score": 2,
            "author": "logaboga"
        },
        {
            "level": 0,
            "comment": "Thus is actually one of the completely fucked up beliefs of fundies/iblp followers... why God allows horrific things to happen = to strengthen people spiritually ... one of the many ways they use faith/indoctrination to keep their massive lot of victims quiet/vulberable/in check.  It's vile.",
            "score": 2,
            "author": "External_Life3903"
        },
        {
            "level": 0,
            "comment": "No. Trauma can have the opposite effect just as often.",
            "score": 2,
            "author": "OKcomputer1996"
        },
        {
            "level": 0,
            "comment": "I think it depends on the person and the trauma. me personally, I think it made me regress a little :/",
            "score": 2,
            "author": "Witty-Papaya-3927"
        },
        {
            "level": 0,
            "comment": "You usually can't generalize.",
            "score": 2,
            "author": "rdsouth",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not all growth is good.  Cancer is literally growth of something you don't want.  Trauma will change you and not always for the better, if you want to call that growth then sure it is.",
            "score": 2,
            "author": "umbathri"
        },
        {
            "level": 0,
            "comment": "\"10 spears go to war, 9 break. Did the war forge that spear, make it stronger? Or did it just identify the spear *that wouldn't break?*\"",
            "score": 2,
            "author": "baconboy957"
        },
        {
            "level": 0,
            "comment": "I must be a fucking sequoia then. 🙄",
            "score": 2,
            "author": "Otherkin"
        },
        {
            "level": 0,
            "comment": "Overcoming things help you grow. You don’t always overcome trauma.",
            "score": 2,
            "author": "levieleven"
        },
        {
            "level": 0,
            "comment": "I must be a freaking rainforest",
            "score": 2,
            "author": "coming2grips"
        },
        {
            "level": 0,
            "comment": "Trauma ruined my life.",
            "score": 2,
            "author": "crustybutfunctional"
        },
        {
            "level": 0,
            "comment": "Only if you make a point to learn from it, and let it make you more empathetic.",
            "score": 2,
            "author": "brutalistsnowflake"
        },
        {
            "level": 0,
            "comment": "Depends in my case took 10 plus yrs of therapy after a decade of being non functional so I'd say no!  Still have ptsd flashbacks and need a certain amount of personal space...",
            "score": 2,
            "author": "vtssge1968"
        },
        {
            "level": 0,
            "comment": "No. It causes lasting damage.",
            "score": 2,
            "author": "im4lonerdottie4rebel"
        },
        {
            "level": 0,
            "comment": "My trauma has not done a single positive thing for me. If anything, it stunted me.",
            "score": 2,
            "author": "hedpe70"
        },
        {
            "level": 0,
            "comment": "I think my trauma has inhibited my growth as a person, personally. Especially considering I can’t afford therapy, so all I have are unhealthy coping mechanisms 🤷🏻‍♀️",
            "score": 2,
            "author": "Dakiidoo"
        },
        {
            "level": 0,
            "comment": "Depends, some people are broken forever after.",
            "score": 2,
            "author": "Lobisa"
        },
        {
            "level": 0,
            "comment": "sometimes, but sometimes there is just nothing",
            "score": 2,
            "author": "Dragon_Master6785338"
        },
        {
            "level": 0,
            "comment": "Not trauma, but hardship does.\n\nThat's a weird and difficult concept to balance, but think about muscles.\n\nTrauma is equivalent to injuring a muscle. An injured muscle has to be babied, may require surgery, and will likely need physical therapy to get back to 100%. It does not get stronger.\n\nPutting muscles through hardship, suck as lifting heavy, is not equivalent to trauma, but rather to sort of \"ordinary difficulty.\" That will make you stronger. And in fact, muscles that are stronger are less prone to injury, and so too are humans.\n\nThe latter truth, certain kinds of tough times in certain quantities can increase your strength, is what people misunderstand as trauma causing growth.\n\n(A note here, technically the impact of exercise on a muscle could be described as trauma, but we're speaking of standard understandings of the terms).",
            "score": 2,
            "author": "Essex626",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, a lot of people who have been through trauma would describe it more like having a muscle severed, or severely injured. I still think of \"injured\" muscles as hardships; side effects of overworking. \n\n**Trauma** is something done TO the muscle that leaves long-lasting damage. Just the definition of it: \n\n&gt;*...exposure to an incident or series of events that are emotionally disturbing or life-threatening with* ***lasting adverse effect****s on the individual's functioning and mental, physical, social, emotional, and/or spiritual well-being.*",
                    "score": 2,
                    "author": "PhotoIll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. Trauma often emotionally stunts a person and limits their ability to be out in the world, trying out new experiences. Trauma shouldn’t be romanticized.",
            "score": 2,
            "author": "Anonymoosehead123"
        },
        {
            "level": 0,
            "comment": "Absolutely not. Because of trauma anytime I get even the slightest amount of criticism or feel like someone is upset with me I want to end my life. I want to literally quit my job, run away, never ever go back, or die. No matter how much I logically know it doesn’t matter. That’s what trauma does, and it’s not made me stronger",
            "score": 2,
            "author": "Roxy175"
        },
        {
            "level": 0,
            "comment": "It really depends on the care and treatment you’re given after the trauma. My brother died when I was fifteen, and thankfully my therapist dad worked hard to see that my needs were met as I navigated my grief. On the other hand, I’ve met people in similar situations who were never able to move on and spiralled. There are so so so many variables.",
            "score": 2,
            "author": "alleyalleyjude"
        },
        {
            "level": 0,
            "comment": "Rarely",
            "score": 2,
            "author": "Chasman1965"
        },
        {
            "level": 0,
            "comment": "Not in my experience, it really just adds depression, anger and anxiety.",
            "score": 2,
            "author": "Pale_Height_1251"
        },
        {
            "level": 0,
            "comment": "Sure but part of you also dies.",
            "score": 2,
            "author": "1llseemyselfout"
        },
        {
            "level": 0,
            "comment": "No. Growth causes you to grow. I know that sounds stupid, but here me out.\n\nSerious growth is, usually, not something that happens by accident. There are two main ways for it to occur. By far, the most common way is for you to be put into a situation that your character and skills are not adequate to handle and which you cannot escape. The simplest example of this is growing older. As a young child you are sheltered from the vast majority of the world's stresses and dangers, but as you grow the people around you will be increasingly likely to cease or diminish their efforts to shelter you, thus forcing you to confront life as it really is. You will, inevitably, be unequal to the task and be presented with one of two options. You can either grow or give up. Ideally, this process of removing protection is done gradually enough that we never get overwhelmed and instead experience a steady curve of Growth in which we are always being subtly challenged until we reach a point where we are confident in ourselves and out abilities. The other option, giving up, is essentially a refusal to face reality and instead deny it. The more drastic the change the more likely we are to reject it but, fortunately, this rarely happens. Some people might be unlucky and have to confront such change many times, but on balance it's rare.\n\nThe other kind of cause for Growth is personal motivation. This is the sort of thing that philosophers do, intentionally investigating themselves and the world in a deliberate effort to stimulate Growth, and has a basic perquisite of being able to conceive of the world as being larger than oneself and one's own perspective.\n\nTrauma is neither of these things. \n\nTrauma could, most closely, be associated with the first sort of stimulus, but it's just that. A stimulus. It is *not* equivalent to growth on its own. Rather, it presents us with a situation we are unable to handle and from which we cannot escape, *(if that weren't the case, then it wouldn't be traumatic in the first place)*. Trauma presents us with the dilemma, but it doesn't give us the answer. We have the choice of either Growing or retreating in the face of Trauma, just as we had the choice when faced with the incremental daily increase in Life's challenge when we were children. Ideally, one chooses Growth and becomes a better person for it, but any times Trauma is too much for us to handle and we retreat from it instead. Most of the time this is reversible. With the assistance of supportive companions and skilled therapists, we are able to go back in time and reconnect with the experience, choosing to grow in the present even if we didn't in the past. \n\nBut it is still the choice that brings about the change, not the stimulus for said choice.",
            "score": 2,
            "author": "Valirys-Reinhald",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Trauma can make a person suffer from post traumatic stress disorder, which doesn't make you grow as a person. Instead it makes you vulnerable, easily overwhelmed, hyper vigilant, and so much more.... and often stunts personal, academic and professional growth.",
            "score": 2,
            "author": "greencoffeemonster"
        },
        {
            "level": 0,
            "comment": "Only with proper healing, and even then, the damage is done. It's about how you choose to react to it that helps you grow. \n\nYou can throw a plate on the floor and break it, then glue it back together. It's damaged and possibly has chips missing,  but it's still a plate.\n\nOne thing to remember is that trauma is trauma. Your body and brain doesnt differentiate between the level of trauma. And it doesn't matter the size. The damage is the same.",
            "score": 2,
            "author": "spagyrum"
        },
        {
            "level": 0,
            "comment": "Definitly not always, there is a lot of survivorship bias. You know the saying \"What doesn't kill you makes you stronger, or leaves you crippled, barely functional and dependent on constant care\"",
            "score": 2,
            "author": "die_kuestenwache"
        },
        {
            "level": 0,
            "comment": "No. \n\nTrauma causes pain and suffering. I hate the notion that trauma makes people ‘stronger.’ My trauma never made me stronger. It made me lack trust in people and see the worst in everyone. \n\nYou can grow after trauma but the trauma will not be what makes you grow, and it shouldn’t.",
            "score": 2,
            "author": "piercetheovaries"
        },
        {
            "level": 0,
            "comment": "...\n\nThis is an extremely complex question. If you're asking if trauma *necessarily* causes someone to grow, the answer is a flat 'no'.\n\nTrauma is extremely complex, and trauma response all the more. \n\nTrauma can either break you, or not. If it doesn't break you, chances are good for growth, though not set in stone. If it breaks you, you can still grow, but it's harder than if it didn't break you. \n\nWhether trauma breaks you or not, and whether or not you grow from it depends on the type of trauma you experience, who you are as a person and how you *handle* trauma, what kind of support network you have, what kind of coping strategies you have/develop/are able to employ, what kind of help you seek...\n\nI imagine some self-help systems or very dodgy counselling systems might claim that all trauma is an *opportunity* for growth. Which is true in the same sense that a plague of locusts offers you the opportunity to plant a new field of crops.\n\nThere are plenty of examples of people who grow from trauma. But there are just as many, if not more, examples of people for whom trauma sent them into a death spiral.\n\nI can't give a blanket answer on this one. There *is* no absolute answer. I have experienced traumatic things in my life. I have been damaged, but I have also grown over time. But it would have been *so damn easy* to have been totally broken by them. I'm exceedingly lucky that certain things didn't go just a little bit worse. \n\nIf we're talking about where my life has ended up due to the trauma I've experienced, I would do it all again, because I'm happy with my life. But if we're talking about who I am as a person... I think I'd still like me without the trauma. And, unless it robbed me of my compassion, I think I'd prefer to just have never experienced it.\n\nHope this answers at least some of your question. Anyone who tries to tell you that any and all trauma is an opportunity for growth and you should be grateful for it is some kind of charlatan, one of the toxic positivity crowd. A negative thing is always a negative thing. You can turn it into something positive, if you're lucky enough, but it is *still* a negative thing that befell you. All the toxic positivity in the world won't change that.",
            "score": 2,
            "author": "Musashi10000"
        },
        {
            "level": 0,
            "comment": "I have no idea, I dont know who I would have been had I not experienced childhood trauma.  But I expect I would have been a happier person with better coping skills.  Even if I did grow from trauma, I would trade it for less growth and no trauma.",
            "score": 2,
            "author": "3kidsnomoney---"
        },
        {
            "level": 0,
            "comment": "I think if you find healing from your trauma, which takes a lot of hard work, you definitely do end up growing more as a person. Well I wouldn't wish my trauma on anyone, including myself, there's nothing I can do about it now. My only two options are for it too make me weaker or to try and heal and grow from it. It's something that I actively have to work on, but in a lot of ways I feel like I've developed a lot more empathy for others, and and can sometimes see the bigger picture in life in a way that I think people who haven't had trauma in their lives don't seem to be able to obtain as much as someone who has had trouble. As a recovering alcoholic as well, I think that helping others helps anyone grow, whether they've had trauma or not; and I think that having trauma or being an alcoholic or going through something, so to speak, makes it so that you can help others in a way that no one who hasn't experienced trauma can. I think that recovery from drugs and alcohol, from trauma etc etc. Is all about connection and when you force yourself to connect with others as part of you recovery and become part of a supportive community, and that can make a person grow by leaps and bounds.\nTldr, *recovery* from trauma helps you grow as a person when you connect with others and get support.",
            "score": 2,
            "author": "Betenos"
        },
        {
            "level": 0,
            "comment": "Trauma, like other experiences, can assist in you growing. But the growing part is a choice you make, you learn from mistakes etc.",
            "score": 2,
            "author": "SpaceLegolasElnor"
        },
        {
            "level": 0,
            "comment": "Not necessarily. How you handle the trauma is what helps or hinders your growth. It's not just trauma that shapes you but also how you process and react to it.",
            "score": 2,
            "author": "DielonSpitHotFiyah"
        },
        {
            "level": 0,
            "comment": "Trauma doesn't make you grow. Confronting, reconciling and moving beyond your trauma makes you grow.",
            "score": 3,
            "author": "a-i-sa-san"
        },
        {
            "level": 0,
            "comment": "I don't think so but it makes you funny as hell!",
            "score": 3,
            "author": "Low_Departure_5853"
        },
        {
            "level": 0,
            "comment": "No. Trauma makes you more like what you thought adults were as a kid. It hardens you.  Any growth is artificial and unhealthy.",
            "score": 2,
            "author": "lachlanmac88"
        },
        {
            "level": 0,
            "comment": "Yes\n\nThe broken are the more evolved\n\nThat part was actually true",
            "score": 1,
            "author": "UsaShitsOnTheGOP"
        },
        {
            "level": 0,
            "comment": "Trauma doesn't cause you anything but pain. When you acknowledge the trauma and accept the trauma, then you can grow as a person.\n\nAs soon as you start suppressing the trauma, you stunt your growth.",
            "score": 1,
            "author": "Ornery_Piccolo_8387"
        },
        {
            "level": 0,
            "comment": "No but yes",
            "score": 0,
            "author": "ExtremeBoysenberry38"
        },
        {
            "level": 0,
            "comment": "It can",
            "score": -1,
            "author": "hellshot8"
        },
        {
            "level": 0,
            "comment": "That certainly can be true for some people",
            "score": -1,
            "author": "Extra_Age2505",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everything causes you to grow. Thats just time. Trauma causes you to change.",
            "score": 1,
            "author": "bibinbopjelli"
        },
        {
            "level": 0,
            "comment": "It depends on how you react to the trauma and what that trauma is. It is easier to maladapt instead of overcome, which isn’t good for you. However, sometimes the perspective in reaction to trauma can breed growth and a greater mental and spiritual understanding of yourself.",
            "score": 1,
            "author": "RedemptionOverture"
        },
        {
            "level": 0,
            "comment": "It might make you more ”resilient” to unfortunate things/events in life but as a person I think it breaks you down on the inside.",
            "score": 1,
            "author": "No_Mood446"
        },
        {
            "level": 0,
            "comment": "Everyone is different and trauma can mean many things but one thing I always say is you are never over it or past it but you for sure can get much better at dealing with it.  For me it was just talking to others about it.  Letting people know how I was feeling and letting them know what days were \"bad days\".   Friends and family were great at just sitting and talking or maybe a day out to get me out of my own head.  I'm not giving advice just sharing my experience.   I wish you the best and just know the ones who care about you won't be put off by hearing you share your feelings and asking for help or company on days you need it.   As years have gone by I need less and less of those \"help I need a friend today\" days.",
            "score": 1,
            "author": "reggie938"
        },
        {
            "level": 0,
            "comment": "What doesn't kill you makes you stronger... allegedly. \n\nI think it just depends on you as a person.",
            "score": 1,
            "author": "Lower_Ad_5532"
        },
        {
            "level": 0,
            "comment": "Not necessarily. And some of the ways you could grow or change as a person are not healthy for you and/others around you.",
            "score": 1,
            "author": "Illustrious_Band_866"
        },
        {
            "level": 0,
            "comment": "The word is bandied about so much nomad",
            "score": 1,
            "author": "Affectionate_Sky128"
        },
        {
            "level": 0,
            "comment": "No. \n\nHow you handle trauma can. But it can also have the opposite effect. There’s no one way that trauma affects people",
            "score": 1,
            "author": "Rfg711"
        },
        {
            "level": 0,
            "comment": "Only if you let it.",
            "score": 1,
            "author": "ILikeGames22"
        },
        {
            "level": 0,
            "comment": "Losing my dad at 12 made me grow up sooner, I suppose.\n\nWould not recommend it though.",
            "score": 1,
            "author": "Pjepp"
        },
        {
            "level": 0,
            "comment": "I think trauma makes you *appear* stronger. The dissociation makes you appear courageous and not scared of anything. The foreshortened future makes you look fearless. Giving up on needing or trusting others makes you look strong, independent, and wise. Believing that life is nothing but pain &amp; suffering makes you appear to not need or want anything. Disconnecting from your feelings and intellectualizing everything makes you look very wise and \"strong\" indeed.",
            "score": 1,
            "author": "so-such-a"
        },
        {
            "level": 0,
            "comment": "It can, not necessarily though.  Depending on what the trauma is, it may help give you more empathy for others.  Generally growth is really dependent on what you make of any situation.  I had trauma growing up and it definitely shaped how I see the world, I think the best thing that came out of it is my lack of nostalgia and focus on new experiences, but I don't know that is actually good.",
            "score": 1,
            "author": "jgiovagn"
        },
        {
            "level": 0,
            "comment": "For me it didn’t",
            "score": 1,
            "author": "Millionsmoney"
        },
        {
            "level": 0,
            "comment": "I used to love and rely on others. This made me look weak, because I was dependent on them to not betray me.\n\nNow, after my trauma, I don't trust anyone. Therefore I don't allow myself to need anyone. This makes me look much stronger on the outside... but it comes from a place of fear and doubt, which makes me *less* strong than when I was brave enough to trust &amp; be vulnerable. \n\nAt the same time, when you don't expect good things from life you don't get devastated when your worst fears come true. This looks like \"resilience\", which people interpret as strength. Being **resigned** to life's awfulness isn't quite the same as being so \"strong\" the awfulness doesn't hurt you.",
            "score": 1,
            "author": "so-such-a"
        },
        {
            "level": 0,
            "comment": "Nope!",
            "score": 1,
            "author": "ktmarie0585"
        },
        {
            "level": 0,
            "comment": "Definitely not.",
            "score": 1,
            "author": "Public-Victory-1838"
        },
        {
            "level": 0,
            "comment": "Personally I think trauma, undoubtedly changes you. Often times in the short term for the worse. Depending on whether or not you can work through or overcome the it, affects how it changes you in the long term.\n\nI've lived a pretty comfortable life with relatively few hardships. Nothing prepared me for my father getting cancer right after graduating high school. It absolutely wrecked me on so many levels. And when he passed less than a year later I completely fell apart. I dreamt about him every night and regularly called in to work so o could go back to sleep and see him. I refused to talk about him for literally a decade as I could never bring myself to face the situation and I would randomly break down at smells and sounds and situations that reminded me of him.\n\nEventually though, I shared a happy memory of him. And it felt good. And I would share a few more and some of his jokes. Finally, now I can talk about him without crumbling and actually feel good about celebrating his memory.\n\nI wish it didn't happen, but it did and it changed me. \n\nI have a completely different perspective on people silently suffering as I did. Not showing emotions doesn't mean you aren't suffering, in fact they might be suffering more.\n\nI also approach grief differently now, both for myself and for others. Encouraging them to talk about it when they are ready and trying to open up myself. \n\nIt allowed me to face my grandmother's passing from alzhiemers in a way that I couldn't have before. To be a support system for my mother and provide a thoughtful, funny and comforting eulogy at her funeral.\n\nTrauma always sucks and and is awful and we can't always overcome it, especially not alone. Damn, mine took 10 years, but eventually I did it!",
            "score": 1,
            "author": "CommentToBeDeleted"
        },
        {
            "level": 0,
            "comment": "You know what they say, strength is built not carved, no amount of pain made anybody stronger.",
            "score": 1,
            "author": "thee_timeless"
        },
        {
            "level": 0,
            "comment": "I don't know that it does, but then I feel like people who have grown up without much hardship and have been shielded and privileged tend to be a lot less resilient than those who have faced it.\n\nI am a good example of it. I currently have a 5 month old baby and it's the hardest thing ever. Of course I love him, but I've never felt so defeated and exhausted at times. I have the privilege to be a sahm with live in help from my youngest brother and my husband helps so much with everything. My mum also regularly visits and babysits for me.\n\nMy parents were refugees and came to Australia in boats. They experienced poverty, war and starvation so not much phases them now. My mum was a sahm to 3 kids without much help at all and she just did it without complaint.",
            "score": 1,
            "author": "Victorian_Navy"
        },
        {
            "level": 0,
            "comment": "directly? hell no. indirectly? it depens on the person and on the trauma\n\nfor me my traumas were the best thing that happened in my life, but I'm probably the exception",
            "score": 1,
            "author": "MeringueFeeling",
            "replies": []
        },
        {
            "level": 0,
            "comment": "HAH. Oh I wish.\n\nFor me, trauma got me in survival mode until I was out of the situation, then a failure of a healing mode &amp; now I'm just a scared mess who has no life and no hope for the future 😎 I'm living my childhood now at 29.\n\nWas I strong when I was going through it? Hell yes. But after, once I got 'safe'... I'm tired and don't want to be strong anymore. I'm have no capacity for bad news or bad things anymore and will crumble. I used up all my fight from my childhood to my early 20s. I know it sounds pathetic, but it is what it is.",
            "score": 1,
            "author": "Cookiemonster816",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd say so. I found it put a lot of things in perspective for me that I didn't have before. For context my father committed suicide, it was somewhat related to his work that I also work in so yeah a little bit of a mine field. \n\nI'm doing good but my mindset on a lot of things has changed.",
            "score": 1,
            "author": "Donutprincess69"
        },
        {
            "level": 0,
            "comment": "Nope",
            "score": 1,
            "author": "yelkca"
        },
        {
            "level": 0,
            "comment": "I think more correctly, experience helps you grow more. Experiencing trauma is a significant way to do that.",
            "score": 1,
            "author": "SLUnatic85"
        },
        {
            "level": 0,
            "comment": "My guru used to say \"struggle is the essence of life\", meaning its thru struggle and challenges that not only human, but all life grows. Stagnancy is death.",
            "score": 1,
            "author": "bnk_ar"
        },
        {
            "level": 0,
            "comment": "No. It ruins your confidence, sense of yourself, your attachment to your body, your identity, your ability to socialize, the way you function, etc. It only makes you socially aware of abusers and alert. Or unalert. You're either jacked-off-trauma-alert or dissociating. This depends on severity, and you can learn a lot in general in life, but this is kind of a lie. Actual trauma, especially repeated traumas, just damages the brain.\n\nFrom digestive issues to hair loss and sleep deprivation, I'm gonna give a resounding no.",
            "score": 1,
            "author": "Lonely-Step758"
        },
        {
            "level": 0,
            "comment": "Something like that, I've heard it termed as \"post traumatic growth\" but trauma of any type can be definitively debilitating.",
            "score": 1,
            "author": "No_Strawberry_5685"
        },
        {
            "level": 0,
            "comment": "i dont think so. my trauma didnt make me grow it made me angry , it makes my body hurt , it made me lose all my fucks",
            "score": 1,
            "author": "babyfresno77"
        },
        {
            "level": 0,
            "comment": "I think adversity makes you stronger. The problem is people equate adversity with trauma and they are not the same thing. Trauma doesn’t make you stronger until you learn how to overcome it.",
            "score": 1,
            "author": "Theyallknowme"
        },
        {
            "level": 0,
            "comment": "Trauma causes you to change as a person. Occasionally there are positive effects to this",
            "score": 1,
            "author": "neko_mancy"
        },
        {
            "level": 0,
            "comment": "Doscomfort, being out of your comfort zone and a bit of stress makes you grow.\n\nTrauma does the exact opposite, it halts you",
            "score": 1,
            "author": "Iluminiele"
        },
        {
            "level": 0,
            "comment": "Long and short there are generally two types of people those who break under the trauma and those who learn from it.\n\nIt CAN cause you to grow into a better person. If you are able to grow. But it can also permanently break you.",
            "score": 1,
            "author": "Gantron414"
        },
        {
            "level": 0,
            "comment": "I feel as if trauma has caused me to regress to a more safe place in my head.",
            "score": 1,
            "author": "PixelatedpulsarOG"
        },
        {
            "level": 0,
            "comment": "Depends how you define grow and what the trauma is",
            "score": 1,
            "author": "TundraTrees0"
        },
        {
            "level": 0,
            "comment": "No, it forces you to grow differently, but not more.",
            "score": 1,
            "author": "jesus-aitch-christ"
        },
        {
            "level": 0,
            "comment": "Yes and no, it destabilizes you but sometimes if you’re lucky makes you wiser but ages you before your time",
            "score": 1,
            "author": "missesalchemist111"
        },
        {
            "level": 0,
            "comment": "It has been said “that which doesn’t destroy you, only makes you stronger”. \n\nSome things you cannot bounce back from. Suicide wouldn’t be an issue if trauma made you stronger every time. Broken and damaged people who are a shell of their former selves are all too common.\n\nI think it’s more complex than that. Perhaps it’s what you do to recover from trauma that causes you to grow as a person and become more resilient, not the trauma itself.",
            "score": 1,
            "author": "Future_Ad_1930"
        },
        {
            "level": 0,
            "comment": "It changes you would be more accurate. Usually not in a good way but there are exceptions. For example, the trauma of watching your friend die of an OD might be what finally gets you to quit.",
            "score": 1,
            "author": "PowerObjective558"
        },
        {
            "level": 0,
            "comment": "Whatever kills you makes you stronger....I think that's what the song says.",
            "score": 1,
            "author": "BranchLatter4294"
        },
        {
            "level": 0,
            "comment": "Trauma is a bad thing; resilience is a good thing. But it can’t be forgotten or trivialised that people with trauma are damaged and sometimes don’t/can’t overcome it. It’s not weakness to suffer from trauma and it’s lucky if you can overcome it.",
            "score": 1,
            "author": "Tobybrent"
        },
        {
            "level": 0,
            "comment": "Yeah, cancer causes you to 'grow' more as a person too.",
            "score": 1,
            "author": "thestonedbandit"
        },
        {
            "level": 0,
            "comment": "HARDSHIP makes you grow as a person, not trauma",
            "score": 1,
            "author": "NewbieKing9"
        },
        {
            "level": 0,
            "comment": "Most people experience post traumatic growth due to our anti fragile nature.  We literally get stronger the more challenges we face and overcome. There are countless examples of this - clearly those of celebrities are the ones we tend to be familiar with, the late great Tina Turner being just one of a multitude, whose rags-to-riches-to-rags-to-mega-riches story is the basis of not only a biopic 1993 film, but a Broadway NY, and Westend London show. \n\nPost traumatic growth typically requires a person has a reasonable family life, or at least one loved one, usually family, but sometimes a friend who can offer emotion support.   People who have multiple negative situations stacked on each other are unlikely to experience post traumatic growth.  There are always some that do though, especially if they have religion or an equivalent belief system to help them process their thoughts.\n\nSadly many people get caught in a victimhood spiral and/or are never able to overcome their sense of anger of grief about what happened to them.  It’s very sad because these people remain a prisoner of their thought cycles and it can substantially reduce the quality and fulfillment of the rest of their lives.  Often it comes down to them dwelling on ‘Why Me?’ but failing to see the dispassionate statistical reality of life - ‘Why Not Me?’ No one is guaranteed a life free from violence, bereavement, poverty, drug abuse etc.",
            "score": 1,
            "author": "ChocolateSwimming128"
        },
        {
            "level": 0,
            "comment": "It can, but you have to put in a hell of a lot of work the be able to overcome the trauma which could leave you feeling stronger and more confident in yourself. Even then, sometimes a random trigger can tear down all your work.",
            "score": 1,
            "author": "mykidsarecrazy"
        }
    ]
}