{
    "id": "148ovjp",
    "score": 3,
    "title": "What work hours would you choose?",
    "author": "anaf28",
    "date": 1686688305.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148ovjp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m not sure where to post this but I have a feeling people have an easier time making these decisions than I do.\n\nMy workplace is offering two types of work hours, both of which are more than what I could ask for so I’m grateful for either.\n\n**Option 1:**\n\nDay1: 1PM - 7PM\n\nDay2: 1AM - 7AM\n\nFour days rest and repeat (I have to register my attendance at 7AM and 7PM in two of my off days)\n\nNo weekends or holidays. \n\nSalary: $56,600\n\n**Option 2:**\n\nOne or two days per week depending on the program so I still have four days off. \n\nThe work is always in the morning and it only takes 1-2 hours ( mostly 9AM-10AM) always before 2PM.\n\nI have to register my attendance at 7AM everyday (I can leave afterwards on my off days). \n\nHas weekends and holidays.\n\nSalary: $48,500\n\nI will make my own decision and right now leaning towards option 2 because I think it’s much easier to manage my day, but listening to opinions would really help. Thanks and sorry for english mistakes.",
    "comments": [
        {
            "level": 0,
            "comment": "If I'm understanding option 1 correctly, you would work 1PM - 7PM, then you have a 6 hour break from 7PM to 1AM, then you work again from 1AM - 7AM? Then you get four weekdays off until you need to work again?\n\nIf so, I would 100% go with option 1. Basically every week would be a single 12 hour work day + 6 hour break in between, with some weeks only being a 6 hour work day on Friday and then a 6 hour work day on Monday the following week.",
            "score": 1,
            "author": "Hipp013",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, I didn’t write it well, it’s not a 6 hours break between my first and second shift but rather 30 hours. I would work from 1PM - 7PM, then my next shift would be the day after next day from 1AM - 7AM. I also added the salary difference.",
                    "score": 1,
                    "author": "anaf28",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's even better in my opinion.\n\nGranted I'm a complete night owl, so I personally would thrive in that kind of job, but your preferences may differ.",
                            "score": 1,
                            "author": "Hipp013",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah the benefit of option 1 for me is more pay and if I was a night person it would help (I’m not exactly a night or a morning person).\n\nHowever option 2 is great because work is only one or two days a week so I’m still getting at least four days off like I do with option 1 and on the days I have work, it only takes 1-2 hours in the morning. I don’t mind working more but the fact that the work is only in the morning too would make my life much easier to manage compared to option 1 where I have opposite shifts. It also includes weekends and holidays for the family but overall less pay.\n\nIt’s hard to decide tbh.",
                                    "score": 1,
                                    "author": "anaf28"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "18 hours after 7pm is 1pm.  Do you mean 30 hours?",
                            "score": 1,
                            "author": "CogentCogitations",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I’m an idiot. 30 hours I just noticed lol.",
                                    "score": 1,
                                    "author": "anaf28"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Option 1 - I like knowing what I’m doing, when and for how long.",
            "score": 1,
            "author": "HerbertWigglesworth",
            "replies": [
                {
                    "level": 1,
                    "comment": "I noticed I didn’t add enough details for option 2. I hope it’s more clear now.",
                    "score": 1,
                    "author": "anaf28",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’ve made me switch my mind to two because the amount of time you need to work is so much less\n\nThe only ambiguity is this checking in everyday lark, that could get annoying\n\nIf I’m off work I want to be completely off work",
                            "score": 3,
                            "author": "HerbertWigglesworth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In option 1, I still check my attendance at 7AM and 7PM everyday regardless of my shift. It’s only two days of the week where I don’t check my attendance at all so I guess it’s not that much better in that regard either. I’m like you, leaning more towards option 2 tbh.",
                                    "score": 2,
                                    "author": "anaf28",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah I see that makes me even more in favour of option 2",
                                            "score": 1,
                                            "author": "HerbertWigglesworth"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In option 2, What do you mean by \"register your attendance\"?  Do you have to go into work everyday at 7am, just to leave afterwards?  Seems like a lot of wasted time.  What is the purpose?  Can they tell you that they need you on any given day so that you never know when your off days are?\n\nI think I would prefer option 1, because you would know when you are working, and you could plan things for your off days without having to worry about checking in.",
            "score": 1,
            "author": "CogentCogitations",
            "replies": [
                {
                    "level": 1,
                    "comment": "In option 2, I’d know what day of the week I’m working prior to that week, but it’s just the policy of the place to register at 7AM (morning only) regardless of which day I’m working (except for weekends). \n\nEven in option 1, I still have to register my attendance in two of my off days at 7AM and 7PM (the other two off days don’t require attendance registration because they’re equivalent to weekends if that makes sense).\n\nI get what you mean that it’s a waste of time and yes it’s pointless, but it’s common for both options.",
                    "score": 1,
                    "author": "anaf28"
                }
            ]
        }
    ]
}