{
    "id": "148pmtt",
    "score": 0,
    "title": "Tip for hair washer and hair stylist / colorist",
    "author": "Hmm-mom",
    "date": 1686690356.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148pmtt",
    "media_urls": [],
    "other_urls": [],
    "postText": "How much do you tip in 2023 at the hair salon? My cut/color done by the same stylist was $200. Another person washed my hair but she didn’t do a scalp massage or any other treatments. Figuring out the tips always gives me anxiety!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi /u/Hmm-mom,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I generally tip 20% but if I’m really happy with the service I’ll do 25-30%! But it’s tricky when you have two people helping out! I’d maybe see how much a wash costs and tip 20% on that.",
            "score": 1,
            "author": "upsidedownes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I’ll check how much a wash is next time. Does your hair salon let you tip on the card? \nMine only allows cash tips… $200 is easy to figure but when it’s not a round number and you also have to tip the hair washer my head starts spinning 😵‍💫 maybe I’m just bad at math lol",
                    "score": 1,
                    "author": "Hmm-mom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes thankfully they take card and I can just press the percentage I want to tip, makes it easy!!",
                            "score": 1,
                            "author": "upsidedownes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It really depends. My stylist hired someone to help her shampoo and dry, and she raised her rates accordingly. But her hiring that person benefitted her, not me, and I’m already paying more for it than when it was just her. As such, for just a basic shampoo, I’ll usually tip $5-$7.",
            "score": 1,
            "author": "Feeling-Visit1472"
        },
        {
            "level": 0,
            "comment": "I tip big because I just get a haircut and it’s not that expensive. They have the tip iPad screen so i hit the largest amount — it’s either 30% or 35%. My wife has more stuff done and has bills of $130-$185 and I think she tips 15%. At the places we go, the stylist does the wash. Most of the time I walk there right after a shower, so she doesn’t do the wash at all.",
            "score": 1,
            "author": "Azdak66",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish they had a tip screen! That would make it much easier. You can only pay tips in cash where I go.",
                    "score": 1,
                    "author": "Hmm-mom"
                }
            ]
        }
    ]
}