{
    "id": "148pq89",
    "score": 0,
    "title": "Would you think it was weird if your coworker never ate lunch?",
    "author": "aisosareva0413",
    "date": 1686690619.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148pq89",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently started a new job and I don't eat lunch. I really don't want people to start asking questions about me not eating lunch.\n\nEdit: We don't really have lunch breaks we just eat with the kids we watch. Also this is my first job and I already don't really fit in so I'm not trying to make it worse",
    "comments": [
        {
            "level": 0,
            "comment": "No. I wouldn’t care.",
            "score": 5,
            "author": "TheHappiestJew"
        },
        {
            "level": 0,
            "comment": "Not really. Why arent you eating lunch?",
            "score": 3,
            "author": "Pastadseven",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel better when I don't",
                    "score": 1,
                    "author": "aisosareva0413"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Probably on a diet\", \"maybe has stomach issues\", \"could have had a big breakfast\", or \"plan on eating a big dinner\".  Either way it's none of my business.",
            "score": 3,
            "author": "_Mr_Butlertron_"
        },
        {
            "level": 0,
            "comment": "No, I don’t either. If anyone asked I’d say ‘I don’t feel hungry when I’m busy, I eat a big meal at dinner usually.’ Which is the truth.\n\nGet ready for people’s opinions and practice smiling politely and nodding. I also had to assure people I snack when I’d like or take the occasional lunch. \n\nYou don’t have to overthink it, most people are too busy to notice / appreciate your helpfulness so they can take a break.\n\nDo be careful to manage your energy, working with kids is rough and you need your moods and focus on peak. Not eating takes a different meaning (I do eat when with kiddo).",
            "score": 2,
            "author": "mayfeelthis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. I do rather well with just smiling and nodding. I usually say I'm okay and don't need lunch (although that isn't the case), but they usually don't push me for answers. \nBut yeah it gets hard working with the kids, especially since it's an 8 hr shift, and I'm like 17 with no prior experience working, but I'll figure it out.",
                    "score": 2,
                    "author": "aisosareva0413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What’s the issue? If you don’t mind me asking.",
                            "score": 1,
                            "author": "mayfeelthis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like why I'm not eating?",
                                    "score": 1,
                                    "author": "aisosareva0413",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea. You said it’s not because you don’t need lunch. \n\nMaybe someone can help with the real issue, if you  would like to share. Not to pry. 🤐\n\nYour main question, don’t worry what people think.",
                                            "score": 1,
                                            "author": "mayfeelthis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh that. Yeah I have terrible body dysmorphia and the ed (pro-ana) sties definitely don't help. I just restrict as much as possible. I don't want to say I have an eating disorder because I know people with that are going through something serious so I don't want to compare what's going on with me to that. But I do tend to have bad eating habits sometimes, I just kinda never commit to it",
                                                    "score": 1,
                                                    "author": "aisosareva0413",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sorry to hear you struggle with that. I don’t know about it specifically. \n\nThere’s no need to compare struggles imho. Even to the person who has it all/nothing, their worst pain is still their worst pain. We can all sympathise I’d like to think. \n\nFrom what I recall when I was young I’d weigh myself daily and even multiple times a day, workouts, from a very young age. Then I had a phase of not caring (or pretending not to…). It took a long time to really love myself, and now I feel like it’s possible to truly really love yourself enough to be sufficient and even glow (without trying/validation).\n\nFeel free to DM if it helps, happy to chat in general.\n\nIf it helps, remember to eat enough to keep your sugar and energy in check, lots of water. If you see your moods fluctuate take breaks, track your caffeine too. \n\nI say this cause kids can be highly triggering - it took me learning how to track my son’s routine and hangry etc. and following it a bit, to get me in habits of eating during the day and so on. You learn from managing them cause it’s the same basic biology, and we can’t outsmart biology so I suggest keep the minimum you can and know how you feel at different times (your needs). \n\nOn the flip side as a parent knowing what I know, I’d be concerned for your well-being and also acknowledge your ability to deal with and help chaotic kids relies on that. \n\nIn short, just take care of you first and foremost. Have fun with the kiddos!\n\nPeople wouldn’t think to guess or talk about why you don’t eat. Those that do would be out of line and gossips (I don’t rely on such talk and think less of them than you if I heard it).\n\nETA: Other signs to keep an eye on, shakiness, dizziness, nerves/sensitivity, dry mouth, these can all be linked to dehydration and/or low sugar. Talk to your doctor, they’re really good about telling you good minimums and what to keep an eye out for.\n\nSorry for the unsolicited advice 🫣😶",
                                                            "score": 1,
                                                            "author": "mayfeelthis"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think I would even notice, but depending on where you are and your terms of employment, a lunch break may be mandatory.",
            "score": 1,
            "author": "GaiusOctavianAlerae",
            "replies": [
                {
                    "level": 1,
                    "comment": "We don't have lunch breaks but we eat with the kids we look after when they have lunch",
                    "score": 1,
                    "author": "aisosareva0413"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think I'd notice. Even if you don't eat, I recommend going for a walk or something so you aren't just sitting still all day though",
            "score": 1,
            "author": "TheApiary",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh I don't sit still all day I move around",
                    "score": 1,
                    "author": "aisosareva0413"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't notice.",
            "score": 1,
            "author": "La-Boheme-1896"
        },
        {
            "level": 0,
            "comment": "I likely wouldn't notice and definitely wouldn't care.",
            "score": 1,
            "author": "apairofpetducks"
        },
        {
            "level": 0,
            "comment": "Yes, I always spend my launch break starring at what others are eating or not instead of eating my own launch.",
            "score": 1,
            "author": "SunBlindFool",
            "replies": [
                {
                    "level": 1,
                    "comment": "When’s the next launch?",
                    "score": 1,
                    "author": "Firm-Reception-8541",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As soon as a launch this burgers into my mouth.",
                            "score": 1,
                            "author": "SunBlindFool"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i would wonder if theyre okay but i wouldnt say anything.",
            "score": 1,
            "author": "tastystarbits"
        },
        {
            "level": 0,
            "comment": "I used to never eat lunch, trust me nobody cares",
            "score": 1,
            "author": "Firm-Reception-8541",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good to know. I just had a few people asking me questions, so I got nervous",
                    "score": 1,
                    "author": "aisosareva0413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would sometimes get the “are you not eating?” Just out of curiosity and I’d answer and they move on lol",
                            "score": 1,
                            "author": "Firm-Reception-8541"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now that I think about it in every work environment I've been there's pretty always been at least one person who wouldn't eat lunch, it's not that uncommon.",
            "score": 1,
            "author": "nexvanshisha"
        },
        {
            "level": 0,
            "comment": "Would you care if somebody else didn’t eat lunch? \n\nIt would be weird if you didn’t take your lunch break though.  Even if you don’t eat, go for a walk or chill out",
            "score": 1,
            "author": "ManInThe-Box-"
        }
    ]
}