{
    "id": "148qjvz",
    "score": 529,
    "title": "When did \"woke\" become a bad thing/ political point?",
    "author": "pokemaster784584",
    "date": 1686692817.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148qjvz",
    "media_urls": [],
    "other_urls": [],
    "postText": "When I first heard people using the word \"woke\" in the context that you usually hear it lately, I thought it meant \"enlightened.\" I thought it was a way for people to say that they had challenged their beliefs and came to a new conclusion. I don't see anything wrong with that, so why is \"woke\" now used as an insult? You hear it in political ads, saying that they'll defeat the woke mob. That just sounds like old-fashioned intolerance to me.",
    "comments": [
        {
            "level": 0,
            "comment": "Many words have basically lost all meaning. People have limited vocabularies and instead sling buzzwords and slang around even when the context isn’t correct. I think it’s a consequence of social media more than anything else. And honestly that’s probably just how languages develops in general but it’s on larger and faster scale now for certain words/phrases.",
            "score": 511,
            "author": "dhsdajsbdfbg",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Many words have basically lost all meaning.\n\nLiterally.",
                    "score": 377,
                    "author": "RiskilyIdiosyncratic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see what just happened",
                            "score": 78,
                            "author": "IDUNNstatic"
                        },
                        {
                            "level": 2,
                            "comment": "Fuckin got me",
                            "score": 15,
                            "author": "dhsdajsbdfbg"
                        },
                        {
                            "level": 2,
                            "comment": "Literally has been used figuratively for hundreds of years, in my understanding.",
                            "score": 52,
                            "author": "iTwango",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think \"literally\" has become similar to \"really\".\n\n\"I was really starving!\" is seen as an approrpiate exaggeration for when you were just very hungry. i.e. you really weren't starving, but no one cares that you use the word 'really'.",
                                    "score": 24,
                                    "author": "Salindurthas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Use of the word “literally” bugs me for some reason. Most of the time if people left the word out of the sentence the meaning would be the same, e.g. “It literally took me 5 minutes to get here.” Take out literally and the sentence is the same.\n\nLiterally used to be reserved for cases when a sentence would normally be interpreted figuratively, e.g. “He died laughing.” Adding literally let’s us know that someone really died while they were laughing. \n\nI sometimes play video games and if a weapon is really good people will call it “broken”. Sometimes people will say, “This weapon is literally broken.” But if it were literally broken it wouldn’t work at all.",
                                            "score": 3,
                                            "author": "PretentiousVapeSnob",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Rob Lowe would like to speak to you. Literally.",
                                                    "score": 6,
                                                    "author": "NissassaWodahs",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You are correct. Usage of literally as a hyperbolic intensifier dates back to 1769.",
                                    "score": 21,
                                    "author": "My_Evil_Twin88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hyperbolic Intensifier sounds like a death metal\nsong title",
                                            "score": 6,
                                            "author": "Wan_Lembo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Name of your mum's dildo",
                                                    "score": 3,
                                                    "author": "RKips",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "😂😂😂",
                                                            "score": 2,
                                                            "author": "Skeltrex"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And yet some language pedant will always pop up when it's used that way.\n\nSame as the wierdos from 10 15 years ago with their \" it's 'he and I' not 'me and him' \" schick. Litterally no normal human speaks like that.",
                                            "score": 0,
                                            "author": "Flyinmanm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right?\nLanguage prescriptivists are irritating as all get out. I just roll my eyes at them.",
                                                    "score": 1,
                                                    "author": "My_Evil_Twin88"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Awesomely cool fact.",
                                    "score": 7,
                                    "author": "omniplatypus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wish they still gave out free awards because this literally made me chuckle. Thanks.",
                            "score": 6,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "For those who don't know, \"literally\" now means, officially, either \"literally\" or \"virtually,\" \"figuratively,\" \"simply/just,\" or is used for emphasis.\n\nI just, literally, double-checked in Miriam Webster's and Cambridge's dictionaries. ...And isn't THAT clear as mud?",
                            "score": 2,
                            "author": "YourLifeCanBeGood"
                        },
                        {
                            "level": 2,
                            "comment": "It hasn't really lost meaning.  You have a fairly accurate understanding of what woke means.\n\nPeople who are not woke, according to this definition, decided to try and rebrand.  Anti-woke just means not woke, but they tell themselves that it is a badge of pride.  They are literally just saying the quiet part out loud and should be treated as such.\n\nThe \"woke mob\" is a strawman of their creation.",
                            "score": 2,
                            "author": "DudeEngineer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Literally, gaslighting, woke, fake news, groomer, socialism, fascism...anytime social media gets something trending, the meaning seems to degrade quickly.",
                    "score": 88,
                    "author": "SergeantChic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The one I always think of is “gay”. Went from meaning “happy, joyous” to a slang for homosexual, to a slur or insult, and back to another name for homosexual, and now it’s a combo of all of those depending on how it’s used. All within a relatively short time frame",
                            "score": 21,
                            "author": "DanteSensInferno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a lot of gay stuff in lord of the rings",
                                    "score": 7,
                                    "author": "hirvaan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[Indeed](https://youtu.be/h_9ATQFgu9o)",
                                    "score": 3,
                                    "author": "VerendusAudeo"
                                },
                                {
                                    "level": 3,
                                    "comment": "There was also a phase where gay meant \"thats dumb/stupid\"",
                                    "score": 2,
                                    "author": "Opposite-Egg3334",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean it’s literal meaning didn’t change it was just slang",
                                            "score": 2,
                                            "author": "xdisappointing"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also ‘introvert’ and ‘extrovert’. But then I’d also argue that language changes and it’s inevitable, yes it’s happening faster but it’s just part of its nature.",
                            "score": 13,
                            "author": "patchyprincess08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait, people are using extrovert and introvert wrong? In what way? I don't think I've encountered that one yet.",
                                    "score": 4,
                                    "author": "cardboard-kansio",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Basically people say introvert and extrovert based on what people enjoy vs what strains them. \n\nAn extrovert is someone who is rejuvenated by social interaction, and tires out when forced to be alone for long periods. An introvert is the opposite.  \n\nBut people will call those who enjoy social interaction an extrovert even if they’re not. \n\nI am an introvert. Social interaction is exhausting and I’m at my best mentally when on my own. But I do enjoy companionship and being social, so I make an effort to do it as much as I can stand it. Because of this, people wrongly assume I am an extrovert.",
                                            "score": 12,
                                            "author": "RASPUTIN-4",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can we add narcissist to that list? If I never hear it again I will be just fine.",
                            "score": 2,
                            "author": "GusSwann"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly ✍️",
                    "score": 5,
                    "author": "KhaultiSyahi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a non-American living in a non-English speaking country, I first heard the word about 8 to 10 years ago to refer to how we had learned as a society to better understand racism, abuse, mental health and so on. Then I heard nothing of it for about 3 years and when I did it had turned into a word to refer to the people who pretend to care about current affairs just to gain internet points and better sales for their products and brands. \nLately I just see it thrown around like a meaningless buzzword.",
            "score": 257,
            "author": "kay_candy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has to be most people's experience right? Or maybe we just aren't normies lol",
                    "score": 36,
                    "author": "Richard-Long",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m not gonna lie, when I first saw the word “woke” as a middle schooler on Instagram, it was always used ironically by accounts like worldstar. I only ever see the word used by conservatives now, and don’t think I’ve ever seen someone on the left unironically call themselves woke. Maybe I just live under a rock 🤷‍♂️",
                    "score": 7,
                    "author": "TheBreakingBadger",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think when BLM started to really kick off is when people started turning it into a negative term. It was originally used (at least in my awareness) as a teen to described someone who was aware of the issues black people go through in America. It was typically associated with the black community, and being “woke” meant you were aware of more systematic issues of America than what is typically taught\n\nBLM and 2016 is really when leftists were beginning to get demonized with 50 million “SJW Owned Compilation” swarming the internet. As BLM began getting demonized by the right, “woke” began to get applied to anything relating to progressivism. It was originally meant for a specific issue, but the scope widened when the right began non-stop attacking anything on the left. Soon, they began to refer to anything progressive as “woke” because they began to associate it with the left in general\n\nAs time moved forward, “woke” underwent a transformation from relating to black America, to almost any progressive cause/issue, and now it’s just used as a buzzword for conservatives to fan the flames of a nebulous and non-existent boogeyman",
                    "score": 15,
                    "author": "DreamedJewel58",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the best explanation here. It's important also to point out that conservatives started to take progressive/liberal points and created an opposite talking point to fight back. If Michelle Obama started a garden at the White House Sarah Palin came out and said \"they want you to eat broccoli but we want to eat cookies\" I'm paraphrasing but you get the point. Once the word woke was literally stolen by Desantis it became everything that is opposite to the conservative agenda...",
                            "score": 3,
                            "author": "Critterhunt"
                        },
                        {
                            "level": 2,
                            "comment": "It was already a negative before BLM. That was caused by sanctimonious preaching and chasing people with other views into their own spaces to protest then having those views.",
                            "score": 2,
                            "author": "Cheap_Ad_9946"
                        },
                        {
                            "level": 2,
                            "comment": "This is the story they tell you in woke Sunday School so that the woke religion sounds like the victim of society rather than the other way around. Your explanation is part of the problem with the woke religion. And you might even be completely unaware of how it has affected you. I don't blame you, but if you read John McWhorter's book on Woke Racism, you will see that a much more sinister thing has happened with the ideology of those people who claim to be woke. More than a cult, it has become a religion and with religion comes religious prosecution. \n\nJohn McWhorter is neither conservative nor white. He has studied language for most of his life and he is a celebrated Linquist and scholar. He writes a column in one of the big papers (New York Times, I believe) and his analysis of the current situation in this country is eye opening.\n\nWhile the members of this woke religion are trying to avoid any criticism by claiming that the right wing politicians are saying unfounded hateful things about them, the truth is much more important. Please read the book or listen to it on Audible. He does a much better job of explaining the woke religion in context and why we must as a society stand up to this damaging ideology. Sincerely and with all due respect, please check it out.",
                            "score": 0,
                            "author": "CuirPig"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's just rebranding of SJW or social justice warrior.",
            "score": 293,
            "author": "Diagonalizer",
            "replies": [
                {
                    "level": 1,
                    "comment": "which is rebranded political correctness",
                    "score": 143,
                    "author": "ZenkaiZ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is rebranded \"bleeding heart liberals.\"",
                            "score": 115,
                            "author": "impossible_apostle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is rebranded \"basic human decency.\"",
                                    "score": 72,
                                    "author": "TheBaalzak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When used in a negative context (as it is most often these days), \"woke\" usually means strong virtue signaling combined with a lack of sincere respect for other people - that is, selfishness under the guise of altruism.",
                                            "score": 90,
                                            "author": "Versaill",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some philosophers would debate that all altruism is selfish in that altruistic individuals tend to believe their actions make a better world for themselves.",
                                                    "score": 52,
                                                    "author": "MrWindblade",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My Muslim philosophy prof graded my paper really low when I wrote about public altruism potentially being selfish. Fuck that dude",
                                                            "score": 13,
                                                            "author": "Maels",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ve been trying to come up with an example of a truly selfless act. Perhaps someone who whilst sleepwalking, donates to a charity they don’t support, and doesn’t remember they’ve done it.",
                                                                    "score": 7,
                                                                    "author": "malapalalap",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Self sacrifice. The dude diving on the grenade acts on selfless instinct to save others. And it happen so quickly that they don't have time to think \"oh I'll be dead but people will love me for what I did.\" They just do it regardless.",
                                                                            "score": 3,
                                                                            "author": "KnowNothing3888",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ya anything that involves the legitimate threat of death really. Diving to push a child out of the way of traffic for example.\n\nI took a class in Primatology in college and the way we examined altruism in vervet monkeys was looking at how they make calls (different calls for different kinds of predators) to warn the others in their group to run away. That however draws the attention of the predator and if they’re already poised to strike, possibly triggering their attack reflexes, increasing their chance of the monkey who gave the warning being killed, which means not passing on their genes (or at least not as much if they’d already reproduced. Altruism is something evolutionary biologists talk about quite often because it seems kind of counterintuitive for it to develop and there’s not a solid consensus on how it develops in an evolutionary context (unless something’s changed since I was in school).",
                                                                                    "score": 2,
                                                                                    "author": "Choreopithecus"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That's certainly the steelman position, but then you have stuff like [Charlie Kirk worrying whether his ketchup and mustard is woke](https://twitter.com/mmfa/status/1668671897716895755) and you really have to wonder if this word even literally means anything at all these days.",
                                                    "score": 28,
                                                    "author": "GabuEx"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Huh, so when someone like, say, Ron DeSantis says he will destroy the \"woke mob\" and that \"Florida is where woke goes to die\", what he's really saying is, he understands the systemic injustices that affect certain oppressed minority groups, but dislikes the idea that corporations and other organised groups are paying lip service to this problem falsely portraying themselves as allies to them, and will take steps to ensure that these groups are held accountable in their efforts to sincerely respect and provide material backing for said minorities at their own expense, rather than merely espousing meaningless platitudes and the thin veneer of support for the selfish purpose of public relations, consumer goodwill and financial gain?\n\nThese conservatives seem awfully bad a their messaging. Weren't these the same people that refused to believe \"defund the police\" could mean anything other than \"abolish police entirely\"? These are the people who are now saying \"we must end the woke mind virus\" when what they really mean is, \"corporations are profiting from pretending to be woke, but their actions aren't woke *enough*\"? How odd.",
                                                    "score": 9,
                                                    "author": "aqhgfhsypytnpaiazh",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No, it's anything the far right doesn't like.",
                                                    "score": 22,
                                                    "author": "RiskilyIdiosyncratic",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That too, but more often than not its a dogwhistle indicating you should care more about money making than helping others. A lot of it goes back to Ayn Rand rejecting altruism as fake imo.",
                                                            "score": 11,
                                                            "author": "CherryShort2563",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "More often than not it’s a dog whistle indicating you pretend to care more about helping others than money, but don’t. Few people beating that drum are housing immigrants, or otherwise giving up their standard of living so marginalized people can enjoy a similar stature in life.",
                                                                    "score": -2,
                                                                    "author": "3Snowshoes"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Woke = White Savior is what I see, and I am a full blown lefty that finds it amusing these people don't realize how racist their behavior is.",
                                                    "score": -2,
                                                    "author": "DrMooseknuckleX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm a left leaning minority and that's what I see too.\n\n \"Liberals\" will defend the word and deny/play dumb that anyone who disagrees with \"woke\" is a bigot. But like you said, they don't realize how racist their behavior is. \"Woke\" people treat minorities like tokens and like we're children who don't know what's best for us.",
                                                            "score": 14,
                                                            "author": "icecoldteddy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"OH, I need to speak up on this oppressed person's behalf, because they don't have a voice\" bitch, they have voices and can use them in situations when they feel like it is needed. Maybe they don't want to argue with the drunk dude with multiple white pride tats because they already know it is pointless.",
                                                                    "score": 8,
                                                                    "author": "DrMooseknuckleX"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Which is just rebranded “love thy neighbor”",
                                            "score": 10,
                                            "author": "ImightHaveMissed",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh the irony that those people are too stupid to comprehend.",
                                                    "score": 2,
                                                    "author": "Rioraku"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. Conservatives fused \"virtue signaling\" and \"social justice warrior\" into \"woke\".",
                    "score": 36,
                    "author": "CherryShort2563",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "AKA memes that reddit used to mock on the front page before tumblr invaded and killed reddit",
                    "score": 3,
                    "author": "ObviouslyHeir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When conservatives learned about it some 30 years after everyone else.",
            "score": 37,
            "author": "2pacalypso",
            "replies": [
                {
                    "level": 1,
                    "comment": "Conspiracy theorists were calling themselves woke for decades. Wake up, don't be a sheeple!",
                    "score": 5,
                    "author": "CheekyClapper5",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "A republican lawyer defined woke in court as \"being aware of systemic injustice.\" Like it's a bad thing to know the system is fucked and needs to be changed...",
            "score": 55,
            "author": "knoegel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ironically, around that time, Fox News was running a story saying Microsoft was \"gone woke\" for adjusting power saving options on the Xbox console.\n\nWhatever conservatives dislike...automatically is \"woke\".",
                    "score": 2,
                    "author": "Patriot009"
                },
                {
                    "level": 1,
                    "comment": "Usually it's because the person raging against the wokeness is benefitting from the inequality as it exists.",
                    "score": 6,
                    "author": "OWSpaceClown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Woke\" was always a political word. it was originally used in the black civil rights movement in america. the original intended meaning of the word according to the definitions I find when I search it up online is \"a black person who is aware of the systemic oppression black people face in the country\"\n\nwhich I find is an important bit of context considering that today this word is only really used by white racist people as an insult toward groups and movements that seek civil rights such as queer peoples but also still to this day black people who are of course still oppressed.",
            "score": 109,
            "author": "PomegranateHot9916",
            "replies": []
        },
        {
            "level": 0,
            "comment": "'Woke' originally meant being aware of racial equality and racism in the American government. It was created by black people for black people to stay aware of everything happening. But now conservatives have turned it into a fear-mongering buzzword, almost on the same level as communism or socialism. It's just a means to keep people scared and uneducated.",
            "score": 52,
            "author": "the-overloaf",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"almost on the same level as communism or socialism\". Not \"almost\". There's a whole series of videos on YouTube that flat out equate wokeness to Marxism ☹️\nGo to YouTube and search for \"New Discourses\".",
                    "score": 14,
                    "author": "MagnetoXMN"
                },
                {
                    "level": 1,
                    "comment": "words are trippy. they have power like money but hold almost no value in themselves. a placeholder for experience i tend to say.",
                    "score": 2,
                    "author": "unpopularopinion0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just in the last year or two, Republicans and conservative media started using \"woke\" to basically mean \"anything progressive or liberal we don't like\". They're trying to do the same thing to \"woke\" that they've done to \"socialism\", where they turn it into a vague, scary, bad word that riles up their base without worrying about what it actually means.",
            "score": 60,
            "author": "EdgeOfDreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "double-plus ungood.",
                    "score": 10,
                    "author": "Tazling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This guy Orwells",
                            "score": 3,
                            "author": "slobs_burgers"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On the other side, Woke was something to attach to, in a effort to appear more progressive. \n\nThis scene from the boys gets it perfectly.\n\nhttps://www.youtube.com/watch?v=dizQ\\_Yjx\\_1Q",
                    "score": 4,
                    "author": "mentholmoose77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When the right found a new shiny toy to play with, and threw away sjw, politically correct, coastal elites, etc… they’re a cultural war whack a mole.",
            "score": 12,
            "author": "-Epitaph-11",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Woke-ism threatens those that wishes to be able to maintain their discriminatory lifestyle. They also tend to be rich and powerful, but know that they are still few in power. By converting a good chunk of the population to fear these \"woke ideals\" they can maintain their power without having to actually do anything.",
            "score": 3,
            "author": "mxldevs"
        },
        {
            "level": 0,
            "comment": "It's republican spin. They use it for anything they don't like.",
            "score": 61,
            "author": "beetnemesis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like dems and “racist” “bigoted” etc",
                    "score": -56,
                    "author": "Lagith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[It's really not the same](https://twitter.com/mmfa/status/1668671897716895755?t=qH3oQQ9Z81kZhlObDxT5Gg&amp;s=19)",
                            "score": 30,
                            "author": "beetnemesis",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "So what words would you use to describe people that are racist and bigoted?",
                            "score": 3,
                            "author": "Rioraku",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "when they subconsciously characterized black speech and grammar, you get far away enough on the age and SPF chart that's a coded slur",
            "score": 7,
            "author": "Fondren_Richmond"
        },
        {
            "level": 0,
            "comment": "Next time someone starts ranting about \"woke\", ask them what they mean. It usually causes them to give some bizarre answer similar to \"I can't tell you exactly, but I know what it means\". Basically, they are telling you they don't know shit about what they're talking about but are more than willing to answer a dog whistle like a dutiful hound.",
            "score": 14,
            "author": "whippet66",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard this in the internet, but it’s not true in real life. People know that it just means SJW brand of liberalism.",
                    "score": -3,
                    "author": "Passname357",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's not what it means. It means to be aware of racial oppression. White people on both sides are working overtime to change the definition.",
                            "score": 5,
                            "author": "mumblesmcmumble",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a black man who has studied linguistics: thank you for whitesplaining this to me.\n\nGrowing up we used the term to talk about racial oppression and conspiracies more generally but also about spiritualism. That’s all true.\n\nIf enough people use a word incorrectly for long enough, though, a new valid definition arises. Grammar and usage are defined descriptively, as most people know by now.",
                                    "score": -7,
                                    "author": "Passname357",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;thank you for whitesplaining this\n\nAnd yet you literally said the same thing as he said. You're just looking to be reactionary for the sake of being reactionary. This is why the rest of the world doesn't like Americans, regardless of skin colour.",
                                            "score": 4,
                                            "author": "cardboard-kansio"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's been around to some degree for a while.  It got much bigger with Trump though.\n\nHe enabled terrible people to stop using their inside voices when thinking terrible things.  So rather than privately hate women, minorities, liberals, they could outwardly speak those awful and hateful thoughts.\n\nObviously there was pushback to this hate speech.  But how do you defend hate speech?  You can't really.  So you use a vague sounding term to turn it around, to imply that it's not your hate speech that's the problem, it's the people who push back against your hate speech that are the problem.  So \"woke\" became that term.  You can't really defend \"non whites are terrible\" but you can just say \"oh, you're just too woke!!\" when you get criticized for it.\n\nIn short, it has been around, but became a term (along with \"cancel culture\") used a lot more often because hateful people were grasping at straws to defend their hate.",
            "score": 5,
            "author": "BigMax"
        },
        {
            "level": 0,
            "comment": "People use woke to make fun of the insane left wing nut jobs that you can see on videos screaming because someone accidentally referred to them as the wrong pronouns or people crying because Trump became president and started calling him “literally Hitler”.",
            "score": 7,
            "author": "X3-RO",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well, it gets really confusing actually. Ron DeSantis, who made the Stop WOKE act, had to provide a definition. \n\n\"[Testifying during the trial challenging the suspension of Hillsborough County State Attorney Andrew Warren — who pledged not to criminalize abortion — they were asked to define woke.  “It would be the belief there are systemic injustices in American society and the need to address them,” DeSantis General Counsel Ryan Newman said, as reported by Florida Politics.](https://www.miamiherald.com/opinion/editorials/article269675311.html)\"\n\nSo I ask you, why do you want to fight so hard against something like this?",
            "score": 3,
            "author": "CultureFet"
        },
        {
            "level": 0,
            "comment": "Better woke than dope.",
            "score": 2,
            "author": "Tobybrent"
        },
        {
            "level": 0,
            "comment": "The same folks who co-opted Christianity, then the American Flag, are now co-opting words.",
            "score": 2,
            "author": "Striking_Fun_6379"
        },
        {
            "level": 0,
            "comment": "Everything eventually becomes a bad thing because the extremes hijack it to further their personal agenda.",
            "score": 2,
            "author": "SirHovaOfBrooklyn"
        },
        {
            "level": 0,
            "comment": "It's not, it's just a general Republican mud slinging name for Democrats, liberals, left wing extremists, woke left, etc...\n\nIt has nothing to do with the original term.",
            "score": 2,
            "author": "ItsmeMr_E"
        },
        {
            "level": 0,
            "comment": "When the beneficiaries of systemic oppression were outed and it started blowing back on them.",
            "score": 2,
            "author": "maybesomaybenot92"
        },
        {
            "level": 0,
            "comment": "It's been sometime in the past 8 years or so, originally it was a positive thing, but now it basically is conserva-code for \"liberal\" or \"anything we perceive as left\". Just more political tribalism.",
            "score": 2,
            "author": "flauros23"
        },
        {
            "level": 0,
            "comment": "‘I thought it meant ‘enlightened’’. This is the whole premise of the word being used as an insult; it’s mocking people for believing that they’re oh-so-enlightened. It’s essentially sarcasm.\n\nIt’s the same thing with ‘social justice warrior’. Those using it as an insult are not doing so because they’re in favour of social injustice. They’re mocking people who are self-righteous enough to see themselves as warriors for social justice, noble freedom fighters, just because they made a few whingey tweets and maybe showed up at a student protest. \n\nJohn McWhorter uses the phrase ‘the elect’ in a very similar way.\n\nI’m not going to scroll down and read the other replies, because quite frankly I think I can imagine the sorts of things Reddit will have to say about this haha",
            "score": 2,
            "author": "Pretty-Sympathy5463"
        },
        {
            "level": 0,
            "comment": "The evolution of \"woke\" happened in three phases:\n\n1. Black activists in the 20th century used the term to refer to being aware of the inequality and injustices baked in to society. \n2. In the early 21st century, clickbait bloggers started to use the term in articles about anything that they could spin as a crime against identity politics. This made the term an easy target for mockery because it was used in relation to some absurd ideas and was used by non-AAVE speakers, making them sound fake and stupid. \n3. Conservatives picked up on the absurd use of the word and made it a focus for mocking the identity politics movement. \n\nPeople get confused about how this shift happened because they think it goes straight from point 1 to point 3 and they ignore point 2, in the middle.",
            "score": 2,
            "author": "99thLuftballon"
        },
        {
            "level": 0,
            "comment": "Very real social issues that actually affect people on a day-to-day basis got co-opted by bored normies and big corporations that wanted to sell shit, and people with bad-faith arguments started to pick up on this pattern.\n\nModern society doesn't provide a lot of chances for people to do something for others and genuinely feel good about it. We don't have a big collective struggle like a world war, we don't have to beat the Soviets, and most younger people have abandoned religion. So there's a general lack of purpose and a growing sense of isolation, combined with an ever-increasing saturation of social media.\n\nSo a lot of affluent (mostly white) people who are bored and have no sense of purpose decide to learn about the rest of the world around them and make the shocking discovery that systemic racism/sexism/bigotry XYZ is very much real and alive. Great. They make it a point to share this realization with everyone they know and talk about how they're actually an ally and it's other white people's fault and how they're so self aware and bam - black square on Instagram, BLM merch, let all the women you want to get laid with know how much of a feminist you are, the list goes on. What are these people doing to actually alleviate the struggles that marginalized groups face? For most of them, probably nothing. The only person getting any benefit is the person who's proclaiming these issues and \"spreading awareness,\" which is to say just spreading awareness to other people who won't do shit except \"spread awareness.\" They pat themselves on the back and feel good about themselves, because they have better morals than all those Trump voters.\n\nMeanwhile, corporations see that young people value things like equality and diversity, so they tell ad agencies to hire a checklist of every marginalized demographic or identity they can think of. They make their ads to show how inclusive they are, all in the hopes that they can sell more stuff (which was probably made in a third-world country sweatshop by some ninth-generation victim of colonialism).\n\nA lot of right-wingers (who want to grind their axe on an out-group and feel less insecure about their aging cultural identity) rightfully see this hypocrisy and call it out as being \"woke.\" People on the left take the bait and react, and thus we get the current iteration of the Culture Wars.",
            "score": 2,
            "author": "Available-Subject-33",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a throwaway word it's meaningless.\n\nGood woke? Bad woke? What is someone woke about? Higher resolution thinking required!",
            "score": 2,
            "author": "Waratah888"
        },
        {
            "level": 0,
            "comment": "It's the right wing boogieman, anything they don't like is now woke",
            "score": 2,
            "author": "Riipley92"
        },
        {
            "level": 0,
            "comment": "Well it’s more the mentality at this point rather than the intentions. Regardless of who is using it at this point its trying to replace it opposition with the same o’fashioned intolerance but with this new way. Started out great and probably still holds value in terms of changing negative narratives. But take it back to crying wolf as a easy analogy, we have to be able to hear the cry’s and trust they are cry’s for help versus cry’s for confrontation. The lines seems to be blurred there between users. To many cry’s for confrontation detours cry’s for conversation. Which is what we all know we need. Sometime people don’t know what they are asking for or know how to ask for it. So between interpretations and expressions we further blur the lines person to person. It’s important to listen to what someone is saying and try to understand what they are saying place yourself in their position and question the perspective across from you.",
            "score": 2,
            "author": "MacxScarfacex32"
        },
        {
            "level": 0,
            "comment": "The Cons made a concentrated effort to demonize the word. Woke also means: Woke is an adjective derived from African-American Vernacular English (AAVE) meaning \"alert to racial prejudice and discrimination\".",
            "score": 2,
            "author": "Green-Collection-968"
        },
        {
            "level": 0,
            "comment": "When conservatives realized that nobody wanted to vote for them based on their actual policies and decided that hatred for “the other” was a better motivator.",
            "score": 2,
            "author": "dwreckhatesyou"
        },
        {
            "level": 0,
            "comment": "basically, its not an insult really... when people hang shit on someone for being woke, they are really just saying \"i am an ignorant piece of shit\"... and you can disregard anything they say from then on.",
            "score": 5,
            "author": "PorridgeButterwort"
        },
        {
            "level": 0,
            "comment": "Republicans don't have any actual ideas, policies, or platforms, so their party priority is \"oppose anything the left supports\" - \"woke\" is the catch-all term which encompasses this idea.  So anything about protecting the environment, racial equity, visibility for minorities, etc, now falls under the \"woke umbrella\" and therefore must be opposed.",
            "score": 16,
            "author": "CustosEcheveria",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is not that they don't have a platform, they do. 1) Stick it to the libs. The end, it's just that one thing. They are very simple people.",
                    "score": 8,
                    "author": "iamjonjohann"
                },
                {
                    "level": 1,
                    "comment": "They do have a platform. Conservatism all throughout history, in every time and place, has had one single goal: preserve inequality and the aristocracy. It's not a popular platform to articulate outright, so they focus on creating distractions, scapegoating, and attacking and discrediting all competing ideas. They are elitists who convince fools they are populists, Trump is their perfect leader.",
                    "score": 8,
                    "author": "CouchieWouchie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the platform of conservatism -- a much quoted phrase but it does no harm to reflect on it again -- is that there should be a class of people whom the law binds but does not protect, and a class that the law protects but does not bind.\n\nbasically what you just said.\n\nconservatism's fundamental goals are to preserve social hierarchy and safeguard private property;  liberalism's fundamental goals are to increase average happiness and reduce harm.",
                            "score": 2,
                            "author": "Tazling"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah because the Libs don’t “oppose anything the right supports” lol",
                    "score": -4,
                    "author": "Lagith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure they do; Libs vehemently oppose the things the right supports such as treating minorities as subhuman, ignoring crimes, and sucking up to fascist dictators.  The difference is liberals also have actual policies and interests, like affordable healthcare and a clean environment, beyond just opposing the horrible things the right wants.",
                            "score": 8,
                            "author": "CustosEcheveria",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Strawmen belong in corn fields, redhat.",
                                            "score": 15,
                                            "author": "CustosEcheveria",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": -1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's cute that you're literally incapable of relating to other people without assuming they're at the same level of cultish depravity as the magat crowd.  Big oof.",
                                                            "score": 11,
                                                            "author": "CustosEcheveria",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "https://www.pewresearch.org/short-reads/2023/01/11/what-the-data-says-about-abortion-in-the-u-s-2/\n\nThere's usually less than a million abortions a year, not millions, and most people support a women's right to choose they arent \"defending the killing of babies\" only right wingers argue that and say it that way to sound like you'd be ridiculous to be against it. You'd think the party of individual liberties and freedom would understand that. It's not murdering a baby either, it's preventing a baby from forming since it's just cells at that point. Or do you think plan B is an abortion pill too? Sure it'll become a baby if allowed to but it isn't until a certain point. Plus the bible wasn't even strictly against abortion either for people who like to use religious arguments against it.\n\nhttps://theconversation.com/what-the-bible-actually-says-about-abortion-may-surprise-you-186983\n\nAlso nobody on the left worships Joe Biden buddy only Maga seems to worship the cult of 45. No one gives a fuck about Biden. You guys are so hung up on trans people when they are like 0.1% of the population it's pretty pathetic how obsessed with them you guys are. You honestly just spout nonsense and the same talking points from the right wing talking heads without ever looking into anything.",
                                            "score": 6,
                                            "author": "jbowling25",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nWoke specifically refers to the recognition of of systemic challenges or denial of opportunity faced by people of color.\n\nYes there’s a certain enlightenment to empathizing  and seeing subtle influences.\n\nIt became an insult the moment that those who came to that conclusion determined that action was to demand entitlements from other people based on racial identity.\n\nThat’s where woke-ism falls down.\n\nIt’s pure grievance based. If asks no reflection on culture of the disadvantaged, and everything of an undefined privileged group. It has no success criteria and no measurement. \n\nAll it can do is point to unequal outcomes, and from that determine the causation must be racism. Any issue within the community (be it crime or lower participation rates in education) is hand waved away as uncontrollable and a function of discrimination.\n\nThis a woke person seemingly has zero obligation to be involved in and contributing to the resolution, they just wine for someone else to fix it.\n\nThis in the pejorative, woke is slacktivism, virtue signaling, entitlement, and impractical solutions.\n\nThis is in contrast to civil rights movements, where was the implicit duality of strong community building by the black community in conjunction with demanding equal opportunity.\n\nWhen exactly did the term go from badge of honor and turn into a pejorative? Early 2021, give take.\n\nIn June 2020 Alexandra Osacio-Coerez said America ‘woke’ up to police brutality and used the term as a badge of honor.\n\nBy September 2021 AoC declared woke as a “term almost exclusively used by older people” in response to old-school dem James Carville blaming stupid wokeness for democrat loss.",
            "score": 16,
            "author": "Kman17"
        },
        {
            "level": 0,
            "comment": "It does mean enlightened - and that's good.\n\nProgressive is good, because it's better to go forward than backward. Liberal is good, because having more is better than having less. Intellectual is good, because stupid is bad. Atheist is good, because superstitious is bad. Educated is good, because ignorant is bad.\n\nBut conservatives have inverted values. That's why they use \"progressive\" as a insult, etc.",
            "score": 7,
            "author": "Kapitano72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your second paragraph is the closest thing I have every read to making me want an IQ test to vote I have ever read. I still don't think it is a good idea, but you really tempt me. \n\nJust because you disagree with something doesn't mean it is bad or evil.",
                    "score": 0,
                    "author": "leadWall21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Woke is a word that originated in black communities, and as I understand it it basically meant \"aware of how systemic racism works\".\n\nMany (mostly white) conservatives have reason to want systemic racism to continue, and pretend that it doesn't exist. So they took the word woke and made it a general \"bad\" thing, an ambiguous boogyeman they can point to whenever they don't like... well, anything. It's a buzzword now and it means practically nothing when used by these people.",
            "score": 4,
            "author": "TheMcGirlGal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm black. This is the correct answer. Also, it's funny that there's so many definitions from people that aren't black. They're completely wrong, and highly upvoted. White people on both sides seem to be content on just making things up instead of asking or listening to black people.",
                    "score": 1,
                    "author": "mumblesmcmumble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This literally happens all the time with aave, this is why people want to gatekeep",
                            "score": 1,
                            "author": "doodlejone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The movement is originally supposed to stand up for marginalised groups. Nobody has a problem with that. We dislike the movement because it does nothing but virtue signaling, cancelling, calling people names who don't agree with them. If they cared about the marginalised people, they would be in low income areas helping educating the future generation, organising events where people come together and help eachother. What they do in reality is they fight endless wars online, and cancelling old literature because they don't like certain words used in those books. So they want to tell you what you have to think and say, and they don't realise they have become the opressors they aimed to destroy. I am from ex eastern bloc europe, and we have experienced this kind stuff in communism.",
            "score": 11,
            "author": "PapaCJ5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reddit ain’t gonna like this bro, it doesn’t line up with the leftist echo chamber we’re in.",
                    "score": 5,
                    "author": "sxhmeatyclaws"
                },
                {
                    "level": 1,
                    "comment": "So that's why the conservatives are censoring any books that contain lgbt people or gender identity subjects? Nobody is \"canceling old literature\", what do you think leftists ideas are based on? You're asked to not be a bigot anymore oh wow huge deal, is it that hard to not be an asshole in the first place?",
                    "score": 0,
                    "author": "Omevne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am a former teacher, left this year because I was required to teach highly politicized lessons to children, which is actually illegal, but being required of teachers. Some of these lessons included but were not limited to 1. Explore sea ice melt and then write a letter to your congressman (which we never actually mailed) urging them to put a stop to offshore drilling in Alaska (3rd grade) 2. Read a book about police brutality in the 1960's Jim Crow South and draw parallels to incidents today, use the book to illustrate that police have too much power. (1st grade) 3. Read a children's book about a girl whose neighborhood is being gentrified. Pointed out how our local city is also getting new homes and buildings and asked the students if those business owners should have a right to build there. This was 3rd grade! And students in my class were some of the students living in those new homes! I hope you're not arguing that it's okay to make 3rd graders feel guilty in class because their parents chose to move, but that's what the Lesson was about, and that's exactly what happened.\n\nNow as a former teacher, I would *never* advocate for banning books. That's just as communist. Books are sources of information and banning people's right to information is an atrocity. But in the same manner, highly politicized books should not be required reading for teachers. There is a middle ground. Sadly neither side wants to settle there right now, but it's the right answer.\n\nThe reality is that in some cases woke ideology goes beyond asking someone \"not to be a bigot\". I was required to teach political ideologies to my students and pretend to enjoy it or else I would've been fired. That's dangerous. Schools should be places where children are taught and encouraged to think for themselves, but that's sadly not happening, in the name of raising a \"tolerant\" generation, that's actually anything but.",
                            "score": 2,
                            "author": "PhoneticHomeland9"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because there seems to be no end goal, and most if not all societal problems gets blamed on patriarchy or racism.",
            "score": 11,
            "author": "Otjeho"
        },
        {
            "level": 0,
            "comment": "To me it’s just a social media hashtag word that is used to mean too many things, so it kind of loses any useful meaning or nuance.\n\nThere’s already better words out there to describe some of the things labelled as ‘woke’, so I don’t use it.\n\nThen there’s the politicisation/movement use of the term, I try err away from contemporary terminology and labels like that as I don’t want it to be assumed that my use of the word means I believe X Y Z, when I may not do.",
            "score": 2,
            "author": "HerbertWigglesworth"
        },
        {
            "level": 0,
            "comment": "The right here in the US is incredibly good at controlling narratives. They have an incredible astroturf industry, it's amazing. It's because all the money behind them of course and also how incredibly uncritical a lot of the American public is when taking in information. People will believe literally anything, even if it contradicts their own lived experience, if it's repeated enough. They'll literally say, \"wow that's unbelievable!\" and then just believe it.\n\nLitter boxes in public school bathrooms is an example of what I mean.",
            "score": 4,
            "author": "weerdbuttstuff"
        },
        {
            "level": 0,
            "comment": "When I hear the term “woke” I immediately see the people who are so against racism that they’ve come full circle into being a racist. The stereotypical suburbanite white that thinks minorities need to be saved and it’s their Allah given mission to save them. One Facebook comment at a time.",
            "score": 2,
            "author": "BidenTrumpR34",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's only bad to inbred idiots and white trash right wing ChristoFacist terrorists",
            "score": 5,
            "author": "UsaShitsOnTheGOP"
        },
        {
            "level": 0,
            "comment": "When republicans made it an issue. Apparently being compassionate and understanding is the new evil 🤷🏻‍♂️",
            "score": 3,
            "author": "lasvegashomo"
        },
        {
            "level": 0,
            "comment": "The GOP needed a new word for people and things that they don't understand",
            "score": 3,
            "author": "PhysicalPolicy6227",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's funny I've never heard it as a positive. \n\nI've always heard it to mean \"caring more about virtue signaling and diversity than actual fairness\"",
            "score": 2,
            "author": "CuteBlueNewt",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's because racists hijacked the term. That's literally the racist talking point.",
                    "score": 2,
                    "author": "mumblesmcmumble"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When politicians don't actually have any policies that will improve people's lives, they throw as many talking points at the wall as they can to attempt to turn people's focus away from the harm they aim to cause. Woke is the one that has stuck the most as of late.",
            "score": 2,
            "author": "r0000001"
        },
        {
            "level": 0,
            "comment": "'woke' was urban Black slang for \"fully *awakened* to the situation of your people in a majority-white country with a lot of racism\".  so, \"politically conscious.\"  \"politically aware.\"  what 1960's and early 70's feminists called \"having your consciousness raised.\"\n\nthen it became popular -- like a lot of Black urban slang it was catchy and concise -- more widely among social justice activists of other ethnicities.\n\nthen of course, people *opposed* to social justice movements heard the word and put it on their hate-list, along with \"liberal,\" \"commie,\" \"socialist,\" \"greenie,\" \"enviro,\" \"n\\*\\*\\*\\*r-lover,\" \"tree-hugger,\" and various other standard \"epithets for people I disagree with.\"\n\nso \"the woke mob\" today, in the mouth of a right or far-right speaker, means \"people who support any and all of:  feminism, gay rights, environmentalism, anti-racism, worker rights, vegetarianism, animal rights, public transportation, carbon taxes, electric vehicles, sex ed in schools, trans rights... or anything else that I feel is liberal, ungodly, unmanly/unwomanly, and/or un-American.\"\n\nit seems to me that the pejorative usage has now swamped any serious or non-ironic usage.",
            "score": 2,
            "author": "Tazling"
        },
        {
            "level": 0,
            "comment": "When you first heard the context you heard it in was cult members self-congratulating on their own enlightenment.  Just like some weird ass religious sect whose members refer to themselves as “the enlightened ones”.\n\nIt’s now a perjorative because the woke started evangelizing and now we all know about the whackadoodle batshittery they are selling.",
            "score": 2,
            "author": "SpiceyMugwumpMomma"
        },
        {
            "level": 0,
            "comment": "You will not get a real balanced answer to your question here on Reddit",
            "score": 2,
            "author": "WaterdudeDev"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "for me it really depends on the speech.  if a white person uses the n-word to describe a Black person, or calls an indigenous person a \"ch\\*g\", or calls a woman a c\\*nt, then hell yeah I'm going to say something about that.  because it's simply rude and uncool and offensive, and people should know when they're being offensive just like they should know when they have gravy all over their face or their fly is unzipped.\n\nbut if someone gets all up in your nose just because you referred to someone's \"boyfriend\" instead of their \"partner\" then I think they're overdoing the sanctimony a bit.",
                    "score": 2,
                    "author": "Tazling",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My take on woke is woke=progress. Conservatives like everything to stay the same even if change is progress. Society changes. Any government that doesn't change with it, will fail. History proves that over and over with few exceptions.\n\nMaybe I'm wrong but that's my opinion on it.",
            "score": 2,
            "author": "The001Keymaster"
        },
        {
            "level": 0,
            "comment": "Serious answer:\n\n\"Woke\" was always political. Initially meaning \"I've woken up to see the systemic racism and injustice\", or a refusal to accept the injustices of the status quo. BLM, #MeToo, Antifa were all movements that protested against systemic oppression that was largely seen as the norm, previously.\n\nTo conservatives, \"Woke\" has become a form of reverse oppression and overreaction of equality-centric movements and an attack on \"traditional\" or previous social norms. They see Affirmative Action movements as being anti-White, Diversity and Inclusion efforts as being Anti-male, and LGBTQ+ movements as being \"anti traditional values\", which is cis-het relationships. \n\nThe reason why there's so much pushback has to do with extreme media portrayals. There's hyperbole and fear tactic stories about children being forced to undergo gender reassignment surgery by mentally-unwell teachers, classrooms with kitty litter trays for children who  \"identify as cat\", or stories about how white men are finding it hard to get jobs. \n\nIn reality, most of these are political tactics to distract from actual causes of problems, which are usually economic (housing affordability, inflation, etc).",
            "score": 2,
            "author": "GeneralZaroff1"
        },
        {
            "level": 0,
            "comment": "When Libs starting making mountains out of mole hills. Hopefully that didn’t offend anyone!",
            "score": 3,
            "author": "BigDrink007",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The people who use “woke” as a bad thing are telling on themselves - they are positioning being enlightened as a bad thing. If someone says “woke” in a derogatory way, it’s a safe bet that nothing they say is worth listening to.",
            "score": 2,
            "author": "ejohnson4"
        },
        {
            "level": 0,
            "comment": "When companies began doing it to pretend to care about marginalized communities",
            "score": 3,
            "author": "Major_Liability"
        },
        {
            "level": 0,
            "comment": "Because woke people started being annoying.  I'm not \"woke\" because I don't agree with every single thing they say.  SJWs are annoying af.",
            "score": 2,
            "author": "penguintransformer"
        },
        {
            "level": 0,
            "comment": "You've pretty much hit the nail on the head.\n\nWant to be accepting of the fact that your 12 year old might be realizing he's gay?  We'll make sure his school bans any book that mentions the fact that homosexual people exist, so maybe he'll just give up and like girls instead.  FIGHT THE WOKE MOB!\n\nThat's it.  That's Republicans and the \"anit-woke\" bullshit they're spewing now, instead of focusing on any actual policy that would help anyone.",
            "score": -1,
            "author": "Stu_Prek",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It became bad when racists co-oped the word to mean \"Anything that does not celebrate heterosexual caucasian men.\"",
            "score": 0,
            "author": "wolfgang187"
        },
        {
            "level": 0,
            "comment": "Conservatives have an education of 5th graders, so they just took a word that's easy to say and turned it into everything you don't like",
            "score": 0,
            "author": "QueanLaQueafa"
        },
        {
            "level": 0,
            "comment": "When these “woke” protesters (BLM, Antifa, etc.) started burning cities down, rioting and looting stores. It generally didn’t give people a very good impression of being “woke” — for the ones who truly didn’t know what it meant, at least.\n\nThat’s my two cents.",
            "score": 1,
            "author": "HighwayNo4612",
            "replies": []
        },
        {
            "level": 0,
            "comment": "like any single word, bumper sticker or slogan... it means whatever the prevalent bias in your life wants you to think, to follow one goal amd one goal only: deepen the divide.\n\nthe cultural war is designed to keep us from waging class war. the only winning move is not to play.",
            "score": 0,
            "author": "chaseinger"
        },
        {
            "level": 0,
            "comment": "Woke was used by people so often to virtue signal themselves to being \"enlightened\" as you say that after a while it lost meaning and made the people describing themselves that way as \"holier than thou\" and insufferable\n\nThen when it hit that stage people online would start using it to put things down, as in \"look who's trying to be woke\" to laugh at people going out of their way to be so accepting and is used condescendingly\n\nAnd Lastly worryingly the incel/neckbeard/misogynistic and racist party of the internet started using it as their first line of defence against representation and the screams of \"it's woke it's woke!\" Are still going to this day if you see a show/ movie (normally not aimed at them at all) like the little mermaid remake they will become keyboard warriors that need to defend the virtue's of 20 year old dated animated Disney movies\n\nBasically if someone uses the term \"woke\" they are full of shit and their opinion can be discounted with no great loss to the conversation",
            "score": 1,
            "author": "Slowmobius_Time"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure it does come from people saying they've \"woken up\" and other similar things. Enlightened could be another way of saying it. It basically meant they believe they've become aware of things that were hidden to them and other people before. Unfortunately, when many people believe they know things others do not, in other words, have superior knowledge and understanding, it becomes very tempting to not believe that they are superior to others because of that. This will come across in the way they treat people.\n\nAnyway, because of the people who began acting superior because they had woken up, \"woke\" began to become a term of mockery. It sort of describes a person with a holier-than-thou attitude.\n\nIt's more in politics now because it became associated with particular political ideologies, first being used by them, so people of opposing ideologies use the term as an identifier with negative connotations to describe their opponents.",
            "score": 1,
            "author": "ieen14"
        },
        {
            "level": 0,
            "comment": "It no longer means enlightened and that you've challenged your beliefs. It's actually quite the opposite at the moment.",
            "score": 0,
            "author": "ascrumner"
        },
        {
            "level": 0,
            "comment": "It's stopped being enlightened about five to 10 years ago when it was co-opted by people with very damaged emotional/psychological matrices using it as a mechanism to make everyone shut up. (I suggest you read Vonnegut's short story about Harrison Bergeron: the most brutal dictatorship that will ever exist is the one in which the people who can't live in the world due to personal shortcomings and unresolved traumas force all the rest of us into the same self-perpetuating cycle of eternal victimhood. I can't snowboard. I don't demand someone amputate Shaun White's legs.)\n\nExample. On many subreddits. IF I were to say \"So and so is simply being a c---.\" I would get blocked or booted or banned or whatever the Thought Police call it. Because the word is (gather breath, clutch at pearls, come through the fire, reassure yourself that you're strong and smart and humble) \"offensive.\"\n\nIt isn't to me. It's a very precise word used to describe a very particular kind of person who deliberately makes overarching goals difficult by introducing invented controversies so that the person in question can control the discussion by means other than intelligence or persuasiveness of their argument. They assert \"offense\" and that's the end of it. But your \"offense\" doesn't trump my right to speak, nor can your \"offense\" be proven. I can, just as easily, take \"offense,\" and we will be stuck in a closed loop of pointlessness.\n\nTwo people or two groups who genuinely want to exchange ideas are not afraid of words. And they don't allow a coterie of bullies to shut down every conversation that the coterie \"disapproves\" of. I, for instance, strongly dislike the term \"queer\" as a catchall for gay people because, when I was a teenager, it had only one meaning. But I don't go around bullying people into scared silence for using it. I don't demand the libraries remove all copies of William S. Burroughs' novel by that name. Because I'm not the only one who has rights. And I'm not interested in living the sort of life where I'm so frickin' fragile that I can't cope with words or everyone tip-toeing around on pins and needles around me for fear that I will get them fired or banned for using a word that I decide isn't acceptable.\n\nBack in the day, the people who objected to television programs never had a good answer to this: \"If you don't like the program, switch the TV off. Or leave the room. Or read a book.\" The current woke crowd, similarly, isn't interested in working out issues, they've already figured out the answers and you can either agree with them, vociferously, until your vocal cords give out, or you can agree with them, vociferously, until you fracture some vertebrae nodding your head so rigorously.\n\nI'm a lot more interested in what people have to say and in finding the weaknesses in my own thoughts and arguments than in working out my multiple psychological traumas with a group of hostages who are bound and gagged at my feet due to how I've managed to commandeer the entire discussion and lock it down forever.\n\nThat's why woke became a bad thing.",
            "score": -6,
            "author": "Available-Page-2738",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; complains about woke\n\n&gt; has imaginary deep meanings to justify crude insult words\n\n&gt; I don't go around bullying people\n\n&gt; demands a right to post in private chats\n\n&gt; opposes forcing people to listen to you\n\nThat was great, got bingo",
                    "score": 5,
                    "author": "Kakamile"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t worry the same people held the same Braindead opinions for time immemorial. They just change what words they attach to their hateful ideology every few years.",
            "score": 1,
            "author": "BickleKnack"
        },
        {
            "level": 0,
            "comment": "When republicans realized they have been sleeping for decades",
            "score": 1,
            "author": "messmaker523"
        },
        {
            "level": 0,
            "comment": "When racists and reactionaries made it one by using it as shorthand for attempts to make the US a more equitable place by having programs or political efforts aimed at removing systemic racism and marginalization. Hence the \"Don't say gay\" bill in Florida and the dog whistles Trump used, as well as the language surrounding the false claim that people in drag or those who are LGBT+ are grooming children.",
            "score": 1,
            "author": "clintontg"
        },
        {
            "level": 0,
            "comment": "It's not. But people have turned it into a cudgel to use against anyone they don't like in the culture war. The way conservatives use it has nothing to do with reality.",
            "score": 1,
            "author": "VinceGchillin"
        },
        {
            "level": 0,
            "comment": "I first heard the word probably 10-15 years ago. I heard it from a leftist parody video making for of people calling themselves 'woke'. I wish I could find the video again, but it perfectly demonstrated pompous, holier-than-thou white saviors trying to be more woke than each other. \n\nFast forward a few years and the clueless white saviors had internalized it so much that they are incapable of realizing that they were being mocked and making asses of themselves. They showcased the worst possible smarminess plus a new brand of farther left SJW ideology, especially regarding trans rights.\n\nIt may not seem radical here on Reddit, but to about 60% of the nation modern wokeness is extreme left to the point that pushing wokeness is pushing even the moderate left to the Republicans.",
            "score": 1,
            "author": "EvilBunnyLord"
        },
        {
            "level": 0,
            "comment": "It's just a proactive tactic so that people don't call conservatives out for being racist and homophobic as much.",
            "score": 1,
            "author": "JackOCat"
        },
        {
            "level": 0,
            "comment": "Narrator: It is good old-fashioned intolerance.",
            "score": 1,
            "author": "redbean_8"
        },
        {
            "level": 0,
            "comment": "Because it's become ridiculous to the point where the average person doesn't want to support it anymore. It's really that simple",
            "score": 1,
            "author": "Weary-Plankton-8021"
        },
        {
            "level": 0,
            "comment": "\"Woke\" used to be \"virtue signaling\" / \"social justice warrior\", but I guess both of those stopped being of any use to conservatives. I think all three arrived sometime after Trump became a pres.",
            "score": 1,
            "author": "CherryShort2563"
        },
        {
            "level": 0,
            "comment": "Only Republicans/Conservatives think it's derogatory. They think fighting for equality is a bad thing. Also black people pretty much popularized the term and well, you know, conservatives tend to be racist.",
            "score": 1,
            "author": "mumblesmcmumble"
        },
        {
            "level": 0,
            "comment": "It became bad when they started forcing people to think they way they do. Or when you shared a different opinion and those people became violent. It's turned into a cult where you cant think for yourself. They were the start of cancel culture. They don't like a TV show they don't turn the channel like normal people. They ban together to harass, complain, and protest until the channel is taken off the air.",
            "score": 1,
            "author": "zryan3564"
        },
        {
            "level": 0,
            "comment": "It became a bad thing the moment racists realized that woke people think racism is wrong.",
            "score": 1,
            "author": "BlueRFR3100"
        },
        {
            "level": 0,
            "comment": "It’s not a bad thing. Only history deniers think it is.",
            "score": 1,
            "author": "richalta"
        },
        {
            "level": 0,
            "comment": "Woke is a very bad idea. It's enlightenment on the cheap and amounts to little more than: \"you disagree with me so you are asleep until you agree with me\". It is read as force by the Right, and in this respect the Right is right, even if most if not all \"woke\" issues are good issues.",
            "score": 1,
            "author": "ravia"
        },
        {
            "level": 0,
            "comment": "Conservatives don't want new, enlightened things.  They either want things to stay the same, or go back to 'the good old days', which probably means slavery in many different forms.  They are also highly religious, which means the same:  Same bible, same religious rules, more power to the church to enforce religious rules on the general population.  No new religions or ways of thinking.  Ever.  \n\nThey don't want you to be awake.  They want you to sleep and let them do whatever they want behind your back.  Just trust them, don't ask questions.  \n\nThose are the major reasons why they don't like anything 'woke' or 'progressive'.",
            "score": 1,
            "author": "Central_Control"
        },
        {
            "level": 0,
            "comment": "When people got tired of saying “snowflake” it changed to “woke” people. It’s just a thing. Once they realize no one cares, they’ll move on to the next shiny thing.",
            "score": 1,
            "author": "Lazy-Jacket"
        },
        {
            "level": 0,
            "comment": "\"That just sounds like old-fashioned intolerance to me.\"\n\nNo, it's just a rejection of your political ideology. You're fooling yourself if you think \"Woke\" isn't an invention of the [activist left](https://en.wikipedia.org/wiki/Woke). It's just that when your brand got into the mainstream and people began to see what you stood for, they decided they didn't like it.",
            "score": 1,
            "author": "DeadFyre",
            "replies": [
                {
                    "level": 1,
                    "comment": "So an ad hominem attack in r/nostupidquestions from someone claiming a position isn't intolerant.  Seems to validate intolerance to me?",
                    "score": 1,
                    "author": "LiminalWanderings",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The one who's claiming that anyone opposed to \"woke\" policies is intolerant is the one making an ad-hominem attack, dimwit.",
                            "score": 2,
                            "author": "DeadFyre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"dimwit\"",
                                    "score": 1,
                                    "author": "LiminalWanderings",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Insulting you isn't an ad-hominem, it's just a conclusion based on your post. I'm not making an argument. I don't really care about wedge issues, in point of fact. If you really feel the best use of your political capital is removing statues and changing the rules about which bathrooms people can walk into, enjoy yourself.",
                                            "score": 1,
                                            "author": "DeadFyre",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Woke” is when you understand how deep racism and sexism runs in your culture. Ron DeSantis would rather not be reminded about it because he has a lot of very awesome thing things he would like to say about minorities and gays, and you’re like, harshing his mellow.",
            "score": 1,
            "author": "aquaticteenager"
        },
        {
            "level": 0,
            "comment": "Racist people don't like it",
            "score": 1,
            "author": "somethingsuccinct"
        },
        {
            "level": 0,
            "comment": "It’s to label those who are so focused on being politically correct and “inclusive” that they actually begin to exclude majorities in common sense ways., almost comically.",
            "score": 1,
            "author": "Alicat825"
        },
        {
            "level": 0,
            "comment": "When woke is awareness of injustice it’s good. \n\nWhen woke is Moral authoritarianism disguised as virtue it’s not. \n\nWoke was originally that the scales fell from your eyes. \nNow it predominently means, I'm right and you're wrong. \n\nOr, it refers to people that consider themselves enlightened, but in fact have regressive views.",
            "score": 1,
            "author": "whoopsea"
        },
        {
            "level": 0,
            "comment": "It's conservatives desperately trying to stigmatise empathy",
            "score": -3,
            "author": "Squatsquatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao no reason for you to have downvotes, you can tell conservatives came to this post in droves",
                    "score": 1,
                    "author": "SacredSkeletor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah, I think I hurt a few feelings with that particular truth",
                            "score": 1,
                            "author": "Squatsquatch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah lol you can go through the comments here and see clearly that they didn’t send their best. \n\nThe amount of brain dead shit I’ve seen today",
                                    "score": 1,
                                    "author": "SacredSkeletor"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As soon as black people coined it for thier empowerment.",
            "score": -10,
            "author": "partoe5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you really think these white people can handle truth? Lol",
                    "score": 2,
                    "author": "mumblesmcmumble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it's just funny how the top answer with over 100 votes is just like \"meh, words, like, you know, just change meaning sometimes\" and just ignores all the racial dynamics LMAO! sad.",
                            "score": 1,
                            "author": "partoe5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was like half a century ago. The right-wing redefinition of the word is just in the last few years.",
                    "score": 7,
                    "author": "Teekno",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No.",
                            "score": -7,
                            "author": "partoe5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you can point me to a definition of \"woke\" (in the political context) meaning something other than \"being aware of injustice in the world around you\" that predates like 2015, I'd appreciate it.",
                                    "score": 10,
                                    "author": "Teekno",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're calling yourself enlightened, you're probably a douche",
            "score": 0,
            "author": "D-Meltz"
        },
        {
            "level": 0,
            "comment": "The very second it became a thing. It's always been bad. It's brainwashing disguised as sensitivity",
            "score": -14,
            "author": "crablegsforlife",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol oof we got a live one",
                    "score": 8,
                    "author": "CustosEcheveria"
                },
                {
                    "level": 1,
                    "comment": "I think the only people who been brainwashed properly are on the right",
                    "score": 5,
                    "author": "SacredSkeletor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Na there are enough idiots in every political corner center etc.  It's the few people who take up the spotlight of those ideologies that are most often hurting their own cours by being too zealous. For example calling all people who are politicialy more right than yourself Nazis, makes u an opponent not only to real neonazis but all those who dont share your point of view or see themselves as more conservative than u.",
                            "score": -2,
                            "author": "SetComfortable808"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's hilarious watching people try to diss on \"right wingers\" in regards to using it, when it'd be SWELL if left-wingers didn't move the goalposts every other day.  \n\nNobody can define what civil rights are \"missing\" for certain groups. Nobody wants to admit their left-wing party is also to blame for the \"suffrage\" of blacks.  Nobody wants to address why we don't actually protect our kids the right way.",
            "score": -3,
            "author": "ALPlayful0",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re actually interested in learning what civil rights are “missing”, here’s some light reading that can help bring you up to speed a little. \n\n[Nearly 240 anti-LGBTQ bills filed in 2022 so far, most of them targeting trans people.](https://www.nbcnews.com/news/amp/rcna20418)",
                    "score": 7,
                    "author": "AboveTheLights"
                },
                {
                    "level": 1,
                    "comment": "How about this. Second amendment is a right, yeah? White people can carry guns all day any day. Black people can't reach into their pocket without police assuming it's a gun and using that as a justification to take their life.\n\nAs for a left wing party also being to blame for the suffrage of blacks? What left wing party? The Democrats? Hardly a left wing party. When compared to the fascists in the Republican party, sure. Compared to anywhere else in the world, not even close. You should look up the phrase \"Overton window.\" Democrats today are barely to the left of Reagan. \nAnd hey, just to make you happy I'll say Biden did push for the 90s crime bill and that absolutely hurt black communities. Not nearly as much as the war on drugs itself though. Which was really just a (admitted to on tape) pretense to imprison blacks and hippies. After all, the 13th amendment abolished slavery, unless you're convicted of a crime ;) there's a reason we got the highest prison population in the world. 20% of the worlds. That's a lot of cheap labor.\n\nAnd as for \"protecting our kids the right way\" what way is that exactly? Legalizing child labor or just refusing to make child marriage illegal and continuing to defund education? That's what Republicans have voted for, so tell me, what is it? Maybe it's more tax cuts for the richest people, as is standard GOP tradition.",
                    "score": 3,
                    "author": "Insomnabalist94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably because most people already have the  \"Do whatever u want that fullfils yourself without harming others\"mindset. And a small minortiy wants you to believe that it's the exact opposite thereby ousting themselves and building up infamy. You know the few black sheeps that are able to make enough noise to make themselves enemy nr1 even tho they have had good intentions at some point.",
            "score": 0,
            "author": "SetComfortable808"
        },
        {
            "level": 0,
            "comment": "When I hear the term woke I think of people with unrealistic ideologies such as: “free housing for everyone, we just need to tax those damn rich people”. Or “let’s ban meat to save the animals, we can all just eat fake meat instead” \nStupid, extreme ideas with no real rational thought process involved.",
            "score": 0,
            "author": "scottishfoldlover"
        }
    ]
}