{
    "id": "148qn9q",
    "score": 0,
    "title": "Does my boyfriend have a fetish?",
    "author": "Standard_Camera8757",
    "date": 1686693072.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148qn9q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Every time me and my boyfriend M (25) have been having sex lately, he has  specifically requested me to lick the back of his balls. It kind of makes me feel weird. I am a F (23), I’ve never experienced this type of thing before. He says licking his balls from behind feels gay, so he’s had me lift them up so I can kind of get behind them? Is this a fetish? Are there special nerve endings on the back of the scrotum?\n\nTL;DR I’ve been licking the back of my boyfriends balls, is this normal?",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t know if I’d call it a fetish, but that’s an area packed with nerve endings and so is incredibly pleasurable to a lot of people. It is normal",
            "score": 6,
            "author": "MarcusXXL"
        },
        {
            "level": 0,
            "comment": "Yeah, the balls shouldn't be neglected lol thats a man who knows what he wants",
            "score": 3,
            "author": "TweekerAllWeeker"
        },
        {
            "level": 0,
            "comment": "I would say it is normal enough that you should do it if you want and not do this if you do not want to.  But I see nothing gross about this or what most would consider too freaky.",
            "score": 2,
            "author": "GregoryGregory666666"
        },
        {
            "level": 0,
            "comment": "are you lifting them over your face? lol",
            "score": 2,
            "author": "prayerstate",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes and unfortunately I get hair in my mouth. Its not weirdest thing but it’s hairy",
                    "score": 3,
                    "author": "Standard_Camera8757",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tell him is he wants you to do this then he has you shave his sack and taint.",
                            "score": 5,
                            "author": "Jesse_James666"
                        },
                        {
                            "level": 2,
                            "comment": "Manscaped is a thing. Tell him to shave his balls",
                            "score": 3,
                            "author": "DEATHROAR12345"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just be careful you don’t end up with a Roman war helmet.",
            "score": 1,
            "author": "DaddyForgives",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m almost afraid to ask, but what?",
                    "score": 1,
                    "author": "KrankySilverFox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Balls over the eyebrows with the shaft hanging down the nose.  It’s supposed to resemble the look of a Roman helmet.",
                            "score": 1,
                            "author": "DaddyForgives",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg 😱 hahahahaha I don’t think I could do that with a straight face.",
                                    "score": 1,
                                    "author": "KrankySilverFox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t know how accurate or physically possible it is to do, as I find no reason to research the subject.\n\nBut I did find the description amusing, much like you did.",
                                            "score": 2,
                                            "author": "DaddyForgives"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah uh, ask your boyfriend to shave his balls and you umm.. you uh… Well Isaac Hayes said it better so:\n\n” Suck on my chocolate salty balls,Stick 'em in your mouth and suck 'em ”\n\nalso not even a fetish IMO unless everything except vaginal penetration in missionary position is considered a fetish.",
            "score": 1,
            "author": "Cupsie"
        },
        {
            "level": 0,
            "comment": "I can’t help but think of Sweady Balls on SNL. God I’m getting old.",
            "score": 1,
            "author": "KrankySilverFox"
        },
        {
            "level": 0,
            "comment": "It's like your BF is more a homophobe than a fetishist.",
            "score": -4,
            "author": "lucille12121",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not wanting to do something because “it feels gay” does not make you a homophobe…",
                    "score": 5,
                    "author": "DiceyRice_"
                }
            ]
        }
    ]
}