{
    "id": "148qc7g",
    "score": 2,
    "title": "Could Georgia be admitted into NATO if it covers only Tbilisi controlled territory or must Georgia be in control of all of her territory first?",
    "author": "Psychological-Fig-97",
    "date": 1686692232.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148qc7g",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is something that I saw while on Georgia-NATO relations and it really interested me. Could this work? Realistically, it's been done before. West Germany joined NATO while not in complete control of her borders and it's not like West Germany gave up the thought of unification one day. \n\nGeorgia getting back South Ossetia and Abkhazia are slim as hell. But depending on the result of the Russia-Ukraine War and Russia deciding whether to annex South Ossetia just to get something out of the war in order to save face, Georgia could eventually reclaim its lost territories. \n\nBut the point is whether NATO would want Georgia in its current state. A question still remains if Georgia wants to join NATO but the shitty ass Georgia Dream party will never allow that to happen but I diagress in this topic. \n\nWould NATO be extra cautious and outright reject Georgia (excluding other reasons it might not join NATO like human rights, etc.) due to its territorial problems being more severe than West Germany's? NATO is more than likely hesitant about pissing Russia off but to be fair it's not like NATO/Georgian borders would reach the actual Russian territory. \n\nWhile it would be satisfying for Georgia to take back its territory and then join NATO with Russia being forced to deal with its new borders, NATO is about defense and if Georgia joining NATO while not being in complete control of its borders is essential to preventing another war in case Russia decides to throw a temper tantrum for losing the Ukraine-Russia War (hopefully loses) then so be it. But is this possible with NATO's rules and current political climate? And would other states veto this? I know that Turkey probably won't since they'll be glad they finally have another Central Asian/East Europe country in NATO but stupid ass Orban from Hungary might veto this. But what does everyone think?",
    "comments": [
        {
            "level": 0,
            "comment": "West Germany did not formally claim East Germany, or anything else for that matter. In 1955 both Germanies were strictly prohibited from even thinking about having claims. Thus, there were no claims to worry about.\n\nFor Georgia, that woukd mean formal renounciation of claims  towards territory it doesn't control.",
            "score": 2,
            "author": "Pesec1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah you're right. I thought both Germanies still formally claimed each other and NATO had found a loop hole because technically both countries weren't at war. But yeah thanks for enlightening me. Georgia could still join NATO for security but something tells me national pride is still too high or otherwise Georgia would've joined by now and renounced its lost territory.",
                    "score": 1,
                    "author": "Psychological-Fig-97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The joining conditions of NATO are that they must settle all territorial disputes.",
            "score": 1,
            "author": "TurboThrobber"
        }
    ]
}