{
    "id": "148r7uh",
    "score": 1,
    "title": "Why do people relentlessly bully Dream, the Minecraft YouTuber?",
    "author": "Local-Yesterday3454",
    "date": 1686694627.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148r7uh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Let me start here: I don't really give a fuck about Dream. Neither his person or channel affect my life even to the smallest degree.\n\nI know he's a Minecraft YouTuber - the biggest, in fact - and so the most I can say in any fan regard is I'd have probably liked him if I were still 11.\n\nThat all said, I've seen that he recently deleted his face reveal after persistent, harsh bullying - people calling him ugly, essentially. I just... Don't agree? There's nothing inherently ugly about his features and I don't understand why people have decided to pour so much energy into fucking with him based on something without much weight to it - I just think objectively he's not an ugly person. Call me crazy, he just looks like a normal dude.\n\nNow beyond that I've only heard whispers on controversy in the past. Rumors of cheating at Minecraft (seriously who gives a fuck?), and others of racism and grooming (alright, THOSE we can give a fuck about). I've never heard accounts of these actions firsthand though, just through the grapevine.\n\nDeleting his face reveal unfortunately won't do anything for him - the internet truly is forever. But I saw his post saying he's chosen to wear that dumb smileyface mask everywhere now? I don't know guys, this just seems.... dark. Is there any legitimate justification for the way he's been treated, or do people just hate him for garnering success from something they percieve as easy? Do any of his actions really justify making him feel like he has to hide his face from the world, or is this just classic internet shittyness?",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Now beyond that I've only heard whispers on controversy in the past. Rumors of cheating at Minecraft (seriously who gives a fuck?),\n\nGamers, specifically the Minecraft community care, because it matters to them. Its the same vein as any sport. Imagine if the world champion in any big name sport, literally the number one player was caught cheating, it would be headline news.\n\nJust because it's Minecraft shouldn't take away from that",
            "score": 6,
            "author": "TheWardenDemonreach",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right, I don't mean to diminish the speedrunning community, of which I'm a big fan! They do incredible things and no cheater deserves recognition over those that put in the work. My language was harsh - I suppose I only meant do the consequences really fit the crime? Wouldn't it be better to just ignore him?",
                    "score": 1,
                    "author": "Local-Yesterday3454"
                }
            ]
        },
        {
            "level": 0,
            "comment": "he is a relentless bully on twitter to children. he deserves ot",
            "score": 3,
            "author": "hellshot8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you give an example? No one has talked about accusations of him being a generally shitty person beyond the speedrunning thing yet.",
                    "score": 1,
                    "author": "Local-Yesterday3454",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just check his twitter. He openly talks about how he loves quote retweeting people with like 10 followers (who are normally like 12) and having his community bully them until they need to close their account. I've seen him do it several times",
                            "score": 2,
                            "author": "hellshot8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;he recently deleted his face reveal after persistent, harsh bullying - people calling him ugly\n\nWhen you have millions of people watching your stuff you're always going to get nasty comments and, if you can't filter those out like a lot of big content creators, they'll get to you\n\nAlso his audience is like 8-14 year olds so it's prime 2edgy5me territory so I'd imagine that bumps up the nasty comments a little bit.\n\n&gt;Rumors of cheating at Minecraft\n\nThat was basically proven, it's extremely statistically impossible for his runs to get the luck that they did and (IMHO) more importantly the dude hired an expensive lawyer to try and defend himself who kinda dug his own grave.\n\n&gt;seriously who gives a fuck?\n\nPeople who are into speedrunning.  This is basically the same thing as someone getting caught doping or whatever in MMA except for speedrunning.  It's kinda understandable when there are people legitimately competing for the same title and some guy comes along and cheats that people get pissed.\n\n&gt;But I saw his post saying he's chosen to wear that dumb smileyface mask everywhere now?\n\nBecause #drama gets views\n\n&gt;Is there any legitimate justification for the way he's been treated\n\nYes because he's a cheater who makes most of his content about shit that is supposed to be live but is actually extremely staged.  It works because his audience is too young to understand that or think critically.\n\n&gt;or do people just hate him for garnering success from something they percieve as easy?\n\nYes as well, again if you're putting in effort to make live content that is actually good and someone comes along and cheats at it to gain success you're allowed to be pissed.\n\n&gt;Do any of his actions really justify making him feel like he has to hide his face from the world\n\nNo, but it's an easy way to get more #drama and get a lot of easy clicks on a video where you're crying about it.",
            "score": 6,
            "author": "IHOP_007"
        },
        {
            "level": 0,
            "comment": "Internet shittiness. You could get into the psychology of it but meh whatever.",
            "score": 2,
            "author": "AlexioKilbasa"
        },
        {
            "level": 0,
            "comment": "Dream honestly seems like he loves attention and being in the constant spotlight. The problem is he also doesn't seem to think things through, so he also has a penchant for making stupid mistakes and getting into trouble. At his heyday, he would start some new dumb internet drama on a weekly basis. \n\nDude is either a very careless and clumsy internet celebrity that can't stay out of trouble, which considering how he was a normal dude until suddenly reaching stardom is plausible.\n\nOr he's just constantly looking to stir up new stupid drama to stay relevant in the internet's progressively more competitive algorithm. Which is also likely.\n\nAlternatively it could be a bit of both?\n\nRegardless, I feel the same goes for the face video. Genuine lack of foresight and naivety concerning the way the internet works? A publicity stunt from a person who fully understands the way internet works and is now exploiting it? A little bit of both? You decide.",
            "score": 2,
            "author": "Responsible_Coast514"
        },
        {
            "level": 0,
            "comment": "I am surprised that dream is called ugly while pewdiepie gets to be most handsome man of the year they look very similar to me. I don't know anything about dream though I just looked up a pic.",
            "score": 2,
            "author": "ObviouslyHeir"
        },
        {
            "level": 0,
            "comment": "He built up an incredible amount of hype about the face reveal. Like a multiple day (maybe even weeks?) countdown to when he would do it on Livestream. Many other well known people advertised it. All for the dramatic reveal that he looked like Just Some Guy.\n\nThis was the cause of some of the 'ugly' comments. Some people bought into the hype and him being Just Some Guy didn't live up to that; some trolls were attracted to the hype. And a lot of people had just never heard of him until this so it was like 'who is this jackass who thinks his face is such a big deal\"",
            "score": 2,
            "author": "VislorTurlough"
        }
    ]
}