{
    "id": "148sl7j",
    "score": 1,
    "title": "What is Fentanyl supposed to feel like, Opioids like a pain killer? Ectsacy? Just sleepy or euphoric?",
    "author": "Famous_Ad6315",
    "date": 1686698504.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148sl7j",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just a reminder that .0025 grams will give an adult male a strong high. .0100can kill a man, and about .0060grams will kill a woman",
            "score": 3,
            "author": "Agreeable_Tackle7519",
            "replies": [
                {
                    "level": 1,
                    "comment": "And it’s also in literally EVERYTHING you buy off the streets these days. We’re starting to see every substance coming into America from the south cut with fentanyl because it’s cheaper. It takes such a small amount to get you high compared to cocaine or meth or any other number of substances. In my state, we’re seeing such an increase in ODs due to this issue.",
                    "score": 2,
                    "author": "Illprobtalkabmypets"
                }
            ]
        },
        {
            "level": 0,
            "comment": "it is an opioid, heroin oxy, codeine, morphine, fentanyl, all opioids",
            "score": 3,
            "author": "AreaProfessional7"
        },
        {
            "level": 0,
            "comment": "Opioids. It acts on the same receptors in your brain that other opioids do. But sleepy or euphoric definitely fall within those opioid effects. Fentanyl is just a very strong opioid, so when people dont know theyre getting it, its easy to do too much, shooting past the desired effects and going straight to nodding out or oding.",
            "score": 3,
            "author": "redditghost1234"
        },
        {
            "level": 0,
            "comment": "I had it in the hospital it was a rush of warm euphoria followed by the urge to throw up everywhere they gave me something else to counteract that.\n\nIt's short lasting but intense I left after an hour or so after monitoring I felt a bit tired but no hang over or lasting effects.",
            "score": 3,
            "author": "vagueblur901"
        },
        {
            "level": 0,
            "comment": "As stronger heroin",
            "score": 2,
            "author": "Fantastic_Effort_386"
        },
        {
            "level": 0,
            "comment": "Well, since it only takes 2 milligrams of some kinds of fentanyl to kill you, do you really want to find out?",
            "score": 1,
            "author": "themoirasaurus"
        }
    ]
}