{
    "id": "148syn0",
    "score": 1,
    "title": "How is it that the Democrat / Republican split in the US is roughly 50/50? In other words, how is it that so many issues and viewpoints can so easily be broken down into two major camps such that the split is basically even?",
    "author": "crabby-owlbear",
    "date": 1686699643.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148syn0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It isn’t 50/50 by a long shot. The voting is mostly 50/50 due to how our system of voting works. But most people disagree with at least some aspects of both parties. \n\nI’m more liberal but I’m not a Democrat. I vote Democrat though because that’s the only viable choice that I have had available in the elections I was able to vote. I would love it if a viable third party candidate that had viewpoints closer to my own was available but that’s a hard thing to do because of the system our founders created.",
            "score": 5,
            "author": "Ranos131"
        },
        {
            "level": 0,
            "comment": "It's self balancing to some degree.  When a party is in control they get pulled to their far ends by hard liners in order to win in the primaries.  This creates an opportunity for the minority party to pick up the center.",
            "score": 11,
            "author": "AsterJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "So it's like a political tug of war, but instead of a rope, they use the country's future.",
                    "score": 6,
                    "author": "UsefulWhole851",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup",
                            "score": 1,
                            "author": "cmdradama83843"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's more like 30/60 with 10% not really giving a shit either way.",
            "score": 9,
            "author": "coprolite_hobbyist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Close to 50/50 of you only count the people who vote",
                    "score": 4,
                    "author": "WorldTallestEngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, not even close. I _was_ just counting the people that vote.\n\nThe whole idea that both sides are the same size is complete bullshit. Gerrymandering, the two-party system with winner take all, the outsize influence of low population states, voter suppression, state legislature takeovers and other shenanigans make it seem like it's evenly divided, but it's just not.",
                            "score": 19,
                            "author": "coprolite_hobbyist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Downvote this guy all you want, but when Reps themselves said that if elections were fair they wouldn't ever win again then he's not exactly wrong",
                                    "score": 9,
                                    "author": "Wargroth"
                                },
                                {
                                    "level": 3,
                                    "comment": "And the electoral college. Don’t forget that bullshit.",
                                    "score": 2,
                                    "author": "ClickClackTipTap",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Land of equality except citizens from Wyoming are four times more important than Californians",
                                            "score": 3,
                                            "author": "sleepyj910"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nah. \n\nIf we undid all of the gerrymandering, very few Republicans would get elected. And if we got rid of the electoral college we’d probably never have another Republican president.",
                            "score": 1,
                            "author": "ClickClackTipTap",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well just look at the popular vote in the last few presidential election.  Dang close to 50/50\n\n2020  51.3%\t46.8%\n\n2016   46.1%\t48.2%\n\n2012   51.1%\t47.2%\n\n2008  52.9%\t45.7%",
                                    "score": 1,
                                    "author": "WorldTallestEngineer"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both parties are \"big tents\" that accommodate factions with different views. They work together because they think it's their best chance at getting what they want. Because each party has to win elections to get its way, they both have to appeal to undecided voters in competitive areas, so the party platforms are self-correcting toward splitting the vote. When the party wants to appeal to more moderate voters, it'll run candidates with modest positions; when they want to appeal to solid party-line voters, then they can run candidates with more extreme views. \n\nFor example, if a Republican incumbent has a big scandal, a good Democratic opponent would be someone that looks a lot like a typical Republican but isn't tainted that way; solid Republicans are more likely to stay home and undecided voters might switch. If the Democratic opponent is too different, the minority will be excited to vote for him but the same coalition that elected the incumbent might overlook his scandal to avoid the Democrat being elected. If a Republican victory in the general election is assured, then the winner will effectively be decided in the Republican primary, and so the candidate who is best able to appeal to the more politically active and ideologically committed people who vote in primaries is likely to win.",
            "score": 2,
            "author": "Odd-Imagination-8019"
        },
        {
            "level": 0,
            "comment": "The loosing party is usually fixed to become more mainstream to win back seats. The winning party is usually pressured by there extremist end ti move away from the mainstream.  This back an forth push and pull places both parties near but not at the center.  And also makes them about 50/50.",
            "score": 1,
            "author": "WorldTallestEngineer"
        },
        {
            "level": 0,
            "comment": "One of the reasons why third parties have never really taken off is that you used to have a wider spread of factions within each party. So the policy discussions/debates took place more within the party (vs having smaller parties with a narrower focus like in a parliamentary system). \n\nSo you had broader-based political views between the two majors, but a wider range of philosophies debated and shaped specific legislation as it was written. In the last 20 years, the parties have become more homogeneous and polarized. You still have different factions, but I don’t think the differences are as wide as they used to be. Because of the entrenched system it is extremely difficult for a third party to become established, and everything is so close that most people don’t want to waste a vote on a third party candidate because they feel it will hurt their preferred national party. Right now most dems feel like every election could be the last if republicans win, so voting third party feels like a luxury we can’t afford.",
            "score": 1,
            "author": "Azdak66"
        },
        {
            "level": 0,
            "comment": "The parties shift so they will always have around 50% support. Cutting taxes was getting unpopular, so Republicans shifted away from that towards populism in 2016. Gay marriage and immigration were opposed by both parties in the early 2000s, but Dems started supporting both around the early 2010s to reflect popular support. Whenever a party loses, they will generally take up more popular positions, and whenever they win, they will be emboldened to take on less mainstream issues. Note that Trump is a bit of an exception due to his death grip over the party",
            "score": 1,
            "author": "DoeCommaJohn"
        },
        {
            "level": 0,
            "comment": "Because the corrupt democrats and the corrupt republicans do a remarkably marvelous job of splitting large parts of the gullible electorate into roughly equal camps of self righteous religious zealots for their respective parties and thus perpetuate / increase their own power and fortunes at the expense of that same electorate.",
            "score": 0,
            "author": "ninthgenderplatypus"
        }
    ]
}