{
    "id": "148s7w1",
    "score": 2,
    "title": "Fat loss question: Intermittent fasting vs multiple small meals a day",
    "author": "imBadMove2",
    "date": 1686697445.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148s7w1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'll try to keep this short.\n\nIt's my understanding that it's not possible for the body to burn body fat while your blood insulin levels are high. Is that correct?\n\nIf so, if someone was to adopt an intermittent fasting approach to their nutrition (the common one is 16 hour fast, 8 hour feeding window) and they were to keep their calorie intake in a slight deficit, there would roughly be 14 hours where your blood insulin levels are low and therefore your body would be able to burn off body fat.\n\nNow if someone was to take in the same number of calories, same macros, but was constantly snacking throughout the day, their blood insulin levels would be elevated all day long. Therefore it wouldn't be possible for the body to burn body fat. \n\nAm I missing something? Why wouldn't everyone do IF to burn body fat? \n\nThank you to anyone who reads, I appreciate it!\n\ntldr; isn't IF better for burning body fat?",
    "comments": [
        {
            "level": 0,
            "comment": "The role of insulin in fat storage has been grossly distorted. Insulin has a number of effects and is part of a coordinated endocrine response to a number of bodily functions. Trying to micromanage for weight loss it or describe it in simple terms is futile. If you have a functioning endocrine system, then the only way to lose weight is to sustain a calorie deficit.\n\nNow there are a number of ways to accomplish this, but mainly they are behavioral methods that allow you to maintain consistency. \n\nIF has no independent benefits for weight loss. When it works, it works because some people find it to be an eating pattern they can adhere to more easily. Because IF is mentioned so often, sometimes it can have a placebo effect. There is nothing harmful or negative about IF, so if you like the idea, by all means try it. \n\nBut just pick a pattern that you think will work for you.",
            "score": 2,
            "author": "Azdak66",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for the reply!\n\nProponents of the intermittent fasting approach would seem to disagree that it does not yield any independent benefit. They claim things such as it helping to elevate human growth hormone or helping to heal insulin resistance. \n\nTo me, it seems as though it's a way to complicate something that is otherwise pretty simple. Either a person trying to lose weight is below their TDEE at the end of the day, or they are not. \n\nDr. Berg on YouTube is a huge advocate for the benefits of IF if you're familiar with him.",
                    "score": 2,
                    "author": "imBadMove2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whichever allows you to stay in a caloric deficit and control hunger and cravings",
            "score": 1,
            "author": "AgreeableFun5241"
        }
    ]
}