{
    "id": "148tztr",
    "score": 4,
    "title": "I’m 21 M, I’ve never dated anyone or kissed or have done anything with a girl , is it too late ?",
    "author": "Smart-Trip4411",
    "date": 1686702741.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148tztr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Part of that is because I’m very very very introverted and I haven’t talked to anyone in about 3 years since the pandemic. \n\nI’m starting to break out of my shell and I was wondering if it’s too late at this point to find a potential partner ?\n\nI literally have no experience",
    "comments": [
        {
            "level": 0,
            "comment": "Hi /u/Smart-Trip4411,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "21?! That's super young. You're fine.",
            "score": 46,
            "author": "Elise-an-easterbunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I think you maybe right; peole on other subs told me that it’s over me and it made me feel down",
                    "score": 4,
                    "author": "Smart-Trip4411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My husband’s best friend didn’t get his first girlfriend until he was about 26 or so. He’s also extremely shy. \n\nHe’s fine.",
                            "score": 9,
                            "author": "randomly-what",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That makes me feel good , thank you",
                                    "score": 5,
                                    "author": "Smart-Trip4411",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m the same age and, although I’ve technically had “girlfriends”, I’ve only been on one date, never kissed, and never had sex. We’re young, we’ve got all the time in the world.",
                                            "score": 3,
                                            "author": "tawayrabbitrat"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the people who tend to be late bloomers are quieter about it, to the point where it's a LOT LOT more common (amongst both men and women) than many people (especially ones who aren't late bloomers) realise, as virginity tends to be made fun of or ridiculed a bit.\n\nWhich is not cool, in my opinion, but it is what it is. It means those without earlier experience feel a bit weird and isolated, even when they're not. As long as you're looking for a partner because that's what you actually want in life, and not just so you don't feel like an outlier.\n\nWhat really breaks my heart is when I see stuff on the internet that's like, \"I'm 15 and never even been kissed by a boy. I'm the only one of my friends who hasn't. Am I some kind if ugly unlovable freak?\"\n\n(Meanwhile when I was 15 kids were still making fun of each other just for having crushes.)",
                            "score": 4,
                            "author": "genomerain"
                        },
                        {
                            "level": 2,
                            "comment": "Everyone moves at their own pace. I was a pretty late bloomer in that department too. Never even kissed anyone until I met my first college girlfriend. But she was kind of in the same place as me and that made it all the more fun and special \"exploring\" that stuff together.\n\nIf it's important to you, just keep looking and don't give up. I think it can be easy to fall into a cycle where people don't think romance is going to happen for them, so they quit trying and let opportunities pass them by...",
                            "score": 2,
                            "author": "JohannReddit"
                        },
                        {
                            "level": 2,
                            "comment": "People are idiots. I had an 8th grade girlfriend, then nothing for ten or eleven years, then an 18 month relationship at about 25, then I'd often go 3-5 years without dates. I never gave up on love, but I started making plans just in case it never happened. Found someone a couple years ago in my late 40s and it's been slow but steady ever since. There was a year or two in my 20s when I was very sad about being single, but I learned to live off the love of friends and family and let them give me that sense of fulfillment.",
                            "score": 2,
                            "author": "KurtWagnerX"
                        },
                        {
                            "level": 2,
                            "comment": "Don't listen to them!! I dated a girl  when I was 16. That ended in less than a year. The next time I went on a date I was 26. Do not let those assholes decide your life. You are in charge of it! You are 21, you have a ton of time to experience life and meet more people.",
                            "score": 2,
                            "author": "movinondowntheroad"
                        },
                        {
                            "level": 2,
                            "comment": "There's a weird culture on parts of Reddit to act like high school is like the peak of your life especially romantically. Don't worry, for most people it is the trenches of your life besides middle school.",
                            "score": 2,
                            "author": "CoraCricket"
                        },
                        {
                            "level": 2,
                            "comment": "Over for you? I'm not sure how someone could come to that conclusion. You're very young, if anything you're pretty much in your prime to go out and meet people.",
                            "score": 1,
                            "author": "Zyncon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Might sound cheesy but it's never too late and don't listen to anyone who tells you otherwise cause they are either trying too drag you down too their level or trick you for money",
            "score": 19,
            "author": "2ully",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah man I was on the forever alone sub and people told me to just give up at this point",
                    "score": 7,
                    "author": "Smart-Trip4411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Be careful too not too fall into pits like that, they're are people that would rather wallow in their own self pity then do anything too try too improve their lives \n\nIt's a self fulling cycle",
                            "score": 17,
                            "author": "2ully"
                        },
                        {
                            "level": 2,
                            "comment": "Gonna go on a bunch and say those probably aren’t communities you wanna stick too. Ironically while they’re made to support lonely people a lot of those communities just direct their frustrations outward",
                            "score": 2,
                            "author": "Zipper_ManTM"
                        },
                        {
                            "level": 2,
                            "comment": "Thats sad. I would say that it only something positive.",
                            "score": 1,
                            "author": "OkRing8197"
                        },
                        {
                            "level": 2,
                            "comment": "As others said don't participate in those kind of subreddits, plz.",
                            "score": 1,
                            "author": "EasySneezy123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nah I worked with a guy who was in great shape (ran marathons) and physically handsome but never dated. He was like 25. He brushed it off as being focused on career and such. I always assumed he was gay because he could have dated a lot if he wanted. He eventually got married and had kids. It’s fine. Everything at your own pace.",
            "score": 5,
            "author": "swentech",
            "replies": [
                {
                    "level": 1,
                    "comment": "That actually does make me feel a lot better , thank you",
                    "score": 2,
                    "author": "Smart-Trip4411"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not",
            "score": 4,
            "author": "taigowo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good good , thanks",
                    "score": 2,
                    "author": "Smart-Trip4411"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s never too late. But it ain’t gonna change unless you make changes.",
            "score": 10,
            "author": "TheHappiestJew",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess standing in the corner at a party hoping someone will approach me isn't working...time to try a different corner.",
                    "score": 7,
                    "author": "stoned_and_goods",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol give it a try, mate",
                            "score": 3,
                            "author": "TheHappiestJew"
                        },
                        {
                            "level": 2,
                            "comment": "In my experience my early romantic/sexual life developed as I gained confidence. There was a time in my teenage years when I couldn't even imagine myself in any romantic/sexual situation, or imagine anyone being interested in me or what I would even do if someone was. I didn't overcome that by specifically making it a mission to hook up with someone, more so it just came naturally as I continued to grow, have new experiences, put myself outside my comfort zone in other ways, meet new people, develop interests and passions, build connection with people and groups, get involved with causes, have adventures, etc. All things that lead me to becoming a fuller version of myself and gaining confidence. As this happens you become more attractive and intriguing to people, and you simultaneously are better able to approach people and initiate a flirtatious vibe. Sex/romance/etc will start happening naturally (not to say you shouldn't also push yourself to initiate something when it feels right) and as it starts happening a little, it becomes easier to see yourself as someone who can do that kind of thing, and you learn how to flirt and just get better at all of it, and it turns into sort of a snowball effect over time.",
                            "score": 1,
                            "author": "CoraCricket"
                        },
                        {
                            "level": 2,
                            "comment": "Yes. If you like someone, tell them that.",
                            "score": 1,
                            "author": "OkRing8197"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was pretty sheltered as well and had a lot of my firsts after I turned 18. \n\nIt’s never too late, you have all the time in the world and honestly I liked having the wisdom and maturity for my firsts rather then if I experienced them when I was 14-17.",
            "score": 3,
            "author": "Direct-Alternative70"
        },
        {
            "level": 0,
            "comment": "Nah. You're on  your first year of being a full adult with all the benefits that come with that age. You're good.",
            "score": 3,
            "author": "mysterBearSFO"
        },
        {
            "level": 0,
            "comment": "No it’s never to late you will find the right girl one day. You got this king!",
            "score": 3,
            "author": "special-lime-333",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you sir",
                    "score": 2,
                    "author": "Smart-Trip4411"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's 90% of Reddit",
            "score": 2,
            "author": "Fantastic_Effort_386"
        },
        {
            "level": 0,
            "comment": "Absolutely not.  I was 24 before I started dating.",
            "score": 2,
            "author": "revtim"
        },
        {
            "level": 0,
            "comment": "Until I was 20 I had only ever kissed one girl. From 20-30 I had sex with many different women. Not like I get laid a ton or anything like that just giving an example of someone who it took a long time to kinda get it…no pun intended",
            "score": 2,
            "author": "AirOk5278",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here, went from zero at 21 to 200+ by 30.  Don't overcorrect. Some tips:\n\n1. alcohol\n2. if alcohol doesn't work, get something stronger\n3. rehab\n\nOnce sober, you'll be back to where you started at 35. But at least that 'wasting my youth' anxiety will be over.",
                    "score": 1,
                    "author": "radix_mal-es-cupidit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep, youre trans now.",
            "score": 2,
            "author": "SoMuchDpndsOnTheWthr"
        },
        {
            "level": 0,
            "comment": "Everyone at every age before their first kiss feels like they're some kind of freak for not having done it yet. I had my first kiss at 17 and I felt the exact same way that you are describing for years beforehand. And this was way pre-pandemic (so for you, 21 minus the three years of isolation is 18, right in the same range). After having my first kiss and later loosing my virginity and all that, I became more aware of lots of people who didn't have any sort of anything until much later. Everyone felt like it must just not be meant for them until it started happening, now no one even remembers feeling that way until we see questions like this. You'll be fine.",
            "score": 2,
            "author": "CoraCricket"
        },
        {
            "level": 0,
            "comment": "Of course not! Don't let it (or anyone) get in your head about it. It will only be weird if you make it weird.",
            "score": 1,
            "author": "ascrumner"
        },
        {
            "level": 0,
            "comment": "I met my now wife shortly before I turned 20 and we didn't start dating until I was.  You've got plenty of time.",
            "score": 1,
            "author": "IHaveBecomeFire"
        },
        {
            "level": 0,
            "comment": "Once you stop worrying and thinking about it, you’ll find someone, get laid etc.  Just put yourself out there and get some hobbies that women also participate in!",
            "score": 1,
            "author": "DR843"
        },
        {
            "level": 0,
            "comment": "Just because everybody else is a degenerate doesnt mean you have to be one also. Other than the thrills of sinning, look forward to and try building a meaningful relationship with a person. That's what really feels good.",
            "score": 1,
            "author": "yoimkota"
        },
        {
            "level": 0,
            "comment": "No, it’s not too late but if you haven’t talked to anyone in 3 years you probably need some face to face counselling rather than rather than advice from random people on the internet.",
            "score": 1,
            "author": "nermalstretch"
        },
        {
            "level": 0,
            "comment": "Pen pals. Good ice breaker.",
            "score": 1,
            "author": "Traditional_Art_7304",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh that’s actually great",
                    "score": 1,
                    "author": "Smart-Trip4411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "An open mind helps,  there are many paths &amp; everyone is at a different place for reasons you do not yet know.\nHave fun!",
                            "score": 1,
                            "author": "Traditional_Art_7304"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "21? Oh honey you’re just getting started. Have a few drinks (liquid courage) and hit a bar. I’m sure you’ll find a girl to make out with.",
            "score": 1,
            "author": "Far-Conflict4504"
        },
        {
            "level": 0,
            "comment": "My mom met the love of her life when she was well beyond 40 - I don't think there is a to late to find a partner.",
            "score": 1,
            "author": "LeftEyedAsmodeus"
        },
        {
            "level": 0,
            "comment": "Nope. It's gonna kill you if you fret about it all the time, though. Don't think of yourself as being on the prowl looking for a girl. Think of yourself as someone who's browsing through what's out there, someone who's window shopping  until you find a good match.\n\nIf a girl you like doesn't like you, *she's not a good match for you.* I think that's the hardest thing to get young bachelors to understand. And if she's not a good match for you, it's not an indication of your value or of hers.",
            "score": 1,
            "author": "KurtWagnerX"
        },
        {
            "level": 0,
            "comment": "I took a 30 yr old guys virginity. I thought it was hot and made me feel special even if that wasn't the case. It's hot, you get to teach someone everything and see them experience things for the first time. \n\nYou're 21 that's not old at all. Get out there and just be yourself.",
            "score": 1,
            "author": "360_Bagel_360"
        },
        {
            "level": 0,
            "comment": "No way, it's never too late but especially not at such a young age.  However you will definitely need to talk to people more frequently to make it happen.",
            "score": 1,
            "author": "slash178"
        },
        {
            "level": 0,
            "comment": "Not at all. I didn't date anyone until around the time I turned 21. I'm in my late 30s now, married for over 10 years with a 5yo kid.\n\nGive yourself grace and be patient with yourself. There's no rush.",
            "score": 1,
            "author": "85watson14"
        },
        {
            "level": 0,
            "comment": "it is too late - if you don't use your lips by 21.5 or your dick, both fall off...\n\neither turn gay or give it all up :)",
            "score": 1,
            "author": "Puzzleheaded_Jury711"
        },
        {
            "level": 0,
            "comment": "I wouldn’t feel pressured that any age is too late. Also, 21 is still very young. I wouldn’t trip about it at all.",
            "score": 1,
            "author": "cooper121314"
        },
        {
            "level": 0,
            "comment": "I consider myself introverted, as well, and found that while it is tough for an introvert to make connections it's not impossible. I had some small flings in my teens, but I didn't really start dating until my early to mid twenties. I then found my partner and wife in my thirties. Point is it's never too late. Just try your best and get out there, rejection and other relationship pains can and will happen, and it'll be hard, but you will learn and grow from them.",
            "score": 1,
            "author": "GheeButterschnappsss"
        },
        {
            "level": 0,
            "comment": "It’s never too late if you genuinely wanna do it. You could be 60 and it wouldn’t be too late.",
            "score": 1,
            "author": "tawayrabbitrat"
        },
        {
            "level": 0,
            "comment": "Nah. I had almost no experience before 21. Just relax and enjoy your life. It'll happen when it happens.",
            "score": 1,
            "author": "Temporary-Jeweler-88"
        },
        {
            "level": 0,
            "comment": "It’s more common than you think, people just don’t talk about it. You’ll probably have your first girlfriend in the next year or two.",
            "score": 1,
            "author": "Inevitable_Theme775"
        },
        {
            "level": 0,
            "comment": "Not too late at all, you're all good",
            "score": 1,
            "author": "_Richter_Belmont_"
        },
        {
            "level": 0,
            "comment": "Bud, I know it's NoStupidQuestions, but you're literally barely a quarter of the way through your life yet. You're fine",
            "score": 1,
            "author": "DTux5249"
        },
        {
            "level": 0,
            "comment": "Don't say it's too late until you're like 40.",
            "score": 1,
            "author": "pummisher"
        },
        {
            "level": 0,
            "comment": "You should try working part time at a bar or some other job where you speak to, and sometimes flirt with, many more people than the average person would. \n\nYou're essentially behind on social experience. So what you wanna do is catch up on that experience. Being forced, by your job, to talk to a tonne of people will help you wirh being shy and make you far more adept at it. You don't need to.make it a career or anything,",
            "score": 1,
            "author": "No_Week2825"
        },
        {
            "level": 0,
            "comment": "You might volunteer a few hours at the college day care center.  Single moms, young staff, dude heaven.  If you like kids.",
            "score": 1,
            "author": "Paganoid_Prime"
        },
        {
            "level": 0,
            "comment": "Not at all my man. I’m sure you are a good dude. Just keep being yourself and try not to stress what others think or tell you.",
            "score": 1,
            "author": "socal_jab"
        },
        {
            "level": 0,
            "comment": "Yes.",
            "score": 1,
            "author": "dleon0430"
        },
        {
            "level": 0,
            "comment": "If you want something to feel better, remember that there is always someone worse off than us. I am 35f, almost 36 years old and I have never been in a relationship, never had anyone like me (as far as I know), and the only \"relationships\" I've had were platonic. And the worst part is that the guys knew I liked them. \nWell, as you can imagine, I have never had sex in my whole life. Now, at my age, and with a total lack of trust in people, I don't think I will ever be able to date. I remember when I was 19 and my dream was to have a family by the time I was 25. But not everything we want is possible. \nRecently, I was talking to a guy online, but unfortunately, I realized that he must have someone else and was just deceiving me. The chances of me trusting anyone are becoming minimal, I can't trust anyone enough to have a relationship, and when I try, it seems like they just want to deceive me. This seems to be my fate. \nI have no luck in love, and I know I won't find anyone. Can you imagine if I told these men that I am a 35-year-old virgin who has never been in a relationship?! They would laugh at me.\n That's why I close myself off even more. I know it's not right, but what can I do? I hope you have much, much more luck than me, indeed.",
            "score": 1,
            "author": "daskleinebaby"
        },
        {
            "level": 0,
            "comment": "21? Yeah man, you'll probably be dead by the end of the year, you're so old. RIP.\n\n...there, I got that out of my system...\n\nNo, it's not too late. Many people don't meet their soul mate (or even someone they just click with) until much later than 21.",
            "score": 1,
            "author": "ARoundForEveryone"
        },
        {
            "level": 0,
            "comment": "No wish it was the time I started dating. Kids are savages.",
            "score": 1,
            "author": "618Crypto"
        },
        {
            "level": 0,
            "comment": "Nope. I was 25 when I started dating my first girlfriend. There's plenty of time.",
            "score": 1,
            "author": "djddanman"
        },
        {
            "level": 0,
            "comment": "Fuck no, I lost my virginity at 23",
            "score": 1,
            "author": "Natural-Yam-2204"
        },
        {
            "level": 0,
            "comment": "Just going to join the chorus here.\n\nNope, not too late. Not even late enough that I'd be worried.\n\nI will give you one piece of advice, which is: Be open to experience, don't make the perfect the enemy of the good. E.g., if you match with a girl on Bumble and she's OK but you're not thrilled, ask for a second date anyway. This is how you'll build experience, and you might find that you grow to like people more than you expected you would at first.",
            "score": 1,
            "author": "Able-Distribution"
        },
        {
            "level": 0,
            "comment": "Are you kidding me? No, you're fine. Just get out there. Seriously, sign up for Tinder or something and make some moves. Let me put it this way: Would you expect to get a job without submitting your resume? Would you expect McNuggies to show up at your house without calling McDonald's?\n\nActually, far wiser people have covered [this topic](https://www.youtube.com/watch?v=raCc7oRb43U) better than I ever could.",
            "score": 1,
            "author": "DeadFyre"
        },
        {
            "level": 0,
            "comment": "Was in a similar boat. I partially blame it on my environment. Didn't have sex until 23, didn't have any relationship last more than a month or two. Met my current partner a year and a half ago, when they were forced to move down here. Currently 28, and this is my best relationship so far, and it just took a random coincidence sending me someone who I can feel somewhat comfortable around.",
            "score": 1,
            "author": "Pxfxbxc"
        },
        {
            "level": 0,
            "comment": "I hope not because I’m 25 in a similar situation",
            "score": 1,
            "author": "Aswele"
        },
        {
            "level": 0,
            "comment": "If you want to do something before you get a partner, go to a bar, meet someone, and take them home. If you don't, go to a place that you enjoy and meet someone there.",
            "score": 1,
            "author": "n-cole_9"
        },
        {
            "level": 0,
            "comment": "You still have until your 30",
            "score": 1,
            "author": "Khfreak7526"
        },
        {
            "level": 0,
            "comment": "You know that introverted girls exist too? they are as lonely as you are so its just a matter of finding the one that you like and that likes you back.\n\nIm introverted but to prove myself wrong then i married an extrovert - i suspect that she whacked me over the head with her handbag and dragged me home like she was a cave woman.",
            "score": 1,
            "author": "grax23"
        },
        {
            "level": 0,
            "comment": "Never too late but what happened to all the prostitutes?",
            "score": 1,
            "author": "mpoole68"
        },
        {
            "level": 0,
            "comment": "I like to use a flow chart for this.\n\nAre you dead?   Yes=Go to #1 \nNo= Go to #2\n\n#1 It's too late, sorry :(\n#2 You have plenty of time! :)",
            "score": 1,
            "author": "Professional_Bag3713"
        },
        {
            "level": 0,
            "comment": "Too late is relative to the length of your life. You plan on ending it soon? If not than realize this, we are all visiting this world. Use the time you have been given or live long enough to look back in regret of all the missed opportunities. 21 is young as fuck man. Don’t live life in the rear view mirror. There’s a world of potential that you just need to say yes to.\n\nWe all hold on our hands the cards we were dealt. Either we do the best we can with what we have or we fold and accept the loss.",
            "score": 1,
            "author": "illusiveXIII"
        },
        {
            "level": 0,
            "comment": "No its not to late. Iam a women and would not care about this if i liked you. Is there anyone you like?",
            "score": 1,
            "author": "OkRing8197"
        },
        {
            "level": 0,
            "comment": "Bruh your 21 you’ve got plenty of time.",
            "score": 1,
            "author": "twhamsler33"
        },
        {
            "level": 0,
            "comment": "It’s absolutely over. I’m so sorry",
            "score": 1,
            "author": "Renoire"
        },
        {
            "level": 0,
            "comment": "Nope! Met my husband when he was 20, almost 21. Never been kissed. Wanted to kiss him within 2 hours of meeting him and thought how lucky I was that no other woman before me had snatched him up. \nI had a female friend who was single and celibate till 30. Met her now husband after asking her friends to introduce her to eligible young men because she didn’t want to be single anymore. Married within 6 months, now they have a child. The evidence suggests despite lack of experience they figured it all out ☺️ \nDon’t worry! Be Kind to yourself and others, spend your time doing things you enjoy and improving yourself. The right person will come along.",
            "score": 1,
            "author": "mistakenhat"
        },
        {
            "level": 0,
            "comment": "I felt that way when I was 18M. Now that I'm 31M, I can say it definitely wasn't too late. 18 year olds are still kids even if they don't feel that way. My (f)riend got her first kiss at 26 and first boyfriend at 32. I'm pretty sure she didn't lose her virginity before that as she's asexual but not aromantic.",
            "score": 1,
            "author": "KawaiiCatboy"
        },
        {
            "level": 0,
            "comment": "I would not let your inexperience keep you from getting out there however maybe don’t advertise that, yet don’t lie, be honest and honestly it’s very noble because you don’t want to use people or get used. At least you’re clean too, there are many pluses to your purity but I hope you don’t end up and incel lol, feel bad for those people, everyone deserves love. Call me wrong but maybe go to Vegas and hire a call girl to get “experience with”… you could go to a club and find a thirsty girl just protect yourself for sure and give yourself a pass for one night, read “the game” by Neil Strauss it will give you a new Perspective on indicators of interest and what works/doesn’t… best of luck to your happiness I wish you well.",
            "score": 0,
            "author": "Far_Battle_9835"
        }
    ]
}