{
    "id": "148umjx",
    "score": 0,
    "title": "Can I get in Trouble for taking a 99 cent piece of ginger?",
    "author": "Mungwithamoustache",
    "date": 1686704742.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148umjx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was just asking, I went to my local longs and found a peice of ginger that looked like a dick. I thought it was funny and was gonna buy it so I held it, while i was fixing my pocket I put it in there. I honestly forgot about it, and didn’t realize till I got home, would I be in Trouble?",
    "comments": [
        {
            "level": 0,
            "comment": "Is that a very long way of asking \"I stole something from a store because I thought it was funny?\"",
            "score": 3,
            "author": "anschauung",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was an honest mistake, but it was dick shaped and I feel really bad, but I can’t return it because I live really far and my mom won’t drive me.",
                    "score": 2,
                    "author": "Mungwithamoustache",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Y'know ... you'll have to make your own moral calculations there. But I'd wager that you're not the first person to steal dick-shaped produce from a store.",
                            "score": 3,
                            "author": "anschauung"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "a piece of ginger isnt much of a loss. they would only wanna charge you if you stole something that was worth like $50 or more. i've stolen deodorant from walmart but they couldnt care less.",
            "score": 1,
            "author": "Familiar_Hat_6132",
            "replies": [
                {
                    "level": 1,
                    "comment": "So, It’s okay to eat the dick shaped Ginger right? I mean there’s no point in returning it",
                    "score": 1,
                    "author": "Mungwithamoustache",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Deep throat that baby!",
                            "score": 1,
                            "author": "MiserablePassion-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the fuck compelled you to reply with that",
                                    "score": 1,
                                    "author": "Mungwithamoustache",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The fact that you keep going on about eating dick shaped ginger, perhaps?",
                                            "score": 1,
                                            "author": "MiserablePassion-"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i mean its yours now, do what you want with it 😅",
                            "score": 1,
                            "author": "Familiar_Hat_6132"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "nah you’ll be fine, but i would like to see the penis shaped ginger please",
            "score": 1,
            "author": "billclintonseggfarm1",
            "replies": [
                {
                    "level": 1,
                    "comment": "What, you gonna jerk off to a penis shape ginger? And I’m only showcasing it to others when I die",
                    "score": 1,
                    "author": "Mungwithamoustache"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If your conscience bothers you, you can always write a letter to the store manager and include a couple of bucks and an explanation.  You don't have to put your name.",
            "score": 1,
            "author": "threePhaseNeutral"
        }
    ]
}