{
    "id": "148uqpl",
    "score": 1,
    "title": "For future reference, how do I greet a vet (and civilian) on Memorial Day (in the US)?",
    "author": "AnIdiotAtHome91",
    "date": 1686705125.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148uqpl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do I say \"Happy Memorial Day\"? Im 32, always lived in the States and still don't know how to greet someone on that day. Especially not vets. I was told \"Happy Holidays\" this last Memorial Day and I didn't know how to resond. She was an Army vet too. And I was thinking about this, for when I saw her. Too afraid to ask here at the time tho. Anywhoozy, I mumbled and sorta stutter out \"Happy Memorial Day\". And she laughed and asked me what I said. \n\nThe main reason I ask is because Memorial Day is not a happy  day for vets. It's in remembrance for their brothers and sisters in arms who died in battle. So... I didn't know what to say there. I'm just looking to not be offensive the following Memorial Days.\n\nThanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "There is no greeting for Memorial Day. And that holiday is not for the veterans you meet on the street. Memorial Day is for those who *died* while in military service. Veterans Day is when we honor those veterans who are still with us.",
            "score": 3,
            "author": "KurtWagnerX",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know that, but I just wanna know how to greet them specifically.",
                    "score": 1,
                    "author": "AnIdiotAtHome91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Hello.\"",
            "score": 2,
            "author": "Pastadseven",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, she said \"Hally Holidays\" to me, so I'd have to know how to respond, right? Plus I'd wanna know how to interact with them on that day no matter what. Like how to greet them on that day",
                    "score": 0,
                    "author": "AnIdiotAtHome91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't really know myself. I just say 'thank you for your service' if I know they are a veteran. I am guessing she just laughed because she didn't know what you said. That or she was just messing with you, haha! I don't think there's anything wrong with \"Happy Memorial Day\" either because you are honoring people who fought. I personally would think it inappropriate to say to anyone mourning by the gravesites or reflecting silently at memory sites though.",
            "score": 2,
            "author": "ShyGuyPal101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, I guess the best way to greet a vet on Memorial Day is with a salute and a plate of BBQ - but maybe save the 'happy' for a different occasion.",
                    "score": 1,
                    "author": "VenusDiamondbsvy6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My husband is a veteran and he prefers not to be specially acknowledged at all. He said a) he doesn’t feel what he did was special and b) it’s not good memories for him so he prefers to not have it recognized. \n\nNow for families of those who have fallen, idk. It could be different. Families tend to feel differently about their service member’s duty. There’s a lot of pride there and admiration. So they may appreciate your thanks. What I would do is great them normally and wait until they bring it up. If they do, then you can give thanks.",
            "score": 2,
            "author": "Aggravating-Menu6702"
        },
        {
            "level": 0,
            "comment": "\"Thank you for your service.\"",
            "score": 0,
            "author": "themoirasaurus"
        }
    ]
}