{
    "id": "148uiiv",
    "score": 0,
    "title": "Is is offensive if I get a semi colon tattoo though I've never been depressed or mentally ill?",
    "author": "[deleted]",
    "date": 1686704396.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148uiiv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I love the message behind it and I do relate to it to some extent, but it's not as if I went through anything that significant. I'm afraid that me getting it will hurt other people's feelings if they notice it and think I'm just trying to be attention seeking or something. Idk haha",
    "comments": [
        {
            "level": 0,
            "comment": "some people will ask what was the point of getting it, but its truly up to you since its something permanent on your body. theres medusa tattoos that mean sexual assault, but theres some people that just like the tattoo of medusa who have never been sexually assaulted, so it truly doesnt matter what someone else thinks. its going on your body and you better like it for the rest of your life since it's permanent.",
            "score": 3,
            "author": "Familiar_Hat_6132"
        },
        {
            "level": 0,
            "comment": "It's not offensive, but it may be perceived as corny, since quite a lot of people have that same tattoo.",
            "score": 5,
            "author": "neverbeenwrongb4",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha thanks, I don't mind if they think it's corny, just don't wanna hurt anyone's feelings lol",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's not offensive but very harrowing and devastating.\n\nD:",
            "score": 1,
            "author": "AnIdiotAtHome91"
        },
        {
            "level": 0,
            "comment": "Your skin your choice. Simple as that. I didn't wonder if getting my pentacle tattoo would offend bible bashers. You get a tattoo because it resonates with YOU. If anyone gets pissy about it or tries to question your authenticity then that's their insecurities showing.",
            "score": 1,
            "author": "OverAllTheThings"
        },
        {
            "level": 0,
            "comment": "not at all. people may assume that you have a shared experience with them, but not everyone gets it for their own struggles. i have one because my aunt committed suicide when i was younger, but i’ve never struggled with depression myself.",
            "score": 1,
            "author": "Femme-Angel"
        },
        {
            "level": 0,
            "comment": "As someone who has a history of mental illness and suicidal ideation, I would find it really strange and yeah, a little offensive if someone without those experiences got that tattoo.",
            "score": 1,
            "author": "themoirasaurus"
        }
    ]
}