{
    "id": "148vfww",
    "score": 2,
    "title": "How do people afford expensive cars at young ages ??",
    "author": "Coolkid8902",
    "date": 1686707365.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148vfww",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am 20 genuinely confused on how people my age afford chargers, challengers and scat packs. It makes me feel like I’m behind in life.",
    "comments": [
        {
            "level": 0,
            "comment": "Rich parents or going into debt",
            "score": 8,
            "author": "hellshot8"
        },
        {
            "level": 0,
            "comment": "Lease.",
            "score": 7,
            "author": "Famous_Ad6315"
        },
        {
            "level": 0,
            "comment": "You can afford a challenger when you finance it out for 84 months. Don’t assume just because someone has a nice car they are in a good financial position.",
            "score": 6,
            "author": "zman245",
            "replies": [
                {
                    "level": 1,
                    "comment": "Usually the exact opposite in fact",
                    "score": 5,
                    "author": "kungfoocraig"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These people go out of their way to *look* more well off than they are. Trust me, these people are much worse off than they seem",
            "score": 5,
            "author": "iamjustsomeperson"
        },
        {
            "level": 0,
            "comment": "There are lots of reasons/tricks\n\n* Join a car club\n* lease and finance\n* use credit\n* have rich parents who pay for your expenses\n* have rich parents that give you a \"boost\" in some way\n* have rich parents that give you an allowance\n* have a trust fund\n* have rich family members who die and leave you money\n* live in an area with low cost of living\n* take out loans or mis-use student loans\n* Save\n* hustle and do side businesses\n* illegal hustles and side businesses\n* invest and take the high risks of playing the stock market and or bitcoin\n* spend your tax return money carelessly\n* any combination of the above as well as other tricks",
            "score": 3,
            "author": "partoe5"
        },
        {
            "level": 0,
            "comment": "Generally, 20 year olds with $70k cars either have wealthy parents that fronted them or they're making financially suicidal credit decisions. Hell the average 50 year old can't afford that $85k pickup truck, or the $100k Cadillac Escalade in a responsible manner, a lot of those that you see on the road are written off as dubious business expenses.",
            "score": 1,
            "author": "ninthgenderplatypus"
        },
        {
            "level": 0,
            "comment": "I had a Kia sedan that I took a 5 year loan on. I paid it off completely saved up for a year  or so and used the trade in for a mustang. My payments are about the same as my sedan when I had it and my insurance actually went down. \n\nIt’s not exactly *cheap* driving a sports car but I don’t really spend money on other things like eating out or shopping etc. \n\nSide benefit as a young person it’s my first non co signed loan which well help me in the future if I decide to buy a home etc…",
            "score": 1,
            "author": "stoneguythepilotguy"
        }
    ]
}