{
    "id": "148vvnb",
    "score": 1,
    "title": "Is this true about dogs?",
    "author": "deviantmoth",
    "date": 1686708775.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148vvnb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I heard with dogs you should be able to feel their ribs but not see their ribs. That if you can't feel their ribs, they're too fat and being over fed and if you can see their ribs they're too skinny and being under fed. What doesn't make sense about this is I feed my dog regular meals and I can always see his ribs despite being well fed.",
    "comments": [
        {
            "level": 0,
            "comment": "This is highly dependent on the breed! Some breeds are boney, some are flabby, and some are in between",
            "score": 4,
            "author": "junidee",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's a doberman pinscher.",
                    "score": 2,
                    "author": "deviantmoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that's horses, but you shouldn't see a dog's ribs either.",
                            "score": 1,
                            "author": "daisy_belle1313"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just ask your vet, don't think about it so hard",
            "score": 2,
            "author": "hellshot8"
        },
        {
            "level": 0,
            "comment": "If your dog is shorthaired, you may be able to see the last 2 ribs even at a healthy weight. And possibly a shadow of the other ribs, if he's muscular. \n\nIf you can see more than that, something might be wrong, ask your vet.",
            "score": 1,
            "author": "Various_Succotash_79"
        },
        {
            "level": 0,
            "comment": "A dobie has short fur, so I would suspect it would be a lot easier to see the ribs. I would go more with the feel test and judge yourself how it looks. If you have any questions, you can either take him to the vet, or if doesn’t seem that crucial, bring it up at his next checkup.",
            "score": 1,
            "author": "Azdak66"
        }
    ]
}