{
    "id": "148vx2u",
    "score": 1,
    "title": "Is it possible for the same product to sound different ?",
    "author": "CodeJules",
    "date": 1686708904.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148vx2u",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have 2 of the same headphones. They sound totally different. I feel like I'm going crazy hearing them. My 1st pair amazing, but 2nd pair is driving me up a wall. \n\n1st pair amazing clarity.\n2nd pair sounds boxy, and not as much clarity as a result.\n\nI even notice manufacturing differences. 1st pair ear cushions have little give, as the 2nd pair have more give, and are quite uncomfortable. It's as the 2nd pair have less cushion than the 1st. Is this because the 1st is more than 1 yr old, and the 2nd pair is about 21 days old? \n\nFor anyone wondering these are for the Marshall Major IV's.",
    "comments": [
        {
            "level": 0,
            "comment": "There are multiple possible reasons for this. One possibility is that one is really a knock-off being sold online as if it's the real brand. Where do you buy them from?",
            "score": 1,
            "author": "xiaorobear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both pairs bought from bestbuy actually. 1st online due to unavailability in store, and 2nd pair in-store.",
                    "score": 1,
                    "author": "CodeJules",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Huh. So, it's very unlikely but still *possible* the inferior one is a counterfeit. Like if you search on youtube for 'fake marshall major' there are lots of videos of people comparing counterfeits with real ones. But if you got it in-store from Best Buy, this would probably only really happen if someone bought some real ones, swapped them for fake ones, and then returned the fakes. That's kind of a lot of effort for not very much money, because I assume a store would get suspicious if you had a large number of purchases and then returns.\n\nIt's also possible that within the last year they changed manufacturers and started making them with much lower quality, but if that's the case, then reviewers online should say so.",
                            "score": 1,
                            "author": "xiaorobear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it possible the 2nd pair is counterfeit? Is it too late to just return or exchange the pair you don't like? It's also possible the new pair isn't completely broken-in. It can take up to 50 hours of use to break-in headphones. Personally, I supect the company has simply made the product worse to earn more profit - happens all the time now.",
            "score": 1,
            "author": "javaking_1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too late by 5 days 😪. I read they were taken over by another company in March, but cannot find anything if they switched factories... and yeah wouldn't doubt it.",
                    "score": 1,
                    "author": "CodeJules"
                }
            ]
        }
    ]
}