{
    "id": "148v079",
    "score": 51,
    "title": "How serious would you take it if a man says “I’m going to kill you?”",
    "author": "Minute-Cellist-2351",
    "date": 1686705958.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148v079",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m not sure what do. He says after he kills me it will be so bad that the police will be involved. I’ve been in abusive situations before and the same for my mom but I’m not sure if I should take him seriously or is he just upset. I don’t know. Am I naive. What should I do? Is he serious?",
    "comments": [
        {
            "level": 0,
            "comment": "That’s a serious threat, you should get away from whoever this is.",
            "score": 125,
            "author": "dontneedareason94",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I’m still shocked and I’m not thinking straight. He also threatened to kill my mom. I’m guessing because he knows how much I love her. She basically called him an asshole and then he started threatening her as well.",
                    "score": 38,
                    "author": "Minute-Cellist-2351",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please get out and be safe.",
                            "score": 25,
                            "author": "howtoeatfriedpizza"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like police might need to get involved as well",
                            "score": 50,
                            "author": "dontneedareason94",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's no \"might\" about it.\n\nGo file a police report and get a protective order/restraining order.\n\nIf you are still allowing this person to play any role in your life...stop.\n\nAny relationship you may have had with this person is over, spoiled, done. It's not going to \"get better.\"\n\nIt's over.",
                                    "score": 33,
                                    "author": "GingerMau"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would call a domestic hotline for advice asap. They can help you assess the threat level and next steps.",
            "score": 52,
            "author": "Top_Departure_2524",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded! Depending on all sorts of details OP I absolutely understand calling the police might not be an option. The national DV hotline is (800) 799-7233, or text START to 88788. Advocates are trained to help you evaluate your safety &amp; make plans on how to ensure you and your family stay safe. Please reach out to a professional!",
                    "score": 20,
                    "author": "sunshinegirl605"
                },
                {
                    "level": 1,
                    "comment": "Thirded. \n\nAlso OP, please be aware that threatening someone this way is actually a criminal offence. The police may be able to assist, but get advice from the DV services first so you can go about this as safely as possible.",
                    "score": 6,
                    "author": "Sweeper1985"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Legit question, can he currently get to you physically like right now? (ie same house).\n\n\nIf someone's saying things like that, not in a joking way, yeah contact the police, you're not wasting their time. If you're getting calls/texts etc saying this, document it.",
            "score": 18,
            "author": "SameSeas",
            "replies": [
                {
                    "level": 1,
                    "comment": "And if he's saying it in a \"joking\" way, you have to ask why is he \"joking\" in a manner to try to scare you? No matter what you need to get out of this scry and dangerous relationship.",
                    "score": 3,
                    "author": "CoraCricket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like OP is scared. Intent doesn't matter at that point.\n\nCops. Call them.",
                            "score": 1,
                            "author": "iijjjijjjijjiiijjii"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should absolutely take that as the biggest red flag and get the heck away from that situation. Also it doesn't matter if he was just upset, if you were upset would you threaten his life? Probably not because that's not healthy.",
            "score": 47,
            "author": "Baconwcheese"
        },
        {
            "level": 0,
            "comment": "Incredibly serious, if you live in the same roof as this dude then I suggest staying with your mom or a friend for a bit",
            "score": 9,
            "author": "MysteryNeighbor"
        },
        {
            "level": 0,
            "comment": "You may be in legit, serious danger.",
            "score": 8,
            "author": "745395"
        },
        {
            "level": 0,
            "comment": "i'm a little confused by your question... i was going to say (before i read your description) that people sometimes say that kind of thing jokingly, but this seems like a different situation. the fact that he went on to mention the police is... unsettling. what is your relationship to this person and what was the context?",
            "score": 22,
            "author": "Severe-Possible-"
        },
        {
            "level": 0,
            "comment": "LEAVE!",
            "score": 7,
            "author": "Inside-Big-8158"
        },
        {
            "level": 0,
            "comment": "I can't tell you if he really means it or not, and it doesn't matter. Assume he does and call the police.\n\nIf you assume he's bluffing and you're wrong, the consequences are *much much worse* than if you assume he's serious and you're wrong.",
            "score": 6,
            "author": "PhasmaFelis"
        },
        {
            "level": 0,
            "comment": "SERIOUS, theyll do it WITHOUT a warning, i literally have heard more cases of follow through than not, get out, get help, get protection, and im so sorry",
            "score": 5,
            "author": "scatteredivy"
        },
        {
            "level": 0,
            "comment": "I would file a restraining order, honestly. Even *if* he didn't mean it, and that's a big if, he still meant it enough to say it. It doesn't matter how angry someone is, that's no excuse to abuse your partner and that's exactly what that is.. abuse.",
            "score": 4,
            "author": "destinationsanity"
        },
        {
            "level": 0,
            "comment": "I would absolutely call the police. Don't wait til it escalates.\n\nSeriously. Now.\n\nAnd you take that motherfucker out of your life even if he's nice sometimes.",
            "score": 6,
            "author": "360_Bagel_360"
        },
        {
            "level": 0,
            "comment": "It's time to leave that relationship.",
            "score": 3,
            "author": "emmanuelibus"
        },
        {
            "level": 0,
            "comment": "When ANYONE says they're going to do something like that you should take it serious. Better safe than sorry. This is coming from someone who has also been in abusive situations. Don't take that stuff lightly. That's a huge red flag. Get away. I hope dearly that you're safe and if not that you will be soon.",
            "score": 3,
            "author": "ManicPoptart"
        },
        {
            "level": 0,
            "comment": "Unless I had some *very* strong reason to believe he was just kidding around, I'd go to the police.",
            "score": 2,
            "author": "Cyberhwk"
        },
        {
            "level": 0,
            "comment": "No doubt.",
            "score": 2,
            "author": "jmerp1950"
        },
        {
            "level": 0,
            "comment": "You don't say \"I'm going to kill you\" and expect to not be taken seriously. You need to believe what this person is saying. Anything else is the mind trying to minimize bc no one wants to believe or deal w that",
            "score": 2,
            "author": "Fantastic_List3029"
        },
        {
            "level": 0,
            "comment": "If a person who you’re meant to trust uses a threat to kill then you need to take that very seriously; regardless of whether they are “upset”. Take action now. Leave and report. I don’t know where you are but where I’m from, if they are seriously intending to follow through, then it’s an indictable offence with up to to 10 year’s imprisonment.",
            "score": 2,
            "author": "Badgerello"
        },
        {
            "level": 0,
            "comment": "My assessment of the risk factor has to do with ethnic background. If I heard that from an Arabic or Indian sub continent culture where women are seen as possessions  - the risk is very high.\n\nIf the man is not that but extreme in many of his world views and ideas of family social structure, and a 'woman's duty to her man' rigidity. You also have a high risk.\n\nWhat to do. File a report with the police with as much DOCUMENTATION as you can get. (a text messaging sequence where you  mention to him about the threat to kill and ask an explanation because you don't feel he should have. If he fails to claim he never said it, you have an admission by its lack.\n\nCan you move far far away? Sadly, many men of this type do not react well to people trying to get them to do anything at all they don't wanna do.",
            "score": 2,
            "author": "vorpalblab"
        },
        {
            "level": 0,
            "comment": "Even if you didn't believe him, why would you want to be with someone who would threaten you? You are in a seriously abusive relationship and need to get out. You are in danger and you need to be smart about how you get out, look up strategies for leaving abusive relationships and follow them. And in the future, never ever stay with someone who threatens you or hints at threats.",
            "score": 2,
            "author": "CoraCricket",
            "replies": [
                {
                    "level": 1,
                    "comment": "After you escape this situation, I think you should start reading a lot about abusive relationships. Someone threatening to kill you is so far beyond a red flag no matter how it's said that it's really concerning that you don't immediately recognize it that way. To clarify, this is not to say you're doing anything wrong or scold you for not seeing it that way at first. Especially since you've been in abusive relationships and potentially grown up around your mom's abusive relationships, it's super normal that you would have a skewed perception of what is acceptable behavior in a relationship (often people with a long history of abuse will find themselves comparing their partner to past partners and thinking, \"well he's an improvement\" without realizing that he's still mistreating you). Abusers will also often be able to pick up on this and target people who have been abused before because they are able to get away with more.",
                    "score": 1,
                    "author": "CoraCricket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was stalked and assaulted and held by an ex so I would definitely take it seriously",
            "score": 1,
            "author": "Sometimes_an_a-hole"
        },
        {
            "level": 0,
            "comment": "If you are in America get a gun.",
            "score": -1,
            "author": "blindCat143"
        },
        {
            "level": 0,
            "comment": "When someone says they're going to kill you, it's very serious. He wouldn't say it if he didn't have the urge to do it. You should get away from him immediately. It's not normal to make threats like that, even when upset. He obviously doesn't know how to control himself to say something so disturbing so it's a huge huge red flag.",
            "score": 1,
            "author": "greencoffeemonster"
        },
        {
            "level": 0,
            "comment": "Sounds like he bought some thought into it, thinking about the method\n\nI would take the threat seriously and get away from them",
            "score": 1,
            "author": "Mythical_Atlacatl"
        },
        {
            "level": 0,
            "comment": "Very. I moved out of my last apartment due to the downstairs neighbor making such a threat. I had called the police and informed the property manager. I just wanted everyone aware just in case he actually did try to hurt me. They are no longer welcome to extend their lease there and I believe the PM was planning to attempt to evict them as well.",
            "score": 1,
            "author": "Beluga_Artist"
        },
        {
            "level": 0,
            "comment": "Depends on the context of the conversation and if something was said or done to upset him ,but I still don’t think (even if upset) that anyone should even in the heat of a moment say ,”I’m going to kill you…” So I’d get away from the situation for the time being and let things cool off ,but it’s not my situation and I wouldn’t know if they are serious unless I’m in the room and hearing it.",
            "score": 1,
            "author": "roaringlion1822"
        },
        {
            "level": 0,
            "comment": "VERY!!",
            "score": 1,
            "author": "PleasantWriter8581"
        },
        {
            "level": 0,
            "comment": "Depends on the person. If they look like a gangbanger or a criminal, run. If they look like a comedian, run. If they look, run.",
            "score": 1,
            "author": "IndeedeeGamer"
        },
        {
            "level": 0,
            "comment": "Usually you don’t know the outcome till its too late take every threat and every word seriously document everything and get a restraining order even then make sure you yourself are protected in case anything does happen i suggest a small handgun if not have someone stay over for a while",
            "score": 1,
            "author": "Prestigious-Rip1507"
        },
        {
            "level": 0,
            "comment": "Call the police, there are random people just waiting for an excuse to murder someone in an altercation and call it self defense.  They're twisted.\n\n* Replace random people with random psychopaths",
            "score": 1,
            "author": "Slide-Impressive"
        },
        {
            "level": 0,
            "comment": "My ex used to tell me ways he imagined killing me, my advice to you is get out now, don’t stay in that relationship a minute longer.",
            "score": 1,
            "author": "Honest_Scot"
        },
        {
            "level": 0,
            "comment": "Always listen to what someone says their intentions are",
            "score": 1,
            "author": "HeresKuchenForYah"
        },
        {
            "level": 0,
            "comment": "Please leave somewhere when you'll be in security.\nEven if he was upset, you simply cannot threaten someone like that. Take care of you please ❤️",
            "score": 1,
            "author": "Lovesickgirlz7"
        },
        {
            "level": 0,
            "comment": "Depends, if its someone I know I wouldn’t take it seriously, but in your case you should get police involved",
            "score": 1,
            "author": "traditional_prompt64"
        },
        {
            "level": 0,
            "comment": "Listen to him and take him seriously, your safety depends on it.",
            "score": 1,
            "author": "voto1"
        },
        {
            "level": 0,
            "comment": "I want to tell you the words I wish I could tell my brother. He is alive, just not \"able\" to leave. I escaped almost 20 years ago and am now happily married to my favorite person. The man that said this to you feels he has ownership of you. He thinks your life belongs to him. Your very existence belongs to him and no one else. Not even you. Therefore, he can take it. Run. Even if all you have is the clothes you ran with. It is very hard, but it means being alive.",
            "score": 1,
            "author": "Finalgirl2022"
        },
        {
            "level": 0,
            "comment": "it's all about context",
            "score": -4,
            "author": "JohnPaton3",
            "replies": [
                {
                    "level": 1,
                    "comment": "But in any context where you find yourself having to ask if they're serious, this is scary and you need to get out.",
                    "score": 2,
                    "author": "CoraCricket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I probably wouldn't take it seriously at all. I'm an exceedingly inoffensive person",
            "score": -11,
            "author": "KurtWagnerX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disagree",
                    "score": 2,
                    "author": "Otherwise_Bill_5898"
                },
                {
                    "level": 1,
                    "comment": "He might not do anything and it may just be empty threats. I would tend towards thinking nothing of it, but threatening to kill someone in the context of an abusive relationship is very serious.",
                    "score": 1,
                    "author": "ANewUeleseOnLife"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell them they might want to call a friend to help them beat the fool within an inch of their life.",
            "score": -2,
            "author": "AR_Introduction1976"
        },
        {
            "level": 0,
            "comment": "Nothing proably nothing will come out of it it's such a broad statement who cares anyway about my life",
            "score": -2,
            "author": "Maleficent-Demand107"
        },
        {
            "level": 0,
            "comment": "Is there a way to murder someone without the police being involved?",
            "score": -2,
            "author": "Firm-Reception-8541"
        },
        {
            "level": 0,
            "comment": "I would thank him i would even give him all my money, just kill me",
            "score": -2,
            "author": "Imma_Lick_Your_Ass2"
        }
    ]
}