{
    "id": "148w6sc",
    "score": 1,
    "title": "Can an immigrant own a gun in the U.S?",
    "author": "foxwinn",
    "date": 1686709756.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148w6sc",
    "media_urls": [],
    "other_urls": [],
    "postText": "A bit of background, I came from Mexico as a little kid. I'm not technically illegal but I am not a U.S. citizen either. I have a social security number and a driver license. I also have DACA. However I'm not fully a U.S. citizen. I was wondering if it is possible to own a gun despite my circumstances? Mostly for home security, but I might consider open carry too.",
    "comments": [
        {
            "level": 0,
            "comment": "Hi /u/foxwinn,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Any alien legally in the US is NOT prevented from obtaining firearms. \n\nhttps://www.atf.gov/firearms/qa/may-aliens-legally-united-states-purchase-firearms",
            "score": 2,
            "author": "bigwavedave000",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's not though, DACA is not legal",
                    "score": 1,
                    "author": "CP1870"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. Federal law doesn't allow illegal immigrants to purchase or possess firearms, and for this purpose courts have ruled DACA recipients are still treated as illegally present. Congress would have to pass a law making an exception or to give people permanent resident status. There's also a restriction (but with some built-in exceptions) on people admitted under nonimmigrant visas, but not on other aliens such as permanent residents.",
            "score": 2,
            "author": "Odd-Imagination-8019"
        },
        {
            "level": 0,
            "comment": "Yes. If you are a legal resident, you can legally purchase a firearm.",
            "score": 1,
            "author": "ninthgenderplatypus"
        },
        {
            "level": 0,
            "comment": "No. Even with DACA you are still an illegal immigrant and thus have no rights",
            "score": 1,
            "author": "CP1870"
        },
        {
            "level": 0,
            "comment": "That's a good question.  I don't actually know.",
            "score": -3,
            "author": "Rob1150",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then...why would you respond?",
                    "score": 1,
                    "author": "-v-fib-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because I would like to know too.",
                            "score": 1,
                            "author": "Rob1150"
                        }
                    ]
                }
            ]
        }
    ]
}