{
    "id": "148ydx8",
    "score": 0,
    "title": "Why is there no picture of the earth in 2023 where we can zoom in and see a boat or plane upside down?",
    "author": "Formal-Shallot-595",
    "date": 1686716884.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148ydx8",
    "media_urls": [],
    "other_urls": [
        "https://imgur.com/a/hElpOLY"
    ],
    "postText": "In 2023, we have cameras and telescopes with resolutions higher than we could've ever imagined. Why is there no picture of the earth so detailed enough that we could zoom in and see an airplane or boat traveling upside down perhaps on the coast of Australia Or near Antarctica if you wanna look at it from that direction/perspective?\n\n&amp;#x200B;\n\nLike this https://imgur.com/a/hElpOLY",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; In 2023, we have cameras and telescopes with resolutions higher than we could've ever imagined.\n\nThey're not high-res enough that they could zoom in to the level of a person *and* take a photo of the entire planet. The trade-off for higher magnification in a telescope is that you take a picture of a smaller area.",
            "score": 8,
            "author": "Pegajace"
        },
        {
            "level": 0,
            "comment": "By upside-down, I assume you're imagining seeing a picture that shows the curvature of the Earth and a boat or plane at the \"bottom\" of the sphere, like how an ant on a basketball appears upside-down if the part of the ball it's crawling on is rotated towards the floor? I don't think you understand how huge the Earth is. At any scale the curvature of the Earth is visible, it doesn't matter how high the resolution is; you will not be able to make out something as small as a boat.",
            "score": 3,
            "author": "maybri",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, like this [https://imgur.com/a/hElpOLY](https://imgur.com/a/hElpOLY)\n\n&amp;#x200B;\n\nI mean we have telescopes that see galaxies billions of miles away",
                    "score": 1,
                    "author": "Formal-Shallot-595",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, you're still not understanding. Resolution is not the problem. Size is the problem. If your picture was real, that plane would have to be *hundreds of miles* long. Even if we had a picture that was at a high enough resolution to show planes (which I'm not sure is possible), for the plane to actually be visible, you'd have to zoom in so far that you could no longer see the curvature of the Earth, and it'd just look like an ordinary picture of a plane, seen from far above at an angle.",
                            "score": 3,
                            "author": "maybri"
                        },
                        {
                            "level": 2,
                            "comment": "Galaxies are huge. Hundreds of thousands of light years across.",
                            "score": 2,
                            "author": "Schnutzel"
                        },
                        {
                            "level": 2,
                            "comment": "Billions of miles gets you to the outer planets.\n\nThat being said, the Andromeda Galaxy's apparent size in the night sky is SIX FULL MOONS across.  Galaxies are huge.  Even galaxies hundreds of millions to billions of light years away have apparent sizes larger than the planets in our Solar System.",
                            "score": 2,
                            "author": "The_Thunder_Child"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm trying to understand why the boat or plane would be upside down.",
            "score": 2,
            "author": "throwaway_0x90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because \"down\" is a relative direction, and we traditionally orient the Earth with North at the top of images. If you took a picture of the entire planet with North at the top and zoomed in on a person at the South Pole, that person would appear upside-down relative to the viewer.",
                    "score": 3,
                    "author": "Pegajace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely it's relative, but why is there no picture of the plane either up or down (in relevance to the photo) like this https://imgur.com/a/hElpOLY",
                            "score": -1,
                            "author": "Formal-Shallot-595",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because a plane would have to be ~630 kilometers long to appear that big in a photograph of the Earth. That's sixteen-thousand times bigger than a typical Boeing 737.\n\n*In theory* if you had a picture with high enough resolution you could zoom in to see real planes in that orientation in the Southern Hemisphere, but our cameras are simply not that good.",
                                    "score": 2,
                                    "author": "Pegajace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly that’s my question. Don’t we have high enough resolution to do this? I mean google earth can show cities and homes. Why can’t it show a boat in the ocean",
                                            "score": 0,
                                            "author": "Formal-Shallot-595",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Don’t we have high enough resolution to do this? \n\nNo, we don't.\n\n&gt; I mean google earth can show cities and homes. Why can’t it show a boat in the ocean\n\nLike I said in a different comment chain, a telescope trades off magnification for taking a picture of a smaller area. Besides, Google Earth mostly uses aerial photography for its image data, not satellite photography, since it gets better resolution for lower cost.",
                                                    "score": 3,
                                                    "author": "Pegajace"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I believe what u/Pegajace is saying is that we have the ability of magnification to zoom that far and see from that far, but if you look at the photo, you wouldn't be able to tell it apart from, for an example, if it was taken from a drone, or a helicopter. Because everything in the background would also be magnified to that same degree. The degree of what physically or visually appears in the photo is relative to the level of magnification needed to see it. The magnification needed increases as the distance of the camera increases from the subject of the photo, yet at the same time, you can only see a certain resolution at a certain level of detail.\n\nDoes that make sense? Have you ever seen this? [https://www.in2white.com/](https://www.in2white.com/)\n\nZoom in. You can see the individual *cracks* in the rockface of the mountain... but at a zoom level where a majority is out of frame and thus not visible at that level of detail.\n\nYou can't see an ant on Earth, as if you were physically close enough to personally see it at that detail, and simultaneously the entirety of Earth. I think that would involve some sort of quantum-quantum mechanics that we're nowhere near ready to even comprehend if it's even possible.\n\nThis question is fascinating. Quite a deepthink and I'm not even high.",
                                                    "score": 1,
                                                    "author": "CyanideAnarchy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because given that the earth is round, there must be a boat or plane that’s upside down compared to the perspective of the picture",
                    "score": 0,
                    "author": "Formal-Shallot-595",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Telescopes can't look THROUGH the planet.",
                            "score": 1,
                            "author": "The_Thunder_Child",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like this https://imgur.com/a/hElpOLY",
                                    "score": 1,
                                    "author": "Formal-Shallot-595"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No. Why would that be the case?",
                            "score": 0,
                            "author": "Saintdemon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like this https://imgur.com/a/hElpOLY",
                                    "score": 0,
                                    "author": "Formal-Shallot-595"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think because if it's flat and you turn the photo upside down the boat or plane will be upside down.",
                    "score": 1,
                    "author": "hastethis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Planes don't fly upside down in the Southern Hemisphere not unless it's like an airshow or something.",
            "score": 2,
            "author": "The_Thunder_Child",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like this is what I mean https://imgur.com/a/hElpOLY",
                    "score": 1,
                    "author": "Formal-Shallot-595",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why would it be upside down there?",
                            "score": 1,
                            "author": "The_Thunder_Child",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean given that the earth is round, taking off from South Africa flying towards South America it would be in that direction",
                                    "score": 1,
                                    "author": "Formal-Shallot-595",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where you put it it'd hardly be upside down from the perspective of the camera.\n\nThat being said, planes are tiny.  Forget movies where spy satellites are taking pictures of cars and reading licence plates.  They're not.  \n\nIf a plane or boat was far enough from the satellites that it would appear upside down it'd be too far for the satellite to see.",
                                            "score": 1,
                                            "author": "The_Thunder_Child"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If a boat is upside down, it's capsized and is likely sinking.",
            "score": 0,
            "author": "robdingo36"
        }
    ]
}