{
    "id": "148yldn",
    "score": 1,
    "title": "what do I do in this dog sitting situation?",
    "author": "sskmzz",
    "date": 1686717559.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148yldn",
    "media_urls": [],
    "other_urls": [],
    "postText": "back story:\n\nI have had a decent amount of experience with dogs. I spent over a year fostering dogs before I felt ready to adopt my own. To prepare myself, I dedicated a lot of time to watching training videos, reading articles, and browsing online discussions. In my college apartment complex, there's a couple from Chile who are both graduate university students and are passionate about dogs. They have several dogs back in their home country. As for me, I'm an undergraduate student, 23 years old, 5 feet tall, and weighing 95 pounds. One of my friends had a really lovely and well-trained husky, and I used to dog sit for them. The Chilean couple noticed this and approached me, asking if I could watch their recently adopted six-month-old dog for about a month while they go back to Chile. Since my own well-trained German Shepherd has been playing with their dog since she was a puppy, I agreed to help. We also have a small dog park in our apartment complex.I don't have professional training, and typically, I let my neighbors decide how much they want to pay me for dog sitting. However, this time I decided to go with the lowest rate available, which was $30 per day on Rover, as I would be watching their dog from June 11 to July 14 for a total of 33 days.\n\nproblem:\n\nHowever, I am facing a problem. It appears that this dog has received little to no training. She frequently urinates and defecates, even after extended outdoor playtime. When we are outside, she completely ignores her name, and I have to spend over 10 minutes chasing her to put her on a leash when it's time to leave the dog park. Her pulling behavior is beyond anything I have ever seen before. Although my own dog had pulling issues initially, they were never as severe as this. I am experiencing significant chafing on my hand due to her pulling. It has only been two days, but I have already had to clean up after her accidents several times, even though there are pee pads available. The situation has become so overwhelming that I have had several breakdowns, feeling pathetic for struggling with the dog, especially considering it has only been two days.\n\nlil notes:\n\nI can't help but feel responsible for not recognizing the lack of training in this dog. During our previous interactions, the dog's owner would casually mention how she would create messes, and when we walked together, he never addressed her pulling behavior and allowed her to drag him along. Additionally, he provided me with two packs of pee pads. Along with the dog's poor training, I am also required to brush her teeth daily, apply balm to her paws and nose, and use dry shampoo on her after outdoor activities. Considering the extensive responsibilities and challenges I'm facing, the compensation of $30 per day doesn't seem adequate. However, I'm unsure about dog sitting pricing and how to handle this situation. Any advice or suggestions would be greatly appreciated. Should I offer to help them find another sitter through Rover and waive payment for the two or three days, request additional compensation, or should I accept that I made a mistake due to my financial desperation and tough it out? Thank you in advance for your assistance!\n\n&amp;#x200B;",
    "comments": []
}