{
    "id": "148z7zs",
    "score": 2,
    "title": "Are the clips of Biden’s incoherent speech real? Why is he still president if he seems this unwell ?",
    "author": "Alia2121",
    "date": 1686719733.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/148z7zs",
    "media_urls": [],
    "other_urls": [],
    "postText": "Am I missing something? How can the president of the us seem so unwell",
    "comments": [
        {
            "level": 0,
            "comment": "He has a stutter - and has had it forever.\n\nAt his age, sometimes the brain to mouth connection stumbles.\n\nCombine the two and you sometimes get a garbled phrase.",
            "score": 32,
            "author": "the_spinetingler",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is not his stutter, the guy definitely has something wrong. Even when he isn't garbling his words he is noticably slow. He is not nearly as sharp as he once was, there is a huge gap between young Biden and old Biden  \n\nhttps://youtu.be/0_v00iGJCLY",
                    "score": -14,
                    "author": "Elocorem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's 80 years old. How do you think he should act?",
                            "score": 12,
                            "author": "ZombieDeathRace"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Calling it a stutter is disingenuous.",
                    "score": -9,
                    "author": "OldSarge02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden has a speech impediment. Aside from that, basically he's just a normal old guy. He's not especially unwell. Clips you see on the internet are edited to make him look bad. Even his political opponent McCarthy said he was actively involved in debt ceiling negotiations.",
            "score": 49,
            "author": "notextinctyet",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s actually very good to know. I don’t follow US politics but have seen a few clips of Biden speaking incoherently . This was confusing to me because I don’t feel like a US president would remain in office if that was the case. I also really liked Biden as VP with Obama, so it was sad to see what seemed to be a huge mental decline.",
                    "score": 12,
                    "author": "Alia2121",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a section of the 25th Amendment that allows the Cabinet the option of removing a incapacitated president, even against their will. It has never been invoked, although there was some calls for it to be used against Trump, particularly in the wake of his insurrection.\n\nThere was also apparently some concern over Regan when he was in office, that he suffered from mental decline. But it never got to the level of replacing him.\n\nIs Biden as sharp as he once was? Probably not. He's a old man in a job that ages people. Is he fit enough to be president? That's for the voters to decide. But I wouldn't trust selectively edited videos to make a decision.",
                            "score": 10,
                            "author": "One-King4767"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, he's had a bad stutter most of his life. It only becomes an issue when others want to politicize it to paint whatever narrative they are looking to spin that day.\n\nHe's old, with a stutter.",
                            "score": 11,
                            "author": "Bongressman"
                        },
                        {
                            "level": 2,
                            "comment": "Go to YouTube and watch his State of the Union address, if you are so unsure.\n\nYes, the speech is (always) pre-written, but he goes off script when he was heckled and he delivers it with understanding and compassion.\n\nSitting down and listening to his remarks after the George Floyd protests started (https://www.youtube.com/live/wHQsuzySzDI?feature=share)   was what made me certain I wanted to vote for him, to be honest.\n\nDevote 15 minutes to watching him. It's not hard.\n\nHe has a speech impediment. And he's old. But he's one of the sharpest octogenarians I've come across.",
                            "score": 6,
                            "author": "GingerMau"
                        },
                        {
                            "level": 2,
                            "comment": "trump remained in office and had several speeches that were incoherent.",
                            "score": 1,
                            "author": "dielectricjuice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Several? Several daily, more like.",
                                    "score": 1,
                                    "author": "aflockofcrows"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Biden is a bumbling fool, all you have to do is look at him speak 5-10-20 year's ago(he has been around a long time)\n\nAny apologist leading stupid things like stuttering... Just ask for an example pre 2015\n\nHe is in a severe state of demetia that is why every day is short... \n\nA better question would be why is the mainstream media covering it up (go watch some vids from Australia they seem to be the only ones covering it",
                            "score": -37,
                            "author": "Kenosha_Kid_Kicks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah yes, the mentally incompetent yet simultaneously criminal mastermind.\n\nNobody is covering anything up. Not everything is a conspiracy. You don't have to like him or his policies and that's okay.",
                                    "score": 26,
                                    "author": "GMask402"
                                },
                                {
                                    "level": 3,
                                    "comment": "ITS A COVER UP YOU GUYS",
                                    "score": 9,
                                    "author": "notthatcousingreg"
                                },
                                {
                                    "level": 3,
                                    "comment": "Jesus Christ",
                                    "score": 8,
                                    "author": "KleitosD06"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"go watch some vids from Australia\" \n\nYouTube, the great educator.\n\nIf you think this one's a fool, you should have seen the last one",
                                    "score": 8,
                                    "author": "deathdidntkillme"
                                },
                                {
                                    "level": 3,
                                    "comment": "How old are you?\n\nEdit: don't actually answer that",
                                    "score": 7,
                                    "author": "3qtpint"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wait, you're saying that \\*gasp\\* the 80-yr old man has more speech stumbles than he did when he was a younger but still old man? Oh, the revelation!",
                                    "score": 4,
                                    "author": "Sharikacat"
                                },
                                {
                                    "level": 3,
                                    "comment": "Older people age. Kind of a fact of life. Unlike trump or Feinstein or Grassley, Biden has shown no signs of dementia. Go listen to old tapes of trump if you want to see massive decline. Look at the lunatic garbage he spews on TS - total brain rot",
                                    "score": 1,
                                    "author": "Carlyz37"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Giving speeches is not the primary job of president. People made the Bushisms jokes about president Bush too. Many presidents are bad public speakers.",
            "score": 15,
            "author": "WeekShot7048",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, at least with Bush, we could understand the gibberish.",
                    "score": -1,
                    "author": "WhiteWhale111r1"
                },
                {
                    "level": 1,
                    "comment": "Well isn't the president the face of the entire US Government? I would think giving speeches/communicating are one of the most important jobs the president has.",
                    "score": -1,
                    "author": "WarSmith66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you watched his full speeches overseas? He does just fine.",
                            "score": 1,
                            "author": "Carlyz37"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You've seen heavily edited clips.\n\nHe does talk funny, but he's always been that way.\n\nHe's significantly sharper and more alert and aware than most people you likely know. \n\nAnyone on TV as often as the President is will end up having some videos where they look like an idiot. Reagan, Clinton, both Bushes, Obama, Trump. They all have gaffe reels.\n\nIf Biden was sitting at a Denny's eating pancakes with you and your buddies, he'd probably talk circles around all of you and blow you away with his wit and the range of his knowledge.",
            "score": 24,
            "author": "toldyaso",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bush with the phone upside down to his ear is a classic!",
                    "score": 9,
                    "author": "throatinmess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's another example. Libs were convinced his IQ was about 74. But if he was sitting in your local bar having a beer, he'd probably absolutely blow you and everyone else in the bar away with how witty and warm and intelligent he is. Even people who hate his politics would probably end up massively liking him.\n\nMoral of the story is, dum dums don't accidentally wake up one day and find out they're President.\n\nAnd yes I hate Trump and yes this applies to him too. I think live in person he'd be wildly funny and probably seem sharp as fuck. Sure he was a nepo baby and says dumb shit sometimes, but let's face it it's not like he's the only nepo baby in the world. Like they don't just all get a turn as President.",
                            "score": 1,
                            "author": "toldyaso"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Somehow I doing absolutely all of this.",
                    "score": 2,
                    "author": "BlatantPizza"
                },
                {
                    "level": 1,
                    "comment": "Most of it is not edited though, this stuff is live on air and it’s ridiculous to watch. Yes, he’s old so i do cut him some slack, but he hasn’t always been that way, he could speak perfectly fine even 5 years ago. I mainly feel bad for him that he’s still having to do speeches and such while he’s barely able to form sentences all the way through the speeches.",
                    "score": -11,
                    "author": "PrincipleGuilty4894",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah no that's all wrong.\n\nRe-read my original reply. That's what it is chief.",
                            "score": 5,
                            "author": "toldyaso"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "is that what fox news is covering today?",
            "score": 13,
            "author": "AreaProfessional7"
        },
        {
            "level": 0,
            "comment": "He mumbles.  Seems to have a stutter.  However, when he's on a roll he sounds fine and seems to understand how the government and processes work.\n\nCompare him to Trump.  Trump 100% of the time sounds like a bumbling fool.  Biden is getting picked on by the conservative media because they always attack the left with what they see as a problem in their own (right wing) camp.",
            "score": 12,
            "author": "The_Thunder_Child",
            "replies": [
                {
                    "level": 1,
                    "comment": "Biden overcame a stuttering problem, sometimes he still slips.",
                    "score": 5,
                    "author": "LifeIsPainfulBeauty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because he's an unoffensive centrist who doesn't do much. And maximizing overall appeal is all the Democrats need to do to beat the raving lunatics on the other side",
            "score": 2,
            "author": "ConflictAgreeable689"
        },
        {
            "level": 0,
            "comment": "Because Kamala Harris isn't any better off.",
            "score": 0,
            "author": "Fvg_redt"
        },
        {
            "level": 0,
            "comment": "I know he has a speech impediment but the combination of how many times he’s fallen (just in front of cameras, imagine on the regular) and compared to his speech 5-6 years ago. I know people really want it to just be “oh yeah it’s no big deal” but as someone who has been around old people seen how fast they can lose it, it’s just him getting old. He’s not okay and honestly I’d rather him step down and have mrs. Vip step up, even though I’m not huge fan of her.",
            "score": 1,
            "author": "Breakfastpissyeah"
        },
        {
            "level": 0,
            "comment": "He’s a puppet like Trump with plenty of dirt and they’ll do as they’re told. Biden is weekend at Bernie’s . Trump is just a good communicator with some swagger. A good decent person who would only choose what is best for the people would never make it to be President.",
            "score": -1,
            "author": "robbiesac77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol",
                    "score": 3,
                    "author": "Red-Droid-Blue-Droid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same reason Feinstein still in office. \n\nTheir parties are their handlers at this point. Easier than having to persuade, reason, or negotiate with someone who is sound of mind.",
            "score": -2,
            "author": "Additional-Ad-1002"
        },
        {
            "level": 0,
            "comment": "Here in the US we have somehow decided that our last and next election will be between ancient white men. I don’t know how we got here or why we can’t dig out. But shiz. It’s nasty over here.",
            "score": 0,
            "author": "prophecygirl785"
        },
        {
            "level": 0,
            "comment": "We've known about his issues for years now, most people just choose to ignore it for some reason.",
            "score": -2,
            "author": "poof_poof_poof"
        }
    ]
}