{
    "id": "14909w5",
    "score": 1,
    "title": "When there’s a thunderstorm over the ocean and lightning strikes the water, why doesn’t the electricity kill all the marine life?",
    "author": "SmilingMooseMedia",
    "date": 1686723468.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/14909w5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "There is TONS of energy in a lightening strike, and salt water is a GREAT conductor, but even then the energy doesn't travel very far before it dissipates.  Same reason an electric eel can only really stun something right next to it, rather than kill every single fish in the area.",
            "score": 2,
            "author": "TonyMitty"
        },
        {
            "level": 0,
            "comment": "When lightning storms occur over an ocean, and the lightning strikes the surface of the water, it creates a (usually lethal) electrical current that can travel for miles (but will also only remain on the surface). Lehal to both swimmers and marine life and can damage ships. But most animals just go lower beneath the surface to evade harm. It’s actually a problem with sharks because they seek shallower water which puts them at higher risk of being struck by lightening. \n\nBut generally direct strikes to marine life is rare (but will be lethal). If it’s a confined water area like a small pond one strike could kill everything in it.",
            "score": 1,
            "author": "systemization",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lightning striking a shark is the most badass imagery I've ever heard.",
                    "score": 1,
                    "author": "Adkit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "any animals in the general area will be killed.",
            "score": 1,
            "author": "HughJahsso"
        }
    ]
}