{
    "id": "1490h22",
    "score": 1,
    "title": "Guy (M24) wanted to be fwb with me (F22). Should I rebound though I just got out of a relationship?",
    "author": "South-Security-6664",
    "date": 1686724219.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1490h22",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (F22) just got out of a very much tiring relationship of 2 and a half years. There's this cute guy (M24) I go to university with, and has been someone I've known passing. A week ago, I  hung out with him, and he offered if I wanted to be friends with benefits with him.\n\nSo we were hanging out somewhere, (I asked if he had wanted to hang out, as the night before he called me and asked if I wanted to go on a drive with him. The following day, I asked if he wanted to hang out and he agreed. We kinda knew each other from similar friend groups.) And we got into talking about things. I tried my hardest to not bring up anything sexual, although he was a very attractive person. However, we got into talking about it as he initiated. He told me we should hang out more, and then we got into the actual fwb conversation. He said he wanted something purely physical and non-committal. \n\nI understood, and told him that at the time, I chose to say no, as still was coping with the recent breakup with my ex. He told me it hurt his ego a bit that I turned him down. Anyway, fast forward, he drove me home and told me that he was still keen on his offer. I \"thanked\" him sarcastically, and told him I'd hit him up if I ever changed my mind. \n\nThat being said, it's been a week. To be honest, I've been thinking about it a lot, and want to maybe do it. But I don't know if things have fizzled out. We haven't talked ever since. What do I do? \n\n\nTLDR: There's this cute guy (M24) I (F22) go to university with, and has been someone I've known passing. A week ago, we were hanging out, and he offered if I wanted to be friends with benefits with him. What do I do?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi /u/South-Security-6664,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Keep your boundaries in check and remember why you want to do this.  If you want just a friends with benefits, just keep it casual and try not to \"catch feelings\"\n\nIf you feel it's still too soon to go down this route, don't.  However, if you think you can handle the casual fling, proceed with caution.",
            "score": 1,
            "author": "kalwayne3573"
        },
        {
            "level": 0,
            "comment": "The fact that he was more worried about his ego vs your current state of mind is barf. And then asked/reminded you again. \n\nThat being said, he obviously is a purely physical tool at your disposal. He’s not interested in personal emotions/ intimate interactions. Lol.\n\nBe the queen you want to be 👑",
            "score": 1,
            "author": "jalzyr"
        }
    ]
}