{
    "id": "149143q",
    "score": 0,
    "title": "How can I become religious?",
    "author": "Consistent_Two2067",
    "date": 1686726545.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/149143q",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I'm convinced that all science points to a universe with no creator?\n\nI'm not joking and this isn't a slight. I don't want to get into it, I just want hope.",
    "comments": [
        {
            "level": 0,
            "comment": "Buddhism or another religion without a creator",
            "score": 1,
            "author": "wt_anonymous",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, I guess that takes the pressure off finding something to blame for your problems.",
                    "score": 1,
                    "author": "vincent44772jo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not here to judge anyone's choice to be religious or not. I'm personally not. If someone finds meaning or comfort in it and doesn't impose it on others then more power to them.",
                            "score": 1,
                            "author": "wt_anonymous"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a doctor of math. You don’t know enough science to claim there is no creator. The modern physics tell us that the 4 dimensional space that we can observe wraps around itself like a Klein bottle. To be able to bend, our universe lives in a hyperspace of 11 dimensions. Our universe is just a bubble inside a vast multiverse of infinite dimensions. You should read more math. Read about Conways surreal numbers. There are infinite number of infinites. The universe is so vast that it cannot fit in your finite human monkey head. Read about Islam read the Quran and it will bring you peace. Christianity is childish, Islam is abstract.",
            "score": -1,
            "author": "dr_always_right_phd"
        },
        {
            "level": 0,
            "comment": "It sounds like you're looking for something to find comfort in without a god. I suggest looking up Kurzgesagt's video on positive nihilism on YouTube.",
            "score": 1,
            "author": "warkel"
        },
        {
            "level": 0,
            "comment": "This is going to sound weird, but find a church that markets itself as gay-friendly. It's the simplest way I know to get spiritually and religion without the crazy legalism and doctrinal issues that's so off-putting to us non-believers. If you're not gay, don't worry: the only gay-friendly churches that are probably going to have an all-gay congregation are the Metropolitan Community Church, a denomination that was originally founded for LGBT Christians to have a place to worship.\n\nAny other church that welcomes LGBT people is probably mostly made up of tolerant straight people.",
            "score": 1,
            "author": "KurtWagnerX"
        },
        {
            "level": 0,
            "comment": "If you don’t find a religion you can believe, consider looking into determinism. It can be quite comforting to some.",
            "score": 0,
            "author": "tahaheh"
        }
    ]
}