{
    "id": "ga4qtf",
    "score": 31738,
    "title": "Does anyone else get anxiety when other people aren’t following the rules? Grocery shopping today and several people aren’t abiding by the ‘one way’ aisles/taking masks off. I feel like I’m in kindergarten again and don’t know if I should tell on them or confront them first?!",
    "author": "akacanda",
    "date": 1588144062.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ga4qtf",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3354,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They do the same here in Panama, but it has had zero effect...the numbers are climbing steadily.  Speaking generally, this is because no one here respects authority and does whatever they want when the cops aren't around.",
                    "score": 725,
                    "author": "M3tus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I knew a guy who left Saudi Arabia for Canada. He said the biggest culture shock was people followed the law when the cops weren’t around. He was delighted that things were so orderly and clean because of it. Watching idiots in this pandemic though has convinced me that social contract is written on a very thin piece of paper.",
                            "score": 794,
                            "author": "fudge_friend",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Toilet paper",
                                    "score": 317,
                                    "author": "Smoofinator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 71,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It feels weird on my lips, but I have found it works fine",
                                                    "score": 37,
                                                    "author": "tael89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think they suck if you're a slow sipper. If they are in liquid too long, they fall apart.",
                                                            "score": 35,
                                                            "author": "PillowTalk420",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I wonder if the specific liquid has an effect because I drank a milkshake over a couple hours period and it was fully usable",
                                                                    "score": 13,
                                                                    "author": "tael89",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Downvoted for drinking a milkshake that slow. What a waste.",
                                                                            "score": 20,
                                                                            "author": "Caloran",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Single ply toilet paper.",
                                            "score": 20,
                                            "author": "SaulGoodman121",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm willing to bet, though, that the percentage of Canadians following the recommended protocols in public is STILL considerably higher than here in the hyper-individualistic Deep South. Look at all the fundie churches still holding services.",
                                    "score": 100,
                                    "author": "emkay99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd guess that less than 50% of people I've seen in rural Virginia are wearing masks at the grocery store or post office. Feels like I'm getting less looks from old people versus in March. I guess young people are invincible, but I don't get why elderly people aren't taking things more seriously",
                                            "score": 31,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Due to the conflicting information from the administration and right-wing pundits many do not take it seriously.\n\nThe messaging from Trump has been all over the place and his pundits have followed suit.",
                                                    "score": 31,
                                                    "author": "DarkHater",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He loves chaos. Keeps him front and center. People will die. He doesn’t care. VP Pence even goes to the Mayo Clinic and doesn’t wear a mask, though asked to do so. Pure evil.",
                                                            "score": 4,
                                                            "author": "DntfrgtTheMotorCity",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm in the East Central Alabama/West Central Georgia area, and these people suck here. 40% of them are taking absolutely no precautions.",
                                            "score": 64,
                                            "author": "tzenrick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Darwin willing some good will finally come of their \"fuck you got mine\" attitude when \"mine\" is a potentially fatal infection.  I'm not wishing death on anyone, mind you, just a nice corrective near death experience. Like a jerk on the karmic choke collar.  Reboot these people's consciences.",
                                                    "score": 56,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 33,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's a risk they chose to take. It's a result everybody else has to live with.\n\nI didn't get to celebrate my mom's 60th birthday with her in person because we weren't going to risk it. Neither my father or I can go see my little sister during a time that's incredibly hard for her.\n\nI don't give a fuck about people who don't give a fuck about others.",
                                                                    "score": 20,
                                                                    "author": "IncrediblePlatypus",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It appears to be working for Boris Johnson.",
                                                            "score": 4,
                                                            "author": "DntfrgtTheMotorCity"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some cultures are much better at managing public health emergencies than others. Not all cultures are equal.",
                            "score": 209,
                            "author": "Capable_Examination",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You got downvoted (initially, upvoted now) but you don’t see the Japanese or Koreans protesting like the fucking American right is.",
                                    "score": 189,
                                    "author": "Sombrere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah we're following the rules.",
                                            "score": 58,
                                            "author": "Shimoda8181",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks. I hope you're staying safe and healthy",
                                                            "score": 11,
                                                            "author": "Shimoda8181"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"I'd rather die on my feet than live on my knees, you boot lickers!\"\n\n-- Far too many Americans who think their freedom is more important than public health.  Also, they don't *actually* think they'll die from it, it's just a flu that the lamestream media is blowing out of proportion.  Because they're dumb.",
                                                    "score": 9,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately here in Korea people still spit in public and cough/sneeze without covering their mouths and nose. It's such a hard habit for people to break here, although now it's being ingrained in the younger generations at school, thankfully.",
                                            "score": 15,
                                            "author": "alasnedrag",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Works the same way here in Germany. Has been feeling like we just copied every single thing you guys did but were lucky enough to be at an earlier state of the virus than you. That's to me one of the main reasons we have so little deaths, we can just look at other countries and see if their measurements work or not and implement them, before we actually need to do anything quickly. Schools have widely been reopened though, with little to no safety ensured so I'm positive we'll have a huge rise in cases very soon.",
                    "score": 55,
                    "author": "lionheadshot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We still got a fair share of idiots here as well tho.\n\nI work as a cashier in retail, and I can't count the amount of people that can't manage to keep distance to other people, or trying to leave through the \"entrance only\" one way lane we had set up in our store, just flat out ignoring one of my coworkers telling them that they can't do that.",
                            "score": 37,
                            "author": "DerWaechter_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I've seen several people screaming at cashiers because they told them to keep on their masks up until they actually leave the building and not just up until they feel like they're done buying stuff, every place has their idiots.",
                                    "score": 35,
                                    "author": "lionheadshot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They don't maintain distance in schools?\n\nIn the NL we are going to open kindergarten / elementary level soon, but with alternate days and with 1,5m for each kid.\n\nAccording to tests in NL kids hardly pass COVID on to others, so Adults &gt; Kids, but almost never vice-versa.\n\nWe'll soon see if it works...",
                            "score": 15,
                            "author": "ClassicBooks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude, they say they're gonna maintain 1.5m, sure, they do that here too, unless you have some kind of super wide and open schools that's not gonna work in the slightest, on top of that German schools are the exact opposite of that, they're either a hundred years old buildings or very cheaply put together stuff that's meant to stand for a decade at most, so here especially this regulation is a joke.",
                                    "score": 31,
                                    "author": "lionheadshot",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; According to tests in NL kids hardly pass COVID on to others\n\nHow does this make ANY sense? Kids are disgusting.",
                                    "score": 8,
                                    "author": "Zaranthan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I read that they may pass it more but that was over a month ago, so your info may be correct.",
                                    "score": 5,
                                    "author": "9for9"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Here in America, we've all forgotten the first four months this year and acting like it's new years...",
                    "score": 441,
                    "author": "ThorOfKenya2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe where you are, but not here where I am.",
                            "score": 145,
                            "author": "deb-scott",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same. Where I am, everyone in grocery stores are all wearing masks and maintaining distance.\n\nAmerica is a gigantic place. Parts of it are going to deal with this better than others.",
                                    "score": 214,
                                    "author": "TrumpImpeachedAugust",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I live just outside of NYC and work in Manhattan. Most people are complying with guidelines aside from the one way aisles...Walmart is still chaos",
                                            "score": 70,
                                            "author": "CreamyGoodnss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's because NYC is getting hit hard. \n\nMy state flattened the curve early on, so we didn't see the consequences of what could have been. People are getting careless. \n\nThe reason I stay in the house and barely go out is because of what I see going on in NYC.",
                                                    "score": 87,
                                                    "author": "DoctorWhoToYou",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;My state flattened the curve early on, so we didn't see the consequences of what could have been. People are getting careless. \n\nMy state, too. We had a very early, very aggressive response, and it's working. But people are taking the low numbers to mean that the lockdown is ridiculous and there's no need for it, instead of seeing that the low numbers are the whole point of doing it in the first place.\n\nNow between carelessness, Easter celebrations, and a few cities reopening against the governor's lockdown order, and we're seeing spikes in cases and deaths, and possible new hotspots are emerging. It used to be fairly contained to some metros, but now rural areas are seeing rises fairly steadily. \n\nNot to mention nobody around me seems to understand how gloves and masks work. Masks are constantly dangling around chins under noses, and if I had a dime for everytime somebody touched their face or phone with their dirty ass gloves, I wouldn't need UI anymore.",
                                                            "score": 65,
                                                            "author": "Rommie557",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; Not to mention nobody around me seems to understand how gloves and masks work. \n\nYep. This is extremely irritating. I'll hear my dad say something like \"Oh, you can open (insert public place), just have people wear gloves!\"\n\nGloves are not impervious to having viruses on them.  Nobody understands the concept of cross-contamination.",
                                                                    "score": 13,
                                                                    "author": "IdiotTurkey"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is what winds me up, when people say “we only have x cases, this lockdown is taking it a bit too far”. How can’t people see that the low numbers are a result of the strict lockdown measures?",
                                                                    "score": 26,
                                                                    "author": "hombredeoso92",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I guess a consolation is that they believe the virus exists. Sadly there are people that think it doesn't.",
                                                                            "score": 15,
                                                                            "author": "IdiotTurkey",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm in south Louisiana, which has also been hit pretty hard. NOLA has taken the whole thing seriously, but in the Republican-dominated areas, it's very obvious that nobody really give a damn. And they also have the highest number of both new cases and deaths -- naturally.",
                                                            "score": 26,
                                                            "author": "emkay99",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Most people are complying with guidelines aside from the one way aisles...Walmart is still chaos\n\nI feel like this is a good allegory for the state of the US as a whole.",
                                                    "score": 28,
                                                    "author": "theoriginaled"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Same here, I’m on LI. People are real good about taking this seriously. And Walmarts are just hellholes where nothing matters so they’re an outlier",
                                                    "score": 12,
                                                    "author": "FN-2814",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, not feeling so hopeful for my friends that live in the south.  Sadly most of them work in healthcare.",
                                            "score": 31,
                                            "author": "BarryMacochner",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Floridians here haven't been taking this seriously at all.  I tried to go to Wal-Mart the other day,  because I needed some stuff I couldn't find of the pickup/ delivery selections.  It was such a mistake! Maybe 1 in 5 people were wearing a mask.  The carts aren't being disinfected between customers. Very few people were following the arrows on the floor.  I gently pointed that out to several people. Very few people were making any effort to distance themselves from others.  One lady coughed several times WITHOUT EVEN COVERING HER MOUTH.  I was appalled,  grabbed the couple of things I really needed,  and got the hell out of there. I will never be going into Wal-Mart again.  Publix is making much more of an effort,  so I'll pay more to shop there from now on.",
                                                    "score": 92,
                                                    "author": "Gingersnaps_68",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It seems like from all the stories I read and hear Walmart is the worst place to go right now.",
                                                            "score": 39,
                                                            "author": "BJntheRV",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So basically, nothing has changed.",
                                                                    "score": 77,
                                                                    "author": "wafflesareforever",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yup",
                                                                            "score": 19,
                                                                            "author": "BJntheRV"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well before, when you went to wal-mart, you'd need some eyebleach to wash away the horrors of what you've seen.\n\nNow, when you go to wal-mart, you'll need some real bleach to drink so you can wash away the coronavirus from your body (it's my understanding that that's how that works. If it's not, then I was just asking if that's how it works, and also being sarcastic)",
                                                                            "score": 6,
                                                                            "author": "sonofaresiii"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol funny enough, in my southern city most people were obeying the lane rules and wearing masks but I live in the only blue city in a very red state so take for what you will",
                                                                    "score": 5,
                                                                    "author": "NocNocNoc19",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It is the extremely prevalent America attitude of \"I've got mine, fuck you!\". \n\nIn this case, it's \"I'm not sick, so fuck you! No one's telling ME what to do! I know best!\".\n\nIt doesn't help that our \"Pandemic Czar\" Mike Pence doesn't wear a mask , ever.  \n\nSo, if you're not actively sick, why should you let 'duh guv'ment' dictate your movement? \\*rolls eyes\\*\n\nWhen the top officials basically say 'fuck this shit!', why would us ordinary, everyday people adhere to suggestions?",
                                                            "score": 50,
                                                            "author": "Lappy313",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great points. I'm a truck driver on the West Coast. The East Coast drivers are required to wear masks and gloves in the shipper/receiver at more locations than we are.\n\nPretty much nowhere is requiring it, that I've been to, but distancing measures are set.\n\nI was the first that I saw to wear gloves and mask into anywhere. I now bring a small spary bottle of isopropyl and my own pen, as gloves are running low. I keep a hand washing station on my passenger side of the truck. Had a 5 gallon, spigoted camping container before all this and it has come in handy.\n\nOver the last 6 weeks, I've seen a huge roller coaster of attitudes and practices. As of two weeks ago, more drivers, than not, were taking things more seriously, but there were always those old codgers that's didn't care and acted like everyone was losing their minds. This week, I've noticed a huge shift. It's like everyone thinks it's over. I'm very disheartened, but am not changing any practice of cleaning my truck with diluted bleach, N99 mask wearing (had some left over from constant smoke due to fires near where we live) and incessant hand washing and sterilizing. \n\nI feel like this recent attitude will be the new norm. All the talk of opening up Southern states has people on the West coast thinking it's full steam ahead? Oh, also, traffic is about back to where it was, almost.",
                                                                    "score": 28,
                                                                    "author": "cicadawing",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; This week, I've noticed a huge shift. It's like everyone thinks it's over.\n\nI'm seeing that here in Louisiana, too. And by \"over,\" everyone apparently means, \"Return to EXACTLY the way you did everything in 2018.\" I've mentioned to several people the strong likelihood of a \"second wave\" as a result. They laugh. \"Won't happen here!\"\n\nWhich is why I'm planning to stay indoors until maybe Labor Day. I'm old and retired, so I don't really *have* to go out much. I expect to outlive many of the scoffers.",
                                                                            "score": 33,
                                                                            "author": "emkay99",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You will. Thanks for taking it seriously.",
                                                                                    "score": 17,
                                                                                    "author": "cicadawing"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;I've mentioned to several people the strong likelihood of a \"second wave\" as a result. They laugh. \"Won't happen here!\"\n\nTo quote Scully: \"On what scientific principle do they base *that?*\"\n\nIgnorance is killing us.",
                                                                                    "score": 12,
                                                                                    "author": "enfanta",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Even then, I’m in Jax and going to Publix was almost the same thing. I was scared for my life and walked in just to grab two things and walked right out again. I almost got ran over twice.",
                                                            "score": 4,
                                                            "author": "RandomBetrayal1"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "North Carolinian here- no masks anywhere. Most people are not socially distancing and are driving to SC to shop or go to the beach. Apparently we already peaked and virus passed, and a NYC type situation won't happen here because we have cars. SMDH.",
                                                    "score": 12,
                                                    "author": "Coffee4meplz",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It is nothing short of fucking frightening here in GA. I am in a relatively rural area and there is one store to go to unless I want to drive 45 mins to Wal-Mart and no one gives a single fuck.\n\nEven driving into Atlanta proper, the number of pet out and about taking no precautions is staggering.",
                                                    "score": 21,
                                                    "author": "CausalSin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Didn’t GA unlock the other day to?",
                                                            "score": 3,
                                                            "author": "BarryMacochner",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That must be nice. Here in South Texas, people are still thinking this whole thing is a hoax. Beaches are filled and everyone is looking forward to reopening next week. \n\nI hate how dumb people are here.",
                                    "score": 44,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Corpus Christi here and military families are starting with their \"I fought for my right to go down the aisle which ever direction I want!!!\" on FB.... I'm staying home for an extra month....",
                                            "score": 33,
                                            "author": "OfPinterestandBooze",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wish I could too, but apparently ALL City employees are essential, even for non essential services.",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Same here, not with the city but non-profit that works with families and kids who are going through CPS cases. And boy are we busy rn...",
                                                            "score": 7,
                                                            "author": "OfPinterestandBooze"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You in the south too?",
                            "score": 11,
                            "author": "tirwander",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aye. Seems like the \"open with restrictions\" is code for masks off and lick a public door knob.",
                                    "score": 13,
                                    "author": "ThorOfKenya2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This.is.Florida....",
                            "score": 9,
                            "author": "TheSholvaJaffa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kicks another retiree into \"God's Waiting Room\".",
                                    "score": 13,
                                    "author": "ThorOfKenya2"
                                },
                                {
                                    "level": 3,
                                    "comment": "If you never leave the blue counties, Florida seems much more sane.",
                                    "score": 3,
                                    "author": "Neuchacho",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Idk about where you live but here all this stuff is lifting and it’s only a group of ten thing now",
                            "score": 7,
                            "author": "robowalruss55",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "American here, went to Walmart yesterday out of sheer desperation.  I wore a fabric mask, did my darndest to follow the guidelines.\n\nAbout 1/3 of the people I saw weren't wearing masks. Of the 2/3 remaining wearing masks, at least another 1/3 *were wearing them under their noses.*  \n\nWhat is the point?\n\n Walmart has started requiring their employees to wear masks while on shift, and most of the employees had them under their nose.  \n\nI get it.  Being masked sucks, especially for 8 hours.  But you know people, Death is riding on the wind.  Get your masks over your fucking nose!!!\n\n-frustrated in a red state",
                    "score": 142,
                    "author": "3Gloins_in_afountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have to wear a mask for 8hrs for work (healthcare but not frontlines) as well and at the store and everywhere because its what is best. When i take it off do i feel like i just smeared chapstick all over my entire face, yep. Is my face full of acne and my glasses constantly fogged because of it? Yep. It sucks but we gotta do it.",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same... (working in a nursery home) \nMy husband and I rode on the bus this morning and I had to remind him at least two times to please wear his mask correctly. He complained he couldn't read or see with the mask because his glasses got foggy. He had to wear it for about 45 minutes till he got to work and could take it off. I wear the damn thing the whole day. Stop complaining and just. do. it. -.-",
                                    "score": 29,
                                    "author": "snowberry92",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh god, I'm breaking out too (grocery worker). My chin skin is just super confused. At least the mask covers the zits........",
                                    "score": 14,
                                    "author": "Rdhearts",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m in Washington, pretty blue.   I see the same shit when I go to Walmart.\n\nStopped at a local store the other day and while trying to find a parking space saw 3 couples that clearly knew each other. Stand in 1 parking space.   \n\n2 couples were going in from out side and saw each other, met up in the middle in empty spot, then another came out of the store.",
                            "score": 24,
                            "author": "BarryMacochner"
                        },
                        {
                            "level": 2,
                            "comment": "It’s mandatory to wear a mask in my state. I work in the operating so I wear a mask all day anyway for my job.",
                            "score": 5,
                            "author": "yavanna12"
                        },
                        {
                            "level": 2,
                            "comment": "What's the point of wearing a mask when you're going to Walmart to buy ingredients for a Lysol cocktail?",
                            "score": 14,
                            "author": "EtOHMartini",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A fellow italian, I think we're handling it much better than the states because of some morons like the ones op is referring to that are basically rendering useless any effort they make",
                    "score": 32,
                    "author": "Marcus-021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; A fellow italian, I think we're handling it much better than the states because of some morons like the ones op is referring to that are basically rendering useless any effort they make\n\nAs long as the OP is wearing a mask and has hand sanitizer, at least OP probably won't get sick.  Here in Italy, I'm curious why so many people can't figure out the mask goes *above* your nose, not below it.",
                            "score": 19,
                            "author": "isabelladangelo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Strange, I haven't witnessed anybody wearing it like that",
                                    "score": 7,
                                    "author": "Marcus-021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Daily basis I see it that way. Like people don't think the virus can go up your nostrils or something.",
                                            "score": 13,
                                            "author": "Someday_Z",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[This was taken in Padua](https://statics.cedscdn.it/photogallery_img/HIGH/02/90/5140290_padova-mercato-8.jpg).  It's sadly common here in Veneto.",
                                            "score": 8,
                                            "author": "isabelladangelo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A huge reason for the cloth masks is to protect others, so it does increase op's risk.",
                                    "score": 8,
                                    "author": "ChickenNuggetSmth",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh nice",
                                    "score": 4,
                                    "author": "Marcus-021"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "American here, you guys are handling it how the us will be in like another 6 months.  We have states lifting lockdown while seeing the largest number of reported cases in a single day.  Tennessee iirc.\n\n\nThis gonna work out well.",
                            "score": 15,
                            "author": "BarryMacochner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I sincerely feel sorry for all the people who have to endure both the stupid decisions of incompetent politicians and moron protesters",
                                    "score": 19,
                                    "author": "Marcus-021",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; At the two stores I can go to here in northern Italy they don't do that.\n\nDove?  En Veneto?",
                    "score": 3,
                    "author": "isabelladangelo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just like in kindergarten, it's probably best to keep to yourself and let other people do the same unless the harm they are doing to society is significant.\n\nWhere exactly counts as significant depends. I'd say that the one-way aisles are 'small beans' but at least with masks you can just ask them.",
            "score": 2039,
            "author": "TheJeeronian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk. I certainly want to do this, but when I think about my dad, someone in an at risk population, and who is a grocery store manager, it really pisses me off.\n\nHe told me last week a woman came in coughing all over the place and when they asked her to put on a mask, she said that she had tested positive for COVID-19, but \"had finished her quarantine.\" (still symptomatic of course) \n\nAnother guy removed his mask so he could sneeze indiscriminately all over everything.\n\nThose protections are the bare minimum people can do to protect their fellow humans, to protect the one employee group that still encounters the public on a daily basis. And they're so simple a set of requirements to follow. So I kind of don't feel bad calling them out for it, or informing authorities.",
                    "score": 77,
                    "author": "madbadanddangerous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The missing ingredient is enforcement.\n\nI know the liberty-or-death “don’t tread on me” crowd will have a fit here, but there needs to be *way* more enforcement of new rules, both by authorities and by private businesses.\n\nI go to the store and there are sign saying saying “must wear mask” etc., and maybe half the patrons are complying. And no one does anything about it, because *it’s a store*, and they want to make money. I get that, but I also made a comment to the front manager about it, and explained I would take my business elsewhere if it didn’t improve.\n\nI am really not a person who ever complains like that, but I think a pandemic calls for an exception. Call it “Karening for the greater good.”",
                            "score": 48,
                            "author": "ApollosCrow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My man, we’re on the same wavelength. You just stole all my thoughts and put ‘em on paper.",
                                    "score": 9,
                                    "author": "_kahluakoala_"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The aisle arrows are literally pointless, though. You still have to go around people as they stand there with their thumb up their ass trying to decide which brand of chicken soup to buy and it isn’t causing the aisles to have less people in them. Meanwhile, it makes me have to spend the extra time there going all the way around. \n\nIt’s safety theater and I’m not doing it. I’m not spending double the time in the grocery store sharing air with all you infected assholes just to placate a bunch of rule-sticklers.",
                    "score": 1163,
                    "author": "PotentNerdRage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a worker I have to say thank you for this perspective. These days I don't even know which things to be annoyed at, which things to enforce, and which I can ignore. You have a very fair point, and I think that as long as you are attempting to social distance that's really all that matters.\n\nedit: I privately thanked the gold giver and honestly it's such a pleasant surprise I will thank them again here, too. Also thanks to those being patient with us retail workers; we are all figuring this out as we go.",
                            "score": 431,
                            "author": "Soul_Sparkle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What if you’re going down the aisle and forget to grab something, would you really expect people to walk all the way around, or just simply turn around",
                                    "score": 91,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I actually overheard an argument about this exact thing on the next aisle over at the store a few weeks ago. One lady told another she was going the wrong way, that lady said she passed something she needed, first lady said \"well you should walk all the way around\". Then I heard a little commotion and a cart moving... i guess she pushed the first lady's cart down the aisle. And then I hear the lady walking the wrong way say  \"oh look, now you have to walk the wrong way to retrieve your cart! Are you going to walk all the way around?\" \n\nPeople are fucking insane.",
                                            "score": 198,
                                            "author": "marko23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, this whole thing has shown me just how many of us never matured past 5.",
                                                    "score": 64,
                                                    "author": "boonjo01",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Which lady's side are you on tho",
                                                            "score": 59,
                                                            "author": "whipstickagopop",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah, the classic trolley problem. I'd pull the lever and kill the first old woman.",
                                                                    "score": 15,
                                                                    "author": "RibbonTower"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Asking the real questions",
                                                                    "score": 22,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That's hilarious. She's right though. Walking all the way around is fucking retarded.",
                                                    "score": 41,
                                                    "author": "Shadowbacker",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A lady called me a bitch the other day because I walked four feet back down the aisle against the arrow to get something I missed, lol",
                                            "score": 8,
                                            "author": "cbhr",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also.... stores are literally designed to make you wander around and not find what you need efficiently. That’s freakin infuriating on a good day, but with coronavirus it’s become outright dangerous.",
                                    "score": 250,
                                    "author": "europahasicenotmice",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pick a grocery store, stick to it and learn the layout. I have my shopping timed these days and know the layout down pat for my regular and shop from back to front and don’t double back to get to the checkout. The occasional supermarket I do walk into it’s a maze however.",
                                            "score": 136,
                                            "author": "sparkles_cowboy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All my local grocery stores change the layout every couple months.",
                                                    "score": 69,
                                                    "author": "Dispari_Scuro",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 37,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Kroger seems to be doing it every couple of weeks, or at least they were before corona. I’d have the same basic list every week and every damn week I’d have to spend time looking for 2 or 3 things that had been moved since the last time I was there.\n\n\nThe Walmart in my town redid their floor in stages recently. That was a damn nightmare- they had to empty out a section, squeeze all of the other shelves tighter together to fit all the stock on it, and put in the new floor for that section. Took more than a month. You could barely fit one cart down the aisles, let alone try to turn.",
                                                            "score": 10,
                                                            "author": "europahasicenotmice",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's bizarre, I wonder what their reasoning for that is. Sounds like it would just be confusing for everyone. If that happened where I live, all the old people would probably start a riot. Only the seasonal stuff changes here.",
                                                            "score": 6,
                                                            "author": "your_moms_a_clone",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If your grocery store has everything you need at great quality for reasonable prices and volume, consider yourself lucky. Maze or not, if your store is like anything in my area, though, you're going to more than one place. \n\nGo to one grocery store and either buy: questionable/ soon-to-expire perishables along with your canned goods, supremely overpriced canned goods to get perishables that aren't rotten and will last a normal time expectancy, or amounts of food you won't consume before it goes bad, with limited selection.\n\nPick one, or risk all three for products that are reasonably-priced, good+ quality, and workable amount. And that's still assuming that whatever store you pick isn't sold out of what you need/want.",
                                                    "score": 15,
                                                    "author": "foodie42",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Why are the eggs next to the olives?! \n\n-Me, visiting a store in a different town\n\nThat wasn't even the weirdest product placement 😭 I think they arranged stuff by shape insted of anything reasonable",
                                                    "score": 6,
                                                    "author": "domesticatedfire",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The way that the average person uses masks and gloves, it pretty much all is a safety theatre too.",
                            "score": 114,
                            "author": "bantha_poodoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The gloves on the ground everywhere outside stores/banks are really pissing me off. You seriously can't throw them away properly????",
                                    "score": 30,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m trying to understand the type of person who is thoughtful enough to wear a mask and gloves, but careless enough to throw used PPE on the ground",
                                            "score": 38,
                                            "author": "bantha_poodoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They're the same people who bag up their dog's shit and then leave the bag tied to a fence or laying on the ground beside a garbage can.",
                                                    "score": 28,
                                                    "author": "Supper_Champion"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A buddy of mine was once out picking up trash to clean up the neighborhood. Somebody was walking down the road drinking a soda. The stranger stopped, asked what he was doing, said \"wow, that's a great idea,\" *threw the empty soda can over his shoulder*, and bent down to start picking up litter.\n\nPeople literally do not think about their actions.",
                                                    "score": 12,
                                                    "author": "Zaranthan"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The type of people who are wearing gloves because they’ll do literally *anything* to avoid washing their hands.",
                                                    "score": 10,
                                                    "author": "bernardcat",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Like at the drive thru they wear gloves when they take your payment, but keep the same gloves on the whole shift. Pointless.",
                                    "score": 94,
                                    "author": "itsnick21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The gloves are to protect the worker, not the customer.",
                                            "score": 78,
                                            "author": "europahasicenotmice",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But gloves don't protect anyone from anything. At all.  They're an alternate to hand washing, that's it. Every time you replace gloves, it's like you've washed your hands.",
                                                    "score": 43,
                                                    "author": "Moonbase-gamma",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They also work as a \"don't touch your face fuck tard\" reminder. It's the only reason I wear them when I leave the house since I'm a face toucher.",
                                                            "score": 54,
                                                            "author": "imVERYhighrightnow",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The key is the mask is for others, not you.\n\nIf they had no mask the fidgety types are still going to touch their face but ALSO breathe all over stuff.\n\nIt’s still better to have a mask even if they fidget with it and touch stuff, because its going to cause fewer droplets to be scattered around as many are caught in the mask.",
                                    "score": 28,
                                    "author": "rqebmm",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This! I have been getting so annoyed at how many people pull the masks down past their nose to only cover their mouth or even pull the whole mask away from their face to talk. Sometimes it's the people working at the grocery store. WTF?\n\nWe're adults. Do some of us still not understand the point of medical masks?",
                                    "score": 18,
                                    "author": "PersistENT317",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's so frustrating walking into a store and being directed to a massive cluster of people sifting through fruits and vegetables. Meanwhile the dairy section has one person and the frozen aisle is actually empty, but nope they would rather I stand in the wake of a heavily breathing mob for the next hour twiddling my fingers until I reach what I want.",
                            "score": 13,
                            "author": "Shellstruck"
                        },
                        {
                            "level": 2,
                            "comment": "Not to mention that with one way aisles you still have that asshole who needs something at the front of the aisle and blocks the damn entrance with their cart!",
                            "score": 9,
                            "author": "TheRedMaiden"
                        },
                        {
                            "level": 2,
                            "comment": "Only one store near me has one way aisles and it's colossally stupid. It forces you to spend twice as much time in the store zigzagging all over the damn place just to get what you need. This forces me to pass more people.\n\nAnd to top it all off, the long socially distant checkout lines flow backwards from the direction of the aisles. It's such a mess I won't go back to that store until that one way nonsense is removed. \n\nOh, and that store has these super weird eye in the sky surveillance trailers in the parking lot, and I have no idea what that's about either. Supper creepy.",
                            "score": 27,
                            "author": "OutlyingPlasma",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit thank you. I caught flak at my grocery store for ignoring it and I was like, what do you want me to go up the soup aisle, pass 3 people then come back down just to grab the cereal I want? Those aisle directions are dumb as fuck.\n\nI was doing great avoiding people until I tried to obey the arrows.",
                            "score": 12,
                            "author": "who_is_john_alt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are tthese things mandatory? In England they're enforced by some shops but only to a slight degree, I don't believe masks are required anywhere beyond essential workers at the moment",
                    "score": 11,
                    "author": "NoaROX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The US government has utterly failed, so it has largely been to the discretion of the individual states. My state, Pennsylvania, the governor has required all able citizens to wear a mask when entering a building or at any other time that you will be near others. Of the places that are open, grocery stores mostly, I have seen security personnel stationed outside to ensure masks are being worn.",
                            "score": 23,
                            "author": "TheBanjoNerd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who provides the masks? Are they given out at the entrance of the shop or are you expected to bring your own?",
                                    "score": 3,
                                    "author": "Kathwino",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, if you confront them, depending on where you live, the risk of getting into a heated argument is high. This could lead to higher risk of infection so best to keep to yourself and let some other idiot confron the idiots. In short, don't be an idiot. :)",
            "score": 429,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 172,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought we weren't supposed to wear masks and to save them for medical workers?\n\nHonestly, I feel stupid asking, but I can see a lot of people just as confused. Perhaps assume stupid (of cheap) over malicious.",
                            "score": 61,
                            "author": "Rally8889",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Initially yeah, we were told to not have masks unless you worked in healthcare to prevent massive shortages, but guidelines posted by the [CDC](https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/diy-cloth-face-coverings.html) (and the president, and media) changed. The switch in dialogue is definitely confusing, so don't feel stupid.\n\nEveryone is encouraged to wear a mask if you're out in public. Lots of people have been making their own, but even a bandana over the mouth and nose helps reduce spread.",
                                    "score": 103,
                                    "author": "gananngan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You (everyone) should wear a cloth mask or face covering. Leave surgical type masks and n95 for medical peeps.",
                                    "score": 49,
                                    "author": "BananaPalmer",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was one of those people until I realized they had marked the floor with arrows.  No need to be confrontational.  We are all just trying to get by and are uncomfortable too.",
            "score": 294,
            "author": "jimboism1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too! I filled my cart with groceries before I realized that the stickers were on the floor. I don’t typically scan the floor, but I did after I realized!",
                    "score": 102,
                    "author": "whattheshitwastaken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. I felt like a dumbass when I realized.",
                            "score": 41,
                            "author": "snot_boogie1122",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t notice the ones at the store I work at for 3 days",
                                    "score": 41,
                                    "author": "JamesdL03",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We don't have one-way aisles here, but it took me forever to notice the stickers signalling where to stand in line in front of the cash register. It only dawned on me when I was pushing my shopping basket across the floor with my foot and it got stuck on one of the stickers, oops.",
                            "score": 13,
                            "author": "Screaming_Possum_Ian"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, there are a lot of new rules and most people are just doing their best.  The best way to respond is with kindness and ask that they give you your space.",
                    "score": 35,
                    "author": "kciuq1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fixating on other people doing the wrong thing will lead you to be ever more stressed out. \n\nYou’ll start seeing more and more instances that NEED policing! Why is no one doing anything? Why is there never a cop (appropriate authority figure) when you need them. \nIf you then decide to turn into “People Police” since no one else is doing it, you will be more stressed, more likely to get into arguments, more likely to get in a physical confrontation and more likely to road rage. \n\nNone of it is worth it. As a European living in the US I can completely understand your view point but I have been here long enough to understand the cultural differences too. As well as appreciate a lot of those differences :). \nEvery place has A-Holes and unless they trample on you directly it is a far better idea to keep as much separation as possible.",
            "score": 24,
            "author": "Mani0484"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 363,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Being a person with anxiety disorders, you're absolutely correct. It's better to ignore the people and just do your thing. Some of the people may be out for the first time and have no idea to look at the stickers on the floor. Stickers on the floor aren't new to grocery stores, so it's not like it's that obvious to people. Especially since they're not big arrows (in my experience). \n\nIf you're so anxious about getting sick, then the smart thing to do is to stay away from people and not confront them. The worst part out of all of this in the stores is the old fucks who just stand there considering what they're there for instead of writing a list before they go, or stand there on their phone blocking an entire aisle. All I want to do is get and out as fast a humanly possible. The less I'm around others, the better. Both for the virus and my general sanity.",
                    "score": 60,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yup. What’s someone going to do, drop everything and leave the store because they don’t have a mask? Telling on them is stupid too, the store won’t kick them out in all likelihood and most employees probably don’t really care. \n\nThe most common end result is just hassling people and causing drama with no real change.",
                    "score": 45,
                    "author": "eckrueger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Delaware, you get a $500 fine and up to six months in jail, so they certainly should leave the store.",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can honestly say that if you were to \"go tell someone of authority\" at the store all they would do is tell you \"thanks we'll take care of it\" and that will literally be the end of it. They will prolly tell other Co workers about the person who wanted them to go take care of the person not following rules but that's about as far as that would go so if it truly bothers you that much then confront them yourself but that prolly won't do you much good either. Best case, leave it and forget it. Wash you hands and don't get in people's faces, you'll be fine.",
            "score": 117,
            "author": "kittycuddles86",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Tell someone of authority” at a grocery store lol",
                    "score": 25,
                    "author": "Mecmecmecmecmec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And this is why working retail sucks.",
                            "score": 6,
                            "author": "TheSaiguy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can understand people not knowing about one way aisles since around where I'm at it hasn't been clearly labeled in a lot of stores. The thing I don't get however (which is starting to piss me off) is that everywhere you go, EVERYWHERE, there is at least several signs saying to maintain a 6 foot distance from each other. Yet the asshole in line behind me without a mask on is 6 inches behind me. I shuffled forward a little to try and get a few more feet between us but then they shuffle right along with me to maintain an uncomfortable distance.",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can’t control everybody. Worry about yourself and keep yourself safe.",
            "score": 14,
            "author": "abbyalene"
        },
        {
            "level": 0,
            "comment": "the feeling you're experiencing is powerlessness. you cannot control other people so that's making you anxious.",
            "score": 49,
            "author": "aceshighsays"
        },
        {
            "level": 0,
            "comment": "Honestly most people don't wear masks properly and gloves are a joke unless u plan to disinfect every item as you put it in your cart and change gloves between items. I would just accept that there is going to be an inherent risk associated with getting groceries and try your best keep your distance. There will always be inconsiderate people",
            "score": 72,
            "author": "TheDarkFantastic",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tbf the one way aisles are a little silly if the store isn’t packed. If there’s one person in that aisle, I’m not walking all the way around to quickly grab something that’s near the ‘exit’. They were designed to fit two people side by side, and if people are being courteous about it, no harm no foul. \n\nNow if it’s rush hour and store is packed, then it’s a good idea and would help the flow.",
            "score": 186,
            "author": "Zaydene",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if the aisle was packed how does 1 way improve anything? It just makes you go down an extra aisle to get to it which causes even more traffic. It doesn’t cause less people to be in the aisles, especially if you’re allowed to pass people.",
                    "score": 92,
                    "author": "jrr6415sun",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You have rush hour?? In the U.K. we have to queue outside and there’s only a certain amount of people allowed in at one time. They get let in one side of the store and out the other and they communicate with security at each side when someone leaves, someone else can go in",
                    "score": 27,
                    "author": "hazelx123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have that in many places in the US as well, however the limit is pretty high. In my area the people allowed inside is determined by some fraction of the fire code's maximum occupancy of the building, and since grocery stores are so big here even my local store can have some 160 people in it before we need to line up. (And I've never seen more than ~40, employees included, in the store.)",
                            "score": 17,
                            "author": "AtomikRadio",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The US is very large with different jurisdictions and regulations.  Every state, county and city will have its own say on what is or no allowed.  In the case where it's not specifically required by law,  each store will have its own guidelines.\n\nWithin my own town,  I have 2 large markets.  1 requires a mask and 1 way isles with a 100 person limit.  The other has no restrictions.",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What if you forget something wayyyy back at the beginning?  You have to zig zag through all the aisles to go back?   Seems counterproductive.",
                    "score": 2,
                    "author": "pudding7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honest mistakes, for some of them?\n\nI was just out shopping for the first time in weeks. I walked two isles the wrong way (\"wow why are these jerks getting so close...\") before realizing isles were marked. My bad. \n\nPointed out the signs to a couple other people and most just said \"oops uhoh,\" turned around and started going the right way. Had one ignorant exception who just said \"oh it's okay\" and kept going.",
            "score": 19,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I havent been to the grocery store much lately. But I only just realized a week ago that there were arrows on the ground for directions in the aisle. I was just so worried about getting in and out and not being close to others that I never looked down. \n\nWhere I live the stores arent even limiting people and it is always packed no matter when I go or if I drive by. I wanted to go to a walmart for food items and bath items but then parking lot looked like a weekend or holiday crowd and I have only been going during the week.",
            "score": 9,
            "author": "Swampbrewja",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve noticed that, too. Why are the stores packed all the time now? With people home during the day and able to shop any time during store hours, you would think it wouldn’t get crowded. But now it’s like rush hour all the time.",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its intense. I actually still need items and just ordered it fr pick up at target. I'm not interested in going in the stores anymore.",
                            "score": 5,
                            "author": "Swampbrewja"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone did this to me the other day. I was walking the \"wrong direction\" in an aisle. The aisle was empty. Stopping to argue was not worth my time.",
            "score": 52,
            "author": "ayosuke",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why do you need to do anything about the other customers? Leave them alone. Do your best, do your errands, and leave.",
            "score": 103,
            "author": "C-Nor",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP sounds like they have other issues, most people dont feel the need to tell on a stranger",
                    "score": 34,
                    "author": "SkylerHatesAlice",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you think confronting someone who isn’t wearing a mask is the best thing to do then that’s silly and would only put you in a more exposing situation. They aren’t breathing on you or spitting on you or coughing on you so why approach and engage in a heated conversation when you just said you were anxious about them not wearing a mask. Leave people alone and get your shit done and get out. Sanitize things you touch and be mindful of people you are close to. Simple as that. Doesn’t need to be a day ruining situation when times are already anxiety inducing enough. Why make your mental state worse by confronting and yelling your opinion at them. Also why wear a mask all over the place. Touch this touch that take mask on take mask off....touch my child touch my car touch my house....rant over!",
            "score": 31,
            "author": "avauli",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You’re a coward, don’t tattle on your countrymen just because you lack a spine and can’t think for yourself.",
            "score": 6,
            "author": "disabledmailman"
        },
        {
            "level": 0,
            "comment": "Worry about protecting yourself. Wear a good mask, gloves, and take all the precautions necessary, including bulk shopping so you don't have to deal with these wackadoos as frequently. Remember that people are stressed, anxious, and tired of the pandemic. People will make mistakes. The best thing you can do is protect yourself. A mask, gloves, and one way aisle won't really do much for you anyway. Be patient with people, the world its at its wit's end.",
            "score": 20,
            "author": "anonymoususererror"
        },
        {
            "level": 0,
            "comment": "I had this older lady walking around the store I work at without a mask complaining about people not following the one ways. I saw twice before my lunch and once again after. She didn't even have anything in her cart the whole time. Really makes me wonder what the fuck she was even doing there.",
            "score": 25,
            "author": "travis01564",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Being adult means you have realized and most importantly you have accepted that half of humanity are stupid dipshits and assholes. Don't confront them or tell on them. There's literally too many to make any difference through your actions. That's why rich people live in gated communities. Try to avoid the trouble and keep yourself and your family save. That's all.",
            "score": 10,
            "author": "This_IsATroll"
        },
        {
            "level": 0,
            "comment": "I work on a home shop dept in the uk and staff are worse than customers I know we gotta work but at least try to keep the distance",
            "score": 5,
            "author": "yampidad"
        },
        {
            "level": 0,
            "comment": "You can’t control others. Take a deep breath, focus on what you can control and move through your life.",
            "score": 6,
            "author": "JennShrum23"
        },
        {
            "level": 0,
            "comment": "Just food for thought, some people may have medical conditions that don’t allow them to wear a mask. I personally have very bad anxiety, especially in stores, and wearing a mask makes it slightly harder for me to breathe and causes panic attacks more frequently. I’ve personally been using instacart to avoid the store all together, but some people may not be financially able to do so and still have conditions that prevent them from wearing masks.",
            "score": 5,
            "author": "L-0-G"
        },
        {
            "level": 0,
            "comment": "Under the current conditions, never confront people who might spit on you, take off your mask or actually hit you, its not worth it, I dont know about telling on them tho.",
            "score": 6,
            "author": "freakDWN",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I work part time in grocerry, in the bakery. I was stocking a table with product, and my supply cart was behind an arrow (which was pointed outward, towards myself). If someone was coming, I would be able to see them coming UP the aisle and move in time to be kind and courteous.   \n\n\nWell, one morning I got a few people who were just standing there trying to go the wrong way down as I stocked, one loudly saying, \"Excuse me\". I had the same inner dialogue of \"Do I say something? Do I tell them they are going the wrong way?\", but just moved my cart without saying anything, then stared at them and the arrow as they walked on..  \n\n\nYou gotta wonder \"Are people being stupid, lazy or defiant?\"",
            "score": 6,
            "author": "lonequack",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm sorry! I didn't know there were one-way aisles! It's not like there are any signs indicating which is the designated direction or not to go that way in this aisle. Jeez.",
            "score": 85,
            "author": "podgress",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t see how one way aisles help anything. I still have to get around people and it’s not causing less people to be in the aisle. It’s just causing more traffic by making people go down an extra aisle if they are going the wrong way.",
                    "score": 47,
                    "author": "jrr6415sun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I still have to get around people\n\nYeah, I got snark from someone at the grocery store last week for this. You’re supposed to keep 2 cart lengths between people, which is fine. Except if someone in front of you is dead stopped looking at items on shelves, are you just supposed to stop and wait for them to finish before you can move too? I certainly wouldn’t expect someone to wait for me to find what I want on a shelf, they should just go by me. \n\nI got snark for this from another customer in the grocery store last week. I was in the checkout line and realized I’d forgotten to grab a case of water. Cashier said to go ahead and get it since there was nobody behind me in line. The aisle with the water was “wrong way” so I had to go up the next aisle. Obviously I was in a rush, so I said “excuse me” to get around a guy and he made a comment like “you’re supposed to keep 2 carts away, follow the rules!”.",
                            "score": 15,
                            "author": "PM_ME_UR_REDPANDAS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I went to a store and one lady loudly stated, \"no one's following the rules but me!\" because admittedly no one in the fairly empty store was following the one way signs. On my way out, I saw her leaning on the lotto cart picking numbers. It just seemed very silly and hypocritical of her",
                                    "score": 12,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ngl, I went to the store yesterday and realized way too late that there were arrows on the floor (like when I was leaving). It's one of the bulk stores so I was looking up (like at the aisle names) most of the time and I was trying to rush and get TF out. I did wear my mask and tried to not touch anything that I didn't take. But I'm probably *that* asshole",
                    "score": 18,
                    "author": "MrsRadioJunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The other day, I was walking down an aisle, and someone said with annoyance \"wrong way\". That's when I learned the aisles have directions now...",
                            "score": 3,
                            "author": "damndirtyape"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same! I didn’t realize there was arrows at first and  then when I did I still messed up because I’m not used to it.",
                    "score": 10,
                    "author": "junjunjenn",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 47,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There are signs in my store but they're so hard to see. Too bad we don't have bright yellow signs that are easy to see and read like the ones for our endcaps and promos...",
                    "score": 8,
                    "author": "TheRoyalWiiU"
                },
                {
                    "level": 1,
                    "comment": "Lol, even if there are signs, your mental ad block in likely to filter them out. The only store around me with one way aises used these giant fancy vinyl printed floor stickers, the same crap they always have on the floor to advertise whatever fattening garbage they're trying to sell that day. I was half way through the store before I noticed them.",
                    "score": 7,
                    "author": "OutlyingPlasma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 18,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "All you can control is your own actions.  Maybe try online delivery if the stores scare you.  Or ask a friend or relative to shop for you.",
            "score": 9,
            "author": "ConfidentFlorida"
        },
        {
            "level": 0,
            "comment": "I do follow the rules in the grocery stores but honestly I see no point in the one way isles.  It doesn't limit the amount of people that can be in that isle.",
            "score": 4,
            "author": "Jawaka99"
        },
        {
            "level": 0,
            "comment": "My wood cane maintains the 6 foot rule with one swing.",
            "score": 4,
            "author": "OmegaInLA"
        },
        {
            "level": 0,
            "comment": "Yup, it's driving me nuts.  Also, those \"One Way\" aisles seem bogus to me, as all the ones I've seen have not had adequate space to safely pass another shopper... and if one person starts putt-putting along, you end up with problems.\n\nAlso, fucking Walmarts are STILL packing the main aisles with shit forcing people to stay nice and close.  You can tell they DGAF about anybody and they're just putting in the most empty weakest measures they can to try to keep the health department off their back.\n\nI really hope this whole thing eventually leads to a wildcat strike when the time is right.",
            "score": 4,
            "author": "1lluminist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It makes me uncomfortable, yeah, but I ain't gonna bother correcting anyone. Most people are Meatheads and would just argue anyways.",
            "score": 4,
            "author": "Tahlato"
        },
        {
            "level": 0,
            "comment": "I’m bothered by the fact that so many people don’t seem to understand HOW to use a mask. A good 30% of mask wearers I’ve seen in public only have their mouth covered, not their nose. It’s frustrating, but I haven’t the jellies to tell them. Fcking social anxiety.",
            "score": 8,
            "author": "Starumlunsta"
        },
        {
            "level": 0,
            "comment": "Not really that bothered or worried about any of it tbh",
            "score": 29,
            "author": "Tana1234"
        },
        {
            "level": 0,
            "comment": "The more I read these comments and compare them to what I've seen in Walmart/Lowe's, I think it comes down to a combination of two factors. \n\nFor one, the don't-give-a-shit factor being very high. Or maybe it's more of a you-can't-tell-me-what-to-do. I don't know why we are so against following any type of new rule or guideline. Certainly there is some amount of perceived risk versus perceived reward. As in, \"if I just speed through the store and don't wait for aisles to clear, it's not like I'M going to get the Covid and I'm in a rush!\"\n\nBut really, I think a lot of people are just completely oblivious to the changes in policy, despite the signs everywhere and announcements over the PA. Seriously, tons of the comments are pointing that out. My coworkers have said the same. People don't pay attention to the world around them.",
            "score": 6,
            "author": "Someday_Z",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I get anxious just by being in a store. I feel like I can’t look at anyone and have to finish my shopping in five minutes. A bagger at the grocery store became unreasonably upset when I was probably 5 1/2 feet away from her. As for the one-way aisles, how effective are they, really? You can still get close to someone else going the same direction.",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "TBH, I'm simply not trained, in a store, to look down at the arrows.  Learned behavior.  It's going to take a while to change my behavior.   Confrontation is definitely not the answer.",
            "score": 3,
            "author": "tokolos"
        }
    ]
}