{
    "id": "u74vx6",
    "score": 41818,
    "title": "Does anyone else think Google search quality has gone downhill fast?",
    "author": "PizzaInteraction",
    "date": 1650374055.0,
    "url": "https://www.reddit.com/r/NoStupidQuestions/comments/u74vx6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel like SEO (search engine optimization) has ruined Google. Unless you are looking for something obvious, all the search results are websites that are barely tangential to your search terms.\n\nEDIT: The fact that this thread could be google-able just makes me happy inside.",
    "comments": [
        {
            "level": 0,
            "comment": "Yes. I now have to go to the second page, which was something that I haven't had the need of doing since I first started using Internet.\n\nNon-stop ads as the first three results, \"similar\" findings that have a single word of your search terms, or completely unrelated search results because the algorithm is secretly testing something.",
            "score": 5954,
            "author": "novato1995",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always laugh when I enter like 4 search terms and all the results focus on just one of the terms. Like, yes Google, I was just messing around when I added those extra terms. Thanks for ignoring them for me.",
                    "score": 3414,
                    "author": "PizzaInteraction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also the results. Say you are looking for \"Afternoon Tea\"\n\nThis is your typical result :\n\n\"So you were looking for **Afternoon Tea.** Not everybody knows what **Afternoon Tea** is, but when you do, it is great to get together and do an **afternoon tea.** An **Afternoon tea** is a **tea** get together in the **afternoon**. It's also when you drink **tea** in the **afternoon**.\n\nHere are some bullet points about **afternoon tea :**\n\n* There is **tea**\n* It is after noon.",
                            "score": 3313,
                            "author": "ClassicBooks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Followed by \"Cheap afternoon tea near you\" We've got afternoon tea\" etc.",
                                    "score": 1562,
                                    "author": "PMmeareasontolive",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Buy afternoon tea at Target”",
                                            "score": 724,
                                            "author": "Pigelot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "then you get in and it's just a search inside the site with no results",
                                                    "score": 634,
                                                    "author": "redvodkandpinkgin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I can feel my blood pressure rising already.",
                                                            "score": 362,
                                                            "author": "Val66Met",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Google really need to do a better job at that. It's come to the point that I will flat out ignore some sites in the top results because I know it's a bullshit link to a search. Target and Walmart are the worst offenders",
                                                            "score": 66,
                                                            "author": "Crossfire124",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"HOT sexy afternoon teas are waiting to meet you RIGHT NOW\"",
                                            "score": 367,
                                            "author": "AsphaltsParakeet",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Afternoon tea? In your vagina? It's more common than you think. Click here!\"",
                                                    "score": 171,
                                                    "author": "Thassodar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Want more afternoon tea? Try these six simple tricks to get the afternoon tea you really want!",
                                                            "score": 43,
                                                            "author": "BringPheTheHorizon",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "More like search for \"Afternoon tea\"\n\nFirst three results \n\"Does not include tea\"",
                                    "score": 447,
                                    "author": "WhalingBanshee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Did you mean…”  \n“NO I FUCKING DIDN’T.”",
                                            "score": 258,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "worst part is wrapping it in quotes \"\" only seems to work sometimes now. i remember in the old days i could find really obscure stuff that way. now, and I can't believe I'm saying this, I sometimes have to resort to bing. because bing is so primitive that oftentimes it takes you literally. which is oftentimes what i want.",
                                                    "score": 82,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Using quotes used to be crazy powerful! Used it all the time and still do. Also, using site:[web site url] used to outperform the web site's actual search function at times. That method got severely downgraded long ago, I forget why.",
                                                            "score": 31,
                                                            "author": "FuturesPassed",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "IF I MEANT THAT I WOULD HAVE FUCKING TYPED THAT!",
                                                    "score": 39,
                                                    "author": "Luxalpa"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "First result is just the definition of the woord \"Noon\".  Because Daddy Google knows best with their shitty algorythms.",
                                            "score": 58,
                                            "author": "RamenJunkie",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Afternoon +tea\n\n“Does not include tea”\n\nAfternoon +”tea”\n\n“Does not include tea.”",
                                            "score": 38,
                                            "author": "Echospite",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They actually took the `+` operator away so they could use it for Google+.  Then, less than 18 months later, they shut down Google+ for consumers (I guess you can still have it as part of G-Suite?).\n\nNow, you use double-quotes around single words to \"require\" them.  It actually still doesn't _require_ them, but it does put more weight on their direct presence.",
                                                    "score": 14,
                                                    "author": "bss03"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There's also a ton of SEO'd webpages now where what they do is they get search terms like that, they plug them into a search engine in a bunch of formatted queries, scrape the first result, and then throw them into a list. And you can tell because they don't always correlate to what you're talking about. \n\nLike once I was looking for some technical linux thing that I don't remember and the first site was scraping from both the stackoverflow post I was just looking at and also responding to completely unrelated questions about a legal document of the same name.\n\nIt's SEO garbage and search engines need to find a way to deal with it.",
                                    "score": 219,
                                    "author": "KasaneTeto_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Downranking for keyword dilution. Attempting to serve a 5 gal bucket of tea vs the site trying to serve a couple cuppas.\n\nBut yeah Google does seem to have a problem with figuring out which sites are \"search engines\" returning results.",
                                            "score": 41,
                                            "author": "PlNG",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've read that this is why every recipe site starts with someone's life story, because a higher word count/larger variety of words it will help it with SEO. It's all about generating more clicks for ad revenue.",
                                            "score": 27,
                                            "author": "jaleneropepper",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hate that you are so right.",
                                    "score": 111,
                                    "author": "TatianaAlena",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes well I was still shocked with my BellSouth dial-up in the 90s when I searched breast cancer and got a whole bunch of porn sights!  There were way more porn options then instead of legitimate sites with factual information about symptoms of breast cancer.",
                                    "score": 83,
                                    "author": "Joytotheworldlove2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To be fair, the internet in the 90’s was largely without indexing and and web crawlers. Most of the websites were slapped together porn sites or just hosting content they shouldn’t have, because no one cared.\n\nThis was also before search engines started banning keywords and phrases. You could quite frankly google “some fucked up shit you can’t unsee” and be presented with some fucked up shit you can’t unsee.",
                                            "score": 99,
                                            "author": "Tiggy26668",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And the usual tricks like adding quotes around required words, or putting a dash in front of words that should be excluded dont work anymore",
                            "score": 539,
                            "author": "Cl0udSurfer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's because Google is trying to guess at what you're searching for because most people don't think in keywords and instead search using full sentences like questions.  \n\nBecause these folks now largely outweigh legacy users, they are pandering to them by default.\n\nIt's annoying for anyone who has skillfully used search engines for the past 2 decades.\n\nThankfully, you can still force it to behave like it once did by clicking on \"Search Tools\" and changing \"All Results\" to \"Verbatim\".",
                                    "score": 646,
                                    "author": "Mehsterrry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Verbatim hasn't worked for me for a good ten years now. It still ignores key words in your search string, it's just the results are fractionally more relevant. And I haven't found a reliable way to make it default to verbatim either.\n\nI think Google is garbage and has been for much longer than the OP suggests, it's a crapshoot whether you'll get useful results no matter how you use it. It hates, absolutely hates, giving the answer \"There's nothing on the Internet about this\", which leads it to prefer mountains of garbage over a useful \"No, don't waste your time, you probably are the only person with that error message\". \n\nMy favorite is when it says \"Did you mean &lt;something completely different&gt;?\" and then includes the results for &lt;something completely different&gt; and doesn't offer you a way to search for what you actually searched for except by \"Putting\" \"Fucking\" \"Quotes\" \"Around\" \"Everything\". Assholes.\n\nThe bizarre part is that Bing, DDG, et al, have decided to copy Google's broken search engine, and do it badly, rather than improve upon it.",
                                            "score": 259,
                                            "author": "squiggleslash",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't get why they can't understand that I was happier when I could cook up a narrowly targeted phrase that gave me 10 results, not have my query \"interpreted\" in a way that gives 10,000. I now have to search through those 10,000 results, so what did this do for me?",
                                                    "score": 126,
                                                    "author": "MatchstickMcGee",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nobody wants to fucking admit that they don't have something. Everything is like that now. If you search for a show on, say, Netflix that's exclusive to Hulu (or vice versa), they won't say \"oops, we don't have that,\" noooo. Instead they'll give you a bunch of random shit that has nothing to do with it. Like you'll just go \"Derp, what was I looking for again? Oh  yeah, [completely different thing]! Yayyyy!\"",
                                                            "score": 98,
                                                            "author": "GnarlyNarwhalNoms",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also with every browser implementing (then eliminating) a search bar, essentially training the \"average user\" to type their search directly into the location bar, it has made directly accessing network devices a pain.\n\nTyping 192.168.1.1 into a browser should not invoke a web search, but it happens all too frequently.",
                                            "score": 75,
                                            "author": "desearcher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That invokes a search for you? I’m using Firefox (granted, on Linux) and safari and typing a ip always resolves to said ip",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a crap shoot if it does or not for me. It helps to tack on a forward slash at the end, but http://192.168.1.1 usually defaults to searching. It's likely due to a preference for https over http (which is admirable) but some older devices I manage don't support such luxuries.",
                                                            "score": 14,
                                                            "author": "desearcher",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;It's because Google is trying to guess at what you're searching for because most people don't think in keywords and instead search using full sentences like questions. \n\nIs this still true today? Back in 2000 I'd expect that to be true, but, like, most people have been using the Internet daily for most of their lives, now.",
                                            "score": 100,
                                            "author": "Echo127",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Back in 2000 the percentage of adults with internet access was 50%. It is now closer to 90%\n\nWhen I started on the internet in the 90s most people using it were geeks or university students. The type that would set up linux servers for fun and use text-based browsers. The democratization of the internet has changed things. \n\nJust because little kids grow up using tik toks and memeing default fortnite dances doesn't mean they know how things actually work.\n\n[pew stats](https://www.pewresearch.org/internet/2015/06/26/americans-internet-access-2000-2015/) if interested",
                                                    "score": 101,
                                                    "author": "sunflowercompass",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 117,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yup I had this fear for a while as an elder millenial that the younger folks would surpass me, technologically speaking. But the tech they grew up with was so user friendly they never had to figure out the details.",
                                                                    "score": 80,
                                                                    "author": "Serious-Mode",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Exactly! My first PC was a DOS machine, and growing up with tech, (I'm in my 30s) I was amazed at how it was progressing and that I would be left behind....   \n\n\nSurprise surprise... They new users are the ones left behind, like seriously people do not know how to use their machines, they just slap an app there but have like no idea of how it works...   \n\n\nTrue story, a kid was surprised when I opened file explorer to help him find something he downloaded... He honestly thought he had to re-download the thing over and over again and open the file from the browser's finished download prompt.",
                                                                            "score": 35,
                                                                            "author": "Wasted_Weasel",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not just the Internet, but computers in general. Streamlining of \"apps\" to make them more accessible to everyone has, unfortunately, made it so that users don't naturally become familiar with how the computer works while using them. They only learn how the apps work. Millenial-ish aged people tend to have a better understanding because they started off on Windows 95 or even MS DOS.",
                                                                    "score": 49,
                                                                    "author": "Echo127",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can confirm: many adults and teens still google with full sentences... it's infuriating especially when students say they can't find anything but then you see they googled the entire question the teacher asked.",
                                                    "score": 36,
                                                    "author": "kayydeebe",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You'd be surprised. Also, the way that younger generations are using technology is completely different than what people who grew up in the late 90s and early 00s experienced. I was taught how to use the Dewey decimal system in elementary school but by the time I was in high school it was typing and the same teacher who taught me Dewey went through how to use keywords in a search engine. \n\nMost kids nowadays are growing up using mobile devices like phones and tablets. They don't really get exposed to a desktop or laptop. I have new employees who *do not* know how to use a computer even though when I was their age I at least knew what Microsoft Excel was. They spend a *significant* portion of their time on their phone though and I have no doubt that they know more about that platform's capabilities than I do.",
                                                    "score": 32,
                                                    "author": "winowmak3r",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Im going to butcher a phrase to make the point: Think about the median (smack dab right in the middle of knowing how to do things) internet user. Half of them are dumber than that",
                                                    "score": 104,
                                                    "author": "nametakenfan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As an IT worker, this is fact",
                                                            "score": 33,
                                                            "author": "Wolfreject",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, it's because Google is an ad company and they get money by getting you to click the stupid results.\n\nYou having a good experience is not relevant. They own 90 percent of interweb traffic.",
                                            "score": 47,
                                            "author": "NSA_Chatbot",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"MX518 datasheet\"\n\nFirst several results have a small note at the bottom \"missing: MX518\" and are just explanations of what a datasheet is.\n\nEdit: the actual number was something bigger and difficult to remember so I just used a random one that came to mind.",
                            "score": 95,
                            "author": "RenaKunisaki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then you just enter “MX518” and all the results are, “518 ways to spice up your life!”",
                                    "score": 56,
                                    "author": "PizzaInteraction",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My search:\n\"Washing machine brand X replacement part 687TD3\"\n\nGoogle:\n\nShowing results for \n\n'washing machine brand X replacement part 688TD4'\n\n'washing machine brand Y'\n\n'blender parts Brand X'\n\n'clothing ads'\n\nEtc",
                    "score": 353,
                    "author": "TangerineBand",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When you have very specific search queries (like part numbers) especially after quoting them and you still get shitty results, it probably means it can't find at all what you're looking for. \n\nInstead of Google saying \"we can't find it\", they just return slightly related results. Which makes it look like Google misunderstood your query.",
                            "score": 116,
                            "author": "BrQQQ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same with Amazon. So annoying when you're looking for something specific and instead of saying \"we haven't got it\", instead it says \"here's 100 pages of products and maybe it's in there somewhere\".\n\nBad UX.",
                                    "score": 61,
                                    "author": "mynsfwaccount3163",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Amazon is horrible. \n\nSometimes I have better luck Googling for an item and going to the Amazon listing from there than searching for it directly in Amazon.",
                                            "score": 35,
                                            "author": "Asil_Shamrock",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 60,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It kinda reminds me of back when I was working fast food and the training videos that corporate made us watch insisted that we never say the words \"I don't know\" to a customer for some stupid fucking reason.",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The fact that Google crosses out search terms is infuriating\n\nHow does that help anybody find what they're looking for???",
                    "score": 164,
                    "author": "shoopdahoop22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Google isn't a search engine anymore. It's an advertisement platform. You can literally pay to increase your \"search result\" rating so people find your page more frequently than they would otherwise.",
                            "score": 148,
                            "author": "Zooshooter",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is been happening for ages now, first page bought and paid adverts no fucking benefit to a search whatsoever, I stopped using them, swapped to duck, however this is best of a bad bunch, I'm always on 2nd page nowadays",
                    "score": 35,
                    "author": "camshun7",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 78,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have this problem with google or with duckduckgo? Because I feel like duckduckgo hates wikipedia for some reason whereas google still picks it up most of the time.",
                            "score": 32,
                            "author": "Deservate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"!w &lt;search term&gt;\" will take you straight to Wikipedia, in case you didn't know!\n\n[Bangs](https://duckduckgo.com/bang) are one of DDG's best features, and I feel like not enough people know about them.",
                                            "score": 35,
                                            "author": "HeyThereCharlie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah web search really sucks now.  I find myself adding “Reddit” the the search fairly often, because at least it will show people asking/answering something like the question I have.  \n\nNothing worse than getting linked to a bunch of poorly written “articles” about what the 10 best widgets are with links to Amazon products in the body of the message.",
            "score": 9545,
            "author": "Pierson230",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg me too lmao. Like if im looking for opinions on something its more reliable than sifting through \"reviews\".",
                    "score": 1763,
                    "author": "WomenAreFemaleWhat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because most Reddit posts are too small to astroturf that widely. If I Google some shampoo brand to see if it's good, they're all being paid on their Amazon referral so their opinion isn't genuine. But on a 4 upvote post from 5 years ago on Reddit, I can be pretty sure it's just some person who tried it and is giving their opinion.",
                            "score": 1235,
                            "author": "2SP00KY4ME",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk about that so much because I see a ridiculous amount of bots, but I do find that reddit is good for technical questions you don't have time to ask but somebody else already has. Also, the reddit community loves to complain about products and...well anything really so you'll always be able to find a decent pro-con list of anything. Another big reason I google stuff with reddit is because there's a pretty decent percent of the community with a rigid almost moral code about citing their sources. Last reason is the familiarity/ease of use and the karma system. It's not perfect, but it's easy to read quickly and glean information from.",
                                    "score": 413,
                                    "author": "tstngtstngdontfuckme",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Idk about that so much because I see a ridiculous amount of bots\n\nThe amount of bots on this website is truly insane, I have to agree with you there. I still think you can find genuine humans offering real opinions, especially in the small niche subs.\n\nThe objective of the bots is on a higher level, in a manner of speaking... Nowadays the \"hivemind\" aspect of reddit is far far worse than it was 8-10+ years ago, and I think that is what the bots are intended to achieve.\n\nIf you believe Reddit to be truly representative of your human peers, your perspective of the world will be heavily influenced by browsing /r/all because of the apparent consensus around many nuanced societal/humanitarian issues. That consensus doesn't actually exist in the real world, but seeing a semblance of a consensus on websites like this has a powerful effect on the human psyche.\n\nHumans are social creatures, and that hasn't changed despite us transitioning much of our socialization to the internet. What has changed (for the worse) is our susceptibility to inorganic social influence. \n\nHuman have an inherent need to fit in, but \"in\" is evermore defined by the powers that be, as opposed to being defined by each one of us acting as members of real, tangible human communities.",
                                            "score": 258,
                                            "author": "FMeInMySoftStinkyAss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; If you believe Reddit to be truly representative of your human peers, your perspective of the world will be heavily influenced by browsing /r/all because of the apparent consensus around many nuanced societal/humanitarian issues. That consensus doesn't actually exist in the real world, but seeing a semblance of a consensus on websites like this has a powerful effect on the human psyche.\n\nThis is a big problem. It's very similar to the \"echo chambers\" of any other social media, just better at disguising it. So many people go to reddit and make fun of social media echo chambers while literally being part of one.",
                                                    "score": 76,
                                                    "author": "workthrowaway390",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Comments used to be the best part of reddit even 5 years ago. The post was basically the sign out front that got you to come in, but the comments were where the fun was. Lately, though, I've been noticing just the most \"basic bitch\" comments, or just outright stupidity or ignorance. I get that reddit is social media, but it always has been. I dont know what changed. Has the crowd gotten younger?  Some comment sections are filled with people being confidently wrong about a thing. Think r/whatsthisthing but its a tea kettle and everyone keeps saying its an antique iron. And corrections get downvoted. The post with the basketball spinning guy, for example. People saying its staged because the thrown item has a pointy part. I think its just young kids who havent had those cordless phones with an antenna piece. \n\nOr its just the extra socially part of social media. Like the facebookification. The addicts are the ones who rise to the surface. But the addicts also have nothing of substance to add, its just noise. \n\nI dunno. Just venting i spose. But the quality of the content that used to make this place different has definitely gone downhill.",
                                                            "score": 46,
                                                            "author": "ryanvango",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is so true. Even just based on the post, you can pretty much guess what the comments will say, and then what’s the point? Don’t get me wrong, reddit was always like that to a point, but it feels like it got cranked up to 11 somewhere along the line.\n\nI remember scrolling through the comments on some post on /r/funny one time, and eventually got to a comment that said, “Quick! What subreddit are you on right now?”, and for the life of me I had no idea. The point they were making was, “this is post isn’t even really intending to be funny, so why is it on this sub?”, but it stuck with me how homogeneous everything has become.\n\nI still do that sometimes: if I’m scrolling through comments, sometimes I’ll remember to ask myself, “what subreddit are you on right now?”. Most times it’s hard to tell.",
                                                                    "score": 28,
                                                                    "author": "Porunga",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I find myself adding “Reddit” the the search fairly often\n\nGoing to Google and searching (without quotes) \"Reddit whatever topic\" is better than *either* Reddit search OR plain old Google search, IME.",
                    "score": 217,
                    "author": "Captain_Hampockets",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I can't remember the last time I had a search without \"site:reddit.com\" added at the end, to be honest. I even have a keyboard shortcut for it at this point. \n\nSometimes, I want to know opinions, so it's useful, but mostly, I use reddit to get sources for actual information because google won't give that to me anymore.",
                    "score": 45,
                    "author": "FossaRed",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "just so you are aware, with most major search engines there is a capability built in that allows you to filter by a specific domain name. so, instead of adding `\"reddit\"`, which i might add that quotes no longer work as a proper boolean function on Google, you could type `site:reddit.com` and get only results that are actually on reddit it's self.",
                    "score": 142,
                    "author": "walderf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's also\n\n`intitle:xxx`\n\n`before:yyyy-mm-dd`\n\n`after:yyyy-mm-dd`\n\n`-` to not include a word in a search `Cat -lion`\n\n`OR` to include results with either `dog OR cat`\n\n`filetype:xxx` Most often used for finding .pdfs like textbooks",
                            "score": 102,
                            "author": "2SP00KY4ME",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't forget that you can search specific subreddits too, just use `site:reddit.com/r/subreddit`",
                                    "score": 30,
                                    "author": "Vetinari_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly this. Want movie reviews? I just search Google for reddit threads. Sort both by best and controversial, you're good to go.\n\nSame thing for really obscure things which when searched on Google would take you to some website with tons of adds, while on reddit you could get a niche community member answering your questions as detailed as possible because they are enthusiastic about it",
                    "score": 232,
                    "author": "CeleritasLucis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But that's also because the Reddit search function is gash.",
                            "score": 97,
                            "author": "KingBabyDuck",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I started this too especially for cooking questions because for some reason everything is a 10 page essay now on their mom's lasagna recipe or a 10 minute YouTube video when literally a one sentence answer would suffice.",
                    "score": 52,
                    "author": "alghiorso",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is because of Google optimizes the long blog post type recipes.",
                            "score": 17,
                            "author": "Light_Speed58",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And all the articles are just copy of each other lol",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whenever I do an image search, I wish Pinterest would be outlawed.",
            "score": 6281,
            "author": "darthatheos",
            "replies": [
                {
                    "level": 1,
                    "comment": "uBlock Origin Filter:\n\n    ! Pinterest Results on Google\n    google.*##.g:has(a[href*=\".pinterest.\"])\n    google.*##a[href*=\".pinterest.\"]:nth-ancestor(1)",
                    "score": 3862,
                    "author": "TaohRihze",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OH MY GOD! I fucking love you. Please have a fucking excellent day.",
                            "score": 833,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or.. - \"pinterest\"\n\nThe minus tells google to ignore searches that hit whatever follows in quotes",
                                    "score": 87,
                                    "author": "potat489",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Doing the Lord's work, son. Thank you.",
                            "score": 49,
                            "author": "JonesyJones"
                        },
                        {
                            "level": 2,
                            "comment": "How to use it ?",
                            "score": 206,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "click on ublock icon on the extensions bar\n\ngears icon (Open the dashboard)\n\nmy filters tab\n\nmake a new line and copy-paste the code\n\napply changes",
                                    "score": 597,
                                    "author": "SorosAhaverom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! I'm glad the other guy posted the code, but I have no idea how to use it. So thank you for the instructions. This is also why mid level management exists.",
                                            "score": 71,
                                            "author": "Tyrannyofshould"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "a god among us",
                                            "score": 167,
                                            "author": "socaldinglebag",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Click on uBlock Origin button in your browser &gt; go to Dashboard (it looks like the Settings option/ 3 cog wheels) in the bottom right &gt;it opens up in a new tab there go to the sub-tab \"my filters\" &gt; copy-paste the 3 lines as is &gt; click on \"apply changes\"",
                                    "score": 33,
                                    "author": "time_and_time",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "if i want to modify this to be for a different website, do i just change \".pintrest.\" to the other sites?\n\nwould really like to hide \"me.me\" image results from showing up",
                            "score": 20,
                            "author": "Silentmatten",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[This is for you](https://www.youtube.com/watch?v=3ysSeWgIzcE&amp;t=2s), /u/TaohRihze/",
                            "score": 38,
                            "author": "MGyver"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seriously! Pinterest won't even let you view anything unless you sign in. Don't even let that be a search result if it's going to force me to make and login to an account just to see the result!",
                    "score": 164,
                    "author": "Aeriosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I hate pinterest.  It's just stolen content and the images already exist elsewhere so why use the them?  Plus the pinterest version usually seems to have the quality degraded.",
                            "score": 42,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've started using Bing for images. It's just better. First of all, you can still get the full res image by simply clicking on it, a feature google use to have but no longer offers. Bing also offers better results beyond pintrest and Getty.",
                    "score": 745,
                    "author": "OutlyingPlasma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bing has been better for images for years, the filters are better too.",
                            "score": 326,
                            "author": "pingwing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Its funny how bing was mercilessly mocked by years but now theyre legit just.. better. I want to find what im looking for, not what companies that sell that product want me to see. If I use the + before a word, I want my results to actually contain that word. I swear that doesnt even make a difference anymore",
                                    "score": 100,
                                    "author": "taybay462",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wish their UI/UX was a bit better, but yeah, they're literally really damn good. Generally when Google wasn't able find the thing I'm looking for after many searches and pages, it's one of the top results on Bing. Google seems way more interested in pleasing advertisers\n\nArticles written by AI optimized for SEO are ruining all search engines, though. They just talk in circles without saying much, but they're top results so frequently.\n\nReddit discussions are so frequently the best actual result, but Reddit's search is stuck in the 1980s, so you end up using one of the other engines to find stuff on here. Reddit is also getting full of advertisers and bots, though, so it's really all getting fucked.",
                                            "score": 65,
                                            "author": "guaranic",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's great for uh...videos...too.",
                                    "score": 378,
                                    "author": "Slight_Log5625",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Purely research, I asure you",
                                            "score": 99,
                                            "author": "blamethemeta",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It used to be, then they nerfed their NSFW search functionality. I use Yandex for reverse image searches now. It's great at returning similar images/videos",
                                            "score": 67,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The reverse image search on Google used to be great.  I could search for an image and it would show me page upon page of places where that exact image was used.  Now I try to use it and Google's like \"Oh, this looks like a building, so here are some pictures of random buildings, I guess.\"",
                                                    "score": 20,
                                                    "author": "UndeadBread",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that what happened? I click on an image now and it has all of this crap on it and I can’t get just the image alone. Usually it’s just a dumb meme I want to show someone. This is one of those vexing things I never mention to anyone but bothers me. Thanks! I will try Bing next time. \n\nI’m also vexed by the same thing as OP. Tried to look up a specific apartment complex and for so many ads for others that what I asked for was halfway down the page! So aggravating.",
                            "score": 90,
                            "author": "Sandy-Anne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Getty images sued Google over it and now you have to click through for the full image.",
                                    "score": 35,
                                    "author": "Business_Downstairs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;feature google use to have but no longer offers.\n\nHonestly thought I'd imagined that I used to be able to do that",
                            "score": 33,
                            "author": "Pigrescuer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Bing is also better for anything porn related.  Google seems to filter it these days even with safe search off and even when explicitly searching for \"Porn\".\n\nEspecially for video.  Literally every Google result is a Youtube link.",
                            "score": 29,
                            "author": "RamenJunkie",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "seriously, why does google like Pinterest so much?!?!?",
                    "score": 58,
                    "author": "rex5k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume they own a chunk of it.",
                            "score": 45,
                            "author": "TirayShell",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s funny because I started including Reddit on all of my searches.  Gets me a solution quicker than all the garbage out there.",
                    "score": 39,
                    "author": "hame579",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Where you can find everything *like* but not *actually* the source of the image you wanted.",
                    "score": 95,
                    "author": "Valdrax",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just add \"-pinterest\" in the search and it keeps anything pinterest from showing up.",
                    "score": 148,
                    "author": "photoguy423",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's google. Half the time it ignores that and gives you pintrest crap anyway.",
                            "score": 151,
                            "author": "OutlyingPlasma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "`-site:pinterest.com` will work more consistently.",
                                    "score": 126,
                                    "author": "apetranzilla",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " yes.. fuck Pinterest. I almost rage-quit my search when I click on a Pinterest page without realizing",
                    "score": 62,
                    "author": "dogs_drink_coffee",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "i have an extension called unpinterest (i think) and it filters pinterest out for me",
                    "score": 17,
                    "author": "rainbowcanoe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You can exclude sites by typing a minus followed by the site name. Example\n\n&gt; collections of dress -pinterest",
                    "score": 14,
                    "author": "Crazed_waffle_party",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I do YouTube searches a lot and at least a third of the results are videos from bigger channels that are barely related to what I'm looking for. Like if I'm looking for gameplay footage of a semi-obscure Nintendo Wii or DS game, a lot of the search results are going to be from a day ago with titles like \"OMG, we need to talk about that Nintendo Switch Pro leak\" with a thumbnail showing the YouTuber either seconds away from orgasm or immediately after eating an entire lemon.",
            "score": 1131,
            "author": "Phantereal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I fucking hate the YouTube search engine. Before, I could find obscure songs or videos by just searching for them but now the first 2-4 results are related and rest are absolute goddamn garbage. I have to use way more specific search terms which sucks when you are finding a mash of a song that is one hour long. Previously, I could just goddamn scroll down.",
                    "score": 247,
                    "author": "Comfortable-Wait",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I miss old YouTube when u watched a video and find similar videos. Now it’s just recommended videos and it’s so annoying to find new content to watch.",
                            "score": 119,
                            "author": "unknown_2000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I have YouTube on auto play and after a video ends it queues up nothing but videos I’ve already seen.",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "holy fuck yes. why are half the videos on my home oage videos ive already seen. what the fuck is the point.",
                                            "score": 14,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah it's been this way for years and they somehow decided it's better (for them, because it's more profitable that way). It's pretty inexcusable.",
                                    "score": 11,
                                    "author": "NorthernAvo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 147,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. When I search things I don't just get search results any more. I also get \"Others also viewed\" and \"similar videos(which aren't similar)\" and to see 10 results related to a given search, I have to look through 30 videos",
                    "score": 184,
                    "author": "tri_becca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 35,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 106,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it’s absurd and i haven’t found a way to turn it off…like yes youtube, maybe i *do* want to find 15 different versions of this folk song to find one i like!",
                            "score": 59,
                            "author": "Over421"
                        },
                        {
                            "level": 2,
                            "comment": "I miss the days when the recommended videos under a video were actually related to the video and not just “generic videos you might like”. You used to be able to go on random walks deep into YouTube rabbit holes. That’s not really possible anymore.",
                            "score": 52,
                            "author": "Mediocre-Frosting-77"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I swear every time I search for anything — no matter how obscure—, I get about 5 iffy results followed by 5 videos I’ve already watched that have the most similar title (usually shares a word but has nothing to do with anything) and then the rest are just recommendations that have nothing to do with my search. I hate it.",
                    "score": 25,
                    "author": "Transparent-Paint",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "When the day comes where companies decide to stop funding those channels just to see what happens, I wonder what the presenters will do?",
                    "score": 21,
                    "author": "governmentyard",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "No, YouTube, I don't want to watch Mr.Beast do X thing completely unrelated to my history or searches.",
                    "score": 21,
                    "author": "Secretlylovesslugs"
                },
                {
                    "level": 1,
                    "comment": "&gt;with a thumbnail showing the YouTuber either seconds away from orgasm or immediately after eating an entire lemon.\n\nYou are a true wordsmith",
                    "score": 54,
                    "author": "OperativePiGuy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not just Google, it's everywhere everytime you search something. \n\n\nJust go to Amazon, type in \"Brand XYZ noise cancelling headphones\" and you get everything besides the actual brand you put in.\n\nEDIT: A word",
            "score": 506,
            "author": "ktrezzi",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can look something up on amazon, copy and paste the name in amazon's search bar, and STILL not be able to find it.",
                    "score": 284,
                    "author": "JJAsond",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This drives me up the damn wall. Friend finds something on the US site, it looks cool, but there's no \"this but on the UK site\" button, you have to search it up manually on the UK site, but it won't show up until page 35,542. So it's on amazon, but they hide it from you.",
                            "score": 139,
                            "author": "duck74UK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Amazon's whole site is trash - as a Swede, who've had a great selection of Swedish webshops available since the early 00s, it feels like going back and using a shopping site from the 90s.\n\nCategories might as well not exists, products are just all over the place, the search works like shit, and it's nearly impossible to filter out results - and it's all intentional, because Amazon figured out that they make more money if they can show you a ton of other results that might trigger an impulse buy from you instead of just directing you to the stuff you wanted to buy in the first place.\n\nAmazon is the digital version of your grocery store always putting the milk the furthest back in the store, so that you have to go all the way into the store and then back all the way to the cashier - so that when you're \"*just going to get a some milk*\" have to pass all the other stuff, see all the \"deals\" and go past all the snacks and candy,  and hopefully you'll arrive at the cashier with 2 bags of groceries to check out because you realized \"*Huh we're almost out of this*\" and \"*Hm that's a nice price*\" and \"*MMMMMM CANDY*\"...",
                                    "score": 85,
                                    "author": "acathode",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What gets me is the sites that have direct scrapes of questions answers and code from places like Github, Microsoft ect.  For some reason Google puts them first, so you have to scroll through lists of cloned results to get to something that makes sense. It never used to be like this.",
            "score": 1010,
            "author": "orbit99za",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well this explains why I'm so damn confused when I'm trying to find some code. Everything I find is in pieces and makes no sense, like I know that is supposed to do that, but how on earth do I put it into the code and make it work?! I've ended up using YouTube channels to figure things out. A good video explains what everything does and I also understand wth is happening (I'm completely self taught).",
                    "score": 180,
                    "author": "Zanki",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's because these sites are in an arms race with Google's seo algorithms. Everytime Google changes something these sites race to optimize for it. Google doesn't want these to be the top results but they optimize for whatever metrics Google is using to rank search results.",
                    "score": 37,
                    "author": "justAPhoneUsername",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I always add `site:stackoverflow.com` when looking for SO results because there are so many scraped versions now.",
                    "score": 58,
                    "author": "BasicDesignAdvice",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I cant think of any google product that hasn’t gone to crap over the years",
            "score": 101,
            "author": "pholourie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honest question: is Google Maps not good for many people? I actually think it's far superior than the alternatives.",
                    "score": 63,
                    "author": "ver03255",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah\n\nAlso so much of the content is completely outdated. It's like the internet is a giant landfill of obsolete information and spam.\n\n\n\nI wonder if there is a market for a user-paid but high quality search engine",
            "score": 102,
            "author": "oOMaighOo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would pay. The trouble is there's so much junk out there now, it would be hard to make.   \n\nI grew up using dogpile and askjeeves and stuff, and learned fantastic google-fu. I used to google everything when smartphones came out, like thirty to fifty searches a day. People would ask me something and I could find any answer. Now I sometimes struggle to find basic answers to fairly basic questions and it takes much longer.  \n\nI'll admit I used to write SEO articles and Amazon affiliate linked articles for 1cent/word. I was part of the problem but I needed the money. I wrote entire series of articles on topics I knew nothing about. For example, I've never even held a gun but I wrote 30 articles in one week on various gun related things, and some of them ended up on first page on Google. I apologize.  \n\n Wikipedia isn't even in the top page for a lot of results anymore, it's ridiculous. I have to manually type it. If I search \"running shoes\" then I want the Wikipedia article on running shoes as one of the top results. If I want to buy running shoes I should have to type \"buy running shoes\". It seems like boolean searches are all fucked too. Its all fucked.  \n\nClicker options would be amazing. Filter sales/not-sales sites.  \n\nI just want information about running shoes before I get \"top running shoes 2022\" and \"buy running shoes at target\". Even if I type \"what makes a good running shoe?\" Or \"types of running shoes\" I still get fucking SEO bullshit blogs (written by people who don't know anything) sales sites.  \n\nI don't own any running shoes and I'm blaming google for my poor health.",
                    "score": 54,
                    "author": "TheEyeDontLie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm no SEO optimization expert or anything, but the amount of fucking blog posts I get when looking up stuff is ridiculous. I think the absolute worst offender are those sites that do the \"TOP 10 OF X THING\" that legitimately interests you, but instead of just listing them in order on the page, they use fucking slides. Straight to jail.",
            "score": 97,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "yup. most results are just road maps to point you towards buying something rather than giving you info.\n\nI searched something the other day, dont recall what, something fairly mundane and was hoping to just find intel on it. All google gave me was a bunch of amazon, ebay, walmart, and other big box retail links. fuck off, I just wanted to know about this thing, im not looking to buy shit, if I wanted that I'd use the shopping tab.",
            "score": 430,
            "author": "TONKAHANAH",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree. What's the point of having a shopping tab if everything is shopping? I was trying to find some art images for Easter and, even using the images tab, the first dozen or so results were things for me to buy, the exact same first dozen results as on the shopping tab. \"Renaissance painting crucifixion Jesus\" isn't something I want to BUY.",
                    "score": 153,
                    "author": "Fantastic_Top5053",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1363,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "hit the nail on the head. If it was more user based they would have a system more akin to reddit with how useful/relevant the searched for information is.(not that reddits search engine is good)",
                    "score": 147,
                    "author": "Eazy-life11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Imagine 10 years ago someone said that in the future people would refer to Reddit search as the way to do things.",
                            "score": 34,
                            "author": "AugieKS",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait you’re telling me it doesn’t actually take ten minutes to load a text recipe?",
                    "score": 51,
                    "author": "beeskness420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whenever a page takes forever to load despite just being a recipe/blog post/etc, I always think of this site: \n\nhttps://motherfuckingwebsite.com\n\nShits so bloated nowadays.",
                            "score": 62,
                            "author": "ryecurious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "http://bettermotherfuckingwebsite.com/\n\nalso\n\nhttps://perfectmotherfuckingwebsite.com/",
                                    "score": 25,
                                    "author": "Akayouky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Came here to link those - mother fucking website has the right idea, but half a dozen lines of CSS really make everything a lot more readable.",
                                            "score": 12,
                                            "author": "Yskinator"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol it opens faster than notepad",
                                    "score": 17,
                                    "author": "RrtayaTsamsiyu",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's a great way of putting it. Provider centric.",
                    "score": 70,
                    "author": "HaroldOfTheRocks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The worst is when I’m looking for a release date, for example, and it’s a 5 paragraph article. \n\n“You want to know the date? We’ll tell you the release date. Just keep scrolling past these ads to find out the release date.”\n\nWhole ass irrelevant backstory \n\n“The release date is coming soon. Everyone is excited for the release date”\n\nMore ads\n\n“Now a lot of people wonder what the release date is. Currently we do not have a release date.”",
            "score": 65,
            "author": "navjot94",
            "replies": [
                {
                    "level": 1,
                    "comment": "This right here is hands down the most annoying format and whoever got this to be a thing should have their scroll speed perfectly descreased to 1% of average across all devices.",
                    "score": 20,
                    "author": "no-pandas",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "YouTube search results have gotten bad even faster than Google’s. I’ve played with DDG/Bing and they’re aggressively bad — worse than Google’s declining quality. \n\nOn YouTube I sometimes put in the exact title of the video I want to see and get a bunch of crap semi-related to the video, mixed with a bunch of “because you watched this other unrelated video…” and “rewatch this unrelated one you watched three months ago” and “here’s some conspiracy theory BS because we want your eyeballs for as long as possible on this platform even if you’re hate-watching!”",
            "score": 171,
            "author": "MentalOmega",
            "replies": [
                {
                    "level": 1,
                    "comment": "Youtube basically doesn't have a search anymore. You type in a search term, it shows 5 videos related to that search and then shows lists of \"related\" and \"others have watched\" that are just algorithm outputs and have nothing to do with your search.",
                    "score": 110,
                    "author": "OutlyingPlasma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Youtube basically doesn't have a search anymore.\n\nIt's fucking insane... it's like the UX designer went:\n\n-\"Oh well I *know* you typed something in and clicked search - **but I don't give a shit!** I know you have the memory of a goldfish, so go watch these ad-delivery vehicles like a good boy!\"",
                            "score": 32,
                            "author": "acathode",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, there's a lot of bias and advertising in the results they show.",
            "score": 780,
            "author": "SimoneDenomie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotta love when the first 5 results are advertising. At least they show you they are but still awful none the less.",
                    "score": 274,
                    "author": "IamChooch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The next 5 are just AI-generated, low quality re-hashes of what you're really after.",
                            "score": 50,
                            "author": "sllewgh",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 126,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Many users are having the problem error 506 on Windows 10. But what is solve the problem? Error 506 on Windows 10 is causing many problems in productivity for users of Windows 10. If users of Windows 10 encounter error 506, it is common they will not be able to do their work. If you encounter error 506 in Windows 10, here is a solution.\" Followed by some obviously scraped info from a better source, most likely translated back and forth until it's gibberish, and which never has an actual solution. Also, the website has some vaguely relevant name and appears to have been entirely constructed by a shitty algorithm for the purpose of copypasting random tech articles.",
                                    "score": 19,
                                    "author": "dlgn13",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And there are obvious clickfarm sites that have a bunch of words in vague sentences but don't really say anything.  I wish there was a convenient way to downvote/report search results.",
                    "score": 30,
                    "author": "dan1101",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "SEO has become completely fucked in the last 4 years. \n\nThat feeling of dread as you look over 24 shitty corporate auto-generated useless and irrelevant results didn't always happen before. \n\nGoogle search has lost it's way.",
            "score": 137,
            "author": "exemplariasuntomni",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rather, Google search got reverse engineered and people will just engineer bullshit pages to ensure their result is first.",
                    "score": 28,
                    "author": "quick20minadventure",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's actually becoming commonplace to enter \"[search term] reddit\" because while reddits own search engine is horrendous, typing reddit after your search term will give you a few threads of people discussing the thing you are googling, which gives you a pretty good start usually.",
            "score": 160,
            "author": "Jacollinsver",
            "replies": [
                {
                    "level": 1,
                    "comment": "It pisses me off that I’ll google a question and nothing relevant comes up, I add “reddit” to the end of it and suddenly there multiple people asking the same question verbatim. Google clearly found results matching my search but I have to jump through hoops to get them.",
                    "score": 71,
                    "author": "RomeTotalWhore"
                },
                {
                    "level": 1,
                    "comment": "The one time where two wrongs make a right lol",
                    "score": 52,
                    "author": "PizzaInteraction"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it that google is worse, or the internet as a whole is worse?\n\nBack in the day, if I searched a programming question, I'd have a couple of pages of programming-oriented forums to browse for help. Similar for most other kinds of question really. \n\nNow I have to conscientiously ignore anything other than Reddit, StackOverflow, and a few others because its all consistently barely comprehensible spam with some keywords sprinkled around. Otherwise its content from one of the handful of useful sites that has been copy-pasted. \n\nI'm complaining about programming resources, but it's 100x worse if you're looking for any kind of product reviews. These pages feel like they've been generated by GPT-3. There's like a hundred thousand \"Top 10 Running Shoes for 2022\" pages, and they all read like \"These shoes go on your feet, and provide cushioning for long runs\". Product reviews on the internet have always been questionable, but it's never been as awful as it is now.",
            "score": 430,
            "author": "PeterIanStaker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is it. The Internet is literally flooded with search-engine-optimized half-baked content that buries all of the real stuff.",
                    "score": 245,
                    "author": "Echo127",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well.. in my experience, you're not wrong. In most SEO projects I worked with, the first thing they change are metatags to get more relevance in the searches, and only then at some point - if ever - they actually change the content of the page.\n\nYounger people have an understandably (negative) bias towards ads, but truth is organic can be as bizarre. A top page isn't necessarily the most relevant, even though Google does try to do that with their updates (like putting a heavier score on users' experience on the pages, instead of just click rates), instead.. what happens most of the times is the top pages are the most *optimized* ones.",
                            "score": 43,
                            "author": "dogs_drink_coffee",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah Google results are full of seo blogs",
                    "score": 74,
                    "author": "aurochs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I work for a large company that maintains a blog virtually for the sole purpose of feeding SEO terms to Google. If someone happens to actually read it, that's a nice little bonus surprise.",
                            "score": 54,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work for a niche news organization and SEO has been part of our strategy for years. I'd like to believe we're offering answers to searchers' questions as part of my job for the better part of a decade has been search analysis and making sure we're answering the questions people in our industry are asking. I know all too well how frustrating it is to hit the first result thinking you're about to get your search question answered and finding only a wasteland of tangential, poorly-written content that should be buried 10 pages deep. I've worked for pubs just juicing results and spitting out content to flood results, and also did a short stint writing clickbait (more like Top 10 bullshit, not actual clickbait) which was surprisingly ethical as the editorial standards were high and articles were well-researched with sources.\n\nIt's a fuckin jungle out there and has changed so much since I got my start in the mid-2000s. When I started doing SEO back then yeah there was an element of gaming the system but the results were far more relevant than now and optimization was more about ensuring good content got seen, not forcing bad content to the top (although that certainly happened back then, too). Idk if it's that Google has slipped or moreso that too many crap outlets have figured out how to manipulate it. Google is always changing the algorithm around to mitigate the latter but it doesn't seem to be doing much good. Supposedly Google has been trying to prioritize higher quality content in the last few years, it has always claimed to but you don't have to be an expert in it to know that to be untrue.",
                                    "score": 26,
                                    "author": "glazedhamster"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Is it that google is worse, or the internet as a whole is worse?\n\nSEO made the whole internet experience worse.",
                    "score": 55,
                    "author": "despicedchilli",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SEO share some of the blame, but a lot of it is just Google having become more shit as well. \n\nGoogle is not a search engine company - Google is an ad-company that have a search engine which they use to display ads and harvest user data to optimize the ads they show. \n\nGoogle has become *a lot* more aggressive in directing you towards shops and commercial sites... \n\nGoogle used to be proud of their ultra clean search results, with the most relevant results at the top and nearly no clutter. These days, do a search and you get bombarded with 20 image results, a map showing 5 nearby shops which might be somewhat relevant, a few sponsored ads, and then finally a sorry list of barely relevant search results. \n\nGoogle has also become absolute shit at finding anything remotely old/niche thing - Google look way, way to much at what is popular with the general public right now. For example when you remember an old news article from 8 years ago and try to find it again, Google just won't serve it to you even when you're very specific - instead you get pages upon pages with current news articles that barely have anything at all to do with your very specific search, just because everyone is clicking those current day headlines and no one are viewing the article you're trying to find.",
                            "score": 20,
                            "author": "acathode"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The worst is when you scroll down to a result on a forum, click on it because someone had the same question, and the first, highest-rated response is “why don’t you google it?”",
                    "score": 46,
                    "author": "CatastropheWife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They, and the people who answer things like: “I don’t know, lol, good luck” have a special place in whatever hell equivalent they have in their religions.",
                            "score": 34,
                            "author": "IAmKermitR",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Or a single response that’s just “Closed. Please use the search function before creating duplicate threads”\n\nIf duplicate threads were such a problem, why is this closed thread the only one I find?",
                            "score": 17,
                            "author": "alienith",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hasnt been fast. the slide probably became noticable around 2017 for me. \n\nthere was a similar transition on amazon. a lot of products were made by name brands. then fully random chinese-named brands took over. and there are often no clear long-term best options in any category (im\nmostly buying construction tools, electronics accessories, scientific equipment).\n\n(not to say chinese manufactured goods arent fine. they can be best in class. it's the chaos and constant change that's problematic. amazon could curate the best laser level and have the price decrease over time on a solid design. instead it lets twenty no-name brands compete against one or two name-brands in the low-cost class and nothing is accomplished over 5 years. likewise the best answer to a question on google is often known, and was established years ago -- but gets buried with time rather than curated.)",
            "score": 65,
            "author": "ajtrns",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I feel like Amazon for most products now is 700 pages of what is obviously the same cheap single design rebranded by dozens of no-name resellers. It's got really bad illusion of choice.",
                    "score": 29,
                    "author": "chrom_ed",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Google image search used to show full pictures in a non-potato resolution. Now you have to go to the page and hope the picture is actually on it. \n\nThe fact the internet has become less useful over time frustrates me endlessly.",
            "score": 19,
            "author": "Bonny-Mcmurray",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What tanked google is the fact that the web is hardly a web anymore. The Google pagerank algorithm worked based on ranking a page higher as it had more incoming links of higher quality.\n\nBut websites rarely link each other anymore, which makes determining relevance harder.",
            "score": 201,
            "author": "Martissimus",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 64,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Might explain why reddit comes up so often bring a link aggragator n all",
                    "score": 37,
                    "author": "iBleeedorange",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. Ive been annoyed enough I use it much less. No point in wasting my time to not find what I'm looking for. I miss the days before money ruined the internet.",
            "score": 20,
            "author": "WomenAreFemaleWhat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes apart from ads, they changed the algorithm from matching your search word for word as best it could to a neural network scanning it and deciding that you probably meant something else that is more popular and more people search for. https://blog.google/products/search/search-language-understanding-bert/",
            "score": 113,
            "author": "Strelochka",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recently searched carton and all the results were for cartoons. It didn’t even ask if I meant cartoons. Like if I wanted to know about cartoons I would have searched cartoons, google",
                    "score": 45,
                    "author": "MuteSecurityO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recently got a lyric stuck in my head but couldn’t remember the song, it was not a typical “love you baby” lyric but since the word “faithful” was in it google gave me only religious material. Had to use quotation marks to find the song, and I remembered it word for word",
                            "score": 21,
                            "author": "Strelochka",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The ads at the top of the search result are almost always scammers disguised as real websites too!! They are super realistic sometimes and genuinely hard to distinguish from the real ones like Amazon, Microsoft etc",
            "score": 17,
            "author": "evil-morty19",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They also changed their category system. Earlier it used to be something like web, images, videos, news\n Now depending on what you search, they don't appear in that same order. Also in image seaech, we cannot see the resolution of images in the thumbnail. And search by resolution and larger than a particular size is hidden deep.  \n\nBefore it was very quick. \n\nThe ads have gone out of hand. Watch a youtube video and get bombarded with ads like you are watching TV. \n\nAds in news pages are everywhere. \n\nNot just google but internet is becoming a very messy place.",
            "score": 75,
            "author": "AbhiFT",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah I always just add reddit at the end now. it's annoying. I hate Bing and duck duck go and yahoo is there anything else?",
            "score": 17,
            "author": "mysticaltater",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Since YouTube is owned by Google, I'll include them in this too. Searching for a video? Here's 5 results that are loosely based on what you searched for from a couple massive corporate channels and here's 50 results of random, completely unrelated videos that have been popular lately. After that, here's a long list of completely unrelated videos from your viewer history.\n\nA search system made to show you things that you didn't search for at all is just useless. I just don't understand why they decided to cripple their own search capability like that.",
            "score": 16,
            "author": "IAmA_TheOneWhoKnocks",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Back in my day we used Ask Jeeves! And we were happy it didn’t require as much prissy formatting as Ebsco Host!",
            "score": 97,
            "author": "ubiquitous-joe",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes. YouTube search is even worse. I'm no longer able to find useful videos and I don't know of an alternative.",
            "score": 13,
            "author": "MorboDemandsComments",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah. There's a lot of useless pages with good SEO that waste space at the top of results. Like I was googling for why a certain game was crashing and first bunch of hits were these useless articles saying like \"disable your antivirus\", \"update your drivers\", etc. Just really generic stuff with the game's name in there.\n\nUsually searching for reddit or other specific sites you know are good works better.",
            "score": 57,
            "author": "aseriesofcatnoises",
            "replies": []
        }
    ]
}