{
    "id": "11f7uoe",
    "score": 4,
    "title": "Potential Psych Transfer",
    "author": "Drama-Sensitive",
    "date": 1677687387.0,
    "url": "https://www.reddit.com/r/csumb/comments/11f7uoe",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I’m going to be transferring in Fall of 2023 as a psychology major. I’m still deciding between Monterey, Channel Islands, and Pomona but was leaning towards Monterey. What has your overall experience been like at the college and is the psychology program good here?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm a psych major, transferred here in Fall '22. I like the small class sizes, and the psych professors I've had have all been pretty great educators. I'm not too sure how many research opportunities there are, but there is an undergrad research center. The school is small, but there seems to always be something going on. It's in a quiet and sleepy town, if you're transferring from a bigger city/town then it can be off-putting. I think it's a good school for the price.",
            "score": 4,
            "author": "anon_scum",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your response! I will keep those things in mind when making my final decision. I’m glad they have a research center because that is something I would like to do to have a better chance of getting into grad school\n\nEdit: spelling mistake",
                    "score": 2,
                    "author": "Drama-Sensitive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a psych major transfer spring 22, and the professors are definitely great",
            "score": 1,
            "author": "VirtualAlgae1545",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s great to hear I’m glad the professors good!",
                    "score": 1,
                    "author": "Drama-Sensitive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a psych major but I transferred Fall ‘22 and all educators I’ve spoken to in both GE’s and major specific classes have been absolutely phenominal. Also due to the small size of the school you get to know people pretty quick. I’d say every class I take has at least 5 people I already know. Number is like 50% in major specific classes. Living accomodations are pretty good all around for transfers, you have a pretty good amount of options. Also as long as you’re actively looking it’s pretty easy to find internships and research opportunities, local employers (especially local small businesses) are very active with CSUMB and love getting students involved in their work. \n\nEdit: It may just be my degree (ENVS), but I think a large majority of the people I talk to in stem at MB are planning on going for their PhD sometime in the future, so Im sure you wont be alone in your search for research opportunities",
            "score": 1,
            "author": "ducatibr"
        },
        {
            "level": 0,
            "comment": "If you like nature CSUMB is the place to be. Night life isn’t too crazy here if that’s important to you",
            "score": 1,
            "author": "benped19",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like to go to bed early and like going on walks/hikes so that actually sounds pretty nice",
                    "score": 2,
                    "author": "Drama-Sensitive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s an infinite number of hikes around here so I’m sure you’d love it",
                            "score": 1,
                            "author": "benped19"
                        }
                    ]
                }
            ]
        }
    ]
}