{
    "id": "11z7ndl",
    "score": 3,
    "title": "Minor question",
    "author": "Critical_Courage_348",
    "date": 1679542981.0,
    "url": "https://www.reddit.com/r/csumb/comments/11z7ndl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is the campus pretty walkable? Hows the food overall? Is there a student gym? Anything or anywhere that over/underrated?\nJust any general advice or tips would help for incoming fresh.",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve found the campus to be pretty walkable overall, sometimes the distance between the classes can be a bit much but nothing unmanageable. There is a gym but I haven’t checked it out yet so I can’t speak to its quality. As far as stuff to do, there’s really not much besides the touristy stuff in Monterey or going to the beach. Sometimes there are some music events put on by the MPA students and stuff but overall it’s pretty dead. There are parties on and off campus too but in my experience they’re usually nothing too crazy either",
            "score": 2,
            "author": "tgthememe"
        },
        {
            "level": 0,
            "comment": "Campus is small enough that riding a bike across campus was a lot of hassle for next to no time saved. There is a chance that you'll have a class near the police station (between the gym and main campus) and then another class up 2 hills away right after (between the library and bookstore). That's not walkable in 15 minutes but frankly it's not that bikable either. Other than that once you're on campus uou can reasonably get wherever you want in under 10 minutes. \n\nI'm not a gym rat but the gym is pretty good. Lots of weight stations and exercise equipment. \n\nThe food isn't great. Or it wasn't 3 years ago. Bring pepto.",
            "score": 1,
            "author": "Xaron713"
        },
        {
            "level": 0,
            "comment": "Gym rat here, gym just got renovated so the equipment is alright but its way too small and the hours suck pretty bad. The squat racks/bench pressed are combo racks so it can be hard to get an open one even when its not busy. Also closed when there are game days and the parking lot is tiny so its full basically the entire time the gym is open. If you’re able to drive id highly reccomend in-shape, its like $15 a month and the facilities are pretty good. DO NOT GO TO ANYTIME FITNESS. Its a total rip off despite how close it is to campus. Smallest gym ive ever been in, no facilities, and its STARTING price is $42 a month per person with a minimum 6 month commitment.",
            "score": 1,
            "author": "ducatibr"
        },
        {
            "level": 0,
            "comment": "I noticed a lot of kids on skateboards but it’s manageable even for an old mom like me. I look at things like the slope and hills for difficulty (eg UCSanta Cruz). MB has mild slopes. Definitely doable.",
            "score": 1,
            "author": "Dramatic_Ad3059"
        }
    ]
}