{
    "id": "13y1gj0",
    "score": 4,
    "title": "Computer science classes",
    "author": "rekcivs",
    "date": 1685675289.0,
    "url": "https://www.reddit.com/r/csumb/comments/13y1gj0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone, is there any previous computer science students who have graduated or are almost graduating willing to help me with something. I am transferring into csumb as a junior for computer science with a concentration in software engineering.  Does anyone have recommendations on what classes to take together or take first with what professors? Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Am also transferring in CS too (in the fall), but am doing the game development concentration. If anyone has any recommendations, I would also like to hear them.",
            "score": 3,
            "author": "Thelm900"
        },
        {
            "level": 0,
            "comment": "I'd just recommend taking Internet Programming before Software Engineer cuz Software Engineering uses react with going over it too much, but if you're not planning on taking Internet Programming you should still be fine. Also good take Algoritms early, it has a lot of important conceptual stuff. It's be good to take OS before Intro to Networks(if you're planning o taking Networks) because there's a lot of overlap, and OS covers some things like concurrency and scheduling better. I liked Dr. Bruns and Dr. Islam for anything, Mr. McCann for networks, and Paige for pro seminar. Dr. Gross and Clinkenbeard are also good but generally dont teach upper divs. There are lots of newer professors I don't know much about. Beyond that I'm not too sure, could change based on what classes you're interested in.",
            "score": 2,
            "author": "devdeltek",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was planning on taking networking this semester, I might wait on that. But I hear the internet programming professor is good too.",
                    "score": 1,
                    "author": "Thelm900",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly if your familiar with basic networks stuff you'll be fine. I didn't know anything about networks beyond what an IP and a port is, so all the conceptual stuff was hard for me and the things taught in OS helped a lot. If you're good with networks you'll be fine tho.",
                            "score": 2,
                            "author": "devdeltek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All I hear about OS that is hard, but I really low level programming an concepts like multithreading, I wanted to take it my first semester",
                                    "score": 1,
                                    "author": "Thelm900"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All students have an academic advisor who will be communicating with you regarding the classes you will want to take. All majors also have pathways to degree with a list of classes by semester you would want to take to graduate in a timely manner. \n\nIf you are attending orientation in June (for freshman) or July (for transfers) you all will be in rooms with your advisor giving you information on the classes you want to enroll in your first semester. Students never have to figure out their classes on their own...there are staff and systems in place to help with this.",
            "score": 1,
            "author": "winlock"
        }
    ]
}