{
    "id": "3la21i",
    "score": 2,
    "title": "I was conditionally accepted, paid my non-refundable enrollment fee, and the next time I logged into my dashboard, it said my application was declined for not meeting transfer requirements.",
    "author": "Tostecles",
    "date": 1442477993.0,
    "url": "https://www.reddit.com/r/csumb/comments/3la21i",
    "media_urls": [],
    "other_urls": [],
    "postText": "So not only do I have my AA from my community college, but I was already conditionally accepted just a couple of days go! I paid my enrollment fee right away and made sure it was received using the instructions on the site- I even took a screenshot of it. What do I do now? I'm not worried about the money, even though them taking my money and THEN denying me is absolute nonsense. What do I do about getting in? I shouldn't have to submit an appeal for this, should I? I don't know what to do but I'm downright angry.",
    "comments": [
        {
            "level": 0,
            "comment": "Have you called the Admissions office?  831-582-3738\n\nThe confirmation payment isn't due until much later so you could have held off paying until you knew you were accepted for sure.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well they way they word it the conditional acceptance is based purely on paying your fee since they've already determined you meet the requirements for transfer, so I wanted to get it in as quickly as possible. I've been very punctual and efficient with the whole application process so this is absolutely infuriating. I called the admissions office and they tried to transfer me to the person who evaluated my application but they're not there. Hopefully they'll call me back like I asked. In the meantime I'm stewing in frustration and panicking.",
                    "score": 1,
                    "author": "Tostecles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're usually really good about calling people back.  I understand that it may have seemed like Conditional was just a formality but they have to verify your transcripts against what you said on your application.  If there is any incongruity then that can be a problem and cause a denial.  Best to wait to hear back from the transfer advisor to find out why they would deny you and then see if there is a way to make up that requirement and/or correct any mistakes made during your application review.  If you have an AA its hard to understand why you wouldn't be let in. ",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It turns out I somehow got my AA without getting enough transfer requirements. I got my AA with 56 out of the 60 transferable credits I needed. I have no idea how the fuck that happened.",
                                    "score": 3,
                                    "author": "Tostecles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thats just crazy",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The guy I talked to at CSUMB told me I should take online courses at BYU (that Mormon university) to make up the credits and submit an appeal and MAYBE I'll get in. :/",
                                                    "score": 1,
                                                    "author": "Tostecles",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Gotta do what you gotta do..",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CSUMB declared \"impaction\" meaning over enrolled classes,  they thus can have stricter rules for accepting transfer students.\nWhats your proposed major?",
            "score": 1,
            "author": "NoMansLandsEnd"
        }
    ]
}