{
    "id": "667ynk",
    "score": 2,
    "title": "How are the LLPs? (Living Learning Programs) Which one's the best?",
    "author": "senmonka",
    "date": 1492574783.0,
    "url": "https://www.reddit.com/r/csumb/comments/667ynk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming undergraduate. I'm finishing up my housing application right now and wondering if I should live in one of this cohort's or not...",
    "comments": [
        {
            "level": 0,
            "comment": "oh also how does gender inclusive housing work? I'm cool with living with the opposite sex (shared rooms with sibling all my life) but do they actually try to do this?",
            "score": 2,
            "author": "senmonka",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you selected you're okay with gender inclusive housing, you may be put in a room/suite with people of the opposite gender.  I'm guessing you're gonna be a freshman and will go in the dorms? I've never seen gender inclusive dorms (just one big room) , but I've seem it in the suites/apartments where there are seperate rooms.",
                    "score": 1,
                    "author": "runhigher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Almost nonexistant for me and a few other people I know. I selected the environmentmental sustainability cohort (environmental science major here) for my freshman dorms expecting I'd be surrounded with like minded people, learn about environmental issues and possibly get connected with networking opportunities. I only knew one other person on my floor who actually selected our floor for the LLP. The rest for the most part were just randomly added. My roomate got placed in there halfway through the first week of school because there were a lot of empty beds. The LLP is run by your RA. All that happened was that she invited one of her environmental studies friends to talk about climate change in the lobby. This occurred twice- in the entire year. My RA also tried to plan a floor hiking trip, but there was hardly any feedback to do it. That was the extent of the LLP program experience for me. \nNow, your experience might vary due to how committed your RA is to their job and how much people actually care about being in a LLP. But it does not compare to universities that will have separate housing by different themes and make you take a class on that theme/ make you get super involved. People don't select housing here based on their majors/interests.\nTldr: I'd say it's worth it, as it's a tad cheaper than living in other floors but with an identical experience.",
            "score": 2,
            "author": "runhigher"
        }
    ]
}