{
    "id": "87vuby",
    "score": 1,
    "title": "What's the graduation ceremony like?",
    "author": "noboruwatayasear",
    "date": 1522273315.0,
    "url": "https://www.reddit.com/r/csumb/comments/87vuby",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just like the title says. I'm wondering specifically about what goes on during the ceremony and how long the ceremony is.\n\nEdit: Forgot to add, I'm in the College of Arts, Humanities and Social Sciences but if you have any general info that would also be appreciated. ",
    "comments": [
        {
            "level": 0,
            "comment": "Also wondering this (college of Science)",
            "score": 5,
            "author": "carveit3"
        },
        {
            "level": 0,
            "comment": "It's a couple hours. But it's fun. It was foggy during mine, so it wasn't terribly warm/sunny. When the graduates were getting ready to file in, about half a dozen of us MSci kids had champagne. Got through most of it, then it was taken away :/ The talking was neat, but the names took a while. Got the diploma cover, shook hands/hugged professors. Good time. Took a couple pictures with people. Left. I had dinner at my brother's house.\n\nBring water and sun screen. Especially if you're gonna wear nice clothes underneath the robe which I didn't. Also, sun glasses. Still bright with fog.",
            "score": 2,
            "author": "bearmanthing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for the information, this is exactly what I was looking for!",
                    "score": 1,
                    "author": "noboruwatayasear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "De nada!  There's a thing that you should go to before commencement, they'll send an email about it.  It's about 20-30 minutes at the track field.  I HIGHLY recommend going.  It's voluntary, but can answer a lot of questions you might have.  They'll hold a Q&amp;A afterwards so you can hear questions other people might have and ask your own.  I can't remember how much before it was, probably 1-2 weeks prior, but go to it.  If you have class/job/busy, as a friend to go and let you know what's going on.  Buy them a beer for it as it's great information.",
                            "score": 1,
                            "author": "bearmanthing"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You lay in bed and watch the ceremony from your phone because parking is hell, you live off campus and you dont care enough to sit in the sun. ",
            "score": 2,
            "author": "ragmondead"
        }
    ]
}