{
    "id": "ax2d8l",
    "score": 7,
    "title": "Got accepted to CSUMB, Is it really worth it?",
    "author": "[deleted]",
    "date": 1551670137.0,
    "url": "https://www.reddit.com/r/csumb/comments/ax2d8l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I’m a high school senior currently and I Got accepted pretty early around November - December and with a limited number of Cal states I applied to because of my low GPA, I was mostly considering community college or a Cal State.  I already got accepted to CSULA and CSUMB while waiting for CSUN and CSUF. As a film/cinematography major, CSUN is a top 25 school in film and I know for a fact I will get rejected from that school without a portfolio or any real work to show I belong in the program, unless I change my major as undeclared for CSUN.  My GPA is too low for CSUF so it’s highly unlikely I will get accepted, and Cal state La is not for me as I don’t see my future there at all(only 10 minutes away). I never really considered CSUMB until recently. So I wanted to ask, is CSUMB an overall good school and environment? Do they have a good film program? Is the tuition just right for the quality of education you get there? Be realest as you can be. Considering I live in La, moving to Monterey and investing my time and money for 4 years at a school I know little about and go into a program I don’t even know if it’s legit can be very intimidating. Reading countless reviews and YouTube, I really have mixed feelings. Some people say it’s very depressing, while some people love it. I personally think it looks like a nice campus environment but many say it’s always foggy and it’s not as nice as it looks online.It would be nice to move away from home, but going to a school all the way up north just because of that reason alone is immature. I was very clear from the beginning I was go to CC because it would be inexpensive and I can also work to save money, but since looking at the school, I really want to experience life elsewhere other than my hometown in Los Angeles. So, is it really worth it? I’d appreciate the feedback :)",
    "comments": [
        {
            "level": 0,
            "comment": "If I were you I’d go to community college, work you ass off to get the GPA and build a portfolio, and transfer to whatever school you want then. It’s cheaper, and no one cares about your highshool GPA when you’re a two year transfer. Most of the classes you’d take in your first two years aren’t for your major anyway, it’s all for general ed. \n\nEdit: Hang in there for two more years, you will still get the college experience in your post transfer years. ",
            "score": 5,
            "author": "karenerer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely sound advice, but knowing a lot of transfers, they felt like they missed out on the \"college experience\" and found it more difficult to make friends.  A lot of the rowdiness and partying dies off for upperclassmen because of school work and other responsibilities.  But yeah, grades and future are more important than partying, etc.--just thought I'd throw that out there.\n ",
                    "score": 3,
                    "author": "a_cef",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, yeah, i guess i was going based on my own experience. I wasn’t much in it for the party scene anyway, and I found friends fine. *shrug* ",
                            "score": 1,
                            "author": "karenerer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who went to a CC out of college I have mixed feelings about it. On one hand, I have saved so much money and essentially cut the loans I need to take out in half. On the other hand, if you are indecisive in where you want to go or if you have some life changes like I did during CC, it can take a lot longer than the 2 typical years.\n\nIt took me 4 years to get through CC (2 years at Santa Rosa JC, 2 years at Cabrillo College near Santa Cruz) mostly because I was trying to get into the UC colleges the first couple years but it just didn't pan out, stupidly I did not apply to CSU's the first time because I really thought I'd get into at least one of the four UC's I applied to.\n\nMy biggest regret about going to community colleges is how long it took. Your mileage may vary, I was a computer science major and was aiming for the UC requirements which are much higher than most of the CSU system. \n\nThe social aspect is another thing to take into consideration, as I found it extremely hard to make friends at both of the CC's I went to and at CSUMB I find it really easy. \n\nThat said, if saving money is a priority for you, I would absolutely go with a community college. Play your cards right, go to advisers early, and you most likely can move on from the CC in 2 years.\n\nAs far at CSUMB itself goes, I think it's a good college. It's still pretty new and is experiencing some growing pains, but the instructors are good and approachable and really want to see you succeed. \n\nThe campus is foggy a lot of the time but when it's sunny out it's really nice. It's built on an old military base and though you can't really tell from most of the campus if you go to the edges it starts to become apparent.  \n\nAlso there are a lot of people from SoCal here, not sure if that matters to you or not! \n\n**TL;DR:** it's a good school and I would recommend it, and while community colleges definitely have some downsides I would seriously consider them. \n\nSorry to ramble a bit but I hope this was helpful, let me know if there is anything else I can help with! ",
            "score": 4,
            "author": "strikewolf42"
        },
        {
            "level": 0,
            "comment": "I liked CSUMB.  I met so many cool people many of whom are my best friends today.  They do have a lot of wonky instructors that are very \"social justicey\" in classes general ed. and classes outside your major, but I figure thats most public universities today.  In your decision of whether or not to go to CC or CSUMB, I'd weigh the \"college and dorm experience\" and living out on your own vs. cheaper and better quality general ed at a CC.  I had a blast my first two years living in the dorms and meeting people.  To me, that was more valuable than the education.  It's not that depressing lol.  I was pretty outgoing and met a lot of people quickly.  I do know a few film major that did well after film school, and they were very passionate about their work.  Whatever school you do go to make sure to give it your all and start developing relationships with professors early.  If you any other questions let me know!  I'm not too sure about their film program though, I was a different major.  I can def help with questions about the area, culture, vibe, living, etc.",
            "score": 3,
            "author": "a_cef",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this comment. CSUMB is what you make of it. The town is amazing, and tons of opportunities to get involved with smaller local things going on that are harder to get established into in a big city. Beautiful surrounding area and decent off-campus activities year round. Getting involved with clubs and other groups on campus is key to enjoying your time there. I lived on campus the first 2 years and met a ton of great people who are still my friends today. \n\nI started in film but changed major to communications. I have friends whoever who graduated from CSUMB in film and moved to LA and are still working in the industry. Like others have said, it doesn't make a difference in the entertainment industry what school you went to. It's what you put in as far as hard work and talent and mostly what connections you have so you can get time working on well-known projects. Either way, no matter your major or career path, just sticking to something, dedicating yourself and being passionate and involved in your work and the work of those around you is what leads to success. Best of luck. ",
                    "score": 2,
                    "author": "Tokacheif"
                },
                {
                    "level": 1,
                    "comment": "Haha thanks for the feedback! For living on campus in the dorms how expensive was it for you? Do they have good financial aid? ",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Prices should be online.  I lived in the area 1 dorms (Cypress, Asilomar, etc) those were the best IMO.  Good central location, everything walking or skating distance. They were old officers HQ and were indestructible with concrete walls haha.  I know now they do have more expensive options now. \nAs for financial aid yes, but this will probably depend more on your financial situation. ",
                            "score": 1,
                            "author": "a_cef"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And how’s the party scene considering it to be a small school? I’m not much of a party person but it’d be nice for a school to have a good social environment.What clubs did you do or recommend if any?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s no UCSB, and definitely not a “party school”. But if you want to party it’s there for you. Mostly house parties, my freshman year 2011/2012 there were plenty of house parties on Thursday, Friday, Saturdays.  By sophomore year my friends threw a lot of parties too.  I never joined any frats, not my style.  I wasn’t consistently involved in any clubs either.  I just looked online for their clubs and randomly showed up if one interested me.  I did Otter Christian Fellowship for a semester and did a rock climbing trip with the Outdoor Rec club.  \nMy advice for getting into the social scene at any college is finding a wingman or posse quick, maybe roommate, neighbor, someone you meet.  And really put your self out there the first few weeks. Talk to people at meal times, “hey do you mind if I sit with you guys?” Or in class, and branch out from there.  ",
                            "score": 1,
                            "author": "a_cef"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CSUMB is not a good school for film. I went there for a few years and ended up leaving it for another university. They don’t have the technology that makes film school worth it. The value of film school is having hundreds of thousands of dollars worth of equipment to use and learn from industry standard stuff. CSUMB doesn’t have that. It’s also very isolated so it’s difficult to find good actors and make decent connections. \n\nI highly advise not going to CSUMB for film school. ",
            "score": 1,
            "author": "plasticrubbish",
            "replies": [
                {
                    "level": 1,
                    "comment": "I must disagree. Much of the film industry is who you know. In my opinion of the film program at CSUMB they supply you with all the equipment and industry level software you’d need to make a worthwhile film. ",
                    "score": 2,
                    "author": "PDX_Benji",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the film industry is definitely who you know, which is why a place in the middle of nowhere isn’t good for film. CSUMB most definitely does not supply you with all the equipment at an industry level. We don’t have a Davinci Resolve Suite for learning color grading, there’s no class based around learning to use film, we don’t have ARRI and I think we have like one RED. Instead of buying more cameras for cinema they bought a bunch of cameras for documentaries. \n\nThe program saw a bunch of administration leave a a few years back. There’s barely even a film program there. There’s no connections or opportunities for good industry placement.\n\nI’ve been to two film schools and can 100% say with confidence CSUMB is not good for a film school. \n\nAlso, making one proper short film as your capstone is not enough experience. In my three years at another film school I made two narrative films, a documentary, and a music video for assignments, plus was given the opportunity to make a bunch more outside of what was assigned. ",
                            "score": 2,
                            "author": "plasticrubbish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd beg to differ. Even if the film equipment at the school is limited, that shouldn't waiver in your passion nor in building connections. In addition, CSUMB is not just a film school so it's fair to understand they can't supply millions of dollars of equipment to students within one major, who don't have the knowledge or experience to handle it safely. CSUMB if anything, is an avenue to connect you to grad programs or to actual film schools such as Full Sail University or whatever after you graduate. I plan on going into grad school as well as another film school after I graduate because I know other schools can offer more but CSUMB is a great place to start and see if film is the path you want to enter. There's also the UROC program with an Arts department, I personally only recently learned about it but it prepares you for industry level things and connects you to those in the industry. \n\nI would find it irrational to expect a university of CSUMB'S age to have, like super fancy gear plus keep in mind it is a CSU not UC so, it's not like they're swimming in money. Yea there may not be many actors in the area so what, be your own actor in your own film. Make your friends be in your films, ask a random person, find people instead of them finding you. There's not enough equipment or \"fancy\" enough equipment, save up for your own or advocate for a fundraiser. If you wanna network then network, no one is gong to walk up and say\"hey I'm that actor that your were thinking of for your project\", networking comes from meeting those who are in the industry but also through connections made in general. O met a guy that works at Disney who happened to be the dad of a student I was helping. I helped a resident move in and his mom is in the music industry.  I have a close friend who has his own business, not a film guy bit through him I can see how marketing and \"businessy\" side of things work because there are things about business that CART department wont teach you directy. So you never know. despite the school's status, the people in it are what really matter.\n\n&amp;#x200B;\n\nThey showcase senior films every year, why not see if they can do a type of fundraiser to raise money for the department. My point being that no matter what you are doing in life, things will be limited in some way or form. You have to be willing to work to get what you're after. Irregardless of what other places say, CSUMB really is what you make it and if you're looking for a place to provide with the most stunning items right from the start and the big wigs behind all these major industries, then you're gonna be disappointed always because no where in life I think, you should be given the best first, you work your way up from the basics and earn the best and use it with the skills you have gained. And if someone is offering you something too good to be true, then it probably is. \n\nWhether you're a CART major or a different one, the opportunities are there, you just have to be willing to look for them, as I said there's UROC, Pixar offers internships to cart majors, CART professors mentor students and connect them with those in the industry and literally send emails of film festivals in the area for CART majors to check out. \n\n&amp;#x200B;\n\nOne of my professors, Irwin Swrinoff would literally travel to and  from his place in SF just to teach everyday at CSUMB. That's wild to me, he enjoyed teaching here and made it work. Idk his reasoning for traveling that far, I'm from Oakland and the travel by train is long and tiring, but he does/did it and that to me says that there is something here that I want to be apart of. Idk, I just know that becoming a CART major really changed my life and it wasn't because I was networking or high grade equipment, it was just the people and the passion that drove them. It's what inspired me and if that isn't true for you then maybe CSUMB isn't the right fit because majority of those I have met are just as passionate or willing to work their way up in respect to their majors. Anyway, that's my submission for Biggest University Advocate or whatever, I just wanted to share my pov on the film department, I dont frckn care what ya do",
                                    "score": 1,
                                    "author": "father_boogaloo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Everyone's experience is different, and that's okay!\n\nBut the first bit of this doesn't make too much sense to me. The university I graduated from also didn't only do film and we got industry standard equipment. Also, expecting them to not let us use to notch gear because we don't know how is silly...it's school, they're supposed to teach us how to use the equipment. \n\nIf someone is really passionate about studying film and CSUMB is their only option, then go for it! But generally I'd advise against it. \n\nI'm glad you had a good time at that college and it changed your life for the better! It wasn't a good fit for me so I left and found one that was.",
                                            "score": 1,
                                            "author": "plasticrubbish"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I’d agree here. You have to be very motivated at CSUMB. The culture there isn’t very “academic”.  OP, I’d go to the best school possible, I was weighing your choice on CC vs 1st two years at a 4 year.  ",
                    "score": 1,
                    "author": "a_cef"
                },
                {
                    "level": 1,
                    "comment": "What school did you go to for film?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I ended up going to a school overseas. ",
                            "score": 1,
                            "author": "plasticrubbish"
                        }
                    ]
                }
            ]
        }
    ]
}