{
    "id": "g18sq6",
    "score": 6,
    "title": "Transfer Student",
    "author": "jazzstech",
    "date": 1586881969.0,
    "url": "https://www.reddit.com/r/csumb/comments/g18sq6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! \nI’m currently a student at the University of Minnesota  but am considering transferring to CSUMB next year for a semester. There’s a program within our colleges called NSE, this program allows you to study at another campus for a semester! \nJust curious what you all think of CSUMB and if you’d recommend your school? If not CSUMB, I’m thinking somewhere in Hawaii, so your feedback is important!!!\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I did that program while I was in CSUMB, and went to West Virginia university. \nI went because it was the #1 party school in the nation that year. Terrible mistake. \nChoose based on location. What is a place that you’d be comfortable at without having friends there. Cause that’s how it will be for a short while until you get your social group up and going. CSUMB is great for that, with the exception that having a car is pretty necessary to get off campus and to the neighboring fun areas on an at will basis. Very friendly culture though, beautiful scenery, great outdoors activities, it’s got the beach, and TONS of outdoor rec classes (I recommend scuba). \n\nAll in all, it’s a great school to visit for a year, just make sure you’re put into house with other people to facilitate friendships/make friends with someone with a car. \n\nHawaii would also be dope too (and it has warm water) so the good news is you can’t go wrong!",
            "score": 2,
            "author": "math_is_my_religion"
        },
        {
            "level": 0,
            "comment": "Maybe just not the best timing for trying out a new campus to begin with? Unless you want the experience of staying indoors doing school online in a different state 🤷‍♂️",
            "score": 1,
            "author": "touchedtherimonce"
        }
    ]
}