{
    "id": "g70q86",
    "score": 7,
    "title": "Question about Combined Section Classes",
    "author": "Vallion04",
    "date": 1587697392.0,
    "url": "https://www.reddit.com/r/csumb/comments/g70q86",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all, I’ve been trying to do a bit of early planning for courses(I like to plan early), and I noticed something saying “Note: This is a combined section class.” I’m not familiar with what those are or what that means, this is also for a BIO course so I’m not sure the differences between the different types? If anyone can help I would appreciate it!",
    "comments": [
        {
            "level": 0,
            "comment": "It should mean that there is a necessary lab you need to take with it!",
            "score": 2,
            "author": "mmorg95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay, so I see LEC and LAB, but what is DIS?",
                    "score": 1,
                    "author": "Vallion04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DIS is for discussion I think. When I had discussion classes they were basically office hours that were mandatory.",
                            "score": 3,
                            "author": "Adeptwerdna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dis is discussion that is sometimes required with the science classes as well. It’s just practicing the material you learn during lecture. It depends on the class if it’s required. I know Bio 210 it’s optional and Bio 211 it’s required. I’d email your advisor to find our for your specific class!",
                                    "score": 2,
                                    "author": "mmorg95",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Will it say in the info when you click on the course number? I know some of them say lecture and lab required, but I’ll be sure to get in contact with my advisor! Thank you very much for the help!",
                                            "score": 2,
                                            "author": "Vallion04"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you! I’m not used to these kinds of things so I appreciate the help!",
                                    "score": 1,
                                    "author": "Vallion04"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It should say when you look at the course description what is required. Plus, when you try to add the classes (after you add it to your cart) it won’t let you enter the class without the required lab in your cart too",
            "score": 1,
            "author": "mmorg95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay, I’ll go look at the course descriptions. I’m not able to add anything until after I go through orientation so it’ll be a while. Thank you, I’m mostly used to my lectures and labs being under one course.",
                    "score": 2,
                    "author": "Vallion04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Csumb does it kinda weird! They’re two separate grades instead of 1 combined one",
                            "score": 1,
                            "author": "mmorg95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I figured as much, as it’s a bigger college. I hope it’ll be okay for me though",
                                    "score": 1,
                                    "author": "Vallion04"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}