{
    "id": "s05nuy",
    "score": 3,
    "title": "Covid Housing?",
    "author": "Stardust2u",
    "date": 1641773313.0,
    "url": "https://www.reddit.com/r/csumb/comments/s05nuy",
    "media_urls": [],
    "other_urls": [],
    "postText": "If classes go fully remote again, will east campus still be open for move on the 21st? I’m an incoming transfer and wasn’t sure how the school was set up during the pandemic, but I’m assuming this won’t be effected since it’s detached from the physical campus. TIA :-)",
    "comments": [
        {
            "level": 0,
            "comment": "If classes go full remote your allowed to stay in East campus apartment if you provide a valid reason. I was able to stay here during 2021 Spring which was all online. But at most there might be a chance of just having the first few weeks online like the UC’s are planning.",
            "score": 2,
            "author": "Mr_TR4FF1C",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah i’m hoping. I hope they announce any changes soon since move in is kinda near",
                    "score": 1,
                    "author": "Stardust2u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "East Campus housing has the same policy as main campus, you are going to have to either be going to on-campus classes, or have some other reason that your current housing is not accommodating. (Although the policy might have changed, I graduated in the spring of last year)\n\nAlso the land between east campus and main campus is still technically CSUMB, just no buildings lol",
            "score": 4,
            "author": "Sheeplessknight",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m registered for all on campus classes. If we go remote for let’s say two weeks, my move in shouldn’t be effected right? They haven’t announced anything and it’s next week so i’m in a slight panic lol",
                    "score": 1,
                    "author": "Stardust2u",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At this point, I think it is too late for them to change it if you are moving in the spring!",
                            "score": 1,
                            "author": "Sheeplessknight"
                        }
                    ]
                }
            ]
        }
    ]
}