{
    "id": "te4um8",
    "score": 10,
    "title": "is csumb worth moving out of state for?",
    "author": "slamfaygo",
    "date": 1647284146.0,
    "url": "https://www.reddit.com/r/csumb/comments/te4um8",
    "media_urls": [],
    "other_urls": [],
    "postText": "okay im ngl i kind of applied on a whim because some marine bio youtuber i used to watch talked about it a lot. i only applied to 2 schools for marine bio (csumb and uncw, and i only got accepted for the spring semester at uncw) and after reading the subreddit i'm just kind of nervous, especially because since i applied (which was like november), i'm not sure i want to leave home anymore lol. i'm not too worried abt that because i'll have to move relatively far no matter where i go to college, but i know the campus isn't super lively. would you guys say the area in general is worth it?\n\ni know this question is kind of silly but i really wanted some input because i was hyped about this school and the idea of the aquarium and everything for months and now i'm just not sure haha",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly this school is what you make of it. If you live on campus, and only go to class, and right back to your dorm/apartment, then it's not the most phenomenal campus. However, being close to Monterey Bay Aquarium, if you really end up pursuing that, it's one of the absolute best aquariums and marine research institutes to my understanding, so the opportunities are hard to dismiss.\n\nYou absolutely would want reliable personal transport in this area, though. From campus, there's an okay shopping plaza about a 45 minute walk from campus, but otherwise you'll be relying on MST public transport, or personal transportation.",
            "score": 12,
            "author": "geophsmith"
        },
        {
            "level": 0,
            "comment": "I moved to Monterey from Illinois to go to CSUMB. It was a great decision, I regret nothing and I'm still here 10 years later.\n\nI lived in Salinas for 6 months before getting into East Campus. I had/have a motorcycle, so I made friends quick with local riders. Riding down the coast or Carmel Valley was every weekend. Going to Laguna Seca every chance I could. Took SCUBA classes my last semester. Beach bonfires on the weekends. Never a flake of snow. It's been a dream.",
            "score": 8,
            "author": "Prison-Butt-Carnival"
        },
        {
            "level": 0,
            "comment": "Where are you moving from? Lol I mean there is a lot to do outside of the school. The school itself can be bland af but if you have transportation I think you'll be fine. If you don't drive you'll most likely be stuck at the school the entire time lol",
            "score": 6,
            "author": "chocomoney831",
            "replies": [
                {
                    "level": 1,
                    "comment": "i'd be moving from north carolina! hopefully i'll have my license soon lmao, thanks for the input!!!",
                    "score": 1,
                    "author": "slamfaygo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who moved from NC to Monterey I haven't looked back, but I always intended on coming out here so it's different. I didn't realize I would stay so long, but here I am. I didn't come originally to go to CSUMB but ended up coming back to attend and now go to grad school in the area. It's a great area for that type of field.",
            "score": 3,
            "author": "sevinup07"
        },
        {
            "level": 0,
            "comment": "Great location for marine science. We have a diving program you can get certified with as a class you can take. Lots of places to kayak too, beach is a close walk from campus but passes by some abandoned buildings. We have an undergraduate research program that will set you up with research as early as your interested at no cost. And a free tutoring center on most subjects. That being said it’s not a college town like other universities. We are built on a military base, it’s about a 20ish minute walk to the store plaza with target, Marshall’s, a movie theater and other stuff plus food. But you can ride the bus for free as a student to go up to Monterey or pacific grove. Campus has access to fort ord trails so if you like to explore nature, it’s perfect. Very recreation focused campus, also very open and accepting with a huge part of our culture focused on BIPOC and queer communities. It’s also the cheapest CSU. \n\nReally just depends on if that’s what your looking for. Lots of opportunities here, it’s just not city life basically. But the housing on campus is nice, especially compared to other campuses for some of it. We also have a huge community of students into things like anime and music and arts so if you like that stuff there are people for that. \n\nThe campus isn’t as lively as before covid, it’s still recovering from that as everyone isn’t as social as before, but it’s ramping back up and I’m sure by next year there will be way more in person events. Party life is meh but it’s there.",
            "score": 3,
            "author": "FirstForBurgers"
        },
        {
            "level": 0,
            "comment": "California is super expensive. If your home life is good, I say stay there for college.",
            "score": 4,
            "author": "Fort_Mason"
        },
        {
            "level": 0,
            "comment": "CA, especially Monterey County is expensive as fuck. If you can study elsewhere I would.",
            "score": 3,
            "author": "orangeblackteal"
        },
        {
            "level": 0,
            "comment": "It depends what you’re looking for in a place to live. I feel like it’s pretty split on who likes the area or not. It’s filled with nature and you can see the ocean from many spots on campus. There are crazy sunsets and it’s dark so many constellations at night. I love it here, but there is downsides to all of that. Because the area is so beautiful to look at, it means everything is also pretty far away and that’s why everyone agrees that a car or something is a must. Or have a friend with a car. It’s not like a lot of cities in California where you can easily get everything you need nearby. And there isn’t much of a nightlife so you gotta ask around about clubs or other social opportunities. So a fair amount of people don’t like it and a fair amount do and it’s simply just preference.",
            "score": 1,
            "author": "girlwholikesthings"
        },
        {
            "level": 0,
            "comment": "It’s only worth it if you’re really passionate about marine biology and really want to experience the central coast. I’m not familiar with the field but I’m sure there’s other universities and Aquariums on the East Coast that can offer good marine biology research so you don’t move that far from NC. And yeah the campus is dead socially, especially after online classes it feels like most people forgot how to carry a conversation and interact in class. If you’re already having doubts, the year round cold and foggy weather, shit traffic, lack of a nightlife, and high prices of gas and rent will probably bog you down more. Then again, I’m just biased cause I grew up in this area and have always hated it.",
            "score": 1,
            "author": "GirthSidious"
        }
    ]
}