{
    "id": "tjq0bh",
    "score": 5,
    "title": "Suicide Prevention Service Spring Training",
    "author": "Ok_Tie_2275",
    "date": 1647907812.0,
    "url": "https://www.reddit.com/r/csumb/comments/tjq0bh",
    "media_urls": [],
    "other_urls": [
        "http://www.suicidepreventionservice.org/).",
        "https://docs.google.com/forms/d/e/1FAIpQLSd_7buay6CWRtBb3MUH3evRs0f2HaFFSjww4d7siAgQXoQpqg/viewform)",
        "https://fsa-cc.org/suicide-prevention-service/).",
        "https://preview.redd.it/udj5abheuto81.png?width=2754&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0778e087d39cb6bb0c77e97f2af41e10018f601a"
    ],
    "postText": "Suicide Prevention Service of the Central Coast is currently recruiting new volunteers for our Suicide Crisis Hotline. \n\nSuicide Prevention Service has been a safe and supportive local resource for Monterey, Santa Cruz, and Benito County residents for 50 years. Our services include the 24-hour suicide crisis line, a wide range of community education and outreach opportunities (including presentations and trainings), and supportive resources (including peer support groups) for those grieving the death of a loved one by suicide. \n\nDay and night, trained volunteers answer calls from people who are feeling suicidal, in crisis, grieving, or concerned about the well-being of a loved one. People with thoughts of suicide need a safe place to express their thoughts and feelings and be heard. Through our comprehensive training, volunteers learn the skills necessary to help callers share their experiences and find support to remain safe. \n\nBy reducing stigma, isolation, and silence, and dispelling the myths that surround suicide, we can all make a difference in our community. Please help us inform our community members about this rewarding volunteer opportunity by posting the \n\nattached flier or forwarding this information to your colleagues, friends, or others in your network. \n\nFor more information on our Spring Volunteer Training Session (beginning May 12th), please contact us by calling our administrative line (831) 459-9373 x2, emailing us at sps24hr@fsa-cc.org, or visiting our website at [www.suicidepreventionservice.org](http://www.suicidepreventionservice.org/). If you would like to volunteer, click [HERE](https://docs.google.com/forms/d/e/1FAIpQLSd_7buay6CWRtBb3MUH3evRs0f2HaFFSjww4d7siAgQXoQpqg/viewform) for the application. A staff member will contact you. To learn more about us, check out our full [website](https://fsa-cc.org/suicide-prevention-service/). \n\n**Please post the enclosed flyer** **where your employees, clients, and other community members will see it and be able to take advantage of this great volunteer opportunity!**\n\nThank you for considering this meaningful volunteer opportunity. We look forward to hearing from you! \n\nIf you are having thoughts of suicide, are in crisis, or concerned for a loved one, please call our 24-hour suicide crisis hotline at 877-663-5433.\n\nhttps://preview.redd.it/udj5abheuto81.png?width=2754&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0778e087d39cb6bb0c77e97f2af41e10018f601a",
    "comments": []
}