{
    "id": "tqmjie",
    "score": 5,
    "title": "How’s the business program at CSUMB?",
    "author": "ODMex1",
    "date": 1648510912.0,
    "url": "https://www.reddit.com/r/csumb/comments/tqmjie",
    "media_urls": [],
    "other_urls": [],
    "postText": "CSUMB is my second choice. Still debating whether Monterey or UC Santa Barbara is the move. Going in as a freshmen.",
    "comments": [
        {
            "level": 0,
            "comment": "Always go UC rather than CS if the program you want is available at both.",
            "score": -3,
            "author": "Mr_TedBundy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really I chose CSUMB over UCSC because it’s more affordable",
                    "score": 1,
                    "author": "DesiredReign124",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just because a school is a UC does not make it better than a CSU both are equally good just that UC cost more. good luck you will do great in either!",
                            "score": 2,
                            "author": "BasicSuccotash7770",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, they aren't better because they have a \"UC\" in front if their name, they all just happen to be rated higher than CS schools. If I interview 2 equal candidates and I notice 1 went to a UC v a CS, I will definitely give that UC alum an extra point .",
                                    "score": 1,
                                    "author": "Mr_TedBundy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "BOOMING!",
            "score": 1,
            "author": "chocomoney831"
        },
        {
            "level": 0,
            "comment": "UCSB is a great business school. you can accomplish everything at CSUMB that you could at UCSB but it will be harder. City size, business prevalence, teacher connections to industry, these all matter. CSUMB is a fantastic school and is rich with opportunity, but I would be doing you a disservice saying that it’s better all other things being equal.\n\nEdit: that being said, all things are not equal. Cost, proximity to family, connections to the valley, these things matter as well. Without full context it’s really hard to give a firm piece of advice. I have a number of friends from each that can give you a better feeling about each program. Feel free to DM me if you want me to pass you their emails.",
            "score": 1,
            "author": "math_is_my_religion"
        }
    ]
}