{
    "id": "111qanp",
    "score": 5,
    "title": "Whitney, Sutter, or Shasta/Lassen? + dorm questions",
    "author": "_p0megranate",
    "date": 1676338532.0,
    "url": "https://www.reddit.com/r/CSUC/comments/111qanp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming freshman here, I'm trying to decide on a residence hall. I've read that Whitney is fun and social but loud, Sutter is quiet and nice but not as social as other dorms, and S&amp;L is a mix of quiet and social but has really small rooms. Is this accurate? How much does the hall you live in actually affect your life or does it not matter much? If anyone who's lived in one of these dorms has thoughts on this that would be great! \n\nSome more questions:\n\nDoes Whitney get so loud that it's hard to sleep? Should I go for a single room if I can get one, or is it harder to make friends that way if you're not a super outgoing person? Do Shasta and Lassen have study rooms? Can you hang out/party at dorms you're not staying in? I'm definitely looking to meet a lot of people and party on the weekend but I also want to be able to sleep and pass my classes",
    "comments": [
        {
            "level": 0,
            "comment": "Whitney is going to be closed for HVAC renovation, so you can eliminate that choice.",
            "score": 4,
            "author": "SoundOfLaughter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks",
                    "score": 2,
                    "author": "_p0megranate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sutter all the way. S&amp;L suck and Whitney has mold",
            "score": 3,
            "author": "weeb_sword1224"
        },
        {
            "level": 0,
            "comment": "Update: Whitney isn't an option anymore. \n\nHow social or not is Sutter in your experience?",
            "score": 2,
            "author": "_p0megranate",
            "replies": [
                {
                    "level": 1,
                    "comment": "It doesn’t matter, you’ll be as social as you want to be.",
                    "score": 3,
                    "author": "weeb_sword1224"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about North Campus? I lived in Esken and it was mostly peaceful.",
            "score": 2,
            "author": "nakfoor"
        },
        {
            "level": 0,
            "comment": "I’ll also be moving for Fall 2023. I’m sad that Whitney is shutting down… What would be the most equivalent to Whitney? I’m social and love to party and meet friends!",
            "score": 1,
            "author": "rippedyourjeans23"
        }
    ]
}