{
    "id": "11ynyys",
    "score": 7,
    "title": "decisions....",
    "author": "nicoisnotemo",
    "date": 1679501936.0,
    "url": "https://www.reddit.com/r/CSUC/comments/11ynyys",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hai, I'm a senior in highschool and 1st gen so I'm hella new to all this and seeking out some advice.\n\nI got rejected from UCD but accepted into UCSC and a bunch of CSU's. I've just gotten my financial award notifs from every school I've applied too, and I'm tied between UCSC or Chico State (since their percentage of finacial aid proposed is in the same price range.)\n\nPros (or Reasons) for UCSC:\n-love the campus and I focus better being away from the city\n-astronomy program that I'd like to minor in (majoring in comp. eng.)\n-close to silicon valley and being able to network\n-i just really like the vibe tbh🧍🏽‍♂️\n\nCons:\n-Housing crisis\n-Santa Cruz tax 😬\n-going in blind, alone\n\nPros (or Reasons) for Chico: \n-affordable community\n-able to move into off campus easily with friends (who just want to move out, but not go to college)\n-respectable engineering department\n\nCons for Chico:\n-no astronomy programs\n-smaller campus\n-even FARTHER away from the bay, or anyone I know\n\nhelp a homie out!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Chico State will have an astronomy minor the year after next. You should contact the Physics Department to see whether it will meet your needs.",
            "score": 7,
            "author": "plasticp"
        },
        {
            "level": 0,
            "comment": "If your financial aid package is good for Santa Cruz then it will be really good for Chico, so if expenses are a huge issue, choose Chico. But Its honestly gonna be up to you. Santa Cruz is expensive so really consider that. But mostly, look into what you want to study. If you’re set on astronomy as a minor then that should be the move imo. I love Chico state, did my undergraduate and now wrapping up grad school here. But Ive had friends who loved their time in Santa Cruz.",
            "score": 4,
            "author": "DaRumpGrinder"
        },
        {
            "level": 0,
            "comment": "I'm also a first gen college grad who went to Chico. \n\nUCSC and Chico are really different schools and communities. \n\nThe learning style is totally different at UCs vs CSUs. A lot of classes at UCs are large (200+ people) lectures followed by discussion sessions with teaching assistants. You likely won't be able to form any sort of connection with your professors until your high level courses in senior year. CSUs on the other hand tend to have much smaller class sizes, with Chico's average being about 24 students per class. If you like to learn in a big lecture hall setting then a UC might be good, but if you do better with direct support from your professor then a CSU would be more appropriate.\n\nAs far as the campuses - Chico is a true college town. The campus is right in the middle of downtown, and well integrated into the community. Everything is walkable and easy to get to. UCSCs campus, while beautiful, is very isolated from the town itself. It isn't walkable, so if you live off campus you'll need to take public transit to get to class. You mentioned you focus better being away from the city, so maybe that's a good thing for you. Just keep in mind at UCSC if you're at home and your roommates are being loud and you want to go to library to study, you'll need to walk to the bus stop, wait for the bus, drive up the hill, etc. to get there. It can be counter productive to not have a quiet place to work just a few minutes walk from your house. \n\nAs far as finances - Chico will be a lot cheaper. Not just in tuition, but the cost of living as a whole is much lower in Chico than Santa Cruz. Food, gas, rent, etc is all a lot more affordable up north. There isn't as much housing scarcity there, so you likely won't have any issues finding a place to live. \n\nI loved my 4 years in Chico and I wouldn't have done it differently if I could go back and do it again. Hope this helps!",
            "score": 4,
            "author": "cpredo"
        },
        {
            "level": 0,
            "comment": "Hey, I am first GEN graduated college years ago. And I’ve also worked at different colleges, including Chico and now at a college in the bay area. Feel free to PM me.",
            "score": 3,
            "author": "nifflerqueen"
        },
        {
            "level": 0,
            "comment": "i loved my time at Chico, my kid is going there next year. You will have a great experience and education.",
            "score": 3,
            "author": "ragg5th"
        },
        {
            "level": 0,
            "comment": "I'm first gen and am enrolled in Chico rn, and if finances are your main concern, I'd pick Chico any day. It's fairly cheap to live here and I don't feel cheated out of any college experiences for picking the \"cheaper cal state\".",
            "score": 3,
            "author": "theplaneatlax"
        },
        {
            "level": 0,
            "comment": "I went to Chico and would pick ucsc over it any day of the week",
            "score": 2,
            "author": "genaricgoblin",
            "replies": [
                {
                    "level": 1,
                    "comment": "how come??",
                    "score": 1,
                    "author": "nicoisnotemo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you like astronomy and the campus of Santa Cruz, I would go there. Are you used to the quarter system? Santa Cruz will be a faster pace than Chico. Chico is more affordable, but Santa Cruz is such a beautiful area. It comes down to what you want. If you're strict on finances, Chico will be more affordable. I'd tour Chico and check out the town if you're interested in it.",
            "score": 2,
            "author": "not_mrbrightside"
        },
        {
            "level": 0,
            "comment": "I’m kind of on the same boat as you are. I decided to go to Chico because it’s more affordable all around. Tuition and housing is a lot more affordable. Chico has a cute small college town feel. Although the UCSC campus is gorgeous, housing there is very expensive if you decide to live off campus. Also, if you plan on commuting it sucks. There are a lot of windy roads.",
            "score": 2,
            "author": "Independent-Scale309"
        }
    ]
}