{
    "id": "128xj5x",
    "score": 3,
    "title": "Parking situation",
    "author": "Material-Ad6757",
    "date": 1680380337.0,
    "url": "https://www.reddit.com/r/CSUC/comments/128xj5x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Was wondering if I could get voices from current or previous Chico state students. Incoming freshman to Chico state. I didn’t see anywhere that Chico state doesn’t allow freshman to bring cars however, it’s heavily discouraged. I live an hour away from Chico so I could easily go home for a day or two. Is the parking situation at Chico bad that I should just scrap the whole idea? I have an electric scooter that I can also use in case I would need to park farther away. Please don’t be mad if anything I say is completely stupid I just don’t know yet lol 🙏🏻. ( praying that the electric scooter doesn’t get stolen when I bring it to campus 😒)",
    "comments": [
        {
            "level": 0,
            "comment": "The situation really depends on where you’re going to live. I can’t speak to on-campus living. I lived outside of the college sections of town and almost always drove to campus, and never found parking to be terrible. That said - I never attempted to park particularly _near_ campus, either. I’d park on the opposite side of downtown, in the free unlimited parking areas, and just walk over. There are even fewer businesses in that section (around the intersection of 5th and Orient) than there used to be, so parking is always pretty plentiful. Five years of school and never got a ticket.",
            "score": 6,
            "author": "DigitalPelvis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, my backup plan was to keep moving my car into some overnight parking or someplace where it wouldn’t get ticketed and just keep a scooter or something folded to get to the dorm and from my car",
                    "score": 2,
                    "author": "Material-Ad6757",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was in the dorms several years back, I kept my car on 6th and orange in the same general spot the whole year. Never got a ticket, never got broken into.",
                            "score": 3,
                            "author": "lennnyv"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "there are a limited number of parking passes for sale. If you get one and you live on campus you should be fine. The parking lots are full from 9-1, but if you park outside those times there's plenty of space.",
            "score": 3,
            "author": "especiallyknot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome thanks for the help. I was just filling everything out, put in my intent to enroll like 5 minutes ago and I’m filling out housing. Just didn’t want to go in completely blind to the school.",
                    "score": 1,
                    "author": "Material-Ad6757"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd caution against getting a parking pass. There's no guarantee you'll get a spot. The whole town is so walkable and bikable. I didn't have a car freshman year but brought it with me the rest of the time. It's fine for going around town. But I would recommend getting an apt or dorm close enough to campus to walk or bike.",
            "score": 3,
            "author": "IwillMasticateYou"
        },
        {
            "level": 0,
            "comment": "There will always be a spot somewhere, but you will have to walk a bit. If you are like me and don’t really like to worry about parking, I get there at around 8:40 everyday to get a spot in the parking garage. Parking is a pain but manageable",
            "score": 2,
            "author": "Sea_Place_6016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks that was my plan as a backup, to either walk to keep like a penny board in my car in case I have to park farther away",
                    "score": 1,
                    "author": "Material-Ad6757"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome I’ll try to look out for that. I was trying to figure out how I reserve them but I’m figuring they come out later in the year closer to the school start date",
                    "score": 1,
                    "author": "Material-Ad6757"
                }
            ]
        }
    ]
}