{
    "id": "12yrkoj",
    "score": 2,
    "title": "Marketing vs Management Info Systems",
    "author": "OkAcanthocephala6506",
    "date": 1682447096.0,
    "url": "https://www.reddit.com/r/CSUC/comments/12yrkoj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys! I am an incoming freshman and when I originally applied to CSUC, I intended to go into marketing, however i’m really considering switching to a MIS major. Personally I think my personality is more suitable for Marketing, but I think it might be too broad of a degree. I think my success rate would be higher with a MIS degree, but I’m not sure if I’d enjoy it. If anyone can give me advice that would be great!",
    "comments": [
        {
            "level": 0,
            "comment": "I’m in the Marketing Pathway. I’m in my last year as well. Marketing is great if you like to collaborate and talk a lot with people. I originally used to be part of the business info systems pathway and MIS is good if you want to work in IT or cyber security or things along that line and you generally like working alone.\n\nMarketing may seem like a broad degree but you could say that about any degree. Make sure to get internships as much as you can. That’s what matters . Do what you like and make connections, get internships and network, showcase your skills. Most companies just care that you have a piece of paper with your name on it but now look to see if you can do the job and have experience or are willing to learn.",
            "score": 2,
            "author": "No-Specialist-5173",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much this really helps because I’m a really collaborative person. If you don’t mind me asking, do you have any jobs lined up for when you graduate?",
                    "score": 2,
                    "author": "OkAcanthocephala6506",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that’s great then I think marketing fits you! And sadly no I do not. I’m also not graduating for another year so it’s a bit early for me to be applying for post grad jobs. And truthfully I probably won’t be going in to working in marketing unless I get lucky as it is competitive and I don’t have marketing experience. I’m probably going to go back in to being a buyer or working in administrative positions which I have experience in",
                            "score": 1,
                            "author": "No-Specialist-5173",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that makes sense then! I mean based off the people you know though how has their success rate been in Marketing?",
                                    "score": 2,
                                    "author": "OkAcanthocephala6506",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well my sister in law has a small business degree from Chico state that she got last year and she works as a marketing advisor for a real estate company however she was able to get marketing positions on campus to be able to have a portfolio once she graduated. Another friend of mine got her marketing degree from Chico two years ago and she works in sales and works remotely from home as a sales rep. So I guess it’s 50/50",
                                            "score": 1,
                                            "author": "No-Specialist-5173",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s so cool. I think right now I will probably major is MIS, but minor is Marketing. I really appreciate your help on this.",
                                                    "score": 1,
                                                    "author": "OkAcanthocephala6506",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah if course! I’m sure whatever you decide to do will be great for you!",
                                                            "score": 1,
                                                            "author": "No-Specialist-5173"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds good, take a minor in marketing and check out the Seufferlein Sales Program.",
            "score": 1,
            "author": "ragg5th"
        },
        {
            "level": 0,
            "comment": "I graduated  with a MIS Degree back in 2021, and I have a job as a Business Intelligence Analyst in the healthcare field. With the MIS degree you have options of going into IT, Data Analyst/ Business Intelligence Analyst, Business Intelligence Engineer, or database management. In these positions you will still be collaborating with different stake holders. In my current job I collaborate with different stakeholders every day. Also, the MIS program is great at Chico State since we have companies like Chevron, EY, Deloitte, and few others that come to present at the BIS Society club, and we have few past students that now work for these big companies after graduation.",
            "score": 1,
            "author": "TauTau24",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is really helpful. I love that MIS is still collaborative, but also that big companies work directly with Chico. I think that definitely makes me lean towards getting a MIS degree. Though, let’s say I do go for it would you recommend a minor in Marketing or is there any other minor I should be focused on?",
                    "score": 2,
                    "author": "OkAcanthocephala6506",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can definitely minor in marketing still. I know there are marketing analyst for companies, so you could put both majors to use in the future after graduation.  Definitely join the BIS Society once you start in Chico State. I was the former vice president of the club, and you will meet tons of people and connection in that club.",
                            "score": 1,
                            "author": "TauTau24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes i will so make sure to do that. Thank you so much for the help i appreciate it",
                                    "score": 2,
                                    "author": "OkAcanthocephala6506",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No Problem! Let me know if you have any other questions regarding the MIS program at Chico State.",
                                            "score": 1,
                                            "author": "TauTau24"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}