{
    "id": "9wxmdb",
    "score": 19,
    "title": "Calif College Republicans' signs stolen - \"because they are inaccurate...\"",
    "author": "JohnKimble111",
    "date": 1542177400.0,
    "url": "https://www.reddit.com/r/CSUC/comments/9wxmdb",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This kind of behavior is why right wing supporters call progressives snowflakes and the intolerant party of tolerance.  Those girls played right into the republican's plans. Good job ladies - with friends like you who needs enemies?\n\nI acknowledge that the content of the signs might not have been correct. Big surprise, that's politics for you. Political signs aren't capable of having a nuanced discussion about complicated issues.  Quite the opposite. They are meant to trigger the audience and generate passion.  I would say those signs did one hell of a good job.\n\nStealing signs off the lawn is wrong and it's sure as hell isn't free speech. Denying others a chance to speak (even if it's misleading) is not \"freedom of speech.\"  Trying to steal someone's phone because you are afraid of being filmed... that shows they felt ashamed of their behavior.  That tells me they knew they were wrong. They had enough energy to steal signs but not enough energy to present a counter-argument or to try and convince other's the signs were wrong.  \n\nIf they want to dispute the signs by CSUC process or by posting opposing arguments/signs that's their right. Instead they tried to silence others' free speech.  ",
            "score": 14,
            "author": "west_coast_bias"
        },
        {
            "level": 0,
            "comment": "Thats disgusting behavior. Not only does taking others' property have nothing to do with free speech, anyone can be filmed in a public space. Will be interesting how the university handles this",
            "score": 22,
            "author": "sCheezecake"
        },
        {
            "level": 0,
            "comment": "Holy shit this got brigaded hard.",
            "score": 3,
            "author": "RobinHood21"
        },
        {
            "level": 0,
            "comment": "Haha, the awkward silent walking at the end",
            "score": 5,
            "author": "pattern144"
        },
        {
            "level": 0,
            "comment": "Regardless of where you align yourself politically you can’t destroy others property. This just makes you look petty and uninformed.",
            "score": 5,
            "author": "FruitCakeSally"
        },
        {
            "level": 0,
            "comment": "Haha I know one of the dudes. These girls looked so dumb. It’s sad.",
            "score": 4,
            "author": "pichaelthompson69"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My apologies for forcing those poor women in the videos do all those idiotic fascistic crimes on camera. It's totally my fault and they're not the slightest bit responsible for all the harm caused to the university community.",
                    "score": 8,
                    "author": "JohnKimble111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; are just trying to divide an already distraught community. \n\nNo, the girls in the video are the ones doing that. I just posted a video of them doing so. Why are you attacking the messenger? I think it's actually positive how at least the decent people in this sub are coming together to condemn these bigots.",
                                    "score": 5,
                                    "author": "JohnKimble111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "God, this is such an immature response. What does this issue have to do with the content of the video?",
                                                    "score": 11,
                                                    "author": "pichaelthompson69",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -6,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why is anything challenging your beliefs or political leanings propaganda?",
                                                                    "score": 12,
                                                                    "author": "pichaelthompson69",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You keep deflecting the argument. Nobody cares who you voted for.\n\nThe Camp Fire has absolutely been devastating and detrimental to everybody involved. But just because it happened doesn’t somehow invalidate this post. Just admit it, you don’t agree with the people filming and are trying to find ways to invalidate it and call it “propaganda”. ",
                                                                                    "score": 7,
                                                                                    "author": "Atomo500",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How does  this discussion undermine the tragedy that is campfire? ",
                                                                    "score": 6,
                                                                    "author": "pichaelthompson69",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’ve donated to relief efforts in the community. My heart goes out to everyone living in butte county. It’s truly a tragedy. I don’t understand why this is relevant to the issue at hand. Campfire doesn’t have anything to do with my beliefs about free speech. I see people acting foolishly in this video at my alma mater and suddenly I can’t discuss an entirely separate issue because a tragedy happened? You are being silly.",
                                                                                    "score": 7,
                                                                                    "author": "pichaelthompson69",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "1. accuses poster of being in a political echo chamber\n\n2. goes to Chico, a political echo chamber in itself, and literally just got done scolding him for posting something other than praise for the left, proving the existence of said political echo chamber\n\nI mean, do I need to spell it out for you or are you seeing what's wrong here? ",
                                    "score": 0,
                                    "author": "Squid8867"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The answer to free speech that spreads ignorance is to use your free speech to spread knowledge. So you should never tear down your opponent's sign. But you should make the effort to put up signs nearby that call attention to their lies. But at some point the lies are so prolific, that you cross a line, and something must be done.\n\nI think that along with the story about the two girls, who are understandably frustrated, the story should also be about the fact that the local Republicans are taking the example of the national Republicans by being the party that actively lies as a campaign method.\n\nEDIT: I just want to say hello to the CSUC Republican Club that is brigading this comment with downvotes. Good luck registering voters at the next Klan rally.",
            "score": -2,
            "author": "gregbard",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm biased against fascism. The Republican Party is no longer a legitimate organization if it ever was. It is a criminal organization with no principles. Supporting the party and the leader is all that matters. I don't have to pretend about it.\n\nhttps://i.imgur.com/1EJoAeU.jpg ",
                            "score": 2,
                            "author": "gregbard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well if you read my response, you know I agree with you that the girls shouldn't have done that.\n\nI seems to me that I'm the only one here actually supporting free speech. BTW, when I was at CSUC, I was the chairman of the University Speech and Advocacy Board. \n\nSo keep at it, and maybe you'll make a difference in the area of expanding freedom of speech,  BIG GUY.",
                                            "score": 5,
                                            "author": "gregbard",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Cry about it.",
                                                            "score": 3,
                                                            "author": "gregbard",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You know why there is no Fox News in Canada, right? They have a law prohibiting lying on the television news. So my point stands. ",
                                                                            "score": 2,
                                                                            "author": "gregbard",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Keep signalling that Virtue.... you might yet get a pee pee touch .\n",
                                                    "score": 1,
                                                    "author": "Gorgatron1968"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am dismayed the the republicans believe not criminalizing homelessness is somehow promoting it. \n\nBy continuing to ignore the problem and pushing the unhoused people out of downtown and into the neighborhoods we are simply perpetuating the homelessness issue that is caused by economic inequality, mental health issues, and drug addiction. If we go to the causes of the problem of homelessness we can begin to solve it and create a better community.",
            "score": -4,
            "author": "JAR3BEAR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you seen what decriminalizing homelessness has done to San Francisco? ",
                    "score": 8,
                    "author": "pichaelthompson69"
                }
            ]
        }
    ]
}