{
    "id": "bd4dqg",
    "score": 0,
    "title": "What laptop should I get?",
    "author": "Bunbury19",
    "date": 1555258640.0,
    "url": "https://www.reddit.com/r/CSUC/comments/bd4dqg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am going to start at CSUC in the fall as a Mechatronics Engineering student, and I was wondering if there were any programs I need for the classes, and what laptops would be good to run said programs?",
    "comments": [
        {
            "level": 0,
            "comment": "Fellow mechatronics major here. You're gonna want something kinda beefy, and definitely more of a \"gaming laptop\". I got the MSI SG63 Stealth which might be a little overkill, but I also play games on PC and didn't want to bring my whole computer to the dorms as there just isn't enough space. You're gonna want something with a decent graphics card and a decent amount of ram. 16gb would be ideal but you could probably get away with 8. Your first year you'll probably be taking mech 100 which is the graphics design class and I can tell you first hand that having a capable laptop helps a lot. You don't want to have to be in the computer lab just to do your homework. Also you want to make sure you're getting a windows laptop, as many of the programs you'll need (including solidworks) are windows only and are a bitch and a half to get onto a Mac. Good luck and pm me if you have any note questions!!",
            "score": 2,
            "author": "SkelaKingHD"
        },
        {
            "level": 0,
            "comment": "If you're a Mechtronics major, you're probably going to be running Solidworks and other resource intensive programs, so don't cheap out. You WANT as good specs as you can get. Try a gaming laptop - they generally prioritize their internal specs over gimmicks like touch screens and anodized aluminum unibody cases. A lot of students I've worked with have cheap, discount laptops that take literally 5 minutes just to open Chrome, and it drives me nuts. Acer, Msi, Toshiba, all good brands to check out, but read their specs. I recommend an SSD (or a hybrid drive with the SSD part no less than 128GB. Cheapest place is online, wildcat store = more $$$. I bought mine for 800, it had a 7th Gen i7, 8GB RAM, GeForce 1050, and I added an extra 8GB of ram for another 90 (you can thank bitcoin for those prices).",
            "score": 1,
            "author": "Firree",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for the information. Also I've always wanted a gaming laptop, now i have an excuse to get one.",
                    "score": 0,
                    "author": "Bunbury19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can't go wrong with an older model business-class HP/Dell/Lenovo running Windows and Linux in dual-boot config.\ni5 CPU with 8gb of memory and a 500gb SSD will be plenty.  Even that is probably overkill.",
            "score": 0,
            "author": "wolf2600",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much, i'll start looking for one.",
                    "score": 0,
                    "author": "Bunbury19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Here is the official minimum (and suggested) requirements for all students in the College of ECC](https://www.csuchico.edu/ecc/students/prospective/laptop.shtml):\n\n&gt; # PC Users, All Majors\n&gt; | Component | Recommended | Minimum |\n&gt; |---|---|---|\n&gt; | **CPU** (no Celeron) | Intel Core i7-7600 | Intel Core i5 |\n&gt; | **RAM** | 16 GB | 8 GB |\n&gt; | **Storage** | 256 GB or better SSD | 500 GB 7200RPM |\n&gt; | **Display** | 17\" | 15.6\" |\n&gt; | **Video** | NVIDIA GeForce GTX | Intel HD Graphics |\n&gt; | **Operating System** | Windows 10 |   |\n\nThat said, choices will be a little bit different in different majors (e.g. in CSCI/CINS you don't *need* to have Windows and can make do with a smaller screen but 16+ GB RAM is pretty essential), but you should be pretty safe if you meet or exceed those specs.\n\nThe above link also provides links to where you will be able to download the software you need (which is often included/licensed to the school so don't go out buying it on your own yet).",
            "score": 0,
            "author": "DrKevinBuffardi"
        }
    ]
}