{
    "id": "bh9m3t",
    "score": 2,
    "title": "What dorm hall should I choose?",
    "author": "Angry_Panda125",
    "date": 1556204283.0,
    "url": "https://www.reddit.com/r/CSUC/comments/bh9m3t",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming freshman here, I was wondering if there was any dorm halls that are just clearly better than others or are they all practically the same?",
    "comments": [
        {
            "level": 0,
            "comment": "Shasta/Lassen are very quiet and have lots of privacy. I don't regret living here. Any class on campus is just a ten minute walk away.",
            "score": 3,
            "author": "Bazoka8100",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shasta 2010/2011 alumnus here. I absolutely agree that it was a good building to live and grow in. Pretty good location for class, downtown, parties, etc. The only negative was the WiFi; I literally got better reception on the toilet than in my dorm room. So if that issue has gotten better, then I have nothing but positive things to say about Shasta!",
                    "score": 2,
                    "author": "FernBabyFern",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd tell you whether or not it's gotten better but my room has the wifi box literally in it so my answer would be skewed lol",
                            "score": 2,
                            "author": "Bazoka8100",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Currently living in Lasses. Wifi is pretty good. Assuming because its a smaller building to cover or I might just be next to the router",
                                    "score": 1,
                                    "author": "SkelaKingHD"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nobody's mentioned Mechoopda. It's an 8 minute walk off campus but by far the most laid back dorm (read: lots of smoking spots nearby). Just the right size where you will recognize everybody by face if not name. I'm still friends with the people I met there. Very tight knit community.",
            "score": 3,
            "author": "IwillMasticateYou"
        },
        {
            "level": 0,
            "comment": "Depends what you want.\n\nWhitney is THE social dorm (you can be social in any dorm but Whitneys if you want to take it a step above)\n\nSutter is new and clean\n\nShasta/Lassen is if you just want to chill",
            "score": 2,
            "author": "SignumVictoriae",
            "replies": [
                {
                    "level": 1,
                    "comment": "My current roommate will be in Whitney as an RA next year. He’s super cool, so that’s a plus. Konkow and UV Are great if you’re looking for more of an apartment style which has a kitchen. The dorm food can be a bit dull :/",
                    "score": 2,
                    "author": "SEA___BEAR"
                },
                {
                    "level": 1,
                    "comment": "i wouldn’t go whitney it’s falling apart on the kids atm",
                    "score": 3,
                    "author": "localdollartree",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is a good answer. Whitney is more social, but you have to be willing to deal with the fire alarms (all 40 of them). Not a whole lot goes on at Lassen. Shasta is cool",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "depends on what you are looking for. There are dorm hall tours you can easily find on youtube to see the environment. I live in Lassen and really enjoy it, really social and not super crazy, less than 5 fire alarms from the whole school year. You may wonder are fire alarms really an issue; yes! Especially if its Whitney or Sutter, 8 floors worth of people and they aren't just smoke detectors they are particle detectors which means if a girl puts on too much hairspray the whole building will have to be evacuated. Happen literally every week. Every dorm hall is social, Whitney and Sutter are just an extra step above because they are filled with freshman trying to party and drink. Lassen/Shasta are considered quiet because no one is bumping super loud music or trying to throw a mini party in their room.",
            "score": 1,
            "author": "cmendez450"
        },
        {
            "level": 0,
            "comment": "Sutter",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}