{
    "id": "cagtdq",
    "score": 1,
    "title": "Living next to train tracks",
    "author": "sStang12",
    "date": 1562562458.0,
    "url": "https://www.reddit.com/r/CSUC/comments/cagtdq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a transfer student and found housing on Nord Avenue Apartments. While looking at the complex on \n\nGoogle Maps I notice that there are train tracks next to the complex.  I have  a few questions about living next to train tracks.\n\n&amp;#x200B;\n\n1. Has anyone live on Nord Avenue Apartments? How often do trains pass by during the day and night?\n2. Are trains constantly passing by?\n3. How often do you wake up in the middle of your sleep due to a train passing by?\n4. Is it worth it living next to train tracks in order to be close to campus?\n5. Any regrets living next to train track?\n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "I lived 20 ft away from the train tracks. You get used to it. Or we did anyway",
            "score": 7,
            "author": "jbuffy"
        },
        {
            "level": 0,
            "comment": "I used to live near the tracks somewhat and they are definitely noticable. Quite annoying actually as I remember them even 6+ years later. I'd recommend avoiding them if you are a light sleeper or easily bothered by random noise. They are frequent but I don't recall how much so.. several times a day.",
            "score": 7,
            "author": "moebaca"
        },
        {
            "level": 0,
            "comment": "I’m not a heavy/light sleeper, but the train can definitely wake you up if you’re easily rustled awake. The train passes by a few times a day/night and is definitely noticeable as it blares its horn at every crossing. Pretty loudly too...",
            "score": 5,
            "author": "lonewolf2556"
        },
        {
            "level": 0,
            "comment": "Former Nord Ave dweller here,\n\n1. Trains come by day and night. Amtrak stops in town around 1-5PM. All other trains are freight, and the frieght trains and not scheduled so they can come by any time day or night.\n2. From what I can tell, there's seems to be an average of one train every hour or so. This is Union Pacific's main west coast line, and it's busy.\n3. I'm not a heavy sleeper, but I was able to sleep through the trains fine. You get used to it.\n4. Yes.\n5. My only regret is getting the room I got. My room was directly adjacent to Nord Ave, which gets traffic 24/7. This car traffic was far worse than train traffic, because people are shitty drivers. Horns, big semis, the loud high pitched whine of a turbo diesel, the sport bike, those mustang drivers who can not make a single acceleration from a light without revving.",
            "score": 3,
            "author": "Firree"
        },
        {
            "level": 0,
            "comment": "I live right next to the tracks and you get used to it within the first week. Yes, they can occasionally wake you up because they come at all hours of the day, but you learn to roll over and go right back to sleep.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah I lived in apartments right next to them the first couple weeks suck but you get used it to it. Eventually you tune it out. I lived right next to them and I remember there were times when you could even feel the train shacking but our apartment overlooked the tracks. There were like a couple trains in the night.",
            "score": 1,
            "author": "DOLO_F_PHD"
        },
        {
            "level": 0,
            "comment": "I live by them now they don't bother me since I'm not a light sleeper, but you do hear the blow horn a few times a day",
            "score": 1,
            "author": "darkfright23"
        }
    ]
}