{
    "id": "cyf2pz",
    "score": 4,
    "title": "Questions about changing rooms",
    "author": "Randomis11",
    "date": 1567369529.0,
    "url": "https://www.reddit.com/r/CSUC/comments/cyf2pz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey I was thinking of trying to talk to someone and change rooms but didn't want to cause any trouble, do I need to come clean about things If I make a request to move, do you even need a reason. What they do is against the rules but it's nothing remotely close to disrespectful, abusive or dangerous. I'm just paranoid and considering my options since they are nice people.\n\nHas anyone been through this and can give me the run down on what it entails?",
    "comments": [
        {
            "level": 0,
            "comment": "Don’t snitch on them if they smoke or drink please unless they are very disrespectful of your boundaries.",
            "score": 9,
            "author": "jimmyjoe1212"
        },
        {
            "level": 0,
            "comment": "Someone will almost definitely have a better answer, but assuming you’re absolutely sure you won’t be able to fix the the problem with your roommate, I think it would be better to make up a problem you have with each other. If you give the actual reason then your roommate will get in trouble, so I’d imagine it’s best to come up with a lie.",
            "score": 4,
            "author": "Fudgywaffles"
        },
        {
            "level": 0,
            "comment": "You are in college to learn. Learn to live with it. Alcohol was permitted in the dorms until 1989. Weed has been with us since forever. If they aren't doing violence or damage there is no substantial issue. \n\nAlso, it's still early. Give it some time.",
            "score": 3,
            "author": "gregbard"
        },
        {
            "level": 0,
            "comment": "I wouldnt go as far ass to throw your current roommates under the bus, literally any reason is valid to move rooms/buldings. Just say you would be more comfortable in another living situation.",
            "score": 2,
            "author": "uhhhhdexter"
        },
        {
            "level": 0,
            "comment": "Yeah I wasn't going to get anyone in trouble, it became clear changing rooms wasn't an option. Either way we are okay now I was just exploring my options at the time",
            "score": 1,
            "author": "Randomis11"
        }
    ]
}