{
    "id": "dmtd5y",
    "score": 9,
    "title": "Your thoughts on CSU Chico",
    "author": "FueRenard",
    "date": 1571984721.0,
    "url": "https://www.reddit.com/r/CSUC/comments/dmtd5y",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a senior in highschool and I've been looking at this school for it's mechatronics program. Can someone give me insight on what attending here is like?  What is the campus life like and how are the professors? Is it expensive? Honestly, any information or personal thoughts about the school life would be great. I've seen virtual tours of the campus and have read some reviews about it. It looks like a a great place to be, I'm just a really indecisive person.",
    "comments": [
        {
            "level": 0,
            "comment": "You will love the Engineering program at Chico! You will be surprised how many employers look for graduates from Chico because you get plenty of hands on experience through labs and projects both in and out of class. \nChico is a small town with a whole lot to provide as far as a vibrant downtown and a school that has been rated as one of the more valued schools in the US as far as engineering goes. If you play music, there is also a great music program which would love to have more students involved.",
            "score": 8,
            "author": "8Dppm-pulse"
        },
        {
            "level": 0,
            "comment": "This. My friend’s brother got accepted for a ton of engineering jobs when his Davis graduate counterparts did not solely because he brother graduated from Chico. CSUC makes most students become pretty social. \n\nI’m current in the nursing program and graduate next fall. I don’t plan on having any trouble finding somewhere to start my career. Chico State may be a school with a party reputation, but DAMN we have amazing academics...",
            "score": 5,
            "author": "lonewolf2556"
        },
        {
            "level": 0,
            "comment": "Chico is the quintessential college town.  People are friendly (students, faculty, and staff).  Costs are low and the education is quality.",
            "score": 4,
            "author": "wolf2600"
        },
        {
            "level": 0,
            "comment": "Mechatronics Major here. Honestly the program is really great. Obviously there's a lot of work, but if engineering is interesting to you and a legitimate passion, then it won't be a problem. Some of my GEs were actually harder than my major classes becuase they were just so boring. As a mechatronics major you'll take a wide variety of engineering courses such as mechanical, electrical, manufacturing, and computer science. The only problem with that is that it's a bit tricky finding other mechatronic engineers in your class as a mech engineering class is mostly filled with mech majors and Compsci classes are mostly filled with Compsci students. The dedicated major classes are more upper level. If you put the work in and go to class it shouldn't be a problem. The social life in Chico is great too. And if you like partying there's sure a bunch of that up here",
            "score": 2,
            "author": "SkelaKingHD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you focus more on the electrical aspect or the mechanical aspect of engineering in your major?",
                    "score": 1,
                    "author": "FueRenard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean right now it's just a mix of both. Personally I'm more of a fan of the mechanical part",
                            "score": 1,
                            "author": "SkelaKingHD"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the student to teacher ratio in a regular class?",
            "score": 2,
            "author": "FueRenard"
        },
        {
            "level": 0,
            "comment": "Chico is absolutely amazing. I don’t know too much as far as mechatronics but speaking on campus life it’s fantastic. Definitely one of the best true college towns in CA and on the west coast. Everything is basically centered around 1 square mile of campus, south campus, and downtown which is all walkable. And due it being in a small town it’s dirt cheap compared to other states schools or UC’s. Professors aren’t too bad, some are amazing some aren’t.",
            "score": 1,
            "author": "Xerxes0"
        },
        {
            "level": 0,
            "comment": "I'm a computer engineering major at CSUC. I've also lived in a lot of places and attended several different schools over the past 15 years since graduating high school. CSUC is an excellent school. They have an impressive graduation rate and the engineering departments are amazing. Recruiters come to the school constantly to hire engineers. The faculty is great and are truly invested in your success. Chico is a great town that is having some growing pains but overall is safe and easy to live in. I highly recommend visiting the campus and spending a few days in Chico to see if it's a place you might enjoy. I love the campus size and the area, but you might be more at home in a bigger or smaller city for example. I hope this helps inform your decision!",
            "score": 1,
            "author": "Financial_Lynx"
        }
    ]
}