{
    "id": "dt9yl5",
    "score": 12,
    "title": "Is it true that the west side of the railroad tracks is sketchy to live in any of those neighborhoods?",
    "author": "frank69er",
    "date": 1573186366.0,
    "url": "https://www.reddit.com/r/CSUC/comments/dt9yl5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was told that I should try to live on the campus side of the railroad tracks so I’m trying to find a place since I’m transferring in the spring and I wanted to know if it was true",
    "comments": [
        {
            "level": 0,
            "comment": "Not necessarily true. West side of the tracks is very heavily student populated. So expect lots of parties, cops, shit like that. With that comes the homeless, but you are gunna get that no matter where you live here. \n\nThe area directly north of campus and the high school football field (Wst 1st and Citrus area) is way more sketchy in my opinion. All the streets are extremely poorly lit and I constantly see homeless people walking around. I know some homeless dude also shot on one of those streets last year as well. I used to live in that area so I have a little experience. \n\nSo I in all, I would say west side of tracks it louder and just more shit going on what with all the student, but isn’t as shady as other places around town",
            "score": 9,
            "author": "Atomo500",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! So quick question what are your thoughts on the 921 West Sacramento Ave area? It’s right across the street from the soccer field",
                    "score": 3,
                    "author": "frank69er",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s right next to the tracks right? You are gunna  get a lot of foot traffic there. Also that whole stretch of sac ave from there to the intersection of warner is not lit really at all. So it’s definitely a sketchy walk at night. That’s really close to the other area I was talking about as well so expect lots of homeless roaming around. \n\nI’m gunna be honest, that spot isn’t ideal, but you are pretty close to Nord so hopefully it doesn’t get too bad. I would say you’re right on the border of the sketchy shit",
                            "score": 3,
                            "author": "Atomo500",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Could you give me a range from what street to what street would be ideal?",
                                    "score": 1,
                                    "author": "frank69er",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean on the west side of the tracks? I don’t know what it’s like exactly, but I’d assume anywhere that’s directly off of Nord wouldn’t be too bad. Again, it’s just a lot of foot traffic from students, but Nord is lit up fairly well and there’s constantly cars driving that road so I don’t think personally safety there is too big of an issue. It’s a lot quieter the farther down Nord you go. Right where Nord turns into Walnut is a pretty nice area (where the dominoes and Sinclair station are). Not nearly as much foot traffic but you still got enough police cruisers and lights to where it doesn’t feel very sketchy at all. Plus it’s not too far of a walk to downtown from there. So I would personally recommend somewhere on the south end of Nord and walnut if possible. \n\nI know a lot of students live on the northwest section of West Sac (past the chevron), but I’ve never personally been there so I couldn’t tell you what it’s like.\n\nReally I would just emphasize not living in that west 1st/citrus/warner area that I was talking about earlier. That place it just all around shitty",
                                            "score": 1,
                                            "author": "Atomo500"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is just my opinion, when I was in school West Sac was always the sketchiest area I wouldn’t want to live there, secondly living right on the train tracks will get annoying with the horn going off all the time",
                            "score": 1,
                            "author": "Reinheardt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Aves are sketchier for sure but the higher the number the better, generally speaking. I lived by myself on W 4th ave for a year and my street was closed often with cops but I personally never had any issues.",
            "score": 5,
            "author": "JohnnyNewEggs"
        },
        {
            "level": 0,
            "comment": "The west side of the tracks isn’t terrible. Like previously mentioned, it’s heavily populated by students. You don’t want to live in the avenues - W 1st ave, W 2nd ave, etc. There is some sketchy business going on in this area. Not only is it poorly lit but the crime rate is higher. \n\nThe streets (W 2nd st, W 3rd st, etc) are generally better to live in on the campus side or west side of the tracks. The campus side in this area is where the frat and sorority houses are, so there are people walking around all the time. It can be loud at times if you live right next to a party house. \n\nOf course, however, you should always be cautious anywhere you go as the amount of transients in Chico has dramatically increased after the fire. Plus, some college students are just assholes. Additionally, there have been reports of potential sex traffickers around the Safeway area on Nord.",
            "score": 2,
            "author": "LeoSeasoning"
        },
        {
            "level": 0,
            "comment": "My friend lives right next to the tracks on the west side and has never had any trouble",
            "score": 1,
            "author": "PowerhouseOfTheHell"
        },
        {
            "level": 0,
            "comment": "I live on west 4th ave and I have never had a problem. I ride my bike which may be partially why but as a girl who is generally by herself I’ve never gotten into anything sketchy or seen anything sketchy. Maybe I’ve just seen worse but it’s really not that bad as long as you aren’t walking by yourself at night. The cheaper rent is definitely a plus as well.",
            "score": 1,
            "author": "jelicar"
        }
    ]
}