{
    "id": "dxmc4n",
    "score": 0,
    "title": "Syllabus Enquiry for MS in CS",
    "author": "imthesanket",
    "date": 1573996070.0,
    "url": "https://www.reddit.com/r/CSUC/comments/dxmc4n",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm planning to do a master's in computer science for fall 2020. While going through the university's website to look for the course structure, I did not find any detailed information about the courses offered under the computer science department. If anyone here has some pdf/any relevant material, please share. It will be really helpful for me. TIA",
    "comments": [
        {
            "level": 0,
            "comment": "Here are [all the courses our department currently has](http://catalog.csuchico.edu/viewer/19/CSCI/offerings.html), although some are evolving because we are actively updating our MS program to suit the needs of what our MS students are looking for. In short, our MS program is going to emphasize getting practical, hands-on experience that will be relevant to computer science careers.\n\nHere is the [catalog of current requirements](http://catalog.csuchico.edu/viewer/19/CSCI/CSCINONEMS.html) to fulfill the MS degree.",
            "score": 6,
            "author": "DrKevinBuffardi"
        },
        {
            "level": 0,
            "comment": "If you need help, e-mail the department or call them.",
            "score": 1,
            "author": "kamimike"
        },
        {
            "level": 0,
            "comment": "It’s all c++",
            "score": 1,
            "author": "lackluster-name-here",
            "replies": [
                {
                    "level": 1,
                    "comment": "C++ is the main focus of our *undergraduate* degree's core programming courses (111-211-311). However, even the undergraduate degree involves upper-division classes that program in other languages.\n\nSome people who enter the MS program will have already completed equivalent courses to that C++ core so they won't have to take them here. The graduate classes (once completing the programming core) use a variety of different programming languages and include courses in Applied Machine Learning, Web Development, Software Design and Maintenance (which I teach and will require programming in languages other than C++), and others.",
                    "score": 5,
                    "author": "DrKevinBuffardi"
                }
            ]
        }
    ]
}