{
    "id": "e4nvln",
    "score": 7,
    "title": "If I am admitted to a CSU for spring semester can I still apply to other CSU’s for fall semester?",
    "author": "bobbzplatters",
    "date": 1575234938.0,
    "url": "https://www.reddit.com/r/CSUC/comments/e4nvln",
    "media_urls": [],
    "other_urls": [],
    "postText": "Can I? I didn’t want to wait an entire year so I applied to a CSU and got admitted, but I plan on transferring schools if I don’t like this one for fall semester. Is it possible? I’m using CalState apply and I want to make sure that it does not interfere  with my current admittance to the university I will be currently attending during the spring semester; for example, I want to make sure that my admittance is not withdrawn due to applying to other universities. The deadline to apply for fall semester is tonight but it got pushed back to Dec 1st because of server issues.",
    "comments": [
        {
            "level": 0,
            "comment": "You can still apply. You may still only be able to transfer a certain number of units however. So if you have already taken 70 units and you take 15 spring semester at chico and decide to transfer you'd only be able to transfer 70 units.",
            "score": 2,
            "author": "not_mrbrightside",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you sure? I thought it was 70 units from a community college. Credits from another CSU should be different since it’s an accredited school.",
                    "score": 1,
                    "author": "bobbzplatters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You may be right. I was just thinking from a community college. I'd talk to a counselor.",
                            "score": 1,
                            "author": "not_mrbrightside"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you coming to Chico as a freshmen or a junior transfer? Transferring to a CSU is a lot harder coming from another four year compared to transferring in from a JC. They tend to prioritize JC transfers and freshman applicants higher than students looking to transfer from other four-year schools. \n\nThat being said, it’s not impossible. But depending on how impacted the program is where you would be headed, that could further complicate things.\n\nSo if, for example, you’re a JC student and you’re all done and ready to transfer but Chico’s more of a safety school than your top choice, maybe wait and apply to your top choice directly out of JC.",
            "score": 2,
            "author": "Spinnak3r"
        },
        {
            "level": 0,
            "comment": "It’s hella funny because I did the  same thing and I was thinking about transferring,  but to be honest there is no point in transferring afterif chico state has the major you are looking for. Chico has a great tuition, housing and teachers.",
            "score": 1,
            "author": "Slupper90"
        }
    ]
}