{
    "id": "g7m2r7",
    "score": 8,
    "title": "Confusion regarding Fall 2020 classes and accepting enrollment during COVID crisis",
    "author": "AngieLeila2020",
    "date": 1587782830.0,
    "url": "https://www.reddit.com/r/CSUC/comments/g7m2r7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I was recently accepted into Chico State after transferring from a community college in the Bay Area. I would need to find an apartment for the year, and I don’t want to sign a lease and pay rent if classes will be held online. I was also accepted into San Jose State, but I would prefer to move out of my house. I don’t want to commit to Chico state without knowing if I will be able to attend classes in person once the COVID pandemic is over. It doesn’t make financial sense to lease an apartment and move my life to Chico, just to attend online classes. Does anyone know when in-person classes will resume? Does anyone know if the university is planning on reaching out to new and returning students regarding the upcoming fall quarter? I’m certain I am not the only person that is concerned about finding living accommodations during this stressful time. Thank you guys, any help is greatly appreciated!\n\nEdit: spelling and grammar corrections",
    "comments": [
        {
            "level": 0,
            "comment": "I was talking to a proffessor about this same topic earlier. According to her, the school is assumed to be starting next semester with in-person classes. However, they are preparing to go online once more if needed. Take this with a grain of salt, as no one really knows what is going to happen. All we can do is wait and see what happens. Sorry that doesn't really answer your question, but the most legitimate answer from what I have heard is \"maybe.\"",
            "score": 11,
            "author": "Roguelan"
        },
        {
            "level": 0,
            "comment": "Honestly, even if classes are online Chico is a great town to live in — even in a pandemic.",
            "score": 7,
            "author": "silesilesile",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chico is way cheaper to live in than bay area. Head out even if you'd be online for the first semester!",
                    "score": 6,
                    "author": "IwillMasticateYou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you plan on going to chico for a while,and you get a apt, even if it does go online, for the next 2 years you will have a place. With the paradise fire apartments are hard to come by, so it might be a good opportunity.\n\nAlso, to my knowledge most apartments require a year lease, so that could be a problem.",
            "score": 5,
            "author": "you90000"
        },
        {
            "level": 0,
            "comment": "A recent email indicated that they would decide if they were moving online by the end of May.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Csuf is going to online for the fall, so it's super hard to say what chico state is going to do.",
            "score": 4,
            "author": "you90000",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, that was misreported. Here is what was posted on their website a few days ago: \n\n\nClarification on fall semester from Provost Pamella Oliver:\n\nIt is the complete hope of Cal State Fullerton to have traditional instruction in the fall. But like every university in America, we are working through the many unknowns of the current pandemic.\n\nThere were reports I said that Fullerton is cancelling classes and going fully virtual for the fall. Let me be clear, that is false. What I said is -that we need to prepare for all variables. Our goal is face to face, on campus instruction, however, we are asking faculty to be prepared to start the semester teaching virtually. This is the correct and prudent choice.\n\n\nhttp://coronavirus.fullerton.edu",
                    "score": 3,
                    "author": "plasticp"
                }
            ]
        },
        {
            "level": 0,
            "comment": " https://www.actionnewsnow.com/content/news/Chico-State-state-universities-will-be-primarily-online-for-fall-2020--570414261.html",
            "score": 1,
            "author": "calilazers"
        }
    ]
}