{
    "id": "gzd2zm",
    "score": 20,
    "title": "I rechecked my portal and more classes have been changed to online",
    "author": "[deleted]",
    "date": 1591666207.0,
    "url": "https://www.reddit.com/r/CSUC/comments/gzd2zm",
    "media_urls": [],
    "other_urls": [],
    "postText": "They’ve been changing more and more classes to online.. a few days ago I only had one online and now all of mine are. I’m taking 3 science classes 2 with a lab and one with a clinical and none are in person. So if you checked a few days ago like I did and thought you had in person, you should check again, and I’m sure they’re not even done changing them.",
    "comments": [
        {
            "level": 0,
            "comment": "Good looks! I rechecked and I went from 2 of my classes being online to 4",
            "score": 6,
            "author": "pigsinpants"
        },
        {
            "level": 0,
            "comment": "Fully online. Fantastic, it's super awesome paying a premium price for a DeVry level education.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "shoulda gone to butte for the semester.",
                    "score": 1,
                    "author": "Blinkinlincoln",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, i already graduated from a solid prestigious community college, with honors in anime.",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like only a super small portion will leave hybrid classes. So most will be online. I'm sure they're not done yet. It's a lot to change \n\nThey are supposed to allow continuing students change schedules July 1-5 so I'd hope it's be done by then",
            "score": 2,
            "author": "Robotashes5"
        },
        {
            "level": 0,
            "comment": "How do you see that they’re online edit I found it nevermind",
            "score": 1,
            "author": "not_mrbrightside"
        }
    ]
}