{
    "id": "iuqt8j",
    "score": 13,
    "title": "For Students Who Struggle with Writing: How to Help?",
    "author": "academico5000",
    "date": 1600371784.0,
    "url": "https://www.reddit.com/r/CSUC/comments/iuqt8j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Here's the deal: I'm not a professor, but I grade student work. And I see that many students  struggle incredibly hard to write clearly. There are numerous issues with clarity of expression, grammar, spelling, punctuation, in the majority of student work, even up to the 300 level (and possibly above).\n\nWhat I see is that professors are, in my opinion, too lenient about this. I am not blaming students for struggling with writing. I think it is a product of many factors, such as shortcomings in K-12 education, many people growing up bilingual and therefore having to switch between two languages, personal home stressors not supporting learning, the rise of tech displacing reading as a pastime (not a moralistic judgment), and other things.\n\nBut I also think that professors are doing students a disfavor by being lenient about writing. People are getting As and Bs (which mean \"exceeds expectations\" and \"superior work\") when their work, in terms of writing, is more like a C or even a D. Their thoughts are not clear and if they turn in resumes or written work for a job that looks like that, they are not going to get hired/will not be kept on.\n\nAdditionally, grade inflation is making degrees worth less. If people come out of college not able to write clearly, then employers will not take a degree from that institution seriously.\n\nAt the same time, students are stressed and get discouraged about a lot of negative feedback. In grading, I really try to give gentle and encouraging feedback, but sometimes someone's writing is so far from where I think it should be at a 200 or 300 level class, or in college at all, that I don't have time to coach people on every little thing. We also need to focus on course content, not writing. We encourage students to go to the writing center, but they often do not, whether due to being overwhelmed, confused, intimidated; I don't know.\n\nSo, if you are a student that struggles with writing - or think you might be, but are not getting feedback about it - what would help you? Do you want to know, or do you not care if your grade is inflated? How would you like to receive feedback about this in a way that is not discouraging?",
    "comments": [
        {
            "level": 0,
            "comment": "I know as a fact that my writing has struggled because of this. Knowing I can get a decent grade for a mediocre essay, I won’t have enough motivation to try hard on it, so I think this is definitely a problem. Getting responses on my essays, however “discouraging” the feedback is, is helpful on improving my writing for the future.",
            "score": 7,
            "author": "Milo-the-great",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for weighing in :)",
                    "score": 2,
                    "author": "academico5000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It took me way too long to accept this method because I’m naturally a good writer but I now swear by OUTLINES. \n\nI took a freshman writing class online through Butte College for fun and to see how students are taught writing now. Holy Shit. I can’t believe how much I learned. \n\nFrom a teaching perspective this teacher forced us to use outlines. The way the course was built is brilliant.\n\nOutline of essay = 50 pts.\nRough draft of essay due following week =50pts.\nFinal essay due following week = 100 pts. \n\nBecause the prep steps were worth so much they had to be done. And doing the outline was a pain, but it made writing the rough draft the night before it was due an easy process and that made it even easier to turn in the final essay. \n\nThe teacher also really did a great job of teaching students how to read and glean material from the readings for the essay but I have been a huge fan of outlines ever since. \n\nChristina Dahl is probably the best English teacher in the area.",
            "score": 4,
            "author": "VROF",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cristina Dahl is great!\n\nHonestly I can guess just by your comment that you are not necessarily the target of my concerns about writing. I grade things that are full of typos, punctuation errors, incorrect word choice (like using \"confer\" to mean \"infer\" or treating antonyms as if they are synonyms), and frankly, sentences that I just do not understand. \n\nSome of this might be people getting nervous about homework and kind of letting that stress interfere with their clarity of writing, when it wouldn't be so hard if they weren't stressing. maybe? It's a guess. \n\nCome to think of it the vast majority of what I read on reddit is often clearer than some of the work I grade, though that is of course biased by which subs I choose to frequent. \n\nMaybe I could include this in a lesson somehow, when I get to be the professor someday...",
                    "score": 2,
                    "author": "academico5000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really believe that using an outline removes the overwhelming feeling from writing an essay. If you can get three ideas down on paper and fill those in the essays kind of write themselves. It really helps with organizing thoughts.\n\nI took this class with my son who at the time was a sophomore in high school and struggling with writing because our schools don’t focus on that. He was intimidated by the process at the start of the semester and overwhelmed by the readings. By the end of the semester he was able to pick apart academic writing and create great essays.",
                            "score": 3,
                            "author": "VROF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of the classes I currently grade for has a lot of revision work like that. Some students still really struggle right from the start, even with the very basic outline exercises. I gave an example of what it looks like in a response to someone else who commented on here.",
                                    "score": 2,
                                    "author": "academico5000"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, remembering basic grammar. I don't remember if I learned how to use a comma properly. I think of myself as a terrible and I feel like having a template doesn't help me because I think that is the only way to create a good paper.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sorry to hear that. What helps with remembering grammar principles? Would something like an interactive tutorial help? I ask this because I've been going through a tutorial on writing myself today, and finding it helpful.",
                    "score": 2,
                    "author": "academico5000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, probably an interactive course would help. Maybe even a crash course on basic grammar. But it really does depend on people's situations. I must have had terrible teachers back in elementary school compared to someone else.",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you want a tutorial on writing mechanics I recommend the APA 7th edition tutorial. Your department may use a different style, so if so just skip ahead to the parts that are relevant. A lot of it is specific to APA, but a lot of it is general writing stuff. \n\nhttps://extras.apa.org/apastyle/basics-7e/#/",
                                    "score": 2,
                                    "author": "academico5000"
                                },
                                {
                                    "level": 3,
                                    "comment": "Your writing looks good to me from what I've seen. The issues I'm thinking of - which are fairly common - include things like not putting a space after a comma or period, or putting an unnecessary space before one. Also adding in unnecessary words and phrases and leaving out key explanatory phrases. So like if you wrote:\n\n\"Yeah ,probably an interactive course would help .Maybe even a crash course on basic grammar. But the issue at hand is that the grammar does indeed depend on the situation of the individual(s) in question.I myself had terrible teachers back then .\"\n\nI'm really not trying to diss anyone, but I don't understand why so many people don't seem to pick up on basic rules of punctuation like not putting unnecessary spaces before punctuation, and making sure to put one after. It just seems like the kinda thing we pick up by immersion. \n\nAnd then like in the example I gave, students will write \"back then\" to refer to 1) a former time in their life or 2) a previous time in history that could be decades or centuries ago without specifying when exactly they mean. \n\nAgain I really don't mean to put anyone down but I'm at a loss. How can I help people with stuff like this? \n\nI also feel like my hands are tied because I try to grade people down for this and the professors I grade for tell me to go easy on them. Which like I said seems to me like not doing anyone any favors.",
                                    "score": 1,
                                    "author": "academico5000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I use the Grammarly extension to catch some mistakes. Although it's not perfect it works most of the time. (100% for removing extra spaces and adding spaces)\n\nIt took me a while to process what you said and now I see. I think people are trying to sound smart. Crunching in those extra words. And/or maybe some people are just lazy to correct their paper. I mean Grammarly will catch those mistakes and correct them.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can definitely see how what I wrote could be confusing. \n\nI'm glad Grammarly is helpful to you. I was thinking about recommending it to students but it seems to have mixed reviews from educators. I'll hold off for now.",
                                                    "score": 1,
                                                    "author": "academico5000"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow I didn’t know this was a problem for upper level students. Maybe you could ask your professor to give a small bit of extra credit to incentivize students to go to the writing center and improve their skills? On an unrelated note, how do you become a grader at Chico?",
            "score": 2,
            "author": "mimosalily"
        },
        {
            "level": 0,
            "comment": "There’s a writing center that’s open to all students, I would direct them there",
            "score": 1,
            "author": "Noxium51"
        },
        {
            "level": 0,
            "comment": "This absolutely is an issue, and as you mentioned, I believe stems from lack of instruction in the lower grades.  It drove me crazy that my son's writing in high school was not more highly critiqued.  When I would help edit his papers, I was ruthless - grammar, spelling, sentence structure, cohesive thoughts - I made him redo all of it.  When I was an entering freshman at UC Davis, we all had to take a writing test, and then based on those results were either allowed to move forward with regular class selection, or were forced to take a \"college writing\" class that had to be passed with a C or higher before we were allowed to register for any other English classes.  I never had issues with my writing in high school, always got As or Bs, so thought I would be in the clear, but even I was put into the \"remedial\" class.  I was pissed at first, but then ended up learning a lot.  This is something every college should do. \n\nSpeaking as a parent of a student at Chico, I want him to get critical feedback. If professors don't want a student's class grade lowered because of writing skills,  maybe there could be a separate grading component, and if you receive lower than a C in the \"writing skills\" portion, you are forced to do a session at the writing center to have it removed.",
            "score": 1,
            "author": "middlezone2019"
        },
        {
            "level": 0,
            "comment": "If you're looking to just fix a students punctuation(I know that's not the whole story), I think them reading a sentence out loud might help them realize where proper punctuation should go.  Eh... that's what I got. haha",
            "score": 1,
            "author": "GerbilSchooler13"
        }
    ]
}