{
    "id": "jaoayc",
    "score": 5,
    "title": "A question from a prospective student",
    "author": "kttrxn",
    "date": 1602628985.0,
    "url": "https://www.reddit.com/r/CSUC/comments/jaoayc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I'm applying to transfer in Fall 2021. I'm majoring in Math. I want to be a math teacher one day. I have one big problem is that I don't know whether I should teach in high school or college, which makes me have a hard time choosing a major to apply.\n\nShould I go for a B.S General Math or a B.S Math Education (focusing on secondary teaching)? And why? Any tips and advice are appreciated. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "First, email the Math department and ask them what their hiring criteria is.  They'll be happy to give you a breakdown.\n\n&amp;#x200B;\n\nHere's what I know:\n\nMost lecturers at the CSU level have a masters level degree in their subject.  You need a PhD to get a tenure position.  If the school is desperate, and you have relevant work experience you might get hired as a lecturer with a bachelors, or if you're currently enrolled in a masters level program.  \n\nMy wife's a lecturer at CSUC and I will tell you first hand it's not an easy job.  The CSU system treats lecturers like doormats.  It's incredibly hard to hold onto the same classes semester after semester b/c anyone with seniority can just take your classes.  Since lecturers are at the bottom of the totem pole, that means just about anyone can steal your classes.  That means the only ones left are the ones that nobody else wants.  \n\nMost lecturers only teach enough classes for the amazing CSU healthplan and CA State pension program.  Often they have a second job/career or a SO with their own career.  It's damn near impossible to make a living wage as a lecturer on your own.... even more challenging to do it with a young family.  \n\nIf you got a masters level Math degree, you'd make a hell of a lot more in the private sector... which is why it's so hard for schools to hire certain types of professors.... math, computer science, nursing, etc....  Again, those that do, often have a \"real\" job somewhere else and choose to stay in academics teaching a class or two because they like the lifestyle/students.   \n\nExample, I had a Health Admin teacher for a couple classes as an undergrad.  He was a Chico native who split his time between his ranch in Chico, and Bakersfield area where he was CEO of Rideout Hospital.  He would take on the good students as interns at the hospital and often hire them right after graduation.  I imagine it was hard to get qualified veteran candidates into his area.  It was a good move for fresh out of college grads to get quick employment with lots of room for advancing their managerial skills &amp; resumes.",
            "score": 8,
            "author": "west_coast_bias",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is very good advice.\n\nOne thing I would like to add: check out our [Mathematics and Science Teacher Initiative](https://www.csuchico.edu/cmse/msti/index.shtml) that can help guide you in getting credentials and has opportunities like scholarships.",
                    "score": 2,
                    "author": "DrKevinBuffardi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Friend got a math education degree and is getting a single subject credential, which is ideal if you want to teach high school and have a door open to also leaves the door open to get a masters degree to teach at a community college or just get paid more for teaching high school. Chico state has a foundational math education degree that limits the level of math you are considered capable of teaching, it is supposed to be for junior high and like freshman/sophomore level math i believe. However, that option is appealing because you dont have to go through the hell that is high level, theoretical math that will *literally never be used to teach high school*. She chose the math ed option with the high level math bc it doesnt close doors for her. that being said, you can always open those doors by taking a competency test to prove that you understand the content for junior/senior year classes, I just dont know if that truly gives you the same capabilities as having a math ed degree and it costs money and time to study for it and everything.",
            "score": 1,
            "author": "lonewolf2556"
        },
        {
            "level": 0,
            "comment": "You should contact the Math Department Chair, not ask random people on reddit.  Tell her that reddit told you to contact them : )",
            "score": 1,
            "author": "chicomathmom"
        },
        {
            "level": 0,
            "comment": "Haha math is so hard just to be a teacher.",
            "score": 0,
            "author": "tossmytestysalad"
        }
    ]
}