{
    "id": "jrptqz",
    "score": 1,
    "title": "Dropping a class",
    "author": "jahgoodone",
    "date": 1605031078.0,
    "url": "https://www.reddit.com/r/CSUC/comments/jrptqz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I remember last semester my roommate dropped a class in second to last week of class. It was due to everything being virtual, chico state allowed that. Can you still do that? There is one class I have no idea what is going on, and i have an open slot next semester to take the class. How do I drop a class?",
    "comments": [
        {
            "level": 0,
            "comment": "Contact the registrar office and explain the situation to them.",
            "score": 2,
            "author": "NaturalSelecty"
        },
        {
            "level": 0,
            "comment": "Fall 2020 has a [temporary policy](https://www.csuchico.edu/sro/covid-grading-updates/fall-2020.shtml):\n\n&gt; # Fall 2020\n&gt; Per recommendation on August 12, 2020, by the Academic Senate Executive Committee, President Hutchinson approves the following academic policies related to grading effective for the fall 2020 semester: \n&gt;\n&gt; For the fall 2020 semester only, students will be permitted to drop/withdraw individual courses without chair or dean signatures and without \"serious and compelling reasons\" until December 11, 2020. This change extends the drop date by a total of 11 weeks—from week four to 15. This change differs from the spring 2020 policy adjustment that required instructor, chair and dean approvals. \n&gt; None of the other grading changes that were effective in spring 2020 will be enacted for the fall semester.\n&gt;\n&gt; Students wishing to request a modification to their classes for fall 2020 should complete an Add/Drop request (PDF)form and submit their completed form to registrar@csuchico.edu. \n&gt;\n&gt; Academic Policies and Regulations, including information on grading, credit/no credit and requirements can be found in the University Catalog.  \n&gt; \n&gt; Please contact the University Registrar by phone at (530) 898-5142 or email to registrar@csuchico.edu with questions.",
            "score": 2,
            "author": "DrKevinBuffardi"
        },
        {
            "level": 0,
            "comment": "I had to drop a class earlier in the semester. Email your professor first, let them know you want to drop. Fill out the add/drop form, and then send the completed form and your teacher’s approval to registrar@csuchico.edu",
            "score": 1,
            "author": "StanLay281"
        }
    ]
}