{
    "id": "oki36x",
    "score": 17,
    "title": "Should I bring a bike to Chico?",
    "author": "[deleted]",
    "date": 1626311129.0,
    "url": "https://www.reddit.com/r/CSUC/comments/oki36x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi so I’m going to be a freshman this upcoming fall, and I was wondering if I should bring a bike? Do students at Chico use bikes to get around? I know it’s not gonna as big of a scene as Davis or Santa Barbara, but would it be worth it?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, you should. Viable, fast way to get around town. We have plenty of bikeways. Just store it inside if you want your bike to stay your bike.",
            "score": 22,
            "author": "Firree",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would just like to piggy back off this comment to state that Chico is notoriously bad for having bikes stolen. So bad so, in fact, that someone jumped over a brick wall at my old work and lifted a bike back over it while we were all inside working.\n\n&amp;#x200B;\n\nMake sure you have your bike locked up, and make sure it's a U-lock (not something that can be easily cut through)",
                    "score": 19,
                    "author": "Ramsfield"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely, I biked for 3 years going to Chico, tons of spaces.\n\nBring a u-lock though or else your bike will be stolen.",
            "score": 11,
            "author": "you90000"
        },
        {
            "level": 0,
            "comment": "Chico is one of the most bicycle friendly cities in the nation. You would regret *not* bringing your bike.",
            "score": 6,
            "author": "gregbard"
        },
        {
            "level": 0,
            "comment": "Biking is absolutely worth it, storage is the only question. If it’s a nice bike, keep it inside in your room. If it’s not as nice as other bikes, use multiple locks to make it as inconvenient as possible to steal. The Mountain biking at Bidwell is top tier, and there’s plenty of opportunities to lock your bike up near downtown if you want to go out.",
            "score": 4,
            "author": "J_0280"
        },
        {
            "level": 0,
            "comment": "Bikes the best one of the best things about Chico is everything is close for the most part",
            "score": 4,
            "author": "invertedcolors"
        },
        {
            "level": 0,
            "comment": "Yes! Chico is predominantly flat making it excellent for biking. There are also some cool trails for a leisurely ride from lower to upper park. Definitely bring a bike but also make sure to bring an excellent lock and don't leave your bike in public overnight locked up or not. Bike theft is a whole ass trade here. I once had someone put a second lock on my bike while I was in class. Campus PD said it was likely someone who planned on coming back later to grab it or someone thought it was their bike that had been stolen. A good reason to also register your bike to avoid any confusion. Happy biking!\n\n\nEdit: fat fingers",
            "score": 2,
            "author": "Educational_BEAN"
        },
        {
            "level": 0,
            "comment": "Yes, biking to one mile is a must.",
            "score": 2,
            "author": "tKnut"
        },
        {
            "level": 0,
            "comment": "Since downtown (and everything for that matter) is really close in Chico, the bike scene is huge. Also since the freshman parking lot is pretty limited, a majority of freshman don’t have a car if they’re living on campus. So if you want to go anywhere farther than where you can walk, I’d highly recommend a bike. Just make sure to bring a U-Lock, theft is huge",
            "score": 2,
            "author": "SkelaKingHD"
        },
        {
            "level": 0,
            "comment": "Get a bike, get a longer than standard u-lock. If you don't have a u-lock, you're practically inviting thieves to steal your bike. Lock your bike suck that the u-lock encompasses a tire, the bike frame, and whatever you're locking to. At least lock up the frame. I would replace all quick-release components with compatible hex head bolts. I specifically recommend replacing the quick release axels of the tires with security axels. Get one that has a non standard head shape, like a triangle.\n\nI know it's a lot, but these are the measures I've gone through to keep my bike secure. I've never had anything stolen off my bike, beside the seat but not seat post, and my front axel, leading to me getting the security axels. This is how I've kept my bike mine for 4 years. I also reocmend looking up how to properly lock up your bike.",
            "score": 2,
            "author": "TintedMonocle"
        },
        {
            "level": 0,
            "comment": "Your primary mode of transportation will undoubtedly be a bike.",
            "score": 1,
            "author": "nakfoor"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Slupper90"
        },
        {
            "level": 0,
            "comment": "Get a bike, get a longer than standard u-lock. If you don't have a u-lock, you're practically inviting thieves to steal your bike. Lock your bike suck that the u-lock encompasses a tire, the bike frame, and whatever you're locking to. At least lock up the frame. I would replace all quick-release components with compatible hex head bolts. I specifically recommend replacing the quick release axels of the tires with security axels. Get one that has a non standard head shape, like a triangle.\n\nI know it's a lot, but these are the measures I've gone through to keep my bike secure. I've never had anything stolen off my bike, beside the seat but not seat post, and my front axel, leading to me getting the security axels. This is how I've kept my bike mine for 4 years. I also reocmend looking up how to properly lock up your bike.",
            "score": 1,
            "author": "TintedMonocle"
        },
        {
            "level": 0,
            "comment": "As long as it is an inexpensive bike.\n\nAssume that it will be vandalized or stolen at some point, so if its a $1200 custom job, leave it at home and buy something used and cheap for school.",
            "score": 1,
            "author": "wolf2600"
        },
        {
            "level": 0,
            "comment": "Yes, ditto all the comments on good locks.  Also, I wouldn't encourage getting a super high-value bike.  People can cut through a U-lock and will take the risk and time for high-valued bikes- or take unlocked components (like a fancy seat)  \n\n\nA lot of folks store their bikes inside their apartments for this reason.  \n\n\nA used bike won't get as much attention.",
            "score": 1,
            "author": "Vast_Ad2325"
        }
    ]
}