{
    "id": "owwv17",
    "score": 10,
    "title": "Internship opportunity at Silicon Valley tech start-up",
    "author": "sirgengar808",
    "date": 1627968922.0,
    "url": "https://www.reddit.com/r/CSUC/comments/owwv17",
    "media_urls": [],
    "other_urls": [
        "https://www.mealme.ai/careers](https://www.mealme.ai/careers)."
    ],
    "postText": "Hi there, I'm currently a software engineering intern for a start up called MealMe. MealMe is an IOS app that compares food delivery services (DoorDash, Uber Eats, GrubHub, etc.) to get users the fastest and cheapest option. We have year-round internship positions for software engineering, marketing, UI/UX design, and operations. Apply at: [https://www.mealme.ai/careers](https://www.mealme.ai/careers). It is in-person in San Francisco, but MealMe also has a remote option.\n\nThanks!\n\n\\-Ben @ MealMe",
    "comments": [
        {
            "level": 0,
            "comment": "All men in the picture. Encouraging.",
            "score": -7,
            "author": "Blinkinlincoln",
            "replies": [
                {
                    "level": 1,
                    "comment": "That picture is a bit of a red flag, but not solely because everyone in it is a man. It would be a hasty, bad faith generalization for a silicon valley startup with only 12 emoyees, in a field that tends to be majority men already to come to that conclusion on just one photo.\n\nMy issue with the photo is that it doesn't look professional enough. That guy in the front left who's wearing a different shirt and isn't smiling looks out of place and changes the mood.\n\nMy advice for you guys is to retake that photo. Have everyone wear professional attire or matching company uniforms . Look at the camera, smile, and keep yours arms down. Otherwise, you look more like a frat or bro club and less like a group that wants to appeal to more and grow their business.",
                    "score": 2,
                    "author": "Firree"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How so? Just pointing out its probably not a great place to work if you value not having a bro culture lol\n\n&amp;#x200B;\n\n&amp;#x200B;\n\noh my, did the people who posted this thread make a new account just to say that person was a part of the problem? Great defensive, totally not bro culture responses.",
                            "score": 0,
                            "author": "SignificantComment43"
                        },
                        {
                            "level": 2,
                            "comment": "Because I want diversity in tech workplaces? Wow.",
                            "score": 0,
                            "author": "Blinkinlincoln"
                        }
                    ]
                }
            ]
        }
    ]
}