{
    "id": "puu58z",
    "score": 8,
    "title": "Apartments?",
    "author": "hnkystnky",
    "date": 1632522914.0,
    "url": "https://www.reddit.com/r/CSUC/comments/puu58z",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m transferring to Chico next semester in the spring and I’m wondering what apartments people would recommend. Also, how soon should I really start trying to find some? I wanna try and move in sometime mid/early January. I’ve been looking at timber creek apartments because I have a few friends who live in an apartment there already and I heard it’s a pretty social apartment complex.",
    "comments": [
        {
            "level": 0,
            "comment": "You should start looking about 3-6 months ago.",
            "score": 11,
            "author": "OrganMeat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t know I was going to Chico 3 months ago :/",
                    "score": 1,
                    "author": "hnkystnky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's going to difficult because normally leases start in either July or August. You'll have to find someone who's leaving chico in the end of the fall semester or try and find a place that will lease a place to you. I recommend posting on the chico house Facebook group and see if you could take someone's lease over in January.",
            "score": 9,
            "author": "MartinTheBean",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would it be good to try and just shoot for university housing when it opens up in November?",
                    "score": 2,
                    "author": "hnkystnky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you take over a lease or move into any apartment, just make sure the other tenants are students (if you want that). I’ve heard some apartment complexes will move you in with older non-students without being clear about that.",
            "score": 3,
            "author": "bealilli"
        },
        {
            "level": 0,
            "comment": "Start looking now! Avoid renting from Chico Sierra Real Estate Management or ChicoForRent. Both owned by the same people and they are terrible. Strongly recommend to read Yelp/Google reviews before signing a lease with anyone. Also recommend thoroughly reading through your lease before signing. Best of luck!",
            "score": 2,
            "author": "Quirky_View_4208"
        }
    ]
}