{
    "id": "s5v2ay",
    "score": 10,
    "title": "need some honest input!",
    "author": "sleepystarfire",
    "date": 1642394166.0,
    "url": "https://www.reddit.com/r/CSUC/comments/s5v2ay",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello! i’m a current senior in high school and have been accepted into cal state chico for fall 2022 as a pre-nursing major. i’m from socal so of course i would have to dorm if i plan on attending csuc. \n\ni’m here to ask about some of the experiences you all have had attending csuc, especially stuff about the housing and the pre-nursing major itself. i plan to do more research, but as of right now, i know little to nothing about csuc. \n\nis the environment and housing nice? are the teachers good? is the student body racially diverse? is it an accepting community? any tips? should i even go? it’s stuff like that that i am wondering. \n\ni would really appreciate some honest and authentic responses! thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "This is 3rd hand knowledge so take it with a grain of salt, but I've heard that the nursing program is EXTREMELY competitive. Like pre-nursing needs a 4.0 GPA to get accepted into the full nursing program. I've heard that the anatomy class is the \"weed out\" class that makes people change majors.",
            "score": 6,
            "author": "TheJaycobA"
        },
        {
            "level": 0,
            "comment": "I’m also from SoCal and in my 3rd year at Chico and can honestly say housing was great! It is pretty diverse and have friends from all groups, still can be culture shock though if you’re not used to being in a majorly white population. Everyone is extremely friendly and people will be saying hi as you pass along quite often in my experience. \n\nI attended housing pre-covid (2019-2020) and it was awesome, so I don’t know how specific the housing works now. It is a great community and you just gotta go with how you feel about being far from home.",
            "score": 9,
            "author": "Canin11"
        },
        {
            "level": 0,
            "comment": "I'm a transfer student this semester, so I don't know so much yet, but I'm happy to answer questions. I got accepted into their nursing program, so I can answer q's about that. Chico is primarily white, I think 40%, which is kind of a culture shock from the bay. Some of the reasons I chose Chico is the relative affordability and the well rated nursing program. It's also considered the last real college town in California which is pretty cool. It's very walkable and has a much more small town vibe than other schools.",
            "score": 5,
            "author": "especiallyknot",
            "replies": [
                {
                    "level": 1,
                    "comment": "You said last true college town but Davis isn’t even like 2 hours away",
                    "score": 2,
                    "author": "popcornjew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "one of the\\*",
                            "score": 2,
                            "author": "especiallyknot"
                        }
                    ]
                }
            ]
        }
    ]
}