{
    "id": "tbzcbg",
    "score": 21,
    "title": "NO MORE MASKS! 🎉🎉🎉🎉",
    "author": "StanLay281",
    "date": 1647030602.0,
    "url": "https://www.reddit.com/r/CSUC/comments/tbzcbg",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This can only go great",
            "score": 10,
            "author": "TintedMonocle"
        },
        {
            "level": 0,
            "comment": "Here we go again",
            "score": 2,
            "author": "icamefordeath"
        },
        {
            "level": 0,
            "comment": "Would really like a new mask mandate that says \"Anyone sneezing or coughing, regardless of vaccination or test status, must wear a mask.\"   It's not really for COVID, but it would cut down the number of sick days for everyone.  It's common courtesy and we all have masks now.",
            "score": 0,
            "author": "NotSockPuppet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disagree with it being a mandate, but it would be sensible if people make a habit of wearing a mask when they're sick and go out in public.  Like in other countries, where that's already been the norm for a while.",
                    "score": 7,
                    "author": "AgreeableYams"
                },
                {
                    "level": 1,
                    "comment": "No thanks. I've had chronic allergies my entire life and dealing with a stuffy nose and the occasional sneeze is a part of my day to day life.\n\nThe last thing I want is to be nannied by a bunch of hypochondriacs who don't understand my situation by forcing such an unrealistic and draconian regulation on me.",
                    "score": 6,
                    "author": "Firree",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "^^\nThis was what I first thought about too. I know plenty of people with bad allergies, always have had them. Forcing people to wear a mask because they appear sick to you doesn’t seem right.",
                            "score": 0,
                            "author": "looter809"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm happy I get to see faces again! I also have difficulty hearing people while they’re talking with a mask. I respect people who choose to wear it and respect those who don't. It shouldn't be mandated if the majority of the student population is double vaxed and boosted. Plus, I have asthma, and climbing three flights of stairs with a mask on leaves me out of breath, and the mask doesn’t help with my wheezing 😅",
            "score": 2,
            "author": "yellowflyinginsect"
        },
        {
            "level": 0,
            "comment": "Yeah no thanks my mask is staying on 😷",
            "score": 1,
            "author": "crackpup"
        },
        {
            "level": 0,
            "comment": "Awesome 👏",
            "score": 1,
            "author": "Logical-Owl1145"
        },
        {
            "level": 0,
            "comment": "Uncommon W",
            "score": 0,
            "author": "Milo-the-great"
        }
    ]
}