{
    "id": "x3vza7",
    "score": 3,
    "title": "what time should i start looking for a roommate for spring 2023?",
    "author": "istilleatnuggets",
    "date": 1662106764.0,
    "url": "https://www.reddit.com/r/CSUC/comments/x3vza7",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey guys! i’m a transfer student starting at chico in spring 2023 and i’ve been wondering how getting/looking for a roommate works in the spring. I think most people get yearly leases starting in the fall so i’m worried that this will make it harder to find a place/a roommate. especially since i’m not looking at anything more than a 2 bedroom with one roommate. should i start looking now? i know of the facebook roommate search groups but they’re all focused on fall housing right now. is it a bad idea to just find a place i like and let them find a roommate for me?",
    "comments": [
        {
            "level": 0,
            "comment": "I’d say start in October/ beginning of November because that’s usually when lease renewals go out if the person has been living there usually in the fall term! Also that’s when more and more housing with become available for spring",
            "score": 5,
            "author": "No-Specialist-5173"
        },
        {
            "level": 0,
            "comment": "Try University village it’s the resident for transfers at chico state",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ve heard bad things about letting apartments find your roommate- could be anyone and any age, not just a students. I think you have time, my kid got his first apartment in the spring, although a lot sign renewal leases in late fall.",
            "score": 1,
            "author": "bealilli"
        },
        {
            "level": 0,
            "comment": "Hi Looking for someone to take over my lease from January 1st-may 31st if you're still interested! $690 a month",
            "score": 1,
            "author": "SEA___BEAR"
        }
    ]
}