{
    "id": "y49u80",
    "score": 4,
    "title": "Communication Sciences &amp; Disorders Major",
    "author": "_moonlightbae_97",
    "date": 1665793778.0,
    "url": "https://www.reddit.com/r/CSUC/comments/y49u80",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I’ll be transferring from a CC in LA. I’m applying locally but I’ve recently visited Chico State and I loved it and my parents support me on going there. \n\nI want to know though if there’s a lot of opportunities for students within this major? \n\nCSUN has a hospital close by and there’s LAUSD where I can count on for school field hours. There will always be opportunities out here in LA. I just want to make sure I can have at least some type of opportunities out there in Chico as well. \n\nIf you’re majoring in this major please reply! Thank you c:",
    "comments": [
        {
            "level": 0,
            "comment": "Chico has a hospital, Enloe ([https://www.enloe.org](https://www.enloe.org)).  I don't know if they have the kind of program you are referring to, but they are the larger hospital in the area.",
            "score": 2,
            "author": "lapsteelguitar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll look into it, thank you !",
                    "score": 1,
                    "author": "_moonlightbae_97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just transferred into the program this year and the professors are really awesome! They are so kind and knowledgeable and I feel like they really care about the field and their students. In undergrad we just watch videos of SLPs working with clients for observation hours, but I’m pretty sure they have lots of placements in grad school!",
            "score": 2,
            "author": "Sea_Place_6016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I got that feeling when I met one of the professors during Wildcat Preview. He was helpful in answering my questions. I can’t wait to start!",
                    "score": 2,
                    "author": "_moonlightbae_97"
                }
            ]
        }
    ]
}