{
    "id": "zq5vz5",
    "score": 9,
    "title": "Computer science 👀👀",
    "author": "Mannysnothere",
    "date": 1671489397.0,
    "url": "https://www.reddit.com/r/CSUC/comments/zq5vz5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I had a few questions about the computer science program! Feel free to write anything about it!\n\n1. Is it hard and is there a lot of work to do?\n2. How is the vibe of the program? Is it super competitive or more friendly (if that’s the right word)?\n3. Are they’re clubs or study groups and how are those if you know?\n4. Anything else you’d likely share\n\nTHANK YOU!!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! I'm a senior in the CS program right now and here are my thoughts on your questions:\n\n1. Like other degrees, the \"hard\" work fluctuates between classes and will vary from person to person. The classes that are generally regarded as the more difficult classes are 311/411(data structures and algorithms and advanced algorithms and complexity, respectively), 440(operating systems), 515(compilers), 551(numeric/parallel programming), and 580/581(artificial intelligence and machine learning, respectively). My general rules for those classes are to avoid taking them during the same semester if possible and to start the homework/projects **as early as possible** if your schedule allows for it. It's pretty easy to fall behind and get overwhelmed with homework especially as you get further into upper-division classes.\n\n2.  I'd say the general vibe of the program is pretty laid-back and chill. There is plenty of resources for help on campus through department tutoring or your professor's office hours as well as the CS discord server if you need/want it. Everyone on the discord is super friendly and willing to help with any questions or issues you have.\n\n3. There are a few CS-related clubs like Usr0, ACM, ACM-W, and Upsilon Pi Epsilon (UPE). Usr0 is the cybersecurity club and it goes over offensive cybersecurity tools and prepares for a competition called National Cyber League (NCL) that's held once per semester. ACM is a club that does leetcode problems during their meetings if that's something you would be interested in. I haven't attended ACM-W meetings so I'm not entirely sure what their club does during them, but both ACM and ACM-W host events throughout the semester that are open to everyone! UPE meetings usually have something to do with industry prep/advice. They've held several meetings this semester that focus on career talks with Chico CS alum that are super beneficial imo. \nAs far as study groups go, I'm not aware of any official study groups available through the school, but there are plenty of study spaces in O'Connell and the library if you have a group of classmates that you want to study with.\n\nLet me know if you have any more questions and I'll try my best to answer them!",
            "score": 7,
            "author": "curious_californian9",
            "replies": [
                {
                    "level": 1,
                    "comment": "3.) There is also a couple of different discord servers you can join and find a lot of useful help and tips",
                    "score": 2,
                    "author": "LebLift"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there good intership opportunities at Chico?? I got accepted for fall 2023 but still thinking of I should attend or do to another school",
            "score": 1,
            "author": "mando-1905",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yea i ended up getting into Cal Poly Pomona.",
                            "score": 1,
                            "author": "mando-1905"
                        }
                    ]
                }
            ]
        }
    ]
}