{
    "id": "13kh8te",
    "score": 64,
    "title": "[REQUEST] Shows or movies similar to Godless (2017)",
    "author": "kitobich",
    "date": 1684364792.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/13kh8te",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm not typically into Westerns but I loved this one. I loved that it's female-driven but this is not a must. I'm looking for recommendations of similar shows or movies with this sort of vibe, character development, unique relationships between characters. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Haven't seen it but 1883 has a lead that is female. 1923 but not so much western anymore. Deadwood on HBO.",
            "score": 10,
            "author": "Frank3634"
        },
        {
            "level": 0,
            "comment": "Godless was such a great show. Can't believe that was like 6 yrs ago!",
            "score": 9,
            "author": "trashpocketses"
        },
        {
            "level": 0,
            "comment": "It's on Amazon Prime (or BBC iPlayer if you can get that), but you might appreciate [The English](https://www.rottentomatoes.com/tv/the_english) with Emily Blount.\n\nI recently rewatched [Unforgiven](https://www.rottentomatoes.com/m/1041911-unforgiven) — great story, great characters, great acting. It won Best Picture and it's not difficult to see why. You might to have unfurl your sails to watch it in the States.",
            "score": 9,
            "author": "it_vexes_me_so",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thumbing here for Unforgiven. There's a whole subgenre of old Westerns that are not *quite* Unforgiven (and Godless), but are pretty close. The Fistful of Dollars trilogy; Once Upon a Time in the West; Outlaw Josey Wales. There are others, too, but that's where I'd start.",
                    "score": 7,
                    "author": "ds3272",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Outlaw Josey Wales may be my favorite western.\n\nthe [\"Iron in your words\"](https://www.youtube.com/watch?v=eyPZFi2b380) scene is just perfect",
                            "score": 1,
                            "author": "RobGrogNerd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The English (prime video)",
            "score": 6,
            "author": "Dusty_Harvest"
        },
        {
            "level": 0,
            "comment": "Top of the Lake isn’t s a western, but has a community of strong woman w the same vibe and led by Holly Hunter.",
            "score": 4,
            "author": "bookfloozy",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;led by Holly Hunter.\n\nElisabeth Moss.",
                    "score": 2,
                    "author": "RobGrogNerd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holly Hunter lead the group of women referenced. Elizabeth Moss is the detective.",
                            "score": 2,
                            "author": "capitanafantastic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had completely forgotten she was in it.\n\nMea Culpa",
                                    "score": 2,
                                    "author": "RobGrogNerd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Much respect.",
                                            "score": 2,
                                            "author": "capitanafantastic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol...\n\nsomeone on the internet admitted they were wrong!",
                                                    "score": 2,
                                                    "author": "RobGrogNerd",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have to admit I was shocked! Lol",
                                                            "score": 2,
                                                            "author": "capitanafantastic"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Quick and the Dead is about a gunslinger tournament.  It has a packed cast including Gene Hackman, Sharon Stone and Leo DiCaprio.\n\nI highly recommend Taylor Sheridan's \"new western\" trilogy.  They are grim, and they are set in the present.  If you've seen No Country for Old Men, it's more that type of vibe.  Sheridan is a juggernaut now with his Yellowstone stuff, but I think his storytelling is much better in movie format with the time constraints involved.  The movies are Sicario, Hell or High Water, and Wind River.  Personally, Hell or High Water is my favorite.\n\nSicario is dark, and deals with cartel violence.  Wind River isn't as dark, but does deal with sexual assault.  Hell or High Water is probably the lightest of the three, but only by comparison.",
            "score": 3,
            "author": "CorporateNonperson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for the thorough answer and recommendations! Will definitely check these out.",
                    "score": 2,
                    "author": "kitobich"
                },
                {
                    "level": 1,
                    "comment": "Watching 1883 and loving it. Will definitely watch the rest of the trilogy. Exactly what I was looking for. Thanks again!",
                    "score": 2,
                    "author": "kitobich"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bad Sisters on Apple, excellent writing and acting. Pretty much has all the vibes you are asking for",
            "score": 3,
            "author": "DominusGenX"
        },
        {
            "level": 0,
            "comment": "\"Hell on Wheels\" is good, but not on Netflix.",
            "score": 2,
            "author": "jimmythegeek1"
        },
        {
            "level": 0,
            "comment": "Bc I understand the vibe you loved (strong women overcoming odds together in great storytelling and character development) I’ve thought long and hard and come up with these. Hope you enjoy. \n\nBack to Life\n\nStation Eleven\n\nEnlightened\n\nBig Little Lies\n\nThe Morning Show\n\nSomebody Somewhere\n\nThe Handmaid’s Tale\n\nThe Wilds",
            "score": 2,
            "author": "capitanafantastic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, much appreciated!",
                    "score": 2,
                    "author": "kitobich"
                },
                {
                    "level": 1,
                    "comment": "And The OA if you’re feeling down.",
                    "score": 1,
                    "author": "capitanafantastic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Barbarians",
            "score": 0,
            "author": "XenomorphXx121"
        }
    ]
}