{
    "id": "13l1jfs",
    "score": 154,
    "title": "[Discussion] Sweet Tooth Season 2. Looking for more shows with the same vibes as Sweet Tooth?",
    "author": "DinoCoiner",
    "date": 1684422299.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/13l1jfs",
    "media_urls": [],
    "other_urls": [],
    "postText": " Season 2 of Sweet Tooth was absolutely amazing!  This show is a delightful blend of heartwarming moments, suspense, and hope.  The characters were so well-crafted, and witnessing Gus's growth and development was a joy. Can't wait for Season 3.",
    "comments": [
        {
            "level": 0,
            "comment": "It's on HBO/Max but His Dark Materials would perhaps fit the bill.",
            "score": 34,
            "author": "malicious_joy42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I feel like this show is better binged.",
                    "score": 5,
                    "author": "_mikedotcom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For sure. The storyline is intricate enough that any breaks in the flow throw off the narrative.",
                            "score": 3,
                            "author": "itwillmakesenselater"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you I will give it a shot.",
                    "score": 3,
                    "author": "DinoCoiner"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the same vibes. But definitely on a similar wave: \n\n- *Station Eleven* (HBOMax)\n- *Tales from the Loop* (Amazon)",
            "score": 14,
            "author": "spinach-e"
        },
        {
            "level": 0,
            "comment": "I watched it and enjoyed it but it's no where near as good as the first season.",
            "score": 14,
            "author": "RXL",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried to watch Season 2  but I felt like it was made for kids only. Didn't even bother after a few minutes..\n\nSeason 1 was better.",
                    "score": 9,
                    "author": "gh0rard1m71",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay season 2 is for infants then..",
                                    "score": 2,
                                    "author": "gh0rard1m71"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dang. Haven't watched S2 yet but hoping for the S1 magic.",
                    "score": 2,
                    "author": "BadMeetsEvil24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought it was just as good",
                            "score": 1,
                            "author": "ElysianBlight"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first season I thought it would be a kids show, but heard rave reviews so gave it a shot. Nope…not a kids show. Great development, not sure anything else like it. Maybe Stranger Things? I enjoyed it too.",
            "score": 14,
            "author": "Jolly_Green66",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same, I thought was going to be rated PG or something. \n\nIt’s funny though because it does vibe like a kids show with the narrator and certain moments with the children. Which I kind of like to be honest.",
                    "score": 8,
                    "author": "PrincessNakeyDance"
                },
                {
                    "level": 1,
                    "comment": "Second season feels like a total kids show\nDidn't like it at all.\n\n\nHuge plot holes, pacing issues and total suspension of disbelief required.",
                    "score": 6,
                    "author": "TurtlesAreDoper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you read the source material? Or was it not the story that gave you moments of disbelief?",
                            "score": 1,
                            "author": "SnatchAddict",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not the story. Dog shit production.\n\n\nLike the car chase. Dude just turns left and loses the other car, and the entire thing was so hokey.\n\nThere's a bunch of shit like that",
                                    "score": 5,
                                    "author": "TurtlesAreDoper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or like when [the bus full of kids drives by the general and his goons and nobody shoots their tires](/spoiler). Lots of times actually when people with guns simply don't use them.",
                                            "score": 5,
                                            "author": "mercurus_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, guns are absolutely useless. And if you're going to do that, then just don't have them in there. That easy. Very stupid",
                                                    "score": 2,
                                                    "author": "TurtlesAreDoper"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gotcha. I really enjoyed Bobby's one liner. The entire thing was like Mad Max muppets and was fairly hokey.",
                                            "score": 2,
                                            "author": "SnatchAddict"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I also got that Stranger Things storyline vibes.  Sweet Tooth started off good but it fell off in the 2nd season for me.  Comic book villain guy (red glasses) seems way over the top and I just couldn't take him seriously but I know it's a show aimed at younger folks.  I'm 2 episodes left but I stopped my binge like a week ago.  I'll probably watch the 3rd season to see where it's headed.",
                    "score": 2,
                    "author": "saruin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Second season is horrible. Wtf was that car chase.  Really seems like the first season was aimed at adults, second season seems to be for young children",
                            "score": 1,
                            "author": "TurtlesAreDoper"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shadow and bone is awesome.",
            "score": 7,
            "author": "Iwillpirateanything"
        },
        {
            "level": 0,
            "comment": "Locke and Key",
            "score": 8,
            "author": "vimfan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I been thinking about this how is the pacing",
                    "score": 1,
                    "author": "AlyssaInw0nderland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's one of those continual \"just think they've sorted things out and then there is another problem\" type of stories.  It does have some twists, some of which I think had plot holes, but was enjoyable to watch, and was interesting to gradually learn what was going on over time.",
                            "score": 1,
                            "author": "vimfan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On HBO, but The Last of Us is similar in that Ellie’s relationship with her caretaker Joel is kinda like the relationship between Gus and Big Man.",
            "score": 6,
            "author": "SpearmintInALavatory"
        },
        {
            "level": 0,
            "comment": "The Last of us",
            "score": 1,
            "author": "Tiny-Layer-6723"
        },
        {
            "level": 0,
            "comment": "Atypical (not sci-fi but meets your criteria)\n\nLocke &amp; Key (a little predictable, but an easy watch)",
            "score": 1,
            "author": "i__cant__even__"
        },
        {
            "level": 0,
            "comment": "Jericho for end of the world/society building with a bit of tension and excitement. \n\nOnce Upon a Time for fairy tale vibes, same creators as Lost. Season one is the best but since the show always reaches from fictional stories it always finds something.",
            "score": -3,
            "author": "invaderpixel"
        },
        {
            "level": 0,
            "comment": "Its because it came from a comic book that vibe is trying to hit your inner child, i agree not all comics are like that but i digress",
            "score": -1,
            "author": "TheMightyHead",
            "replies": [
                {
                    "level": 1,
                    "comment": "The comic is much darker and more adult than the show, the show is definitely toned down and aimed at all ages.",
                    "score": 3,
                    "author": "Eupatorus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Appreciate the insight, ive loved the show",
                            "score": 1,
                            "author": "TheMightyHead"
                        }
                    ]
                }
            ]
        }
    ]
}