{
    "id": "13r216k",
    "score": 15,
    "title": "[request] stuff to watch this weekend after oral surgery?",
    "author": "dogs0z",
    "date": 1684972391.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/13r216k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking for things to help pass the time on TV/movies. I'm getting oral surgery tomorrow and I'm supposed to be on couch rest for the whole weekend and in the USA. It's a long memorial day weekend. looking for stuff that can hold my attention with a good story. \n\nI have Netflix, Prime, hob max, Hulu, diesny+, peacock, paramount+ \n\nThe most recent titles I've watched is everything Star Wars on Disney+. I've watched all of the marvel stuff on Disney+. I like Witcher. I like House of the Dragon. I like Bridgerton. I like Virgin River. I liked Warrior nun.. I liked the Boys. I like Selena plus chef. \n\nI liked Yellowstone for the first four seasons, but it really wasn't that great. I think it's overhyped. But I would watch season five when it comes out on streaming. I really like the first couple seasons of Lucifer, but the last season just kind of like dragged on, so I never finished it. Not a huge fan of Crime sagas, I mean I watch them once in awhile if it is a movie but it's not like I'm obsessed with NCIS or CSI or something. \n\nnothing horror or scary.  I am a baby\n\nand no sad stories please. (nothing like my sisters keeper) \n\nRom coms are fine. \n\nI tried watching the great British bake off, but to be honest that show is so boring.  So I'm looking for something that's really good and I can hold my attention throughout the whole weekend. Or like a collection of franchises, I can watch throughout the weekend.",
    "comments": [
        {
            "level": 0,
            "comment": "I swear y’all are going to think I’m a shill for this show…. but… Derry Girls. Come for the humor, stay for the relationships.",
            "score": 6,
            "author": "MotherofHedgehogs"
        },
        {
            "level": 0,
            "comment": "You like space stuff, have you watched the Expanse on Prime? It is worth it!",
            "score": 4,
            "author": "Admirl_Ossim06"
        },
        {
            "level": 0,
            "comment": "Marathon Man starring Dustin Hoffman. \n\nJust kidding, please don't.",
            "score": 3,
            "author": "SpleenBender"
        },
        {
            "level": 0,
            "comment": "The Good Place\n\nBetter Call Saul\n\nThe Umbrella Academy\n\nCunk on Earth\n\nSense8",
            "score": 3,
            "author": "ice1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Umbrella academy highly recommended by me too I love that",
                    "score": 1,
                    "author": "LateChalk51"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imposters on Netflix. One of my favorite shows. I don’t want to reveal too much, just give it a try :)",
            "score": 2,
            "author": "danaredding"
        },
        {
            "level": 0,
            "comment": "Arrested Development",
            "score": 2,
            "author": "Charles_Deetz"
        },
        {
            "level": 0,
            "comment": "Have you seen MadMen? I personally loved it but it’s not everyone’s taste, Broadchurch is a British crime drama, also Line Of Duty, (I spent time in UK) good luck and make sure you have soft good snacks",
            "score": 1,
            "author": "mmbg78"
        },
        {
            "level": 0,
            "comment": "I know you said you're not a huge crime fan, but since you mentioned CSI in that context I'm gonna go ahead and recommend The Wire and The Sopranos. Some of the best tv ever from a critical consensus perspective and very entertaining imo, plus lots of seasons.",
            "score": 1,
            "author": "ManchuriaCandid"
        },
        {
            "level": 0,
            "comment": "We have similar taste in shows I think. Have you watched the Marvelous Mrs. Maisel?\n\nAlso Ted Lasso is on apple +, but you can watch it all on a free trial. Excellent show. It’s about a sports team but you absolutely do not need to like sports to enjoy it. \n\nI also recommend The Great.",
            "score": 1,
            "author": "devilsho"
        },
        {
            "level": 0,
            "comment": "the outsider on hbo, curb your enthusiasm",
            "score": 1,
            "author": "pfifteen"
        },
        {
            "level": 0,
            "comment": "YOUNG ROYALS netflix",
            "score": 1,
            "author": "krystalgayl"
        },
        {
            "level": 0,
            "comment": "Crazy Ex Girlfriend, Derry Girls, Lucifer, The Good Place, Dead To Me, The Crown, Peaky Blinders, The Queen’s Gambit, Norsemen…so many great shows. Wishing you a speedy recovery!",
            "score": 1,
            "author": "Chemical_Egg_2761"
        },
        {
            "level": 0,
            "comment": "Arcane is solid",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The IT Crowd. Hilarious series!  I got my whole family into it, we quote it regularly.",
            "score": 1,
            "author": "PrefabMinicomputer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you tried turning it off and on again?",
                    "score": 1,
                    "author": "-Past-my-Bedtime-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been stuck in a hospital bed for months. Decided to watch all of the Star Trek shows I skipped over decades ago. After that I went through every Stargate show (there are three) and movie (three again, not counting “Origins” which I’m told sucks). \n\nYeah, a lot of scifi stuff, but I like scifi and they were serial so makes a long story, great for binging.",
            "score": 1,
            "author": "Jolly_Green66"
        },
        {
            "level": 0,
            "comment": "watch bullet train let me tell you what it offers\n\nit has eye catching visuals\n\namazing characters/story\n\namazing fights too\n\n&amp;#x200B;\n\nthere is never a dull moments in this believe it's perfect",
            "score": 1,
            "author": "goldyofgold"
        }
    ]
}