{
    "id": "13s2xyg",
    "score": 460,
    "title": "[REQUEST] Is Ozark worth watching?? Requestiong your true views on this show? Will definitely watch if it’s redditors approved. 🙏🏻 ❤️😇😇",
    "author": "Deepanjalii",
    "date": 1685074779.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/13s2xyg",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Really cool show. One of Netflix’s best.",
            "score": 146,
            "author": "bdog556",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow I’m hyped! Thanks😊",
                    "score": 16,
                    "author": "Deepanjalii",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's worth watching.  There are a number of interesting curve balls.  Great cast!",
            "score": 243,
            "author": "SillyJBro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thanks 😊",
                    "score": 17,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A few years ago I tried watching the first episode and quit about 1/2 way through it.  At the time I just wasn't interested in that type of show. \n\nI gave it another go last year and ended up powering through all the eps, it was an amazing series.",
                            "score": 2,
                            "author": "Freakwilly",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YYYEEEESSSSSSSS. I binged the whole thing recently and LOVED it.\nDefinitely recommend!",
            "score": 40,
            "author": "TheFerociousFirefly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thanks😊",
                    "score": 6,
                    "author": "Deepanjalii"
                },
                {
                    "level": 1,
                    "comment": "Duno why I stopped watching (just before they built the casino), I thought it became too boring and repetitive. I should probably try and what the whole lot.",
                    "score": 4,
                    "author": "Aggressive_Strike75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. It's good and the plot moves quickly but somehow I still ended up reading the Wikipedia episode summary and not really being into it. Maybe I'll try again at some point.",
                            "score": 2,
                            "author": "riricide"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea its worth it, the last season goes a bit off the rails in the second half but still pretty good.",
            "score": 79,
            "author": "Cybralisk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. I'm not sure what I was hoping for out of the last season, but I didn't quite get it. Still very solid series overall.",
                    "score": 5,
                    "author": "Carb-BasedLifeform"
                },
                {
                    "level": 1,
                    "comment": "Ok thanks 😊",
                    "score": 10,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m gunna play devils advocate here bc I didn’t love it overall. First season was solid, second had some good parts then I think it went really down hill. \n\nI’d say check it out though and if you really dig it then keep watching",
            "score": 172,
            "author": "RBlomax38",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah we fizzled on it in the second season. I think the color pallet got to me a little bit lol. Some very good characters in the show, and the concept and drama is interesting. I think it just got a little bleak for us, the episodes are longer, and it just wasn't enjoyable for us during covid and having an infant child. Definitely think our experience should be taken with a grain of salt.",
                    "score": 42,
                    "author": "sumofun",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm with you.  I liked it at first but found the characters unlikable and the the plot too repetitive.",
                    "score": 28,
                    "author": "guyincognito60",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Episode x: conflict calls the family’s plan into question, Marty talks his way out of an impossible problem, Wendy magically has more political sway than anyone in the State, the kids cope with their parents telling them the truth about everything, Ruth is mad about something.",
                            "score": 24,
                            "author": "DoobieBrotherhood"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I love the actor but the main character is delusional. Can't relate.\n\nI'm a different kind of delusional that doesn't put other people in danger.",
                            "score": 3,
                            "author": "No_Choice_Is_Choice"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You're right. Seasons 1 and 2 were good; then it went bad. I stopped watching a couple of episodes into Season 3.",
                    "score": 9,
                    "author": "befitstayyoung"
                },
                {
                    "level": 1,
                    "comment": "Yea I’m half way through the final season and just can’t get myself to sit down and wrap it up.",
                    "score": 6,
                    "author": "xTugboatWilliex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Finish it! It gets crazy near the end.",
                            "score": 2,
                            "author": "The_Original_Gronkie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks 😊❤️\nYou are not alone I’m getting heavily downvoted for this show so I think I’m not as excited as I was before now I guess🥲",
                    "score": 8,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a very polarizing show. I personally thought it was very good for a first watch but on a rewatch I thought it was absolutely ass after the first season. It’s like a 10/10 for the first two seasons and the interest carries over nicely if you just binge through the whole show at once",
                            "score": 4,
                            "author": "only_personal_thungs"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  I’m getting heavily downvoted for this show \n\nPretty sure you are getting heavily downvoted for your obsequious post title and overuse of emojis.",
                            "score": 17,
                            "author": "WeAteMummies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see, what should have been the title according to you then? And I love emojis, is there anything wrong about it?😅",
                                    "score": 10,
                                    "author": "Deepanjalii"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thus showing how reddit focuses on the really important issues in life.",
                                    "score": 8,
                                    "author": "dusmeyedin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People who downvote others because they express an opinion about a TV show really need something to do. If you can't contribute to the conversation, leave.",
                            "score": 27,
                            "author": "bop426",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s a sub I frequent for room redecorating and the amount of downvotes someone will get sometimes for a suggestion like painting a wall a certain colour is staggering. You’re  going to ruin someone’s karma over the colour green? It’s ridiculous.",
                                    "score": 12,
                                    "author": "ptatersptate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People can be mean sometimes but thankfully mostly this sub has been helpful and respectful with their views 😊❤️",
                                            "score": 3,
                                            "author": "Deepanjalii",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the reason it's getting down voted is it has shill written all over it. \n\nYour only going to watch some thing if it's redditor approved? That seems like a Netflix exec trying to save their job by showing people are talking about the show they green lit. \n\nMost of these posts asking is {show} good are probably shill posts.",
                                    "score": 1,
                                    "author": "trizkit995",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Omg i just use emojis because I like them, I never thought people can deduce so much from such a random post lol",
                                            "score": 5,
                                            "author": "Deepanjalii"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What? Why would you assume they're a shill instead of someone who wants to know if something is good?",
                                            "score": 4,
                                            "author": "CouncilmanRickPrime",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not the person you asked but I also find this post to be very disingenuous. It's the emojis and the way they start out by kissing reddit's ass. That's just not how things are done around here.",
                                                    "score": 1,
                                                    "author": "WeAteMummies",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Omg i just use emojis because I like them, I never thought people can deduce so much from such a random post lol",
                                                            "score": 2,
                                                            "author": "Deepanjalii"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Reddit tends to downvote anything that contains an emoji, nevermind a bunch of them. \n\nI wouldn’t say it has anything to do with the show, which is often discussed on a weekly basis as being one of the greatest shows on Netflix.",
                            "score": 2,
                            "author": "oldmanwrigley",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My family loved Ozark and we’re picky about what we watch. Sure, it has episodes that are better than others, but that’s true of all shows",
                            "score": 2,
                            "author": "TreesRart"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great show, gets a bit into the realm of ridiculous or unbelievable towards the end, but still a great show with great characters and amazing acting",
            "score": 27,
            "author": "Anon_Rocky",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thanks 😊",
                    "score": 7,
                    "author": "Deepanjalii"
                },
                {
                    "level": 1,
                    "comment": "Yes that's my problem. And it's both that the world seems ridiculous and also the characters do things that don't seem consistent with them as characters",
                    "score": 3,
                    "author": "User-no-relation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Suspension of disbelief. Some actions and some threads of the story seem a bit extraordinary, but still within the cusp of the character, if you just give it a little bit of tolerance. Focus on the acting, because it's top notch all around",
                            "score": 2,
                            "author": "Anon_Rocky"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first season was great but it went down hill from there, still worth watching just for the acting by Ruth",
            "score": 18,
            "author": "Disappear_the_ussr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am in the process of re-watching Ozark right now and realizing how much I missed the first time through. Yes, there are some flaws, as with most shows, but In my opinion, Ruth Langmore (Julia Garner) is probably one of the best characters ever played. Also, Tom Pelphrey's character is really good also. I just like the show, and the cast, so, I would say watch it!",
                    "score": 8,
                    "author": "MsStrongarm-4144",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard rumor there would be a spin off with Ruth. I’m just saying there will be an i direction if anyone but Julia Garner ever plays Ruth. She was fantastic; I agree she was one of the best actress / character match ups ever.",
                            "score": 6,
                            "author": "Disappear_the_ussr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a lot of crap content on streaming but this is a very solid series. All the seasons were entertaining and good for various reasons. Even if viewers don’t get the outcomes they want. Though I will agree, the last season could have been tighter. Still good.",
            "score": 7,
            "author": "Staci_NYC",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I might be the minority but I didn't really like it. I wanted to know the ending so I pushed through, but there were so many aspects of it that were annoying me all along that I mostly remember the negative. This family is so unlikable, I love a good antihero story, but this is just plain ridiculous and annoying. If it wasn't for Jason Bateman, I would never have watched season 2.   \nI would give the whole thing a 6/10.",
            "score": 6,
            "author": "Maxence011"
        },
        {
            "level": 0,
            "comment": "Great start but then it’s you scratch my back, I scratch your back all the way to the finale. \nI give it 7/10",
            "score": 39,
            "author": "fuvgyjnccgh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh ok thanks😊👍",
                    "score": 7,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It possibly went one season too far, but it's still a great show, in my eyes. Julia Garner is adorable as Ruth.\n\nThat said, the length of time between seasons 3 and 4, possibly left me disconnected, bingeing it might help. Also the decision to split season 4 completely ruined it.",
            "score": 4,
            "author": "corpus-luteum",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's one of the top 5 shows that's suggested in this sub, so reddit will approve it. I personally did not enjoy it. My boyfriend loved it &amp; I watched a few episodes with him, but I found all of the characters to be too obnoxious or annoying for my taste. I'm also at a point in life where I don't like watching a lot of depressing stuff, so it's a no-go for me, but most people seem to love it, so you should give it a shot.",
            "score": 5,
            "author": "possiblycrazy79",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing 👍 wow i didnt knew its kinda depressing series. Thanks for the heads up",
                    "score": 1,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My husband loved the show.\n\nI couldn’t stand the wife. I like literally couldn’t watch past the first few episodes because of her.",
            "score": 24,
            "author": "forevereasygoing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. Couldn't stand her.",
                    "score": 8,
                    "author": "TheGoodBunny"
                },
                {
                    "level": 1,
                    "comment": "I hated the wife, I have to be honest.",
                    "score": 7,
                    "author": "corpus-luteum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "HATED!",
                            "score": 3,
                            "author": "forevereasygoing"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks 😊I’m thinking of skipping it now too!",
                    "score": 2,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't skip it. Has a lot of great reviews. I was really disappointed after the last episode, only because it was finished. I loved it. Can be a bit brutal and violent in parts, but I would Def's recommend it",
                            "score": 14,
                            "author": "xponti",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks. I’ve again made up my mind to watch it because people who like it are seem to raving about it. Thanks😊",
                                    "score": 3,
                                    "author": "Deepanjalii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahaha. Deep bro, you are gonna love it. I am also watching it currently",
                                            "score": 1,
                                            "author": "Voldemort_is_muggle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The first season is really good, you should at least let yourself make a decision as to whether YOU like it.",
                            "score": 3,
                            "author": "corpus-luteum",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If you want my personal opinion, sure she might be annoying at times but that's just her character. There are some very interesting characters in that show.  \nI'd advise you to watch 1-2 episodes. If after 2 episodes you don't want to watch more, then it isn't for you.",
                            "score": 4,
                            "author": "batigoal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok nice advice I’ll try it and lets see 👍😊",
                                    "score": 3,
                                    "author": "Deepanjalii"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Second best series I’ve ever watched. \n\n(After Breaking Bad)",
            "score": 17,
            "author": "worldsinho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh my god this is the hype I was looking for. Thanks 😊",
                    "score": 4,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude no. It follows the breaking bad plot but in a stupid way. It's nowhere near as good. The frost season is very good, and then it gets dumber and dumber after that",
                            "score": 11,
                            "author": "User-no-relation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not to mention there are very few good characters in the show. I personally don't like most of them, and I can't stand the wife. In last season I found myself just trying to finish it and see how it would end rather than enjoying a good show.",
                                    "score": 5,
                                    "author": "NganHi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, Laura Linney is a capable actor and the show basically wasted her. Julia Garner was just about the only actor on that show who got enough meat to be able to do anything good with her character.",
                                            "score": 2,
                                            "author": "judasblue"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Damn this show has such polarising views🥲\nBut I hear you!! Thanks for sharing 😊",
                                    "score": 3,
                                    "author": "Deepanjalii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's good, but it's overhyped. That's basically the deal.\n\n Coincidentally, I watched it right after a rewatch of Breaking Bad and there are a lot of parallels. A man who's a genius at his (legal) profession turns their skills to crime and has to balance their criminal activity and keeping their family together and safe from a scary Mexican cartel leader. Breaking Bad is smarter and more surprising and just better, but Ozark is still good and worth watching. Anyone who thinks they're anywhere near equal just isn't that discerning, but it is still good.",
                                            "score": 2,
                                            "author": "sllewgh",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ratings and expert reviews will concur it’s second to only BB :)",
                                            "score": 1,
                                            "author": "worldsinho"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That show is awesome, but frankly, it would be about 15 minutes long if people would just listen to Jason Bateman.",
            "score": 3,
            "author": "rock-hound",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes. Blonde curly haired girl acting is amaze balls",
            "score": 3,
            "author": "l33tWarrior"
        },
        {
            "level": 0,
            "comment": "The ending was so terrible and not up to the standard of previous seasons. I have stopped recommending it to people.",
            "score": 3,
            "author": "ECW94"
        },
        {
            "level": 0,
            "comment": "Loved Ozark. It has a few weak plot points later in the series but I think it’s enjoyable and def worth watching if you like crime dramas",
            "score": 3,
            "author": "jperiodcarter"
        },
        {
            "level": 0,
            "comment": "I wanted to like it, but I found it to be store brand Breaking Bad. I think I watched season 1, liked it ok, but season 2 had obvious plot devices and the characters and situations just seemed too contrived.",
            "score": 3,
            "author": "nolowputts"
        },
        {
            "level": 0,
            "comment": "In my opinion, no. There's so much good stuff to watch and this is middling at best.",
            "score": 3,
            "author": "kevtron3k"
        },
        {
            "level": 0,
            "comment": "Absolutely not. Won't spoil it, but the ending was for shit. IMO.",
            "score": 3,
            "author": "philmwrites"
        },
        {
            "level": 0,
            "comment": "It’s 3/5ths of a top 20 show and 2/5ths of a mostly average show",
            "score": 3,
            "author": "tygerbrees"
        },
        {
            "level": 0,
            "comment": "1000000% worth watching. One of my fav series.",
            "score": 15,
            "author": "msmei",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey thanks 😊",
                    "score": 4,
                    "author": "Deepanjalii"
                },
                {
                    "level": 1,
                    "comment": "I agree. I thought it was excellent.",
                    "score": 2,
                    "author": "bop426"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1000000000000000000000000000000 percent.",
            "score": 9,
            "author": "howcanshehowcanshe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol ok😊thanks for sharing, will watch it 😇",
                    "score": 3,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought it was excellent.",
            "score": 6,
            "author": "MaCauleyCulkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool. Thanks.",
                    "score": 2,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you liked breaking bad, it has a similar tension level. I certainly wouldn’t skip it.",
                            "score": 2,
                            "author": "MaCauleyCulkin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m in. Definitely watching.👍",
                                    "score": 2,
                                    "author": "Deepanjalii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glad I could help! 😃 \n\nYou’ll definitely enjoy it at the very least, even if it’s stressful.",
                                            "score": 1,
                                            "author": "MaCauleyCulkin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say no but Tom Pelphrey’s performance in season three makes it worth it to me. The rest isn’t bad but not high level-tv imo.",
            "score": 4,
            "author": "Moist-Dragonfly2569",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was gonna mention Tom Pelphrey.  I thought the whole show was fantastic but his performance was the best acting performance of the whole cast and one of the best acting performances in a TV show I've seen maybe ever.",
                    "score": 2,
                    "author": "wcu25rs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol I’ve been trying to tell people this for a minute, I appreciate the validation.",
                            "score": 2,
                            "author": "Moist-Dragonfly2569",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "haha no worries.  It's a shame he didnt win an award for his performance.",
                                    "score": 2,
                                    "author": "wcu25rs",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I couldn't watch it....like literally...i couldn't see anything because the lighting was so dark...I gave up a few episodes in",
            "score": 2,
            "author": "highfivehighfive",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Eh. It’s weird. Not bad. Not great.",
            "score": 2,
            "author": "blabbermouth777",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I personally didn’t love it. It kind of reminded me of my experience watching Lost (although it’s a very different type of show) where something big and exciting happens juuuust enough to keep me watching and interested, yet there is never really much of a payoff. The story doesn’t come together cohesively. \n\nI watched Ozark all the way to the final season. I only had 4 episodes left and that’s when I realized I could not care less about the fates of any of the characters, so I stopped watching. Again, it’s not a *bad* show by any means but it wasn’t worth the time investment for me personally when there are shows out there that are leagues above it. I know others will feel differently.",
            "score": 2,
            "author": "StopStalkingMeFam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing your opinion. 😊 And you are not alone many feel the same way!",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved the first two seasons!",
            "score": 2,
            "author": "matsche_pampe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool thanks 👍",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally, I and one of my good friends, both thoroughly enjoyed the show. Is it the best thing I've ever watched, no. Does it get kinda slow at times, yes (but that's kinda normal for shows in this genre in my opinion). Overall, I say give it a shot.",
            "score": 2,
            "author": "thepottsy"
        },
        {
            "level": 0,
            "comment": "The first episode is like 60 mph and intense.... then the rest of the season is pretty much 15 mph. \n\nIf you liked Breaking Bad and Better Call Saul you'd probably like it.  It isn't the same quality but I don't regret watching it and don't feel like I wasted my time with it.   \n\nSome episodes are quicker paced than others.",
            "score": 2,
            "author": "JellyCream"
        },
        {
            "level": 0,
            "comment": "Why not, and just hear me out, take a little time and watch the first episode? Here's the cool part: if you enjoy that experience, then watch the next one! Should *that* episode fit within your expectations of enjoyment, then watch the next episode. Until you're not interested anymore!",
            "score": 2,
            "author": "noNoParts"
        },
        {
            "level": 0,
            "comment": "I love Jason Bateman, but this did not do it for me. The first episodes or so were interesting. I thought it was a good premise but it got a bit unraveled at the end of the season. By the second season I just couldn't watch any longer. I felt like some of the characters were unbelievable and annoying. The plot got a bit unrecognizable. \nLike a lot of shows I was hopeful but got let down. \nAlso, as mentioned, the wife is unbearable.",
            "score": 2,
            "author": "Affectionate-Base868"
        },
        {
            "level": 0,
            "comment": "Got a depressed vibe from watching it- but the actors were good.",
            "score": 2,
            "author": "Humble_Reality_6375"
        },
        {
            "level": 0,
            "comment": "I literally just watched all four seasons. Watch at least the first season after that it's up to you. Last season wasn't really worth it for me but I powered thru",
            "score": 2,
            "author": "fuuckimlate"
        },
        {
            "level": 0,
            "comment": "I would say it's the poor man's breaking bad",
            "score": 2,
            "author": "UncleBully274"
        },
        {
            "level": 0,
            "comment": "Ending sucked balls",
            "score": 2,
            "author": "Sandy_hook_lemy"
        },
        {
            "level": 0,
            "comment": "I tried twice….Jason bateman just annoyed the piss out of me. But first episode is cool.",
            "score": 2,
            "author": "IssueFederal"
        },
        {
            "level": 0,
            "comment": "YES",
            "score": 2,
            "author": "Sensitive_Okra9047"
        },
        {
            "level": 0,
            "comment": "I'm not sure tbh. Maybe watch the first two seasons then read up the rest or watch a summary on youtube. The writing and overall quality of the show *drastically* plummets after that. Almost all of the characters become extremely unlikeable and plot just becomes ridiculous. I only finished the last season because I started it already and had nothing else to do during covid.",
            "score": 2,
            "author": "DestinyOfADreamer"
        },
        {
            "level": 0,
            "comment": "It’s worth watching but has its …. But some Not so good plots and good plots… lots of shows don’t know if they are doing to reup… so this one is like that …each season it could end or not… gets repetitive",
            "score": 2,
            "author": "AdditionalCheetah354"
        },
        {
            "level": 0,
            "comment": "First season really draws you in.",
            "score": 2,
            "author": "Fake_the_jaB"
        },
        {
            "level": 0,
            "comment": "I like Jason Bateman but I can really only see him as Michael Bluth",
            "score": 2,
            "author": "ofthedappersort"
        },
        {
            "level": 0,
            "comment": "No. The last episode will leave you livid. It's such a shitty end to a good character. Fuck that show for ruining it.",
            "score": 2,
            "author": "Additional_Writing49",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Kinda like house of cards. Both great shows. For 2 seasons. Actually, both are absolutely top shelf… for two seasons",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s discount breaking bad. Great, not excellent.",
            "score": 2,
            "author": "bronze6"
        },
        {
            "level": 0,
            "comment": "Spoiler free with my general take:\n\nI really enjoyed watching this show. If you want something in the vein of BrBa or Bloodline, it's a great pick. The writers made some decisions I wasn't overly fond of but it didn't spoil the experience.\n\nGive it a go!",
            "score": 2,
            "author": "Luvke",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s decent, worth watching. It’s not early GoT or Sopranos level but still a good watch.",
            "score": 2,
            "author": "LightBackground9141"
        },
        {
            "level": 0,
            "comment": "Hell yeah. I enjoyed the hell out of it. Bateman is great and when you see his wife’s brother. There’s a specific scene in a car where that dude should of got a fucking Emmy.",
            "score": 2,
            "author": "Sparrow1989"
        },
        {
            "level": 0,
            "comment": "It's a great show with a very unsatisfying ending. Do with this information what you will.",
            "score": 2,
            "author": "Zealotstim"
        },
        {
            "level": 0,
            "comment": "Your life’s incomplete without watching it all the way through",
            "score": 8,
            "author": "Reasonable_Loan_7995",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting take, thanks😊",
                    "score": 7,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don't mind being in a state of perpetual stress due to the terrible decisions everyone seems to make then its amazing.",
            "score": 2,
            "author": "coin__operated",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i watched 2 seasons and found it kinda slow and boring",
            "score": 3,
            "author": "IbtihajKK",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ozark is one of the BEST shows. Gosh, I wish I could watch it again for the first time.",
            "score": 4,
            "author": "phillygirllovesbagel"
        },
        {
            "level": 0,
            "comment": "Definitely one of the best shows I’ve ever watched. Have you seen Arrested Development? It’s like that  (Bateman trying desperately to solve all his family’s money problems every single day) but switch comedy for crime drama w/ a little comedy sprinkled in.",
            "score": 5,
            "author": "ObvsLRKR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool! Thanks 😊",
                    "score": 5,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not very good. You might like it, but it never has a good enough pay off in my opinion, and plots appear and disappear too easily. They didn't have a super clear vision imo.",
            "score": 4,
            "author": "NRTime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing your view!😊 Many are saying same thing about it I guess🥲",
                    "score": 3,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It starts off with a bang to pull you into it. It's good at creating relationships with the cast but it seriously starts to fall off base and leave you wondering WTF. Maybe that was the point or maybe it was a bad direction. \n\nI would recommend checking it out though.",
            "score": 2,
            "author": "SilverBackLash",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no🥲 I was hoping for it to be good watch on my holiday..lets see! Thanks😊",
                    "score": 3,
                    "author": "Deepanjalii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, \"How met your Mother\", \"New Girl\"\", \"Breaking bad\", \"Weeds\". They are all great shows on the lighter side of things.",
                            "score": 3,
                            "author": "SilverBackLash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would watch season one and then just stop",
                    "score": 2,
                    "author": "BenVera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Season two wasn't horrible but that's where it starts to drop off for sure.",
                            "score": 1,
                            "author": "SilverBackLash"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Started out great enjoyed the characters but it got so dark later on wife and I didn’t finish it.",
            "score": 2,
            "author": "StumpGrnder",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see, thanks 👍",
                    "score": 3,
                    "author": "Deepanjalii"
                },
                {
                    "level": 1,
                    "comment": "To be fair, though, your wife never finishes.",
                    "score": 2,
                    "author": "Lesty7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What someone else said.\n\nFirst season was good. Second was boring and a bit contrived. Third was unwatchable after a certain point.\n\nWouldn't recommend, but first season was entertaining.",
            "score": 2,
            "author": "lettuce-tooth-junkie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh ok 👍",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% worth of watching\n\nI waiting for ozark new season",
            "score": 2,
            "author": "LikeAToySoldier",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have fun waiting lol. Series is over dude.",
                    "score": 6,
                    "author": "Lesty7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worth it overall, it does drop off in last season but if you're invested and liked the first 2 seasons you'll want to see what happens. Its pretty good.",
            "score": 2,
            "author": "QforKillers",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No",
            "score": 2,
            "author": "Upintheair84",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Short answer: Yes. I couldn’t get into it at first watch, but on the second try, wound up hooked all the way till the end. Absolutely worth giving it a shot",
            "score": 2,
            "author": "Nervous-Minute-4273",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great thanks 😊",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brilliant show! I'm surprised at the down-votes. I literally have never met anyone who watched it and didn't like or love it. That's out of about 25 people who I know watched it. ... I don't distinguish between seasons ... when you binge it, it's  just one seamless (great) show.\n\nGreat plot lines and characters. You will love Marty and especially Ruth!! Ruth is one of the best characters ever! \n\nAs the show progresses, you'll come to hate Marty's wife, Wendy - but you're supposed to! (I wanted to shoot her)!\n\nIt's best that you ignore both the up-votes and down-votes and comments. Just watch it and enjoy the ride - and, if you don't enjoy it, stop. But clear your mind of others' opinions before you start.",
            "score": 2,
            "author": "loose_ends2406",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow thanks 😊I finally got my answer 👍",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. Definitely one of my favorite shows.",
            "score": 2,
            "author": "Equal-Golf-5020",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolutely 1000%",
            "score": 2,
            "author": "SterlingUpcycled"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah it’s one of the best netflix original shows in my opinion",
            "score": 2,
            "author": "Tomsskiee"
        },
        {
            "level": 0,
            "comment": "One of the best shows on Netflix. I would put it in top 3.",
            "score": 2,
            "author": "Vic-123-ma"
        },
        {
            "level": 0,
            "comment": "Absolutely!  I loved it.  There are some amazing characters.  Also, unexpected events.",
            "score": 2,
            "author": "candacerunion"
        },
        {
            "level": 0,
            "comment": "Great show. Well worth it.",
            "score": 2,
            "author": "Sarge18259"
        },
        {
            "level": 0,
            "comment": "It is tough to watch, just because it is so incredibly acted.  I felt the emotions these fictional characters went through in my soul.",
            "score": 2,
            "author": "MikeE527"
        },
        {
            "level": 0,
            "comment": "Absolutely! Loved Ozark from start to finish.",
            "score": 2,
            "author": "CorruptCamel"
        },
        {
            "level": 0,
            "comment": "It has amazing character development across the seasons which few TV series can equal. Just hearing the name Wendy Byrde still gives me heart palpitations.",
            "score": 2,
            "author": "helferships"
        },
        {
            "level": 0,
            "comment": "Worth it",
            "score": 2,
            "author": "totolandia"
        },
        {
            "level": 0,
            "comment": "Yep I loved it.",
            "score": 2,
            "author": "AngryBagOfDeath"
        },
        {
            "level": 0,
            "comment": "Ozark definitely worth a watch, prolly gonna wish they kept it going",
            "score": 2,
            "author": "blessd001"
        },
        {
            "level": 0,
            "comment": "Excellent Show!!",
            "score": 2,
            "author": "Loveisaction5050"
        },
        {
            "level": 0,
            "comment": "Yes great cast!",
            "score": 2,
            "author": "Puzzled-Chest3016"
        },
        {
            "level": 0,
            "comment": "Yessss for the millionth time. Just watch it",
            "score": 2,
            "author": "shellsquad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This show is one of Netflix better shows.",
            "score": 2,
            "author": "cocokronen"
        },
        {
            "level": 0,
            "comment": "One of my favorite shows. I have watched seasons 1-3 twice. Would always rewatch the previous season before starting a new season. As another person mentioned, it's crazy how much you miss the first time around. Lots of curve balls in the show and the cast is really good. I always found it best to watch one or two episodes at a time so I could process what I just watched. Everyone has different tastes, but it really is one of my favorite shows on Netflix.",
            "score": 2,
            "author": "Crockett23"
        },
        {
            "level": 0,
            "comment": "It’s FUCKING AMAZING and I am so jealous you haven’t seen it yet.",
            "score": 2,
            "author": "Deminedprincess"
        },
        {
            "level": 0,
            "comment": "Ozark is one of the best things ever made for TV. It's in Breaking Bad/ The Wire/ Sopranos territory.\n\nOzark is a slow-burn, high-wire, high tension show. From start to finish, the stakes are very, very high, and the tension never lets up. \n\nAnother GREAT series of that style, and very underrated, is The Americans, which is on Hulu. I think Breaking Bad is #1, but The Americans might be #2.",
            "score": 2,
            "author": "The_Original_Gronkie"
        },
        {
            "level": 0,
            "comment": "Great show and you won’t regret watching it. Very entertaining.",
            "score": 1,
            "author": "Kajocfc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It had great reviews overall. The character development and acting is great. As is the storyline. Watch 3-4 episodes and you will be hooked. It is dark though. Like almost everything out these days it could have been a season shorter overall. If you like Breaking Bad or Fargo season 1 you will like this. Added note - Fargo season 1 may  be the best single season in tV history.",
            "score": 1,
            "author": "bminnova",
            "replies": []
        },
        {
            "level": 0,
            "comment": "100%. It’s not quite at the level of a Breaking Bad or Sopranos, but it’s certainly capable of being in that sort of company.",
            "score": 1,
            "author": "LowInevitable2544",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you don’t know the answer already, this thread isn’t going to help.",
            "score": 0,
            "author": "relivesa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The storyline is always on an upward development. Didn’t like how it ended though. They left us on a cliffhanger. I think it definitely deserves a last season",
            "score": 1,
            "author": "Bree_Red123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I thought it was great and another show what I thought was similar was Sneaky Pete which was also great but was on Amazon Prime. Had an ending so it wasn't canceled and it was an okay ending and passable but overall I really enjoyed it.",
            "score": 1,
            "author": "XenomorphXx121",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hated it (couldn't get past the first 3-4 episodes) but a lot of people in my friend circle love it. I also hated shameless whicha lot of people love. So YMMV",
            "score": 1,
            "author": "TheGoodBunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "You just hate the poors. My guess.",
                    "score": 1,
                    "author": "corpus-luteum",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely! Binge watched, great acting 👌",
            "score": 1,
            "author": "Janica83",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I thought the first season was really good. I found the second season was unwatchable though",
            "score": 1,
            "author": "P3jk79",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolutely",
            "score": 1,
            "author": "500CatsTypingStuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thanks 😊",
                    "score": 2,
                    "author": "Deepanjalii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely worth watching!!! Months later, I'm still somewhat haunted by this story. It's not remotely about the supernatural,  but definitely gave me Twin Peaks vibes.",
            "score": 1,
            "author": "Ms_Zarabeth_Spock",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah.  For sure.  It’s usually good, sometimes really good.",
            "score": 1,
            "author": "sirreginaldfeatherb3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "DareDareCaro"
        },
        {
            "level": 0,
            "comment": "Watched it 4 times through already.",
            "score": 1,
            "author": "zen_avocado"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Cryptocryptobruh"
        },
        {
            "level": 0,
            "comment": "Yes.",
            "score": 1,
            "author": "ShelfDiver"
        },
        {
            "level": 0,
            "comment": "Thought it was a fantastic show.\n\nMight rewatch in a few years.",
            "score": 1,
            "author": "norielukas"
        },
        {
            "level": 0,
            "comment": "One of the best series I've ever watched. I think the ending wasn't that satisfying, but you definitely should watch it (and love it).",
            "score": 1,
            "author": "prometheus_3702"
        },
        {
            "level": 0,
            "comment": "Lol yo... im working from home. Its what I been watching. Im on season 4 ep 3. Its pretty great and Im picky as heck. \n\nI like shows like Boardwalk Empire\nLast of us\nThe boys\nCall Saul\nBreaking Bad\nGoT was good till it wasnt\nDexter aside for the last 2\n\n\nI like when scenes make sense. Shit is believable to a good degree and acting. All the characters are pretty fleshed out. The acting is good. Story has me tuned in. \n\nAnywho, back to the series. Only have 6 hours to go before work is up. I dont get paid shit wages for nothin.",
            "score": 1,
            "author": "BabyCakesTMCR",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I've sworn off shows with more than 3-4 seasons. Takes too long to watch and it's never worth it.",
            "score": 1,
            "author": "trippin113"
        },
        {
            "level": 0,
            "comment": "Yes. Absolutely.",
            "score": 1,
            "author": "Trickabounce"
        },
        {
            "level": 0,
            "comment": "I loved it",
            "score": 1,
            "author": "Icy_Figure_8776"
        },
        {
            "level": 0,
            "comment": "It’s one of the best shows in the history of Netflix, but gee, I don’t know.",
            "score": 1,
            "author": "DonRicardo1958"
        },
        {
            "level": 0,
            "comment": "Loved it",
            "score": 1,
            "author": "cmcom72"
        },
        {
            "level": 0,
            "comment": "Beyond worth it",
            "score": 1,
            "author": "compositional"
        },
        {
            "level": 0,
            "comment": "100%. Last season was a bit meh, but the previous ones are GOLD jerry, they're GOLD",
            "score": 1,
            "author": "jpreston2005"
        },
        {
            "level": 0,
            "comment": "The most fun I've had watching a show and also the most stressed I've been simultaneously. Not for the faint of heart, but an AMAZING ride. Laura Linney runs away with this role and it's crazy how much range she has. All around awesome thriller series. Edge of your seat stuff.",
            "score": 1,
            "author": "TBlair64"
        },
        {
            "level": 0,
            "comment": "100%",
            "score": 1,
            "author": "ssadf73"
        },
        {
            "level": 0,
            "comment": "Ozark is amazing.\n\nThe only critique I have (and shared by several others I've talked with) is the final season is a drawn out.",
            "score": 1,
            "author": "vhalember"
        },
        {
            "level": 0,
            "comment": "Absolutely. There are not many programs my husband gets into but he LOVED Ozark",
            "score": 1,
            "author": "Dull-Estimate-5158"
        },
        {
            "level": 0,
            "comment": "Yes.\n\nPatrick Bateman is ❤️",
            "score": 1,
            "author": "brunette_mh",
            "replies": []
        }
    ]
}