{
    "id": "56z2c5",
    "score": 5205,
    "title": "[US] Black Mirror (2011). Brilliant, modern take on Twilight Zone where each episode is a discrete story. Most stories use future technology as the major plot driver. two seasons (7 episodes) so far, 3rd season starts in two weeks",
    "author": "[deleted]",
    "date": 1476205410.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/56z2c5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I'd say that all the stories use dark ideas of technology as a basis. If you look at an unlit phone screen, I'm certain the name comes from that. ",
            "score": 320,
            "author": "BearBruin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the creator confirms it here: https://youtu.be/U2YPxSDIoPE?t=271",
                    "score": 64,
                    "author": "JalopyPilot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My uncle died six months ago and all I could think of was my aunt while watching the episode and it really affected me.  Can't imagine what you were going through.  I'm so sorry for your loss.",
                    "score": 22,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm so, so sorry for your loss. That episode was the one that really fucked me up. Thankfully, I haven't personally experienced anything similar, but I'm definitely the \"worrier\" in my relationship, and my significant other has a bad habit of forgetting to let me know he's made it home safely and/or letting his phone die. I'm constantly trying to imagine how I'd handle it if the worst did happen, and that episode just felt a little too real for me. The characters were very similar to my own relationship, and it messed me up for a few weeks.",
                    "score": 10,
                    "author": "getinmyx-wing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You CANNOT recommend Black Mirror without a 1st episode disclaimer.  People should watch past the first.",
            "score": 657,
            "author": "darthcarl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always recommend the 3rd episode first. ",
                    "score": 110,
                    "author": "theearthvolta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Third episode was amazing.  My favorite by far",
                            "score": 61,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not as good as White Bear imo",
                                    "score": 83,
                                    "author": "thisrockismyboone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 77,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As of my last check, the Christmas episode is the only one available on Canadian Netflix",
                                                    "score": 3,
                                                    "author": "wrainedaxx",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "By far. Although I must say: you guys are going to enjoy the next season as well.",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You say this like you have some inside knowledge...?",
                                                            "score": 16,
                                                            "author": "Suhmedoh",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't show white bear to friends.\n\nThey did not appreciate it.",
                                            "score": 67,
                                            "author": "jimmahdean",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "that sounds like your particular situation. Eveyone I know that has watched it says that is hands down the best episode.",
                                                    "score": 40,
                                                    "author": "thisrockismyboone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think watching it alone, it's awesome. Watching it in a dark basement with 3 other people that aren't ready for it is weird.\n\nThere's a lot of screaming and torture.",
                                                            "score": 38,
                                                            "author": "jimmahdean",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Showed that episode to my gf first and she had the same thought. If you don't like feeling kind of confused and gross by media you might not like the show. I,however, love it. ",
                                                                    "score": 11,
                                                                    "author": "armoreddillo",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They loved the concept of the show and thought it was a super interesting story, they just were weirded out during the scene in the woods and the end.",
                                                                            "score": 3,
                                                                            "author": "jimmahdean"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "White Bear is definitely my favorite episode! Glad to hear that other folks feel the same. ",
                                                            "score": 4,
                                                            "author": "getinmyx-wing"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can concur. I showed it to my boyfriend after watching the episode for class, he did not enjoy any part of it.",
                                                    "score": 5,
                                                    "author": "SuperSailorSaturn"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "15 million merits&gt; White Bear. White bear is creepy pasta until you're 40 minutes in.",
                                            "score": 28,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "cover water smell hurry zephyr late lush deranged sleep treatment -- mass edited with https://redact.dev/",
                                                    "score": 23,
                                                    "author": "DFP_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Integrated members of consumer society would hate being confronted by their shitty pseudo-world ",
                                                            "score": 8,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "/r/iamverysmart",
                                                                    "score": 15,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm another that didn't like 15MM. It wasn't because of cognitive dissonance or anything like that necessarily, it just wasn't any meaningful critique I hadn't heard before. ",
                                                                    "score": 3,
                                                                    "author": "Staplingdean",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I like to imagine members of the workers movement in the 1930s reading a short story in the radical press about the degradations of industrial capitalism and going, \"eh. nothing i hadn't heard before. Next\" ",
                                                                            "score": 2,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Weird, white bear was probably one of my least favorite episodes.",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just out of curiosity, did you dislike it because it was more scary and unsettling? I thought it was pretty intense and enjoyable for the most part.",
                                                    "score": 3,
                                                    "author": "chuby1tubby",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It felt more like a thriller with an interesting cerebral twist in the end than a more emotional in-depth look on a sci-fi concept like the others. It was good, but it didn't feel like a Black Mirror episode until nearer towards the end. I did like the twist though, gave you something to think about.",
                                                            "score": 15,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Which one is White Bear again? The one with the mask people?",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "uh its the one where the girl wakes up doesn't know where she is and everyone is taking video of her and some people are helping her and some are trying to kill them.",
                                                    "score": 39,
                                                    "author": "thisrockismyboone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That episode was a total mind fuck for me. I had never heard of the show, thought it looked interesting and just started watching from the beginning. I was not fucking prepared for the content matter of this show lol. My boyfriend was asleep and woke up while I was in the middle of this episode and was like \"wtf are you watching?!?!\" It is really good though! I haven't watched much more of it because I have a toddler and can't watch while he's awake. Don't wanna traumatize the kid lol ",
                                                            "score": 17,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Some episodes aren't that violent.",
                                                                    "score": 6,
                                                                    "author": "thisrockismyboone"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Word. Yeah some of the hunter people were wearing masks I think. That was definitely one of my favorites.",
                                                            "score": 5,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which one is that? The one where they have to cycle for \"money\"? That is the one that REALLY hooked me. And white bear just absolutely blew me away. The only one I was kinda disappointed with was the one where the guy's wife was cheating on him. Kinda tame compared to the rest",
                                    "score": 8,
                                    "author": "squishypoo91",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The third is the one where the guys wife is cheating on him.\n\nDifferent strokes.....",
                                            "score": 20,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh haha. Yeah definitely, it wasn't bad at all I just thought it was weak compared to the shock of the other ones. I kept waiting for the big crazy thing and it never happened. The ending was the only disappointing part. The rest had me glued ",
                                                    "score": 7,
                                                    "author": "squishypoo91",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Entire History of You (the cheating wife one) was the first episode I saw thanks to Reddit. I still think about it a lot, I think it has more of an emotional connection than the others - except maybe Be Right Back, which is the one where the husband dies.\n\nWith both of those episodes, I think the overlying message of the show becomes more poignant - that while technology seems wonderful and exciting, there's always a price to pay, and not everything is what it seems. I find them more relatable than most of the other episodes. I can easily see myself jumping at the chance to relive happy memories of a lost significant other, only to realize I'm in too deep and that the technology is only making it harder to move on. I could find dozens of creepy techno-thrillers like Fifteen Million Merits, or even White Bear... but EHOY and BRB feel more personal.",
                                                            "score": 26,
                                                            "author": "getinmyx-wing",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes the one where the husband died KILLED me! It was so so sad. And I did absolutely love the other one too. It was just my least loved. Besides the first one. I really didn't care for that one at all and it put me off finishing the show for about a year. I love how technology on that show is just as much a character as any of them. It's fantastic.",
                                                                    "score": 15,
                                                                    "author": "squishypoo91"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wasn't that also the last episode? I remember there weren't many of them",
                                    "score": 3,
                                    "author": "Capn_Canab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Last of the first season",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's another season? Holy shit. Imma have to check it out",
                                                    "score": 2,
                                                    "author": "Capn_Canab",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Three episodes in the second season.  Plus a bonus Xmas episode.  Plus another six episodes dropping on 10/21",
                                                            "score": 5,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that the grain implant?  If so, yes I think that's the best introduction to the show.",
                            "score": 8,
                            "author": "Fishtails",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree completely! I was blown away by the plot of the first episode. It was awesome (in its own weird and very uncomfortable way) and I knew this was going to be a good show. However, it's really odd to promote this show based on the first episode's plot line. ",
                    "score": 174,
                    "author": "BrokenBrain666",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recommended to my in laws forgetting the disclaimer. They were not into watching any more of it.  I get it.",
                            "score": 25,
                            "author": "ratking11"
                        },
                        {
                            "level": 2,
                            "comment": "It was my most disliked episode",
                            "score": 5,
                            "author": "SupaZT"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Couldn't agree more. I've recommended this show to a lot of people and always tell them not to start with the first episode.",
                    "score": 19,
                    "author": "Dandeloin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did start with the first episode, but I was warned that it was pretty extreme, and that it wasn't necessarily indicative of the content of the rest of the show.",
                            "score": 2,
                            "author": "wolfman1911",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I remember watching the first episode and not really wanting to watch beyond that. Maybe 6 months later I watched the 2nd episode after hearing that it is different than the first and loved the show. Any time I've recommended it to someone, I tell them to start with episode 2 or 3 and come back to the 1st later",
                    "score": 15,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I thought the first episode was disgusting and the worse politics could get.  Then the 2016 US presidential election happened.  That and \"The Waldo Moment\" are eerie in how tame they are compared to reality only a couple years later",
                    "score": 47,
                    "author": "howlin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.youtube.com/watch?v=2iha1umZ9hw :)",
                            "score": 13,
                            "author": "Torley_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;[**Black Mirror: Donald Trump is Waldo [2:21]**](http://youtu.be/2iha1umZ9hw)\n\n&gt;&gt;Donald Trump makes a guest appearance in this special episode of Charlie Brooker's Black Mirror.\n\n&gt; [*^Phage*](https://www.youtube.com/channel/UC-NUgASv1gkwj26a0rOJ1hA) ^in ^Entertainment\n\n&gt;*^29,147 ^views ^since ^Jan ^2016*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)",
                                    "score": 11,
                                    "author": "youtubefactsbot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait, so that wasn't a documentary about David Cameron? ",
                    "score": 10,
                    "author": "ztsmart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am really curious now if there had previously been rumors, etc. regarding David Cameron and the (alleged) initiation incident that inspired the story, or if it's just coincidence.",
                            "score": 5,
                            "author": "primitive_screwhead",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Coincidence",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first episode is a bit more gruesome than the other in that it deals with some pretty hard-to-swallow, stomach-turning physical acts. The other episodes are more subtle in their methods of fucking your mind.",
                            "score": 11,
                            "author": "getinmyx-wing"
                        },
                        {
                            "level": 2,
                            "comment": "I've only seen the first episode, so OP's advice is welcome news to me.\n\nThe premise of the first episode is the princess of England is kidnapped and the only ransom demand is that the Prime Minister has sex with a pig on live TV.\n\nI can't quite put into words how I thought about the show. It certainly didn't make me want to watch the next episode, but I wouldn't say it was bad. Instead it just makes you feel really uncomfortable in so many different ways.",
                            "score": 10,
                            "author": "oozles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would suggest continuing on. The first episode is the only one that I would say conjures up a sense of revulsion in the way that episode does. Other episodes may make you feel uncomfortable, but not in quite that same way.",
                                    "score": 6,
                                    "author": "wolfman1911"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The episodes have nothing to do with each other. What order you watch them is irrelevant.\n\nIt's just that the first episode is REALLY unlike all the other episodes.\n\nBut it's an awesome episode",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was the first episode not everyone's favorite? How could you not be hooked after that?",
                    "score": 8,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "The first episode was excellent. Very accurate depiction of what people's reactions would be in such a situation.",
                    "score": 25,
                    "author": "ChoiceD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, it was a little on the nose. ",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, the first one doesn't do justice to the series, but to be honest the worst for me is the Waldo one! Till this day I haven't finished. ",
                    "score": 5,
                    "author": "msvideos234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can't call it the worst if you haven't finished it",
                            "score": 1,
                            "author": "TwiceBakedTomato",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just finished watching the first ep and holy shit I was sweating real hard",
                    "score": 6,
                    "author": "scummyyyy"
                },
                {
                    "level": 1,
                    "comment": "I watched the first episode and didn't really like it too much. Thanks for your post, I'll give it another chance.",
                    "score": 4,
                    "author": "kyledotcom"
                },
                {
                    "level": 1,
                    "comment": "My reactions watching the first episode:\n\nWTF?! It's not about *that* is it?... \n\nNo, really, they're not going there, are they?... \n\nIt looks like they're going there... \n\nHoly shit they're really going there... \n\n...\n\n...\n\n...",
                    "score": 7,
                    "author": "Mr_Rekshun"
                },
                {
                    "level": 1,
                    "comment": "The first episode was great! I thought of anything the second was the weakest.",
                    "score": 29,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow I loved the second episode! It really delivered for me with that chilling, unsettling vibe that all great dystopian sci-fi has. What didn't you like about it?",
                            "score": 47,
                            "author": "kevdroid1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I watched the first episode and I didn't watch anymore because I didn't like it. Then I watched the second episodes a couple months later and I promptly finished everything on netflix.",
                                    "score": 8,
                                    "author": "Lifeguard2012"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Regarding the part about unrealistic power generation - I found it more of a symbolical thing. Spending your life contributing to society is the norm, and this is just one way to illustrate it. The lack of realism didn't really bother me.\n\n**Edit:** Typo.",
                                            "score": 55,
                                            "author": "BillGoats",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yeah, I can see that.  I tend to be more literal in my choices of media.  I like things that are a little more realistic.  If I'm going to suspend belief (cartoons and monster movies and all that) I'm totally cool with it, but I don't like the \"possible\" and \"impossible\" to join in a movie.\n\nIt's one of the main reasons I have such a problem with \"based on a true story\" movies.  I get so pissed when they decide \"fuck it, let's just completely make up history\".  I want to punch Aaron Sorkin in the face for completely fabricating the entire backstory of Facebook in Social Network.  It was an interesting story as is, why fabricate the entire thing?  Ditto Braveheart and Argo",
                                                    "score": 6,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mostly agree. Black Mirror is somehow an exception for me, however. Maybe because the entire show is one giant mindfuck, and you sort of forget things like this while you're watching.\n\nBy the way - for the kind of TV you describe I highly recommend [The Wire](http://www.imdb.com/title/tt0306414/) (that you've probably seen) and [Dekalog](http://www.imdb.com/title/tt0092337/) (that you probably haven't)!",
                                                            "score": 8,
                                                            "author": "BillGoats",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Second episode is allegory/parody. Take it too literally it doesn't make as much sense. \n\nYou got people going about their daily grind to keep society running and themselves eating, they have access to trivial pleasures that they use to escape the monotony, *and they love to mock people worse off than themselves,* with zero sense of self-reflection. Aside from basic survival, they spend money both to avoid minor inconveniences (which are themselves monetary schemes, ads) and to acquire meaningless and worthless trinkets.\n\nMany dream of escaping the drudgery and becoming famous like big stars on TV (because the few 'real' stars love to display extravagant, fun and comfortable lifestyles) but in reality this is both a distraction AND just another way to separate them from their hard-earned money. Few people will ever 'break out' into fame and fortuen, in order to break out you have to bend over and allow yourself to be exploited and most of the time you will be used up and spit back out, not even managing to benefit from the experience.\n\nYour big dreams and goals don't matter, the things you take pleasure in can be taken from you and twisted, and throw back in your face... not from malice exactly but more from indifference. It takes an absurd amount of effort (and, by that, money) to even TRY to break out and if you fail you don't get any back, its gone and made someone else richer. Your control over your own destiny is really limited. \"Hard work\" will get you somewhere, but luck and, more importantly, connections to people with influence is what will actually help you win.\n\nAnd the big reveal is that the system is so smooth and effective that it takes its biggest critics and makes them part of the whole edifice. Rewards them and uses them as just one more monetized distraction.\n\nI think that was the one thing in there that really impressed me. It points out that a lot of the people who are 'famous' (in OUR world) for screaming about how backwards, corrupt, nonsensical, and/or disastrous society is (see: most political pundits) are actually wealthy themselves, profiting in large part *because* their diatribes capture an audience which they monetize to enrich themselves. \n\nAnd while they are ABSOLUTELY CORRECT that society is as messed up as they describe, they themselves aren't actually doing anything to change it (because hey, they're perfectly happy where they are) and most people don't care enough to even TRY and change it.\n \nEverything is about entertainment, because everybody just wants to escape the grind of their daily lives. Its easier and more pleasurable to have rebellious thoughts fed to you than to actually think about rebellion.\n\n*****\n\nSee, you could make the same point WITHOUT using a sci-fi dystopia, the episode just pumps it up to ridiculous levels so that it *gets through* and makes you actually think. \n\nOr not. If the episode is addressing a true problem, then its complicit in the system that it portrays.\n\nOR maybe the episode isn't really accurate and life is a lot better than it implies. I think so!",
                                            "score": 42,
                                            "author": "qwertpoi",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I just assumed it was more about power as in control of the people and that explanations given in the narrative werent true.\n\nIt seemed more about a quick aldous Huxley inspired premise and then getting on with the plot than really fleshing out the why's of the universe.\n\nLike theres always this argument on here about growing economic disparity and the need for basic income because like 30% of people will effectively become unemployable.\n\nWhat if instead of basic income, locking them in rooms and numbing them with constant streams of propaganda was how you chose to keep them from banding together uprising? \n\nIn reality, I think you're being too literal. Like all dystopian sci-fi, its not meant to be realistic but actually entirely symbolic. The genre is a commentary on modern society through satire. This episode happened to be the most symbolic one. Its not even attempting to give answers which I think is probably intentional. The character in the story don't really get an understanding of their situation so neither do we. We only get to see and understand wbst \"they\" want us to see and understand.\n\nThe point was in its themes. Its not meant to paint what the future could realistically be but instead reflect our current reality. Thats why the show is called black mirror. \n\nI think it make sense you didn't like the episode. It was the least concerned with giving us context or answers and simply threw us in the middle of a story already underway.\n\nI thought the story was beautiful amd impactful and that its ambiguous nature made it a lot more powerful than episodes that were more concerned with spoonfeeding us the narrative.\n\nI still think youre compeltely missing the point of dystopian fiction though. Its not at all about the showing the somewhat possible impact of our technological future. Its about commentary on our present through satire. I think that distinction is an important one.",
                                            "score": 3,
                                            "author": "Polaritical",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But that's what I don't like about dystopia.  It's making a point through hyperbole. Which is an increasingly annoying trope used in real life arguments.  I don't mind things being unrealistic or symbolic or whatever.  I'm just over hyperbole",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then I'm not sure why you enjoy the series at all. Every single episode heavily relies on hyperbole of modern reality. Why do all epsidoes but one get a pass on a trope they all utilize equally? Its literally the entire premise of the show so I just find it weird that you even watch it let alone enjoy it when you dislike everything its rooted in and attempts to be and say.",
                                                            "score": 2,
                                                            "author": "Polaritical",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But it's not hyperbole.  Future tech isn't hyperbole.\n\nIf you accept the premise of the technology in the episode, the shows definitely highlight the actual impacts of what life would be like.\n\nFor instance, the technology In episode 3 could conceivably happen, and if it occurred, that is exactly how it would destroy people and relationships and what the world would be like.  There is a possible scenario where these episodes could happen\n\nThere is no possible scenario where a world like Episode 2 exists.",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well that makes sense, any kind of logical leap that they're asking you to make that breaks your suspension of disbelief would totally ruin the whole vibe, I can totally see that. \n\nI totally agree with you on the thin plot, that was my only real gripe with the episode. They didn't really give us a whole lot to get invested in the relationship and just kind of trusted that we'd follow along.",
                                            "score": 2,
                                            "author": "kevdroid1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;There is just no possible future where all mankind is forced to ride bikes to power the country and forced to watch advertisements.\n\nTake it as a metaphor and we already do that now. ",
                                            "score": 2,
                                            "author": "rglitched"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think of the second as the catch-all best episode. It seems like everyone likes the third one the most though.",
                            "score": 11,
                            "author": "numb3red",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The third was so great in that it is a technology I could possibly see occurring in the future, and it shows EXACTLY what would happen with the technology if it occurred.  \n\nThere's the common trope of \"who wants to see videos of my vacation?\" and in this world, it would absolutely become people replaying all the varied minutiae of their lives at parties.  And holy shit would arguments be different.  Replaying exactly what was said, what every look meant.  OMG, the wormhole that insecure people would go down replaying every single syllable or flinch in every human interaction.",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I saw one.  Then two.   Then I stopped.   Then I read your post.   And watched the third.   God damn.   Worth it.   ",
                                            "score": 3,
                                            "author": "CaptainWicked"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I definitely get that. I enjoyed it a lot more on my second watch, and I think the problem the first time was it took me a while to get over how much of an asshole the protagonist is.",
                                            "score": 2,
                                            "author": "numb3red"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's a solid episode but I don't know, it felt kind of shallow compared to some of the others. I would say that the message in the third is not nearly as powerful as the message second for example.",
                                            "score": 3,
                                            "author": "altheapot"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the 3rd one is the most traditional one. As in it really could be a drama from 10 years in the future rather the others which all distinctly feel like current shows set in some vague distant future. \n\nDystopian sci fi isnt always the most accessible genre and tends to be a tad polarizing. Since that one felt the least like science fiction and more like a traditional drama, I think it makes sense its the most warmly received episode.\n\nI agree though. I think the 2nd episode is much more powerful in concept and execution. But its also the most abstract and symbolic episode which is far from everyone's cup of tea.",
                                    "score": 3,
                                    "author": "Polaritical"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The first episode was a phenomenon when it came out, and immediately put Black Mirror on everyone's radar, but for a wider (particularly American) audience, it's always worth telling people that, while every episode is separate, that first episode is **extra** separate and not the best example of what the show is.",
                            "score": 5,
                            "author": "An_Lochlannach",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's still the best episode imo.",
                                    "score": 5,
                                    "author": "bat03"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "First episode is still my favourite.",
                    "score": 4,
                    "author": "bat03"
                },
                {
                    "level": 1,
                    "comment": "You could tell people it's a modern day Twilight Zone, but there is probably a generation gap since Twilight Zone is from before color tv.",
                    "score": 3,
                    "author": "geoff422",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would compare it more to the nineties reboot of The Outer Limits, especially since Twilight Zone didn't always end poorly for the protagonist, but Outer Limits almost always did.",
                            "score": 2,
                            "author": "wolfman1911"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not to have any spoilers, but did the first episode involve a pig? ",
                    "score": 4,
                    "author": "radiculs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes.",
                            "score": 3,
                            "author": "Mr_Rekshun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "S01E01 was REALLY rough.  Took me like 2 weeks before I got up the nerve to watch episode 2, which I very much enjoyed.",
                    "score": 4,
                    "author": "brett_riverboat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Entire history of you and White Bear are my favorite. Can't wait for season three. ",
            "score": 64,
            "author": "ThickThriftyTom",
            "replies": [
                {
                    "level": 1,
                    "comment": "White Bear is without a doubt my favourite of all of them. ",
                    "score": 8,
                    "author": "McShuckle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have binged this over the last 2 days. Cannot recommend it enough. Can't wait to go home tonight and watch the last 2 episodes.",
            "score": 31,
            "author": "r1z3n",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotdamn how did you binge it? One episode at a time is enough to cripple me, I have to space them out",
                    "score": 38,
                    "author": "thebazooka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched the entire thing yesterday night and it really messed me up, still feel horrible from it",
                            "score": 7,
                            "author": "FMDT"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Disclaimer. The last episode, white christmas, left me with a weird ominous feeling after. Kinda depressing but super interesting as well. ",
                    "score": 14,
                    "author": "stickwithmekids"
                },
                {
                    "level": 1,
                    "comment": "White christmas had me tearing up a bit. Definitely my favorite episode.",
                    "score": 2,
                    "author": "elwildpokemon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're new to Black Mirror:\n\nDON'T BINGE IT.\n\nWatch an episode, then turn it off for a bit and process what you just watched.\n\nWith the possible sole exception of Waldo Moment, every single episode of this series has floored me.\n\nMy personal favorites are White Christmas and Be Right Back.",
            "score": 63,
            "author": "hesnothere",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure you could binge this show even if you wanted to - I was basically having an existential crises after each episode and swearing off technology for a few days.",
                    "score": 16,
                    "author": "NimbleBodhi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just finished watching all of them ahaha. I think there might be an episode in season three about folk like me. ",
                            "score": 3,
                            "author": "Hipster_Harry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you watched Waldo recently at all? It's actually pretty eriee with Trump and all. ",
                    "score": 11,
                    "author": "TheHopelessGamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The premise was great. I didn't like the execution as much on this one (the pacing was a little jarring to me, among other minor quibbles). I'm perhaps unfairly comparing it to other BM episodes.",
                            "score": 4,
                            "author": "hesnothere"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would caution people that the show is pretty emotionally charged. It's not \"need therapy\" level by any means but I happened to start the show a month or two after being cheated on by a long term girlfriend and episode three(?) hit way too close to home. I was *sick* watching it.\n\nThe show is *excellent* in a sense that you get so involved and feel the story, but it's terrifying because it's grim subject matter. ",
            "score": 141,
            "author": "treseritops",
            "replies": [
                {
                    "level": 1,
                    "comment": "I watched that one with my wife after we had just had an argument with plenty of \"What I said\" vs. \"What you heard\" back &amp; forth.  It was pretty uncomfortable but we agreed that yea, it's sometimes better to just let things go without digging for the gory details.  ",
                    "score": 22,
                    "author": "homedude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How appropriate! ...and vomit inducing. Haha",
                            "score": 8,
                            "author": "treseritops"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea, I started watching it because of the good reviews. Ended up stopping at episode 3. Good writing but too emotionally charged for me, not something I can relax and watch.",
                    "score": 23,
                    "author": "Bumbol"
                },
                {
                    "level": 1,
                    "comment": "&gt;It's not \"need therapy\" level by any means\n\n\nIf *anything* is \"need therapy\" level, it's Black Mirror. ",
                    "score": 8,
                    "author": "ficarra1002"
                },
                {
                    "level": 1,
                    "comment": "Yeah I watched episode 3 after a rather rough breakup on my end.  I didn't have it in me to watch another episode for several days.\n\nThe show really makes you think. ",
                    "score": 7,
                    "author": "blitzbom"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What the fuck",
                            "score": 4,
                            "author": "MrMaxMax"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*buuuurp* M-Morty. Morty, the polls are turning Morty. You gotta fuck this pig if you want to stay president. There's only one way outta this mess Morty, a-a-and and you have to fuck that pig if you want us to make it through. Do it for Grandpa, Morty. Do it for your country.\" \n\n\"Aw geez Rick. I don't want to have to do that.\"\n\n",
            "score": 231,
            "author": "Kiipo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for this",
                    "score": 18,
                    "author": "Dandeloin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will season 3 only have 3 episodes?   I'm hoping for more. ",
            "score": 13,
            "author": "MrBillyLotion",
            "replies": [
                {
                    "level": 1,
                    "comment": "6 episodes coming in two weeks. 12 episodes total have been commissioned by Netflix. ",
                    "score": 49,
                    "author": "guaranteedolphins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know when the other 6 are likely to be released ? Just curious ",
                            "score": 5,
                            "author": "ollieg30",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's 6 episodes per season, so you'll have to wait a year.",
                                    "score": 2,
                                    "author": "chuby1tubby"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Waldo Moment episode seems almost prophetic now.",
            "score": 25,
            "author": "RatsInTheCellar",
            "replies": [
                {
                    "level": 1,
                    "comment": "First episode spoiler:\n\n[The Prime Minister and the pig was also prophetic,](/spoiler) [which Brooker himself denies.](https://www.theguardian.com/tv-and-radio/shortcuts/2015/sep/21/pigs-prime-minister-black-mirror-ashcroft-allegation-charlie-brooker)",
                    "score": 22,
                    "author": "AndThenYouRemembered",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree thar Black Mirror is brilliant! Unfortunately, Netflix has once again screwed the Canadian customers and they're only offering one episode of Black Mirror ....that one being \"White Christmas\" or episode 1 of season 2. Why do you do this to us Netflix?",
            "score": 34,
            "author": "_hazlo",
            "replies": [
                {
                    "level": 1,
                    "comment": "White Christmas is a fucking good episode though. Maybe my favorite.",
                    "score": 37,
                    "author": "GaiusSherlockCaesar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's great. But I can't help but still be angry we only get that one. Though it does a good job as a demo for the upcoming series",
                            "score": 6,
                            "author": "martianinahumansbody"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Everyone I know including myself dropped Netflix. The library in Canada is quite pathetic.",
                    "score": 2,
                    "author": "Skarekrows",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dunno, it's given me a metric ton of TV to watch.",
                            "score": 4,
                            "author": "wrainedaxx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; each episode is a discrete story\n\n[Well, until you watch the Christmas special](/spoiler)",
            "score": 16,
            "author": "SirDigbyChknCaesar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh? What overlap does that have?",
                    "score": 11,
                    "author": "standish_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has a few references to episode two, or at least a couple I noticed\n\n-the girlfriend in that episode sings the same song (anyone who knows what love is) from episode 2 during the karaoke scene.\n\n-while one of the main characters is flipping stations on the TV he briefly goes past a show that looks a lot like the game show from that episode.\n\nI'm not sure if this is what OP is talking about, since to me those seem more like little easter eggs than anything else and don't effect your understanding of the story or characters at all.",
                            "score": 28,
                            "author": "-cordyceps",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; since to me those seem more like little easter eggs than anything else and don't effect your understanding of the story or characters at all.\n\nYeah I guess they're still discrete. It's been a while and I thought there was a bit more interaction there.",
                                    "score": 13,
                                    "author": "SirDigbyChknCaesar"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also in the Christmas special, the pregnancy test he finds in the trash is the exact same one that Peggy Carter uses in episode 4(?). The one where her husband dies. ",
                                    "score": 7,
                                    "author": "Barrowhoth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "TIL! neat",
                                            "score": 3,
                                            "author": "-cordyceps"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I like to think that it all takes place in the same universe. The episode 3 couple are your trust fund kids with the latest tech, the episode 2 people were born into poverty, etc etc.",
                                    "score": 6,
                                    "author": "MechMeister",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd always assumed Fifteen Million Credits was set in some kind of prison, hence the strict controls on all aspects of life, the lack of a physical monetary system, the forced labour and the way its all in one building.",
                                            "score": 7,
                                            "author": "FMDT"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, after just watching White Christmas I started thinking it's possible they're all in the same universe, especially with the eye implant tech in both that episode and the third one.",
                                            "score": 2,
                                            "author": "NimbleBodhi"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also when John Hamm is giving dating advice to that one guy, and it shows the other guys Skyping in, one of them has a screen name along the lines of I_AM_WALDO.",
                                    "score": 6,
                                    "author": "TheHopelessGamer"
                                },
                                {
                                    "level": 3,
                                    "comment": "I never noticed the overlap, thanks for mentioning this! Fifteen-million Merits was my favorite episode, so I appreciate it. Until the comments on this post, I never realized how unpopular episode 2 is!",
                                    "score": 10,
                                    "author": "DkAlex610",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I always enjoyed that episode as well (the waldo episode is my least favorite IMO) but I get why people wouldn't like it, it's got a very different feel and look than the rest of them. It doesn't have the super realistic gritty quality the rest has.",
                                            "score": 5,
                                            "author": "-cordyceps",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Same. I think of Fifteen Million Merits as \"the\" Black Mirror episode.",
                                            "score": 8,
                                            "author": "numb3red",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me too. I suppose it might be because its the \"only\" (and I use that term loosely) episode that is truly dystopian. ",
                                                    "score": 4,
                                                    "author": "DkAlex610",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It reminded me a lot of some Doctor Who episodes, minus The Doctor and any hope he brings.",
                                                            "score": 5,
                                                            "author": "numb3red"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[There are references to a few of the other episodes, like the technologies and people in them all exist in the same universe.](/spoiler)\n\nhttps://www.reddit.com/r/blackmirror/comments/2qgovy/a_few_white_christmas_easter_eggs/\n",
                            "score": 4,
                            "author": "SirDigbyChknCaesar"
                        },
                        {
                            "level": 2,
                            "comment": "It contains stories that intersect with each other, and a few easter eggs, but it doesn't really overlap with other episodes at all. ",
                            "score": 3,
                            "author": "WhyThisIsLikeThat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recently got a bunch od my residents obsessed with this show. I was in my dorm's common room rewatching an  with a resident episode to get ready for the new season. Then some curious residents showed up and joined us. It started with 4 of us watching 1 episode and ended with like 10 of us and 3 episodes. \n\nNow they wanna do a sleepover in the common room when the show premieres on the 21st ha ha. ",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The only episode available on Canadian netflix is the Christmas special. I heard they're not sequential; will I ruin anything if I just watch the Christmas one for now?",
            "score": 5,
            "author": "agreathandle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only in the sense that it's by far the best episode.",
                    "score": 14,
                    "author": "NintenTim"
                },
                {
                    "level": 1,
                    "comment": "No. Each is just about as good as its own series. Tied together by only the fact that each of them is bat shit crazy and messes with your head... in a good way. For some.",
                    "score": 3,
                    "author": "moroders_miracle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife and I watched the first 3 and couldnt do anymore. Holy shit are they depressing.",
            "score": 6,
            "author": "Zubei_"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the best.",
                    "score": 10,
                    "author": "bat03"
                }
            ]
        },
        {
            "level": 0,
            "comment": "deeply disturbing show. deep psychological terror. I lose sleep every time i watch an episode.",
            "score": 4,
            "author": "moncrey"
        },
        {
            "level": 0,
            "comment": "This is a good series, but it is really dark, and hard for me to get through.",
            "score": 4,
            "author": "Not_A_Meme"
        },
        {
            "level": 0,
            "comment": "never watching this. some of the episodes still haunt me.",
            "score": 5,
            "author": "wookiecontrol"
        },
        {
            "level": 0,
            "comment": "All you had to say was \"modern take on Twilight Zone\". I'm sold.\n\nedit: okay so I'm 2 episodes in and this show is..... disturbing. I'm not sure how to describe it. I'm not even sure what I think of it yet. I'll keep watching, though.",
            "score": 4,
            "author": "vinbel121"
        },
        {
            "level": 0,
            "comment": "It's not like The Twilight Zone. A major aspect of The Twilight Zone is the supernatural, as it's part of many (if not most) episodes. There is none of that in Black Mirror, which instead is about a future technological dystopia. ",
            "score": 4,
            "author": "-888-"
        },
        {
            "level": 0,
            "comment": "I wasn't a huge fan of this show and doubt I'll watch the season that was just greenlit.  I found it too obvious and heavy handed.  I enjoyed the absurdity of the initial episode, at least.  It's really popular with everybody I know, though, so check it out because what the hell do I know.",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "White bear!",
            "score": 3,
            "author": "Azor_ImHIGH"
        },
        {
            "level": 0,
            "comment": "people keep posting this around the internet, and it's a fucking shame that they mention the twilight zone in the same sentence. \n\ndo not go into it thinking twilight zone, or you'll be disappointed. it's not the twilight zone, and it's really not even like the twilight zone.",
            "score": 9,
            "author": "fosiacat",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's an anthology show dealing with heavy social commentary of the near future. It's definitely similar to The Twilight Zone in that regard. ",
                    "score": 11,
                    "author": "jubjub2184"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched the first episode with my wife, who was pretty repulsed. I gave the second episode a chance and was bored out of my mind. \n\nCould someone explain the cultural significance of the PM and the pig?",
            "score": 6,
            "author": "Youre_a_transistor",
            "replies": [
                {
                    "level": 1,
                    "comment": "there was no cultural significance at the time.  Later it came out that the PM may have done some weird shit with pigs, but that had nothing to do with this show.\n\n[There was no metaphor really in that episode.  It was just a literal thing where an artist was trying to prove the point that really important things can happen in front of us (like the princess being released completely unharmed) and we don't notice because our faces are buried in trainwreck celebrity culture (like the PM fucking a pig)](/spoiler)\n\nThey even said that specifically during the credit scenes in that episode.",
                    "score": 17,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "https://en.wikipedia.org/wiki/Piggate",
                    "score": 5,
                    "author": "professorhazard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "US? I thought it was a British show? Or is one a remake of the other?",
            "score": 5,
            "author": "Dubhzo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The [US] in the title is referring to the territory in which the show is currently available. So, if you are in the US, you can watch the show.",
                    "score": 5,
                    "author": "ZeldaZealot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, thanks, I'm new to the subreddit so thanks for the polite reply",
                            "score": 5,
                            "author": "Dubhzo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The [US] is about where it's available on Netflix, not where it was made",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I will never look at pigs the same way ever again.  ",
            "score": 2,
            "author": "Rob1150"
        },
        {
            "level": 0,
            "comment": "Thanks, I been wondering when it would be back.",
            "score": 2,
            "author": "Beat2death"
        },
        {
            "level": 0,
            "comment": "Not available (as usual) on Netflix Canada. Except for S2:E1 White Christmas)",
            "score": 2,
            "author": "ohreally468"
        },
        {
            "level": 0,
            "comment": "I have seen the first season. Not 100% sure what I think about it, but I will continue with it and see how it goes. ",
            "score": 2,
            "author": "chano4"
        },
        {
            "level": 0,
            "comment": "I absolutely loved the way the last Christmas episode of season 2 tied into the last two episodes of season 1. It was subtle, but you could tell that the final Christmas episode took place in time further back than the first season, such that you could see the developing technology over time (but in retrospect).",
            "score": 2,
            "author": "spaceman"
        },
        {
            "level": 0,
            "comment": "I've been wanting to watch this for awhile but keep forgetting! Thanks I'll check it out!",
            "score": 2,
            "author": "aliengiraffe"
        },
        {
            "level": 0,
            "comment": "What the fuck did I just watch but I think I like it.",
            "score": 2,
            "author": "kdun"
        },
        {
            "level": 0,
            "comment": "Just watched the first 3 episodes and started the 4th after seeing this post. \n\nGreat call, I'm really digging this show so far. Shame there's only 7 episodes.",
            "score": 2,
            "author": "CARNIesada6",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just finished the current episodes today. This show is absolutely brilliant, can't recommend it enough.",
            "score": 2,
            "author": "OvertPolygon"
        },
        {
            "level": 0,
            "comment": "Love this series SO MUCH. 😍 If you have a high tolererance for mindfuckery and appreciate dark dystopian sci-fi, it's wonderful. If that doesn't sound like a good time to you, if disturbing stuff tends to lurk in your brain longer than you'd like, you're probably doing yourself a favor by skipping it.\n\nedit: errant vowel",
            "score": 2,
            "author": "karshyga"
        },
        {
            "level": 0,
            "comment": "Just started this yesterday. I'm so happy Netflix picked it up for 12 more episodes. This will be some prime Halloween viewing. \n",
            "score": 2,
            "author": "Veritech-1"
        },
        {
            "level": 0,
            "comment": "I got excited because you said 2 seasons were available, and I remember only seeing about 6 episodes, so I checked netflix, then reality hit. British tv series consider 3 episodes to constitute an entire season. :( I was excited because I thought I had unwatched episodes waiting.\n\n*Edit: I never saw the Christmas episode! hope it's good.",
            "score": 2,
            "author": "geoff422",
            "replies": [
                {
                    "level": 1,
                    "comment": "It might just be the best so far.",
                    "score": 3,
                    "author": "Charlatanry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit I had no idea the third season was coming so soon I can't fucking wait.",
            "score": 2,
            "author": "jmz_199"
        },
        {
            "level": 0,
            "comment": "Man, I just watched the first two episodes... I certainly don't think I'll be binge watching the entire thing. It's an amazing show, but man... ",
            "score": 2,
            "author": "Taubin"
        },
        {
            "level": 0,
            "comment": "Me trying to explain black mirror to a friend \" it's a show where umm just watch it, it'll blow your mind I can't describe it.\" Everyone has been hooked so far. ",
            "score": 2,
            "author": "Azor_ImHIGH"
        },
        {
            "level": 0,
            "comment": "I couldn't finish the 2nd episode, thought it was total garbage. Might give the others a go after reading this thread though.",
            "score": 2,
            "author": "phazer193"
        },
        {
            "level": 0,
            "comment": "Absolutely loved this series when it came out in the UK, I was excited for the first episode and made sure nothing got in the way of watching it.\n\nMust say that if you watch the first episode and don't feel like it's living up to expectations, keep watching and at some point one of the episodes will really resonate with you and the rest of the episodes begin taking on much different meanings than they would have previously... ",
            "score": 2,
            "author": "ThatClueGuy"
        },
        {
            "level": 0,
            "comment": "For such a great show, 7 episodes since 2011 is pretty disappointing",
            "score": 2,
            "author": "Negative_Clank"
        },
        {
            "level": 0,
            "comment": "I watched \"White Christmas\" and the first part of \"The Entire History of You\", and I can't watch any more of this show. It's too depressing.",
            "score": 2,
            "author": "Blue2501"
        },
        {
            "level": 0,
            "comment": "I watched the first two seasons of this, and I really don't get the love this show gets. It's not *bad*, there are a few good episodes, but I found most of it predictable and the morality almost entirely hamfisted.",
            "score": 4,
            "author": "TheJollyLlama875"
        }
    ]
}