{
    "id": "6ogh0m",
    "score": 5489,
    "title": "[US] Memento (2000) A man juggles searching for his wife's murderer and keeping his short-term memory loss from being an obstacle.",
    "author": "imjuststoned",
    "date": 1500559892.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/6ogh0m",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Leonard Shelby: We all lie to ourselves to be happy. ",
            "score": 274,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "LENNY!",
                    "score": 65,
                    "author": "Murcielago311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...Do I know you?",
                            "score": 31,
                            "author": "mac_question",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You know, I've had more rewarding friendships",
                                    "score": 32,
                                    "author": "QuidProQuo_Clarice"
                                },
                                {
                                    "level": 3,
                                    "comment": "Teddy. Don't believe his lies. ",
                                    "score": 9,
                                    "author": "Oodlemeister"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That guy... He's here already...",
                            "score": 8,
                            "author": "Nuggetry"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can watch it 10 times and find something new each time",
            "score": 231,
            "author": "wedontneedroads13",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is especially true for Leonard.",
                    "score": 113,
                    "author": "icantfindadangsn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He has a condition.",
                            "score": 49,
                            "author": "oddmanout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now, where was I ",
                                    "score": 28,
                                    "author": "reddstudent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Am I chasing him? Or is he chasing me?",
                                            "score": 22,
                                            "author": "BigMax55",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Chasing me",
                                                    "score": 13,
                                                    "author": "Kittstar123",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't feel drunk.",
                                                            "score": 19,
                                                            "author": "awesom-o85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Best line of the movie, for me.",
                                                                    "score": 9,
                                                                    "author": "ickypedia"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Similar to The Prestige.",
                    "score": 4,
                    "author": "Antrikshy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this film because of the way it makes you feel while watching it. You know nothing at the start but slowly, slowly you build up a picture of what happened bit by bit. \n\nThen 2/3 of the way through what you thought you knew is slowly unravelled until you end up not knowing what to think until all is revealed right at the end.\n\n Great story-telling. ",
            "score": 208,
            "author": "13_Polo",
            "replies": [
                {
                    "level": 1,
                    "comment": "But do you actually know what happens at the end? It's one of my favorite movies because I firmly believe Teddy is an unreliable source.",
                    "score": 75,
                    "author": "icantfindadangsn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\n[Spoiler](/s \" I believe teddy and what he says the only reason he is branded as a liar by leonard is because leonard wants to set him up to be killed by leonard for being used by him to kill Jimmy (Natalie boyfriend). So what he says about leonard killing his wife is actually true and that they've done this all before and he actually killed the real John g at some point before the movie.\") \nEdit to appear as spoiler   ",
                            "score": 53,
                            "author": "djlumen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a theory that there's no John G and the Jenkiss story is actually about Leonard killing his wife with insulin. ",
                                    "score": 27,
                                    "author": "dgener8puf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 21,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sort of. Sammy was definitely a real person, and Leonard definitely worked on his case.  But the later elements of Sammy's story are actually Leonard's story, with Leonard having replaced himself with Sammy to help himself cope. There's even a scene in the hospital where Sammy is sitting there, a nurse walks by, and he quickly flashes into Leonard for a moment. ",
                                                    "score": 15,
                                                    "author": "fuzzy510"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": " My bad. \n\nIt's been a couple of years since I've watched it and the post i replied to was talking about John G as if he were a real person, it just spawned the thought that everything wasn't as it seemed (which, yes, is essentially the plot of the movie.)",
                                                    "score": 3,
                                                    "author": "dgener8puf"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[Spoiler](/s \"Yea that's part of what teddy tells him, which if you believe teddy lends credence to the theory that leonard can learn through repetition and his problem is physical and not mental. Which is part of what you to figure out as you watch the movie what his motivation and all the characters motivations are.  That's one of the reasons I love this movie and always recommend it to people.\")",
                                            "score": 18,
                                            "author": "djlumen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly.  Because: \n\n&gt; Leonard Shelby: We all lie to ourselves to be happy.\n\n",
                                                    "score": 9,
                                                    "author": "Empyrealist"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "... isn't this the plot of the movie?",
                                            "score": 7,
                                            "author": "rlbond86"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But if Leo killed his wife (accidentally) then how does he not remember his wife having diabetes? Surely she was diabetic before the robbers entering their home and Leo suffering from a head injury? \n\n\nIt's not even a lie. He (from what i get from the movie) really doesn't remember his wife having diabetes. ",
                                    "score": 6,
                                    "author": "Ed_ButteredToast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's created false memories by continuing to repeat the Sammy story over and over and I believe he is trying to forget the truth by continuing the lies. ",
                                            "score": 3,
                                            "author": "djlumen"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yo, watch it with the spoilers. ",
                                    "score": 1,
                                    "author": "barnacledoor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Suggestion:  Don't read past \"Do you actually know what happens?\"",
                                            "score": 14,
                                            "author": "RemyJe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i've seen the movie.  it wasn't spoiled for me, but this is a thread telling others to watch it and ruining it within the same thread.",
                                                    "score": 8,
                                                    "author": "barnacledoor"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, the movie has only been out for 17 years!  Watch those spoilers!",
                                            "score": 10,
                                            "author": "GaryColemansRevenge",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, to be fair, this is a thread about getting people *who haven't seen this movie* to watch it. Of all threads I think this would be an understandable one to keep spoilers out of",
                                                    "score": 25,
                                                    "author": "holymojo96",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "thank you.  that was my point.  \"hey, you should watch this movie that you've likely never seen.  oh and here is the surprise of the movie!  hope you love it!\"",
                                                            "score": 8,
                                                            "author": "barnacledoor"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think how he reacts to the information shows that he's the type of person to do that.\n\n(Trying to stay spoiler free with that sentance)",
                            "score": 3,
                            "author": "fatclownbaby"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's one of those movies that screws with your perception of reality.  After every time I've watched it my perception of time feels out of whack.  It's like an optical illusion for your temporal lobe.",
                    "score": 1,
                    "author": "RedNeck_Intellect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remember Sammy Jankis ",
            "score": 20,
            "author": "shmancy_pants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have I told you about Sammy Jankis?",
                    "score": 5,
                    "author": "CashKing_D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a great film, if nothing else for the novelty of its editing.\n\nThe movie is played backwards, with the chronologically last scenes coming first, and the chronologically first scenes coming last. This plays on the main character's short term memory amnesia, so every time he loses his memory the audience is just as clueless as him and are just as eager to figure out how he came to be in that situation.\n\nAnd because the movie is reverse, you know how the story ends, the question the film is left to answer is why it 'ended' that way.",
            "score": 427,
            "author": "TThor",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; The movie is played backwards, with the chronologically last scenes coming first, and the chronologically first scenes coming last\n\nNope.\n\nWe get the past moving forward in black and white.\n\nWe get the present moving backwards in color.\n\nScenes from each timeline alternate as the movie goes forward.\n\nAnd the end of the movie is the middle of the timeline where the two meet.",
                    "score": 354,
                    "author": "daybreaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Memento timeline graph: \nhttps://upload.wikimedia.org/wikipedia/commons/b/b3/Memento_Timeline.png",
                            "score": 153,
                            "author": "Genoce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's amazing. Thank you for showing this. It doesn't even spoil anything.",
                                    "score": 29,
                                    "author": "koobstylz"
                                },
                                {
                                    "level": 3,
                                    "comment": "To your knowledge, as anyone released recut version of the film that follows the timeline?",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was a special edition DVD that was released a while back that had a chronologically correct version of the film.  You had to go through a series of menu prompts that were set up to be similar to the tests Leonard was running on Sammy Jenkiss. I used to have it and fail to recall when it was released exactly because I lent my copy to a \"friend\" who ended up keeping it.\nTL:DR Yes\nHere is a link on Amazon:\nhttps://www.amazon.com/Memento-Widescreen-Two-Disc-Limited-Pearce/dp/B0000640SA/ref=sr_1_1?ie=UTF8&amp;qid=1500583386&amp;sr=8-1&amp;keywords=memento+special+edition+dvd\n(edit with link to purchase the special edition)",
                                            "score": 48,
                                            "author": "amebix720",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have that edition. I love the chronological version. \n\nI weep for your loss, my brother. I will never loan mine, in your honor. ",
                                                    "score": 8,
                                                    "author": "InvisibleManiac",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Good man. My pops always said, \"never loan out shit you aren't willing to part with forever\" Oh well. Lesson learned.",
                                                            "score": 7,
                                                            "author": "amebix720"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My ex told me about this. I got so intimidated by the potential challenge that I never even looked into it on the DVD.  That was in 2006.",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Its not too difficult. The DVD review I had read on it also had instructions on how too find it. Its definitely worth doing it just to see the chronologically \"correct\" version. Regardless, it was a great film. When I heard Nolan was doing a Batman origin movie I was really excited.",
                                                            "score": 1,
                                                            "author": "amebix720",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Cool thanks. Might just by an old DVD copy to try.",
                                                                    "score": 1,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I actually saw that kind of a \"recut\" a few years back on youtube, but all the links I can find now are deleted. I guess it had to be removed, but it's out there somewhere. :D",
                                            "score": 4,
                                            "author": "Genoce"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't think I would watch that, as part of the brilliance of the movie was the editing.",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To me it'd be like watching Pulp Fiction (I know, a cliche choice) in chronological order. Not only would you not meet Butch until like 50 minutes in, but it just wouldn't have the same emotional impact as it does now. ",
                                                    "score": 1,
                                                    "author": "ratmfreak"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A comment below says that there's actually a chronological recut included as an easter egg on the DVD.",
                                            "score": 2,
                                            "author": "Mulletman262"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "http://i.imgur.com/URA59VM.gif",
                                    "score": 1,
                                    "author": "kingeryck"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's an Easter egg in the special edition DVD that allows you to play the film in chronological order. It's an entirely different film altogether.",
                            "score": 13,
                            "author": "SocksElGato",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've decided to never watch it. A key feature of the narrative structure is how many scenes end with Lenny getting abruptly interrupted and just immediately going to the next one without transition, which gives you the same feeling of jumping around from memory to memory as Lenny. \n\nAlso, the end of the movie (middle of the timeline) actually manages to be a decent surprise, as it ties together everything from the color/future scenes in a \"OH SHIT\" way, to the past/B&amp;W scenes. If that scene just happens in the middle of the movie, its just a normal scene like \"Oh, ok. So he's setting Teddy up and I understand why\" and then the next 40 minutes is you getting frustrated that his moment of clarity is taking so long to come back around and pay off.\n\nI could see it being interesting to watch after youve seen the movie, just to get handle on the full story, then going back to the normal movie again.",
                                    "score": 28,
                                    "author": "daybreaker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thing being an extra/easter egg is making it clear its there for a rewatch. No one said you should/haveto watch in chronological order.",
                                            "score": 26,
                                            "author": "Theban_Prince"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thats probably my favorite transition.\n\nOr maybe Trinity (forget her real name) grabbing his arm in the diner.",
                                                    "score": 5,
                                                    "author": "daybreaker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Why am I running? Am I chasing that guy? Nope.",
                                                            "score": 6,
                                                            "author": "thebbman"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Memento is one of my favorite movies (for many of the reasons you described). The re cut is worth the watch. It isn't as good, but it is a cool watch once you have seen the original more than a couple times. It's a cool concept for a special feature.",
                                            "score": 2,
                                            "author": "Downvote_Comforter"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm surprised how often this is mistaken. I mean, they switch back and forth from color and b&amp;w to help the viewers. Though if the movie didn't have that the timeline would be nearly impossible to grasp the first couple viewings.",
                            "score": 18,
                            "author": "icantfindadangsn"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!  It bugs me when people get this wrong.",
                            "score": 5,
                            "author": "troubleondemand"
                        },
                        {
                            "level": 2,
                            "comment": "Those B&amp;W scenes are like 5% of the movie though. The vast majority is told backwards.",
                            "score": 3,
                            "author": "rlbond86"
                        },
                        {
                            "level": 2,
                            "comment": "I've watched the movie several times and read many reviews.  This is the best description. Imma watch it again tonight. ",
                            "score": 2,
                            "author": "TheGreatRao"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only times reverse chronology has been done so beautifully: \n\n1. Memento\n2. Seinfeld",
                    "score": 111,
                    "author": "tacos41",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's funny because the whole reason I watched Memento was because the Seinfeld episode was on and I had realized I never got around to watching memento. ",
                            "score": 41,
                            "author": "PhillyLyft"
                        },
                        {
                            "level": 2,
                            "comment": "also \"Betrayal\", a play by Harold Pinter. Which is the inspiration for the Seinfeld episode. Hence why the groom is named Pinter. ",
                            "score": 26,
                            "author": "ChesterPumpernickle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The episode is actually titled \"The Betrayal\"",
                                    "score": 11,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Huh, some new Seinfeld trivia is always welcome. Cool.",
                                    "score": 3,
                                    "author": "acmercer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Irreversible by Gaspar Noe is a pretty good example of a movie like this too.",
                            "score": 21,
                            "author": "ColdHandSandwich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ugh that movie! It's VERY intense.... a little scarring ",
                                    "score": 8,
                                    "author": "toneesh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's definitely on the list of movies I appreciate having seen, but never want to ever watch again.",
                                            "score": 3,
                                            "author": "nickcash"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "- Irreversible.",
                            "score": 11,
                            "author": "Pjoernrachzarck"
                        },
                        {
                            "level": 2,
                            "comment": "India? I'm not going to India?",
                            "score": 6,
                            "author": "thisisntnamman"
                        },
                        {
                            "level": 2,
                            "comment": "I thought this was just a coincidence because I only ever saw Seinfeld in re-runs. That show is full of surprises. ",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Venture Bros. too. ",
                            "score": 2,
                            "author": "sharkweekk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love this movie. After each viewing, I have a different opinion of what the actual truth is. ",
                    "score": 28,
                    "author": "Mallrat1973",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also I own this movie and have seen it many times but because of the way the chronology is shown i can never remember how it ends!\n\nStephen Tobolowsky is great in it too!\n\nEdit: Spelling",
                            "score": 10,
                            "author": "toneesh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Tobolowsky*",
                                    "score": 2,
                                    "author": "troubleondemand",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha! Do you know I checked how to spell it and after all that didn't notice the \"n\" had replaced the \"b\". Thanks!",
                                            "score": 2,
                                            "author": "toneesh"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's more than that... if I remember correctly, the scenes in colour are present time, while the black and whites are in reverse. With the DVD, you could watch the movie in correct chronological order if you wanted.",
                    "score": 20,
                    "author": "ponchodeltoro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have it backwards. Black and white scenes are forward but nothing much happens in them beyond narrated internal monologue",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heh, \"backwards\". \n\nAnd the black and white scenes, while mainly there for exposition, are in the timeline of the film, directly. There's even a wonderful shot where the monochrome/colour transition, but I won't say from what to what. ",
                                    "score": 8,
                                    "author": "robot_cousin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because a true narrative is not what happened but why it happened. Just like life. Ok this Shakespeare guy is nuts",
                    "score": 1,
                    "author": "Brendancs0"
                },
                {
                    "level": 1,
                    "comment": "I've got the limited edition dvd and supposed if you \"pass\" the psychological test then the movie will play in chronological order. Never tried it though. \n\nhttp://www.eeggs.com/items/34998.html",
                    "score": 1,
                    "author": "Mallrat1973"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cannot stress this enough: You must watch this movie. It will probably make it into your Top Ten Movies of All Time list.",
            "score": 147,
            "author": "HeadBrainiac",
            "replies": [
                {
                    "level": 1,
                    "comment": "Along with all the other Nolan films right? ",
                    "score": 77,
                    "author": "Bowldoza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The man makes really entertaining movies, what can I say?",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nolan is his own franchise now. ",
                                    "score": 7,
                                    "author": "thebbman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Looking forward to Dunkirk this weekend.",
                                            "score": 9,
                                            "author": "McWaddle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hardly. The concept is brilliant, but it doesn't go far beyond that. Memento doesn't make me *feel* much apart from appreciation of how cool it's made. I have very little passion for any of the characters or their drives in this film.\n\nHere is a man with short term memory loss, but the film doesn't do much more with that concept other than to tell us how frustrating it is (and how people in general are terrible creatures)\n\n**It's a great film**. But I wouldn't put it among the greatest.",
                    "score": 36,
                    "author": "Pjoernrachzarck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree, I enjoyed The Prestige a lot more than Memento. Memento is certainly an interesting movie, but also a frustrating one. It'd be hard pressed to make it to most people's top 10's.",
                            "score": 30,
                            "author": "iNachozi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be honest, I don't think The Prestige- or any Nolan film- goes very far with character development, which (I think) was the original criticism here.\n\nNolan consistently puts out films I love, but I think Cooper was the only character in any of them that gave me the feels.",
                                    "score": 14,
                                    "author": "mac_question",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interestingly I think Interstellar is one of his worst films (blasphemy on reddit I know), but agree that it has one of his best attempts at creating a character with emotional depth to connect to. ",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's okay.\n\nThat's exactly how I feel about The Prestige.",
                                                    "score": 6,
                                                    "author": "mac_question"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't know about that, Danton pretty much descended into mania by the end of The Prestige, and became more of an anti-hero to me as the movie progressed. ",
                                            "score": 7,
                                            "author": "fireinthesky7"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I can appreciate that argument. For me, whereas the prestige and memento both lack in character development, the prestige makes up for it in an interesting and captivating plot",
                                            "score": 6,
                                            "author": "iNachozi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It also makes up for it with David Bowie. ",
                                                    "score": 5,
                                                    "author": "thebbman"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I dunno, the ending of prestige with bale is excellent.",
                                            "score": 1,
                                            "author": "JustifiedAncient"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Opinions and all that, but I feel there's more depth found in this film rhan you may be giving it credit for. \n\nThe whole story of Sammy Jankis, real or made up? Is Leonard's condition real? Or should he be able to make new memories but due to emotional trauma, he's now mentally ill? There's a telling shot when we see Sammy sitting in the chair in the rehabilitation centre / nursing home and for the briefest of moments, it's someone else. \n\nIs Leonard any better than those who just use him to get what they want? He's told the real deal and even then does one purposely misleading thing that ends up causing the events of the scene in the beginning. It could be argued that he really is just lying to himself so much that it's now his truth, his goal in life. \n\nTo bring it back to Seinfeld, and to quote George Costanza: \"It's not a lie, if YOU believe it.\"",
                            "score": 12,
                            "author": "robot_cousin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well you mostly just reiterated my point. What scenes exist in Memento that aren't about the practical problems of memory loss are mostly concerned with the morality (or lack thereof) of everyone.\n\nBut a) this examination doesn't go very far and\n\nb) it's far from the most interesting thing you could do in a film about a man who cannot make new memories.\n\nHow interesting, how fascinating, how terrible it must be to not be able to make new memories! But outside of Sammy Jenkin's wife, the film is not concerned with that. It is mostly concerned with how impractical it is when you want to achieve something, and how confusing it is. And while it achieves that wonderfully, it leaves me wanting more.\n\nLenny is not a very human character. None of the characters are. And by 'human' I don't mean soft, deep or sentimental. It's good that he mostly functions in order to complete his task. With human I mean written in a way that makes me confront my own condition, which is what all great fictional characters do. \n\ntl;dr: all I feel when watching Memento is \"oh that must suck\", which works fine but could have been *more*.\n",
                                    "score": 4,
                                    "author": "Pjoernrachzarck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fair enough, good points. ",
                                            "score": 5,
                                            "author": "robot_cousin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[Spoilers] (#s \"It goes deeper than just the nursing home scene. There are several scenes and flashes that hint at Lenny being Sammy in the story and that he's the one who killed his wife. The entire movie is built around this idea that memory is fickle, it's stated early on in a conversation between Lenny and Teddy. So you have to watch for all the little visual clues that are trying to tell you Lenny's wife was raped but never murdered and that he's the one who killed her with her shots.\")\n\n[Further Spoilers] (#s \"The ending (middle) scene where he writes Teddy's name on the photo also shows us that Lenny is more than aware of his condition and he uses it to intentionally kill Teddy.\")\n\nI think the movie is far deeper than /u/Pjoernrachzarck says it is. ",
                                    "score": 2,
                                    "author": "thebbman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is not about *depth* (and neither are your points, they are more about complexity, and they are not the same thing). \n\nThis is about the prime condition of great art, namely that it serves some emotional examination of the human condition.\n\nThat doesn't necessitate, nor is it dependent on, complexity. The intricacies of Memento's plot aren't in question here.",
                                            "score": 1,
                                            "author": "Pjoernrachzarck"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;but the film doesn't do much more with that concept other than to tell us how frustrating it is\n\n\n*Just* frustrating? My man, the movie tries to make a point the entire time that Leonard Shelby's life is destroyed if looked from the perspective of having a *purpose*. It's a debilitating condition that is a nightmare for him to live.\n\nLenny tells Natalie in the diner/cafe that:\n\n\n&gt;Just because there are things I don't remember doesn't make my actions meaningless.\n\nBut honestly we know that it's a lie. That is the unfortunate truth that because of his condition, his actions are stripped away from their meaning, their purpose. Because what ever he does, he will forget about ever doing that action. His action of buying his wife a birthday present is stripped away from its meaning when he wont remember her birthday and him buying a gift after sometime. He can remind himself again and again but in the end, he will forget about it. Like it never happened. You might wonder, well the wife was happy because of the gift but wonder what will happen after it. He will ask her where it came from as if he knew nothing about it. She will tell him again and he will forget again. A mutual appreciation of that action won't exist which will affect his wife's feeling for that gift because it's almost as if a stranger gifted her. \n\n\nWhat he does can be done by a stranger and it wouldn't affect Lenny because in both scenarios, Lenny would not remember/be aware of that action.\n\n\nThat's the whole reason behind Lenny sabotaging the police case file oh his wife's rape/murder case to turn it into an endless cycle where he will always come back to finding his wife's killer after killing the *\"real John G\"*. \n\n\nHe is trying to give his life and his actions meaning because his condition is stripping all of that away from him. \n\n\nIn this movie, you're seeing a man living a horrible nightmare where he has the option to either accept his wife's death and lead a meaningless life or live a lie where will kill innocent (innocent of killing his wife) people just to have a sense of purpose in his life. \n\nMemento is a very depressing movie when it comes down to it. The structured narrative as in how it's filmed is really impressive but the story itself is nothing less than that. \n\n\nLenny is a mirror we all refuse to look at as he represents all of what most people can sometimes do. Lie and lie and lie over and over in a desperate attempt to give meaning to things we want. \n\n\nMemento is best understood if you empathise and analyze the main character Leonard. His actions being mostly a desperate attempt at gaining *\"purpose/meaning\"*. \n\n\nNot saying you still will be able to enjoy the movie as much as other people because it all comes to down to taste. Sure it's perfectly okay to not consider this movie in your top 10 because this is a subjective matter and there are tons of movie that can compete for your top 10 spot. \n\n",
                            "score": 3,
                            "author": "Ed_ButteredToast"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, same. Memento is a bog-standard revenge plot that's elevated by really great editing and a cool storytelling method. It's good but I don't like it anywhere near as much as every other human alive seems to.",
                            "score": 2,
                            "author": "GhostofJeffGoldblum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kinda how I feel about most of Nolan's stuff. It's really cool but it doesn't really stand up to repeated viewings.",
                                    "score": 4,
                                    "author": "TheJollyLlama875"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed. I really like the movie and I know I'll watch it many more times, but it's not in my top 10. Maybe top 50.",
                            "score": 1,
                            "author": "Andrado"
                        },
                        {
                            "level": 2,
                            "comment": "Meh. As a person who prefers cerebral films, 9/10 of my favorite films are very cerebral. This tyranny of feelings, characters, and humanity shall end. I'll burn it to the ground myself.",
                            "score": 1,
                            "author": "dasignint"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haha you got that right. I believe it's currently number 7 or so on my list. :-)",
                    "score": 2,
                    "author": "ratmfreak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the best movies of all time.",
            "score": 10,
            "author": "nailsinch9"
        },
        {
            "level": 0,
            "comment": "J. G. ",
            "score": 7,
            "author": "nimbyard"
        },
        {
            "level": 0,
            "comment": "### **[Memento (2000)](http://www.imdb.com/Title?Memento+%282000%29)**\n\nMystery, Thriller [[USA:R](https://en.wikipedia.org/wiki/Motion_Picture_Association_of_America_film_rating_system#Ratings), 1 h 53 min]  \nGuy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior  \nDirector: Christopher Nolan\n\n**IMDb rating:** [](#movieguide_stars)**&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9733;&amp;#9734;** **8.5**/10 (910,068 votes)\n\n&gt; Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.\n(*IMDb*)\n\n**Critical reception:**\n&gt; Memento was met with critical acclaim, earning a 92% rating on Rotten Tomatoes. Online film critic James Berardinelli gave the film four out of four stars, ranking it number one on his year-end Top Ten list and number sixty-three on his All-Time Top 100 films. In his review, he called it an \"endlessly fascinating, wonderfully open-ended motion picture \\[that\\] will be remembered by many who see it as one of the best films of the year\". Berardinelli praised the film's backwards narrative, saying that \"what really distinguishes this film is its brilliant, innovative structure\", and noted that Guy Pearce gives an \"astounding...tight, and thoroughly convincing performance\". In 2009, Berardinelli chose Memento as his \\#3 best movie of the decade. William Arnold of the Seattle Post-Intelligencer writes that Memento is a \"delicious one-time treat\", and emphasizes that director Christopher Nolan \"not only makes Memento work as a non-linear puzzle film, but as a tense, atmospheric thriller\". Rob Blackwelder noted that \"Nolan has a crackerjack command over the intricacies of this story. He makes every single element of the film a clue to the larger picture...as the story edges back toward the origins of \\[Leonard's\\] quest\".\n(*Wikipedia*)\n\nMore info at [IMDb](http://www.imdb.com/Title?Memento+%282000%29), [Wikipedia](https://en.wikipedia.org/w/index.php?title=Memento%20%28film%29), [Rotten Tomatoes](https://www.rottentomatoes.com/m/memento/), [Metacritic](http://www.metacritic.com/movie/memento), [Netflix](http://movies.netflix.com/WiMovie/60020435), [Wikidata](https://www.wikidata.org/wiki/Q190525).  \n*I am a bot.* [Send me feedback](https://www.reddit.com/message/compose?to=%2Fr%2FMovieGuide&amp;subject=Re%3A%20http%3A%2F%2Fredd.it%2F6ogh0m \"Confidence: 1.05\"). [Data sources and other information](/r/MovieGuide/w/about).\n",
            "score": 12,
            "author": "MovieGuide"
        },
        {
            "level": 0,
            "comment": "I still remember when Memento came out. I was living in a small-midsize town in Texas, but kept reading about it in the newspaper.  Unlike most movies that make a splash upon release and then fizzle out over a few weeks, I noticed that I kept seeing articles about it, kept seeing coming to more and more theaters across the state, but it never came to my town.  \n\nThen, a few weeks later, my wife and I decided to take a long weekend for fun (ah, the days before kids).  The drive back took us through Dallas.  I called around to a bunch of theaters (ah, the days before the internet was everywhere) and finally found one that had a showing.  Using my atlas (it was like Google maps, but on paper.  Ah, the days before smart phones), we got lost a few times, but found the theater, bought our tickets and sat down.  \n\n2 hrs later, the credits rolled.  I turned to my wife and said \"I'm not sure, but I think we just saw a pretty cool movie.\"  She agreed.  Across the parking lot was a Denny's, which was our favorite place at the time (ah, the days before indigestion), so we walked over for dinner, waiter gave us our menu and took our drink order...and we promptly talked about what we just saw for the next 45 minutes without placing our order.  \n\nWhere I saw one thing, she saw another.  Where I thought I saw a secret message from the director one place, she didn't even see it.  \n\nWe had both just seen the same movie, and yet hadn't seen the same things and, as a result, felt like we'd both seen different movies.  \n\nTo this day, it's one of our fondest memories together, and one of our favorite movies ever.  ",
            "score": 10,
            "author": "nodoubt63"
        },
        {
            "level": 0,
            "comment": "I believe Nolan is remaking it. It's in post production\n\n[here y'all go](http://www.imdb.com/title/tt5207922/) ",
            "score": 21,
            "author": "the-texas-law-hawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why though?  The first one is amazing?",
                    "score": 23,
                    "author": "BillScorpio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This one's gonna be backwards timeline _and upside down_. ",
                            "score": 18,
                            "author": "emperorOfTheUniverse"
                        },
                        {
                            "level": 2,
                            "comment": "Money. The original was good, so they are betting a remake will bring in just as much if not more money.",
                            "score": 3,
                            "author": "FrogCannon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "New ideas are risky. That is why you have reboots, remakes, and sequels occupying most of the box office.",
                                            "score": 4,
                                            "author": "FrogCannon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I hear the next Spider Man reboot is already in the works.",
                                                    "score": 2,
                                                    "author": "nitiger"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Creative bankruptcy. Hollywood has nearly given up on good new ideas and would rather play it safe by making remakes, sequels, and spin-offs to collect checks without having to do anything new or exciting.",
                            "score": 1,
                            "author": "Andrado"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That imdb page looks more like its in pre production... \n\nAlso, it doesn't really seem like Nolan is the one doing it. His name appears to just be associated since he wrote the original screenplay that's being remade.",
                    "score": 15,
                    "author": "mustardtruck"
                },
                {
                    "level": 1,
                    "comment": "I refuse to believe that Nolan would be so stupid as to be involved in any aspect of this.",
                    "score": 7,
                    "author": "JustifiedAncient",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He isn't. Nolan isn't involved at all. It's just the company that owns the rights trying to cash in.",
                            "score": 4,
                            "author": "preoncollidor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Uuuuuugh",
                    "score": 5,
                    "author": "Daemonecles"
                },
                {
                    "level": 1,
                    "comment": "The remake could utilize smartphones so that'll be interesting. ",
                    "score": 5,
                    "author": "MeeeH23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some kind of clever app would have made his life a whole lot easier. ",
                            "score": 5,
                            "author": "thebbman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's amazing how now you can just take out your phone and make a note instead of tattooing everything on ourselves like the old days. ",
                                    "score": 12,
                                    "author": "preoncollidor"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The studio that owns rights to it announced two years ago they're remaking it, but it's unlikely Nolan will be involved in any way, and it will probably have a completely different cast.\n\nAlso, it's in \"development\" not \"production.\" Production means it's actively being made (filmed and edited). It has no cast or crew assigned yet, so it's in development - someone can write the words \"Memento remake\" on a post-it and that technically counts as \"in development.\"",
                    "score": 2,
                    "author": "Andrado"
                },
                {
                    "level": 1,
                    "comment": "The only information listed on that page is in the trivia section - \"Some rumours say, that Christopher Nolan will remake his first high grossing movie, Memento, based on the short story written by his brother, Jonathan Nolan.\" Just a rumour thus far, folks.",
                    "score": 1,
                    "author": "Garfimous"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why am I running.",
            "score": 3,
            "author": "local_dj"
        },
        {
            "level": 0,
            "comment": "It's been a while, but I recall the close captioning at the end reveals something that isn't really audible (and important to the plot). But I too have no memory so am reading that off a tattoo in front of a mirror of post it notes.",
            "score": 3,
            "author": "MCFiskars"
        },
        {
            "level": 0,
            "comment": "I still think this is Christopher Nolan's best film.  The plot is airtight, Guy Pearce' acting chops are bonafide, and it's devoid of the \"one twist too many\" issue that plagues most of his films.",
            "score": 3,
            "author": "RedNeck_Intellect"
        },
        {
            "level": 0,
            "comment": "Ghajini!!",
            "score": 7,
            "author": "ketoketoketo_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. It's basically the same story with *more* plot added. Plus, you know. Bollywood music videos.",
                    "score": 1,
                    "author": "AboutToSnap"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember watching this for the first time back in the Summer of 2001 in D.C. while I was at an internship at Georgetown. There were 16 of us in the internship and only about 5 went one night to watch it because of the buzz it was generating. To this day, it's one of my favorite films of all time and I watch it at least a couple of times a year.",
            "score": 5,
            "author": "SocksElGato"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Now, where was I?\"",
                    "score": 1,
                    "author": "SirAdrian0000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're only supposed to watch it once. That's kinda the point. ",
            "score": 6,
            "author": "weareea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Elaborate on that, that sounds pretty interesting. I've seen it twice now but there was a good four or five years between viewings one and two, so I really couldn't remember the actual chronology, and forgot the twist. I'm assuming you're getting at something like that, where forgetting it is part of the audience's engagement with the movie?",
                    "score": 6,
                    "author": "Sneaky_Devil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Realized my comment sounded pretty *for sure* but this is my personal theory, driven mostly by the history of Nolan brothers' genius.\n\n It's not watching it once and forgetting it, it's watching, learning, and then moving on from it. In the story at the very end **SPOILER** when he's driving in the car - he says he has to believe in a world outside his own mind, a world that doesn't revolve around trying to answer the question of who killed his wife. He says he has to believe his actions still have meaning, even if he can't remember them. \"I have to believe that when my eyes are closed, the world is still here. Do I believe the world's still here? Is it out there?\" \n\nHe's searching. The world out there is real and ready. This endless, *more importantly,* pointless riddle he continues to solve is beyond the point because he is missing the world by dwelling on it. \n\n\n\"Opens eyes* \"Yeah. We don't need mirrors to remind us who we are. I'm no different.\" *Screeech!* He pulls up to a tattoo parlor and goes right back into the endless riddle, the Nolan's leaving us with a memento of our own to remember the hell we live in if we can't simply learn, and move on. I also believe, and this a bit further of stretch, that the movie was written with intentional plot holes, leaving some viewers trying to figure out the story for days, watching and rewatching, but never finding the answer. Same as the main character. Again, or simply watch it, remember the lesson, and move on wasting no more time, getting out into that real world, that is there, where your actions still have meaning. ",
                            "score": 9,
                            "author": "weareea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That... is a brilliant theory that really changed how I look at the movie. You should post that to /r/FanTheories",
                                    "score": 2,
                                    "author": "CashKing_D"
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy shit i think i have finally gotten the answer to the puzzle pieces missing from memento. Maybe to was never meant to be solved!! ",
                                    "score": 2,
                                    "author": "Ed_ButteredToast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The ultimate waster egg. There is no spoon. ",
                                            "score": 1,
                                            "author": "weareea"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tried watching this because everyone says its really good. Couldn't even finish it because it wasn't keeping my attention. What am I missing?",
            "score": 12,
            "author": "ceremony816",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciation for narrative structure. ",
                    "score": 104,
                    "author": "BillScorpio"
                },
                {
                    "level": 1,
                    "comment": "Try again, you'll spend the first 99% going\"what the fuck is happening\" and the last 1% going\"holy shit it makes so much sense I need to wash this again\"",
                    "score": 6,
                    "author": "fieds69"
                },
                {
                    "level": 1,
                    "comment": "I agree. Ive tried watching it so many times it just feels like a tired version of the machinist. I think this whole amnesia trope is exhausting, Especially when everyone tells you how great it is.",
                    "score": 4,
                    "author": "Jmicale77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Machinist came out 4 years after Memento. I think it's a little unfair to say the amnesia trope is played out when you're talking about a movie that came out almost two decades ago. It was really fresh at the time and still is imo. ",
                            "score": 15,
                            "author": "Skrillcage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Seinfeld is unfunny.](http://tvtropes.org/pmwiki/pmwiki.php/Main/SeinfeldIsUnfunny) I had a similar experience watching Usual Suspects for the first time. I just didn't get why it was so celebrated. ",
                                    "score": 2,
                                    "author": "thebbman"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just noticed this is guy i just saw in Monte Cristo",
            "score": 2,
            "author": "iHadou"
        },
        {
            "level": 0,
            "comment": "This film is so good. Amazingly cast. Moving, hurtful, and disturbing without feeling manipulative. There are some major plot holes, but due to the way it's presented, new viewers probably wouldn't spot them until a few rewatches. Really, this movie is an experience.\n\n",
            "score": 4,
            "author": "wingspantt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are they plot holes or just the result of an unreliable narrator?",
                    "score": 4,
                    "author": "IDontKnowHowToPM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plot holes. For instance, Leonard seems to know a lot about treatment for his disease, even though he presumably would have learned this after his disease. He makes a phone call to arrange something at his hotel room and gives the wrong room number, but the arrangement still happens. His wife died, and in his grief he walked into a Jaguar dealership (ok, that one's a joke).",
                            "score": 2,
                            "author": "wingspantt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except for the fact that he knew about Sammy Jenkins and his condition so from there he might have possible learned it. \n\n\nAlso Lenny's condition was psychological and not physiological. He remembers Natalie telling her about her dead boyfriend even after a lot of time has past between her telling him and him writing it down on the back of her Polaroid picture. \n\n\nEdit: Also the conditioning thing. He conditions to remember and learn stuff. It hard and very repetitive but possible. Especially in his case. ",
                                    "score": 3,
                                    "author": "Ed_ButteredToast"
                                },
                                {
                                    "level": 3,
                                    "comment": "I was mostly joking. Since he's basically the definition of unreliable narrator. ",
                                    "score": 2,
                                    "author": "IDontKnowHowToPM"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Christopher Nolan, enough said",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So, let's have a spoilers discussion:  \n\nWhat do you think about the end? Was it really him? Or do you believe the other guy?",
            "score": 2,
            "author": "backalleybrawler",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was very much so him. The entire movie focuses on this idea that through conditioning he is able to remember some things. Through that conditioning he has become a serial killer. ",
                    "score": 4,
                    "author": "thebbman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Overrated movie. I'd say it's pseudo-intellectual crap.",
            "score": 2,
            "author": "SlothChunks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. It's so fucking corny and predictable and *slow*. ",
                    "score": 0,
                    "author": "sadhandjobs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm going to have to give this movie another shot. I saw it when it came out and absolutely hated it. ",
            "score": 1,
            "author": "thomjob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you rewatch?\n\nI just saw it last night for the first time.",
                    "score": 1,
                    "author": "chickenmagic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not yet. What did you think?",
                            "score": 1,
                            "author": "thomjob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loved it.  I didn't even realize it was a Nolan film till the opening credits.  \n\nI don't recall any movie successfully encouraging me to pay attention and latch onto any and every detail.  The way it's broken up 5 minutes at a time kept me on edge.  \n\nIt's a mystery/noir film and I think probably the most effective I've ever seen.  You learn things as the movie progresses (regresses?), but you still feel as perplexed as the narrator.",
                                    "score": 1,
                                    "author": "chickenmagic"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"It's a dick\"",
            "score": 1,
            "author": "OrangexSauce"
        },
        {
            "level": 0,
            "comment": "Ghajini!! ",
            "score": 1,
            "author": "badw0lfie"
        },
        {
            "level": 0,
            "comment": "Movie good a was this.",
            "score": 1,
            "author": "nintrader"
        },
        {
            "level": 0,
            "comment": "I like to say that \"50 First Dates\" should be called \"Memento: the comedy\"",
            "score": 1,
            "author": "heyitsanne"
        },
        {
            "level": 0,
            "comment": "Its interesting to me in that its a movie about someone with short term memory issues, but you need to use your memory to make sense of the movie.",
            "score": 1,
            "author": "justpassingby2day"
        },
        {
            "level": 0,
            "comment": "There are very few films that I could watch over and over and over again, and this is one of them.",
            "score": 1,
            "author": "faxinator"
        },
        {
            "level": 0,
            "comment": "Weirdly, I walked past Guy Pearce in Amsterdam yesterday.",
            "score": 1,
            "author": "Wackyal123"
        },
        {
            "level": 0,
            "comment": "I just rewatched it recently and had forgotten how good it was. There really wasn't, to my recollection, much of a buzz around it when it came out---like there was with, say, Fight Club or The Matrix---but it definitely holds up as one of the good psychological movies of that time.",
            "score": 1,
            "author": "caz-"
        },
        {
            "level": 0,
            "comment": "Watch the Indian version, Ghajini. Is hilarious! But like great. ",
            "score": 1,
            "author": "dvidsilva"
        },
        {
            "level": 0,
            "comment": "Fucking hell, the Dunkirk marketing machine is in full swing.",
            "score": 1,
            "author": "TheTurnipKnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your tinfoil hat is too tight. ",
                    "score": 2,
                    "author": "Ed_ButteredToast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What tinfoil hat? You see it all the time here on reddit when big movies are released. It's not a secret.",
                            "score": 1,
                            "author": "TheTurnipKnight"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Memento is een kutfilm!",
            "score": 1,
            "author": "Gustacho"
        },
        {
            "level": 0,
            "comment": "I've spent the last 6 months looking for my wife's killer.\n\nSo far, no takers.\n\n* Anthony Jeselnik ",
            "score": 1,
            "author": "allothernamestaken"
        },
        {
            "level": 0,
            "comment": "I watched this movie on the comedown of lsd. Wow",
            "score": 1,
            "author": "organ_transplant"
        },
        {
            "level": 0,
            "comment": "I can't remember if I've seen this or not",
            "score": 1,
            "author": "Lissiman"
        },
        {
            "level": 0,
            "comment": "deleted  ^^^^^^^^^^^^^^^^0.0323  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/61437)",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Takes one to know one!",
                    "score": 1,
                    "author": "boobiemcgoogle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't remember to forget you.",
            "score": 1,
            "author": "ghostface134"
        },
        {
            "level": 0,
            "comment": "Work of art.",
            "score": 1,
            "author": "Dungeon47"
        },
        {
            "level": 0,
            "comment": "I've watched it twice and it still had me scratching My head ",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}