{
    "id": "g3rr6i",
    "score": 3756,
    "title": "[US] Mindhunter (2017): In the late 1970s two FBI agents and a psychologist expand criminal science by delving into the psychology of murder and getting uneasily close to all-too-real monsters. Produced and partially directed by David Fincher.",
    "author": "[deleted]",
    "date": 1587232384.0,
    "url": "https://www.reddit.com/r/NetflixBestOf/comments/g3rr6i",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So good. It can be pretty disturbing at times, of course",
            "score": 539,
            "author": "SchopenhauersSon",
            "replies": [
                {
                    "level": 1,
                    "comment": "The son is somehow the creepiest",
                    "score": 186,
                    "author": "PursuitOfHirsute",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, the creepiest is in S2 with &gt;!the new boss who zips down Wendy's dress!&lt;",
                            "score": 64,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't remember this. What episode?",
                                    "score": 9,
                                    "author": "secretreddname",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think at the fifth? It's when they're at the work party",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just went through the work party scene and didn't catch it. Just the overly aggressive guy who couldn't take a hint.",
                                                    "score": 11,
                                                    "author": "secretreddname",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ok I just went thru it as well and it's an hour and 15 seconds into that episode! It's very subtle, by \"zip down her dress\" it's more like zip down two inches of it.\n\nFunny how this is a show about real serial killers yet for me that was one of the most disturbing moments.",
                                                            "score": 24,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Got it. I completely missed that without you pointing it out!",
                                                                    "score": 7,
                                                                    "author": "secretreddname"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Damn people are really dramatic now days lol",
                                                                    "score": -5,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "When they start loosening their ties, run for the hills",
                                    "score": 3,
                                    "author": "bdlcalichef"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And you’ll never think about Frozen the same way again. After dealing with the worst of humanity,  Kristoff suffered a mental break and retired to a life of isolation. Now you know the real reason why “Reindeer are better than people”.",
                    "score": 100,
                    "author": "DeflateGape"
                },
                {
                    "level": 1,
                    "comment": "It's the bgm, I'm telling you. Always gave me some sort of an uneasy feeling.",
                    "score": 13,
                    "author": "SantaIsRealEh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The scenes involving the son have the creepiest soundtrack of any show I've seen, it's insane how unsettling it is.",
                            "score": 26,
                            "author": "Thenaider",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah and with season 3 probably cancelled well have no idea how many people that creepy little kid ends up eating.",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How will we ever know what happens to that one guy from Witchita who likes to dress in women’s clothing and install security systems?  Seemed like a good enough guy.",
                                            "score": 32,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I assume just another good, god-fearing life well lived for that young man.",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Bless him 🙏🏼",
                                                            "score": 6,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Btk killer.",
                                                    "score": 6,
                                                    "author": "Weirwolfe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What!? No way!!!",
                                                            "score": 4,
                                                            "author": "grilledcheesesoup"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well I’m pretty sure he’s the BTK killer so you could just dive into a deep reddit rabbit hole about him instead lol",
                                                    "score": -1,
                                                    "author": "7h33v1l7w1n"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I thought there wasn’t going to be a season 3",
                                            "score": 9,
                                            "author": "xueye"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh no- it’s 100% cancelled for sure?",
                                            "score": 2,
                                            "author": "plain_cyan_fork",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Looks like it but not sure if its 100%. Just 99.9%",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At first when i saw \"Bgm\" i thought you were trying to think of btk. The music is really good though",
                            "score": 5,
                            "author": "jajajajaj"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing show, so angry it's been put on hiatus.",
            "score": 367,
            "author": "milkintheshower",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah doesnt look good to return.",
                    "score": 115,
                    "author": "Odeeum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 89,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The director, david fincher, is working on a Netflix movie called Mank so production for Mindhunter is on hold until he finishes it. Some of the lead actors for mindhunter were also released from their contracts during the hiatus which honestly worries me too",
                                    "score": 177,
                                    "author": "nottodaynotever",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ugh I really hope there's another season. How can they even write a third season if they don't know if the actors will be available to come back? Fincher created this show with a five season plan in mind but it looks so doubtful now to even get a third.",
                                            "score": 88,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "From what I heard of the official statement, they released them because it wasn’t fair to the actors to keep them from getting other work but Fincher is hopeful to have a return",
                                                    "score": 72,
                                                    "author": "hyperlethalrabbit"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He did it because he thought it wasn't fair to keep them on contract while he was working on other projects. There is hope but it will likely be 2 or 3 years from now before we get another season if it happens.",
                                            "score": 5,
                                            "author": "Vault420Overseer"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I bet if we all tweeted at Cary Fukunaga he would take over the show. He’s like a David Fincher egg",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Classic Netflix not renewing the good stuff",
                                    "score": 36,
                                    "author": "EmTeeEl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For once it wasn't Netflix's fault, they seemed very supportive of this show. Sucks that the /one/ time a smallish show has got Netflix's support, the director jumps ship",
                                            "score": 63,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's not how these Netflix shows work. There's a reason there are so many of them. Netflix throws a shit ton out and sees what sticks. Stranger Things was an immediate success, didn't have big names attached, and still took years for subsequent seasons. If you want big names attached, you can't expect them to wait out the results to see if there will be a 2nd season.",
                                                    "score": 2,
                                                    "author": "destroys_burritos"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's not that Netflix didn't renew it. Fincher is working on another project and they released the actors from their contracts so they could get other work during the hiatus.",
                                            "score": 21,
                                            "author": "DrNoobSauce",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If Fincher lost interest, he should have given it to someone else to finish.  I feel ripped off...you can't just do half a story arc and call it a day",
                                                    "score": 17,
                                                    "author": "grumpydaddy845",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "*laughs in GRRM*",
                                                            "score": 9,
                                                            "author": "Uglik"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Granted. \n\n*Netflix announces David Benioff and D. B. Weiss to take over Mindhunter as showrunners, given complete control of project*",
                                                            "score": 3,
                                                            "author": "shadowenx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great news!  Wow I'm surprised those two were interested",
                                                                    "score": 0,
                                                                    "author": "grumpydaddy845",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Woosh",
                                                                            "score": 4,
                                                                            "author": "tumblingdown3"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah honestly. I know he's a genius and all and responsible for how great this show is, but he couldn't have just made *one* more season to conclude it? I really want to believe that his refusal to hand it off to anyone else means that he has plans to eventually come back to it, but I also don't want to get my hopes up and be crushed if that doesn't happen.",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mean, Fincher is creative consultant and directed on a couple episodes each season so the show should be able to go on while he’s working on other projects",
                                                                    "score": 1,
                                                                    "author": "SpaceJeezy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You'd really think!",
                                                                            "score": 0,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most of the stuff Netflix has ditched was garbage with likely bad numbers. This is more on the director but unfortunately it wasn’t doing well numbers wise either.",
                                            "score": 2,
                                            "author": "Capital_Empire76"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It sucks the most because of all the build-up from season 2.",
                    "score": 18,
                    "author": "freelanceisart"
                },
                {
                    "level": 1,
                    "comment": "Oh what the fuck, why?",
                    "score": 3,
                    "author": "Quasimurder"
                },
                {
                    "level": 1,
                    "comment": "Well shit. Didn’t know that",
                    "score": 2,
                    "author": "BeerandGuns"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first season was one of the best pieces of television I’ve ever seen. \n\nSecond season still good but man was Season 1 something else.",
            "score": 242,
            "author": "rklolson",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually think s2 was better but it's still a great show!",
                    "score": 72,
                    "author": "CaptainJackKevorkian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I actually think s2 was better\n\nAbsolutely agree ! S2 was really good, which surprised me because I thought S1 was really well done. Its not often that the follow up season is better than the introduction. They didn't fall into any of the traps of a second run, no \"adding characters\" just to add interest. I liked how they fleshed out the main protagonists, and used a real event in a relatable way...very well done.",
                            "score": 46,
                            "author": "grump66",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They also focused the story on the better of the actors - holt mcellany",
                                    "score": 15,
                                    "author": "woodspaths",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's an amazing actor, but I think Jonathan Groff is every bit as good.  His range is incredible if you've seen him on Broadway and Glee before this show.",
                                            "score": 9,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; holt mcellany\n\nHe was GREAT ! Eh ? Why has this guy not been hired for more central characters ???",
                                            "score": 11,
                                            "author": "grump66",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He’s in so much, but usually small parts. Mindhunter is his 3rd David Fincher project, maybe he grew on him. Either way, I hope he gets something big if not more mindhunter.",
                                                    "score": 7,
                                                    "author": "wafflestomps"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah reading some of the responses I can agree as to the reasons why. I think for me, although the second season was probably just objectively better having settled into the narrative, when I think of the show my first reaction is how it blew my mind after having zero expectations going into it. And that season 1 finale oh my lord — the last scene was just expertly crafted art that sits with me still more than anything else. Helps that the music was from my all time favorite band so maybe there’s some bias there haha",
                            "score": 3,
                            "author": "rklolson"
                        },
                        {
                            "level": 2,
                            "comment": "I agree - season 2 was better",
                            "score": 5,
                            "author": "woodspaths"
                        },
                        {
                            "level": 2,
                            "comment": "S1 was more consistently great, S2 had the most jaw-dropping scenes. Loved em both.",
                            "score": 2,
                            "author": "wafflesareforever"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m kind of the other way. The girlfriend from season 1 is so bad. Useless character.",
                    "score": 8,
                    "author": "Capital_Empire76",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. I don't think that she was a bad actor, but I just found myself not caring about that relationship at all and kept wanting to get to the next scene. This is part of the reason why I think Season 2 is even better.",
                            "score": 3,
                            "author": "mikeyos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easily one of the best shows on Netflix.",
            "score": 118,
            "author": "LovelyJubblys",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it is the best",
                    "score": 24,
                    "author": "Jack_Attack_21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dark and Ozark",
                            "score": 11,
                            "author": "arsenalrockets",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are both worse, especially Ozark which is a (very) poor man's Breaking Bad.",
                                    "score": -5,
                                    "author": "Sidian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I completely agree with you for what it's worth. Mindhunter is absolutely brilliant imo. I watched Ozark season 1 and have stopped part way through season 2. The show had a promising start and was entertaining but that's about it. It's serious and brooding tone clashes with the fact that the characters are completely inconsistent, the situations totally unrealistic. Garbage writing compared to Mindhunter.",
                                            "score": 9,
                                            "author": "naivemelody"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Breaking Bad",
                            "score": -4,
                            "author": "SantaIsRealEh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mindhunter is the best show made by Netflix, Breaking Bad is the best show on Netflix",
                                    "score": 31,
                                    "author": "Jack_Attack_21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would personally put BoJack Horseman as Netflix’s best show, but this is undoubtedly up there.",
                                            "score": 9,
                                            "author": "SultanYasa",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Currently I'd say ozark, but I also havent seen all of bojack, but most of the full 3 seasons of ozark are master classes in television",
                                                    "score": 4,
                                                    "author": "xXcampbellXx"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, that's what I said as well. The guy said 'Easily one of the best shows **on** Netflix'. And you said that it's the best.",
                                            "score": 1,
                                            "author": "SantaIsRealEh"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed, I keep revisiting season 1 every 3 months.",
                    "score": 4,
                    "author": "cesrage"
                },
                {
                    "level": 1,
                    "comment": "Such a bummer that it seems to have been abandoned. \n\nI always feel frustrated when no one knows this show.",
                    "score": 1,
                    "author": "alexdrod"
                },
                {
                    "level": 1,
                    "comment": "It’s disturbing that no one cares about the male suicide rate being so high\nMen have no real emotional support. Yet no one cares. If a woman is upset, she almost always has support. But for men, even at their wits end, nothing most of the time. People don’t care that men are 4 times more likely to commit suicide than women. People just don’t care that men can have problems too, that they need support sometimes too. Why isn’t that ok?\n\nEdit: Just wanted to thank everyone for sharing their opinions on this thread. It’s made me see that there are a lot more people who care about this subject than I thought. I’m sorry for coming across as bitter but when I posted this I was upset and shocked after seeing the difference between successful suicides between men and women. I do not hate women, or blame women for anything, I just wanted to post this as I know there are a lot of lonely men out there right now. People have shown me that I’m not as educated on some matters as I thought I was, and I really need to get better at putting my thoughts into words so they aren’t misinterpreted. Thank you for the silver and gold whoever gave them, and thank you all again for this discussion, I hope it stays with us.",
                    "score": -76,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bad bot.",
                            "score": 38,
                            "author": "notmymiddlename"
                        },
                        {
                            "level": 2,
                            "comment": "Sir, this is a Wendy's.",
                            "score": 28,
                            "author": "Sirsilentbob423"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was an extra in episodes seven and nine of season two and I have to say working with that cast and crew was one of the absolute most enjoyable experiences of my life. I was so happy when I finally got to watch it and found it to be genuinely good television",
            "score": 78,
            "author": "beangardener",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you walk in the background or had a bit more involvement?",
                    "score": 14,
                    "author": "l_retro_I",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think I’m in about half a dozen scenes, at the mayors house, the March, and at Wayne’s house. Got to ride around in prop cars, and featured pretty prominently in a couple of scenes. There was a group of us on set for upwards of a dozen days over the course of about a month playing members of local media\n\nEdit: fun fact: there’s a black four door sedan in a few scenes, it’s the same car from the original men in black. There’s also an old van that’s the same van from stranger things!\n\nEdit again: the black sedan is the car that the two main characters drive around in for that whole second season I’m an idiot",
                            "score": 36,
                            "author": "beangardener",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds dope",
                                    "score": 8,
                                    "author": "l_retro_I"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you mean the actual same car, or just the same model?  Because it would obviously be the same model, since law enforcement all drove Crown Vics, but having it be the exact same car would be cool.",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I spent a good bit of time talking to the dudes in charge of the cars on set (the one I was in in the scene at the mayors house kept dying lol) that it was the same exact car",
                                            "score": 9,
                                            "author": "beangardener",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's so cool!  I wonder what other movies that car has been in.",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That moment in the season 1 finale when Ed kemper stood up from the bed with the chains rattling and handcuffs on him. Most intense show I've watched in a long time.",
            "score": 29,
            "author": "therebelution_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cameron Britton nailed it as Ed Kemper. His scenes were chilling.",
                    "score": 14,
                    "author": "well-cello-there"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's very interesting to see how what was generally called \"deviant\" behavior gets redefined and how the FBI starts to categorize different traits or behaviors based on the interviews and findings of this units. This is probably the closest thing to a precursor of the whole Hannibal/Silence of the Lambs FBI methods.",
            "score": 23,
            "author": "Taizan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Silence of the Lambs was directly based on the work the real life FBI agents were doing in these interviews.",
                    "score": 12,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yeah bad bingeworthy show for sure. When it first came out it took an episode for me to get into it but then i spent the next four days abandoning all responsibilities to finish the show.",
            "score": 46,
            "author": "desertratrunner",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I watched the first two episodes, thought it was very meh and stopped watching. A few months later I decided to watch the third episode and ended up binging the rest of the series in like two days.",
                    "score": 10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great show! Worth your time to watch it.",
            "score": 18,
            "author": "beaverloco15"
        },
        {
            "level": 0,
            "comment": "I FUCKING LOVE JONATHAN GROFF",
            "score": 16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fucking SAME, he's so underrated!",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I wish those animated films he was in got some attention!",
                            "score": 3,
                            "author": "MadMadHatter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brilliantly shot and executed show.",
            "score": 11,
            "author": "BassAddictJ"
        },
        {
            "level": 0,
            "comment": "Really hope someone brings this back for a season 3!",
            "score": 11,
            "author": "flux_capacitor3"
        },
        {
            "level": 0,
            "comment": "I put off watching this show for as long as possible, but binged it at night while I was on a 2-week business trip. Holy crap was it good.",
            "score": 9,
            "author": "inbloom33"
        },
        {
            "level": 0,
            "comment": "Such a good show. Great story telling. Great cast all battling their own demons while interviewing real life demons.",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yes it's excellent but BE WARNED it is now essentially on indefinite suspension because showrunner David Fincher has abandoned it for other projects. You'll love it and then POOF",
            "score": 8,
            "author": "CommentContrarian"
        },
        {
            "level": 0,
            "comment": "I thought second season was brilliant in its own right. Not so revealing in their discussions with killers but more a brilliant thriller in the style of Zodiac.",
            "score": 7,
            "author": "rawbob"
        },
        {
            "level": 0,
            "comment": "*Semi-Spoiler* The Charles Manson scene in season 2 is one of the best scenes I have seen on TV in awhile",
            "score": 12,
            "author": "Capri-Sun69",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s the same actor from once upon a time in Hollywood! I like to think they’re connected!",
                    "score": 5,
                    "author": "SniperRuufle"
                },
                {
                    "level": 1,
                    "comment": "The opening scene of season 2 is an absolute masterpiece. Haunting, disgusting, frightening, intense, vulnerable, and in the end plain clumsy.",
                    "score": 3,
                    "author": "wavetoyou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Terrific show. Loved every episode. Netflix if you’re listening we would eventually like another season when director/actors are not tied up!",
            "score": 7,
            "author": "yoloswagdon"
        },
        {
            "level": 0,
            "comment": "When will season 3 be released?",
            "score": 5,
            "author": "snakethejake718",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately it got put on hold and Netflix let the cast options expire since Fincher wanted to work on a movie instead. If there's a season 3 (big if), it probably wouldn't be until at least 2022...",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a bummer!!",
                            "score": 2,
                            "author": "snakethejake718"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great show, plus the main guy is insanely hot",
            "score": 7,
            "author": "pumpkinpie1993",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just a little weird how he talks for his reindeer.",
                    "score": 9,
                    "author": "catmanducmu"
                },
                {
                    "level": 1,
                    "comment": "Yes and I only recently realized that he is Kristoff in Frozen which explains why I thought he was such a cute character lol",
                    "score": 5,
                    "author": "tornadic_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And Jesse from Glee. Dude is talented!",
                            "score": 9,
                            "author": "HiJane72",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was also an original cast member of Hamilton!",
                                    "score": 4,
                                    "author": "b_beck614",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "King George!  (Technically he was the second King George, but he originated the role on Broadway.)  \n\nAnd Melchior Gabor!",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It should be mentioned that this is a true story too.",
            "score": 4,
            "author": "PlowUnited"
        },
        {
            "level": 0,
            "comment": "One word: Kemper!\n\nhttps://images.app.goo.gl/o25gBawtCjRidZVd6",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My company is doing an online discussion with the Cinematographer and Chief Lighting Tech from “Mindhunter”\nPlease check it out\n\nhttps://www.litegear.com/litegear-live/",
            "score": 3,
            "author": "BubbaGump4192"
        },
        {
            "level": 0,
            "comment": "Most underrated show on Netflix",
            "score": 23,
            "author": "Papupo",
            "replies": [
                {
                    "level": 1,
                    "comment": "How’s that? A ton of people watched it.",
                    "score": 1,
                    "author": "shadyhawkins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably just referring to the fact it doesn't get as much fanfare or viral hype as some of the other shows. Kimmy Schmidt is shoved down our throats but Mindhunter isn't as exposed. It really should be.",
                            "score": 1,
                            "author": "LcukyFcuk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well the last season of Kimmy is Coming up and mindhunter is done forever. That would explain it.",
                                    "score": 1,
                                    "author": "shadyhawkins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I should have clarified, I meant in general, over time. Not just this month.",
                                            "score": 2,
                                            "author": "LcukyFcuk"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great show unfortunate it’s on hiatus and the actors were released to pursue other shows, which is never a good sign for a show returning. The actors could be wrapped up I other contracts and not able to return.",
            "score": 3,
            "author": "GRpanda123"
        },
        {
            "level": 0,
            "comment": "Great show. I prefer Paul F Tompkins’ [alt theme song](https://mobile.twitter.com/pftompkins/status/923260646400991233)",
            "score": 3,
            "author": "Vic-tron"
        },
        {
            "level": 0,
            "comment": "The ending to Season 2 was such a punch to the gut, as I'm sure it was to the citizens of Atlanta at that time. I'm glad that this has given the situation a massive amount of exposure, and hopefully some of those good people can get some closure.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Highly recommend! Such a good show with a terrific cast",
            "score": 3,
            "author": "Snowstorm84"
        },
        {
            "level": 0,
            "comment": "I think this the best Netflix original by far. Every episode is captivating from start to finish. Even on my third or fourth watch through it, I’m blown away.",
            "score": 3,
            "author": "OhNo_a_DO"
        },
        {
            "level": 0,
            "comment": "This is the best series I have seen this year. Too bad they didn’t continue after the second season. I feel like there were so many more stories to tell.",
            "score": 3,
            "author": "bettaboo"
        },
        {
            "level": 0,
            "comment": "So GOOD!!! 10/10!",
            "score": 3,
            "author": "jennyndthejetsss"
        },
        {
            "level": 0,
            "comment": "I enjoyed season one but the second season just never grabbed me and I bailed halfway through. I couldn’t get lost in the show. It seemed to be trying too hard and some of the acting performances were continuously disappointing. Did I give up too soon?",
            "score": 3,
            "author": "pastacountess",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's not some huge tonal shift after you stopped watching, if you didn't enjoy the first half then you wouldn't enjoy the second either.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the best series netflix has to offer. Just brilliant in every aspect.",
            "score": 3,
            "author": "Zodiac-21"
        },
        {
            "level": 0,
            "comment": "This show is brilliant. I can still remember that last scene of Kemper on season 1. Hope they will continue this series",
            "score": 3,
            "author": "justapotato9"
        },
        {
            "level": 0,
            "comment": "It's honestly fucking fantastic.",
            "score": 3,
            "author": "Quasi-Stellar-Quasar"
        },
        {
            "level": 0,
            "comment": "My Fiance and I watched the first episode and didn't really love it. The concept is interesting for us but we kinda cringed at the main guys acting and felt like the episode had a lot of boring moments. Should we go back and stick with it? I was hoping Episode 1 would end with a cliffhanger or something to get us intrigued.",
            "score": 7,
            "author": "TripleSawCow",
            "replies": [
                {
                    "level": 1,
                    "comment": "IMO the first two episodes were hard to sit through but after that I loved it. That being said, it's not an action filled show and it's definitely not a show for everyone since the scenes can be so long and dialogue-heavy. But the director is super meticulous, the main guy might seem off but all of the acting decisions are done with intent behind them, it's supposed to be this awkward character.",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Same for me. Watched the first episode and didnt like anything about it. Honestly surprising how much people love it I wasn't shocked at all that it was cancelled.",
                    "score": 5,
                    "author": "suitedsevens"
                },
                {
                    "level": 1,
                    "comment": "I watched 6 episodes and was still bored. Very popular show though so wouldn't hurt giving it another try.",
                    "score": 5,
                    "author": "ejdawson3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched the whole thing and wasnt impressed at all, its very phony and try-hard. I much prefer the book it was based on.",
                            "score": 3,
                            "author": "XInsects"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "sorry your taste in tv shows is bad",
                    "score": -5,
                    "author": "sugarfreefixsuxshit"
                }
            ]
        },
        {
            "level": 0,
            "comment": " Found it slow and nothing likeable about the main characters, particularly Holden’s insufferably irritating girlfriend.",
            "score": 6,
            "author": "lsobe"
        },
        {
            "level": 0,
            "comment": "man i loved it, i loved the characters and its one of my favorite shows",
            "score": 2,
            "author": "Tarek-gh"
        },
        {
            "level": 0,
            "comment": "I love this series. Can’t wait for the next season.",
            "score": 2,
            "author": "cementsponge"
        },
        {
            "level": 0,
            "comment": "Very good show",
            "score": 2,
            "author": "BackwoodBand1t"
        },
        {
            "level": 0,
            "comment": "By far in my top 5 must watch shows on Netflix. You just get so sucked into the atmosphere and listen to all the nuances in the ways characters talk. Always recommend it to everyone.",
            "score": 2,
            "author": "El_Chefe222"
        },
        {
            "level": 0,
            "comment": "i wonder when is btk's season will be",
            "score": 2,
            "author": "cubinx"
        },
        {
            "level": 0,
            "comment": "Just finished both seasons and can't wait for s3 👍",
            "score": 2,
            "author": "TotFuzz"
        },
        {
            "level": 0,
            "comment": "Season 2 is not as good as season 1.",
            "score": 2,
            "author": "shadyhawkins"
        },
        {
            "level": 0,
            "comment": "Great show",
            "score": 2,
            "author": "alec_les_paul"
        },
        {
            "level": 0,
            "comment": "I gotta watch that show.",
            "score": 2,
            "author": "Enforcement94"
        },
        {
            "level": 0,
            "comment": "Book is excellent!",
            "score": 2,
            "author": "squirrelnutflippers"
        },
        {
            "level": 0,
            "comment": "So good",
            "score": 2,
            "author": "manthot899"
        },
        {
            "level": 0,
            "comment": "Such a great show. One of the best I’ve watched on Netflix. Gutted that there won’t be a season 3, at least for a while.",
            "score": 2,
            "author": "MA1998"
        },
        {
            "level": 0,
            "comment": "Next season is probably Bundy. That scene withh manson last season was really well done. Then there’s the recurring thread of BTK.\n\nAn excellent show.",
            "score": 2,
            "author": "KentuckyFriedEel"
        },
        {
            "level": 0,
            "comment": "I’m in the process of reading the book that it was based off of!",
            "score": 2,
            "author": "wildblueh"
        },
        {
            "level": 0,
            "comment": "Great show - so sad Netflix basically cancelled it. Hoping someone at Netflix comes to their senses over there and bring it back!",
            "score": 2,
            "author": "Plarsen7"
        },
        {
            "level": 0,
            "comment": "Actually enjoyed it. It can be a bit slow at times but it’s worth it.",
            "score": 2,
            "author": "LilithDArt"
        },
        {
            "level": 0,
            "comment": "man idk. I found this so damn boring",
            "score": 2,
            "author": "purplesocks-"
        },
        {
            "level": 0,
            "comment": "One of the best crime Netflix originals. Perfect sound track too",
            "score": 2,
            "author": "SameLaugh"
        },
        {
            "level": 0,
            "comment": "I'm rewatching it right now.  Can't wait till S3.",
            "score": 2,
            "author": "FolsgaardSE"
        },
        {
            "level": 0,
            "comment": "Didn't really like Bill's wife.lol",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is this post an ad or something? Like who doesn't already know how good Mindhunter is?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean I wish I could get paid for posting this lol. As critically acclaimed as Mindhunter is, it really isn't that popular a show. I'd never heard of it until a few months ago.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent show. I’m hoping it continues after all this.",
            "score": 1,
            "author": "stalinmalone68"
        },
        {
            "level": 0,
            "comment": "They're skipping a year again, netflix isn't worth it day by day",
            "score": 1,
            "author": "kingcarcas"
        },
        {
            "level": 0,
            "comment": "Season 1 was amazing, but I dropped out after a few episodes of season 2.  Got so boring.  The Manson interviews weren't nearly as compelling as I hoped they'd be.",
            "score": 1,
            "author": "Not_Lane_Kiffin"
        },
        {
            "level": 0,
            "comment": "is it true show actually got cancelled?",
            "score": 1,
            "author": "Leeblinder"
        },
        {
            "level": 0,
            "comment": "Blue Balls: The Movie. Just no catharsis in this at all.",
            "score": 1,
            "author": "Banestoothbrush"
        },
        {
            "level": 0,
            "comment": "I actually found this very overrated.  Definitely had its moments but overall, meh.",
            "score": 1,
            "author": "bellsofwar3"
        },
        {
            "level": 0,
            "comment": "taste like True Detective love it",
            "score": 1,
            "author": "bothersomeraven"
        },
        {
            "level": 0,
            "comment": "Season 1 was amazing. Season 2 wasn’t",
            "score": 2,
            "author": "smushkreeg"
        },
        {
            "level": 0,
            "comment": "some of the weirdest acting i've seen, unwatchable",
            "score": 1,
            "author": "crojun",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the same way. The acting was so distracting.",
                    "score": 3,
                    "author": "pastacountess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "reindeers really are better than people.",
            "score": 1,
            "author": "ineslime"
        }
    ]
}