{
    "id": "10aaplj",
    "score": 4,
    "title": "L3Harris Commons will become a medical school",
    "author": "blendedmix",
    "date": 1673557577.0,
    "url": "https://www.reddit.com/r/floridatech/comments/10aaplj",
    "media_urls": [
        "https://finance.yahoo.com/news/burrell-college-osteopathic-medicine-florida-153000934.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I don't like that FIT agreed to this. Burrell College is for-profit medical school. It's unranked by US News. Many people are going to incorrectly assume the medical school is owned or run by FIT.\nThe arrangement seems purely motivated by money. I see no other benefits for FIT besides money.\n\nThe medical school gets a prime location on the corner of Babcock in a new building. FIT has limited space and giving it up to an outside college seems unwise. I hope the money FIT is getting from Burrell is enough for land acquisition and new building construction because FIT is losing both.\n\nThe guaranteed admission to Burrell College for FIT students is nothing to brag about. If any FIT students want to go to medical school, they should be aiming higher than Burrell.\n\nIf FIT wants to get into medicine, FIT's goal should to be establish a medical school of its own one day. However, I'm sure there is writing in the contract that prevents FIT from starting programs that might compete with Burrell.\n\nUpdate: It looks like Burrell will only occupy two of the three floors in Commons. Although, I wonder if they have the option to occupy the whole building in the future.",
            "score": 7,
            "author": "blendedmix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree on all points. It also feels wrong to me that they're saying any FIT pre-med who takes the right courses and has a good GPA would get guaranteed acceptance to Burrell for medical school. That should be a red flag to any pre-med because good medical schools tend to have a sub-10% acceptance rate and be insanely competitive. If this school is willing to just take whoever happened to go to FIT and did reasonably well, they probably suck. Especially when you consider how small of a med school they're planning to put there.",
                    "score": 3,
                    "author": "OverlyStressedPanda"
                },
                {
                    "level": 1,
                    "comment": "I agree with what you're saying but I wanted to point out that tons of medical school are withdrawing from rankings. Everyday a handful or more schools pull themselves out of rankings so it's going to be very inaccurate very fast. I'm a UCF student but my better half attends FIT, I am considering transferring to FIT in fall 2023 in order to take advantage of the guaranteed admissions to Burrell college for their premed students. I am waiting to hear more info about the program and it's requirements as it stands right now. But a local medical school with guaranteed admission seems too good to pass up.",
                    "score": 1,
                    "author": "MayDayJayJay1"
                }
            ]
        }
    ]
}