{
    "id": "118oi2b",
    "score": 3,
    "title": "Committing",
    "author": "megalithaio",
    "date": 1677039004.0,
    "url": "https://www.reddit.com/r/floridatech/comments/118oi2b",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m going to be majoring in aerospace engineering and after touring today I’m thinking that the school seems good and is definitely a top choice.\n\nI am waiting on one more school for admission, UF, all my others are either too expensive or a deferral or a rejection. What are the advantages and disadvantages that FIT has over UF and other state schools that I wouldn’t hear at like a traditional tour or from admissions?",
    "comments": [
        {
            "level": 0,
            "comment": "Advantages: You won't get lost in the crowd. Smaller school means more opportunities for fewer participants (i.e. research/work with professors). All my friends that went Aero are now rockstars at all the companies they work at. I can't think of a single engineering student that graduated that isn't in their field from my four years there. Can't say the same for the other degree programs however (i.e. humanities).\n\nDisadvantages: The goal of college first and foremost is to get the degree so you can get the job. Not to say you can't have fun while doing it,  but that shiny piece of paper is the end all be all. Student retention has always been tough for Florida Tech and a number they don't like to advertise. The transition from Freshman fall to spring you'll see a significant drop in enrollment but not nearly as dramatic as Freshman to Sophomore year.  Some of it is related to how expensive the school is but a significant amount also has to do with not taking your studies seriously your first year. You need to make your own luck, network, know when and where to apply to internships. Historically speaking Career Services did the bare minimum and often their advice wasn't in line with what hiring managers had to say. That being said, having Florida Tech attached to your resume does have significant weight when applying for jobs and internships in engineering and engineering adjacent positions. \n\n&amp;#x200B;\n\nTL;dr  \nAdvantages: Smaller School = More Opportunities  \nDisadvantages: Cost, Career Services and Retention",
            "score": 1,
            "author": "CartridgeKing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, will probably commit this Friday after UFlorida decision just in case the cost to go there is significantly less. I am relatively confident in my academics, so as long as I focus on my classes I think I will be ok.",
                    "score": 2,
                    "author": "megalithaio"
                },
                {
                    "level": 1,
                    "comment": "Engineering majors have a high transfer and drop out rate. However, FIT's retention rate is not *that* bad. FIT retained 82% of first year students in 2021. For comparison at some other private schools nearby, the retention rate at Embry is 80%, Stetson is 72%, and Florida Southern is 79%.\n\nThe retention rate is higher at state schools because they're usually cheaper, and they also invest a lot into student entertainment. UCF famously has a lazy river.",
                    "score": 2,
                    "author": "blendedmix"
                }
            ]
        }
    ]
}