{
    "id": "m0gx19",
    "score": 5,
    "title": "Admitted but have a question.",
    "author": "Weekly_Walk_729",
    "date": 1615214036.0,
    "url": "https://www.reddit.com/r/floridatech/comments/m0gx19",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was wondering why Florida tech has such a low graduation rate. It seems like a good schools so what’s going on.",
    "comments": [
        {
            "level": 0,
            "comment": "Graduated in 09, started in 04. I was very active on campus, and the #1 reason I saw people leave was tuition costs. I had friends with no scholarships graduate with a quarter of a million dollars of debt, but a majority of folks that had their scholarships change would go to a different school instead. \n\nFIT changed my scholarships after my first semester, and I almost went somewhere else as well. If you are relying on your aid and scholarships, they change semester-by-semester, and sometimes it seemed like it was at the whim of whoever was processing my paperwork. I had to fight tooth-and-nail to keep some of the scholarships/aid that I was getting and without it I could've never afforded it, even with the ridiculous amount of debt I ended up with.",
            "score": 7,
            "author": "ApachePrime",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s seems so unfair considering if you got accepted to multiple schools. However once you finalized you want to go to FIT you just lost all you other acceptances so them changing how much your aid is and almost forcing you out of school sets you back at square one. Are colleges allowed to just change how much aid or expected tuition? Also I feel like any school related specifically to STEM is very very costly.",
                    "score": 2,
                    "author": "Weekly_Walk_729",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will say, my first semester was spent about 50% on a closed campus thanks to back-to-back-to-back Category 4+ hurricanes keeping the county in emergency mode. Quite a few students struggled with grades during these crises, and that is one of the big reasons for scholarships/aid changing. \n\nThat said, I don't think this is a unique practice in the higher education world. A lot of schools will roll back scholarships/aid to cover smaller amounts once they've got you attending. It 100% is shady, and should not be done... but that's what happens when education becomes a megamoney business.",
                            "score": 2,
                            "author": "ApachePrime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess it just depends how good of a student you are since if ur smart you would donate a higher amount so like investing almost",
                                    "score": 1,
                                    "author": "Weekly_Walk_729",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"If it weren’t for my horse, I wouldn’t have spent that year in college.\"\n\nI can't figure out what you're saying here.",
                                            "score": 1,
                                            "author": "ApachePrime",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Huh ?",
                                                    "score": 1,
                                                    "author": "Weekly_Walk_729",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. Your previous response makes no sense.",
                                                            "score": 1,
                                                            "author": "ApachePrime",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What I’m trying to say is some scholarships are based off of performance so if you consistently get good grades I think they would really take away your scholarship since once you graduate your more likely to donate more to the institution if they treated you well.",
                                                                    "score": 1,
                                                                    "author": "Weekly_Walk_729",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No matter how you do, the instant you become an Alumni, the Alumni Association will be contacting you relentlessly to donate. It's what they do.",
                                                                            "score": 2,
                                                                            "author": "ApachePrime",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That’s brutal",
                                                                                    "score": 1,
                                                                                    "author": "Weekly_Walk_729"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wrote a post about this a while back, gonna just copy and paste it here. Went to FIT for my freshman year (until i got sent home in march because of COVID) but I transferred this past summer &amp; am currently a sophomore at another school.\n\nI was an Astrobio major, and hated almost every single one of my professors, IMO they showed clear favoritism among students and didn’t really help as far as in terms of struggling students. Some are diamonds in the rough like Professor Knoll in Math, but tbh most of them were the reason why I fell out of love with Physics. I had almost no relationship with any of my professors and I am an extremely outgoing social guy, I’m friends with nearly everyone I meet... not at Florida Tech though.\n\nCampus is in a really bad area though so I never liked leaving campus especially without a car (which I didn’t own one). So being trapped in my dorm all day was awful.\n\nIf you’re looking for literally ANY type of social scene I would not recommend FIT at all.... even precovid it was unbearably hard to even find 1 person to hang out with and do things with regularly, campus is very dull and lonely. I would spend most weekends alone watching movies or forcing myself to hang out with people I didn’t like just so I wasn’t alone.\n\nThe only time I ever experienced homophobia in my life was on Florida Tech campus. I got singled out for being gay nearly weekly, and it almost always was in a negative way. (I wasn’t even that open about being gay at the time and I NEVER talked about it, people were literally just obsessed with me because I was like the 1 gay male freshman). Got told by multiple people I should leave the school because I’m gay, One time I got a 15 on a Calc 2 Quiz and someone said it was because I was “gay and bad at math”, Got told by my randomized roommate that gay people shouldn’t be allowed to adopt kids or get married, had multiple people tell me that I was against their religion, had someone tell me that gay people deserve to be discriminated against and that if its against your religion they should discriminate against gay people, had people tell me I only got into the school for diversity purposes (when literally no where on my application did I ever indicate or say I was gay), had a dick spray painted on my door, had people tell me I’m only funny because “all gay people are funny”, one time at a party a guy threatened to kill me &amp; I had to file MANY discrimination reports with the help of my RA. Women are often in the minority and discrimination against, but most of the girls down there are “guys girls” so they usually just take it. Another one of my randomized roommates actually raped a girl I was friends with while drunk and got kicked out so if that doesn’t tell you what you need to know IDK what will. Rapes go unreported by the school and there was protests my year against the Deans outside their office for covering like 18(?) rapes in a year (# could be wrong). Just imagine some loser conservative kid from your high school that gave off school shooter vibes and had anger issues &amp; all the pick-me girls, yea well at FIT they are the “popular” people and think theyre hot shit when they’re all basically terrible people. There are some diamonds in the rough though, but its really hard to come across genuinely nice people. Most of the RAs were amazing people so I spent most of my time with them as a freshman. But theres not a lot of American POC at the school (theres a lot of international students though), almost nobody from the LGBTQ+ community (especially not gay men). It’s VERY stereotypically STEM school, going into it I was optimistic and didn’t think it would be a lot of “stereotypical STEM kids” but boy was I wrong, it was worse than anything I could ever imagine. &amp; even the “regular” people were probably some of the most immature people I have ever met. It got to the point where I quite literally had nobody I ever wanted to hang out with, so I would just never go to the dining hall or go out to eat, which eventually was the reason for me developing an ED (anorexia) that I’m still struggling with to this day.\n\nOverall it was a terrible experience for me, even when I went back to finally get my things a few weeks ago I had an anxiety attack just being on campus (and I don’t have anxiety and almost never have anxiety attacks), I have PTSD from my time there and it made me fall out of love with science and my dream of being an astronaut. I definitely was not strong enough to handle that school for even 1 semester, everybody is different though, I especially thrive in social environments.\n\nBut sometimes its the right fit, my twin brother actually goes to FIT too (we aren’t close so we didn’t really spend time together) and he loves it. But for me it was probably the worst 7 months of my life, and had I not gotten sent home because of COVID I 100% without a doubt would have dropped out and lost my money just to leave that campus.\n\nI’m not trying to put a bad name on the school because it is a good school, but I know a lot of people who feel the same way (actually like the 5 people I was actually friends with all transferred or are transferring this next semester for the similar reason of the campus being so lonely and the people being awful to be around).",
            "score": 5,
            "author": "DuaLipas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm really sorry you had such a horrible experience. \n\nI'm an openly bisexual woman, did astrophysics and graduated in 2020, had a very solid group of friends, and had a blast (aside from covid).   \n\nI would say our department went through a lot of unfortunate changes when I was graduating, so I don't really know what's happening now. I generally don't like the direction the administration is moving (\\*cough\\* Mccay) and have even more things to say about the *\\*lovely\\** SGA, so I see how shit could have been whack in the past couple years.",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Holy shit. That is not what campus culture was like while I was at FIT... at least as far as the homophobia and hatred. I'm glad you got out. \n\nThe Campus Activities Board was fairly active in the LGBTQ+ community, and had a lot of support from the Office of Student Activities when I was on-campus. It's a real shame to hear things have changed. \n\nDate rape has always been a problem at FIT, and until it stops being something that's hidden and swept under the rug, it won't change. The culture of Greek life being put on a pedestal made the rapists bulletproof while I was there, and gave them an avenue to continue their reprehensible behavior. Everyone was aware of it, and Freshmen women were warned at orientation not to drink at specific frat parties. I wish I had said and done more about it while I had a big voice on campus, but there's so much protection for the worst kinds of people just to save face for the university's image. \n\nIf you'd like to make your voice heard, there are a few previous Crimson staffers that moved on to Florida Today that might be able to amplify your story. I don't know if anything would come of it, so it may not be worth it, but...",
                    "score": 2,
                    "author": "ApachePrime"
                },
                {
                    "level": 1,
                    "comment": "Yeah honestly I hope college wouldn’t be like those stupid drug scenes or illegal actions in movies. A lot of this I think could been solved by the administration or the student government had they paid more attention to the students. I’m starting to feel like the STEM schools on average have more toxic people. People who want they affirm their position in the social hierarchy. You had a hell or a time there but I’m glad you got out of the situation. Definitely I think I have to go to an urban community so I would fit better among thousands of other students and better chance to meet people who understand me. Thank you for sharing your time there and I hope for the best. 🤗",
                    "score": 1,
                    "author": "Weekly_Walk_729"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got here in 2013, and on the year I was supposed to graduate (2017), I was publicly outed and harassed by former roommates on FitForum (the school's mailing list) - and FIT did little to nothing aside from deleting the email and a slap on their wrist. Got me in a depression that took 3 years to recover from. Wouldn't have made it if it wasn't for my closest friends and the support of individuals at FIT. Now I'm back to finish my last year. I doubt it's even a dent in the statistics, but there were many deeply-rooted flaws at FIT that have only surfaced recently - notably with the Clery Act, etc. I'm sure everyone has a story about why they left FIT, aside from the tremendous costs. But don't let this discourage you: it's still a very good school. (Especially for Engineering!)",
            "score": 3,
            "author": "EveAeternam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope you are doing much better and thank you for sharing your response I’ll take it into consideration for when I decide whether or not I should attend. 🙏",
                    "score": 2,
                    "author": "Weekly_Walk_729",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am, thanks :) aside from those issues - it's a pretty good school. The people you'll meet there and the professors will be people you will remember for a lifetime. If you can put in the effort, the professors will make sure you walk out with one of the best degrees out there. (At least for engineering, I can't speak for the other colleges.) What are you planning on studying?",
                            "score": 2,
                            "author": "EveAeternam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m looking into computer science/engineering but I do want to study aerospace engineer more so not on rockets but drones.",
                                    "score": 1,
                                    "author": "Weekly_Walk_729",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've heard good things about CS, my best friend graduated in it. As far as Engineering goes, a few years ago they split the Mechanical and Aerospace Engineering departments, and in doing so split Aerospace Engineering into two different degrees: one with an Aerospace focus, the other with an Aeronautical focus. You might be interested in the latter then. There's also an Unmanned Aerial Systems (UAS) minor that you could look into. If you're not too far, I definitely encourage visiting the campus and checking out your options (as well as seeing what campus looks like IRL).",
                                            "score": 2,
                                            "author": "EveAeternam",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh wow I did not know that! I’ll do some more research on the department. It’s always nice to get information from someone actually there. There’s only so much I can really find online so thanks so much. I would visit but I’m up in NY.",
                                                    "score": 1,
                                                    "author": "Weekly_Walk_729",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "TBH the website is a *mess*. But definitely get in touch with the department. I can refer you to some people who would gladly tell you more about FIT and the Engineering (and CS) degrees and options if you want.",
                                                            "score": 2,
                                                            "author": "EveAeternam",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ll have to pass for now I’m still studying for a lot of test and looking into scholarships to fund my educations. But thank you I might take up on your offer latter through the month.",
                                                                    "score": 1,
                                                                    "author": "Weekly_Walk_729",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sounds good. Good luck with everything!",
                                                                            "score": 1,
                                                                            "author": "EveAeternam"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FIT's most recent graduation rate is 59%. If you look at other similar tech schools, they're about the same...\n\n* Rochester Institute of Technology - 67%\n* Illinois Institute of Technology - 70%\n* Michigan Technological University - 70%\n* New Jersey Institute of Technology - 67%\n* New Mexico Institute of Mining and Technology - 50%\n* New York Institute of Technology - 53%\n\nBy similar, I mean they're not super highly ranked, super famous, and super rich like MIT, Caltech, and Georgia Tech. MIT, Caltech, and Georgia Tech all have over 90% graduation rates.",
            "score": 3,
            "author": "blendedmix"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know this is an older thread, but wanted to still try asking:\n\nI'm looking at going to FIT fall of 2022, planning to study Biomedical Science. Can you give the names of some of the good professors? I'm interested in FIT partially because of the small class sizes gives a better opportunity to be close with professors, but I'm worried about that now from what I've read about some professors.",
                    "score": 3,
                    "author": "thegemguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! I'm interested in infectious disease / epidemiology / microbiology. I'm leaning more towards the research side of things, but may look into the medical side. I think it'd be cool to be an infectious disease doctor, but I'm not sure I have what it takes for medical school. \n\nSome other things I've been looking at are testing water/food for harmful microbes/disease, analyzing samples to diagnose and treat diseases, working as a medical lab technician.. Would like to work for a place like the CDC or something similar.\n\nI'm not sure I want a just a general biology degree, and Biomedical Science is the only other one I'd be interested in at FIT. I'm also looking at UNF, where I would choose between public health or biomedical science. I looked into USF which has microbiology, but probably wont go there since I'd be living off campus and the area around the school isn't very safe.",
                                    "score": 3,
                                    "author": "thegemguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have looked at UCF, but it's such a massive school (website says almost 72,000 students!) that I most likely won't be going. I'm thinking it'll be hard to stand out and get opportunities like research or job offers with so many people. NSU only has a BS in general Biology.\n\nFIT does have a new health sciences research building in construction right now, due to finish in December this year. The website says it'll be a large expansion of the biomedical sciences and biomedical engineering programs, so maybe the school is starting to upgrade and care more about their bio programs. \n\nWith UNF, I've heard the professors are either really great or really terrible, but I like that it's so close to Mayo clinic and they actually have a Mayo clinic internship course. I've looked at University of Miami and will probably also apply there, but have heard it can still be pretty expensive after financial aid. \n\nIt sucks that just a few bad professors can ruin a person's experience at a school. It seems like there's at least one big issue with each school I'm looking at lmao. I appreciate the information though, thanks for the list of the good professors. I'm just now going into my senior year of hs in August, so I still have a little while to research and make decisions.",
                                                    "score": 3,
                                                    "author": "thegemguy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's really helpful, thanks! I've been debating about FIT since their biomedical science courses aren't exactly what I'm looking for, while other colleges I've looked at have immunology, virology, infectious disease, parasitology, etc. courses, but was still willing to go if the opportunities were good enough. I'll definitely keep this in mind when making my decision, thanks",
                                                                    "score": 1,
                                                                    "author": "thegemguy"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}