{
    "id": "ysbdhf",
    "score": 1,
    "title": "GRE Scores",
    "author": "mabuelola",
    "date": 1668175334.0,
    "url": "https://www.reddit.com/r/floridatech/comments/ysbdhf",
    "media_urls": [],
    "other_urls": [],
    "postText": "What are the accepted GRE scores for prospective PhD student.",
    "comments": [
        {
            "level": 0,
            "comment": "This school is a shit show, go somewhere else",
            "score": 4,
            "author": "swerc1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "heyyy……. *sort of true* but… hey watch it",
                    "score": 1,
                    "author": "GuidanceDangerous332",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Sort of true” …..it’s true and you know it. \n\nGranted I will say I think my particular department is worse than others from people in other programs I’ve spoken with, but this university as a whole has loads of issues that I’ve found to be unique to my experience here when compared to undergrad/ colleagues in grad programs elsewhere. \n\nThis university is also not responding well to the fact that the state system (Eastern Florida) just up the road is beginning to syphon professors and offer similar degrees at 1/8 the cost. I truly to not believe this university will exist within a decade.\n\nGraduate students are conned into interesting research opportunities that never existed in the first place, and the undergrad programs are for rich kids too stupid to go to a legit tech school. (I had to explain what mean median and mode were to my lab section…..).\n\nNot to mention depending on your industry, many employers in the area are actively told not hire from Florida Tech until we get at least 2 years of work experience because we are “perpetually unprepared for the work force”.\n\nThere are some decent reasons to come here though: if you have family in the area, want to live near a beach, or are certain that the advisor you will have is doing actually good research (there are some).",
                            "score": 0,
                            "author": "swerc1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I *dont* know it. My program wasn’t flawless but I was provided with great opportunities and a strong foundation for graduate school. In my field, my program is considered a good school. The university has a lot of issues which is why I can partially agree, but I’m not going to sit here and say it’s terrible. At least it wasn’t ten years ago. I don’t regret going, not even in the slightest.",
                                    "score": 1,
                                    "author": "GuidanceDangerous332",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "10 years ago? Okay so you have no idea what’s happening there right now.",
                                            "score": 1,
                                            "author": "swerc1234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am happy you are nostalgic and proud of your undergrad alma mater but as a current graduate student, your decade old opinion is outdated,irrelevant and invalid to the current state of the university.",
                                                    "score": 0,
                                                    "author": "swerc1234"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The EFSC program is for aircraft maintenance, not engineering. Florida Poly in Lakeland is more of a threat to FIT than EFSC.\n\nI went to a different school for my bachelor's and FIT for my master's, I see similar posts on my other schools Reddit. The grad students feel like they're being taken advantage of. They think the professors steal their work and they get no credit. They think they're underpaid.\n\nThe students also complain about the tuition even though it's a state university and state schools in Florida have some of the cheapest tuition rates in the country. People are never happy.\n\nWhat I learned is, wherever you go, get your degree and get out fast. The experience at the school doesn't matter after your graduate. The piece of paper is all that matters. No one is going to know what occurred exactly in your program.\n\nAlso, now that I've been in the workplace for some years and worked at a couple different companies, it seems to me there's not much difference between most colleges. I worked with many  people from much lower ranked schools than FIT and my undergrad university. Unless you go to an Ivy League, the name of the university on your degree doesn't matter much. \n\nI do agree there seems to be higher than average number of entitled students at FIT. I suspect many come from families that think private education is better than public. The families may not be super rich, but they're well enough off to have had private education for much of their life.",
                                    "score": 1,
                                    "author": "blendedmix"
                                },
                                {
                                    "level": 3,
                                    "comment": "Where did you hear that places don't want to hire Florida Tech grads? Most of my CS and aerospace engineering friends are working at SpaceX, Lockheed, or Harris, and one of my best friends actually got recruited to the Office of Naval Intelligence as an aerospace engineer fresh out of undergrad. My husband is MechE BS and immediately got hired in his field, and I both got hired as a medical researcher at Penn Med (I have a bio MS) and more recently was accepted to and started an engineering grad program at UPenn. Many of my professors at Florida Tech were far better than my current ones at UPenn. We were definitely more prepared for our jobs than many of our coworkers, but like at all schools, you have to choose how much effort you put in during your time at college. (FWIW, my husband and I graduated in 2018 and my friends I'm talking about graduated between 2018 and 2020.)",
                                    "score": 1,
                                    "author": "OverlyStressedPanda"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What PhD program are you applying to? The GRE minimum is are usually listed on the program page.",
            "score": 1,
            "author": "blendedmix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aerospace Engineering",
                    "score": 1,
                    "author": "mabuelola",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I remember correctly, they used to list the [GRE requirements on this page](https://catalog.fit.edu/preview_program.php?catoid=14&amp;poid=5453). Now it looks like they only list the minimum 3.2 GPA requirement. I would assume this means there is no GRE minimum to apply. Although, I don't think that means your guaranteed admission with any GRE score.",
                            "score": 1,
                            "author": "blendedmix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you very much appreciated 🙏",
                                    "score": 1,
                                    "author": "mabuelola"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}