{
    "id": "10rxr5a",
    "score": 14,
    "title": "EECS funding question",
    "author": "m12_",
    "date": 1675364478.0,
    "url": "https://www.reddit.com/r/mit/comments/10rxr5a",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I am a newly admitted PhD EECS applicant. One of my main concerns about grad school is potential issues with funding in situations where one has to move groups (e.g. if you're advisor ends up changing institutions or it's not a good fit). For those of you in the department, have you experienced any issues with funding or is funding essentially guaranteed as long as you are in good standing with degree/research progress?",
    "comments": [
        {
            "level": 0,
            "comment": "As someone who attempted to switch labs, there are processes in place to attempt to make it easier but its definitely not as straightforward as suggested, especially if you're on the EE side of things.  Yes there is transitional funding but when I tried to switch labs the funding was only guaranteed for a semester and even then I felt like nobody was willing to help me transition. I came to MIT to do physical experimental work so that required finding a lab that had the correct fit. The EE profs don't tend to overlap their work so finding a correct fit is pretty tough. I understand that many people have been helped by Leslie but my experience with her was pretty negative. I asked for help finding open positions in other labs and actually connect with professors but she refused to get involved. When I finally found someone in MechE that overlapped with my interests my current advisor wanted to meet 1 on 1 with the other professor to discuss the transition which put me in a weird position. Leslie had no recommendations. Other resources didn't really help or get involved. My academic advisor told me I should seriously consider leaving the program since things weren't working out. I ended up just not switching and riding it out. I had a friend who did end up switching and was on transitional funding for almost a year and a half and her graduation is super delayed. If you're CS, then sure its stupid easy - I've heard crazy stories of people switching 5+ times.  If you're EE the barriers to doing so might just kill your degree.",
            "score": 15,
            "author": "greengiant1298",
            "replies": [
                {
                    "level": 1,
                    "comment": "are you sure it's easy in CS? Why is it so easy in CS?",
                    "score": 1,
                    "author": "faithforever5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not in CS so it's hard to compare but my impression is that since the fundamentals of coding are universal and the professors are usually well funded and more co located to Stata, it usually means that students can jump in to new research quickly and and have somewhat of a pre existing relationship with the new professor already. In EE as a comparison, if I wanted to move from optoelectronics (what I graduated in) to robotics or bioelectronics I would need to spend a year or more learning about fundamental concepts in those two fields. So professors are less willing to take on people if they don't have previous experience.",
                            "score": 1,
                            "author": "greengiant1298"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She had a class in the fall where professors pitch openings in their labs to first years and I asked specifically for that list to help narrow. You forget that like 90% if not more of cold emails to professors go unanswered.",
                            "score": 1,
                            "author": "greengiant1298"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s essentially guaranteed. The EECS department is one of the best at taking those kind student-wants-to-switch-advisors concerns seriously because:\n1) Leslie is great (as is Asu and the dept leadership, tho special shout-out to Leslie)\n2) money, though not infinite, is less tricky to come by for the EECS dept compared to other depts\n3) there are lots of advisors, which means both that the dept is used to handling people who want to switch (for whatever reason) and also there are likely more landing spots (eg dozens of ML profs)\n\nA couple years ago, MIT announced guaranteed transitional funding for students in unhealthy advising situations. EECS was already doing that by then (ie they were ahead of the curve, and the rest of the institute was playing catch-up)\n\nI’ve never gone through the process but I imagine it would amount to having to TA for a semester while you find a new advisor. The dept surely will want you to find a new home sooner rather than later, but esp if it’s your first time switching, I can’t imagine them leaving you hanging",
            "score": 11,
            "author": "FuschiaKnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Thanks so much for the detailed answer! Hearing this definitely makes me feel better about it.",
                    "score": 3,
                    "author": "m12_"
                }
            ]
        }
    ]
}