{
    "id": "11lwliq",
    "score": 10,
    "title": "Dorms for summer",
    "author": "NightlessBaron",
    "date": 1678282587.0,
    "url": "https://www.reddit.com/r/mit/comments/11lwliq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nI am a non-MITian graduate student who’s coming to Boston for an internship during summer. I heard that MIT has a dorm transfer program for summer and was hoping if someone can help me answer the following queries:\n\n1. Are the dorms availed for non-MITians?\n2. When to apply and how much is the cost per month?\n3. When does the application process begin?\n4. What facilities are available in the dorm unit (are they furnished)?\n\nThank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "MIT dorms aren't open to non-students unless you're part of a specific program that's hosted there, which it sounds like you're not. \n\nI think you may have heard about the FSILG summer housing and mistaken that for dorms. FSILGs are frats, sororities, and independent living groups that have student-run houses. Most rent out their rooms over the summer and accept non-MIT boarders. There is no centralized system so you have to contact houses individually to apply. Prices will vary a lot from house to house (and my price quotes are several years out of date anyway). Facilities vary too but I'm pretty sure they all provide a bed and a desk at minimum.",
            "score": 13,
            "author": "purplepineapple21",
            "replies": [
                {
                    "level": 1,
                    "comment": "++ Would definitely look into FSILGs",
                    "score": 3,
                    "author": "bmmoore2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there any place / site where I can check out the listings?",
                            "score": 1,
                            "author": "NightlessBaron",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm guessing that most of the FSILGs have info posted on their individual websites but there's no centralized place for them. A specific one I can point you to is et.mit.edu",
                                    "score": 4,
                                    "author": "bmmoore2021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay. Thanks a lot !",
                                            "score": 1,
                                            "author": "NightlessBaron",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Beta Theta Pi has summer housing available! [Click here](http://beta.mit.edu/summer-housing) for the link to the house info and application!",
                                                    "score": 2,
                                                    "author": "MoGb1"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Number six (delta psi) also has summer housing!",
                                    "score": 1,
                                    "author": "hiijustgothere"
                                },
                                {
                                    "level": 3,
                                    "comment": "for fraternity chapters, you can look at [the interfraternity council](http://www.mitifc.com/) (several fraternities are co-ed)\n\nfor sorority chapters, you can look at [the panhellenic association](https://www.mitpanhel.com) (to my knowledge, no sororities are co-ed)\n\nfor student-run independent living groups, you can look at [the living group council](http://lgc.mit.edu) (every ilg other than wilg is co-ed)\n\nthese should collectively list every fsilg, but you’ll have to use them to go to individual fsilg websites for details about summer housing. there’s no collection of every summer housing option all in one place as far as i know, so this is probably the closest you’ll get.",
                                    "score": 1,
                                    "author": "MegaAutist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much for such a detailed answer. The above link are super helpful.",
                                            "score": 1,
                                            "author": "NightlessBaron"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for sharing this!",
                    "score": 2,
                    "author": "NightlessBaron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Specifically you can try reaching out to Kappa Sigma. They are a FSILG, but they are on campus unlike most others, so it is about as close to being in on campus housing as you can get. Email them at [ks-ec@mit.edu](mailto:ks-ec@mit.edu) for specifics.",
                            "score": 3,
                            "author": "TightYogurtcloset871",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, will check it out!",
                                    "score": 1,
                                    "author": "NightlessBaron"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}