{
    "id": "11mocz8",
    "score": 31,
    "title": "Getting rejected after being accepted",
    "author": "Aware-Thing-3159",
    "date": 1678355975.0,
    "url": "https://www.reddit.com/r/mit/comments/11mocz8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nThis is a weird post. I was accepted to MIT for a PhD in 2020, and I was clinically depressed at the time and, deferred my decision. TLDR; I had a toxic adviser, and I didn't feel excited about being accepted (red flag?). Basically being broke at 27, projected forward another 5 or so years would mean a very long time worrying about finances. I did a lot of self-beating, could not motivate the value of doing the PhD for myself.\n\nWhile going through all of this, I found a job as a data scientist (in Europe) have been working myself up to a more senior position. Then I started longing for more, developed a different perspective of things.\n\nI contacted a few profs last year, asked if they were taking any students. I received replies from all of them, and I started thinking perhaps this is a sign for me to re-apply? And so I did.\n\nTurns out, I got rejected. A generic rejection email. No interviews, nothing. Thought I had a more flavorful CV this time, combined industry and research experience. \n\nWhat am I supposed to do? Feeling completely devastated. Having a hard time moving on. I am honestly in denial. 30 yo guy.",
    "comments": [
        {
            "level": 0,
            "comment": "Apply somewhere else. Don’t put all your eggs in one basket",
            "score": 43,
            "author": "nightrider1708",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.  MIT is very good, but so are a lot of other schools.",
                    "score": 19,
                    "author": "notyouravgredditor"
                },
                {
                    "level": 1,
                    "comment": "I did. Should have added that as context.",
                    "score": 9,
                    "author": "Aware-Thing-3159"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an older graduate student who came in with industry experience, let me give you a couple thoughts...\n\n1. I make a LOT less money than when I was in industry. When I graduate, I'm looking at starting salaries comparable with what I was already making. Financially, the PhD is probably a bad move in your position. It might open up different kinds of jobs, but the pay does not increase (and the lost years of moving of the industry pay scale really hurt).\n\n2. Don't feel bad about the rejection. Admissions is hyper competitive, and the panels are looking for literally any excuse to cut down the number of applications. That means a lot of rejections are completely arbitrary. The fact that you got in once is more than enough validation of your capabilities. \n\n3. Being a student during Covid was objectively awful. You probably dodged a bullet there - it would not have been good for your mental health. If I were you I would not regret the decision to defer and not accept.\n\n4. Don't delay your life until you're 35. Use your industry experience to pivot into new jobs if you want to do something different and learn new, practical skills. You'll feel a lot better for it and you absolutely have the capacity to crush it wherever you are.",
            "score": 34,
            "author": "ConVoltairian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing. It's really helpful to hear from your experience, as an older student. I tied a lot of my self-worth into my admit, and it's been kind of like having a chip on my shoulder throughout, the FOMO effect is strong.\n\nI haven't settled down or \"lived\" in the sense that I am stressing about my career and the what ifs of the potential trajectories. Of course you would never know, but getting into MIT feels like a huge deal to me in hindsight, and I don't want to regret that I missed out on this opportunity. It's not a fun existence, you know, and just feels like a big waste of time to go around and constantly think about it.\n\nHappy to follow-up on DMs. Curious to hear more from you.",
                    "score": 3,
                    "author": "Aware-Thing-3159"
                }
            ]
        },
        {
            "level": 0,
            "comment": "PhD admissions in general have so many factors outside your control. You may well have been a more promising candidate than in 2020, but the economy in 2023 is not what it was in 2020 -- lots of grant funding has been pulled, corporate research dollars have dried up quite a bit -- and your potential new advisors may have had their funding dry up unexpectedly, after you emailed them.\n\nGiven that you were already admitted once, you don't need to concern yourself with whether you meet that bar. It's pretty clearly not about you.",
            "score": 14,
            "author": "zamfi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll second this. There’s so many things that go into phd admissions, including whether a specific faculty member — w similar research aspirations — is interested and available to work with you. This can change over time, eg if a faculty goes on leave, becomes chair or takes on new administrative roles. There are a million other possible explanations that have little to do with your aptitude. Don’t take it personally",
                    "score": 12,
                    "author": "goosehawk25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I will try to be kinder.",
                            "score": 5,
                            "author": "Aware-Thing-3159"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you. I am grateful to hear well reasoned perspectives when I'm personally not in the best state of mind. I have not been able to think clearly.\n\nIt's definitely not easy to stop being so hard on oneself, I know things are out of my control right now. It just sucked to see the decision.",
                    "score": 6,
                    "author": "Aware-Thing-3159",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It always sucks to get rejections. That said, if you're not getting at least 50% rejections, you're definitely not being ambitious enough. :)\n\nThe road to success is littered with rejections.",
                            "score": 2,
                            "author": "zamfi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I accepted my PhD offer from mit when I was a mess of a person. I was nowhere in the right spot mentally for mit phd at that time, but I went for it. I had horrible unsupportive advisor as well and I ended up dropping out after 5 years in. I would rather spend these years in industry to be honest. I would gain so much more value than being miserable and suffering while also being poor. MIT is great, but it’s a very challenging place. It’s also pretty cut throat as you compete with best and most intellectually fierce people. You MUST be in the right mindset to do it. Even those in the right mindset initially often go bonkers at MIT, forget about those who enter as a mess already. So, honestly, you did the right choice. There are tons of other places to consider",
            "score": 9,
            "author": "chicky2018",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am so sorry to hear that. That really sucks. Unsupportive advisors are the worst. I hope you can be kind enough to yourself after that experience.\n\nI hope you are in a better place now, my thoughts and support are with you stranger! Thank you for sharing, it definitely gives me perspective.",
                    "score": 2,
                    "author": "Aware-Thing-3159",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, MIT is only good if you can survive it. Acceptance to PhD does not mean you are guaranteed to get it. Nope, it’s very far from that! I entered it when my most beloved person died and I just lost myself for few years. And those years were pretty foundational. \n\nAfter I dropped out I joined industry as a junior/entry level person. If I instead went to industry I would already be a good senior with a good pile of savings. Now I am broke, older, burned out, and starting from step 1 in pretty horrific shitty economy with mass layoffs around. \n\nYou will be in amazing spot with industry experience + PhD from another good institution, rather then failed at MIT and/or burned out to bones. MIT label gives only very marginal difference compared to other decent Phd institutions, but successful PhD, more supportive down to earth faculty people, better mental health AND past industry experience pushes you far far ahead of many MIT grads. \n\nAlso, many MIT people are very arrogant, including faculty. Especially faculty. There are some nice people here and there, but there is definitely a huge dense concentration of arrogant people who think they are better than the rest of the world. So if you struggle you may not find any support or understanding, unfortunately. \n\nI wish I did what you have done back ago.",
                            "score": 1,
                            "author": "chicky2018",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for this comment. I am still figuring out what to do, the indecisiveness I'm having right now is certainly anxiety inducing. \n\nI'm really sorry to hear about your loss. Hope you are in a better place now.\n\nFunny thing you mentioned the last point - Most people that used to respond to me and encourage me has turned into ghosting me pretty much.",
                                    "score": 1,
                                    "author": "Aware-Thing-3159"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Many, many, many people are unhappy in grad school - often miserable, but even the happiest folks are stressed out at best. It's a rough, mostly unstructured, highly competitive environment where you will ask yourself many times if what you are working on is worthwhile, regardless of the project, regardless of how excited you were. A PhD program is a very hard thing to put yourself through, and I think it sounds like you made the right decision in 2020.",
                            "score": 1,
                            "author": "papervegetables",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. Helps to be reaffirmed of it.\n\nI definitely experienced the lack of structure and competitiveness. Ican definitely see the problem with that. \n\nThough I still feel like I have a chip on my shoulder about this..",
                                    "score": 1,
                                    "author": "Aware-Thing-3159"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apply to another university.",
            "score": 3,
            "author": "professorbix",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok professor.",
                    "score": 1,
                    "author": "Aware-Thing-3159"
                }
            ]
        }
    ]
}