{
    "id": "121x1u8",
    "score": 9,
    "title": "Applying for Aid After Admission",
    "author": "vvisxn",
    "date": 1679773876.0,
    "url": "https://www.reddit.com/r/mit/comments/121x1u8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was recently accepted into the class of ‘27 and submitted my application without requesting for aid. My parents told me not to apply because they initially thought we wouldn’t be eligible to receive anything but now they want me to apply regardless because of tuition costs. My question is will this affect my admissions decision? Can I just submit my FAFSA now or would I have to get in contact with the Financial Services first?",
    "comments": [
        {
            "level": 0,
            "comment": "Admission to MIT is need blind (i.e. the need for financial aid does not affect the admission decision). \n\nSource: https://sfs.mit.edu/undergraduate-students/the-cost-of-attendance/making-mit-affordable/",
            "score": 13,
            "author": "jamito02"
        },
        {
            "level": 0,
            "comment": "Your admissions decision wouldn’t be affected but I wouldn’t expect any financial aid. Definitely get into contact with SFS- it never hurts to talk with them. But there were defined deadlines by which FAFSA and CSS forms were supposed to be submitted if you wanted to be considered for any aid. I would expect they’ll just tell you that the deadline for aid passed by, but again it never hurts to try, it might work out! Good luck :)",
            "score": 11,
            "author": "hotpotdot",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a financial aid call last week and they said you could still apply for aid even though deadlines had passed.",
                    "score": 14,
                    "author": "Electrical-Law862",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then definitely go for it! They won’t take back your decision, you’re definitely safe",
                            "score": 4,
                            "author": "hotpotdot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok thank you so much!! I’m gonna submit it asap 🙏",
                                    "score": 2,
                                    "author": "vvisxn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The admissions office and financial aid office are two completely different offices that do not talk to each other, even while you're a current student.\n\nSo apply for aid! MIT will give you more than you think.",
            "score": 1,
            "author": "A-Square"
        }
    ]
}