{
    "id": "12ho2ma",
    "score": 7,
    "title": "looking for course 12 undergrads",
    "author": "birbadot",
    "date": 1681144441.0,
    "url": "https://www.reddit.com/r/mit/comments/12ho2ma",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello! i’m a prospective student interested in EAPS/course 12 , and would love to speak to an undergrad (or grad student! since undergrads are few and far between) about their experience, specifically in atmospheric sciences (interested in air pollution research)\n\nfor context, i’m also considering harvard for EAPS or environmental policy. id also love to minor in latin american studies at either, but that’s not a huge factor in my decision.\n\nthanks for any replies! :}",
    "comments": [
        {
            "level": 0,
            "comment": "Not a course 12, but it sounds like you need to figure out what kind of school you want to go to. Aside from \"prestige\" and location, MIT and Harvard are almost opposites (small tech school vs large liberal arts school).",
            "score": 11,
            "author": "jackd188",
            "replies": [
                {
                    "level": 1,
                    "comment": "the thing is , i see the appeal on both sides .. first, i’m trying to figure out if the departments are equally strong/good for undergrad and if so i’ll choose based on what kind of college experience i’d prefer",
                    "score": 2,
                    "author": "birbadot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's completely valid. Like someone else commented, contacting the EAPS dept might be easier since we don't have a ton of course 12. Good luck with your decision!",
                            "score": 1,
                            "author": "jackd188"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait MIT and Harvard have almost identically sized undergrad classes, don’t they?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Roughly 4.5k vs 7 or 8k. Harvard has a much larger grad program however. Had to check the stats on that one, and they were closer than I thought, but not identical. It's undeniable though that students have very different experiences at both schools, and they offer very different programs",
                            "score": 1,
                            "author": "jackd188"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's less than 10 course 12 undergrads who graduate in any given year. So at most there's 40 at MIT, so the chance of you hearing from one of them on reddit is low.\n\nI'd reach out directly to the [EAPS department](https://eapsweb.mit.edu/about/contact) for answers to your questions.",
            "score": 6,
            "author": "A-Square",
            "replies": [
                {
                    "level": 1,
                    "comment": "And yet… Reddit fails to disappoint, cause it looks like at least 2 responded back in the thread lol",
                    "score": 1,
                    "author": "grr5000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hi! i'm a course 12 (planetary) + took one eps class at harvard for my reqs. i can't answer anything specifically about the atmospheric track but feel free to pm if you have general questions",
            "score": 2,
            "author": "grannysmithapple2"
        },
        {
            "level": 0,
            "comment": "Hello! I am a freshman undergrad at MIT who is not course 12 (planning on 2), but I may try to get a minor in Course 12 or even do 2A-12 possibly.\n\nCourse 12 is a pretty small department compared to 6 or 2, which can be deemed good if you don't like competing over opportunities. All the course 12s I personally know are double majoring in some other subject, and I heard plans for making 12 majors and minors more obtainable, so if you want a lot of flexibility, which it sounds like you would like, course 12 at MIT could be the way to go. I don't know much about Harvard's EAPS department.\n\nSince 12 is a relatively small department here, UROPs are very easy to get. I am going to do an EAPS-adjacent UROP over the summer, but my friend is doing a full-on 12 UROP, and they're considering double majoring in it too.\n\nA cool thing about course 12 is that there are many classes that you can take over IAP in 12, many of which include experiences in Western US. They are often in geophysics and geology, which is not what you are mainly interested in, but there are still plenty of other classes and opportunities in course 12 over IAP.\n\nOh and also, you will be required to do a thesis in course 12 as an undergrad, which is something you may or may not want to do. Either way, I don't see anything wrong in choosing Harvard or MIT. You can just cross register and take a quick trip on the T to either school if you like.\n\nI hope this helps your decision in any way!",
            "score": 1,
            "author": "chocolatewool"
        },
        {
            "level": 0,
            "comment": "Hey! I’m a recent course 12 undergrad (graduated a couple years ago) and I’d be happy to answer any questions if you want to send me a message! I did the geoscience track though, so not sure how much help I’ll be with atmospheric stuff but I can try my best",
            "score": 1,
            "author": "lithium28"
        },
        {
            "level": 0,
            "comment": "Hi! I graduated undergrad a few years ago from course 12 with the atmospheric chemistry track and now work in air pollution. Feel free to DM",
            "score": 1,
            "author": "GoblinPrincessYuki"
        }
    ]
}