{
    "id": "12ja1s0",
    "score": 69,
    "title": "not cut out for mit",
    "author": "Sad_Sundae4945",
    "date": 1681274095.0,
    "url": "https://www.reddit.com/r/mit/comments/12ja1s0",
    "media_urls": [],
    "other_urls": [],
    "postText": "is it normal to feel like i’m completely failing. I’m a first year and i feel so behind everyone else here in every class. i can’t find the motivation to do work and the things that come so easily to everyone else i struggle with.\n\ni guess my question is is it normal to get Cs and Ds and is it bad to use an NR freshman spring?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, normal. And something a lot of people at MIT haven’t encountered before, which makes it feel weirder than it is.\n\nBut also, consider talking to an advisor or a counselor. Lack of motivation and feeling like you’re failing might mean that you need some extra support. Don’t hesitate to ask for it!",
            "score": 59,
            "author": "catdaddyinabarrell"
        },
        {
            "level": 0,
            "comment": "I struggled my first year here. Ended up NR 6.0001. Got through it and am on track to graduate",
            "score": 23,
            "author": "Zealousideal-Mud9703"
        },
        {
            "level": 0,
            "comment": "I received C’s and D’s all the way up till senior year where I somehow managed to scrape enough grades together for a 3.7 GPA (out of 5). \n\nTo help with classes always go to office hours cuz most the basic classes have TAs who will give you the answers to HW there. \n\nTo help with the mental aspect I recommend you go to S3 now. Going early and often can allow them to give you whatever resources you may need. More than once they would give me a week or more extension on HW when I was to busy. \n\n- A course 2, 2021 graduate",
            "score": 24,
            "author": "Kaipmaier"
        },
        {
            "level": 0,
            "comment": "You definitely have what it takes to graduate from MIT; you just haven't figured out how to study yet. Make sure you experiment with different studying techniques, and I'm sure you'll find a way that works best for you. It took me until my junior year to find a study method that worked for me",
            "score": 15,
            "author": "eptehal99",
            "replies": [
                {
                    "level": 1,
                    "comment": "What study method worked for you?",
                    "score": 7,
                    "author": "raccoonster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have found that the Anki technique works quite well. After each lecture, I review the material at my own pace and answer questions that I generate during class while listening to the lecturer. These questions serve as a guide. Next, I answer the questions and summarize important concepts, ideally in my own words, on flashcards (anki). Finally, I review and practice with these flashcards frequently (ideally once everyday).\n\nAlthough this method is time-consuming, it is a price I am willing to pay. \n\nThere are also many videos on YouTube with ppl sharing their studying techniques. It’s always insightful to see what worked for other ppl. I wish you best of luck!",
                            "score": 2,
                            "author": "eptehal99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for sharing!",
                                    "score": 2,
                                    "author": "raccoonster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Progress through MIT is y = ax + b, and x is &gt;1400 days. \n\nYour final y-value doesn't dependent on your b, it depends on your a.",
            "score": 14,
            "author": "IHTFPhD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow perfect explanation",
                    "score": 3,
                    "author": "RoosterBubbly924"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an old guy, I was at MIT in the 90s... Back then all of freshman year was pass/NR (A-C = P, D-F = NR).  Not sure how it works now.  \n\n\nI barely made it through freshman year, I came from a small town and had no calculus in high school and eeked out Cs in 18.01, 18.02, 8.01, 8.02, 3.091.  (I got a 27/100 on a 3.091 exam I was unprepared for, the professor kindly let me retake it, and I still only got a 67 or something).  \n\n\nBottom line, I made it through.  I was course 6-3 and once I got into classes in my major (and learned how to study) I got mostly As and Bs and the occasional C for the rest of my time there and graduated in 4 years with a 4.1/5.0 GPA.  On the down side, I always felt dumber than everyone else - that's OK.  It's partly \"imposter syndrome\" which still bothers me, and partly that you're surrounded by the smartest people in the WORLD.    \n\n\nYou can do it too.  Use the resources you have, don't be afraid to fail, don't hide from your advisors, and get through it one class at a time.  And it will get better after freshman year if you keep working!",
            "score": 11,
            "author": "ihcady",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that it's A-C then no record. I believe that it was changed shortly before I enrolled due to med school complaints.",
                    "score": 4,
                    "author": "zakarum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Long ago, I came to MIT as a grad student from a cow college in TX. I thought I was going to flunk out by Thanksgiving. Then I learned that all my classmates were struggling, too.",
            "score": 7,
            "author": "Amazing-Artichoke330"
        },
        {
            "level": 0,
            "comment": "It sounds to me like you are burnt out. I highly recommend reaching out to the folks at MIT Mental Health. It's confidential and they will provide you with several options for how to proceed.",
            "score": 5,
            "author": "zakarum"
        },
        {
            "level": 0,
            "comment": "Hi friend,\nYou may also be a little depressed. You are not alone! Are you doing things the make you happy?",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I worked at MIT for years and saw a lot of new students struggle. You’re used to being in the top of your high school class… And a lot of folks didn’t have to work super hard to get there. You’re now amongst the brightest minds in the entire planet. The pool just got WAY deeper. I also worked at Harvard and Northeastern and I can tell you that the curriculum and MIT is incredibly academically rigorous. Your intro to physics class is basically two Harvard classes mashed together.\n\nThis shit is hard. \n\nI’d say the best thing you can do is readjust your expectations a little bit to be kinder to yourself. And also… Find something fun to do! Cambridge and Boston are awesome cities with tons of fun weirdos and hobbies. I’ve seen cool stuff happening at maker spaces, folks learning stand-up comedy, ballroom dancing lessons, sailing, light saber practice on the quad. \n\nYou have to find some thing to let off some steam. Finding that thing will help you out quite a bit.",
            "score": 3,
            "author": "deepbluebroadcaster"
        },
        {
            "level": 0,
            "comment": "100000% normal\n\n  \n\n\n\"Everyone else\" is not accurate. There are definitely people struggling alongside you. A few savants don't represent everyone in class. If you graduate with Cs and D's i guarantee no one will ever ask. They just MIT on the resume. In the mean time, go find some slackers are lower your bar.",
            "score": 2,
            "author": "aleatorictelevision"
        },
        {
            "level": 0,
            "comment": "Also something to consider: drop date hasn’t passed yet. It’s okay to take less as you adjust to MIT, good even so you can find the joy in college and try things. You will be able to adjust your course load to graduate in four years pretty much no matter what you take freshman year.",
            "score": 2,
            "author": "Ok-Cod7922"
        },
        {
            "level": 0,
            "comment": "Everyone struggles. It's a part of it. And it's all right.",
            "score": 1,
            "author": "WildlifePhysics"
        },
        {
            "level": 0,
            "comment": "No, it's not normal to get Cs and Ds.",
            "score": -8,
            "author": "the_brightest_prize"
        }
    ]
}