{
    "id": "1308fzh",
    "score": 7,
    "title": "70 Amherst and Graduate Tower at Site 4",
    "author": "sara34987",
    "date": 1682565885.0,
    "url": "https://www.reddit.com/r/mit/comments/1308fzh",
    "media_urls": [],
    "other_urls": [],
    "postText": "My partner and I will be moving into Cambridge this upcoming Fall for his PhD. We’re looking to do graduate housing specifically at the two housing options listed in the title. While we might be able to afford living off-campus, it is far more affordable to go with graduate housing especially since we want to live close to campus on the first year. Given we qualify for family housing, what insight could you provide about the two housing options for a one bedroom unit?\n\nWe want to bring in our own furniture (which I know might not be possible with the Graduate Tower) so Amherst seems like a good option, but the pictures online of what the units look like are a little demoralizing. It might seem silly, but neither of us want to live in an apartment with Lime Green walls we won’t be able to change. Is there a way to avoid the green walls?\n\nWe plan on bringing our cat (she’s an ESA with up to date paperwork). Will this hinder our housing options in any way?\n\nThanks and I apologize if these questions have already been answered. I looked through this subreddit but didn’t really find any answers more recent than 3 years old. Feel free to give any advice even if it seems off topic.",
    "comments": [
        {
            "level": 0,
            "comment": "I recall normally the only pet allowed in the graduate housing is fish.",
            "score": 2,
            "author": "littlecrabvt",
            "replies": [
                {
                    "level": 1,
                    "comment": "ESA is different I think",
                    "score": 2,
                    "author": "xAmorphous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I've just checked, \"If you have an Emotional Support Animal (ESA), they must be registered through DAS before arriving to campus\"\n\nLink to DAS: https://studentlife.mit.edu/das",
                            "score": 2,
                            "author": "littlecrabvt"
                        }
                    ]
                }
            ]
        }
    ]
}