{
    "id": "135bu5q",
    "score": 3,
    "title": "Advanced Study Program into Graduate Program?",
    "author": "CHOCOLAAAAAAAAAAAATE",
    "date": 1683003952.0,
    "url": "https://www.reddit.com/r/mit/comments/135bu5q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI've got my sights set on a few schools for a PhD and found that MIT has an Advanced Study Program.  Per the website, some students have even gone on to pursue graduate studies after attending via ASP!  \n\nI'm looking for any insight on this program.",
    "comments": [
        {
            "level": 0,
            "comment": "It ain’t cheap, I’ll tell you that",
            "score": 5,
            "author": "Klutzy-Soil-2168",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I saw the tuition &gt;.&lt;\nIt’s going to hurt for sure",
                    "score": 2,
                    "author": "CHOCOLAAAAAAAAAAAATE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im interested in this too. I just started working at MIT as technical staff and they’d cover one class per semester for me if I applied. Looking into it for next spring because May 1 was the deadline for fall.",
            "score": 2,
            "author": "ace-murdock"
        },
        {
            "level": 0,
            "comment": "Personally I don't think this is a good way to get into a future MIT program.  \n\nDepending on your field and timing, you might want to consider completing an MITx MicroMasters instead, which are completed online:\n\n[https://micromasters.mit.edu/](https://micromasters.mit.edu/)\n\nE.g., completion of the Statistics &amp; Data Science MicroMasters gives you a pathway *to apply* to the MIT IDSS PhD -- assuming you do very well in the program and meet all other requirements for admissions. \n\nThey're a great way to participate in MIT-level graduate studies at a fraction of the cost.   Or just a way to learn + challenge yourself.\n\nNote: these courses are \"the real deal\" so expect to have to work very hard in order to get good grades in them. \n\nAnd and usual, admissions to MIT will be highly competitive even after completing a MicroMasters.  But doing well in them can help showcase your abilities to the admissions committee.",
            "score": 2,
            "author": "p33k4y",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, the MicroMasters program doesn't offer the degree I'm trying to get into; Earth and Planetary Sciences.  :/",
                    "score": 1,
                    "author": "CHOCOLAAAAAAAAAAAATE"
                }
            ]
        }
    ]
}