{
    "id": "13edrkd",
    "score": 5,
    "title": "Which courses will probably come out on OCW this year?",
    "author": "HopeIsGold",
    "date": 1683782050.0,
    "url": "https://www.reddit.com/r/mit/comments/13edrkd",
    "media_urls": [],
    "other_urls": [],
    "postText": "MIT OpenCourseWare has been tremendously helpful for self-learners like us who had no idea that certain topics existed. OCW made us aware of that and has been of great help to our education. Specially 18.01, 18.02, 18.03, 18.06. I learnt that mathematics can be so beautifully taught from these courses. \n\nI am always looking for things to learn. Any topic, any department as long as it tickles my curiosity bug. \n\nWhat courses are currently being recorded for OCW that are yet to come out? I have asked OCW previously but they don't reply. So I am asking here in the hope that people who sat through those classes can share the info with us. \n\n&amp;#x200B;\n\nPlease don't delete this post.",
    "comments": [
        {
            "level": 0,
            "comment": "This is Gil Strang’s last semester teaching linear and they’re recording the lectures to be uploaded to OCW rn",
            "score": 20,
            "author": "dizzywinds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is he retiring? \n\nOCW put up a final lecture notification on Youtube: https://www.youtube.com/watch?v=lUUte2o2Sn8&amp;ab\\_channel=MITOpenCourseWare",
                    "score": 1,
                    "author": "LifeCanBeGoody",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah i believe so. he said that he will have a few speeches lined up during lecture. if you want you can stop by 26-100 at 11 am to see it in person",
                            "score": 1,
                            "author": "dizzywinds"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They don't announce these things so you'd just have to hope someone in a class that's being recorded for OCW sees this post.",
            "score": 8,
            "author": "max123246",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's also a big (and unpredictable) time gap between filming and when a course comes out. I was in a class that got filmed once and I dont think it was published for months or maybe even a year later. They have to edit, write accurate captions, prepare complementary materials, etc before the course is ready to go online.",
                    "score": 2,
                    "author": "purplepineapple21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, that's for sure. Editing takes time. But it is still helpful to add something upcoming to the list if anyone is interested.",
                            "score": 1,
                            "author": "LifeCanBeGoody"
                        }
                    ]
                }
            ]
        }
    ]
}