{
    "id": "13t064l",
    "score": 0,
    "title": "How fierce is the competition at MIT?",
    "author": "Usual_Opposite_5022",
    "date": 1685169498.0,
    "url": "https://www.reddit.com/r/mit/comments/13t064l",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a high schooler who’s interested in applying, I’d like to ask how fierce the competition there is (for resources and opportunities) and whether this affects people’s mental health",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly the fiercest competition tends to be within yourself.",
            "score": 61,
            "author": "xAmorphous"
        },
        {
            "level": 0,
            "comment": "In my experience, I never once felt I was competing against others in any sense throughout all of my undergrad. Not in any classes, nor in any of the activities I chose to pursue. \n\nOf course for some things you'll naturally be in some kind of opposition against someone else or many others (e.g. running for a position in your dorm council or auditioning for an a capella group), or trying to obtain some kind of limited position (e.g. a lab who can only take a certain number of UROPs), but IMO MIT is largely collaborative and not competitive unless you purposefully seek things that are competitive in nature. As far as all the classes I took are concerned, I definitely believe you can go through your four years without feeling pressure of competition against your peers.",
            "score": 22,
            "author": "Paragawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your response! May I ask what the competition is like for involvement in research and for positions in grad school?",
                    "score": 3,
                    "author": "Usual_Opposite_5022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't speak to that personally, but as far as undergrad research goes my impression was that you definitely will be able to get a UROP (undergrad research position) if you want one, but it may be hard to get a specific one if the lab you're hoping to join has limited openings due to funding (not necessarily because you're competing against other people). \n\nI can't really speak for grad school, most of my friends either did an M. Eng. in course 6 which you kinda just need good enough grades to get accepted, or went to grad school elsewhere and I'm not really clear on their experience",
                            "score": 1,
                            "author": "Paragawn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zero. Complete opposite of someplace like Cornell. MIT is hard enough everyone’s just trying to win their own battles, and the culture strongly supports getting help and paying that forward.",
            "score": 17,
            "author": "bts"
        },
        {
            "level": 0,
            "comment": "current freshman -&gt; sophomore here. i thought there would be a lot of competitions but as the second semester came around i realized i was just competing against my own expectations. now im competing with my friends, except it’s on who gets the worst grade lmao",
            "score": 9,
            "author": "dizzywinds"
        },
        {
            "level": 0,
            "comment": "The lack of competition was one of the main reasons I chose to go to MIT over places like Harvard and Stanford. The cooperation between students was the only way I survived through my psets. The hardest concepts were explained to me not by professors but by my peers.",
            "score": 5,
            "author": "kykyelric"
        }
    ]
}