{
    "id": "14041pw",
    "score": 0,
    "title": "Do students here read books apart from assigned readings in coursework?",
    "author": "HopeIsGold",
    "date": 1685861129.0,
    "url": "https://www.reddit.com/r/mit/comments/14041pw",
    "media_urls": [],
    "other_urls": [],
    "postText": "What books apart from your coursework reading have you found interesting and actually useful? \n\nI am not necessarily talking about reading books not aligned with your major. Though that is definitely an option. \n\nDo you read fiction? or non-fiction? \n\nOr books on a subject you are taking that are not on the recommended reading list?\n\nWhich books did you really like?",
    "comments": [
        {
            "level": 0,
            "comment": "Science Fiction!! It helps that we have the largest open-shelf collection of science fiction in the world.",
            "score": 9,
            "author": "firbolgrogue"
        },
        {
            "level": 0,
            "comment": "only nerds do\n\nSo yes.\n\nThere's a humanities library (Hayden), a music library (Lewis), and an engineering library (Barker). I think there are 2 more libraries but I never went to them!\n\nI'm the type of nerd to read textbooks for fun, so there were many books, papers, and booklets I got from Barker, but there were a few novels that my friends were reading so I checked them out of Hayden when I had the time (freshman + sophomore year).\n\nMy personal favorite books are Glass Castle (Walls), I Will Save You (de la pena) and  Flatland: A Romance of Many Dimensions, but I read those in high school. \n\nAt MIT... I don't really remember what I read. That probably speaks to how quickly I read through books and didn't internalize them since I had psets to do, damnit!",
            "score": 5,
            "author": "A-Square"
        },
        {
            "level": 0,
            "comment": "Sanderson novels :)",
            "score": 6,
            "author": "joshdoeschem"
        },
        {
            "level": 0,
            "comment": "Sidebar: I don’t read physical books as often anymore. They kinda feel like stone tablets, especially carrying/moving them around. E-readers are a lot more versatile IMHO, but I get why some prefer physical copies.",
            "score": 2,
            "author": "ZookeepergameJumpy15"
        },
        {
            "level": 0,
            "comment": "I liked Dawkins' \"extended phenotype\"\nBanks' \"modern quantum field theory\"\nMilnor's \"topology from a differential viewpoint\"\nKahneman's \"Thinking Fast and Slow\"\nand a few others \n\nThese are all relatively short, inspiration-dense books in STEM but not in computer science \nthat shaped how in think (e.g prodded me to think thoughts I'd not have thunk otherwise) in computer science.\n\nWithin CS but probably not part of typical class reading, I got a lot out of Dijkstra's \"Discipline of Programming\" and  Chris O's \"functional data structures\".  Tarjan's \"networks ...\" book should also be on this list except it it probably part of some class readings.  \n\n\nBooks with ambitiously broad topics by \"outdated\" but brilliant thinkers are good fuel for our imaginations, even today: wiener on brownian motion and \"cybernetics\", hamming on engineering process, minsky on emergent cognition, marr on vision as inference, cajal on research habits for young researchers, shannon on communication rates, schwinger on greens functions, chomsky on grammar as fundamental, etc",
            "score": 2,
            "author": "samtenka"
        }
    ]
}