{
    "id": "1433k45",
    "score": 0,
    "title": "Am I on the right path?",
    "author": "DistributionLow3996",
    "date": 1686113117.0,
    "url": "https://www.reddit.com/r/mit/comments/1433k45",
    "media_urls": [],
    "other_urls": [],
    "postText": "How are these stats for MIT\n\nFor context I am indian with lower end income.\n\nI go to a traditional highschool going into sophomore year. I also take college classes :). So basically my dream is to get into MIT and I know my chances are probably slim with the stats I’ll show you but maybe if anyone could give me advice on anything to do better?\n\n\nCourses-\n\nCompleted/Completing-\n\nMath 1, 2, 3 all honors\nEnglish 1, 2 all honors \nAmerican History, World History, Civic Literacy all honors\nEarth science honors\n\nThose are the competes Highschool courses\n\nHere are the college\n\nART-111 Art Appreciation\nMUS-110 Music Appreciation\nCIS-111 Pc Literacy\nCSC-151 Programming JAVA\nMAT-171 Precalculus Algebra\nMAT-152 Statistical Methods\nBIO-111 General Biology 1\n\nI took all these in freshman year/this summer\n\nHere are my classes for sophomore \n\nFall semester 2023-\nHighschool-\nEnglish 3 honors \n\nCollege- \nBIO-112 General Biology 2\nPHY-151 College Physics 1\nMAT-172 Precalculus Trigonometry\nMAT-263 Brief Calculus\nACA-122 College Transfer Success\n\nWinter semester 2023-\n\nCollege-\n\nENG-111 Writing and Inquiry\nSpring semester 2024-\n\nHighschool-\nEnglish 4 honors\nEconomics and Personal Finance honors\n\nCollege-\nPHY-152 College Physics 2\nMAT-271 Calculus 1\nENG-112 Writing/Research\nCHM-151 General Chemistry 1\nCHM-152 General Chemistry 2\n\nSo that’s everything i’m going to take sophomore year and then I plan on applying to the North Carolina School of Science and Mathematics and if I hopefully get in then I will take courses there to further my application to college.\n\nExtracurriculars-\nNot much is offered at my school but I participate in the only clubs offered\n\nQuiz Bowl \nScience Olympiad\n\n\nI also volunteer at the local library twice a week\n\nAlong with this I attended a summer program last summer through the North Carolina School of Science and Mathematics focusing on STEM\n\nI will be attending the second session of that program this summer\n\nI was also accepted to a program through AEOP at North Carolina A&amp;T that I will be partaking in this summer.\n\nI have also attended a robotics lecture held by a group from Duke university on their campus and a Computer Science Seminar at UNC Chapel Hill\n\nI took the act earlier this year and made a 26 I know this is very bad but I will be retaking it multiple times throughout sophomore year in order to increase this. \n\nIf you’ve taken the time to read through all of this to try and help me thank you so much!\n\nAny and all critique and suggestions are appreciated thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Wrong sub m8 \n\nr/mitadmissions or r/chanceme",
            "score": 22,
            "author": "catiyin"
        },
        {
            "level": 0,
            "comment": "&gt;Not much is offered at my school but I participate in the only clubs offered\n\n\nThis was like my daughter's school. But part of the reason she got into MIT is because she was able to show them that she went outside her school and proactively found other things based on her interests. \n\nFor example her school did not have Olympiad teams, so she found out that the Olympiad allowed neighboring schools to try out for other schools teams. And she did that. \n\nShe also did other things. Basically she showed them that she was dead serious and being involved in things that were within her specific interest area.\n\nSo MIT was happy to see that she made an effort to go above and beyond in her interest area.",
            "score": 2,
            "author": "LunarCycleKat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see and that would be really nice but geographically I live in rural north carolina where there is no schools like that, that offer olympiad teams etc",
                    "score": 1,
                    "author": "DistributionLow3996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you can start a club based on an interest you have",
                            "score": 1,
                            "author": "bufallll"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re definitely not, to find out why u need to read the sub rules",
            "score": 2,
            "author": "nightrider1708"
        }
    ]
}