{
    "id": "145811e",
    "score": 9,
    "title": "First-year Advising Options",
    "author": "sensindr",
    "date": 1686323915.0,
    "url": "https://www.reddit.com/r/mit/comments/145811e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone. The deadline for the first-year advising form is coming up fast, and I’m still unclear about how to rank my preferences. I recently attended a Zoom information session and asked a few people, but my confusion remains. So I’m wondering if you could illuminate me on what each of the options (traditional, seminar, learning communities, and course-numbered things like 20.A06: Hands-on Making in Biological Engineering) entails.",
    "comments": [
        {
            "level": 0,
            "comment": "Traditional: hands off, you get as much as you put in, and you may get a great advisor but likely you'll get someone who, again, will just mirror the effort you put in.\n\nSeminar: this isn't necessarily mutually exclusive from other options, and each seminar is either going to be a complete waste of time or the defining experience for your entire professional life. Take that gamble how you will.\n\nLearning Communities: each one is very different, but in general you'll be a part of a close group of &lt;100 freshman. Think of it like a second set of dorm friends you can interact with.",
            "score": 13,
            "author": "A-Square",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 1,
                    "author": "sensindr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was an associate advisor for seminar based advising (which should be the same as the \"course based advising\"). \n\nSeminars meet weekly during the fall semester, I believe for two hours each. Seminars are on all sorts of things, from academic to silly. My seminar had light assignments each week (read a chapter of a book and write a one page reflection), but I was sure to bring snacks to every meeting. \n\nSeminar advising was a great choice for me and that's why I became an associate advisor for the same seminar. As opposed to only seeing your advisor when you register for classes or have a problem, you see your advisor every week. You also meet other freshmen since you're in this seminar together, so that's nice to do. \n\nI had an awesome freshman advisor who stayed my advisor for the rest of the time at MIT. I was in his office constantly for advice or just to chat. He was the first to realize I had a concussion, he and his wife came to visit me in the hospital years after I graduated when I broke my leg in Boston, and so much more - he really was a father figure to me. All because I picked his advising seminar.",
            "score": 7,
            "author": "Aerokicks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, that’s awesome. I’m glad you had a great experience with seminar advising. I’ll consider it for myself.",
                    "score": 1,
                    "author": "sensindr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was a part of and TA/associate advised for Terrascope, one of the learning communities. I think everyone else has commented good stuff about trad/seminar advising, so I’ll just talk about learning communities. The four learning communities are all really different so I personally kind of find it hard to speak about it as a umbrella group, but the idea is that you’ll be matched with an AA and a faculty advisor within the community. Terrascope does it through advising groups that have one on one meetings and group ebents (optional usually fun stuff) with students within the community. Overall the idea is that it’s a secondary community (usually with extra benefits like an alumni network, lounge, and access to maker spaces for Designplus I think). The available learning communities are:\n\n- Terrascope: Sustainability and environmentalism focused learning community. Consists of one mandatory fall class centered around building research, communication, and leadership skills while working on a big problem in sustainability. Also has some cool spring classes like a radio production class and a design class!\n\n- Designplus: Design focused learning community. I don’t know that much about how it is structured but I wish it had been offered in my year, it’s very cool and you get access to some cool maker space stuff like laser cutters and a photography studio (among other studio stuff, that’s just the stuff I’ve borrowed)\n\n- ESG: A learning community focused around taking GIRs in a smaller class (think like ~30 compared to ~300) with more connection to your professors and peers. I think the fact that it’s gir based instead of interest based causes it to be a little less tight knit but my friends have enjoyed it regardless\n\n- Concourse: unfortunately I do not know much about them but they have a Greek classics (?) class that is mandatory. That’s pretty much all I know\n\nIf you would like to know more about any of these (or Terrascope especially) feel free to dm me and I can either tell u myself or put u in contact w a current student who is in the community!",
            "score": 3,
            "author": "matsuriyu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the detailed explanation!! It’s very helpful. I’ll certainly reach out to you if I have additional questions!",
                    "score": 2,
                    "author": "sensindr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I will say, literally everybody I knew that took seminar-based advising ended up regretting it. I must have heard \"I can't, I have to go to my seminar\" 100 times.\n\nIf you find a learning community you like, then go for it, otherwise just do traditional.\n\nYou'll have LOTS of opportunities to get advice about anything. Don't add an extra time commitment for no reason.",
            "score": 4,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "Noted. Thank you!!",
                    "score": 1,
                    "author": "sensindr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Traditional: you'll probably only interact like twice a year when they approve your classes. Somewhat unclear what the purpose of an advisor is in this case\n\nSeminar: no idea\n\nLearning communities: I think more like required meetings and stuff? Not really sure. Seems to work for some people, but most people I've talked to weren't fans. Not offensive enough that you shouldn't give it a go if you think you're interested, but not for everyone. \n\nCourse numbered things: comes with a fairly fun class. Kind of cool. Hands on making I've heard good things about. \n\nUltimately, don't worry too much about it. It's not going to make much of a difference. In my experience, most people get class advice from their peers and advisors end up being neutral to a mild obstacle at worst.",
            "score": 0,
            "author": "Firedraakon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Perfect. Thank you very much!",
                    "score": 1,
                    "author": "sensindr"
                }
            ]
        }
    ]
}