{
    "id": "148lkkk",
    "score": 0,
    "title": "MIT courseware",
    "author": "Ceki101",
    "date": 1686679427.0,
    "url": "https://www.reddit.com/r/mit/comments/148lkkk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I saw a lot of course by MIT provided which are free. Since MIT wants to give access to there lectures, assignments, problem set, etc. I was wondering if it helps getting some extra points based on some finished of them if you want to apply for MIT undergraduate/graduate program? Also does it have to be with certificate from somewhere like Edx or it can be just from MIT courseware?\n\n&amp;#x200B;\n\nThanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t think so. It will help you be more informed/increase your knowledge, but will not be evaluated by admissions.",
            "score": 10,
            "author": "Trick_Beginning3659",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some of the edX courses, i.e., those which are part of the rigorous [MITx MicroMasters series](https://micromasters.mit.edu/), are directly used / evaluated for MIT grad admissions (masters or PhD) in select departments.\n\nAnd if the candidate actually gets accepted to MIT down the line, those courses also count toward graduation requirements / grad credits in lieu of equivalent on-campus classes.\n\nNote: these courses are relatively inexpensive (compared to MIT tuition) but not free.  They have rigorous (MIT-level) psets + proctored exams, and usually require 18+ months of dedicated study to complete them.  Plus you'll have to take a final comprehensive exam covering all the materials from all the courses in a series.\n\nAlso, if one does well throughout the online MicroMasters, that only gives a \"right to apply\" to the respective MIT graduate program.  You still have to compete against all the other highly qualified candidates to actually get accepted to MIT.",
                    "score": 3,
                    "author": "p33k4y",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I would be surprised if I didn't have to compete with others. But it's still good to have bonus points not to mention knowledge which is why we're all here.",
                            "score": 1,
                            "author": "Ceki101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No bonuses, but every applicant I’ve interviewed has self-studied something (intellectual curiosity is a hallmark of top students and top institutions). It doesn’t have to be OCW.\n\nAnd you’ll have the satisfaction of knowing more.",
            "score": 2,
            "author": "LiveRegular6523",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree on that with you. Since I love to know more and it has really good content, I'm definitely going to use it.",
                    "score": 1,
                    "author": "Ceki101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OCW is not a system that has any concept of \"completing\" a course or a method of granting a certificate. (That's MIT xPro, which is an actual course-taking system.) There aren't necessarily complete copies of all the p-sets and exams either. You could \"do\" them yourself, but it doesn't have a system to take that sort of input. I don't think you can get \"points\" per say, except that you possibly could arrange to take a class as a self-study and get a high school teacher to supervise you taking a copy of an exam or doing a final project. Depending on how supportive your high school might be, you could even ask a teacher or classmate to generate a numerically-different final exam for you. Don't worry about having the lack of a formal mechanism stop you from doing something you're interested in. I think it still comes across as you taking the effort to study something interesting to you. I would certainly be interested in hearing that from an applicant as an alumni interviewer. It wouldn't tell me you're qualified to pass a real final exam in the class, but it tends to be clear when a student is chasing something \"for show\" vs \"because they wanted to do it\".",
            "score": 2,
            "author": "pquimby",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely agree on the last part with you. Since it's free and on the web, noone won't be able to say I didn't have resources to study, it will only prove I was doing it because I was interested and wanted to know much more about things that MIT teaches. Thanks for your advice, I'll keep studying it anyway, I'm sure it will come handy on MIT somehow.",
                    "score": 1,
                    "author": "Ceki101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you please share these free courses?",
            "score": 1,
            "author": "Unitova"
        }
    ]
}