{
    "id": "fixt6r",
    "score": 84,
    "title": "i got into mit yesterday. i'm scared af that i'm not good enough",
    "author": "CartesianAsparagus",
    "date": 1584257985.0,
    "url": "https://www.reddit.com/r/mit/comments/fixt6r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was just scouring the MIT decisions megathread on r/ApplyingToCollege, and the people who were accepted are insane. I've never seen so many IMO and IPhO silver and gold medalists. Meanwhile, the last time I took physics was in 8th grade.\n\nIs this level of imposter syndrome normal? If MIT accepted me, is that enough validation that I will be able to get through? Will I be able to explore science fields I am a complete noob in?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to never being the relative “best” at anything ever again!\n\nSeriously though, I’ve seen IPhO medalists completely flounder and waste their time here, and I’ve seen disadvantaged kids from Hicksville flourish and go on to do incredible things. I’ve also seen the opposite. People’s stories of how they got to MIT are going to vary wildly and sound super impressive, but that includes yours in its own ways.\n\nAlso, I’ve found that the advantage that Olympaid kids have tends to be *extreme* at first, but then it tapers off by junior year or so. Just don’t get a complex about having to try really hard in the “basic” classes. Stay humble, catch up, do cool things.",
            "score": 93,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. That really does mean a lot!",
                    "score": 25,
                    "author": "CartesianAsparagus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first 2-3 weeks you're at MIT all the pre-frosh will flex on how many AP classes they took, accomplishments etc. They will be intimidating, but in reality they're just as terrified as you. What you quickly realize is that many kids had different opportunities coming from so many different schools. You now have access to the same opportunities everyone else has at MIT. Make of that what you will. I'm often amazed at how little correlation there is between success in high school and success at MIT. Be the best you can be and don't measure yourself to others, because they're often just as worried/flawed as you are.",
                            "score": 33,
                            "author": "Hardmeat_McLargehuge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I’ve seen disadvantaged kids from Hicksville flourish and go on to do incredible things.\n\nI agree with this. I think the most important factors in your success (esp if you're a kid who's from bumblefuck vs from TJ/Stuyvesant, or who's worried about your preparation) are taking a reasonable course load, staying motivated and not getting discouraged when you struggle/take classes with people who're ahead of you, staying on top of your mental health (this was BY FAR the hardest part of MIT for me), and being willing to reach out for help. \n\nYou don't have to take 11 classes/semester and max yourself out on activities. I know many people who had near 5.0s and they weren't all \"the best\" or hyperprepared IMO kids, just people who took reasonable course loads, worked hard, and were willing to ask for help when they needed to.",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "MIT, as well as other elite schools are misleading. It’s hard to feel good about yourself when you walk into a school filled with thousands as amazing as you, especially when you were the best your whole life. \n\nYou should realize that the fact that you got into MIT sure as hell means you’re good enough. You’re definitely good enough, because you were better than 92.8% of the some of the smartest people your age in the world, and that’s incredible. \n\nPeoples stories will *sound* amazing and impressive compared to yours, but that’s just an illusion caused by impostor syndrome.\n\nThroughout your years of schooling you’ve always been the best, and you might not be anymore when you go to MIT. However, it’s extremely important not to lose sight of the fact that you got into one of the best and most competitive schools on earth, that all your work during the last five years has paid off, you have achieved something great, and you really really are good enough.\n\nGo celebrate!",
            "score": 24,
            "author": "BeefyBoiCougar"
        },
        {
            "level": 0,
            "comment": "Yeah there are a lot of IMO and IPhO medalists here. And yes those students are going to be sitting next to you in class. And you know what? *They'll be on your side*. They'll help you. I got dragged through 18.02 by a fellow freshman who ASEed out of like 6 math classes and finished her entire degree in only 3 semesters.\n\nBut you know what else? She sucked at bio and chemistry and had to get dragged through those classes by others.\n\nWe're all in this together. Nobody's amazing at everything. You're amazing at something that got you in. Admissions doesn't make mistakes. You'll be fine.",
            "score": 20,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always have loved that about MIT. Everyone is in it together, to help ground and grow your peers and for them to ground and grow you. \nIt's time for you to join others on their shared quest toward success at this extremely difficult place. You've been chosen to be a part of that, don't doubt that they saw something in you that made that true.",
                    "score": 4,
                    "author": "sundaestubad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This level of imposter syndrome is relatively  normal... but you made it - make the best of it.  Have fun &amp; learn lots.",
            "score": 14,
            "author": "TheKyleBaxter"
        },
        {
            "level": 0,
            "comment": "&gt;I’m not good enough.\n\n\nNone of us are. But you have a job to do so get after it! Seriously though, it will very likely be the hardest thing you ever do. Be tough, resilient but never doubt that you belong. Past accolades are lovely, but what matters most is what you do with the opportunities you are given.\n\nGo to class, every one of them. Go to office hours. Get help on your problem sets. Build your story.",
            "score": 18,
            "author": "Craig_White"
        },
        {
            "level": 0,
            "comment": "There's a selection bias there. The IMO/IPhO folks are the ones who will most likely be flexing on decisions threads on reddit. I guarantee that there are a ton of \"normal\"/lower stats applicants that got into MIT by their own merit. (I was one of them! Only Calc AB and barely passed the AP exam! Failed Physics C! Chemistry, who is she?) Numbers aren't everything, and most of that pre-college stuff is largely due to opportunity (I grew up in a tiny suburb that didn't even have an orchestra program in any of its schools). You can still thrive at the Institvte. Imposter syndrome is definitely real but don't let it get you down.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "you're gonna be fine. congrats :)",
            "score": 7,
            "author": "peteyMIT"
        },
        {
            "level": 0,
            "comment": "hi op, please feel free to dm me if you’d like to talk about this more. imposter syndrome is incredibly common but mit’s collaborative nature and sheer amount of opportunities and amazing community are all elements that can help you fight it. i’d love to talk to you more if you still have concerns:•)",
            "score": 6,
            "author": "camickers"
        },
        {
            "level": 0,
            "comment": "Hey, me too! I got in from a tiny private school. I wasn't even ranked top of my 9 person class (I was third). Got in, and everyone's talking about if they'll be taking 18.02, or ASE'ing it, and I'm thinking I'll be the only student in 18.01.\n\nIt turned out I *was* one of the few students in 18.01, and one of fewer who hadn't taken a calculus course in high school. But it evened itself out very quickly. I was taking the same classes as my classmates by Sophomore year, ahead in some areas, and behind in others. \n\nMIT knows what success looks like, and you matched it. Believe them.",
            "score": 4,
            "author": "AMWJ"
        },
        {
            "level": 0,
            "comment": "yes to exploring new fields! MIT is attempting to make the first year an equalizer in adding discovery courses and other exploratory opportunities to break out of what you were good at in hs and possibly build yourself up in a different field if you so wish. You got admitted to the institute, not a specific major, and that’s the beauty and fluidity of it all! I know a math major who barely took beyond Calc in high school and didn’t do competitions but is still thriving here. I also didn’t do research competitions in high school until AFTER I got into MIT, so I wasn’t necessarily in well-acronymed company until well after my application was already processed and accepted.\n\nThe general undergrad culture is knowing that everyone has their “blind spots” but helping where we can (re: I love designing and building stuff, but hate the required math and physics stuff and I’m getting help for it. yet my bf was a physics camp nerd now doing econ, but don’t ask him to build a t-shirt launcher like I am currently.) and I think it’s pretty awesome how much mingling there is between upperclassmen and underclassmen and people of all majors, so you can get advice and experience from a diversity of people rather than just “the freshman dorm” or “the engineering school”.",
            "score": 5,
            "author": "MiuMii2"
        },
        {
            "level": 0,
            "comment": "Yes to all! Congrats on getting in. You did earn it, even if you’re not sure how.",
            "score": 3,
            "author": "thatwouldbeawkward"
        },
        {
            "level": 0,
            "comment": "Lots of great advice here. To add another perspective, nearly everyone feels that way, even those IMO and IPhO medalists. Your admission was not a mistake, you are good enough. As prestigious and intimidating as MIT is, it is still just college. One waypoint in your life. Imposter syndrome sucks, and most smart people suffer from it. \n\nIt is important to know that the University is committed to your success. Asking for help, often difficult for many students, is encouraged. There are numerous resources to help you, though they are not always as obvious as would be ideal.\n\nYou do belong. Good luck next year.",
            "score": 2,
            "author": "thepasttenseofdraw"
        },
        {
            "level": 0,
            "comment": "Hey! I’m on the same boat. I’m super excited that I got in but I have no big fancy awards. I don’t even have a perfect GPA or perfect test scores. I’m shocked that I even got in, but just know that you’re not alone. I 100% feel the same way. We can do this!! We can make it through MIT. They saw potential in you so now you gotta see it for yourself! Good luck buddy ;) I’ll maybe see you in the fall? Congratulations on the acceptance!! Go celebrate!!",
            "score": 2,
            "author": "bronze-engineer"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "every MIT student has the worst impostor syndrome on the planet. it's completely normal",
            "score": 1,
            "author": "thezerolemon"
        },
        {
            "level": 0,
            "comment": "Some words of advice from someone who went to MIT and was there for a total of 10 years between studying and doing research there. Just relax and try to enjoy it, find things that you are passionate about and do them, dont try to take too many credits at once, be humble, dont compete for who slept less, try to make friends and work with them on psets (this might be a large part of your human interaction) try to do research with some profs, join some clubs, hell take 5 years to get a 4 year degree, its some of the best years of your life and you will miss them when you are gone. (And they will be painful while you are there) \n\nBut overall remember to have perspective, if you feel overwhelmed drop a class, in 10 years nobody is going to care you got a C in algorithms but the fact you were a nervous wreck through college because you didnt have perspective will have an impact on you during your time there.\n\nBe cool and enjoy it man/woman, wish I could do it all over again",
            "score": 1,
            "author": "trifilij"
        },
        {
            "level": 0,
            "comment": "I felt the same way as you when I got in last year. At a preview event, I found that a lot of peers had the same worries. It seemed like everyone felt like an imposter. The one thing that stuck with me from that weekend was what an admissions counselor told us. She said that 10 different people had to all look at our application and say \"yes\" to us. For us to think that 10 differnet people could unanimously make a mistake was impossible, and we should know that we were specifically chosen out of thousands to be here.\n\nSo yeah, you deserve it! Don't let the accomplishments of others minimize your success!",
            "score": 1,
            "author": "gaylemonsad"
        }
    ]
}