{
    "id": "m8lh9m",
    "score": 233,
    "title": "Admitted, but not sure if I can handle MIT",
    "author": "Wushetam",
    "date": 1616172519.0,
    "url": "https://www.reddit.com/r/mit/comments/m8lh9m",
    "media_urls": [],
    "other_urls": [],
    "postText": "EDIT: People were actually able to figure out who I was because of this somehow lol, so I removed the body of the post for privacy but wanted to keep it up because there were a lot of really great comments that helped me deal with my imposter syndrome.",
    "comments": [
        {
            "level": 0,
            "comment": "It's been years. But the school will do everything to help a kid who wants to learn and put in the work.\n\nOffice Hours / TAs / LAs / Advisor in general will work with you to enable your success. If you're willing to put in the work people will be there with you when you're struggling.\n\nAt least that was my experience.",
            "score": 99,
            "author": "oblisk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice.",
                    "score": 14,
                    "author": "Wushetam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you made it in you can make it out.",
                            "score": 12,
                            "author": "Alphablackman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey man, first of all, Congratulations on getting in. I understand what you are saying but you should not be discouraged just because your peers would be gold medalists and what-not. MIT does not admit students without a reason. They must have seen you as a great fit for the MIT community. That is why, they offered you admission.\n\nMIT is a diverse place. Everyone has their own backstory. It is a challenging place but I am sure that it would help you out in your future endeavours.\n\nPs: You can look up KJ Hardict (AE ‘20) on YouTube. He has many videos about MIT and the life there. I hope it helps.",
            "score": 58,
            "author": "CaptainLab"
        },
        {
            "level": 0,
            "comment": "&gt; I'm genuinely terrified of this school\n\nThat's normal. I was too. That went away almost immediately. Classes aren't harder (it's the same material no matter where you are), they just move really fast.\n\n&gt; I wrote my essays the day apps were due\n\nSounds like you're a good writer then. I labored over them for months and they still kinda sucked.\n\n&gt; no math competitions/olympiads/research/etc\n\nI never did any of that either. MIT people (students, profs, admissions, etc.) see this as academic wankery. We think it's fun to do the Putnam or whatever, but nobody thinks you're not good at math if you suck at it. We recognize that doing well on these kinds of things is as much about knowing the strategies (and having the opportunities to study them) as being \"smart\".\n\n&gt; my programming experience is very limited (functionally non existent)\n\nThis is fine. Very few incoming Course 6 majors have any significant programming. Many have done some programming, whether in APCS or their own dicking around, but that barely counts for anything. It's like a 100m head start in a marathon.\n\n&gt; IMO gold medalists and ISEF finalists\n\nI don't even know who those people were in my class.",
            "score": 52,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bloody hell. This was one hell of an eye-opener. I'm a prospective international applicant for the class of '26, and I've been rather obsessed with the applyingtocollege forum, particularly because I have no one else to consult with about the process. It wrecked my self-confidence, to say the least. I considered myself rather diligent since the beginning of highschool, and sunk a lot of time into music production and now guitar, which I hope to take further, but seeing the folks with achievements upon achievements in international/national stem-related competitions and research and all sorts of crap that I can't imagine adolescent students give a rat's arse about pursuing really was demoralizing. But I kind of had this bitter belief that surely ao's wouldn't find applicants pursuing arbitrary competitions that highschool students surely wouldn't do for interest's sake attractive? I know it's a toxic mindset to hold, but I can imagine it would get obnoxious when you see thousands of applicants doing similar things quite advertently to get into your uni.  \nAnyways, not to say that I have any better of a chance, but gives some relief.",
                    "score": 12,
                    "author": "IdyllOfficial"
                },
                {
                    "level": 1,
                    "comment": "Thanks for your insight. Your last point was particularly interesting. While I know pretty much everyone at MIT is smart, I was under the impression that the majority of students were nationally renowned/distinctive award winners. For lack of a better word, how common are hardworking \"normal\" people such as myself?",
                    "score": 14,
                    "author": "Wushetam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Hardworking\" is the key here. While native smarts can help, having a solid work ethic and knowing how to study effectively will get you far at MIT. There are a lot of people at MIT who aren't necessarily genius-level smart, but they're good at studying and time management. If you've had to learn those skills to do well in high school, you're well-positioned to do well here.",
                            "score": 27,
                            "author": "TheOriginalTerra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry for this very late reply, but what is your experience with students that _didnt_ study much at high school? I’m in the equivalent of sophomore year right now and I don’t have to work very hard. I had a 100% for AP math without doing anything until the day before for example. I don’t say this to brag, instead I’m afraid that if I were to be accepted to MIT (which is a low chance ofc) I’d be gut punched because I never had to learn those skills.\n\nAnd because I don’t have to work very hard, I find it hard to find motivation to learn them.\n\nFeel free to ignore this if you don’t feel like replying to something that you commented over a month ago.",
                                    "score": 1,
                                    "author": "PM_YOUR_SOUL_TO_ME",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "TBH, I mostly work with grad students who have obviously figured this out since they got admitted to graduate programs at MIT. :)\n\nI also pretty much skated through school, and a few decades on I can tell you that proceeding as though everything will come easily to you will not serve you well. Since you don't find school challenging, you're going to have to find other things that are. Learn a language, a musical instrument, a sport - something that doesn't come naturally or easily to you, but that interests you. Aim for a reasonable degree of proficiency, and fight for it if you have to. Don't let anyone tell you it's unnecessary or a waste of time.\n\nI mean, let's assume you get into MIT after coasting all the way through high school. (Trust that if you get admitted, it's because MIT thinks you can succeed here.) You'll learn how to study because you're forced to, but that'll just make your first year that much more stressful. As it stands now, you have a couple of years yet to learn that stuff before you get here, so you might as well start now.\n\nAnd even if you don't go to MIT, learning how to apply yourself in the face of challenges is a life skill that will serve you well no matter where you end up.",
                                            "score": 3,
                                            "author": "TheOriginalTerra",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much for the advice!",
                                                    "score": 2,
                                                    "author": "PM_YOUR_SOUL_TO_ME",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "De nada. I wish I had been as self-aware as you are when I was your age. I have a feeling you're going to do well for yourself.",
                                                            "score": 3,
                                                            "author": "TheOriginalTerra"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think that award winners are in the minority, and possibly an extreme minority.\n\nI don't think of dividing MIT students into \"smart\" and \"not as smart but hardworking\". Everyone's pretty smart, and everyone works pretty hard. Sometimes you have a class that for whatever reason just \"clicks\" with you and you easily get an A (for me that was 18.03), and sometimes a class kicks your ass. Some people might have more of the former and less of the latter, but pretty much nobody doesn't struggle at some point.",
                            "score": 17,
                            "author": "maestro2005"
                        },
                        {
                            "level": 2,
                            "comment": "In the best possible way, I think people at MIT care about who you are, not what you are. It’s a very open and collaborative place where struggling is not shameful. It also knows it’s challenging, and there are tons of resources to help as long as you’re willing to ask for them.",
                            "score": 9,
                            "author": "papajace"
                        },
                        {
                            "level": 2,
                            "comment": "very very very common. I spelled my last name wrong on the SAT and still got in.",
                            "score": 27,
                            "author": "knit-flix-and-chill"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I wrote my essays the day apps were due\n\nThis isn't  exactly true...",
                    "score": 1,
                    "author": "baugh76"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Academics haven't been particularly easy for me either. My peers assume I'm some sort of effortless genius but I spent a lot of time studying in highschool to keep my grades up.\n\nThis is extremely encouraging. Many naturally bright high school students hit a wall in their first few weeks at MIT because they never learned how to study—they just intuited their way through their classes. They get distracted by fun side projects or clubs and get gut-punched in the first round of exams. Just go to class and keep working through the problem sets. Try to run the race with yourself only. The admissions committee selected you because they believe in you, so you already have a set of fans on campus and will soon gather more.",
            "score": 27,
            "author": "Chemomechanics"
        },
        {
            "level": 0,
            "comment": "Hi Wushetam —  \n\nI know some other people have already responded but I just wanted to weigh in w/ whatever additional marginal Structural Authority I have. \n\nAs others have said the things you think are \"weak\" are in fact typical of most admitted students. We usually say this at CPW as a joke, but most admitted students submit their apps on the day they are due; most admitted students did not participate in (inter)national STEM competitions or high-level research; most admitted students didn't have much programming experience in high school. \n\nAnd some of the things that you are worried make you weak —  like your study skills —  are in fact more likely to make you a strong MIT student: our research shows that students who come in with strong noncognitive skills, like good study habits, often have a better transition than students who coasted through high school on (air quotes incoming) \"\"\"natural intelligence\"\"\" and then hit a wall at MIT. \n\nFurthermore, we would not have admitted you —  for whatever reason —  unless we were _extremely_ confident in your academic preparation. Given all the disruptions this year, we applied really intense scrutiny on every student to make sure we were as confident as anyone can be in their preparation. \n\nYou are experiencing a very normal response, the one that most admits ~who are not arrogant/overconfident~ experience. Let me sketch what your future might be, just because it is a very common pattern I have seen over and over, in terms of the roller coaster: \n\n* shock upon admission  \n* initial grip of terror (they must have made a mistake; I'm not actually that good) \n* self-efficacy slowly rises throughout spring and summer as reality of admission sets in and people gas you up as the MIT genius \n* arrive at MIT, it's insanely hard, self-efficacy plummets back to \"oh god they really _did_ make a mistake\" \n* slowly realize that everyone around you is being challenged, and some things you find hard others find easy, and some things you find easy others find hard \n* your identity will begin to shift from \"person who is smart and good at school\" to \"person who works hard to solve problems the best i am able\" \n* self-efficacy slowly recovers, maybe never to its post-pi day height, but, by graduation, to a higher degree (and crucially more robust/resilient/well-founded quality) than it was for most of high school or college experience \n\nThis will not _necessarily_ be your future, it's different for everyone. But if you experience any part of this path, I hope you find comfort in knowing that this is part of what makes the MIT education so challenging, and so rewarding, and the latter because of the former. Hope to see you around in the fall.",
            "score": 27,
            "author": "peteyMIT",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much petey!",
                    "score": 7,
                    "author": "Wushetam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as others have said, if you were admitted, you have what it takes to do well at MIT. you deserve your spot. there are a ton of resources and communities out there at MIT that will be wonderful sources of support if you need them. imho college app subs are frightening and toxic and are not a great representation of the people you'll be surrounded with once you're at school. also holy shit working a food service job while handling high school is hard - give yourself some credit!!\n\n\nplenty of us are regular people who didn't do anything stellar or IMO/ISEF-like in high school, and we've done just fine. MIT kicks everyone in the ass eventually if you're doing it right; it's just a matter of when. in some ways getting that reality check early on helps you handle things with more grace throughout undergrad. if you're coming in with humility you'll be well placed to do well. \n\n\nit sucks to feel like you're carrying the weight of a demographic on your shoulders if you're in a place or field where your demographic is underrepresented. I'm a queer woman working in a heavily male field, and it's a feeling that's hard to shake. to be clear, you should not have to feel like you're representing all black people - our society sucks - but that doesn't mean that feeling isn't or won't be there. \n\n\nI've found it helpful to find pockets of people like me to validate how I'm feeling, on good days and bad (\"did X person really just say that? am I right to feel mad?\" \"I deserve this recognition, right?\" \"Y policy change doesn't feel great to me\"), and just to have a space where I don't feel out of place. I know that at MIT, for example, the BSU (Black Student Union) has been very active in pushing for change at the Institute and seems to be a great community. MIT still has a long way to go with diversity, inclusion, and equity, but I've noticed more conversations happening about it in recent years. \n\n\nplease reach out if I can be of any help at all. I hope this is of some use.",
            "score": 23,
            "author": "knit-flix-and-chill",
            "replies": [
                {
                    "level": 1,
                    "comment": "It absolutely is, thanks so much!",
                    "score": 8,
                    "author": "Wushetam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, I'm a current freshman. I was reading your post and thought \"wow, this is me\", except I'm chinese and not black. I think the admissions office wouldn't have admitted you if they didn't think you could do it. I also wrote my essays on the due date, I never did any competitions or research. I worked part time at a restaurant through high school too. My parents also never finished high school so I didn't know anything about college. Nothing \"qualifies\" me to go to one of the best schools in the world, but here I am anyways. \n\nI'll admit that being tossed headfirst into doing physics with calculus(8.01) when you've barely done physics before, or doing what used to be a week's worth of math content at my high school in an hour(18.01) will take a bit to get used to.\nI also never took a programming or cs class before, but ended up enjoying 6.0001/2(Intro to CS). If you're open to learning, MIT will help you. I'll admit that I've cried from frustration before because I felt behind, like it wasn't clicking while it seemed like everyone else was moving faster than me or started ahead, but I found help in classmates, TAs, and instructors who wanted to me to enjoy the subjects that they are so passionate about and learned how to keep up and exceed what I thought I was capable of.\n\nThis feeling of not measuring up, of constantly being behind your peers is one that many people share, but you're not here to focus on their education, just yours. There will always be someone better than you at something, so all you can do is put your best foot forward and try your best in what you wanna do. I thought I'd regret going to MIT when I could've gone elsewhere and probably put in half the effort to get far more credit for my work, but I don't.",
            "score": 18,
            "author": "waterRK9"
        },
        {
            "level": 0,
            "comment": "Hey you.\n\nYour story sounds pretty much like mine. Aside from my hobbies and part time jobs, I had no extracurricular activities. Never won a competition, no notable internship. Also know what it's like to wonder the role affirmative action played in admission. Black and gay so perfect ticket to meet their diversity quota.\nFact is regardless of where we go, we'll always feel like the ambassador for blackness. I'd like to think that MIT is full of brilliant people who understand that we aren't representatives for millions of people.\nLike you, I felt under prepared. But there is no better place to be underprepared than MIT. Of course, this is all empirical. But in all my years of academia, I've never encountered faculty and admin so ready and willing to assist you. Also, being underprepared doesn't attest to your intelligence/capability. Neither does the amount of time you took to study in high school. For example, I never understood physics until I started studying in openlibraries (if you want to prepare, the MIT openlibrary, ocw and edx are great places to start). Maybe your teachers didn't do the best job explaining, or maybe you haven't really learned how to study effectively as yet.\nStill, demonstrated intelligence isn't necessarily the biggest indicator in your ability to succeed at MIT. It's resilience and humility. Being able to fail and not quit, being able to put in the hours, and more importantly being able to admit you don't understand something and need help. It's not about the ECs you lack, maybe they saw that resilience and potential in you.\n\nMIT isn't easy. And I've felt panic and dismay several times being here. I've cried countless times. But there's no where else I'd rather be. And as underprepared as I was, with all the help I've asked for and been given, I'm doing pretty damn well. It's hell but it's also paradise. Ihtfp.",
            "score": 18,
            "author": "welp_731"
        },
        {
            "level": 0,
            "comment": "1. There are resources there to help EVERYBODY, but (at least when I was undergrad 20 years ago) they will not hold your hand in finding and using them. Course 6 is a school-within-the-school with a lot of course-specific resources. Be very proactive and ask your advisor for help. Don't ever pretend you're fine if you're not.\n2. Don't be a hero. I enrolled in 8.022 and 18.022 my first semester, and it took me a while to dig out of that hole. I didn't have the study skills I needed, so intelligence didn't matter.\n3. Time Management. Time Management. Time Management. Time Management. Start with the easiest feasible class schedule. Learn how a problem set is different from high school homework. Treat it like a job and go to every single lecture and recitation.\n4. Don't stress about affirmative action. You didn't get in by accident. The reason you're in is because the admissions committee understands that perfectly optimizing a white, suburban gifted school isn't the only sign that you can be successful. Working fast food on a strict shift schedule is a HUGE advantage over other kids, see previous point.\n5. Seriously though, for most of us MIT is about time management, not intelligence. You're smart enough to learn what you need to, don't stress about other kids coming in with more academic creds. 99% of undergrads will hit a point where their existing knowledge isn't sufficient, and things move too fast to keep up on pure intellect. The earlier that happens, the better. It's a huge struggle to learn how to learn once things are already going.\n6. School takes up enough mental and emotional energy. If majority white spaces are exhausting for you, check out social/living groups that match your background so you have a safe space to recharge.\n\nEDIT:\n\n7. Course 6 is terrible for actually teaching languages, they assume you know the languages and teach the theory behind them. Look at intro class in other courses (e.g. I took 1.00 to learn Java, so I could complete my course 6 coursework).\n\n8. There is a surprising strong social scene. Schedule your study time strictly so that partying on a friday or saturday night doesn't screw you over for the next week. Boston is a super fun town with half a million other college students. You'll want to take advantage of that.",
            "score": 13,
            "author": "drc500free"
        },
        {
            "level": 0,
            "comment": "I was admitted from a rural GA public school and I felt extremely similarly when I got in. I was afraid I'd be the dumbest one there. I distinctly remember crying during CPW because I was so overwhelmed with the thought of going to school with people so different in a place so different where I could very easily fail, but I'd gotten a full need scholarship so it was actually cheaper than GA Tech, and who turns down MIT? Visiting (which they paid for because I applied through a fee waiver) was my first time on a plane. I was one of only a few with a southern accent. I have the privlege of being white but I also couldn't help but think my admission was a low income/rural diversity admit. And to be fair, my life experiences were very very different than most of my peers at MIT. But god damn what an opportunity MIT was for me. As I look back now 10 years+ from graduating I can very well say that MIT's admissions offer to me was akin to climbing 20+ rungs on the privlege ladder. I still find myself in rooms and conversations where 95% of people came from much much more privileged backgrounds than I did and that I am able to contribute a different perspective to solutions/ideas than them which is the whole point of affirmative action -to get capable people with less privlege into positions where they can make a difference.\n\nAll that said, I came here to say that MIT does it's damn best to level the playing field for you and all the Private school California kids by the end of your freshman year. They do this by offering all the GIRs at different \"levels\". So the kids whose schools had every AP class and they got 5s can either skip out or take the \"hard\" version while you can take a physics class that lasts longer than a normal semester 8.01L (which is what I took because I didn't know what a vector was when I got there). They offered Pass No Record, ABC, no record and I'm not ashamed to say I No Recorded a class frosh spring &amp; took it again and did fine. I took a few classes in Concourse because they were easier/ the community was built in. I was a regular at office hours.  There are lots of creative ways to find what you need to be successful and they mostly fall in your lap. Idk if I ever felt \"smart\" compared to the kids who won Intel Science (legit had never heard of it before I got to campus), but I do know that I was always able to get the help I needed to succeed when I asked/looked for it. By the end of my freshman year, I'd gotten all B's and I was elated to be just an average kid at MIT, and didn't feel like my educational background was causing me any big hurdles going forward from there.\n\nMIT's biggest pro is that it's a small school and it's got one hell of a supportive community. I think even the California private school kids struggle with their classes and feel inadequate sometimes. Basically no one can do MIT alone, so we've built a community to get through it together. You won't be working alone when you're at MIT. You'll be in a pset group getting work done. Most hard classes in every major are group project based. \n\nGood luck with your decision. But know that if you do end up at MIT you'll find community to help you through. I think a lot more people could make it through MIT than they let in, but they didn't make a mistake.",
            "score": 14,
            "author": "reasonable_lift"
        },
        {
            "level": 0,
            "comment": "Sounds like a good case of [Impostor Syndrome](https://en.wikipedia.org/wiki/Impostor_syndrome). Literally everyone at MIT has this. You'll fit right in",
            "score": 40,
            "author": "Walmart_Internet"
        },
        {
            "level": 0,
            "comment": "Here's [Federico Ardila](https://www.quantamagazine.org/mathematician-federico-ardila-dances-to-the-joys-and-sorrows-of-discovery-20171120/), speaking of his admission to MIT. I think you need to read this in full.\n\n&gt;I had never heard of MIT. And it hadn’t crossed my mind to study abroad. I was already enrolled in the local university. But my classmate told me MIT had awesome financial aid and said the math there was really good. I wanted to learn more math, so I decided to play along and  apply.  \n&gt;  \n&gt;At that moment I was failing most of my classes in high school. It was not clear that I was going to graduate. I had a little bit of an attitude problem. I was very interested in a lot of things but I did not  like being told, “Read this” or “Think this way.” I just kind of wanted  to do things on my own terms.  \n&gt;  \n&gt;I was failing, I think, six out of eight subjects. Had I known what  MIT was, I should have known not to apply. There is no way I should have  applied with that kind of transcript.  \n&gt;  \n&gt;I like telling this story to my students because I think we often close doors to ourselves by thinking that we’re not eligible or that we’re not good enough. And especially if you’re somebody who feels  “othered” in your discipline or who feels like you’re lacking confidence, it’s easy to close doors on yourself. There’s a lot of  people in life who are ready to close doors for you, so you can’t do it  for yourself.",
            "score": 11,
            "author": "djao"
        },
        {
            "level": 0,
            "comment": "I took a double take when I saw this cause I wasn’t sure if I wrote it in my sleep or something lol but you described word for word my situation last year. I’m halfway through freshman year and I’m happy I came here. Even though everything is through zoom I think that there are a lot of resources to help students succeed in these hard classes. I’m not gonna pretend that it’s not hard (because it is lol) but if you use all your resources it can be done. Office hours is something mentioned a lot here and I agree that it definitely makes things from impossible to manageable. Make friends/study groups cause everyone is on this ride together and no one will make fun of you for not understanding something because it’s very collaborative. There’s a lot more that I’ve learned and am still learning about how to succeed at mit but if you’re still not sure feel free to dm me and I’d be happy to help",
            "score": 11,
            "author": "whatitdobabeee2"
        },
        {
            "level": 0,
            "comment": "As an URM who was also accepted into MIT, it's sad to see others feed into the narrative that you're undeserving of an acceptance because of your race. No matter what they say, you got into MIT because you're smart and you can handle it. Just because you're an underrepresented minority, doesn't mean you're intellectually inferior in any way. I hope you choose to attend :)",
            "score": 8,
            "author": "Less_Grapefruit_6503"
        },
        {
            "level": 0,
            "comment": "As a graduate student I'm not sure I'm totally qualified to weigh in here, but if you search the subreddit or any other MIT forum, the response to these kinds of questions is pretty much universally \"there are way more qualified applicants than acceptances, if they picked you, they have an indication that you can handle it.\" \n\nSome of this is imposter syndrome, but if you're that worried about perceived gaps in your background, all the material is on OCW; you can brush up a bit on your physics or programming over the summer if it would make you feel more confident coming in. People come in with a pretty broad range of backgrounds (even more so with this weird Covid year), so the freshman pass/fail is there for a reason, and there are tutoring resources available if you struggle at first.",
            "score": 19,
            "author": "InspireTheLiars",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": -11,
                    "author": "epic_gamer_4268"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most people at MIT did not dominate big anything contests, and the admissions office does not admit people they don't expect to be able to handle it. You won't know until you try. I know a number of people from low resources who took advantage of peers and resources, and did well. We all want you to succeed!  \nYou may want to see if you can find some online physics lectures over the summer if you feel weak there.  \nThat said, not having programmed much means fewer bad habits to break. Too many people with coding backgrounds think they know it all and their ego gets in the way of learning.",
            "score": 7,
            "author": "clawclawbite"
        },
        {
            "level": 0,
            "comment": "I’m a first-year at MIT right now, and going in I had some of the exact same concerns as you. But I have to say, once you’re here it feels like everyone is on the same level. Despite the fact that I was literally three years behind some of my peers in math, it hasn’t felt like it makes a difference at all. Which seems counter-intuitive, but it’s genuinely how it is. And there’s a lot of people here who haven’t even participated in science Olympiad or whatever! Once you get here, there are so many cool things to participate in that you won’t have to worry about missing those.\n\nAlthough there are always the people who ASE’d (tested out of classes) everything and basically come in as sophomores, there are A LOT of people who don’t. You have absolutely nothing to worry about, if they admitted you, you’ll do great here. Especially if you like the sound of the community :) Also I’m not sure if anyone has mentioned this already, but you sound like you’d be perfect for the Interphase Edge program through the Office of Minority Education (OME). If you’re a bit behind in anything, they’d help you get caught up AND teach you career skills that you may have not had a chance to learn. Good luck, and congratulations! :)",
            "score": 6,
            "author": "Aroths"
        },
        {
            "level": 0,
            "comment": "&gt; my programming experience is very limited\n\nThat’s fine. They plan to teach this stuff to you.\n\nJust dig in. If you put the effort in, ask for help and can accept a failure or two along the way you’ll be ok.",
            "score": 6,
            "author": "Craig_White"
        },
        {
            "level": 0,
            "comment": "You say you aren’t an effortless genius, and you’ve had to study a lot. Just from that statement alone I know you’ll do fine. I wasn’t in any crazy Olympiad competitions or anything like that. However high school was a breeze for me, and I never had to study. When I got to MIT I realized not studying wasn’t going to cut it. Honestly one of my biggest struggles was learning how to take a class that wasn’t immediately easy. Learning how to study and how to ask for help were the biggest barriers to success for me. I graduated a year late because I lacked these skills and had to retake classes. It seems you are already able to adapt to difficult classes. So I think you’re ready. It will be hard, no doubt. But I think you’ll do great :)",
            "score": 5,
            "author": "csiqueiros15"
        },
        {
            "level": 0,
            "comment": "It sounds like you're going through an episode of imposter syndrome. \n\nYou got in for a reason: they see potential in you. \nCollege is scary no matter where you go. Don't let your fear scare you away or make you feel that you're not up to the challenge. \n\nIt wil be challenging, but you can absolutely do this! \n\nI come from a similar background as you and gosh, how good it is to feel represented!\n\nYou're clearly already succeeding and perhaps even ahead of many people who have way more resources than you. \n\nYou'll be able to ask for help and find resources and other things you need in college if you keep an open mind. Go on and succeed!! You can do this!",
            "score": 6,
            "author": "MeMissBunny"
        },
        {
            "level": 0,
            "comment": "hey! im also an accepted prefrosh. unsure about mit as well. also coping with imposter syndrome. i just wanted to say that you shouldn't sell yourself short. YOU GOT INTO MIT! This means that you're smart -- not just in the way that comes from winning math olympiads which many MIT students do, but in the way that plants a desire within yourself and others to POSITIVELY CONTRIBUTE to the world and empathize with others. idk you, but im betting what you say you lack in ECs, you make up for in experience and dedication &lt;3 xx maybe? see you next year!",
            "score": 5,
            "author": "greenmountcoffee",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": 3,
                    "author": "epic_gamer_4268"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The other day I read that Natalie Portman said she specifically took the hardest classes she could at Harvard because she felt like an *imposter* unworthy of such a prestigious school and wanted to prove herself. Interesting path to ambition, I guess. I say give it your best shot and make it worth your while—a million kids would kill to get into MIT. Congratulations!",
            "score": 4,
            "author": "Salty-Transition-512",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": 0,
                    "author": "epic_gamer_4268"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow! You sound amazing! Hardworking, honest, smart  and humble! Your going to do really well at MIT! Your parents must be super proud! You’ve EARNED this! Don’t let yourself think otherwise! Admissions officers at MIT know what they are doing. They chose you! And don’t forget to let us know how well your doing and how MIT feels like home a few months in!",
            "score": 3,
            "author": "IrishRogue3"
        },
        {
            "level": 0,
            "comment": "I'm not going to sugar coat it - MIT can be a bleak and brutal place. The workload is oppressive and the atmosphere is ultracompetitive. Once you get through, you will be superbly qualified to deal with the harshest the business world can throw your way. But it takes commitment and perseverance. You sound like you are used to hard work and that's good. You'll get plenty of it. Good luck.",
            "score": 5,
            "author": "optiongeek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, this is a bit late but as another ‘25 adMIT I’m wondering if you can expand on the “ultra competitive atmosphere”? I’ve heard a lot that mit is extremely collaborative, so I’m interested on your take. Does the competitive atmosphere come in the external form of competing for opportunities or in classes and toxicity between students, or is it more internal where the overall environment is very stressful due to the workload and students feel like they always have to do more and be busier than the next person? Or something else entirely?",
                    "score": 1,
                    "author": "slouchingpotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's collaboration - but mostly in the form of \"how can team work help me get ahead?\" My experience is that MIT has some of the most competitive people on the planet - and it shows. It makes sense - if you're ultra competitive where are you going to go? There's nothing wrong with going to a school with extremely smart and motivated people. But don't think they are going to stop acting the way they did that got them into MIT in the first place.",
                            "score": 2,
                            "author": "optiongeek"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take advantage of the HKN tutoring. I never wrote code till the second semester of my sophomore year but somehow still made it through an 18C major (taking all the required 6-3 classes besides the communications one) by getting help from mostly underclassman tutors lols.",
            "score": 2,
            "author": "TheEnchantedHunters"
        },
        {
            "level": 0,
            "comment": "I'm a GRA at MIT (a graduate student who lives in the undergrad dorms in what could loosely be described as a mentorship role). From my perspective, students in your position have at least one big advantage... If you arrive at MIT already willing to ask for help with your assignments (or other issues), you skip over a lot of difficulty that some other students experience. Alternatively, if you arrive at MIT believing that you can do all your work without asking for help it can be a painful experience to let go of that belief. From when I can see, MIT strongly rewards help seeking through the many support resources for academics and otherwise. \n\nFeeling like you know less than your peers is uncomfortable, but recognizing that you feel that way will be enough to get you through, and by the time you graduate you will know much more than you would if you attend a less competitive school.",
            "score": 3,
            "author": "charlesholbrow"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": -1,
                    "author": "epic_gamer_4268"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's called imposter syndrome. If you have a passion for what you study, and you work hard with an open mind to feedback, be proactive in learning by engaging with TA's and profs, and surround yourself with people who support you, you'll survive and thrive at MIT.  \n\n\nDon't let anyone, and especially not yourself, tell you that you don't belong.",
            "score": 1,
            "author": "amazn_azn",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": -1,
                    "author": "epic_gamer_4268",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bad bot\n\nedit: your reply makes no sense lmao",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "when the assumption is wrong!",
                                    "score": -1,
                                    "author": "epic_gamer_4268"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "no tips but huge congrats on ur adMIT and u are so deserving and awesome!!",
            "score": 1,
            "author": "a2c-lurker"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "when the imposter is sus!",
                    "score": 0,
                    "author": "epic_gamer_4268"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take a gamble on yourself. Most people feel the way you do.",
            "score": 1,
            "author": "fathan"
        },
        {
            "level": 0,
            "comment": "Just chill, relax, there are sooo many ways to succeed. So if you are scared about the physics classes look at some of the classes online before you start, enough so you dont start from 0, the same with programming classes. MIT is famous for not teaching programming but teaching computer science (and you learn programming on your own), so got try to learn some python and you will feel a bit less scared once you are at MIT. Smile you are in for a heck of a ride",
            "score": 1,
            "author": "trifilij"
        },
        {
            "level": 0,
            "comment": "Hey don't worry I got admitted to MIT with no research or any of that kinda stuff, I come from an uncompetitive high school too lol",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same for my daughter. OP: Google \"imposter syndrome.\" You belong here.",
                    "score": 1,
                    "author": "SpartyKat77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am going, to be honest. Did being a URM help you? Most likely, but even then that wouldn't be your decisive factor in college admissions. Getting accepted into MIT--even as a URM is INSANELY difficult. So congrats.",
            "score": 1,
            "author": "Environmental_Ebb499"
        },
        {
            "level": 0,
            "comment": "Hello",
            "score": 1,
            "author": "MikuDefender"
        }
    ]
}