{
    "id": "tfln52",
    "score": 10,
    "title": "campus preview weekend — do parents have to come?",
    "author": "mr_clean_with_hair",
    "date": 1647447172.0,
    "url": "https://www.reddit.com/r/mit/comments/tfln52",
    "media_urls": [],
    "other_urls": [],
    "postText": "My parents have schedule conflicts and I was wondering if it’s ok/normal to go to cpw by yourself, i rly want to go and a lot of my friends are going but my parents seem to think i can’t go on my own",
    "comments": [
        {
            "level": 0,
            "comment": "It has been a while since I went to CPW, but I don't even remember parents being invited.  Maybe they were, but mine didn't come.  I hung out with students the whole time.  I think it would be a better experience with no parents as you would be more likely to get a real view of the school.",
            "score": 27,
            "author": "Twinrovus",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok thanku so much",
                    "score": 3,
                    "author": "mr_clean_with_hair"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't bring parents anyway. Not sure they're even invited.",
            "score": 17,
            "author": "prestodigitarium"
        },
        {
            "level": 0,
            "comment": "In a normal year, most students come without parents, and so you'd be fine on that front. But CPW is for students only this year, and there will not be events for parents. Even if they could come, I wouldn't recommend them coming.\n\nSource: https://admitted.mit.edu/experience/families\n\n&gt; However, due to MIT's strict Covid-19 safety protocols, Campus Preview Weekend will be for students only this year.\n\n&gt; We know this is disappointing, but we are planning a series of virtual programs for parents and families that will answer your questions and give you a good sense of what MIT is like. Think of it as your own virtual CPW.",
            "score": 13,
            "author": "ivsamhth5"
        },
        {
            "level": 0,
            "comment": "*However, due to MIT's strict Covid-19 safety protocols, Campus Preview Weekend will be for students only this year.*  \n*We know this is disappointing, but we are planning a series of virtual programs for parents and families that will answer your questions and give you a good sense of what MIT is like. Think of it as your own virtual CPW.*\n\nhttps://admitted.mit.edu/experience/families",
            "score": 8,
            "author": "jeremyposts"
        },
        {
            "level": 0,
            "comment": "Parents on CPW were always a rarity when I was there.  You will be ok.",
            "score": 7,
            "author": "ThunderSparkles"
        },
        {
            "level": 0,
            "comment": "It's totally ok to come by yourself. I didn't go to my CPW, but I read some faqs about it and was aware of some prep work for it in 2020. There's an airport shuttle with students at Logan to help you find it, and once you get to campus you'll have a current student to stay with, so it's definitely not necessary for your family to be there. You may also find the current [CPW faq](https://admitted.mit.edu/experience/faq) helpful.",
            "score": 6,
            "author": "minerva-shard"
        },
        {
            "level": 0,
            "comment": "They're not supposed to!",
            "score": 4,
            "author": "KatAndAlly"
        }
    ]
}