{
    "id": "ts649i",
    "score": 12,
    "title": "I’m Skeptical of Working Longer on Problems",
    "author": "yomama9002",
    "date": 1648645861.0,
    "url": "https://www.reddit.com/r/mit/comments/ts649i",
    "media_urls": [],
    "other_urls": [],
    "postText": "In my classes like 6.0001, 5.111, and 8.01, I understand the stuff we do in class, but then I miss questions on the tests that are different from the ones we did in class. I ask the professors and TAs how I’m supposed to be able to solve these, and they say I should just practice longer. I’m skeptical of this because I’ve struggled on problems before and gotten the right, but when I move onto another novel problem, I don’t automatically know what to do. Working longer on the problems doesn’t make me feel more confident about my ability to solve a variety of them. This is why on study guides, I usually spend most of my time reading the solutions, so I have something similar to connect to when doing new problems. Has anyone else done this or felt the same, but then they were proven wrong when they started working longer on the problems?",
    "comments": [
        {
            "level": 0,
            "comment": "Right. MIT classes don't test your ability to cram and regurgitate, they test how well you've actually learned the material and can apply what you know to new problems. As you do psets and study for tests, you have to make sure that you're actually understanding the concepts and not just the particular methods to solve the particular problems you're faced.",
            "score": 20,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do I know if I’ve actually understood the concepts?",
                    "score": 2,
                    "author": "yomama9002",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you have a text book for the course, try working through some non-assigned problems. In my experience, those are even on the tests occasionally (or variations of them).",
                            "score": 8,
                            "author": "notyouravgredditor"
                        },
                        {
                            "level": 2,
                            "comment": "Chat with an upperclassman or during office hours. It's also OK to not be a good test taker, I certainly wasn't.",
                            "score": 1,
                            "author": "whymauri"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From personal experience, it was less about the raw amount of time, but just that I could only absorb so much material in a given timeframe. The amount of material and information you need to do well at MIT is just drastically more than what you typically see in high school. \n\nThis lead to my high school studying habits cramming for a PSET or studying for exams the day prior or even a few days prior being insufficient for MIT. It was a learning lesson for myself to have to start preparing and studying weeks out in advance of a PSET due date/exam. 2 hours a day for 2-3 weeks was more effective for myself than 3 days of 12 hour studying. \n\nCramming leads to repetition, whereas spaced out studying actually helped me internalize and understand the material which as others have stated, is critical to doing well on exams at MIT",
            "score": 8,
            "author": "Dezurection"
        },
        {
            "level": 0,
            "comment": "I was at MIT for grad school so this might not be as relevant as I never took those courses, but I felt the same— especially in physics and proof-based math classes it felt like every problem was new and none of the practice problems prepared me for it. \n\nI will say that there are a lot of studies on learning that show that this is common for novices, and experts are better able to sort problems and see the similarities. The teachers probably do think that the test questions are very similar to the psets, even if it might not appear to be similar to you. \n\nThis is something that working through many different problems could help with (not just spending more time on a handful of problems) so eventually you might have seen ones closer to what shows up on the test. That’s what helped me in undergrad with physics— I remember the night before a test doing a practice test and feeing like I didn’t know how to do anything, but then on the test feeling like every question was basically the same as the practice test and now I knew what to do. For the proof-based pure math classes, I never did figure out how to prepare for those tests and so once required classes were out of the way shifted towards more applied classes. Interestingly, my husband also went to the same college and took the same classes with the same teachers, and his recollection of these math classes is that the tests were very similar to the homework in the approaches he used. So that’s the difference between someone who really understands the material and someone like me who did only at a very superficial level. \n\nAnother approach might be to take a more metacognitive approach and book some time with your TA to go through some psets together and ask them which problems are the same, and what’s similar in their  approach to take on a few of the problems that don’t seem the same to you but are considered the same category to them. If they can make their thought process explicit it might give you some insight into how to approach things.",
            "score": 6,
            "author": "thatwouldbeawkward"
        },
        {
            "level": 0,
            "comment": "Understanding physics is like getting to know a person, and you dont get to know a random person over just one coffee hangout.",
            "score": 2,
            "author": "Minute_Juggernaut806"
        }
    ]
}