{
    "id": "u3nwe0",
    "score": 11,
    "title": "Which introductory biology class is best for a math major?",
    "author": "Neat-Delivery-4473",
    "date": 1649960612.0,
    "url": "https://www.reddit.com/r/mit/comments/u3nwe0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m going to major in math (and possibly also physics) and I’m really not a fan of biology. It’s great that some people like to study it, but to me it seems like too much memorization and not enough math. Does anyone know which introductory bio class would be best for someone who’s more mathematical and just not that into biology? \n\nAlso, I should note that my school didn’t have AP bio (I took GT), so my preparedness for MIT’s biology classes is probably not that great.",
    "comments": [
        {
            "level": 0,
            "comment": "I took 7.016 as a freshman and thought it was chill, though I was more into bio at that time and had a lot of background from high school. I remember one professor being really good and the other being terrible and psets being relatively infrequent and quick to do, though that was fall 2016 so it definitely could have changed. iirc 7.016 was the most chemistry-oriented, though they may have changed since then",
            "score": 4,
            "author": "Ok-Wait-8465"
        },
        {
            "level": 0,
            "comment": "I don't think it matters too much. I took 7.012 and it was interesting. I don't think any of the intro bio classes will be very mathematical but at least it was more logic and less memorization compared to my AP bio class in high school.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "None of the bio's are more \"mathematical\" than the others in the sense that there are more... calculations. \n\nYou will also have obvious biases/limitations in these responses, as anyone who took one of the 7.01x classes will NOT have taken the others, so cannot accurately compare amongst the set. I took 7.013 and I found it challenging and pretty problem-solving based vs. just rote memorization.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}