{
    "id": "u92lg4",
    "score": 15,
    "title": "Is there anything important to know about Macgregor house?",
    "author": "Neat-Delivery-4473",
    "date": 1650590012.0,
    "url": "https://www.reddit.com/r/mit/comments/u92lg4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a prefrosh and I’m trying to decide which dorm I should put as my top choice for next year when housing stuff comes out, and I think I really like Macgregor house (partially because I need a single because I have trouble sleeping, and also because I want to cook for myself most of the time). Is there anything really important to know/anything you wish you knew about Macgregor house before making a decision on whether to put it first?",
    "comments": [
        {
            "level": 0,
            "comment": "I am a Macgregor alum! It is a great place to live, suite style is the best and there is huge cultural diversity between entries. Most of my current closest friends I met at Macgregor house. \nThe only things I didn’t like about it were the kitchens are really small, very little counter space. There’s no air conditioning. And one thing I had to get used to was that every bathroom is unisex but they have urinals.\nAnother quirky thing is that the elevators make no sense, they go to every 3 floors. So I got used to walking up stairs a lot which was probably good for me anyway but very bizarre.\nIf I had to do it again, I’d definitely pick Macgregor first. I had an amazing view of the river, the best suite mates, and my own private space that was all mine.",
            "score": 9,
            "author": "ainezm",
            "replies": [
                {
                    "level": 1,
                    "comment": "i second this answer. only thing i have to add is the doors aren’t soundproof to the hallways",
                    "score": 2,
                    "author": "grannysmithapple2"
                },
                {
                    "level": 1,
                    "comment": "G entry alum here!  Our suite was all female, so our bathroom was single sex. I think one of the nearby suites in F entry was all male.  This was back in the early 2000s but I imagine they still exist.  So yeah if the shared bathroom thing weirds you out (like me) there are probably options still!",
                    "score": 2,
                    "author": "hoopKid30"
                }
            ]
        },
        {
            "level": 0,
            "comment": "depending on the floor, the view is really nice.",
            "score": 7,
            "author": "whymauri"
        },
        {
            "level": 0,
            "comment": "I'd second everything that's been said so far. One thing that might be important is that it is a bit older/less renovated than some of the other dorms, if that matters to you (although that hasn't really been an issue at all for me this year).\n\nAnother thing is that the amenities are quite nice -- the gym is bigger than most dorms' gyms, the game room is really nice (esp for watching movies with groups), and I find the study room to also be really well designed/furnished.",
            "score": 1,
            "author": "vedadehhc"
        },
        {
            "level": 0,
            "comment": "counterpoint -- i'm also a macgregor alum (all 4 years),  and the singles-only style of living breeds a culture of isolation. while it's true that some entries are more social than others, on the whole I think it's worse than a floor-style culture you might get in other dorms.\n\nimho if i had to redo, i'd go somewhere else.",
            "score": 1,
            "author": "Cixelyn",
            "replies": [
                {
                    "level": 1,
                    "comment": "How much do you think that affected your overall experience? Like did you still feel like you were able to find a good community that you could fit into, or was it a lot harder because of the lack of floor culture?",
                    "score": 1,
                    "author": "Neat-Delivery-4473"
                }
            ]
        }
    ]
}