{
    "id": "vh11ao",
    "score": 17,
    "title": "Dear english majors at MIT, what is your story",
    "author": "danielyoo65",
    "date": 1655773908.0,
    "url": "https://www.reddit.com/r/mit/comments/vh11ao",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a hs student who loves stem, but suddenly have gotten a large interest in writing. I just wanna hear your guy's perspectives of writing and how you came to love it.",
    "comments": [
        {
            "level": 0,
            "comment": "I did the writing major with a minor in biology! (21W science writing track / 7m)\n\nI took a class on Science Journalism during my freshman fall and realized that my interests in biology and writing could go together. It is fun to always learn new things, talk to scientists about their work, and share those stories with a general audience. I also took a lot of creative writing classes— that’s my favorite thing to write, but it’s less employable. I took classes on writing short stories, science fiction, memoir writing, &amp; world building. For science writing, I took classes on journalism, nonfiction essay, video production, internship-for-credit, plus some science history and science, technology and society (STS) classes. \nI had a summer research job in a synthetic biology lab, which showed me that I do not like lab work. \n\nEven if it’s a bit weird to study writing at MIT, I think that MIT was still the right fit for me as a person and a student. It was awesome to be around so many like-minded nerds, and it was helpful to get exposure to the job-seeking mindset of MIT. I was able to apply that mindset to search for internships in communications and journalism, and it worked. :) \n\nI graduated in 2019, did journalism for a few years, and now I do biomedical writing for the government, and have a side gig writing episodes of SciShow.",
            "score": 20,
            "author": "imgonnahatethislater",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm an older alum who was also 21W, and I agree completely with you that it may seem weird to study writing at MIT, but it was definitely the right place for me. I walked out of there with a terrific writing education *and* a terrific science/math education, have co-written several non-fiction books, and have zero regrets about what I studied.\n\n(edited to fix italics)",
                    "score": 11,
                    "author": "nonelvis"
                },
                {
                    "level": 1,
                    "comment": "Are there any classes you'd recommend for students working towards an academic science career that want to improve their writting?",
                    "score": 3,
                    "author": "ChopWater_CarryWood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure! It probably depends on what sort of writing you expect to do— in course 7, the intro lab class (7.02) had a 6 unit component all about reading and writing papers, so that’s all I did for academic writing. \n\nThe Writing &amp; Communication Center and some individual departments have additional resources for academic writing. Looking at the course catalogue, it looks like there are new classes available from when I was there- “21W.220[J] Foundations of Academic and Professional Writing (ELS) (New)” might be of interest?\n\nIf you’re looking for classes other than academic writing, I really enjoyed the genre fiction classes (anything with Junot Diaz or Prof. Lewitt), and 21W.777 Science Writing in Contemporary Society (which is about science essays and nonfiction books for a general audience) could be a good fit. \n\nTaking any writing class that you think you’d enjoy, and participating in workshops, will improve your writing across all areas imo!",
                            "score": 2,
                            "author": "imgonnahatethislater"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There isn’t an English major, but there is a literature major (21L) and a writing major (21W) https://mitadmissions.org/discover/the-mit-education/majors-minors/\n\nI don’t know any literature majors but I know a couple people who had writing as a double major. Most of them took a few writing classes to fulfill humanities requirements and just fell in love with the subject. I think they’re generally pretty happy with the choice. One had bioengineering as their other major and ended up in an MD/PhD program, and the other had philosophy as their other major and went on to do a graduate degree in poetry. (I believe she came in intending to major in math and/or physics though so both of these were something she switched to.)\n\nI didn’t major or minor in either field, but I did take a few literature classes while I was there and minored in Spanish which had some overlap. Personally I loved all my humanities classes at MIT, even though they’re not something I want to do my career in. I found them to be pretty chill but also engaging. I took one literature class where we read a bunch of plays and got to go to several productions, and they also have literature classes abroad over IAP (January period) that they offer financial aid for. Overall I thought the humanities selection and the flexible humanities requirements were great though and felt like there were a lot of opportunities to engage with them even though I was a STEM major\n\nEdit: I also had a couple friends who did a combined major (21S or 21E) where some requirements are from a science (for 21S) or engineering (for 21E) major and some are from a humanities major (one of the two friends I’m thinking of did 21W as their humanities half I think). I know they had advisors in both of the fields they picked, and they seemed to enjoy it overall though I don’t know too much about the program",
            "score": 7,
            "author": "Ok-Wait-8465"
        },
        {
            "level": 0,
            "comment": "I am class of '79. I went to MIT intending to be a Math major (course 18) and wound up graduating with my BS in Course 21 with my concentration in Literature. The way I explain it to non-MIT people is that I have the equivalent of a Math major from any other school - I indeed have more math and science courses than my daughter-in-law who was a math major at Virginia Tech and more total stem courses than most stem majors. (I also edited the poetry journal at the time, Rune.)\n\nWhat did I do with it all? I've spent almost 40 years as a Civil Rights lawyer. Everything from direct client representation to writing Amicus briefs in the Supreme Court for national organizations. I've put the STEM background to work analyzing research papers and doing creative big-picture legal thinking. Looking back, I think the combo of math and poetry was the perfect training for the kind of legal writing I became known for in my career-- where every word has to count, your analysis has to be impeccable, and your arguments will win the day on something important. \n\nJust to be clear, you don't have to go to MIT to be a great lawyer or writer. Just, it was a lucky start for me.",
            "score": 7,
            "author": "Silver_Valley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yay Rune! I loved editing Rune when I was there",
                    "score": 2,
                    "author": "Ok-Wait-8465",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You made my day! So thrilled to hear from someone else involved!",
                            "score": 2,
                            "author": "Silver_Valley"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's not an English major",
            "score": 13,
            "author": "KatAndAlly",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is, however, a ScB in the Humanities. You still have to do the two terms of math, two physics, one chemistry and a lab.\n\nA friend of mine [did that](http://catalog.mit.edu/subjects/21w/). He became a writing instructor at MIT.\n\nIt never hurts to be good at more than one thing.",
                    "score": 12,
                    "author": "jeffbell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes, that's a good path. I've worked as the go-between for scientists/doctors &amp; the general public all my life &amp; there has never been a dearth of work for me.",
                            "score": 2,
                            "author": "KatAndAlly"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\\*literature",
                    "score": 3,
                    "author": "danielyoo65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[http://catalog.mit.edu/subjects/21l/](http://catalog.mit.edu/subjects/21l/)\n\n~~Apply as~~ ^(Consider) a double major, perhaps.  Or maybe in [http://catalog.mit.edu/subjects/sts/](http://catalog.mit.edu/subjects/sts/)",
                            "score": 3,
                            "author": "jeffbell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don't apply as any major",
                                    "score": 6,
                                    "author": "shackleton__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oops, right.",
                                            "score": 1,
                                            "author": "jeffbell"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can always concentrate or take classes in the 21 HASS courses (of course, in addition to your major). Lots of options there (including studying foreign literature).",
            "score": 2,
            "author": "ArghBH"
        }
    ]
}