{
    "id": "w3sgx4",
    "score": 0,
    "title": "Why doesn't MIT 6-3 have a required course on functional programming?",
    "author": "LifeCanBeGoody",
    "date": 1658338768.0,
    "url": "https://www.reddit.com/r/mit/comments/w3sgx4",
    "media_urls": [],
    "other_urls": [
        "https://csd.cmu.edu/academic/undergraduate/bachelors-curriculum-admitted-2018](https://csd.cmu.edu/academic/undergraduate/bachelors-curriculum-admitted-2018)"
    ],
    "postText": "People say that functional programming broadens your mind as a programmer.\n\nMIT was the birthplace of SICP. They have stopped teaching it to freshmen for reasons quite understandable. But, why did they do away with functional programming entirely? Other schools like Cornell, CMU, Brown, Harvard, etc all have a course on functional programming that is compulsory for CS majors to take. MIT has no such course. Why? Even after the recent curriculum reboot, they didn't add any?\n\nEdit: I know there are courses that teach functional programming. The keyword in this post was \"required\" course. Like here: [https://csd.cmu.edu/academic/undergraduate/bachelors-curriculum-admitted-2018](https://csd.cmu.edu/academic/undergraduate/bachelors-curriculum-admitted-2018)",
    "comments": [
        {
            "level": 0,
            "comment": "I agree that students should be exposed to functional programming, but that doesn't necessary need to be an entire dedicated course. Does functional programming not show up anywhere in the required curriculum?",
            "score": 10,
            "author": "fathan"
        },
        {
            "level": 0,
            "comment": "CS is a massive field. If there was a required course on everything that at least some people think is important, it would be like a 10 year major.",
            "score": 4,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not in other unis that have that course. \n\nExample: https://csd.cmu.edu/academic/undergraduate/bachelors-curriculum-admitted-2018",
                    "score": -1,
                    "author": "LifeCanBeGoody"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't comment about the more recent curriculum, but Arvind used to teach a course, 6.827 Multithreaded Parallelism: Languages and Compilers, that covered functional programming.  Here's it is on [OCW](https://ocw.mit.edu/courses/6-827-multithreaded-parallelism-languages-and-compilers-fall-2002/pages/lecture-notes/).  It looks like that course is gone and has been replaced with: 6.827 Algorithm Engineering.",
            "score": 2,
            "author": "mian2zi3"
        },
        {
            "level": 0,
            "comment": "6.945/6.905 is still taught by Gerald Sussman, an author of SICP.",
            "score": 2,
            "author": "BarishNamazov"
        },
        {
            "level": 0,
            "comment": "There is 6.820: https://ocw.mit.edu/courses/6-820-fundamentals-of-program-analysis-fall-2015/pages/lecture-notes/",
            "score": 1,
            "author": "DREAMINGOF_WAFFLES"
        }
    ]
}