{
    "id": "wchd4i",
    "score": 0,
    "title": "Anyone want to temporarily sublet to a visiting student?",
    "author": "onlyClimbLead",
    "date": 1659246041.0,
    "url": "https://www.reddit.com/r/mit/comments/wchd4i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a freshman from Canada (UWaterloo CS) visiting Boston around Oct 6-16 during my reading week. Looking for perhaps an option to rent someone's room (or part of it) temporarily during my stay. Do you guys think this is doable?\n\nEdit: I am female",
    "comments": [
        {
            "level": 0,
            "comment": "You're not going to find a sublet for those dates. Most people wont sublet their place unless they're gone for a least a month, and there's no reason someone would be vacating their apartment for just some random days in October since that's not a school break here.\n\nYou should look at hotels and AirBNBs. The earlier you book the better prices will be (though be aware they are still not cheap around here). Holding out for a sublet is IMO unrealistic.",
            "score": 6,
            "author": "purplepineapple21"
        },
        {
            "level": 0,
            "comment": "Checkout Facebook marketplace or the MIT Harvard Housing group. Maybe some other Boston housing groups too. There are usually people subletting their rooms for months, sometimes weeks. Though I think the odds for those specific dates would be incredible low. If all else fails, Airbnb a room.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh that’s really helpful. Will check through Facebook then. Thanks for the tip!",
                    "score": 1,
                    "author": "onlyClimbLead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want to crash on an air mattress in an undergrad’s room in the all-women’s dorm I’d be up to host but it’s not luxury - you’re better off with a hotel stay if you want a full room to yourself",
            "score": 1,
            "author": "MiuMii2"
        }
    ]
}