{
    "id": "y6x4pg",
    "score": 11,
    "title": "WHY IS EC GETTING RENOVATED???? CAN SOMEONE MAKE IT STOP???",
    "author": "thunderingluck",
    "date": 1666068496.0,
    "url": "https://www.reddit.com/r/mit/comments/y6x4pg",
    "media_urls": [],
    "other_urls": [],
    "postText": "EOM",
    "comments": [
        {
            "level": 0,
            "comment": "Create a big hole in the wall and take a big whiff. Wait a day, and go to urgent care and ask them to check your lungs. Does that explain why?",
            "score": 6,
            "author": "rbxVexified"
        },
        {
            "level": 0,
            "comment": "Talk to Burton Conner people to see how they're working to preserve the culture - lots to learn given the disgusting behavior we're seeing from the current administration.",
            "score": 8,
            "author": "lukesta5"
        },
        {
            "level": 0,
            "comment": "Because it's fucking falling apart and is decades out of date with modern building codes. Bexley refused to let MIT renovate, and so it got so bad that the Cambridge city building inspector condemned it. That's your other option.",
            "score": 4,
            "author": "maestro2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have a cite about that? \n\nhttps://thetech.com/2013/10/18/bexleydemolition-v133-n46 says MIT was alerted to problems by its own engineering report, rather than the city, and MIT decided it was beyond repair. \n\nAnd I'd be very surprised if MIT allowed \"Bexley\" (meaning its students?) to refuse renovations.",
                    "score": 6,
                    "author": "bilingualbeaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, so it was an MIT inspector. Small detail. Point still stands. Options are:\n\n1. Renovate\n2. Demolish\n\nThere is no third option to continue to live in a building that's rapidly becoming a safety hazard.",
                            "score": 1,
                            "author": "maestro2005",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I found a document online that said that flashing had been mis-installed on the Bexley roof parapet, and was driving water into the walls. The bricks were crumbling under the roof rafters, and the roof was about to fall into the top floor. The building was indeed unsafe. (I cannot find the document again.)\n\nRepairs would have cost enough to require bringing the building up to current building code. Which was prohibitively expensive, and would greatly reduce its capacity.\n\nAfter that fiasco of losing a building through ineptitude, I noted that MIT put a lot of *very careful* work into repairing and repointing the bricks on the DuPont Armory and the Metropolitan Storage Warehouse. Maintenance matters, and has to be competent.",
                                    "score": 7,
                                    "author": "email1976"
                                },
                                {
                                    "level": 3,
                                    "comment": "The bigger point was that you blamed Bexley students for the demolition by claiming they refused to allow renovations. That's not at all what happened.",
                                    "score": 4,
                                    "author": "bilingualbeaver",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh it absolutely is. For years they fought hard to keep incremental repairs from being made. I know, because I know some of the people who did this. And perhaps the eventual decay of the building was inevitable, but they also completely declined any efforts to preserve their culture by refusing any option other than doing nothing and continuing to live there. MIT tried to offer options that involved keeping big chunks of the population together in other buildings (there was of course nowhere big enough to house everyone together), but they refused, so they got nothing. And then they blamed the administration for supposedly hating students and student culture. It's the East Campus cycle of self destruction. I've seen it over and over again.\n\nAnd now we have an OP who is only asking that necessary renovations not happen at all, and the building be allowed to continue decaying.\n\nAt just about any other college in the country, if a dorm needed renovations, the administration would just say, \"okay, everybody out\" and not care whatsoever about any fallout. MIT has actually been pretty incredible at trying to provide options during renovations. And yes, sometimes old people (who may not have ever gone to MIT) may be out of touch, but there's a level-headed, mature way to address that and negotiate, but it can't happen if the students are being immature buttholes and making unreasonable demands.\n\nIt's not the students' fault that an old building needs repairs, but it is absolutely 100% their fault if they act like morons and end up getting the worst possible deal because of it.",
                                            "score": 1,
                                            "author": "maestro2005",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'll ask again if you have a cite that students prevented the renovations. No news stories mentioned that. And I'd be very surprised if MIT deferred to student opinions about not making needed repairs until it reached the point where the building couldn't be saved.\n\nThe [administration sure did say \"okay, everybody out\"](https://thetech.com/2013/05/10/bexleynews-v133-n25) in May 2013 when they planned to do renovations. Later they decided it couldn't be saved.\n\nAlso what were the offered options to preserve their culture which the students declined? https://thetech.com/2014/01/31/bexley-v133-n65 says the only option was to move into other dorms split up with just a few Bexiles per dorm. I hadn't heard anything about students declining to make use of this option. \n\nThey also provided Pritchett as a social space, which students did use, as they got in trouble for the content of the posters they put on the walls.",
                                                    "score": 3,
                                                    "author": "bilingualbeaver"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "BEcause itS a SHITHOLE",
            "score": 1,
            "author": "FitResult1592"
        }
    ]
}