{
    "id": "13ufm2n",
    "score": 0,
    "title": "How do you mentally deal with plagiarism?",
    "author": "instantcarrot",
    "date": 1685319485.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13ufm2n",
    "media_urls": [],
    "other_urls": [],
    "postText": "I mean, example a certain group releases bangers. One day the artist is caught plagiarizing another group and when accused, the idol admitted and apologized. \n\nThe group plagiarized is also one of my ults and now I just have a lot of difficulty getting past the plagiarism and even listening to the songs of the idol that plagiarized... but I really like their music and the idol only plagiarized once. So what to do? Has it ever happened to you?\n\nEdit: structures i didn't like.",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t care. It’s for the artists to hash out. Usually it’s unintentional. If they’re a repeat offender maybe I’d think twice, but meh.",
            "score": 37,
            "author": "GrillMaster3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sums up how i feel i let the artist hash it out and keep on enjoying my groups, but then i hate kpop drama and ignore 99% of it. I just enjoy kpop and try and avoid the drama parts.",
                    "score": 10,
                    "author": "Azhrei_Rohan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most of the time, the proven plagiarism was an inadvertent mistake. As long as they addressed it and made it right, I'm ok.\n\nHowever, there are many who are just being accused of plagiarism by antis and I ignore those.",
            "score": 24,
            "author": "Season-Euphoric"
        },
        {
            "level": 0,
            "comment": "Most cases of \"plagarism\" are done by antis who don't understand how musical theory and copyright laws work. There are only so many chords and melodies that can be performed by people on instruments that exist and fewer ones that most humans find enjoyable. You can find modern songs that use the same chords and melodies used in classical music over 2 centuries ago. Memories by Maroon 5 is heavily based on Canon in D is just one example. \n\nThis is an [example](https://www.youtube.com/watch?v=5pidokakU4I&amp;t) done for comedic sake, but you can see how many songs use very siimlar chord progression. I'm aware that these songs shown use the same four chords but in different progression in their actual songs. Other [examples](https://en.wikipedia.org/wiki/I%E2%80%93V%E2%80%93vi%E2%80%93IV_progression).",
            "score": 25,
            "author": "MadamBeramode",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be honest that video you linked is pretty impressive 😁 \n\nUnfortunately it was a very similar chorus and it had the same melody. Later, it was known that the original producer declined to have his song sampled or something like that, but the idol still used it. The idol and the company also apologized for it.",
                    "score": -5,
                    "author": "instantcarrot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to be in a similar situation earlier where I enjoyed and really respected an artist that plagiarised a favourite group of mine and I couldn't really get past that for a really long time.\n\nAs more and more people (from other fandoms actually) started pointing out how the artist has repeatedly [drawn \"inspiration\" ](https://www.reddit.com/r/kpopnoir/comments/twffzv/so_are_we_gonna_talk_about_my_bag_being_a_carbon/)for rap flows from Western artists too, I've realised that they really aren't *that* amazing as I thought and is human and bound to make erorrs (?).\n\nAs a creative person I understand how easy it is to like something but completely forget it and then use it in your own work thinking that it's your own idea when it actually isn't.\n\nThey probably didn't have a malicious intent behind it, but on the other hand, as someone who's on a global stage and lots of fans they definitely have more responsibility to be careful and responsible than me who just does it for fun/hobby ig.\n\nUnderstanding both sides of the issue and placing myself in the artists shoes has helped me move on from it and enjoy both artists without an issue. (Although these days one of their music isn't really doing it for me so it definitely makes it easier.) \n\nI'm sure the artists have moved past it too and if it doesn't bother the artists much, you've said that they apologized so... I think it's okay to let go of that guilt and just enjoy what you like. If it bothers you a lot though, (and that's valid too!) I suppose you can find other groups to enjoy since there are tons out there and just ignore the group forever. \n\nAlso, definitely stay away from fandom drama. I feel like both sides can get over protective and hyper critical sometimes. \n\n Good luck.",
            "score": 5,
            "author": "pyeongHongman"
        },
        {
            "level": 0,
            "comment": "Speaking as a musician, art is inherently derivative and just about any piece of music can be likened to something that\\`s already been created. *edited to add: this sounds like soyeon making a song for my teenage girl that sounds like an ateez song. In that case I'll link* [this video](https://www.youtube.com/watch?v=165kMdtfp00)*, there are only so many sequences of notes that make sense within an arrangement, and it's not uncommon to subconsciously create something that's already been done.*\n\nWhen it comes to Eric from the boyz, his solo song ended up being unintentionally plagiarised of a BAP song (producer was an idiot and didn\\`t realise what he was using), but the fact that the song is still up and Eric himself, to my knowledge, has not acknowledged the situation at all shows a lack of integrity and respect for fellow artists. Although I like some the boyz songs I wouldn't stan them or look further into their discography because of this.",
            "score": 18,
            "author": "mapleleafmaggie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree that art will repeat itself at some point and I wish I was talking about that but it was a similar chorus and the idol did say though that they had the melody in the back of their head, but didn't know it was already a song. She must had heard it before but forgot about it.\n\nI mean she admitted to it, so they did plagiarized, but I just hope it's not an excuse and it's actually what they say it was. \n\nNonetheless it's like Eric's song for you, though she admitted to it, I have a very hard time enjoying their music now 🙄",
                    "score": -14,
                    "author": "instantcarrot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It has never happend to me but, i honestly don't care, I only hear music because it sounds good, I really don't put attention on the lyrics, so I wouldn't have a great impact on my mental health.   \nbut, in case it really affects you, stop hearing the song for some time until you feel ready",
            "score": 3,
            "author": "Ordinary_Act_2837"
        },
        {
            "level": 0,
            "comment": "I mean it's up to you. Some people care a lot and would still boycott the song even if ammends are made, others could care less and will listen regardless.\n\nI've always been the kind of person to seperate the music from the artist if they do something I can't support, so I would probably still listen. I don't want to deprive myself of a good song just because of something behind the scenes.",
            "score": 6,
            "author": "Chaeji412"
        },
        {
            "level": 0,
            "comment": "I just put a blind eye. Probably not the best method for sure, but when Soyeon was caught plagiarizing ateez I just put a blind eye and assumed it was a mistake and never thought of it since.",
            "score": 6,
            "author": "_luwi"
        },
        {
            "level": 0,
            "comment": "Tbh I never fully got over it either. I was a fan of Soyeon and her work long before I even knew ATEEZ and it still rubs me the wrong way when I think about it. Tbh her apology was the only saving grace of the entire mess which has now been taken down by the company/herself. \n\nThey still haven't given proper credits to the producers. https://twitter.com/atzyh_hwasu/status/1537987103891783680?t=A1Tdvt6bptlYWAMRCpXNcA&amp;s=19\n\nCube said that they KNEW beforehand that KQ didn't approve the song to be released but they did it anyway so 😬 meanwhile KQ said that they weren't even contacted before hand. And the fans of the group have been nothing but dismissive about the whole situation, some even deny it is plagiarism or claim that the Ateez producers have plagiarised someone else, so all of this just leaves a very bad taste imo.\n\nI still listen to their songs sometimes (the recent ones not so much because I don't find them to my liking) but I definitely don't have the same kind of respect I had for her initially.",
            "score": 2,
            "author": "soulmatz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Considering over a year has passed and neither side has brought it up again, isn't it reasonable to assume the issue was resolved behind the scenes? We can't know what happened unless they say anything publicly but it's been a year, I'd like to think it was resolved to some degree. Not saying how you should feel about the controversy, but this is in response to \"they still haven't given proper credits to the producers\". Maybe they don't want the credits and decided it was water under the bridge.",
                    "score": 7,
                    "author": "jjongjjongiefan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it is more reasonable to assume that they've decided to move past it rather than issue being resolved behind the scenes because the official statement from KQ was that they have never been contacted regarding this and even the Melon site wrongly shown as EDENARY when it's supposed to be Eden, Leez, Ollounder. I think kpop companies especially smaller ones tend not to make such things bigger and prefer to move past it and that's probably what's happened.",
                            "score": 1,
                            "author": "soulmatz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you serious? It took some time to register that song. The producers didn't even want to be credited, but instead wanted the song to be changed, which couldn't be done, because it was too late and that song was for the finale of survival show. They could've easily paid them off bts. Or not at all. It's up to the companies and producers. People who work with Ateez producers also work with Soyeon. She made a mistake and apologized for it. I agree that fans who dismiss this issue are annoying, but judging someone besed on 1 mistake isn't correct. In her apology  Soyeon said that she personally apologized to the producers.",
                                    "score": 1,
                                    "author": "HellslayerwithbigP"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it definitely tarnishes an idol's image if they are well-known for being a songwriter but plagiarized another group's music. They do, however, deserve the ability to prive they have learned from a mistake or bad choice and not do it again. I think in cases like this once an accident, twice is concerning, and anything more is a severe problem that needs to be properly addressed by the agencies.",
            "score": 2,
            "author": "hawkandthrush",
            "replies": [
                {
                    "level": 1,
                    "comment": "It did tarnish the image of that idol which I had an immense respect for before. I guess it didn't help that it was my ults. Sighs, i tried viewing it as an accident, since it happened once so far, but it's kinda hard like the resentment is still there.",
                    "score": -3,
                    "author": "instantcarrot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If this is about what I think it’s about (I’ll respect your vagueness) I’m in the same boat, I can’t look at the person/group that plagiarized the way I used to, I’m much more critical of them and their music (read: more hesitant to listen/enjoy their new songs). It just sucks, but I like one group more, so I focus my energy on them and when the other group has comebacks, I check them out but if there’s anything I don’t like about the title track I don’t bother with checking out the rest of the songs.",
            "score": -3,
            "author": "cippocup",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's insightful thank you! \n\nI do the exact same thing. Of course I do respect the artistry but it's tough enjoying any product that comes out of the same person that hurt one of my ults and the fandom too, the producer, the whole drama too was tiring. Plus I do not respect plagiarism.",
                    "score": 3,
                    "author": "instantcarrot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems others do not enjoy my take, but I’m glad I could offer validation for you feelings. You don’t have to like anyone, no matter what Kpop fans say, you’re enjoying things for yourself, not for them.",
                            "score": -2,
                            "author": "cippocup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There hasn't been a lot of views on my post so understandable. But thank you, I actually feel better knowing it's not as ridiculous as I thought (it's no big deal but it still has been in the back of my mind for months now). Opinions will vary too, I see some don't mind plagiarism as long as it's addressed and it happens once. We feel a different way. It's okay! Thank you for your input again!",
                                    "score": 3,
                                    "author": "instantcarrot"
                                },
                                {
                                    "level": 3,
                                    "comment": "The post and anyone having a similar take to yours is being downvoted like crazy so it's not just you. Just typical fandom behaviour.",
                                    "score": 0,
                                    "author": "soulmatz"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly I’d look past it if the one who committed plagiarism apologised and moved on but from the hints from your post cough sy cough, she is still gaining profits from the song going as far as to re register on platforms so in that case no, I cannot listen to them ever again",
            "score": -2,
            "author": "Taegiatz",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;she is still gaining profits from the song going as far as to re register on platforms so in that case no, I cannot listen to them ever again\n\nThose profits aren't that big in the first place. The song is mainly known for its plagiarism. The producers of Wave could've easily contact KOMCA and change the credits. The song was registered months later after the scandal. Do you actually know what KOMCA is? It's not some random page where you could easily add random people. Do you seriously think that CUBE/Soyeon or Komca didn't contact KQ and the producers for their approval?\n\nEDIT: Also Soyeon or Pop Time can't really take down that song, because it was made for the show. MBC has rights to that song. You can't just randomly delete or simply change a song that was already used for a show, where the trainees who sang that song are already eliminated and don't have any contract obligation to rerecord that song again. MBC even capitalized on that controversy.",
                    "score": 0,
                    "author": "HellslayerwithbigP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I did explain in the follow up comment about the incident. It’s very weird of them to keep the song months after they sorted out the incident with the producers, and it’s also weird how they re registered the song months and not immediately after they contacted each other? Anyways the way cube and their artist handled incident was messy and unprofessional on their part",
                            "score": 0,
                            "author": "Taegiatz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How is it weird. They definitely made a deal for that song to be used, because as I said it was already used for the show. If they've already made a deal then why would they take down that song? It's not weird at all. It happens in music industry all the time. Either the producers didn't consider it as a huge deal or Cube just paid them off. Cube pr team sucks ass, but this time I don't see the problem of them re-registering it. The issue was solved based on the silence between these two. Also, it took some time for that song to be registered, because either 1) Komca/Cube/Soyeon had discussed this issue with KQ/producers, so of course it would take some time or 2)They already settled the issue, but were afraid of bigger controversy while promoting Tomboy.",
                                    "score": 0,
                                    "author": "HellslayerwithbigP"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "she initially added them without consulting before her apology and then removed them after consultation, the song wasn’t registered for months only to be registered again under sy and pop time",
                            "score": 8,
                            "author": "Taegiatz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stand corrected",
                                    "score": 1,
                                    "author": "flushedawayegg"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "False. \n\nOn KOMCA, only Soyeon and Poptime are mentioned. There's no mention of the original ATEEZ song composers Eden or team.  They don't get any credits or royalties for this song.\n\nhttps://ibb.co/pn8cPFN",
                            "score": 3,
                            "author": "soulmatz"
                        }
                    ]
                }
            ]
        }
    ]
}