{
    "id": "13usiza",
    "score": 2,
    "title": "Photocard trading safety",
    "author": "queenmichimiya",
    "date": 1685360633.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13usiza",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I want to get into photocard trading, but I have had one main concern for a while.  In order for the person you're trading with to send you a pc, they need your address and you need theirs.  How safe is it to give your address to people online, and wouldn't it be easy for someone to exploit the trading system to find out where people live?  I don't mean to sound rude or paranoid but the idea of just handing out my address to people I don't know scares me a little even though I really do want to get into pc trading since it seems fun and a great way to grow my collection and get my hands on pcs I really want.  What have y'all's trading experiences been like and have you always felt safe throughout the process?",
    "comments": [
        {
            "level": 0,
            "comment": "i've done many sales/trades before on instagram and i used to be pretty nervous about giving out my address at the beginning but i guess it's just based on mutual trust that all people involved only use the addresses for sending out the pcs. i've never had any problems and everyone i've interacted with has been super nice! people just want their pcs lol\n\nif you're worried i'd just advise buying from or trading with people who have lots of proofs and positive feedback. i've also seen people say they unsend their addresses (on instagram) after the sale/trade has been completed so doing that might make you feel safer?\n\nif you've ever bought from sites like depop the premise is pretty much the same and you have to entrust these sellers with your address too. i've always felt safe trading, just be as cautious as you normally would be online and make sure the people you trade with have previous proofs and you'll be fine!",
            "score": 6,
            "author": "cosmicrailways",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see, thank you!  Regarding your comment about trading with people who have lots of proofs, do people usually post proofs as posts or on story highlights or how exactly does that work?  I always figured proofs would just be DMed to the person they're trading with (sorry idk how any of this works).  Thank you for all the advice!!",
                    "score": 1,
                    "author": "queenmichimiya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no worries! it can be pretty confusing at first so i'm happy to help!\n\nif you're using instagram people generally do post their proofs under story highlights - these proofs are usually messages from people they've sold to confirming the item has arrived (and usually the person doing the selling will have their @ somewhere in the proof to confirm it's theirs), or sometimes the proofs might be reviews from other platforms they've used to sell. \n\nyou can always dm to ask for proofs if they don't have them in their highlights :)",
                            "score": 3,
                            "author": "cosmicrailways",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ahh, OK, thanks!",
                                    "score": 1,
                                    "author": "queenmichimiya"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey!\n\nif you have the money then you could purchase a P.O. Box but that’s like 40 bucks a month so it depends on how much pcs you sell and if you can add it into your cost\n\nI can’t say for insta where there’s no management but on mercari I’ve purchase and sold items and I haven’t been worried at all. like the other commenter said, use people with lots of proofs",
            "score": 3,
            "author": "Top_Cockroach652"
        },
        {
            "level": 0,
            "comment": "I use a po box and I don't give out my last name, just the initial. This has helped my worries a lot and I've never had an issue.",
            "score": 3,
            "author": "A_Blank_Space",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the tip!",
                    "score": 2,
                    "author": "queenmichimiya"
                }
            ]
        }
    ]
}