{
    "id": "13x4d5s",
    "score": 0,
    "title": "So I just pulled a twice member photo card in the new Twice JP album-does that mean I get to video call that member?",
    "author": "One-Contribution9189",
    "date": 1685582528.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13x4d5s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I swear it used to mean that. If so? What do I do to redeem it?",
    "comments": [
        {
            "level": 0,
            "comment": "no? i'm pretty sure you just have a photo of a twice member now, nth to redeem",
            "score": 17,
            "author": "7pau"
        },
        {
            "level": 0,
            "comment": "lol i don’t think it works like that in kpop, even if this was a japanese album. never heard of that being a thing because most if not all albums these days include a random photocard as part of the extra inclusions.",
            "score": 3,
            "author": "tulipbunnys",
            "replies": [
                {
                    "level": 1,
                    "comment": "It used to be how Twice’s hi-touch in Japan works. If you pull a member’s pc you get to hi-touch with that member during the event but it’s not the case for Hare-Hare. For this single, you apply the serial codes you got on the events that will be held in October (iirc) and there are multiple events you can apply to.",
                    "score": 6,
                    "author": "Gullible_Scratch_395",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was gonna say I’ve been into K-pop since 2012 and am probably one of the older fans in the sub. I think I know how most of it works lol. Just wondering whether this was still a thing.\n\nDo you have more info on this serial code thing?",
                            "score": 2,
                            "author": "One-Contribution9189"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless they've made some announcement as such, then I doubt it means that. If there's nothing like a QR code or instructions on the card as well, then it's not likely for redeeming anything. Albums typically come with at least one photocard, and usually one of the cards it comes with is by random draw, so you don't know which member you're getting until you open the album and find the photocard. Seconding that you probably just have a regular photocard now lol, do what you want with it. Most people keep them to collect, or resell them if they're not interested in keeping it. \n\nI'm also just curious how pulling a pc from an album can equal getting a fancall or fansign with the member? What if someone buys the album after the event has ended? Then it would take a lot of value off of a new sealed album, wouldn't it? Like if someone bought it new from the store still at it's full price, but after the event ended, they'd be kinda partially paying for something they can't even get/use (the opportunity for the fan call, or to be entered into a raffle for one, etc), right? Like I'd be really bummed out if I hadn't known about that event existing, and bought an older album like a year or more later, only to find that any codes or QR codes in it were for things that I couldn't even redeem anymore. Or do companies have a way of like pulling all those albums from shelves once the event has happened, and replacing them with albums that don't include a code card for the event?",
            "score": 1,
            "author": "Soup_oi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m aware of all this. Like I said in another comment. I’ve been into K-pop since 2012, collecting Twice since 2016. I know how K-pop photo cards work-this used to be a thing so I’m asking if it still is.\n\nTo your second half: Yep. That’s what happens a lot. I’ve gotten multiple twice Japan albums years or months after they came out and found the winning member cards-2 times it was my bias. So I could have had a fan all with them had I gotten them when they first dropped. Yes, I was devastated, haha.",
                    "score": 3,
                    "author": "One-Contribution9189",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohh sorry! I think there was only one or two other comments when I first was reading it before. \n\nThat's somehow so cool, but at the same time seems like it would lead to people being so bummed out later lol. Like drawing a winning fan call card that way seems more exciting than other ways I've seen (I think most of what I've seen have just been like buy something from official store, and you can be entered for your name to be pulled from a hat sort of way...and it's not really about anything you actually get in the merch itself), but I just like being surprised by what inclusions I find in albums sometimes, so maybe that's why I like that way. But yea, dang, I feel so bad both for people who get those albums way later and get the winning cards, and maybe even for the artists, if they're expecting or have been told like \"potentially x amount of people could be part of the fan meeting\" only for there to wind up being a lot less than that if not all the albums with winning cards have been bought or opened by someone by that point in time. Oh no! I'd be devastated too lol. Do they at least look enough like regular photocards, that you can still collect them and have them not look out of place with your other cards?",
                            "score": 2,
                            "author": "Soup_oi"
                        }
                    ]
                }
            ]
        }
    ]
}