{
    "id": "13xjd8f",
    "score": 244,
    "title": "is fifty fifty Cupid really everywhere in the US?",
    "author": "diosamaaaaa",
    "date": 1685630537.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13xjd8f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just as the title says. I wanted to know if it's everywhere just like oppa gangnam style was back in 2012 you know ? I'm not American so I can't really know. Cause wow I can't believe a rookie group can stay this long in the hot 100 and chart high too ! Plus they are eligible for the Grammy's and there is chance they can win isn't it insane ?",
    "comments": [
        {
            "level": 0,
            "comment": "Gangnam style was WAYYYYY bigger, and it’s not even close. Everybody in school was doing the dance. Cupid is popular on social media. I haven’t heard it anywhere in public tho, and I live in one of the populous areas in the US.",
            "score": 382,
            "author": "digimintcoco",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m confused why ppl are constantly asking how popular Cupid is. It’s peak on the Hot 100 is still only 17 (which is amazing for what was an unknown group at the time). Gangnam style peaked at 2, and probably would’ve been #1 if billboard had actually counted digital metrics properly at that point in time",
                    "score": 142,
                    "author": "superdrone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm shocked to learn Gangnam Style never made it to #1! Your message explains why though, but that was an interesting TIL  for me.",
                            "score": 17,
                            "author": "MicaLovesHangul"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. Gangnam Style was playing non-stop on the main American radio channels in the major cities. It was crazy to hear Korean music on American radio.",
                    "score": 21,
                    "author": "one_hyun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I haven’t heard it in public. I occasionally hear Blackpink or BTS songs, especially at like an Asian restaurant or boba shop.\n\nGangnam Style was absolutely everywhere as a meme when it came out. Kids and adults knew about it, people were dancing to it on news shows. Most people at least heard the name. Cupid is just a song, not a meme, so I don’t see any reason why it would blow up like that.",
            "score": 361,
            "author": "TheGrayBox",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard cupid in public like in malls and on the radio here",
                    "score": 145,
                    "author": "chibiyikes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’ve heard it on Sirius xm radio in my car. Not on any Asian channels, think it was a regular pop channel",
                            "score": 44,
                            "author": "magenta_mojo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here! Pretty sure it was Ryan Seacrest's show",
                                    "score": 11,
                                    "author": "VodkaAunt"
                                },
                                {
                                    "level": 3,
                                    "comment": "yes it impacted pop radio a couple weeks ago. so, to put it simply, you'll be hearing it on your local (or maybe not so local) top 40 pop radio stations.",
                                    "score": 6,
                                    "author": "bands_onhigh"
                                },
                                {
                                    "level": 3,
                                    "comment": "I heard it on Sirius as well, but it was a K pop channel. I’m sure it will soon be on Western pop channels too, if it isn’t already.",
                                    "score": 1,
                                    "author": "Branypoo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've heard it in public and I am super super rural!! It plays on our Top 40 radio and I've heard it in WalMart and Ollies!\n\nEdit: here have a video I just took!! https://files.fm/u/p5cqnbs5p",
                    "score": 42,
                    "author": "Piincy"
                },
                {
                    "level": 1,
                    "comment": "It's more popular in terms of being used in reels and stuff. Viral in that sense, not just as a meme video like Gangnam Style was. I hear it there all the time. I haven't really heard it on the radio or anything (I heard some Blackpink and BTS for sure).",
                    "score": 39,
                    "author": "sun-tzuyus-artofwar"
                },
                {
                    "level": 1,
                    "comment": "Rural Missouri, it’s here a lot. And I’m all for it.",
                    "score": 22,
                    "author": "LordNoodles1"
                },
                {
                    "level": 1,
                    "comment": "I live in the south and I still hear IU in some places 👀 but not fifty fifty.",
                    "score": 8,
                    "author": "rose-owner"
                },
                {
                    "level": 1,
                    "comment": "I heard Cupid in public too while I was shopping around at my local mall!",
                    "score": 16,
                    "author": "PandaRikako"
                },
                {
                    "level": 1,
                    "comment": "they play it at my sams club lmao",
                    "score": 24,
                    "author": "not_circumventing"
                },
                {
                    "level": 1,
                    "comment": "Kids had Gangnam Style birthdays, and it wasn't they had to find custom stuff, it was on the party supplies stores",
                    "score": 5,
                    "author": "Excellent_Apple1904"
                },
                {
                    "level": 1,
                    "comment": "I hear Cupid on the radio pretty much every day. Also Boba shops and Poke places run Kpop pretty often and Cupid/Twice/Ive/LSF are heard often",
                    "score": 8,
                    "author": "Simpuff1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canadian two cents here because our music trends tend to closely follow whatever songs are popular in the US. At least it does where I live, since I’m in the greater Toronto area.\n\nI’ve been pleasantly surprised to hear it in malls every now and then. I could’ve sworn it was on the radio once, but I could be wrong. \n\nI wouldn’t say it’s a huge, Gangnam Style esque hit though. I’d compare it to a lesser known artist who released a liked, but not rabidly obsessively popular song. \n\nAn example I’m thinking of is 2002 by Anne Marie; the song was popular on TikTok, and the singer isn’t a nobody per se, but not on the Katy Perry or Demi Lovato level of famous. 2002 was played a fair amount on radios and public places, but not enough to be considered the song of the year or anything. \n\nI’d say that Butter by BTS is closer to the level of popular that you’re asking about. And Butter wasn‘t a Gangnam Style type of hit either. It was just played often enough that people recognized it, which I don’t think Fifty Fifty has.",
            "score": 76,
            "author": "throw_theyay_away"
        },
        {
            "level": 0,
            "comment": "I mean at my school kids were constantly singing it and I would always think 'wait thats a kpop song', so imo its pretty popular at least where im from",
            "score": 17,
            "author": "Amberwllow"
        },
        {
            "level": 0,
            "comment": "for OP and anyone else outside of the US— america is a really really large country so people are going to have vastly different experiences. the comments here sound contradicting but that’s how it is. some radio stations or shops will be playing it all the time while others won’t, plus it depends on everyone’s music listening habits and who their friends/family are",
            "score": 70,
            "author": "AnneW08"
        },
        {
            "level": 0,
            "comment": "Here in the uk cupid is played all the time on capital which is basically the uk's main radio station, and it's been charting quite well too, and considering how similar the general music taste is in the uk and us i would imagine it's also the case over there too. However at the end of the day i don't live in the us so i don't really know for sure.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its UK chart history's here, for anyone interested: [https://www.officialcharts.com/artist/1473/fifty-fifty/](https://www.officialcharts.com/artist/1473/fifty-fifty/)\n\nTop 100 for 9 weeks, including 7 in the top 40. Peak position 8.",
                    "score": 8,
                    "author": "Substantial-Swim5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not even close, sorry. You couldn't possibly get away from Gangnam Style back in 2012. EVERYONE heard it, there were countless memes, and that's coming from someone who didn't know what kpop was at the time. it was THE song, bar none. \n\nMeanwhile, I'm not sure I've even heard Cupid once",
            "score": 101,
            "author": "NapQuing",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the thing, everyone knew Gangnam Style bc the whole thing went viral. PSY, the song, the video, the dance, everything was everywhere and of course, memes.\n\nCupid is amazing of course, and I'm 100% sure you heard it before (probably speedup lol), but it went viral through TikTok and short videos. Everyone knows the song but not so many people can name the band, much less the members or name anything from the MV. It's not supposed to be a meme either, so it's even less content about it outside the song itself\n\nTo be clear I'm not criticizing any of them, just pointing out how different is \"viral\" content nowadays.",
                    "score": 32,
                    "author": "Mathi12"
                },
                {
                    "level": 1,
                    "comment": "I didn't know what Gangnam Style was when it was everywhere, I had no clue what people were talking about when they mentioned it or it was referenced on the or in comics or wherever, but thats usually the case with most ultra popular or viral things with me, I have no clue what they are or how everyone seems to know what it is.",
                    "score": 9,
                    "author": "DerelictDevice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s really not everywhere. It’s primarily still on TikTok and probably some radio in states with higher Asian populations like California \n\nIt hasn’t even really penetrated the retail store radio where you hear a lot of kpop artist. It’s really not an all consuming hit that you can’t escape from or everyone knows about\n\nAlso, a note on tbe grammy process. Technically any is eligible for a Grammy so it’s not like they met a certain success critiera or threshold to be eligible. But they should definitely still submit for consideration. There chances are probably the same as any artist that got a modest hit this year…a toss-up!\n\nNote: This is all based on location. Where I am in Texas I haven't quite heard it everywhere yet, but Texas also has a way of being insular sometimes with music compared to other major cities.",
            "score": 123,
            "author": "Difficult_Deer6902",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in Southern California where there is a high Asian population. Have never heard it anywhere. However, frequent hear BTS, TXT, and New jeans. \nFavorite kpop in the wild moment - heating TXT at Home Depot 💚",
                    "score": 19,
                    "author": "Killjoycourt"
                },
                {
                    "level": 1,
                    "comment": "I’m in Minneapolis which doesn’t have a high Asian population and it’s being played everywhere.",
                    "score": 39,
                    "author": "You-are-a-bad-mod"
                },
                {
                    "level": 1,
                    "comment": "You must certainly live in a different US than I do. Because here in the Bay Area this song is in every Target/Mall/Hot Topic/Gym etc",
                    "score": 44,
                    "author": "Direct_Bathroom_6242",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah. i'm in la and i've heard it on several different radio stations, grocery stores, the gym, restaurants, in the lobby of my local movie theater, pretty much everywhere. i guess it could be a regional thing like someone else said, since we're in california.",
                            "score": 7,
                            "author": "notchandelier"
                        },
                        {
                            "level": 2,
                            "comment": "Yep i think Cali is where Cupid is getting a lot of their plays. I'm in texas.\n\nIt's very funny how regional music actually is in the US until you have that all-consuming inescapable hit that takes over all the states.\n\nI got interested and Spotify lets you look by some key US cities. In major Texas cities Cupid is low top 20s. (Weekly Charts) In San Fran it was top 10. Cupid dips lower out the top 20 in a lot of midwest &amp; southern locations, but than is back in top 10 for northeastern locations.",
                            "score": 40,
                            "author": "Difficult_Deer6902",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "in central texas and despite that, it’s still playing in stores i visit",
                                    "score": 6,
                                    "author": "Comprehensive-Ad5097",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same. In Austin and it’s been playing in a few HEBs, on the radio, and some restaurants. It’s definitely catching on",
                                            "score": 5,
                                            "author": "Ucfknight33"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "even in SF it's not everywhere. Maybe if you go to like a boba shop or something where they'd be more likely to play kpop anyways but you're not really encountering it anywhere where it'd be surprising",
                                    "score": 16,
                                    "author": "crashK5"
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah i’m in florida and i never hear it anywhere but tiktok. i hear other kpop songs more regularly usually like darling from svt, dynamite or butter from bts, magic by txt or maybe some bp or twice occasionally but i hear the ones i named pretty often",
                                    "score": 17,
                                    "author": "polidre"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m in Ohio, it’s on the radio here, there isn’t a significant Asian population where I live either.",
                    "score": 5,
                    "author": "TheFrenchiestToast"
                },
                {
                    "level": 1,
                    "comment": "I live in a very conservative and small rural town in Upstate New York (4.5 hours from the city) that is like 90+% white (sigh for the lack of diversity) mostly old people who listen to country-western or worship music, and I've heard it at least 4 times in public. And I have to say that I don't even go out in public very often!! But I have heard it playing in a couple stores in the last week, and it's on the regular rotation on our top 40 station (Wink 106). It's 5pm and I just took a video of it in my car. https://files.fm/u/p5cqnbs5p",
                    "score": 2,
                    "author": "Piincy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn't shade at Fifty Fifty but gangnam style was like a hundred times bigger in 2012.\n\nCupid is massive on tiktok but in general pop culture, its reach is much smaller. You'll hear it on the radio and some people might talk about it in real life but 95% of its exposure is through short form social media.\n\nEveryone and their technologically illiterate grandparents knew about gangnam style. The dance's virality can't be understated, it was literally EVERYWHERE.",
            "score": 18,
            "author": "sad_roses",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s a song that’s popular on titkok so I’ll hear it as bgm in a random YouTube short or titkok otherwise, not really.",
            "score": 6,
            "author": "hopee727"
        },
        {
            "level": 0,
            "comment": "I’ve not heard it in public yet, but it’s all over Instagram and Tiktok, and a lot of people, even people who aren’t fans of kpop seem to really like it. \n\nI need to look into more of Fifty Fifty’s music, because Cupid gives me every bit of the happy that I need, lol.",
            "score": 6,
            "author": "AlleeShmallyy"
        },
        {
            "level": 0,
            "comment": "I can tell you it's in main stream restaurants and shopping centers in the UK",
            "score": 5,
            "author": "Druid_at_heart"
        },
        {
            "level": 0,
            "comment": "I’m in Boston and I’ve heard the song randomly in quite a lot of places recently. What surprised me though is that I heard it played once in Virginia when I visited some family",
            "score": 5,
            "author": "rouletteshot"
        },
        {
            "level": 0,
            "comment": "I live in a pretty small town and i even heard them at walmart so i’d say yes",
            "score": 10,
            "author": "Medium-Principle-352"
        },
        {
            "level": 0,
            "comment": "I heard it playing at a Thai restaurant in the US, but it just be a worker who is a fan made the playlist.",
            "score": 7,
            "author": "OkDragonfly5143"
        },
        {
            "level": 0,
            "comment": "Yes. It’s being played on mainstream radio stations that typically play American pop music and rap.\n\nI don’t think most people even realize it’s K-Pop, they think it’s just another new American Pop song.",
            "score": 11,
            "author": "You-are-a-bad-mod"
        },
        {
            "level": 0,
            "comment": "it’s on social media a lot but no where near the level that gangnam style was. i assume it’s on the radio but these days so many people only stream and don’t listen to the radio which is part of why i think it hasn’t grown as much. also it doesn’t have the same goofy aesthetic that attracted people to gangnam style. overall i think if i played it in front of a room of my students, about 70% of them would recognize the song but if i played it for my parents they wouldn’t. gangnam style in 2012 would be recognized by almost everyone",
            "score": 6,
            "author": "polidre"
        },
        {
            "level": 0,
            "comment": "I haven’t heard it, but I have heard the bts eng trilogy at gas stations, waste it on me in a store, blackpink in gym class a bunch of years ago, and mic drop once on the radio. So far no sign of Cupid though.",
            "score": 13,
            "author": "cippocup"
        },
        {
            "level": 0,
            "comment": "im in florida and haven't heard it in public and not really on social media anymore, but i heard it a LOTT when it was starting to blow up.",
            "score": 3,
            "author": "jazawed",
            "replies": [
                {
                    "level": 1,
                    "comment": "to be fair, the city i live in doesn't have much kpop fans :/ like the most kpop i hear is bts(love them so not complaining)",
                    "score": 3,
                    "author": "jazawed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "same",
                            "score": 1,
                            "author": "polidre"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any song released during the eligibility window is eligible for a Grammy if it’s submitted.\n\nI don’t listen to the radio so I never hear it. It will stay on the hot 100 for a while with radio support. Streams peaked about two weeks ago, so it’s unclear if it will rise or just sustain.",
            "score": 3,
            "author": "Particular-Yoghurt81"
        },
        {
            "level": 0,
            "comment": "i’ve heard it in public! but i’ve also hear blackpink, bts, txt, wayv, monsta x, loona, and stray kids in public where i live in the midwest (college town but not a large city, less than 75k people)",
            "score": 3,
            "author": "jentzumo"
        },
        {
            "level": 0,
            "comment": "I'm not from the US, but recently I've seen Cupid mentioned in probably least expected way imo. Not really answering your question, but I think it's funny in what places it just randomly pops up.\n\nI was watching a twitch stream of a game called Gartic Phone, which is basically a mix of charades and telephone game. One of the prompts was a love heart with an arrow in it and one of the players who is a 50 yo dad/boomer of the group answered the prompt with \"50/50, Cupid\" and when everyone questioned him about it, he was like: \"It's Cupid! Like the song you know? It's kpop! It's Fifty Fifty!\"\n\nThat to me was really unexpected, cause out of all people he's a dude that doesn't even know Pokemon or most pop culture references in general.",
            "score": 11,
            "author": "Northelai"
        },
        {
            "level": 0,
            "comment": "Not from USA, but Canada, so it might still count lol. \n\nI live in a small, forgotten, fishing province and I heard fiftyfifty’s Cupid playing in a local restaurant. Blew my mind! I was so excited hahah",
            "score": 6,
            "author": "RabiPOPshoo7erX"
        },
        {
            "level": 0,
            "comment": "Two anecdotes:\n\nA family friend’s daughter is obsessed with it and even performed to it for us.\n\nIt’s been used as a cooldown song for the kickboxing class I go to several times.\n\nIn both cases, it was the Twin version (in English).\n\nThis is in south Florida, FWIW.\n\nI haven’t heard it on the radio, but tbh I don’t listen to terrestrial radio much anymore (just when my vehicle’s CarPlay or Bluetooth is acting up), so I can’t confirm or deny from that standpoint.\n\nGangnam Style was a far bigger meme IMO, but with all due respect to PSY it was barely considered a “real song” in the West at the time, but more like Chocolate Rain or something else from YouTube.\n\nThe BTS English songs had declining returns in terms of mainstream cultural relevancy: I’d say Dynamite was far bigger than Cupid, Butter a little bigger than it, but Permission to Dance about the same (if not slightly lower).\n\nThe chart peaks might be higher, but a #1 largely fueled by fandom doesn’t necessarily point to overall relevance of the song itself (vs the artist, we all know BTS are more well known everywhere than Fifty Fifty)—like when those American Idol coronation songs would debut at the top and then free fall off the Hot 100.\n\nBesides that, I’d say Cupid is more successful than the other English releases put out by American labels.\n\nThis doesn’t necessarily mean anything for Grammys.\n\nIt shows that the label and management is confident enough to submit them, and the American success probably does contribute to that confidence, but it really doesn’t cost that much to apply even if it’s a long shot.",
            "score": 5,
            "author": "DiplomaticCaper",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah it’s definitely streamed a lot and massive online if not irl. it’s all over my tiktok and and instagram reels",
                    "score": 3,
                    "author": "polidre"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All I know is I hear it on the radio and in public often, and I live in the absolute middle of nowhere in Florida. So it's definitely gotten very popular in the U.S. if it's even being played down here.",
            "score": 12,
            "author": "artistictesticle",
            "replies": [
                {
                    "level": 1,
                    "comment": "weird i’m in florida too and i’ve literally never heard it in public 😭 i don’t listen to the radio in my car tho just streaming so i couldn’t say but at stores and stuff i haven’t ever heard it",
                    "score": 5,
                    "author": "polidre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We are probably in different regions. I'm not gonna disclose mine but our radio stations, not just in the car but in stores and public places, could be different. The closest any of my stations ever got to K-pop was Left and Right, and Dynamite played one time on one of them by request in 2020, so it was surprising to me to hear Cupid.",
                            "score": 4,
                            "author": "artistictesticle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh wow yeah in my area dynamite and butter played a Lot back in 2020-21, i used to hear a lot magic by txt, and these days i hear darling by svt All the time but i haven’t heard cupid yet. idk if my area is just hella behind and it takes a while 💀",
                                    "score": 3,
                                    "author": "polidre"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard it in an H&amp;M in upstate NY, and my non-kppp friends know about it, so I think that's pretty big.",
            "score": 6,
            "author": "didntwantaname"
        },
        {
            "level": 0,
            "comment": "i haven’t heard it (i’ve never actually heard the song in full, come to think about it. just tiktok clips), but a friend heard it at a kpop event in a boba shop in LA. but that’s probably because they played it themselves.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not like gangnam i only hear it from my wife when she is scrolling tiktok but there must be a lot of people streaming it. I think it made its way onto lots of playlists, but i have yet to hear it in public. I am in Texas and maybe our radio stations arent as cool as other states, i would love to hear it in public!",
            "score": 2,
            "author": "Azhrei_Rohan",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah it’s on a lot of playlists online for sure",
                    "score": 2,
                    "author": "polidre"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’ve never heard it once in public or on radio. it only plays on tiktok or YouTube shorts as a sound and only the sped up version at that is the one most people are using. the only kpop songs i’ve EVER heard on the radio or in public stores are Gangnam Style, I’m the Best, Dynamite, Permission to Dance, Butter, and Magic. \n\ni’m on the east coast btw, in D.C./Maryland",
            "score": 2,
            "author": "lingua_phranxa"
        },
        {
            "level": 0,
            "comment": "I think the main difference between Cupid and Gangnam style is how it’s presented - Psy went viral WITH the song - people knew and associated him and the dance with the song. Cupid has gone viral on TikTok, often in the sped up and English version so I’m not actually sure how many people know it’s 1. KPop and 2. Who the girls actually are. I think that will be the hurdle for them to capitalize on their success - that they have to establish themselves as a group WITH Cupid and overcome the sort of anonymity that comes from these TikTok remixes",
            "score": 2,
            "author": "wotan69"
        },
        {
            "level": 0,
            "comment": "I’ve heard their song and XG’s song played at Costco once when we were closed.",
            "score": 2,
            "author": "aloneintheGrayWaves"
        },
        {
            "level": 0,
            "comment": "i live in a fairly large us city...haven't heard it once in all my errand-running or at work which plays radio. psy was EVERYWHERE, he even was in a *super bowl* ad though. the super bowl has tens of millions of viewers (actually i looked it up 108 million watched the superbowl in 2013...that's roughly 1/3rd of the usa population)  and many watch the ads along with the game. i distinctly remember the dance and the chorus being everywhere ..and this was like me knowing about kpop without realizing it was kpop  before i even got into kpop in 2020. now yes they've got a song in the barbie soundtrack but that song is also not cupid. no telling if it will pop off like cupid did. time shall tell.",
            "score": 2,
            "author": "Remarkable-Ad6601"
        },
        {
            "level": 0,
            "comment": "No, I really only see/hear them in kpop spaces.",
            "score": 2,
            "author": "starboardwoman"
        },
        {
            "level": 0,
            "comment": "I have heard this on the radio at work",
            "score": 2,
            "author": "amyleeofequestria"
        },
        {
            "level": 0,
            "comment": "Never heard of it.",
            "score": 2,
            "author": "CP80X"
        },
        {
            "level": 0,
            "comment": "I’ve only ever heard it on tiktok but ¯\\_(ツ)_/¯",
            "score": 2,
            "author": "Eringp"
        },
        {
            "level": 0,
            "comment": "nowhere near the level of gangnam style. i've only heard it on tiktok",
            "score": 2,
            "author": "Iwatobikibum"
        },
        {
            "level": 0,
            "comment": "I hear it in grocery stores and pharmacies in Australia so I would say it's pretty popular here? Especially considering that the only other kpop songs they usually play are BTS's butter, permission to dance and dynamite.",
            "score": 2,
            "author": "ngyaoyi"
        },
        {
            "level": 0,
            "comment": "I hear it on my top 40 radio station LITERALLY every morning, and it’s not even the English version anymore, it’s the Korean version!",
            "score": 2,
            "author": "andee-land"
        },
        {
            "level": 0,
            "comment": "i live in the US and ive never heard of this",
            "score": 2,
            "author": "redditfuckingsucks3"
        },
        {
            "level": 0,
            "comment": "Think I heard it on iHeartRadio and the Pop station on SiriusXM. They'll be on the upcoming Barbie movie OST so they must've caught some producers attention.",
            "score": 2,
            "author": "Cool-Pomelo-9325"
        },
        {
            "level": 0,
            "comment": "Uhhhh...no.",
            "score": 4,
            "author": "L2Kdr22"
        },
        {
            "level": 0,
            "comment": "It is not comparable to GS at all. It’s just mall music with scattered radio play, which is pretty much the consensus. Other than that, the american general public could not care less about Fifty Fifty, other than some select cities. It’s charted well, but people are getting way too ahead of themselves regarding their popularity. Don’t forget Gayle’s ABCDEFU topped charts, was nominated for a coveted grammy and literally nobody cares about her or her music from a pop culture perspective.",
            "score": 3,
            "author": "funkofan1021"
        },
        {
            "level": 0,
            "comment": "I hear it all the time!!!",
            "score": 5,
            "author": "noturbrobruh"
        },
        {
            "level": 0,
            "comment": "I don't really know in the US, but as an Italian practically everyone I know that has tiktok or watches YouTube shorts knows the song and the dance. I go on the bus to go to school and i heard it many times, Blackpink's shutdown and jisoo's flower are also there. It's on my Ukrainian's friend tiktok as well so it is very popular kinda everywhere even between people who don't like kpop.\n\nNot as popular as gangnam style tho, that song is known from EVERYONE in the world from \"all generations\", while cupid is still on tiktok and yt, but since they're really big streaming platforms it's very famous.",
            "score": 2,
            "author": "2PinkCatcher_"
        },
        {
            "level": 0,
            "comment": "Only the TWIN version is everywhere, since it’s the English version. The other one isn’t as popular in the U.S unless you’re a kpop fan.",
            "score": 2,
            "author": "Sea_Philosophy4256"
        },
        {
            "level": 0,
            "comment": "i could ask any of my older family members if they know gangname style and theyd probably say yes - i can bet you not one knows cupid",
            "score": 2,
            "author": "dannydevitoloveme"
        },
        {
            "level": 0,
            "comment": "I can’t escape it on my drive to work. Radio is eating it up currently. Anyone saying otherwise have some deep rooted biases",
            "score": 0,
            "author": "remywtf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most people don't listen to pop radio these days, so wouldn't be likely to encounter this song (or any pop song, honestly) in the wild unless it comes on in the grocery store or something. I certainly didn't know about this song until I started hearing about it in K-pop spaces and have never encountered it in the wild but that's also true for almost all pop music for me.",
                    "score": 9,
                    "author": "ErrantJune"
                },
                {
                    "level": 1,
                    "comment": "i think we just stream we don’t listen to the radio 💀 when it comes to like retail stores or places like that that play music i haven’t heard it yet either",
                    "score": 5,
                    "author": "polidre"
                },
                {
                    "level": 1,
                    "comment": "I have only heard it on TikTok.  I don't listen to the radio at all and I haven't heard it played in any stores I've gone into.  If people don't listen to the radio (and a lot of people don't) then they probably aren't hearing it.",
                    "score": 2,
                    "author": "EveryCliche"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s certainly everywhere I go : Target, Gym, Radio in the car and ofc every 3rd video as I scroll tiktok. \n\nWhat I can say it’s bigger than every other kpop song ever was in the US. I wasn’t keeping track during Gangnam style but since 2016 this is certainly the most popular kpop song I’ve observed.",
            "score": -10,
            "author": "Direct_Bathroom_6242",
            "replies": [
                {
                    "level": 1,
                    "comment": "really interesting ive only ever heard it on tiktok. must be regional in the us",
                    "score": 7,
                    "author": "polidre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It definitely could be regional indeed.",
                            "score": 1,
                            "author": "Direct_Bathroom_6242"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Saying it’s bigger than Gangnam Style lord 😭",
                    "score": 2,
                    "author": "boringestlawyer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I literally said I don’t know about Gangnam style and this is since 2016 are you incapable of comprehension or something",
                            "score": -2,
                            "author": "Direct_Bathroom_6242",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“It’s bigger than every other Kpop song ever was in the US.” Is an untrue statement if you weren’t keeping track during Gangnam style. I don’t think I lack comprehension I think your comment lacks clarity",
                                    "score": 2,
                                    "author": "boringestlawyer",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "More so than Dynamite or Butter do you think?",
                    "score": 3,
                    "author": "ErrantJune",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t speak for the whole rest of US but in my little nook of Bay Area I can confirm it’s bigger than those songs. I feel those songs had more ardent fans while there are just a lot more people who are likely to know the Cupid song.",
                            "score": -2,
                            "author": "Direct_Bathroom_6242",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting. I don't listen to pop radio so I don't have a frame of reference, just that I know I heard Butter especially in tv advertising, etc. Thank you for your answer!",
                                    "score": 5,
                                    "author": "ErrantJune"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m in the bay and I have not heard it everywhere. It’s on the radio tho.  I guess we are in different parts of the bay.",
                                    "score": 2,
                                    "author": "Bear4years"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This really depends on location— I have been hearing it everywhere where I live, small cafes, target and walmart, and even radio stations play it. I mean realistically, everyone here needs to realize for a song to stay on the hot 100, it needs to be played which may not be happening where some of you guys live, but it is happening and these girls are having a MAJOR break through. Like this is a really big achievement for a rookie girl group and I hope we all can realize and support that as they join known artists like BTS and BLACKPINK on that chart and how played they are in just casual buildings in everyday life, like this is huge for them. As for the Grammy’s, any song or whatever can be registered, and as they are right now trending on social media platforms and out and about in stores and everything, they definitely should at least try!",
            "score": 1,
            "author": "lovevyn"
        },
        {
            "level": 0,
            "comment": "every kid at the school i work at knows it, it’s popular on tiktok, i don’t know if it’s really as big as gangnam style, but you could definitely compare the two",
            "score": 1,
            "author": "lmaomark"
        },
        {
            "level": 0,
            "comment": "I’m not American but I’m from the UK and it’s everywhere here! It’s regularly on 2 of the biggest radio stations here, I heard it in a clothing store recently too and it’s pretty popular.\n\nGangnam Style is more huge because it’s dance/club focused and has that bouncier and humorous appeal but Cupid has definitely taken off and made a huge impact with the general public.",
            "score": 1,
            "author": "officialkylepop"
        },
        {
            "level": 0,
            "comment": "It’s being played. Yet again ppl are downplaying how big the song is.",
            "score": 1,
            "author": "anxiouslxst"
        },
        {
            "level": 0,
            "comment": "Not to the same degree as gangnam style but cupid is steady gaining traction. It has officially impacted pop radio is one of (if not the most) popular Korean song to ever impact pop radio. With Cupid finally having radio backing, the song is likely to grow more and rise even further up the Billboard hot 100.",
            "score": 0,
            "author": "bands_onhigh"
        },
        {
            "level": 0,
            "comment": "It’s on the radio in Vermont.",
            "score": 1,
            "author": "boopdasnoop"
        },
        {
            "level": 0,
            "comment": "i've heard it in a local coffee shop here in new york city. my parents heard it at a big local tiki bar in central florida. these are just anecdotes but also places i wouldn't typically hear a kpop song!",
            "score": 1,
            "author": "toooenthusiastic"
        },
        {
            "level": 0,
            "comment": "I've heard it at a Bay Area (CA) Topgolf.",
            "score": 1,
            "author": "pures1lence"
        },
        {
            "level": 0,
            "comment": "only on the radio lol\n\nnot sure many people here even know it's a kpop group, let alone learning the members names\n\nDidn't think about the Grammy awards...it's strange because I'm generally pessimistic when it comes to kpop and the Grammys, but since most people don't even consider it kpop, it does have a chance. They keep a slot open every year for the -organic growth- songs",
            "score": 1,
            "author": "signal_red"
        },
        {
            "level": 0,
            "comment": "I'm in KY so I haven't heard it in stores, but I don't hear much good music in stores so :') I see it everywhere online though, can't scroll online without hearing it once",
            "score": 1,
            "author": "Very-Nearly"
        },
        {
            "level": 0,
            "comment": "I personally haven’t heard it (I also don’t use tiktok and I know that’s where it’s mostly known from in the states). Like I’ve had non kpop friends recognize the song from TikTok when I’ve played it but I haven’t heard it played anywhere here yet. I also don’t really listen to the radio so I haven’t heard if it’s being played on the radio over here.",
            "score": 1,
            "author": "chloekatt"
        },
        {
            "level": 0,
            "comment": "I love this song. I don't listen to the radio,but I could see it being that popular here in the US.",
            "score": 1,
            "author": "FWC4Ever"
        },
        {
            "level": 0,
            "comment": "I've heard it being played in the grocery store. I live in Utah so I was surprised. My family still lives in California and my sister said she heard it on the radio.",
            "score": 1,
            "author": "thelunartokki"
        },
        {
            "level": 0,
            "comment": "I hear it in a lot of TikTok’s and once in the grocery store!",
            "score": 1,
            "author": "ChocolateeDisco"
        },
        {
            "level": 0,
            "comment": "it’s not everywhere like gangnam style was lol.\n\ni’ve heard bts, blackpink, newjeans, and fifty fifty on the radio- nj and fifty fifty only once each, bts and blackpink a lil more frequently. mostly hear it on tiktok tho",
            "score": 1,
            "author": "pacificoats"
        },
        {
            "level": 0,
            "comment": "I’ve heard it play at Topgolf before, so I would say it definitely does get radio station play (based on the fact that they exclusively play popular songs for the playlist at TG) but its not super frequent. There are other kpop songs that play, too (Pink Venom and LMLY, mostly) but again, those dont get frequent play either.",
            "score": 1,
            "author": "HeyWheresPerri"
        },
        {
            "level": 0,
            "comment": "remember that many artists are eligible for the grammy (the criteria are simple). that doesn’t mean they will be nominated. yet alone win the award",
            "score": 1,
            "author": "whoatethespacecakes"
        },
        {
            "level": 0,
            "comment": "Haven’t heard in in public like BTS and Blackpink here in Canada. I thought I’d hear in in Asian restaurants but I haven’t. Gangnam Style and another meme song Pineapple Pen was literally everywhere. Haha",
            "score": 1,
            "author": "sasameseed"
        },
        {
            "level": 0,
            "comment": "I heard it playing in Walmart the other day!",
            "score": 1,
            "author": "sopheIia"
        },
        {
            "level": 0,
            "comment": "It’s not as big as Gangnam Style, but I hear it in a lot of places. I think most people don’t know it’s a kpop song. The only kpop songs I’ve heard played more in public in the last few years are Dynamite and Butter.",
            "score": 1,
            "author": "sirgawain2"
        },
        {
            "level": 0,
            "comment": "I've heard it in English on the regular radio",
            "score": 1,
            "author": "Roxeteatotaler"
        },
        {
            "level": 0,
            "comment": "I've heard Cupid a lot on the radio. Even in the rural parts of the state here.",
            "score": 1,
            "author": "alex_local_owl"
        },
        {
            "level": 0,
            "comment": "Yeah my friends and family even know it and they don’t care for Kpop at all but Gangnam style was way bigger. It was an actual Global phenomenon smash",
            "score": 1,
            "author": "adamAlexanderGreen"
        },
        {
            "level": 0,
            "comment": "I go to a college in Texas and when it played the other day at an event, I was very surprised to hear over half of the room singing along",
            "score": 1,
            "author": "saveyourtears"
        },
        {
            "level": 0,
            "comment": "I just recently started hearing them in stores and malls. I hear the children from the school I used to work in sing it all the time tho.",
            "score": 1,
            "author": "J00niverse_"
        },
        {
            "level": 0,
            "comment": "I still haven’t heard it after all this time lol. So I’m gonna go with no",
            "score": 1,
            "author": "Overall_Air_5547"
        },
        {
            "level": 0,
            "comment": "My friend heard it at school.   But granted, there’s someone just sneaking in kpop because he’s heard a decent amount haha",
            "score": 1,
            "author": "Rain_xo"
        },
        {
            "level": 0,
            "comment": "I live in a very rural area and I heard it in our pet store. That's the only time I've heard it though. I heard psy much more often back in the day.",
            "score": 1,
            "author": "Kanna777"
        },
        {
            "level": 0,
            "comment": "I live in an area with a high Korean population and I haven’t heard it just out in the wild. That being said, it is rather common to hear BTS and Twice playing in stores (I heard Twice at Good Will of all places and BTS—among other places—at a Raising Cane’s drive through). \n\nI was in college when Gangnam Style blew up and it was literally inescapable.",
            "score": 1,
            "author": "MagicalGirlMari"
        },
        {
            "level": 0,
            "comment": "i live in massachusetts and heard it on the radio for the first time a few days ago",
            "score": 1,
            "author": "urfriendtina"
        },
        {
            "level": 0,
            "comment": "I hear it on tik tok everyday but haven’t heard it on the radio in public or anything and definitely no one has talked abt it like ppl did with Gangnam Style",
            "score": 1,
            "author": "msbeliever8"
        },
        {
            "level": 0,
            "comment": "I heard it in Walmart! More than a few times.",
            "score": 1,
            "author": "Correct_Object7892"
        },
        {
            "level": 0,
            "comment": "I work at Walmart and I’ve heard it played over the speaker once or twice! It’s a pretty big deal, the only other groups we play are Seventeen, Blackpink, BTS, Twice, and Loona. So it’s a rather exclusive line up",
            "score": 1,
            "author": "Palofbirbs"
        },
        {
            "level": 0,
            "comment": "Definitely nowhere even close to Oppa Gangnam Style. Literally everyone heard of Gangnam Style, but I think the only people who know Cupid are some people on social media and K-pop fans. That’s about it",
            "score": 1,
            "author": "trabsol"
        },
        {
            "level": 0,
            "comment": "Cupid is on repeat at Amazon warehouse where I worked at.",
            "score": 1,
            "author": "Majorandminor"
        },
        {
            "level": 0,
            "comment": "I definitely heard Cupid a lot more than other Korean songs outside of BTS over here in the U.S. TikTok music is pretty universal",
            "score": 1,
            "author": "partypwny"
        },
        {
            "level": 0,
            "comment": "Haven’t heard it outside of tiktok.",
            "score": 1,
            "author": "whyawhy"
        },
        {
            "level": 0,
            "comment": "it's definitely everywhere but nothing like gangnam style",
            "score": 1,
            "author": "Impossible-Garlic-56"
        },
        {
            "level": 0,
            "comment": "It's not quite gangnam style level, but I'd say it's pretty popular among younger people. My non-kpop friends from high school openly play it and talk about it, and the kids I tutor (6-12 year olds) know the lyrics by heart and are obsessed with it.",
            "score": 1,
            "author": "penguins4life28"
        },
        {
            "level": 0,
            "comment": "i’ve heard cupid in stores playing in the background such as starbucks and such and were I work at with children they all know the song cupid and they all are about 7-9 years old",
            "score": 1,
            "author": "Odd_Sky_2432"
        },
        {
            "level": 0,
            "comment": "Not in the States but here in the little island of the UK I would classify it as a tiktok song because the locals will recognise it from tiktok (probably the sped-up version lol). Still a good song but I don’t think we’ll ever have a phenomenon like Gangnam Style ever again, even PSY couldn’t replicate it himself",
            "score": 1,
            "author": "lonelyisIand"
        },
        {
            "level": 0,
            "comment": "Very oddly popular on the radio and tiktok, but haven’t heard it anywhere outside of that",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’d say yes, but maybe not quite as massive as Gangnam style. one of my family members is a teacher and their students were asking to play Cupid and dance around to it. I’ve heard a few schools played it at their graduations. I’ve seen reports that it was played at department stores it’s definitely doing quite well, easily the 3rd biggest kpop hit of all time after Gangnam Style &amp; Dynamite.",
            "score": 1,
            "author": "flawedconstellation"
        },
        {
            "level": 0,
            "comment": "i hear it all the time 😭 i fell in love with the song after hearing it at the mall and then again at a bookstore, it was only recently that I stopped listening to the song because of how much it’s played. I hear it at least twice every other day.",
            "score": 1,
            "author": "jin7core"
        },
        {
            "level": 0,
            "comment": "It’s popular on timtok",
            "score": 1,
            "author": "Sayonaroo"
        },
        {
            "level": 0,
            "comment": "i heard it in tjmaxx once but not anywhere else",
            "score": 1,
            "author": "bubbly_fairy30"
        },
        {
            "level": 0,
            "comment": "Popular in the San Francisco Bay Area for sure. People actively request this song at both my Kpop and western top 40 gigs. Hear it in retail stores.",
            "score": 1,
            "author": "GoodAsianDriver"
        },
        {
            "level": 0,
            "comment": "I heard couple patients, nurses, techs, etc. either listening to it or humming it this past week, but not really on radio or public spaces.\n\nVery few songs (Kpop or otherwise) were \"everywhere\" in US, so that'd be an unrealistic expectation/standard.",
            "score": 1,
            "author": "kirklandbranddoctor"
        },
        {
            "level": 0,
            "comment": "I’ve heard it on the radio at the Dallas area",
            "score": 1,
            "author": "itec745"
        },
        {
            "level": 0,
            "comment": "i hear it all the time where i’m from and i live in a really country state, a lot of people don’t even know it’s kpop. i do feel like gangnam style is way bigger than cupid but i think the difference between gangnam style and cupid is that gangnam style got viral bc it was made into a meme meanwhile cupid got viral for just being an overall good song that is pleasant to the ears.",
            "score": 1,
            "author": "SurroundMindless2002"
        },
        {
            "level": 0,
            "comment": "No Gangnam Style was much bigger. When Gangnam Style came out, there were middle aged Americans who couldn't even locate South Korean on the map doing the dance. Gangnam Style was that big.\n\nCupid is popular on TikTok and some top 40 radio stations will play it every once in a while.",
            "score": 1,
            "author": "RiceKrispyPooHead"
        },
        {
            "level": 0,
            "comment": "Imo, no. I live in an area with a fairly large Korean population. First time I heard it in public was at kbbq last weekend. Ironically my sibling who isn’t into kpop at all knew the story of the manager selling his car. Idk where he was exposed to them. For people saying it’s all over tiktok, I haven’t found that to be true for my fyp.",
            "score": 1,
            "author": "relevantvent"
        },
        {
            "level": 0,
            "comment": "I’ve heard it playing at two different restaurants",
            "score": 1,
            "author": "Araleina"
        },
        {
            "level": 0,
            "comment": "No, I live in east coast and near a major city",
            "score": 1,
            "author": "25Bam_vixx"
        },
        {
            "level": 0,
            "comment": "It’s on the radio but only have heard the Twin version on radio",
            "score": 1,
            "author": "beardedmeerkat"
        },
        {
            "level": 0,
            "comment": "Walmart in small city NC",
            "score": 1,
            "author": "cheerioay"
        },
        {
            "level": 0,
            "comment": "It’ll have made it big in the US once I see a kidz bop cover 😂😂",
            "score": 1,
            "author": "moistureoverload"
        },
        {
            "level": 0,
            "comment": "I heard it when my family was at a place to get there passports (some little kid was playing the song on their phone) and I heard my classmates play it😭",
            "score": 1,
            "author": "Onlyforroyalehigh"
        },
        {
            "level": 0,
            "comment": "It depends on where you are. I hear it all the time around SoCal, especially as a college student. It’s certainly not Gangnam Style famous though.",
            "score": 1,
            "author": "drpepperandranch"
        },
        {
            "level": 0,
            "comment": "NYC here - they're played at the usual places where Kpop songs are played (Asian stores and restaurants), but not on any of our top pop radio stations - the only Kpop songs I've ever heard on them were Gangnam Style, BWL, Butter, PTD, Dynamite, and probably a couple other BTS songs I'm missing.\n\nAs others put it, America is a huge country and what's heard in one place is not representative of anywhere else. Also, Gangnam Style was an inescapable global sensation, like everyone knew it just because of how fun, weird and crazy it was. Cupid's success is huge from a Kpop fan's perspective, but for everyone else it's just another popular song at the moment.\n\nIt remains to be seen if Cupid will climb even higher and truly become mainstream (good luck to them!) but as of now I doubt they'll win a Grammy either. Because even if it got nominated, it'd most likely be going up against songs from already well-established, non-Asian artists like Calm Down, Flowers, Kill Bill, Antihero, etc...",
            "score": 1,
            "author": "One_Movie9957"
        },
        {
            "level": 0,
            "comment": "bruh I heard it at a random golf course pub and also Walmart + a pop radio and obv everywhere on social media",
            "score": 1,
            "author": "THEnesnes32"
        },
        {
            "level": 0,
            "comment": "I went to 2 different stores and it played, and it played on the radio at my work out of nowhere. It's most likely due to English lyrics, but it's the first aside from Twice or BTS that I've heard in public.",
            "score": 1,
            "author": "sajatheprince"
        },
        {
            "level": 0,
            "comment": "It plays on the radio…I’ve heard it twice",
            "score": 1,
            "author": "AndyAndrew127"
        },
        {
            "level": 0,
            "comment": "I only hear it on tictok. Those that aren’t on the platform probably have never heard it before",
            "score": 1,
            "author": "yentrib"
        },
        {
            "level": 0,
            "comment": "Oh I here it all the time in California. I’ve heard it at stores, malls, the radio, and at an amusement park. Both in the Bay Area and LA.",
            "score": 1,
            "author": "Ill-Hope-5543"
        },
        {
            "level": 0,
            "comment": "I personally have heard it on the radio, in stores, etc. but it really depends on where you live and what kind of places you go to. A place that uses the radio might not play it but places with a specific Spotify playlist that changes frequently might. \n\nDefinitely not on Gangnam style levels, but I like to think that Cupid has a better wrap simply bc Gangnam style was big due to its memes , while Cupid is steadily getting big because it’s genuinely a good, enjoyable, danceable song (not saying Gangnam style isn’t a good song, just that the public made it big thru memes rather than a cute dance trend)",
            "score": 1,
            "author": "Common-Transition973"
        },
        {
            "level": 0,
            "comment": "They play it in my apartment lobby from time to time. I also have heard XG’s Left Right while grabbing my mail lol. I don’t really go out a lot but my apt building is the type to play top 40. I’m in the DMV area btw",
            "score": 1,
            "author": "yourcreditscore100"
        },
        {
            "level": 0,
            "comment": "i hear cupid a lot on the radio and in public spaces, i hear most of my school listening to it on tiktok or just on spotify. it's a pretty viral song from where i'm at. (georgia)",
            "score": 1,
            "author": "Comfortable-Diver486"
        },
        {
            "level": 0,
            "comment": "I have not heard it in public but i did hear aespa doin me english in the mall a month ago…",
            "score": 1,
            "author": "xm45-h4t"
        },
        {
            "level": 0,
            "comment": "San Francisco Bay Area, California - it's plays on a very popular FM music station here, and I heard it a few times in stores.  Not nearly as big as GS which was pretty friggin massive.",
            "score": 1,
            "author": "bayareakpopoff"
        },
        {
            "level": 0,
            "comment": "I live in cali where there’s a huge asian population and basically everyone knows the song and i’ve heard it on radio all the time, and in public places too.",
            "score": 1,
            "author": "sehunnie_honeys"
        },
        {
            "level": 0,
            "comment": "Back when gangnam style trended youtube was *extreeeeemely* sensitive to trends with its trending page, to the point if something hit the trending page it was in your face for as long as it sustained that spot. I don't think it even had youtube gaming/music split either so it was EVERYWHERE. Im pretty sure back then it had trending as a top 10 too so it was insane and gangnam style peaked that for a while.\n\nIt was the first vid to reach 1 billion views, not just for the music like cupid as well it spread because of the novelty of the vid, meme status, being from korea making it a crazy outsider thing, honestly spread like fire. edit: Omg i forgot, youtube back then was basically parodytube, EVERYTHING had a parody and gangnam style had at least a thousand BIG youtuber parodies it was a weird time to say the least. It being low hanging fruit for content and youtube being a song parody machine at the time = EASY clap for the virality\n\nAs for how it got big in korea first to start it, I'm sure theres a whole side to that story we wouldnt have known.\n\nAs for cupid, the trending cycle has just gotten far shorter because of shorts and tiktok, its still crazy big but doesn't have some of the features gangnam style had for it to be able to spread through memes, funny dances for kids to do in school etc.",
            "score": 1,
            "author": "KyronXLK",
            "replies": [
                {
                    "level": 1,
                    "comment": "im pretty sure gangnam style was a lot of peoples first encounter with the word oppa too lol",
                    "score": 1,
                    "author": "KyronXLK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "no. we watch all the Viki Rakuten shows. I've never heard them in Virginia.  Psy was EVERYWHERE",
            "score": 1,
            "author": "--Sketchy"
        },
        {
            "level": 0,
            "comment": "Southern CA.  Never on radio. Only get BTS.  Never BlackPink either.",
            "score": 1,
            "author": "Deep-Owl-1044"
        },
        {
            "level": 0,
            "comment": "It's on my SMALL WISCONSIN TOWNS radio, so yes, it is very worldwide popular at the moment",
            "score": 1,
            "author": "imjustagirlinlove"
        },
        {
            "level": 0,
            "comment": "It did make it to Hits 1 on Sirius XM, very few korean groups makes on to it. Honestly I had no idea fifty-fifty was even kpop when I heard it.",
            "score": 1,
            "author": "EspressoOntheRock"
        },
        {
            "level": 0,
            "comment": "I live in America and I work at a elementary school. The 7 year Olds were singing cupid to me and showing me the \"tiktok dance\". I would say it is huge, but not Gangnam Style huge. They at least knew Gangnam Style was kpop, they just think Fifty Fifty is another American singer. They haven't realized its kpop yet.",
            "score": 1,
            "author": "FxDeservesBetter"
        },
        {
            "level": 0,
            "comment": "I don't know about Gangman Style but in my school everyone just sings Cupid everywhere and I go to a school with 4000 students",
            "score": 1,
            "author": "lvsjake"
        },
        {
            "level": 0,
            "comment": "No it is not everywhere like Gangnam style and Psy himself were. Gangnam style and Psy were EVERYWHERE and the caps are needed to capture how much it became a part of American pop culture for a time. Football players danced it during their end zone celebrations.  People danced it numerous in sport events.  Psy showed up on late night shows.  He was on SNL. I think he may have even been on the Simpsons. He also performed Gangnam style on the today show, an American morning news show. It was all over place.  I got sick of it. That is how much it was all over place.  There’s no comparison. I don’t think any kpop song has reach the level of Gangnam style. \n\nI know Cupid is popular. I have heard it on the radio in the Bay Area (after the radio push) but I have not heard it anywhere else.  Regardless, I acknowledge its popularity.  However, fifty-fifty has not been invited to perform it on the late night shows.  That’s the next hurdle.  They can still get invited.  The morning news show is a tough hurdle. Again all of this can still happen.  These are just reference points.  As of right now, the answer to your question is no, Cupid is not everywhere like Gangnam style was in 2012.",
            "score": 1,
            "author": "Bear4years"
        },
        {
            "level": 0,
            "comment": "Ive heard it a couple times in public. Usually in stores like h&amp;m and forever 21. I also know that it managed to reach some classmates of mine. Classmates who drag me continuously for my enjoyment of kpop know the lyrics word for word note for note but claim \"it doesnt count (as kpop)\"",
            "score": 1,
            "author": "Life_as_a_new_weeb"
        },
        {
            "level": 0,
            "comment": "Ive heard it a couple times in public. Usually in stores like h&amp;m and forever 21. I also know that it managed to reach some classmates of mine. Classmates who drag me continuously for my enjoyment of kpop know the lyrics word for word note for note but claim \"it doesnt count (as kpop)\"",
            "score": 1,
            "author": "Life_as_a_new_weeb"
        },
        {
            "level": 0,
            "comment": "Cupid is obviously one of the popular songs in kpop right now that it is even played on radio stations depending on  where you live.I dont really hear it except for on social media.As for the popularity comparison, it is nowhere near the level of popularity that gangnam style was at.That song was literally everywhere in the American general public.Not to say Cupid isn't popular at all cause it is and could reach the level of gangnam style.But it is not in the American gp view like a BTS or Blackpink song.",
            "score": 1,
            "author": "jordyn0399"
        },
        {
            "level": 0,
            "comment": "I only hear it on TikTok and in my car from my playlist.",
            "score": 1,
            "author": "MisterFlibble"
        },
        {
            "level": 0,
            "comment": "I’m in the Us and I just hear it online. I don’t think it’s made it’s way to radio yet? But I’m in the Midwest so we always get stuff late 😂",
            "score": 1,
            "author": "NfamousKaye"
        },
        {
            "level": 0,
            "comment": "I don’t think it has the same effect as Gangnam Style tbh. Gangnam Style was a fast paced and just fun catchy song that could make anyone want to dance or sing to it. Cupid is more of a ballad slower sounding song so I don’t think it would it be played “everywhere” in the US.",
            "score": 1,
            "author": "GreenTeaRex007"
        },
        {
            "level": 0,
            "comment": "I think I've heard it once or twice but it's not something I actually listen for since it's not one of my groups. My son says he hears it mostly on YouTube shorts or Tiktok.\n\nIt's no where near Gangnam Style level since I still hear that one on occasion. \n\nCupid is a cute enough song but it's kind of boring in my opinion. It would be good background music for a movie or tv show so give it time.",
            "score": 1,
            "author": "polkastria"
        },
        {
            "level": 0,
            "comment": "I live in LA and I hear it everywhere. It's really nice tbh I love hearing how much people love it. However, it is always the English version I've never heard the Korean version in public. Even my best friends young siblings play the song and says everyone sings it at school.",
            "score": 1,
            "author": "rebecksie"
        },
        {
            "level": 0,
            "comment": "Nah it's on social media everywhere, but I'm not hearing it out in public",
            "score": 1,
            "author": "GoosedOne"
        },
        {
            "level": 0,
            "comment": "It doesnt even get closer to gangnam style lol",
            "score": 1,
            "author": "igiriboyrp"
        },
        {
            "level": 0,
            "comment": "spent the weekend with my family and my 60 something year old aunt started playing it from her phone😭",
            "score": 1,
            "author": "Party-Long5487"
        },
        {
            "level": 0,
            "comment": "I live in a small town in Canada and a few kids in the school I work at were singing it.  I was like how do you know that song?!?  They said from Tik Toc and Youtube.  Not everywhere but it's nice when you hear it.  I heard a Seventeen song at an ONRoute  (service station) last weekend on a road trip.",
            "score": 1,
            "author": "Agitated-Ad-4370"
        },
        {
            "level": 0,
            "comment": "i’ve heard it in public i forgot where though - i’ve also heard nwjn omg in a department store so like hearing kpop in public doesn’t phase me as much as it used to\n\ngangnam style def was played more though vs cupid is more viral bc of social media. being viral is just different these days though so imo it’s hard to compare. but like gangnam style i feel like everyone knew it no matter their age while i doubt my older relatives even have heard of cupid",
            "score": 1,
            "author": "hybehorre"
        },
        {
            "level": 0,
            "comment": "My workplace plays it. We used to play some newjeans a few months ago as well.",
            "score": 1,
            "author": "AMagicalPotato"
        },
        {
            "level": 0,
            "comment": "I heard it in my Uber last week",
            "score": 1,
            "author": "ovaltinejenkins999"
        },
        {
            "level": 0,
            "comment": "I always hear it out in public here and in Mexico (for context I live in a border city)",
            "score": 1,
            "author": "Great-Tomorrow-8492"
        },
        {
            "level": 0,
            "comment": "I’ve never heard it in public or on the radio and I live in a big city and have Sirius xm. I think it’s mostly popular through social media and TikTok, but I only ever see the English version rather than Korean.",
            "score": 1,
            "author": "thelewski"
        }
    ]
}