{
    "id": "13xm0nm",
    "score": 0,
    "title": "If you buy a verified resell ticket through TicketMaster, do VIP benefits transfer automatically?",
    "author": "Intelligent_Drawer44",
    "date": 1685636634.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13xm0nm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi ya’ll! I’m trying to sell my TWICE VIP soundcheck ticket to the ATL show on 07/09 and my prospective buyer is skeptical about the process of transferring benefits. I have my ticket listed on TM bc it’s just the safest way to sell it. They’re concerned about the benefits. Has anyone purchased resell VIP w/benefits tickets through Ticketmaster? Did the benefits transfer automatically? If so, were you able to get all benefits easily? If not, how did you get your benefits? I reallly need to sell this ticket and I want to make sure whoever buys it gets all their money worth. I’ve tried looking for answers, but mainly everyone has bought resell tickets from a third-party so I don’t know if this process is different from third party vs TM!",
    "comments": [
        {
            "level": 0,
            "comment": "From what I have seen, VIP benefits do not transfer to tickets when resold with TicketMaster. The only way these can be transferred is if you were to list the buyer as an alternate pick-up. You then have to provide additional information and jump through multiple hoops to ensure this is correct. Even still, I wouldn't categorize this is a viable option to try and transfer the VIP benefits.",
            "score": 1,
            "author": "Taennitus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just spoke with TM and they said if I sell the ticket through TM then it voids the VIP benefits ): I’m just scared of selling through a third-party and directly to another person because I don’t want to get scammed. I don’t mind proving the buyer with all my info! I’m gonna call TM again and see if I can add an alternate person to pick up the goodies.",
                    "score": 2,
                    "author": "Intelligent_Drawer44"
                }
            ]
        }
    ]
}