{
    "id": "13xs3gn",
    "score": 0,
    "title": "aespa - My World US Billboard (Lack of) Charting",
    "author": "cambridgechap",
    "date": 1685650560.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13xs3gn",
    "media_urls": [],
    "other_urls": [],
    "postText": "What is going on here? I’m looking for any kind of news around Billboard charting and only found one for the Global chart. Their last EP entered the top 10 and for this one I can’t find news about it charting on the 200 OR US World which you need like, 2k units to achieve.\n\nSince their previous EP hit 50k I don’t see a way they missed that chart. Is their some technical reason it would be disqualified? I know they sold it in the US as I know Target Carrie’s it.",
    "comments": [
        {
            "level": 0,
            "comment": "Physical copies don’t go up for sale in the US until the end of June. Not sure why it’s so late after the album release date but it is.",
            "score": 6,
            "author": "multistansendhelp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Late June! I thought that maybe their orders got split due to delays, but didn’t realize it was being held till that late",
                    "score": 3,
                    "author": "Difficult_Deer6902",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Target, Walmart and Barnes and Noble both have exclusive versions that are beyond the typical “throw an extra photocard in there” so I wonder if that added extra print time. Like they have exclusive covers, different page numbers than the regular zine versions, etc.\n\nIt’s a weird strategy though. How much of the hype will have died down by the time people can get their hands on them? Unless SM is planning for Aespa to have a marketing push near the end of the month focused on the US market.",
                            "score": 1,
                            "author": "multistansendhelp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;k units to achieve.  \n&gt;  \n&gt;Since their previous EP hit 50k I don’t see a way they missed that chart. Is their some technical reason it would be disqualified? I know they sold it in the US as\n\nThank you. I looked online and saw it for sale and did not dig deeper. That's crazy.",
                    "score": 1,
                    "author": "cambridgechap"
                }
            ]
        }
    ]
}