{
    "id": "13yef6c",
    "score": 0,
    "title": "Why are K-pop idols not allowed to sing along lyrics including n-word?",
    "author": "cosmos231",
    "date": 1685716376.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13yef6c",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm not native speaker. born and raised in north-east Asia.\n\nI'm totally fine when black ppl don't want anyone who isn't black say n-word in speech or conversation.\n\nbut if singing a song including n-word is very controversial topic then Why don't black artists or streaming websites just beep the word?\n\nI know how culturally insensitive we can be to racism but haven't seen or heard serious discussion  of using the word socially. until entering int k-pop community. and I don't think speaking/reading English automatically give ability to understand  cultural context and history.",
    "comments": [
        {
            "level": 0,
            "comment": "It’s a charged word with a lot of cultural context and history. Whether or not the word is usable is hugely context-dependent even in areas where it’s common. So on one hand, they could take the risk of offending a sizable chunk of their fanbase for basically no upside. On the other hand, they could just not use the word, and there’s no chance of anyone getting upset. So, they just don’t use the word.",
            "score": 10,
            "author": "Piri_Cherry"
        },
        {
            "level": 0,
            "comment": "the word has been reclaimed by the black community, and black artists shouldn't need to censor themselves just because not everyone can sing along to every line of their songs",
            "score": 48,
            "author": "ciri08",
            "replies": [
                {
                    "level": 1,
                    "comment": "this",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Music is also about expressing yourself and if black artists want to use the n word in the lyrics they should be allowed to do so without censorship. Some sites, radios etc bleep it. \n\nThat being said it still doesn’t give the right for non black people to use it under any circumstances as it is a racial slur reclaimed by them.\n\nObviously, there will be non black people who still use it but the shouldn’t get mad when they face the consequences of their actions by the group of people they hurt/offended.",
            "score": 16,
            "author": "abcixtwt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was always wondering the same, thank you for the clear explaination. :)",
                    "score": 3,
                    "author": "Cold-Effective-9161"
                },
                {
                    "level": 1,
                    "comment": "Thank you 😊",
                    "score": 2,
                    "author": "Sea_Distribution4157"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some thoughts:\n\nTo a certain extent, it’s like gatekeeping the word, but the best option is to ensure you don’t say the word at all even if others from a different culture can say the word. \n\nKind of like how sometimes swearing isn’t necessary and you can definitely hold yourself back from saying a word with enough practice even if there are others who are ok with it and think someone is more genuine if they supposedly swear.\n\nIn the end, people can say any word, but the problem is when there’s an audience that is offended from hearing it being said (it can be any word), so that’s where the root of the problem lies assuming the aim of the performance is to provide entertainment and make it an inclusive environment. And knowing that there will be people posting clips online further requires the performer to be more aware of trying to ensure they respect as many people as possible who may come across the video.",
            "score": 1,
            "author": "dramafan1"
        },
        {
            "level": 0,
            "comment": "The best option companies have is to simply not use any songs that have that word in it.  I'm sure there are plenty of songs without offensive words in them, right?",
            "score": 1,
            "author": "Level-Rest-2123"
        },
        {
            "level": 0,
            "comment": "It was reclaimed by the Black community, if they use it that’s normal and okay. But if someone non-black says it that’s rude and well racist. Black artists shouldn’t have to beep it out.",
            "score": 1,
            "author": "Sea_Philosophy4256"
        }
    ]
}