{
    "id": "13z3px5",
    "score": 115,
    "title": "Would it be ok to pass out fake photo cards at a concert?",
    "author": "StyleNecessary23",
    "date": 1685774587.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13z3px5",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m going to a K-pop concert for the first time ever, and I’m thinking about making some custom photo cards of some of the themes in the superstar rhythm games. They would obviously be fake (and I would probably tell people also.)  I’m not super familiar with card giving or the etiquette or overall opinion on this. Would it be ok?\n\nEdit: thank you everyone! I think I’m gonna do it :)",
    "comments": [
        {
            "level": 0,
            "comment": "More \"experienced\" fans will know they are fake because passing out original photocards is too expensive, so freebies basically means fanmade and I'm sure no one minds, and a lot of people will be thankful to you and appreciate the gesture.\n\nAs long as you don't say they are original, then I see no issue with it.",
            "score": 289,
            "author": "Own-Choice790"
        },
        {
            "level": 0,
            "comment": "Of course! Just don’t design the backs to look like the real ones. I’ve only been to 2 kpop concerts, both txt, but I received so many fake pcs as freebies both times and I really love them. I use them inside my phone case instead of real ones.",
            "score": 152,
            "author": "soobunny1205"
        },
        {
            "level": 0,
            "comment": "Yeah freebies are cool! As long as you don't pretend they're real/make them look real, it's totally fine and fun!",
            "score": 89,
            "author": "seohotonin"
        },
        {
            "level": 0,
            "comment": "This is a totally normal part of concerts in Korea! It’s honestly expected really, my friends and I would always go early to be able to collect everything we wanted. We got lucky sometimes too, some Japanese fans even gave away albums",
            "score": 22,
            "author": "uju_rabbit"
        },
        {
            "level": 0,
            "comment": "Freebies are freebies\n\nThe last concert I went to people did that, they had like cards in little goodie bags which were really cool\n\nIf you can give out banners and other stuff, why not\n\nPeople shouldn't expect real Pcs so they shouldn't be upset over it, unless you claim otherwise then that would be on you",
            "score": 53,
            "author": "PokemonLv10"
        },
        {
            "level": 0,
            "comment": "Personally I would be ok with it, just say they're fake / custom made ones.",
            "score": 40,
            "author": "Chaeji412"
        },
        {
            "level": 0,
            "comment": "I'm not sure if the etiquette may vary from country to country but when I went to see Stray Kids (in the US), there were a few people handing out small freebies like that and my friends and I thought it was delightful!",
            "score": 24,
            "author": "kittymmeow"
        },
        {
            "level": 0,
            "comment": "I think it’s okay and actually appreciated",
            "score": 8,
            "author": "Tophbeifang_13"
        },
        {
            "level": 0,
            "comment": "I got a Jin freebie the last time I saw a BTS show in the movie theater. It’s fanmade, and it absolutely made my day.",
            "score": 9,
            "author": "Gingerbreadcrumbs"
        },
        {
            "level": 0,
            "comment": "I think it would be cool. To be honest, from what I've seen and in my experience, fanmade stuff is often a lot more creative and interesting than official stuff. I know there are good reasons for that, official merch has to be made in a way that is easy to replicate and cost effective so they can make a profit, etc. So I'm not saying anything bad about official stuff. I just think it is a sweet idea and if I received something like that I'd be happy",
            "score": 3,
            "author": "ohmyclothes"
        },
        {
            "level": 0,
            "comment": "This is a normal thing for kpop concerts, I got multiple fake photo cards when I went to see Ateez. Don’t worry about it, people love freebies!",
            "score": 6,
            "author": "TrickyEgg4L"
        },
        {
            "level": 0,
            "comment": "Freebies are cool as long as you make sure you tell them it’s fan made..",
            "score": 4,
            "author": "Bidampira"
        },
        {
            "level": 0,
            "comment": "Of course! Giving out fan-made pcs during concerts and events are very much appreciated and is a common practice as far as i’m aware (: Going around collecting fanmade freebies has been a huge part of my concert experiences in Singapore and Korea.\n\nFanmade pcs are only a problem IF people sell them trying to pass them off as official cards. Since you did mention that they will be obviously unofficial and you are transparent about it, there’s zero concern :)",
            "score": 3,
            "author": "michielim"
        },
        {
            "level": 0,
            "comment": "yes! when I saw SVT, I received one and it had the photocard on the front and on the back was the persons social media so maybe if you have any social media you could print that on the back? People will know it’s unofficial then",
            "score": 2,
            "author": "Top_Cockroach652"
        },
        {
            "level": 0,
            "comment": "of course! i'm sure many people will appreciate it! :)",
            "score": 2,
            "author": "mango-waffles"
        },
        {
            "level": 0,
            "comment": "Yes they are awesome!!!! 🫶🏼 I personally wouldn’t expect anyone to give out official ones, and if they did I would question them myself if they mixed it up or something 😅 so go ahead fans would really be thankful for that !",
            "score": 1,
            "author": "_xiaomints"
        },
        {
            "level": 0,
            "comment": "I usually make something like pins or keychains as freebies and I always put Lomo cards in with the things I make. It’s obviously not going to excite hardcore pc collectors, but we all just like things with our biases’ faces on them, don’t we?",
            "score": 1,
            "author": "MrsSparksOfficial"
        },
        {
            "level": 0,
            "comment": "Passing out freebies at a kpop show is a common thing, so if you want to do it, go for it. Don't try to pass them off as real though, just be up front that they're fan made. Nobody would pass out real pcs at a show anyways because they're too valuable lol. Have some fun with it! I've seen people who make holographic/glittery ones or add other fun designs to them :)",
            "score": 1,
            "author": "Vivid_Pea_5591"
        },
        {
            "level": 0,
            "comment": "Totally fine and this is totally normal for people giving out freebies. Some even sell these kind of merch for around P50-P250 depending on the variant (Once bought a fanmade Eunha poster for P150 because i liked the quality of it).",
            "score": 1,
            "author": "awkward_weebstan"
        },
        {
            "level": 0,
            "comment": "Just make sure people are aware they aren't official ones and you'll be fine",
            "score": 1,
            "author": "Druid_at_heart"
        },
        {
            "level": 0,
            "comment": "No one is expecting real photocards at concerts. \nI got 2 bags full of freebies from suga’s concert and I know they’re all fake, no one needs to say anything, it’s obvious. \n\nIt’s a very sweet attention, I hope you’ll have the time of your life at the concert !",
            "score": 1,
            "author": "Passionpotatos"
        },
        {
            "level": 0,
            "comment": "freebies are a very normal part of every kpop concert i’ve personally been to, i’ve never even thought to assume they’re real photocards\n\nits fun when they’re handmade :) i’ve gotten the coolest freebies from concerts and they’re usually so personal to the group it becomes an amazing souvenir !",
            "score": 1,
            "author": "cloudruniere"
        },
        {
            "level": 0,
            "comment": "Of course! I usually hand out polcos (I have an instax printer) as freebies, and they're a huge hit!",
            "score": 1,
            "author": "saddlethehippogriffs"
        },
        {
            "level": 0,
            "comment": "yeah, it's normal. I would be more shocked and appalled if someone were giving away official ones.",
            "score": 1,
            "author": "starboardwoman"
        },
        {
            "level": 0,
            "comment": "The two concerts I’ve been to (Stray Kids and Agust D), people gave out freebies and everyone knew and expected that they were fan-made. \n\nNo one I met or know of thinks they’re official PC’s, that’s just too expensive. As long as you’re giving them out for free (so not making money off of them), then it’s fine.",
            "score": 1,
            "author": "GoldenGoof19"
        },
        {
            "level": 0,
            "comment": " i love these + when people make freebies they’re a huge highlight of going",
            "score": 1,
            "author": "autismdevil"
        },
        {
            "level": 0,
            "comment": "Yes! One thing I’ve seen people do, particularly with replica cards, is make an OBVIOUS difference. So like, clipping a corner or a faint watermark or a different boarder, along with a different back. Just so people can’t fool others on a site like eBay or mercari.",
            "score": 1,
            "author": "emma_m_csquared"
        },
        {
            "level": 0,
            "comment": "If it’s freebies, I wouldn’t think it would matter because your giving them out for free obviously and whoever give out real pcs must be related to Kim Kardashian",
            "score": 1,
            "author": "Conscious-Emu-2848"
        },
        {
            "level": 0,
            "comment": "Yes! Just do it discretily  bc some places doesn't like to get unauthorized \"sellers\" and they may send security to confiscate your photogards",
            "score": -1,
            "author": "Ill_Treat_9450470"
        },
        {
            "level": 0,
            "comment": "Idk how youre planning to do that but i assume there will be a back on them? If so maybe have like the group logo and under in smaller text say \"unofficial photocard\" or \"fanmade photocard\"",
            "score": 0,
            "author": "avis_icarus"
        }
    ]
}