{
    "id": "13zp0re",
    "score": 0,
    "title": "first weverse shop order in a year (confused)",
    "author": "escapism-is-lame",
    "date": 1685825205.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/13zp0re",
    "media_urls": [],
    "other_urls": [],
    "postText": "so i ordered merch on weverse usa shop and below where it says “orders in progress” it says “shipping and on-site pickup.” does this mean i selected something that says i’ll pick it up on site? when i click on my order it does have my shipping address on there, and i ordered through paypal. i ordered it early in the morning so i’m just a bit paranoid i wasn’t paying enough attention. i haven’t ordered anything off weverse for a year so is this normal?\n\nedit: i contacted weverse to make sure and they said:\n\n“Regarding your inquiry about \"shipping and on-site pickup\" under orders in progress, we would like to inform you that \"shipping and on-site pickup\" is just a filter for the order history. You can choose to see shipping and on-site pickup order history if you click it. \n\nIf you check your order details, you will see the shipping address for the order delivery, which means the order will be delivered to the address provided when placing the order.”\n\njust in case anyone is ever confused like i was and sees this post, it’ll be sent to the address given no problem!",
    "comments": [
        {
            "level": 0,
            "comment": "I can’t help with why it says on-site pick up but I would encourage you to call the USA shop and ask. Maybe I can help with the time frame because I’ve ordered a several things off of Weverse, mostly Season’s Greetings or Membership Kits. And every single time it took more than 6 months to ship out. I’ve noticed in the fine print where it says they only ship certain items quarterly. So you have to wait for the quarter (year) to end and then wait for international shipping. Took 10 months to get my TxT membership kit. It’s always felt like getting a surprise gift in the mail because I’ve usually forgotten all about my order by the time it arrives.",
            "score": 1,
            "author": "Awhkm"
        },
        {
            "level": 0,
            "comment": "Mine always says that but it's still delivered to my home. If you're worried you can reach out but I've never had any issues.  Also, depending on what you ordered, it can take some time to get to you.",
            "score": 1,
            "author": "EveryCliche",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!! i looked at the past item i bought it took a month to get to me and it’s the same type of item so i think it’ll take the same time. i literally ordered it like a few days ago so i’m not thinking it should’ve shipped already lol i just got worried that it wouldn’t come to my house",
                    "score": 1,
                    "author": "escapism-is-lame"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s ok. Under that, for your item, it will say ordered or in transit..",
            "score": 1,
            "author": "Bidampira"
        }
    ]
}