{
    "id": "1416mmg",
    "score": 79,
    "title": "um, KCON LA is in 2 months and there's no info?",
    "author": "izaka77",
    "date": 1685951601.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/1416mmg",
    "media_urls": [],
    "other_urls": [],
    "postText": "whos even gonna be there? is this normal? usually everything about convert/festival i've attended is fully known 6 months or more in advance",
    "comments": [
        {
            "level": 0,
            "comment": "Last year they dropped hints mid of June. Hopefully they’ll start giving lineup hints this coming week",
            "score": 79,
            "author": "Main_Comment8189",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed; they’re about a week late according to my FB OTD, but only in comparison to pre-pandemic KCON.  Give it till mid-June before people are disappointed with the lineup and the “might-as-well-fly-to-Korea” top prices.  :)",
                    "score": 17,
                    "author": "bluebirdgm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "very normal for kcon lol just wait",
            "score": 33,
            "author": "VariationInside4329",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or most conventions for that matter. Which is maddening.",
                    "score": 5,
                    "author": "DrLuciferZ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's so weird to me. I'd never plan a major event and barely give 2 months' notice of what's happening. It's especially annoying if you're not local and basing your attendance on who is performing. At this point I may not even go just because the last minute flight and hotel prices are gonna kill me.",
            "score": 16,
            "author": "-Ximena"
        },
        {
            "level": 0,
            "comment": "I feel like they wait until a month before the show every year. It drives me crazy.",
            "score": 49,
            "author": "ok-peachh"
        },
        {
            "level": 0,
            "comment": "It's also a bad look because in my mind I'm thinking the late announcements = hot mess in planning and preparation so likely not worth attending because there's inevitably gonna be a screw up or issue that negatively affects patrons' experience.",
            "score": 13,
            "author": "-Ximena",
            "replies": [
                {
                    "level": 1,
                    "comment": "as someone who has been going to every kcon for the past decade, it's like this every single year. never really messy and always worth attending imo",
                    "score": 9,
                    "author": "VariationInside4329",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad to hear it's been successful. I've been in event management before (not in this industry), and it's been Hell on the nerves when thinking about audience perception. So I can't help but take the same approach even as an audience member. Lol!",
                            "score": 1,
                            "author": "-Ximena"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with you, I don't know what the comment below is saying. I've also been going to every kcon for the past decade and it's getting worst... Last year was a hot mess to get into both the conference and concert compared to pre-pandemic.",
                    "score": 1,
                    "author": "Bobasaur2023"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, happened here too with another kpop festival. No one knew who was coming till the day the tickets sales started, and then they only announced three of the six groups that would come. It was a disaster",
            "score": 25,
            "author": "Sinimeg",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet you're talking about Kamp LA?",
                    "score": 5,
                    "author": "OkDragonfly5143",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, it wasn’t in the US",
                            "score": 2,
                            "author": "Sinimeg"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pre pandemic they would have had all the info out by now but they did this last year too and i dont understand it. Like, for something that is such a big commitment for fans money wise its annoying to not have ANY info released. We have to plan this stuff out months in advance, but what if we dont even like the lineup?",
            "score": 5,
            "author": "Immediate-Task6886"
        },
        {
            "level": 0,
            "comment": "KCON is super last minute. Before Covid we’d get to the 3rd round of ticket lotteries in Japan before they even told us who the artists were. 🙄",
            "score": 14,
            "author": "satokibijax"
        },
        {
            "level": 0,
            "comment": "How Bout KCON DC, The Nations Capital barely gets any love",
            "score": 13,
            "author": "Tyrdiel-"
        },
        {
            "level": 0,
            "comment": "let me predict:\n\n- Mamamoo \n- ZeroBaseOne \n- Gidle \n\nidk who else",
            "score": 6,
            "author": "iwinwinyuwinwinta"
        },
        {
            "level": 0,
            "comment": "I’m seeing a lot of poorly promoted multi-lineup events! I caught the KpopLux Madrid concert basically by chance on Reddit and haven’t seen it advertised much. \n\nLike this is the lineup and there’s still tickets, tf is going on:\n\n- SHINee\n- xikers\n- CRAVITY \n- ENHYPEN\n- ATEEZ\n- STAYC \n- IVE",
            "score": 4,
            "author": "Cheap-Ad8624"
        },
        {
            "level": 0,
            "comment": "imagine being from aus and not getting info until usually a month before shows we get 😅😅 but surely u'll get it any day now",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "yeah. i remember pre pandemic, they were already gearing up for the kcons la and new as early as april. but this year, just an announcement that there is kcon-la in august and that's it. \n\nmy guess is, back then, there was kcon-ny in june, which is why there were early info.",
            "score": 3,
            "author": "mmld_dacy"
        },
        {
            "level": 0,
            "comment": "I feel like fifty fifty might come since they had news articles saying they are starting promoting in the US and UK this summer. \n\nAlso they don’t have enough music for a solo concert so KCON stage would be perfect for them",
            "score": 3,
            "author": "Horror_Train_6950"
        },
        {
            "level": 0,
            "comment": "we found out recently that ateez are the ambassadors for k-collective, which work with kcon to promote small/medium companies. So you can almost guarantee that ateez will be there, they haven’t missed a kcon in probably almost 2 years",
            "score": 5,
            "author": "No-Bumblebee-8865",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ateez live at kcon atp",
                    "score": 5,
                    "author": "wehwuxian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dreamcatcher??",
            "score": 2,
            "author": "HealthyDot9360"
        },
        {
            "level": 0,
            "comment": "This is the first year I’ll be going. So impatient!",
            "score": 2,
            "author": "Suspicious_Front_62"
        },
        {
            "level": 0,
            "comment": "Hopefully we get hints or a lineup soon",
            "score": 1,
            "author": "ChubbsNSFW"
        },
        {
            "level": 0,
            "comment": "Yeah. I really wish they’d release more info especially as I’m willing to commit to the exorbitant $1900 VIP package. But I’d at least like to know who is going to be there and more details about what exactly I’ll be getting….",
            "score": 1,
            "author": "starsplummet"
        },
        {
            "level": 0,
            "comment": "Yeah Kcon always takes thier sweet time posting and promoting the conventions but drop setlist like a month or so before hand. They are notorious for pissing Kpop fans off with this ever since like 2014💀 They still don’t realize fans care about the Idols and not the damn convention itself",
            "score": 1,
            "author": "adamAlexanderGreen"
        }
    ]
}