{
    "id": "142180k",
    "score": 13,
    "title": "Do you guys know what PLAVE mean?",
    "author": "One_Outcome860",
    "date": 1686019850.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/142180k",
    "media_urls": [],
    "other_urls": [],
    "postText": "So i've been following this new kpop group that debuted in March of this year called PLAVE\n\nThey do lives and are so funny 😂 i wanted know if anyone know what there name mean or stand for",
    "comments": [
        {
            "level": 0,
            "comment": "It's a mix of Play + Rêve (Dream) which means that they create their own world to achieve their dreams",
            "score": 22,
            "author": "juyeonz",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's cool. Ty!",
                    "score": 4,
                    "author": "One_Outcome860",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome! My friend showed me some clips and it's soooo funny when they glitch on their livestreams it's hard not to laugh",
                            "score": 4,
                            "author": "juyeonz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are so goofy, my non kpop friend introduced me to them and i was surprised haha now we both stans they are so effortlessly funny",
                                    "score": 5,
                                    "author": "One_Outcome860"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Plave the AI one?\n\nEdit: according to another post on kpopthoughts this is a touchy subject (god knows why). A lot of people don’t know anything about these groups other than they are animated and some are AI, some are not. Getting touchy about that and downvoting here for asking a simple question based on the only existing knowledge I had is completely ridiculous lol.",
            "score": 9,
            "author": "NobelBangwool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah i mean they are not really ai but real people behind their characters haha",
                    "score": 11,
                    "author": "One_Outcome860",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh okay, I knew there were some differences, and they aren’t related to MAVE in any way right? Interesting their names would be so similar though.",
                            "score": 5,
                            "author": "NobelBangwool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omg That's true! I didn't even think about that ksks but no i really don't think there related haha you should check them out if you haven't they are very funny",
                                    "score": 4,
                                    "author": "One_Outcome860"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}