{
    "id": "142aioo",
    "score": 126,
    "title": "Why do some k-fans seem to dislike groups touring?",
    "author": "trixshott",
    "date": 1686044676.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/142aioo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone,\n\nThis is my first time asking anything so please let me know if this should be somewhere else or edited (I did read the rules but just in case :) ).\n\nI've followed Kpop for a few years now and I've had the very interested phase and some less interested phases (right now I don't follow any group in particular very closely). But over the years every now and then I'll see a tweet or maybe a tiktok about an some korean fans expressing that they wished idols would not tour overseas or something to that affect.\n\nFirstly, I will state the obvious that I don't think this applies to all K-fans - not even the majority - I think it's a very small minority but nonetheless it's just something I've seen pop up every now and then.\n\nAn example I've recently seen was Taeyong (NCT) posted on bubble saying he wanted to tour and have fun all over the world (I think he specifically mentioned South America) and he then said something like \"don't be upset, Korea is the beginning, 127 Seoul\" which I think implies some korean fans on bubble were saying no stay here rather.\n\nAnother example I can vaguely remember from a while ago is I think on a fancall a K-fan directly expressed that they would be upset when the idol goes on tour (I think it was a Hyunjin from Stray Kids fancall iirc) and the idol replied with saying that they received the question a lot or something similar. And just over the years I think there have been more small situations to the same tune.\n\nI'm from Africa, so I obviously don't understand the Korean POV but I thought that touring would be more a sign of success for the group that you support and want to succeed? And it's something that I think many idols have publicly stated they enjoy because they can perform their music to people who want to enjoy it (which they also do in Korea).\n\nSo my question is as the title suggests, why do certain K-fans seem to dislike groups touring? I could maybe understand if the groups spent so much time overseas that they never got to see them perform when they are supposed to be based in Korea, but that doesn't seem to be the case for almost all of these examples.\n\nIs there context here that I'm missing?\n\nThanks!\n\nEdit: This is in reference to some comments under this post. I wanted to clear this immediately. I can't speak to everyone's comment here but I specified *implicitly* that this was not in reference to all korean fans, but a very small minority. This post was also definitely not made with the intention of saying anyone is spoiled or hateful as mentioned in another comment, but asking for context on a situation that has happened a few times.   \nI asked for context because as I said I am not Korean, and as to not speak over anyone I put the question out.\n\nIn the end all of these comments will be based off of what people have seen online from K-fans, and most likely not from k-fans themselves because I don't think this is the platform they usually post on. And as such, should not be regarded as the be-all-end-all of opinions and truth.  \nThat being said, xenophobia obviously has no place in this discussion and I don't expect comments with such an undertone to be made under this post and I am definitely not qualified to speak on it so I hope that this can remain civil. I hope my intentions for this post remain clear and have not caused anyone harm. Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "Because touring would mean less chances of seeing them in Korea. They'd rather the group stays in Korea with 2-3 comebacks in a year, hence more local fansigns events, festival performances, etc., that they can easily go to, rather than just 1 comeback in a year then the rest of the time spend touring everywhere else.",
            "score": 300,
            "author": "cmq827",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't think of this thank you! makes sense,,, mark and haechan of NCT touring and preparing for 2 simultaneous comebacks at any given time just came to mind and made me chuckle. It must be really tiring",
                    "score": 34,
                    "author": "trixshott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, you need to remember there are vastly more mid- to low-tier companies that are desperate to earn more money, which often leads them to branching out internationally when they *don't even have the resource to fund their future promotions*. By the time they try to record their next single/album, they might have depleted their funding on holding small-sized tours for a limited number of fans without gaining enough profit. And it's usually the Korean fans' money and support they have to rely on to fill in the gap - which is not enough.\n\nTo be fair, I've had my fair share of foreign musicians not adding Korea to their world tours - even if they include Japan, Australia or other countries that are equally far away - and having some of the actual Korean tours canceled at the last minute, so I guess it's the same issue everywhere.",
                            "score": 3,
                            "author": "vannarok"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because fans can be fickle as hell here and will unstan if there is not any content or things they can go to. The boy group scene especially, the mid tier groups that have clout change constantly because of touring. If they don't have comebacks, they will lose their Korean fanbase. That's what I understand from my conversations with actual kpop fans in Korea at least 🤷🏻‍♀️",
            "score": 40,
            "author": "jaemjenism"
        },
        {
            "level": 0,
            "comment": "bc they don't like the idea of less time with their idols especially when the alternative is them w/ foreigners. those sorts of fans are always entitled and elitist. it's best not to listen to them",
            "score": 146,
            "author": "BrilliantSea4999"
        },
        {
            "level": 0,
            "comment": "honestly as somebody that lives in korea and is a kpop fan, the Korean fans ARE xenophobic. at least the noisy ones on twitter (im sure most people are just normal people that live normal lives and aren't chronically online). they think they are the \"true\" fans, and are more important than ifans. it's a real thing.",
            "score": 133,
            "author": "hava_97",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can list a handful well known K fansites for my ult group that are openly xenophobic on Twitter. They complained about overseas fans getting a fansign, they tweet racist stuff; they even bullied a foreign fansite until she quit. They will say the most entitled and rude things to the members also, about their appearances and so on. But they’re literally just so loud, and they’re pretty much in their own circle together. It’s a very small group. They’re just very noisy and engaged with the fandom since they’re fansites so a lot of international fans let them color their entire perception of korean fans. But it’s literally less than ten people. Not even a majority of their fansites or anything they just somehow overpower them all in noisiness lol. I often wonder if they’re actually well liked by normal k fans or if they find them irritating too 😭",
                    "score": 54,
                    "author": "Lizunyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I’ve seen lots and lots of drama from (again, a small but vocal section of) kfans about how intl fans shouldn’t get into fansigns or that they should be less, that the idols would rather see Koreans etc.",
                            "score": 5,
                            "author": "28404736"
                        },
                        {
                            "level": 2,
                            "comment": "Oh my god are these specific fandoms?? Or just, a lot of them??",
                            "score": 1,
                            "author": "sakurasangel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know which fandom they're talking about specifically, but EVERY fandom I've been in has people like this.",
                                    "score": 3,
                                    "author": "tragedyorcomedy__"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guess they’re just like i-fans on Twitter at the end of the day then",
                    "score": 10,
                    "author": "roombaonfire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your comment confuses me? Are you saying ifans on Twitter think they are the “true” fans and are more important? Or are you saying they’re chronically online?",
                            "score": 4,
                            "author": "Phadeful",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Both actually, as well as the rest of the parent comment",
                                    "score": 11,
                                    "author": "roombaonfire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I definitely think they’re chronically online but I don’t think it’s that common for them to think or act like they’re the “true” fans or that they’re more important. Except maybe specific fandoms that just have disproportionately large ifanbases vs kfanbases and even then it’s pretty rare?",
                                            "score": 4,
                                            "author": "Phadeful",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I don’t think it’s that common for them to think or act like they’re the “true” fans or that they’re more important. Except maybe specific fandoms that just have disproportionately large ifanbases vs kfanbases and even then it’s pretty rare?\n\nAgreed, and that's precisely why I think i-fans and k-fans have this in common. You often see these type of fans, even though it's most likely a vocal minority.",
                                                    "score": 6,
                                                    "author": "roombaonfire"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;they think they are the \"true\" fans\n\nKinda like how North Koreans thinks they're the \"true\" Koreans. This is SK's version of it lol",
                    "score": -6,
                    "author": "highbrowshow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Weird comparison.",
                            "score": 9,
                            "author": "Kookeu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "well my family's from there so they have strong opinions",
                                    "score": 2,
                                    "author": "highbrowshow"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those Korean fans (edit : not saying all Kfans are like that, but the ones who do that type of comment.) are just entitled as hell for no other reason than xenophobia. They think of themselves as more worthy of the idols' attention by virtue of being Korean. They should imo be told off by the idols, not validated.",
            "score": 116,
            "author": "reiichitanaka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which is why I love that Taeyong actually responded and called it out. Fuck them. Most idols just ignore or worse, butter them up but he right away got annoyed and addressed it \"Why are you getting upset?!\" 💀 Also that man is a walking bubble of gentleness it takes a looot to rile him up lmfao",
                    "score": 58,
                    "author": "SamEsme"
                },
                {
                    "level": 1,
                    "comment": "Ohhhh okay I didn't know this,, thank you! And if I remeber correctly in the Stray Kids Hyunjin fancall, he was quite assertive in saying that the way of thinking was wrong (according to the translation I saw) so I think they are aware of it well.",
                    "score": 29,
                    "author": "trixshott"
                },
                {
                    "level": 1,
                    "comment": "Damn. I don’t think you need to throw xenophobia out there. That’s a bit heavy handed. It’s probably much simpler and that is they don’t want to share because it means less for them.\n\nE: Damn. Toxic people in here. Stop throwing around terms like xenophobia and racism as a weapon. If you’re gonna use it, mean it. If you’re downvoting the fact I’m calling out how this isn’t automatically xenophobia, go look up the definition.",
                    "score": -24,
                    "author": "Macktologist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you read comments from people who literally said they live in Korea even they said that the group of fans this post is referring to are very xenophobic. Idk why you’re acting like that’s impossible or unfathomable I think it’s been shown repeatedly that those loud negative fans are in fact xenophobic",
                            "score": 10,
                            "author": "Phadeful"
                        },
                        {
                            "level": 2,
                            "comment": "\"Not wanting to share\" something with foreigners is kind of textbook xenophobia though ?",
                            "score": 17,
                            "author": "reiichitanaka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not really. I think that’s stretching the definition to make someone look worse than they are. Wanting to keep something special to you to yourself and not share isn’t always because you dislike or fear who may take some of it from you. If a Kpop artist branches out globally they will have less time to dedicate to their Korean fans. Maybe they spend less time speaking Korean. Eventually, that connection lessens. A fans negative reaction to that isn’t automatically because they dislike or fear foreigners, it’s more like because they dislike their artist having less time for them. In fact, I would even go so far as to say the action of branching out could actually bring about xenophobia. Not the other way around. \n\nIf you have an friend visit town and want to spend a bunch of time with them, but they also made plans with other older friends you don’t know well, maybe that bums you out. You’re not bummed because you dislike and fear those other friends.  You’re bummed because you get less time to spend with your friend. Their attention is spread thinner. \n\nI’m also just sort of tired of seeing people assume the worst in others. It’s like we all hate that yet so many people are so quick to do it themselves.",
                                    "score": -3,
                                    "author": "Macktologist"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She is racist. She made a few comments to generalized Kfans but when it’s other way around is not allowed lol.",
                            "score": -15,
                            "author": "ParkGreen9856",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm very critical of Korean *society* as a whole, I'm critiquing the way people *think* (something they can change), not *who they are* (something they cannot change).",
                                    "score": 7,
                                    "author": "reiichitanaka",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was born in Korea, and I’d say that you’re pretty spot on. People here would gasp at how much racism and xenophobia were literally taught to me in schools. I’m sure it’s less now, but I’m in my 30s. Unless they learned to question their teachers (who beat us, by the way, I mean physically), there’s a good chance a few of them absorbed that trash and passed it onto their kids, too. I mean, why would you expect Korea to be beautifully inclusive just because they have good music? Japanese occupation was traumatic for Korean society as a whole and it wasn’t even that long ago in terms of history. Most Korean adults had at least one family member who lived through occupation. Then thanks to the Korean War, which killed 5 million people, every Korean male had to go through mandatory conscription. These are things that can damage a society forever and allow for people to think very protectively about it and view outsiders as threatening.\n\nLook at the non-popularity of non-Koreans inside Korea. It’s not all because of xenophobia, but it’s not a non-factor, either. It’s especially glaring with Lisa because she’s the biggest K-pop star globally by a mile, yet the least popular BP member in Korea. Even if some fans necessarily aren’t xenophobic, if brands cater to xenophobia and are more likely to push Jisoo over Lisa, then everyone in Korea is affected by it. It’s hard not to see a racial component. Felix is plenty popular despite being foreign because he’s still considered Korean by blood, though he barely spoke Korean when he first arrived, but even he is not as popular inside Korea as he is outside.",
                                            "score": 13,
                                            "author": "mittenciel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And I’m here to criticizing ur hypocrisy 🤷‍♂️",
                                            "score": -13,
                                            "author": "ParkGreen9856",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're the one who calls me racist based on comments I made about Korean *mentality*. Which is not what racism is.",
                                                    "score": 8,
                                                    "author": "reiichitanaka",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "U just did it lol like Tf is ‘Korean mentality’. I’ve never known mentality has their own nationality. I guess u racist r just want to put all Koreans in one box.",
                                                            "score": -9,
                                                            "author": "ParkGreen9856",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You're the one who decided I was speaking about all Koreans, when I thought the context was clear enough that I was talking about fans with problematic views.",
                                                                    "score": 9,
                                                                    "author": "reiichitanaka"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "“I’m here to criticizing” really lol at least do it properly 😂",
                                                    "score": -2,
                                                    "author": "Every-Anteater3587"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think it's necessarily gatekeeping like the majority of the comments are saying here. I'm not Korean nor have I been to Korea but I think it's kind of obvious that being an idol fan in Korea comes with being able to see your idols often. During comeback season you get to see them several times a week, for free, at music shows, and this goes on for several weeks, 2-3 times a year. Then you have fansigns, fanmeets, other events outside of comebacks, local concerts, festivals, award shows, end of year shows, radios, mc gigs, regular livestreaming, etc etc. Having your idols be across the world for a huge chunk of time instead of all of that is a pretty new thing for Korean idol fans to have to deal with, but might be hard for intl fans to understand as we have the total opposite experience. \n\nAs an intl fan, I also don't want my groups to be touring all the time because I find it hard to keep up with them. It's obviously great that they tour, they make more money, they see more fans, I get to see some of them because I'm lucky that some of them come to Europe, it's a good thing to tour. But I can't help but feel like I can't wait for it to be over and for them to stay in Korea for a while after so that I can get a steady stream of accessible content again. Having to watch the same concert over and over again for half a year through fancams is boring for me compared to music shows with different fits, variety show appearances, etc etc. I also just find it difficult to keep up with fan based content on social media for more than a few days, especially with algorithms and just the sheer amount of posts, lack of context, poor use of tagging etc. It's probably even more difficult for Korean fans to keep up with considering most of this stuff is in English (with heavy slang) and Korean stan spaces aren't really integrated with intl spaces (depends on the fandom but typically this is how it is).",
            "score": 43,
            "author": "wehwuxian",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are 100% right. If you’re used to frequent interactions with your idols of course it’s frustrating to have that torn away for who knows how long. The closest we ever get is video calls",
                    "score": 12,
                    "author": "Lizunyan"
                },
                {
                    "level": 1,
                    "comment": "This comment really hit the nail on the head. Lack of promotion in Korea can really slow or sometimes halt a groups growth. Look at shinee. When they were really reaching a peak in Korea back in 2013 they left to tour Japan for months, stunting their growth as a group. It’s hard to pick up momentum afterwards too. Tours bring the company a lot of money but at the cost of gaining more fans, and I think for Korea based fans it comes down to a pride thing. Hearing your group everywhere, seeing them in brand deals day to day on the street gives fans a sense of accomplishment to be like “yeah those are my faves” so losing that momentum is hard to see",
                    "score": 2,
                    "author": "Snowfire7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, Korean here and my dad works in tourism, so I had a few discussions regarding K-pop, tourism and international promotion with him.\n\nApart from the \"less opportunities for Korean fans\" aspect, another issue is that many labels seek to rush their artists into going on international tours as a \"cash grab\" so to say, even if they are still relatively new and/or do not have a stable fanbase yet. While most international fans view global popularity as another form of \"success\", it means nothing if those in the local Korean industry do not know them or if the Korean GP do not support them. Local fans and/or listeners are the first to buy CDs to apply for offline fanmeets, stream their songs on Melon, Bugs, etc. (which are still more influential to the Korean charts than Spotify or Youtube Music), purchase tickets for fanmeet events and concerts, and so on. Think about the costs of buying official merch, CDs or overseas - it does cost more than buying it in Korea, but does the full expense go directly to the musicians and/or their labels? How much do the third parties (deliveries, foreign streaming sites, etc.) take from these costs? And which one is more \"reliable\" - a foreign market which has plenty of other artists to listen to, is prone to political incidents (eg. THAAD, religious disputes, war, etc.), and can run into other factors that can disrupt the promotion, or a domestic market that's readily available and offers more immediate support?\n\nThe riskiest part of touring is that it can't ensure that the artists' international popularity will last. Even if the venues sell out, the actual profit can be canceled out depending on the cost of transportation, renting the venue, paying the numerous staff, working out licensing issues (for performing certain songs), etc. Many mid- to small-tier labels have actually gone bankrupt and had their groups fizzle out due to the accrued debt from extensive touring, and in the worst-case scenarios, they may have only had a couple small-sized gigs in Japan or some other foreign country without even holding a proper promotion targeting Korean listeners.\n\nNot everything can be boiled down to \"entitled parasocial weirdos\" if you look closely behind the scenes.\n\nETA: I see that you are from Africa. Do you know the story of Sixto Rodriguez, whose story was covered in the documentary *Searching For The Sugar Man*? Despite his songs gaining significant airplay in Australia, New Zealand, Bostwana, South Africa, and Zimbabwe, and even boosting anti-apartheid cultures in South Africa, Rodriguez himself had quit recording music in 1976 due to his albums selling only a handful of copies and had been working in low-income jobs in his home country of America. Turns out he wasn't even aware of his sudden \"fame\" in the other countries until 1997, when his daughter found a website dedicated to him.",
            "score": 4,
            "author": "vannarok",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is really insightful and interesting, thank you! While I do think parasocial relationships definitely play a part in the answer, this is definitely the kind of context I was curious about. Logically, I would have thought that companies would only send their groups on tour after they had secured enough support and longevity domestically to cover the tour, but obviously the world doesn't work in straight lines haha. It's understandable that it wouldn't sit well with some fans. Thanks! \n\nETA: also I forgot to add that I'm actually not familiar with Sixto Rodriguez, something to look into.",
                    "score": 2,
                    "author": "trixshott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The things these labels and CEOs will do for money, LOL. Another common pattern you can see with these companies is that once their artists have a breakthrough and the label has profited from it, they decide to move to a new building for better accommodation... which often backfires when their *next* comeback doesn't prove to be as successful.\n\nHere's an example involving one of my most favorite musicians, whom I have supported since 2007. Her position is somewhat similar to IU (soloist, not really the stereotypical \"pop idol\" type, is a household name but not as many peole identify as her \"fans\") but her fame came slightly earlier, then fell off the public's radar after a lawsuit and a label change. She released 7 albums, 5 EPs, and a load of digital singles throughout her 15+ years of career in Korea (more if you count her fame in Japan). Last year,  she had her first no.1 in more than a decade when her 6th repackage album became a sleeper hit, and the label responded by moving to a bigger office, accepting the 7th membership for her official fanclub at a more expensive price, and arranging the respective fanmeet at a venue that can hold up to two thousand people... when an estimated *seven* thousand people purchased the membership. The fanmeets for two other mid-tier groups under the same label will be holding their fanmeets at the same venue. The venue could be big enough for their fandoms, but it's too tiny to accommodate the sudden influx of my bias's new fans. What's worse is, the price of the tickets also increased by 1.5 times!",
                            "score": 1,
                            "author": "vannarok"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This isn’t really a question of why groups go on tour, this is a question of why fans are upset when groups go on tour, so while your answer is absolutely valid, it doesn’t really answer the question here.",
                    "score": 3,
                    "author": "dyanekaniko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Re-read my answer. I meant that Korean fans do not approve of the labels attempting to make a hasty run for money without even seeking stabilized support within the domestic industry.",
                            "score": 2,
                            "author": "vannarok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, nvm I see. I guess I could see that, I see fans (usually after the matter) complain about poor management when idol groups go abroad (or like in kep1er’s case a big show that didn’t do them well) before they’ve established a fanbase yet, but imma be honest, idk if most of the upset fans are ones who are thinking like that. A lot of the times I see fans of big groups, both in Korea and internationally, who still get upset when their idols go abroad lol.",
                                    "score": 2,
                                    "author": "dyanekaniko",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because if the artists and labels prepare something for the Korean fans, the international fans get mad, and vice versa. And if they do something for both, it backfires on the label in some way. Neither side can win LOL.\n\nYet it's always the ones stuck in the Reddit bubble and the K-pop bubble who come to rash conclusions that Korean fans are xenophobic, jealous, or entitled. No Melissa, our real Korean world doesn't work like that, and your non-Korean world certainly doesn't either.",
                                            "score": 1,
                                            "author": "vannarok",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a European fan, I feel I am _never_ catered to. My faves haven't toured here since 2019.",
                                                    "score": 2,
                                                    "author": "reiichitanaka",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Mine hasn't had a comeback since 2018... And their label has been put under fire for their staff's unprofessional response (laughing and asking if they still had fans when they \"disbanded\" - they haven't) when a K-fan asked when their lightsticks will be back in stock. The last member in the military will be discharged this autumn, so we're hoping for the members' current individual labels to work out on their contracts and schedules so that they can plan another group comeback.\n\nLike, I get why foreign fans feel like they're left out, but there are times where even *Korean* fans get thrown under the rug - not just about local tours, but also about other basic necessities - and when we genuinely speak up about it, the i-fans miss our point and patronize us for being \"selfish\".",
                                                            "score": 1,
                                                            "author": "vannarok"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s the same as if a U.S. based artist embarked on a lengthy tour with no stops in the states.  I also think the tone doesn’t translate well- it seems to be more of a flirty, kidding “I’ll find another singer”.  I don’t think it’s that serious unless the company is ignoring their domestic fans but NCT is the only example I can think of.  I view it as just cutesy interaction, it doesn’t seem to mean anything unless the higher ups really pay dust to domestic fans.",
            "score": 9,
            "author": "AliTigerBella",
            "replies": [
                {
                    "level": 1,
                    "comment": "But they do concerts in Korea too ? Just less of them because the country is small, and doesn't have much of a concert going culture.",
                    "score": 1,
                    "author": "reiichitanaka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, and they do special events for South Korea and  Japa which we’re akways jealous of! Haha while I’m sure some stays are disappointed (just like poor European stans)!  I do think it’s more of a meme that international fans latched onto way to seriously to prove they’re the superior fans.  I’m sure the guys love different things about each local, I wish everyone could just be happy they’re living their dream of being on stage!!",
                            "score": 2,
                            "author": "AliTigerBella"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because they like to gatekeep the idols and ‘sharing’ them is just not an option. Maybe they are also jealous bec the groups I follow (exo, all nct units) seems to always have so much fun (in concert/free time) in a different country than in SoKor. \n\nOne example for EXO, the fanmeet they did in Seoul was boring asf (day 2 was broadcasted) The crowd was dead (cant even sing a song from a recent album) and they made the members do boring activities. Comparing it to the one in Japan, they did fun games, had more interesting games and overall fan interaction. \n\nFor NCT, the concerts are much alive, the crowd is crazier which makes the members be crazier too. Its also on foreign soil we can see fun travel vlogs etc. \n\nSome k-fans still look down on international fans and think we bring nothing to the table.",
            "score": 34,
            "author": "peachbum7",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is so true. My ult group mx always looks so much happier when performing outside Korea lmao especially in the US. It’s like the energy of foreign audiences matches their energy better and they can just go as crazy as they want\n\nKmbbs in particular definitely get jealous that mx do sexier performances on their world tours first and they make such a fuss that the members have addressed it several times. I’m just like it’s not our fault y’all are boring 🤷🏻‍♀️",
                    "score": 9,
                    "author": "Suitable_Wonder_3285",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When R to V started in Korea, Irene was basically begging the crowd to jump and move and all they wanted to do was shake their stupid lightstick while standing still.\n\nThen they wanna be mad when their idols enjoy audiences elsewhere.",
                            "score": 10,
                            "author": "suaculpa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "All of this+ it's just Korean culture and stan culture in particular is so restrictive. Everyone knows how free-er Blackpink feels in other countries. They can't expect every group to want to conform to one way of being and one type of fanservice especially not a mature and sexy group like NCT like their whole concept is trend-setting lmao good luck w getting them to conform",
                    "score": 12,
                    "author": "SamEsme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where are my fellow intl mbbs at 🥴 this is such an annoying issue that happens every time mx comes to the US to promote something. So much so that mx has to placate the kfans by calling it a “business trip” and they’ll be back soon 😒 it’s incredibly annoying",
            "score": 10,
            "author": "Suitable_Wonder_3285",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a MBB and it's true. They really downplay when they come here. They try hard to make it seem like they aren't excited to go meet fans abroad.\n\nI'm also a Nctzen and 127 did the same thing. On their tours last year they kept trying to placate the Korean Nctzens with posts saying they'll miss them so much and they'll be \"right back\" and they'd just be gone for a 'little trip\" before they left. I mean it was painfully obvious what they were doing. But they did not make any posts or say how they were excited to see international fans....etc\n\nAnd then on Bubbl they kept explicitly talking to the K-fans saying they miss them etc and in turn International fans started to feel slighted because they are touring the States but acting like they weren't, weren't responding to Bubbls from American fans..etc Doyoung specifically kept saying things like he was \"bored\" and he was \"ready to go back to Korea\"   tons of International fans got upset because what? The Korean fans were responding with stuff like \"we'll come rescue you\" etc  \n\nYet when they released their travel vlogs from places like NYC and Cali, they'd had an absolute blast lmao \n\nA USA fan ran into Mark and Taeyong, got a pic with them and posted it on twit. K-fans flooded the post with mean comments saying \"it's unfair\" , \"get away from them\" etc and they don't get to take pics with them and all this stuff like that. After that when people ran into 127  members they started telling people they can't take photos.\n\nSome fansites followed them on their USA tour leg and openly admitted that the USA fans were A LOT of fun, the energy in the crowds was amazing and how happy the members looked on stage. And it's true because they were VERY happy to come here and get that energy they don't receive in SK. Even though they acted otherwise. \n\nSo idk when Taeyong expressed his irritation with it but I'm glad he finally said something and I'm guessing it was a build up from everything that happened last year and early this year with their tour. Because a lot of k-fans were being really harsh with them. \n\nI'm not saying ALL K-Fans are like this but it's obviously something of an issue if the idols speak on it, expressing annoyance or having to act like they aren't excited to go abroad. I do understand they make so much money from K-Fans but I do feel its sad that some of them feel like they are entitled to them or own them.\n\nAnd International fans have so few opportunities to see idols.",
                    "score": 12,
                    "author": "Antiquedahlia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Totally agree. Mx do the same thing framing their tours as “overseas business trips” and as an intl fan I definitely felt a little slighted, even if I understood why they were doing that. But it wouldn’t be an issue if kfans just kept their chill, like this is such a specifically korean fans issue and it’s annoying as hell",
                            "score": 1,
                            "author": "Suitable_Wonder_3285"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously they're in a deep parasocial relationship with their favorite group or idols who are going on a long work trip to go spend time with, gasp, other fans.",
            "score": 9,
            "author": "bayareakpopoff"
        },
        {
            "level": 0,
            "comment": "the only thing i can think of is people being annoyed when groups spend so much time going to america and not other countries, aside from this i wouldnt know tho",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a more popular the view from international fans than korean fans like I was asking about but yes ahaha I can understand this! I wish some of my favourite artists would come to Africa on tour, but it never happens :( I would never say don't go elsewhere though!",
                    "score": 10,
                    "author": "trixshott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i definitely dont know much from what kfans think but a lot of groups definitely need to expand their tours dont they 🥲 i'm from australia so while we get more than you guys in africa its hardly. we've only had 3 major group concerts here the third is in the next week or so but i think we wont get more other than solo people",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "we can only hope!!",
                                    "score": 1,
                                    "author": "trixshott"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "because they’re entitled and believe idols are their property",
            "score": 8,
            "author": "smolspacemomo"
        },
        {
            "level": 0,
            "comment": "You’re asking the wrong people, OP. All you’re gonna get here is “knetz bad”.",
            "score": 6,
            "author": "roombaonfire"
        },
        {
            "level": 0,
            "comment": "Lol what's wrong with this sub. Calm down people",
            "score": 5,
            "author": "Dunkirb"
        },
        {
            "level": 0,
            "comment": "A lot of these people are xenophobic. Same kind of people who attribute groups' successes to the members being all korean (of course by ethnicity *and* nationality) or failure to having foreigners. Also entitlement, they die if they can't see their fave walk out of a convenience store every week, but international fans who, for many groups, are responsible for a great deal of the group's achievements and income, shouldn't even see the group once in the lifetime",
            "score": 4,
            "author": "shinonome-ena"
        },
        {
            "level": 0,
            "comment": "easy. they wanna gatekeeping their idol so bad since they're k-idol from Korea 🙄 basically every fandoms have this similar k-fans mentality and i hate it so much. since they're the first one to be spoiled alot everytime their idol's comeback but they're also the one who have alot to complaint, an ungrateful and always taking their privilege for granted.",
            "score": 1,
            "author": "Geodude-Guru"
        },
        {
            "level": 0,
            "comment": "Jealousy maybe? A lot of times other countries have opportunities the ordinary K fan will never get to experience. Eg: Hi touch, send offs, exclusive fan signs, etc. And it makes it seem like the group/company is favouring I-fans and pouring their efforts overseas instead because they don’t do the same in Korea. \n\nIf it’s specifically in the states, groups can spend a long time (about a month or more) touring and they do lives in the complete opposite timing. It’s a very small thing for me to miss lives but maybe that’s a big thing for some fans?\n\nETA: Though to be fair, as a Kpop fan of over ten years, I’ve only ever seen two groups of fans say this. The Boyz and BTS. I disagree with TBZ’s but I remember agreeing with BTS’.",
            "score": 0,
            "author": "justwannasaysmth",
            "replies": [
                {
                    "level": 1,
                    "comment": "The opportunities of a foreign KPOP fan are miniscule compared to a Korean one. This is a crazy opinion.",
                    "score": 23,
                    "author": "KingCaiser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah true. But there are some interaction opportunities that will *never* happen in Korea. And I’m saying this as someone who has been to multiple stops of the same concert in Asian countries and Korea. Hi touch and signed posters, for example, will never happen in Korea especially for bigger groups like The Boyz and Blackpink. \n\nI do agree with you that this is very very minuscule though! But I’m guessing for some fans, this may add up to paint a bigger picture? Just my mini little hypothesis tbh hahha.",
                            "score": 0,
                            "author": "justwannasaysmth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My brother in christ, K-fans have in person fan-signs FREQUENTLY which are way better than hi-touches😭",
                                    "score": 21,
                                    "author": "storeboughtwaffle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not disagreeing with you, I just find it odd",
                                            "score": 2,
                                            "author": "storeboughtwaffle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "hahaha hi touches are more easily won than fan sign though imo. 30 vs 100s? plus you don’t need to pay more for hi touch. it’s free lol. but yeah i get what u mean.",
                                            "score": 2,
                                            "author": "justwannasaysmth"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol comments here are xenophobic as hell.",
            "score": -10,
            "author": "Capable-Number-211",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Xenophobic ones are the Korean fans who do the comments OP mentioned.\n\nI'm not saying all Koreans are like that but they're a vocal minority.",
                    "score": 22,
                    "author": "reiichitanaka"
                },
                {
                    "level": 1,
                    "comment": "It's reddit after all ¯\\(°_°)/¯",
                    "score": -5,
                    "author": "Assefilmer"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What your describing has not happened.",
                            "score": 3,
                            "author": "KingCaiser"
                        },
                        {
                            "level": 2,
                            "comment": "you're getting downvoted too 💀😭😭",
                            "score": -9,
                            "author": "chicken_sandwichh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would think it's because idols don't seem to perform outside of Seoul much in Korea, so kfans in other cities don't get a chance to see them? I know I'd be annoyed if someone I was a fan of from my country went on world tours without touring their own country first.",
            "score": 1,
            "author": "mapleleafmaggie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, that happens to a lot of lesser-known idols (well, maybe not global tours but Japanese fanmeets and such) who eventually fall off the radar without getting the opportunity to hold a proper event for their Korean fans.\n\nAnd you are correct, tours *within* the country are not as common, unless the artists are popular among the GP or actually have a fanbase big enough to cover multiple cities. Most concerts are limited to Seoul (and Busan at best). This means the fans who live outside the big cities are not as \"privileged\" regarding their chances to see their favs, either. One of my real-life friends lived in Daegu, and I lost count of the countless times she had to reschedule her personal meetings, save up for bus or train tickets, find a taxi to take her home when the Daegu public transportation stopped running, or even reserve a room for one night (if she was going to both days of our fav's weekend concerts). In contrast, I live in a part of Seoul that is very close to one of the most popular concert venues, and I have never missed the subway home since I've lived here.\n\nThat friend had it hard, but I can't imagine the discomfort of the fans living in Jeju who need to *fly* to come all the way to Seoul. I've met one fan who once took the entire day off because they were accepted to a fansign, only for it to get canceled at the last moment. They had to spend the whole day wandering around a part of town they weren't interested in because they couldn't cancel their guesthouse reservation in time, and they had no friends in Seoul. So no, not all of us are the lucky ones who have an automatic pass that will whisk ourselves to the venues.",
                    "score": 2,
                    "author": "vannarok"
                },
                {
                    "level": 1,
                    "comment": "If groups don't do concerts outside of Seoul it's because the agencies know there's not enough demand for it. For boy groups especially, only hardcore fans go to concerts - so they're ready to travel a bit for it. South Korea isn't that big a country.",
                    "score": 1,
                    "author": "reiichitanaka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1. The demand has *always* been there. It's the fact that the agencies do NOT schedule national tours that infuriates the local fans. My bias group is a boy group whose label is considered mid-tier compared to SM, JYP, etc. and they held a tour in Busan in 2014. Another bias is a female soloist, and she went on a tour in Gwangju, Daegu, and Busan only 4 months ago. In contrast, I've seen girl groups with even bigger fanbases (both Korean and international) and better recognition, like Twice or Blackpink, who successfully went on global tours all around the world and held concert some of the biggest concert halls in Korea, but have yet to hold a concert *outside* Seoul.\n2. IMO the \"hardcore fan level\" can't be an exact gauge. It's true that girl groups tend to have more public recognition and attract a bigger pool of fans/listeners, but there are more boy groups that sold out bigger venues. Among all the musicians who performed in KSPO Dome (the biggest venue in Olympic Park, holds up to 15,000 people max., even NKOTB held their Korean concert here in 1992 - although it got canceled after a crowd crush incident), 23 were boy groups (H.O.T were the first, Monsta X was the most recent), 8 were girl groups, 10 were male soloists, and 5 were female soloists.\n3. It's not \"traveling a bit\" when we suffer from [a huge imbalance of long-distance transportation facilities between the metropolitan and non-metropolitan regions](https://twitter.com/LEUMENG/status/1665372599734468611?s=19). If the train from Seoul to Busan takes a minimum of 2 hours and 15 minutes, someone living in Busan [should not have to take a 4-hour train ride to go to Gwangju](https://twitter.com/BONAMANABANANA/status/1665574622379626497?s=19), which is *closer* to Busan than Seoul is. Note that there are no buses that run between those cities, even when both are in the top 10 biggest and most populated cities of Korea. Plus, i-fans always seem to miss out on Jeju, where you need to take a plane to go to the \"mainland\".",
                            "score": 1,
                            "author": "vannarok"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They don’t want to share",
            "score": 0,
            "author": "JKmusclebunny"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 8,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}