{
    "id": "142yvg3",
    "score": 0,
    "title": "Why do artists from different companies go inside other company buildings?",
    "author": "melodyofroses",
    "date": 1686099601.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/142yvg3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just noticed that there are many idols that have filmed tiktoks with idols from different companies inside of their companies building (if that makes sense). For example, BM from KARD filmed with Jisun from Fromis_9 inside the HYBE building. It was really random seeing that because I never imagined KARD inside of the HYBE building. I’ve seen many tiktoks like these now where i’m wondering why these idols are inside of different companies. Is it because they are invited? Is it because they have business with that company? It feels like a disney cross over episode hahah 😅 Can someone explain?",
    "comments": [
        {
            "level": 0,
            "comment": "It could be purely for business (for the business of filming a video), or the idols know someone there, usually another idol or staff. I guess it's just like visiting your friend's workplace. The higher I go up my current corporate ladder, the more I see people go visiting their friend's offices.",
            "score": 18,
            "author": "KittyKatWombat"
        },
        {
            "level": 0,
            "comment": "For work and for collabs. Sometimes idols will practice in the practice rooms of other companies especially if there’s a collab stage or the group’s choreo was choreographed by someone who works for another company. That’s how ab6ix ended up [filming their choreo dance practice in the YGX building](https://youtu.be/6OZbu0RoMwc) because their Loser choreo was choreographed by a YGX dancer.\n\nThere was a point Somi was looking for friends to do tiktok challenges with, so that’s why she visited the BNM building to do a [tiktok challenge with Daehwi &amp; Woojin.](https://youtube.com/shorts/z2PFFSXdSDo?feature=share)\n\nWoojin also visited VIVIZ’s company once to not only exchange tiktok challenges [with his friend SinB](https://youtube.com/shorts/iOACtm5OV-k?feature=share) but also to let VIVIZ members do a [first listen](https://youtu.be/Y66jZiZYmmo) for his solo album title track. \n\nIn general though yeah, they do have to be invited (otherwise how you gonna get past security lol), but it’s probably more like getting invited to the office space of your industry buddy, and doesn’t require a whole lot of notice to the company. Most companies probably don’t even know/care who idols invite over as long as the visit is productive. Some of these company buildings are pretty close to each other too. AB6IX’s company building (BNM) is only like a block away from ASTRO’s company building (Fantagio) so I wouldn’t be surprised if they have even allowed each other to rent practice room time from each other.",
            "score": 5,
            "author": "ivegotaqueso",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh wow i didn’t know the choreography thing! that’s really interesting!",
                    "score": 1,
                    "author": "melodyofroses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fromis and KARD both went on Immortal Songs 2 during their previous comeback. \n\nJ.Seph said he was a fan of theirs and did a tiktok with them (Stay This Way) so I’m assuming that’s why BM did a challenge with them this time.\n\nGenerally speaking though, if you know someone there then you can probably just get access to visit them. If you are friends with an idol at X company you can visit them. Most groups now promote their song on Tiktok by doing a video with their friends or at music shows (ex: Golden Child’s Tag went to HYBE and did videos with Yeonjun).",
            "score": 3,
            "author": "HelloKaramel"
        },
        {
            "level": 0,
            "comment": "there are exceptions like when the idols know each other like chaeyeon going to the jyp building and filming the knock challenge with chaeryeong but most of the time I’m pretty sure it’s just set up by the companies so they can record said tiktoks",
            "score": 14,
            "author": "deaththekiddie",
            "replies": [
                {
                    "level": 1,
                    "comment": "mmm okay it feels kinda strange that they would drive there just to film a tiktok but i guess it’s based on what the fans want and tiktok views",
                    "score": 3,
                    "author": "melodyofroses",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it only happened once or twice for a promotion cycle I'd say it would be more likely that they were there on other business, but because it's basically become the norm for idols to do tiktok challenge collabs and many do 10+ challenge videos, it's probably much more likely to be planned. Some groups might go to greater lengths to find collabs while others just film with whoever is free backstage at music shows.\n\nKard in particular seems to be making a point to do their tiktok challenge with everyone they can think of (they caption their challenges with \"&lt;guest&gt; and everybody #ICKY\"). From a quick count on their instagram they are at nearly 30 clips of them doing the challenge with other idols (this is not including the ones where it's just the members on their own).\n\nAt the end of the day it's a promotion tactic because the fans find it fun and it gets more people to check out the song who might not otherwise listen to the group but chose to watch the tiktok anyway because their faves are in it.\n\nedit: autocorrect typo",
                            "score": 8,
                            "author": "kittymmeow"
                        },
                        {
                            "level": 2,
                            "comment": "a bit strange but to be fair it seems pretty on brand for kpop lol, definitely not the most ridiculous thing I’ve seen",
                            "score": 8,
                            "author": "deaththekiddie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh absolutely 😭",
                                    "score": 2,
                                    "author": "melodyofroses"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, it's not like idols spontaneously combust into flames when they step into another company's building...\n\nIt's not unusual if you go there for business reasons (Which is what most tiktok challenges are) or if you know someone. Some companies rent out rehearsal and recording studios. Song writing workshops often include people from different lables and freelancers. It's quite normal to have people not related to the company in their building every day.",
            "score": 4,
            "author": "FutureLegitimate3424",
            "replies": [
                {
                    "level": 1,
                    "comment": "hahaha okay thanks that makes sense! another person said that it could also be because of choreographers and things like that. never thought about it that way 😅",
                    "score": 2,
                    "author": "melodyofroses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kard is there for   signing to hybe.  No other reason is big enough except this /s",
            "score": 1,
            "author": "archd3"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure it's because they are invited. It seems like nowadays groups are putting out calls for their tiktok challenges.",
            "score": 1,
            "author": "wehwuxian"
        },
        {
            "level": 0,
            "comment": "Fromis_9 is Hybe though?",
            "score": -2,
            "author": "kthnxybe",
            "replies": [
                {
                    "level": 1,
                    "comment": "i’m talking about BM from KARD inside of HYBE",
                    "score": 3,
                    "author": "melodyofroses",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes and you said he filmed with a Fromis_9 member",
                            "score": -1,
                            "author": "kthnxybe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yes i mean like how come BM is inside of the HYBE building when he (i’m guessing) has little to no relation to Fromis_9 or other HYBE artists. And not specific to BM but other idols that enter other company buildings.",
                                    "score": 6,
                                    "author": "melodyofroses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just assumed he knew Jisun personally and that they’re friends. He’s one of those idols who have a lot of friends in the industry I think.  I’m thinking she probably found it more convenient to film there and wanted to do a challenge or tik tok with him?",
                                            "score": 0,
                                            "author": "kthnxybe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m confused why I am being downvoted",
                                                    "score": 1,
                                                    "author": "kthnxybe"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}