{
    "id": "14408yd",
    "score": 63,
    "title": "Idols who danced before joining a company",
    "author": "rnbgal",
    "date": 1686201791.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/14408yd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Who are some idols who had a passion for dancing before they joined a company and became trainees? What kind of dance did they specialize in?",
    "comments": [
        {
            "level": 0,
            "comment": "Kai trained in ballet even before he joined SM ENT.  He said he’d be a ballet artist if he didn’t choose the idol path.",
            "score": 81,
            "author": "Direct_Bathroom_6242",
            "replies": [
                {
                    "level": 1,
                    "comment": "That explains so much!",
                    "score": 6,
                    "author": "MsShugana"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stray Kids Lee Know started in.. I think middle school and later on joined a dance crew. \n\nHe worked as a professional dancer before joining JYPE. \n\nHis specialty seems to be Hip Hop and street styles.",
            "score": 121,
            "author": "HappiestCoffeeMug",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was also a backup dancer for BTS during one of their tours.",
                    "score": 54,
                    "author": "Extendableskeleton"
                },
                {
                    "level": 1,
                    "comment": "I remember watching that TikTok he did with Changbin and when he’s dancing his style..,,I watched that way too many times!  He’s great as an idol dancer but I’d love to see a hip/hop street stage from him, it’s like his whole attitude changed he bodies street style.",
                    "score": 13,
                    "author": "AliTigerBella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ni-ki from Enhypen. There's many many many videos of him dancing as a child if you look on youtube lmao. His family owns a dance studio and had his own workshops. He even danced as a backup dancer for SHINEE at age 11.",
            "score": 59,
            "author": "RedBullWack"
        },
        {
            "level": 0,
            "comment": "Kazuha from LSRFM trained to be a professional ballerina, she got accepted into some of the best ballet schools and joined countless competitions, she’s won a lot aswell \n\nDino from SVT’s parents are dancers and teach dance class(?), they taught Dino how to dance. idk what dance he specialized in but he used to join competitions/tournaments\n\nKang Daniel used to be a b-boy, he started when he was in 8th grade and joined an academy for it. He also enrolled in an arts school for modern dance and ballet, taught b-boying at his old middle school, and was in a b-boying crew\n\nShotaro ex-NCT(🥲) was a dancer in Japan, he was enrolled in the renowned dancing school EXPG and was a backup dancer for Japanese idols/artist\n\nand I don’t know much abt her history but Hayoung from Fromis_9 trained in hip-hop and joined some hip-hop competitions/battles",
            "score": 82,
            "author": "deaththekiddie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shotaro was a backup dancer for GACKT, incredibly famous Japanese singer-songwriter",
                    "score": 14,
                    "author": "iced_caramel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NCT Ten was enrolled in a dance school before, he won the Thai show Teen Superstar which is what gave him the opportunity to join a company, 2 years after Is when he joined SM\n\nexWJSN Cheng Xiao wanted to become a traditional Chinese dancer so she trained in gymnastics, ballet, martial arts, and practical dance. She joined competitions and that’s how she was scouted",
            "score": 24,
            "author": "soohime"
        },
        {
            "level": 0,
            "comment": "NCT’s Winwin was trained in traditional Chinese dance and was one of the top-ranked dancers at his performing arts school; he was considering studying that after high school when SM convinced him to become an idol instead.",
            "score": 19,
            "author": "cubsgirl101"
        },
        {
            "level": 0,
            "comment": "Hanbin from Tempest was a founding member of a Vietnamese dance group called C.A.C. The current members still show support for him and Tempest 🥰\n\n&amp;Team Fuma was a backup dancer for BTS \n\nXiaoting from Kep1er was a competative ballroom dancer",
            "score": 29,
            "author": "spaceymarzii"
        },
        {
            "level": 0,
            "comment": "BamBam was in a dance crew before moving to Korea!",
            "score": 19,
            "author": "hrdst",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to post the pic of baby him and Lisa then realized this page doesn’t allow pictures in comments 😭 *imagine baby him and Lisa in their dance crew*",
                    "score": 4,
                    "author": "puterjess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sung Hanbin from ZB1 was a professional dancer and dance instructor for 2 years before becoming a trainee. He specialised in Wacking and Tutting!! And he's performed as a backup dancer for Wanna One and BTS! \n\nZhang Hao from ZB1 also started dancing in College before joining Yuehua Ent but it was because his mom forced him due to his bad body balance (he was often tumbling down the stairs as a baby lol)",
            "score": 53,
            "author": "Big_Tomorrow886",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yuehua preferred dancers. Zhou Yixuan, Wang Yibo, Cheng Xiao, Wu Xuanyi and Wang Yiren were all dancers before joining Yuehua.",
                    "score": 14,
                    "author": "LingCHN",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zhang Hao's main thing isnt dance actually. Its his vocals lol. Yuehua chased after him for 3 years before he would sign with them. I think they went after him because of his visuals tho. He even won the most handsome during his uni days.",
                            "score": 17,
                            "author": "Big_Tomorrow886"
                        },
                        {
                            "level": 2,
                            "comment": "I think Yena also was a back dancer pre-debut.",
                            "score": 4,
                            "author": "TwoChainsandRollies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, a back dancer for Crayon Pop 'Bar Bar Bar' at year end stage. She mentioned it herself in HMLYCP.",
                                    "score": 4,
                                    "author": "thumbster99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "matthew as well! i don't think he was an instructor, but he definitely danced a lot in canada. i heard he was part of a crew/group, but not sure",
                    "score": 2,
                    "author": "deobi02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "(Former) NCT Shotaro was a professional dancer before he debuted. He danced on tic tok as well as a professional dancer.",
            "score": 16,
            "author": "AfraidInspection2894",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s the first one that comes to mind because that man was a dancer and a f’in awesome one, I hope that in his new unit they’ll let him show his style more vs idol dancing- his TikToks spawned a whole fandom :)",
                    "score": 4,
                    "author": "AliTigerBella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Park Jimin and J-Hope of BTS both had dancing backgrounds before joining Bighit. \n\nJ-Hope was part of a dance crew called Neuron and trained at several dance academies. He was competing and dancing at a competitive level. His specialty is hip-hop and freestyle dance. \n\nJimin attended Busan High School of the Arts for dance. His specialization is contemporary dance. \n\nThis page has some of their early dance performances embedded which are very cute since they were so young: [x](https://bts101.info/resources-list/predebut-bts/#individual-members-before-bighit).",
            "score": 61,
            "author": "boringestlawyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "jimin did hiphop and popping too in middle school",
                    "score": 3,
                    "author": "Specific-War6864"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jhope - street dancing\n\nJimin - contemporary &amp; hip-hop dancing (His dancing is so beautiful and unique because you can clearly see the influence of both styles in the way he dances. He's my favorite dancer period).",
            "score": 18,
            "author": "beepboopbrrr"
        },
        {
            "level": 0,
            "comment": "Seventeen's The8 trained in Bboy and also martial arts??  Before joining a company.  He still does tricks onstage lmao",
            "score": 17,
            "author": "Arivainosani"
        },
        {
            "level": 0,
            "comment": "ATEEZ's Yunho and Mingi (part of the dance line) attended Seungri's Dance Academy prior to auditioning at KQ. Mingi is more of a free style dancer while Yunho is very technical / exact.\n\nboth excel at Hip Hop styles, which makes sense considering what ATEEZ's pre-debut dance videos [were](https://www.youtube.com/watch?v=5A9EMLrURS8&amp;pp=ygULYXRlZXogZGFuY2U%3D). here is Yunho's [solo](https://www.youtube.com/watch?v=SOqaA-Mbw88&amp;pp=ygURYXRlZXogeXVuaG8gZGFuY2U%3D) one and Mingi's Free Styling in [this](https://www.youtube.com/watch?v=OLsEi-zcMdE&amp;pp=ygUPa3EgZmVsbGF6IGRhbmNl) before debut in LA.",
            "score": 11,
            "author": "mdragnarok"
        },
        {
            "level": 0,
            "comment": "GOT7's  Jay B was a b-boy before joining JYP!",
            "score": 3,
            "author": "mirrorxdragon"
        },
        {
            "level": 0,
            "comment": "GOT7 Yugyeom joined a dance crew called Body &amp; Soul when he was 14 and competed in multiple dance competitions. He placed 2nd in a national house dance competition and was invited to and attended a dance academy prior to joining JYPE. \n\nJay B was part of a competitive b-boy crew in middle school which is how he was scouted and encouraged to audition for JYPE. \n\nBamBam was also part of a dance crew with BLACKPINK’s Lisa in Thailand before joining JYPE and moving to SK.\n\nAnd Jinyoung took dance lessons in middle school to improve his dancing which is how he made it into JYPE. He and Jay B met at JYPE’s open auditions where they became a dance team duo and placed 1st out of 10,000 applicants.",
            "score": 3,
            "author": "serhae114"
        },
        {
            "level": 0,
            "comment": "Tribe's Mire was a competitive locker in Japan predebut; iirc Nature's Haru competed in the dancehall scene as well, and Loha is at least very proficient in street dance generally though I don't know if she is/was a battler or pro otherwise. Haru talked about in on their most recent episode of Weekly Idol, Loha demonstrates it whenever she can, and there's at least one solo choreography video on Tribe's official channel where Mire gets to do locking again.\n\nEx-ANS/Major's Bian, Yoo Jiwon, is really really good at hiphop and iirc there are videos she shot predebut which demonstrate this; doubtless though she learned and got very good well before debut, so I'll count her here.\n\nUnsure about the following, in so far as idk much about them before fairly recently, but I feel I should mention them:\n\nWooAh are rapidly becoming beasts but I don't know if they've all been training so heavily and in street styles since predebut, but given Nana's capabilities my guess would be she probably has. Apparently Lightsum's Chowon did vogue or whacking predebut (I forget which atm), according to her profile during.. I want to say Produce? but I don't know to what proficiency or if she's demonstrated it anywhere properly. Also from Lightsum Juhyeon is an amazing dancer, but I don't know the details of her predebut experience cause I haven't seen a whole lot of Lightsum content.",
            "score": 8,
            "author": "SeraphOfTwilight"
        },
        {
            "level": 0,
            "comment": "GOT7 Yugyeom was in a dance crew before he joined JYP. He did house dancing. \n\nBlackpink Lisa and GOT7 BamBam were in a dance crew in Thailand together before they went to Korea.",
            "score": 11,
            "author": "piff1214"
        },
        {
            "level": 0,
            "comment": "- N from VIXX, he won several contemporary dance competitions \n- Feeldog, of Bigstar and UNB, (currently in the dance crew BANKTWOBROTHERS), specialized in Hip Hop. He is probably the (now former) idol with the most prominent career in the underground dance scene\n- Lee Euijin of A.cian, Bigflo, UNB (currently in dance crew DA’ONEZ) specialized mostly in popping, also prominent in the underground circuit.",
            "score": 10,
            "author": "No_Math6278"
        },
        {
            "level": 0,
            "comment": "Kwon Eunbi, she is back dancer of Girls day when she still in high-school.",
            "score": 8,
            "author": "archd3"
        },
        {
            "level": 0,
            "comment": "J-hope and Jimin of BTS.  J-hope was a hip-hop/street dancer who had won national competitions and Jimin was studying contemporary dance (and was pretty amazing at it). I think you can tell their technique is just a cut above - like J-hope has control of every single muscle in his body and it looks like his bones are fluid when he dances.  And Jimin just completes all his moves with his arms and hands and legs in a way that says “dancer”.",
            "score": 22,
            "author": "CenterOfGravitas"
        },
        {
            "level": 0,
            "comment": "Off the top of my head from Idols I know, BTS's Jhope did street dance and Jimin did modern/contemporary. GOT7 BamBam and Blackpink Lisa were in a dance crew together. Seventeen's The8 was a b-boy. WayV/NCT 's Winwin studied Chinese traditional dance. Shotaro was a professional dancer and really famous on tiktok.",
            "score": 7,
            "author": "Nightshade-628"
        },
        {
            "level": 0,
            "comment": "Vanner has 3 members who were dance instructors, and one who is a voice coach.  Gon got recruited because he was their dance instructor 😂.",
            "score": 7,
            "author": "nimowy"
        },
        {
            "level": 0,
            "comment": "NCT’s Jisung was active in the entertainment industry before being a trainee and I believe he started dancing when his kindergarten teacher recommended him to do so. \n\nPrior to being trainees, Shen Xiaoting did competitive ballroom dancing and Wang Yiren was proficient in traditional Chinese dance\n\nAlso I believe Hanni was in a kpop dance group and did dance covers before she auditioned.",
            "score": 8,
            "author": "SerendipityNinetyOne"
        },
        {
            "level": 0,
            "comment": "LEE KNOW",
            "score": 9,
            "author": "aalvaraya"
        },
        {
            "level": 0,
            "comment": "Onlyoneof s Yoojung has a dancing background.He went to Hanlim Arts School (Department of practical dance).He has experience in many dance genres.I do remember hearing that he was also a backup dance for some girl group but I m not entirely sure. Also Junji form the same group I think too has a dancing background in street dance",
            "score": 5,
            "author": "Sad_icicles",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I do remember hearing that he was also a backup dance for some girl group but I m not entirely sure.\n\nIt was Wonder Girls but it was in an MV where they were doing a flash mob so I don't know if that counts as backup dancing",
                    "score": 3,
                    "author": "starboardwoman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "DKZ's leader Jonghyeong was dancing in competitions before he became a trainee - I know I've seen a vid of baby him covering Don't Wanna Cry floating around, and iirc in one of his debut interviews he mentioned a middle school second place dance prize as one of his biggest accomplishments haha",
            "score": 5,
            "author": "cloverprinceling"
        },
        {
            "level": 0,
            "comment": "Jimin from BTS",
            "score": 4,
            "author": "creamcheese_wonton",
            "replies": [
                {
                    "level": 1,
                    "comment": "And J-Hope, who was relatively well known for his dance skills and won various prizes, including first place in a national dance competition in 2008.",
                    "score": 5,
                    "author": "Trusfrated-Noodle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recently during their new album showcase, Hayoung from Fromis\\_9 mentioned that she used to be a hip-hop dancer and did dance battles.  Anybody know the background for this?  I always had the impression she was more of a goody-goody type person and didn't get that hip-hop attitude vibe from her.",
            "score": 4,
            "author": "hiroo916"
        },
        {
            "level": 0,
            "comment": "momo and mina danced all the way up to being trainees and tzuyu danced until she was 10",
            "score": 3,
            "author": "taebeliever"
        },
        {
            "level": 0,
            "comment": "Yeji from Itzy, Hip-Hop.",
            "score": 4,
            "author": "Massive-Poem-9481"
        },
        {
            "level": 0,
            "comment": "JBJ / HotShot Roh Taehyun is in M’Bitious dance crew and was a Krump dancer before becoming an idol.",
            "score": 2,
            "author": "piff1214"
        },
        {
            "level": 0,
            "comment": "Toppdogg's Hansol. He loves it so much he became a dance teacher after leaving the group.",
            "score": 3,
            "author": "spinereader81",
            "replies": [
                {
                    "level": 1,
                    "comment": "He changed his name to Minsung in 2017",
                    "score": 5,
                    "author": "No_Math6278",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know, but I thought people who barely know Toppdogg would only recognise the stage name.",
                            "score": 3,
                            "author": "spinereader81"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Specializing in tutting, wacking, and hiphop, zb1's Sung hanbin also handles vogue, modern dance, and more. He has been an instructor in dance academies, a backup dancer, he has also participated and won dance battles in halls and underground places.",
            "score": 3,
            "author": "Melanniczenie"
        },
        {
            "level": 0,
            "comment": "Olivia Hye and Yves from LOONA. Olivia only trained for one day lol",
            "score": 3,
            "author": "ManOfTheSea_"
        },
        {
            "level": 0,
            "comment": "Hyungwon from Monsta X. He used to train at one of the same dance academies with J-Hope.",
            "score": 3,
            "author": "alittlepoisonedapple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also Shownu from Monsta X was Lee Hyori's dancer before being an idol",
                    "score": 2,
                    "author": "Ill_Treat_9450470"
                },
                {
                    "level": 1,
                    "comment": "That’s very interesting. I was just reminded today that he also is from Gwangju.",
                    "score": 1,
                    "author": "Trusfrated-Noodle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "f(x) Victoria was trained in Chinese ethnic dance before joining SM! She was scouted for SM at a dance contest in Beijing",
            "score": 2,
            "author": "kodiakfilm"
        },
        {
            "level": 0,
            "comment": "Chung Ha danced before. She was very serious about it before becoming an idol.\n\nBM from Kard as well was really into hip hop dancing.",
            "score": 2,
            "author": "tedcruz_scrotum",
            "replies": [
                {
                    "level": 1,
                    "comment": "More examples that haven't been listed:\n\nShindong from Super Junior was a really good street dancer before joining SM. There were videos of him on the internet before that was even a common thing. He was actually the only Super Junior member who SM personally asked to join.\n\nLisa and BamBam were both dancers and were even part of the same hip hop crew.\n\nMire from TRI.BE danced and was in many competitions\n\nRain danced and hung out in Hongdae were he learned from older kids who were good dancers. His story his really interesting.\n\nThere's actually many idols who were dancers before I could go on forever",
                    "score": 1,
                    "author": "tedcruz_scrotum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lesser know and overlooked fact, Suga did some bboying before joining Big Hit. It probably wasn't a huge focus of his since he said he doesn't really like to dance lol",
                            "score": 1,
                            "author": "tedcruz_scrotum"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before becoming a trainee, FIFTY FIFTY's leader, Saena, was an active dancer and even participated in a show called Dancing High. At the time she went by her real name, Jeong Se-hyun. Not really sure abt her speciality since I'm not well versed in types of dances 😅",
            "score": 1,
            "author": "LHG101"
        },
        {
            "level": 0,
            "comment": "Shownu from Monsta X!! He was a backup dancer for a female idol before joining the idol path",
            "score": 1,
            "author": "bluebrryki"
        },
        {
            "level": 0,
            "comment": "Kazuha was a protege ballerina.",
            "score": 1,
            "author": "yummybaozi"
        },
        {
            "level": 0,
            "comment": "Kazuha from LE SSERAFIM was a ballerina",
            "score": 1,
            "author": "stopsakura10"
        },
        {
            "level": 0,
            "comment": "hanbi from lipbubble was a dancer predebut and is still a dancer following their disbandment. her instagram is hanbi1016",
            "score": 1,
            "author": "Naive_Suggestion7888"
        },
        {
            "level": 0,
            "comment": "Hayoung from fromis9. Won hip hop dance competitions. She is really good at dancing but also an amazing singer and writes songs as well.\n\nSaena from fifty fifty. Seems like she did a variety of genres of dancing. She thought about becoming a professional dancer and was on a dance competition show as a middle schooler before she decided to train to be an idol.",
            "score": 1,
            "author": "Horror_Train_6950"
        },
        {
            "level": 0,
            "comment": "Well:\n\n* TWICE's Mina, EXO's Kai and Le Seraffim's Kazuka did ballet since they were young\n* Itzy's Chaeryeong, soloist and former Iz\\*One Chaeyeon and TWICE's Momo had a passion for dancing since they were very young too and it really shows lol\n* Lee know was a backup dancer for BTS and part of a dance crew\n* Correct me if I'm wrong but I THINK Loona's Olivia Hye and Blackpink's Lisa has experience in a dance crew/some sort of academy.",
            "score": 1,
            "author": "Cold-Effective-9161"
        },
        {
            "level": 0,
            "comment": "Lisa has been dancing since she was 4 I believe. Not sure what kind of dancing she did, but her pre debut videos are insane.",
            "score": 1,
            "author": "kbpclou4"
        },
        {
            "level": 0,
            "comment": "Dawn had a passion for dancing before he joined pentagon. He specialised in popping and I guess he still incorporates that into his routines",
            "score": 1,
            "author": "No-Clue-9155"
        },
        {
            "level": 0,
            "comment": "I'll just say Taemin from SHINee got his start in dance as a freestyle dancer specializing in popping and locking. There are pre-debut videos of him dancing in front of a live audience that got him noticed at SM. I think he was 12 or 13 at the time.",
            "score": 1,
            "author": "Roof-Substantial"
        },
        {
            "level": 0,
            "comment": "ATEEZ Yunho and Mingi attended the same dance academy and were dancing way before joining KQE. And if I'm not mistaken, Seonghwa was in a dance club before joining KQ.",
            "score": 1,
            "author": "aidanslytiny"
        },
        {
            "level": 0,
            "comment": "ZB1 Hanbin was a dance instructor and backup dancer before becoming a trainee at Studio GL1DE. I think it was before he was in Cube, too.",
            "score": 1,
            "author": "Kpop-Multi-stan"
        },
        {
            "level": 0,
            "comment": "he's already been mentioned twice but i feel like he gets left out of these discussions, so i'm mentioning again.\n\nLee Know from Stray Kids is a professional dancer turned idol. he doesn't have the best stage presence (hence why i think he's left out sometimes) but he is a very technically skilled dancer.\n\ni personally dont know how long he's been dancing but i'll go off of the other comment saying since middle school cuz that does sound familiar. he trained in hip hop, joined the dance crew Soul Dance, specifically a crew named Cupcake.\n\nHe was also a backup dancer for BTS during their blood sweat and tears era/tour in japan. He was in university studying to be a choreographer before dropping out to become an idol.",
            "score": 0,
            "author": "Bluetenheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "In what world does he not have good stage presence......??? It's not early 2018 anymore. His style is less dramatic than Hyunjin's but that doesn't make him any worse.",
                    "score": 1,
                    "author": "shinonome-ena",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's just what reddit likes to say lol (i've seen it **many** times, especially in threads like this). i actually have very little opinion on stage presence. i do however find a some of hyunjin's dancing to be cringy (his opening part in s-class, his pre chorus in casee 143). so i guess i do prefer lk's stage presence to hj, or maybe that's just dancing style. \n\nbut from experience, i wouldnt be surprised if someone commented about how his stage presence is lacking, hyunjin is better, who cares about technicality, blah blah blah.  \n\nand yes it is a common opinion that lee know has improved a lot, but i was just covering all bases.\n\ni probably should've said \"people sometimes dont bring him up in these conversations because they don't feel like he has great stage presence.\"",
                            "score": 0,
                            "author": "Bluetenheart"
                        }
                    ]
                }
            ]
        }
    ]
}