{
    "id": "1442f28",
    "score": 0,
    "title": "Would it be okay to bring my seventeen LIGHTSTICK to go see twice?",
    "author": "yahhaiiraa",
    "date": 1686209241.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/1442f28",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m seeing twice this Saturday and I was thinking if it would be okay to bring another groups LIGHTSTICK to a different groups concert. I’m just curious since this is my first time seeing TWICE, but I don’t have their LIGHTSTICK. Any thoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "Personally I'd find that very amusing, because at every kpop concert I've been to, no matter the artists, there's always been at least one candybong (twice lightstick) in the audience. ALWAYS.",
            "score": 5,
            "author": "rachelmig2"
        },
        {
            "level": 0,
            "comment": "kpop stans are so weird about this. just bring jt if you want to. its just another light stick to wave in the crowd to the rhythm",
            "score": 4,
            "author": "popathena"
        },
        {
            "level": 0,
            "comment": "You don’t need a lightstick to enjoy a concert. Please don’t.",
            "score": 20,
            "author": "Protomancer",
            "replies": [
                {
                    "level": 1,
                    "comment": "but if twice the actual group performing encourages and enjoys seeing other groups lightsticks what’s the issue? I went to twicelights and they said they loved seeing the different lightsticks in the audience",
                    "score": 7,
                    "author": "taebeliever"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want to, then yes. That’s all that should matter.",
            "score": 4,
            "author": "Overall_Air_5547"
        },
        {
            "level": 0,
            "comment": " NO that like eatig kfc at maccas",
            "score": 5,
            "author": "MyMomsDildoss",
            "replies": [
                {
                    "level": 1,
                    "comment": "twice has praised other people for bringing different lightsticks",
                    "score": 5,
                    "author": "taebeliever"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yes! twice and onces don’t care about seeing other group lightsticks",
            "score": 3,
            "author": "taebeliever"
        },
        {
            "level": 0,
            "comment": "Bring it. No one in real life would actually care and if they did, they have issues. You have already showed your support of twice by buying their ticket and attending the concert. Lightsticks all have the same function it’s fine.",
            "score": 2,
            "author": "Able-Sink-8334"
        },
        {
            "level": 0,
            "comment": "No",
            "score": 2,
            "author": "notmariyatakeuchi"
        },
        {
            "level": 0,
            "comment": "everyone here is being an asshole. if you think a lightstick will help you have fun during the concert, bring it. not everyone has $60+ to spend on a lightstick they'll use literally once just so you can match. ive been to 10+ kpop concerts and seen plenty of people bring lightsticks not from the \"proper\" group. ive been to kpop concerts where a large portion of the venue were army bongs and the act wasn't bts lmao. no one gives fucking shit as long as you're respectful. \n\ni promise you there are people you will actually be irate with at a concert and the wrong lightstick ain't one.",
            "score": -1,
            "author": "BrilliantSea4999"
        },
        {
            "level": 0,
            "comment": "So I've been to a few different group's concerts by now and I feel like it depends. If you're going to be far away from the stage and your lightstick is just a white light then I don't think anyone other than those around you will notice. Even correct lightsticks sometimes don't pair properly and are just white the entire time.\n\nBut if it's a specific colour, like green, then do not bring it. Also check if the organisers have put out a notice about it. Other lightsticks weren't allowed at Red Velvet's concert in Europe, they put out a notice but there was one girl who managed to sneak her neobong (nct, green) in and everyone around me was throwing shade about it. She was far away from us but I think everyone in the venue could see her lol. Don't be that person.\n\nIf you're going to be visible from the stage, I don't think you should bring another lightstick. The group should see their own lightsticks. But like I said, if you're far away and the lightstick is just white and there's no rules about it then I think it will be fine and you might just get a few looks from people around you.\n\nA lightstick isn't really necessary anyway. It's nice to have one but once the show starts you won't even notice that you don't have one because you'll be so focused on the stages. \n\nBut I will say it was kind of sad to be in the Red Velvet crowd the other night and there being hardly any lights because only rv lightsticks were allowed and the amount they brought sold out in 15 minutes. So that's why I feel like other lightsticks would be fine if they were neutral and not right by the stage because the crowd would have looked nicer tbh.",
            "score": 2,
            "author": "wehwuxian"
        },
        {
            "level": 0,
            "comment": "It is okay to bring any lightstick you want .\nOnces do not care about these things.",
            "score": -1,
            "author": "Fearaxetwice",
            "replies": [
                {
                    "level": 1,
                    "comment": "the comments on this post are giving real gatekeeper energy. has anyone who's saying no actually been to a kpop concert, especially an american stop which OP is going to? if they have they've definitely seen a mismatched lightstick, and if it actually bothered them that much then well... grow up",
                    "score": 1,
                    "author": "BrilliantSea4999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it depends. I would say dont bring it if you're gonna be close to the stage personally cuz in Korea its a big no no so the girls might be confused. Everywhere else, lots of people do it so if you're further from the stage just take it and have fun :)",
            "score": -1,
            "author": "120613"
        },
        {
            "level": 0,
            "comment": "See if the venue allows other lightsticks first. If so you can bring it but there will be fans wondering why you have another group's lightstick at the concert.\n\nIts odd because merch booths sell lightsticks usually and security prefers the only LS being the ones sold(easier to keep track of).\n\nPersonally I don't care but some kpop fans don't like it.",
            "score": 1,
            "author": "Neravariine"
        },
        {
            "level": 0,
            "comment": "Honestly I don’t think anyone irl will say anything to you about it or side eye you. If they do then that’s their problem. All the kpop concerts I’ve been to I have always seen people with other light sticks and even glow sticks so they can join in on the fun. It’s really not that serious lol just double check it the venue allows other light sticks, but I say take it and have fun!!",
            "score": 1,
            "author": "nxxnsse"
        }
    ]
}