{
    "id": "14616n1",
    "score": 273,
    "title": "Where’s everyone going for the protest? Low key sweating because Reddit is my fav Kpop space.",
    "author": "BunnyInTheM00n",
    "date": 1686406016.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/14616n1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Twitter? I don’t enjoy it much so I try to avoid it. Stan Twitter is annoying.\n\nTik tok? It’s short form content and terrible for engagement and meaningful conversation.\n\nIG? God I tried that years ago and it just was weird solo Stan’s yelling at me because I posted members they don’t like. \n\nI guess that leaves Discord? But how does it work. Is it like long form conversations or more short replies to above you?",
    "comments": [
        {
            "level": 0,
            "comment": "i will be going out to touch grass. Jk, probably just be productive and start my homework. \n\nFor the long term i havent thought about it but i think a mix of twitter and from my friend. Reddit is my favourite space and im not ready to leave 🫠",
            "score": 341,
            "author": "eve_lauf_luv",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! I feel foolish even sweating it but hey this is just my truth 🤣",
                    "score": 33,
                    "author": "BunnyInTheM00n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even then i just know i will open reddit instinctively, realise almost nothing is working and die a little inside",
                            "score": 34,
                            "author": "eve_lauf_luv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm gonna hide the app from the main menu and if I still struggle I might even delete it. But now as I'm preparing I'm really feeling how often I just compulsively I open the app whenever",
                                    "score": 13,
                                    "author": "SexySeniorSenpai"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If this goes long term i will definitely be sweating but such is life. Not sure what will happen but it was nice meeting everyone",
                            "score": 21,
                            "author": "eve_lauf_luv"
                        },
                        {
                            "level": 2,
                            "comment": "don’t feel foolish. personally i’m crushed at the idea of some of my favorite subs potentially disappearing forever. reddit has created such a sense of community and connection for me since the pandemic, i’d feel lost without it but trying to be strong 🥲",
                            "score": 13,
                            "author": "yuri_mirae"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm just gonna get news updates from soompi and I guess otherwise just stay offline for a couple days.\n\nEdit: wait, how long is the protest??",
            "score": 91,
            "author": "wehwuxian",
            "replies": [
                {
                    "level": 1,
                    "comment": "2 days but kpopthoughts just turned off INDEFINITELY today. No idea if or when they will be back.",
                    "score": 132,
                    "author": "BunnyInTheM00n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are they actually shutting down indefinitely? They shut down before I could read their post… So sad that was my favourite of the kpop subs",
                            "score": 66,
                            "author": "mimibee97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sadly yes. They have shut down indefinitely and it sounds like they'll only be back once Reddit actually does something right.",
                                    "score": 37,
                                    "author": "doubtfullfreckles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Spec is in full-on \"cater to the advertisers and investors\" mode. I don't think reddit will do the right thing.",
                                            "score": 8,
                                            "author": "Some_Emergency_7325"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've read that some subs are starting the blackout early. I found out through a link Kpopthoughts posted. I hope that sub will be back because I have been writing a long comment (saving from Markdown Mode to a Word doc just in case I lose the comment) for days compiling information for people about the JYJ lawsuit. The thing about that is I don't have the uns of all the people that wanted the information. I just hope the sub isn't gone for good and I can find these people. Would you happen to know an alternative sub similar to Kpopthoughts where I could share that information if Kpopthoughts doesn't come back so that I hopefully get it to the people that want it?",
                            "score": 74,
                            "author": "Aleash89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That sub is unique because is the only place where people can have discussions about kpop topics that cover all groups since it’s looked down to talk about other groups in group specific subs.",
                                    "score": 56,
                                    "author": "mcfw31",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, the discussion part is what I'm looking for. Someone suggested /Kpop, so I will share there, but if there is another place that is good for discussion, I'm open to suggestions.",
                                            "score": 12,
                                            "author": "Aleash89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The thing is that those discussions get shut down almost immediately. Don’t know if someone will make another sub",
                                                    "score": 14,
                                                    "author": "mcfw31",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[Here](https://www.reddit.com/r/kpophelp/comments/14616n1/wheres_everyone_going_for_the_protest_low_key/jnoprkj?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) is a comment from someone who is a Kpophelp and Kpopthoughts mod saying Kpopthoughts will eventually be back. I've good discussions about the CBX lawsuit there so... 🤷🏻‍♀️",
                                                            "score": 13,
                                                            "author": "Aleash89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They deleted it 😅\n\nI’ve also shared stuff I find interesting about charting and had already worked on something else which I think would drive some interesting and productive discussion.\n\nI remember reading your comments so I hope they come back.",
                                                                    "score": 6,
                                                                    "author": "mcfw31",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't have reason atp to disbelieve the mod who said Kpopthoughts will be back at some point. It is good to be memorable when it comes to this I guess.\n\nI will find a place to share what was my comments. I updated  [this](https://twitter.com/Aleash89/status/1665177678683467776?t=YUf4d-zP4B21nVCmEKPu6A&amp;s=19) Twitter thread about the same things I see between the CBX and JYJ lawsuits and my advice to EXO-L to suit Reddit's longer format when I commented it, so that is somewhere. What would have been a sourced comment about the JYJ lawsuit will be posted to my old Livejournal account. (Good to keep it active every so often.) I will link it for sure on my Twitter and other places on Reddit. \n\nEdit: Corrected a typo in the first sentence that changed the meaning of what I meant.",
                                                                            "score": 6,
                                                                            "author": "Aleash89",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thank you!",
                                                                                    "score": 2,
                                                                                    "author": "naotenhoaminima"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was hoping going dark meant no new posts but I could still search for old stuff like a fiendish Kpop crack head",
                                    "score": 11,
                                    "author": "BunnyInTheM00n",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A sub participating in the blackout means that they have gone private. Private means old posts and comments can be seen only by the mods. I can't see my comments in the Kpopthoughts sub (they've gone dark early) where I have been discussing the CBX lawsuit.",
                                            "score": 13,
                                            "author": "Aleash89"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe you already posted there, but a lot of people have still been using the CBX mega thread on /Kpop even though it’s been a week already.",
                                    "score": 9,
                                    "author": "marigoldish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I haven't finished writing yet, but that is a good suggestion. Thank you.",
                                            "score": 7,
                                            "author": "Aleash89"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah its quite a bummer. I understand why they did it but in addition to it being one of the only places people from all fandoms could discuss Kpop topics thoughtfully without being jumped, it also had a LOT of great information about all things Kpop.\n\nI hope eventually they at least allow access to archived posts because I just hate seeing all that information disappear. I know it’s reddits fault and I understand why it happened but still",
                            "score": 13,
                            "author": "boringestlawyer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Completely agree with you, it's really one of the few places people are allowed to talk about kpop topics since r/kpop can't be done for that.",
                                    "score": 5,
                                    "author": "mcfw31"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "48 hours but some subs have said they will extend if a resolution isn't found",
                    "score": 10,
                    "author": "Lunakitten"
                }
            ]
        },
        {
            "level": 0,
            "comment": "honestly no idea. i hate twitter with a vengeance and really do not enjoy discord either. just waiting for it to be back up i guess.",
            "score": 47,
            "author": "FUYANING"
        },
        {
            "level": 0,
            "comment": "I'll probably be on discord with fandom friends, popping in to twitter from time to time, and checking up on Tumblr --- But I think I'll be on ao3 most of the time lol",
            "score": 35,
            "author": "teddy_plushie"
        },
        {
            "level": 0,
            "comment": "I'm on discord. I often prefer to yell into the discord void than reddit to be honest. \n\nAnyway I might just go through my pile of unread books instead of scrolling through social media. 🥲",
            "score": 29,
            "author": "attackpetrel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess that's the only option huh? But my discord is too cluttered, I'm in so many servers that it's difficult too keep track gah",
                    "score": 9,
                    "author": "SexySeniorSenpai"
                },
                {
                    "level": 1,
                    "comment": "Any good discord channels or what ever they might be called? :)",
                    "score": 8,
                    "author": "BunnyInTheM00n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look up \"kpop server index\" and accept the invite. There's a list of kpop servers that you can peruse. However as someone else noted, some invite links have expired. 😕\n\nr/kpop also has its own server which is linked on the sub.",
                            "score": 14,
                            "author": "attackpetrel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a mod on another subreddit so I'll be here lol",
            "score": 20,
            "author": "Rivsmama"
        },
        {
            "level": 0,
            "comment": "If you're looking for something similar to reddit, forums like [onehallyu](https://onehallyu.com/) and the like are probably your best bet.",
            "score": 18,
            "author": "BestInspector",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is onehallyu still around? I haven't thought of them in so long.",
                    "score": 8,
                    "author": "Aleash89"
                },
                {
                    "level": 1,
                    "comment": "I hope people comeback to / new people come to onehallyu, it’s the best place for kpop discussions without Reddit.",
                    "score": 6,
                    "author": "Consuela_no_no"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where you guys will be going once all the subreddits are shut down? Reddit was my source for K-pop news :(",
            "score": 60,
            "author": "tired_of_smiling",
            "replies": [
                {
                    "level": 1,
                    "comment": "Soompi is the original and best website for K-pop news. And it's owned by Viki so it has a business model that's based on being a reliable source instead of just clickbait for ads",
                    "score": 47,
                    "author": "linmanfu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ooo i never knew this about soompi. interesting",
                            "score": 8,
                            "author": "yuri_mirae"
                        },
                        {
                            "level": 2,
                            "comment": "straight to the source, I like it",
                            "score": 4,
                            "author": "Some_Emergency_7325"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Twitter is good for kpop news ( although it is Twitter so ) or you could watch kpop junkee ? His videos are usually very  reliable and come out quite quickly :) or another reliable kpop news channel :)",
                    "score": 12,
                    "author": "Starry-Cherries"
                },
                {
                    "level": 1,
                    "comment": "If you like snark with your accurate news, asianjunkie.com is my favorite. I also use soompi.",
                    "score": 5,
                    "author": "notwhatwehave"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Twitter management is worse than Reddit, and the environment is just chaotic. I don't know how to navigate discord, so I'll just hope Reddit recovers.",
            "score": 17,
            "author": "dan_jeffers"
        },
        {
            "level": 0,
            "comment": "For the protest itself, not really sure yet. I might resort to the other big sites for general kpop updates, or just skip them altogether for these 2 days.\n\nIn terms of after the API changes come into effect... I browse almost entirely on desktop using old Reddit + RES, so I'll stick around for the time being. If they remove old Reddit (which many redditors suspect will happen soon), or too many subs shut down indefinitely, I might keep my account but will probably spend less time on this site in general. Maybe transition to a combination of Reddit + another site.\n\nLike you, I don't have much desire to participate in any of the other large sites. Many people have mentioned Discord, but I personally don't see it as a complete replacement for Reddit - I would prefer something with the same kind of archival value and public visibility that only subreddits provide. Also, some users are discussing moving to Fediverse-based platforms such as Lemmy, which have similar features as Reddit but are more decentralized. That could be something to consider if it takes off.",
            "score": 12,
            "author": "bimaca"
        },
        {
            "level": 0,
            "comment": "I just had this thought. I've been looking up old things on the Livejournal community Omonatheydidnt related to the JYJ lawsuit since old fansites are dead, and I remember there used to be a good community of people there when I was active from 2009-2015. The community is still active, so could that in part become an alternative for people? Here's [the old post](https://omonatheydidnt.livejournal.com/11423594.html) about joining. I'm sure if you started a LJ account and messaged the mods about things people could get accepted.\n\nEdited for clarity.",
            "score": 11,
            "author": "Aleash89",
            "replies": [
                {
                    "level": 1,
                    "comment": "As an avid (or rabid lol) user in my youth I would love an LJ resurgence!!",
                    "score": 2,
                    "author": "pink_nightlight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even with LJ being owned by Russians and people having an alternative because of that, I still see things getting posted to Omona. Though I noticed a lot of things aren't getting posted for my bias group TVXQ.",
                            "score": 2,
                            "author": "Aleash89"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gosh I really hope this works and Reddit listens. Cause some of my fav and most useful subs are doing it and then what am I gonna do.",
            "score": 8,
            "author": "Rain_xo"
        },
        {
            "level": 0,
            "comment": "twitter ig and tiktok are all full of literal children. tumblr is….fine, but it’s full of fanfic and is missing the conversational aspect of reddit that I love. I want to try discord because it’s all conversation based, but I don’t know how to go about finding servers.\n\nwe’re getting down to the wire and I’m pretty nervous tbh. I just got comfy here 😫",
            "score": 58,
            "author": "stonedmoonbunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Look up \"kpop server index.\" It should be the first result on Google. When you join you'll see a list of kpop servers.",
                    "score": 29,
                    "author": "attackpetrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "omg ty you’re a lifesaver",
                            "score": 8,
                            "author": "stonedmoonbunny"
                        },
                        {
                            "level": 2,
                            "comment": "I recently started using Discord and found that Index. The problem is that not all of the servers listed have valid invite links anymore. I wanted to find TVXQ servers, but there were none open. Idk if there are general Kpop servers that would be similar to Kpop help and Kpopthoughts.",
                            "score": 13,
                            "author": "Aleash89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are many general servers; look under social IIRC. Also you can set up Discord's notifications to tell you when the TVXQ category gets updated.",
                                    "score": 4,
                                    "author": "linmanfu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't think Cassiopeia uses Discord a whole lot. Idk how to set up notifications as I'm still pretty new to Discord. I made my own OT2 TVXQ server.",
                                            "score": 5,
                                            "author": "Aleash89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's another solution, good on you!",
                                                    "score": 4,
                                                    "author": "linmanfu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The only thing is that there is only one other person in the server and she isn't very active. I would love for the server to be listed on the Kpop Server Index, but we don't meet the requirements. What I want to find is a good OT2 TVXQ place that respects the OT5 past where can share my love of Yunho and Changmin with an active community of other Cassies. (The TVXQ sub isn't OT2 only and supports members I don't.)",
                                                            "score": 3,
                                                            "author": "Aleash89"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m a mod in an 18+ (not NSFW, just no kids allowed) Kpop discord server if you’re interested! It’s pretty laid back. We have watch parties, discuss various Kpop news, talk about our fave groups and recent comebacks, etc. Generally a chill environment, everyone’s pretty friendly and casual with each other.",
                    "score": 17,
                    "author": "GrillMaster3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh I’m very interested!",
                            "score": 4,
                            "author": "stonedmoonbunny"
                        },
                        {
                            "level": 2,
                            "comment": "I’m interested as well! I’m very much over 18 lol",
                            "score": 3,
                            "author": "BunnyInTheM00n",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Here’s](https://discord.gg/3MY9dFmv) an invite link!",
                                    "score": 8,
                                    "author": "GrillMaster3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much 🥺",
                                            "score": 4,
                                            "author": "rayannuhh"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm also interested!",
                            "score": 4,
                            "author": "LisaMarieCuddy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I replied with a link under one of the other replies!",
                                    "score": 6,
                                    "author": "GrillMaster3"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just joined! (Or at least startrd the verification, I’m still on the discord learning curve.)",
                            "score": 3,
                            "author": "pink_nightlight"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually don't really use much social media as far as kpop goes, other than reddit and well, youtube, obviously. I might have to make a twitter account if things end up going badly, which scares me a lot.\n\nAs far as discord goes, I've used it a lot but in all honesty I don't think it'd work well as a replacement to reddit - as other people have said, it's more suited to short conversations and individual people who you connect with, rather than reddit here which I'd say is more oriented towards communities at large. There is a forum feature, but I haven't seen much successful use of it.\n\nOther than that, I don't think there's really much for organized discussion. Do people actually have conversations in tiktok? I was under the impression it's mostly just like youtube comments, except with less bots and more toxic 12 year olds.",
            "score": 6,
            "author": "michaeng1-2"
        },
        {
            "level": 0,
            "comment": "i don't like twitter either but that's probably where i'll go instead in the meantime. sucks though because reddit is defs my preferred kpop space too",
            "score": 18,
            "author": "bricksandfeathers"
        },
        {
            "level": 0,
            "comment": "Wait what protest?  Reddit shutting down or smthg?",
            "score": 16,
            "author": "countryroad_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reddit is making changes to the API that third-party apps use to connect to Reddit, which includes increasing the price an unreasonable amount to use the API. This will therefore shut down these third-party apps. Many mods use third-party apps for moderation purposes such as to keep away adult content and spam meaning they can't do their jobs with those apps gone. The Reddit blackout calls for people to not use Reddit and subs to go private so that people can't post or comment on June 12 and 13. Some subs have started the blackout early. The hope is that the blackout will have Reddit made changes to the new API policy.",
                    "score": 60,
                    "author": "Aleash89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to mention accessibility 3rd party apps eg. for blind users.",
                            "score": 14,
                            "author": "ireallylovecatsalot"
                        },
                        {
                            "level": 2,
                            "comment": "Oh i see, i personally use the official app and didn’t know third party app shut down thing. Kpopthought is currently private, is it gone forever or will it be back after the protest?",
                            "score": 17,
                            "author": "countryroad_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The popup message when trying to access Kpopthoughts says \"indefinitely,\" so Idk if it will be back. It would be a sad loss if it never comes back.",
                                    "score": 17,
                                    "author": "Aleash89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for the information!",
                                                    "score": 2,
                                                    "author": "Aleash89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "(I deleted because I don’t want my one comment being taken out of context a million times and start rumors, but you can rest assured in it.",
                                                            "score": 4,
                                                            "author": "rachelmig2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "As long as it will eventually be back, I am glad about that. My main thing is I don't want my old comments and posts to be gone forever without having the option to save at least.",
                                                                    "score": 3,
                                                                    "author": "Aleash89"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I only discuss abt kpop on reddit, if all subs shut down indefinitely, i'll be reallyyy sad :((. Other media just arent a good replacement for reddit. Tiktok, twitter or other discussion doesn’t take place as interactively as reddit.",
                                            "score": 15,
                                            "author": "countryroad_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think all Kpop subs will shut down. I have periods were I use Reddit a lot and periods where I don't. The CBX lawsuit has had me using Reddit more, and the discussions I've been having have been on Kpopthoughts. I don't like that I can't even see my comments since Kpopthoughts is private rn. I don't want the things I've said there to be lost along with other things I've posted there over the years since there are things I link back to.",
                                                    "score": 6,
                                                    "author": "Aleash89"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I understand the reasons for protest , but man I really wish I could use reddit for 10th anniversary of BTS. This was my fav K-pop space.",
                            "score": -1,
                            "author": "Poirot19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is happening is more important then their anniversary. Be respectful.",
                                    "score": 2,
                                    "author": "Aleash89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was just expressing my sadness on the situation , I also understand the reason of the protest. Both can be true at the same time , no need to be this agressive",
                                            "score": -1,
                                            "author": "Poirot19",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You added a condition to the first part of what you said by adding that \"but.\" I see where you stand and what is more important to you.",
                                                    "score": 2,
                                                    "author": "Aleash89"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You can still visit subs dedicated to BTS and ARMYs. As far as I know, they're not participating in the two-day blackout. r/Blackpink, r/straykids, and r/LOONA are the only non-general K-pop subs I know of that are doing that.",
                                    "score": 1,
                                    "author": "nielsnable"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A lot of subreddits are going dark to protest Reddit's API policy. You can read about it here: https://www.reddit.com/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps/",
                    "score": 12,
                    "author": "attackpetrel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Twitter for Kpop stuff/news. Other than that, probably going out grocery shopping lol",
            "score": 5,
            "author": "Cyd_arts"
        },
        {
            "level": 0,
            "comment": "I was wondering where the main group I was in on here went. I somehow missed all of these details🤯 All of a sudden I just simply couldn’t find the main Kpop Reddit group I was in. I loved that group! It was so friendly and informative😢 I thought for some reason I got blocked or something. 🤷🏼‍♀️😕",
            "score": 5,
            "author": "LavenderMoxie"
        },
        {
            "level": 0,
            "comment": "I just use Instagram and Tumblr...Instagram is fine, I guess you just have to be careful of bumping into those rude accounts. I've seen them before so Ik what you're talking about. And Tumblr is fine now, it's a lot calmer than how it was years ago. It's dead basically lmao but there is an active kpop community there. Also very pretty kpop gifs too!",
            "score": 4,
            "author": "halenavy19"
        },
        {
            "level": 0,
            "comment": "While this doesn't help with replacing the discussion you get on reddit, might I suggest people spend some time contributing to their favourite artists on https://musicbrainz.org/ ( https://en.wikipedia.org/wiki/Musicbrainz )? Many [services &amp; apps](https://metabrainz.org/supporters) use MusicBrainz data, so you could help your favourites by making sure the information for their [entries](https://musicbrainz.org/collection/b1ed9262-1a52-41e5-8f58-b3e14da9e429) on MusicBrainz is as complete and accurate as possible!",
            "score": 5,
            "author": "GG805"
        },
        {
            "level": 0,
            "comment": "What protest are you all talking about??",
            "score": 3,
            "author": "sakurasangel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have answered this in a comment further down.",
                    "score": 1,
                    "author": "Aleash89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was scrolling through and didn't see it 😅😭",
                            "score": 3,
                            "author": "sakurasangel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's okay. It happens, which is why I commented to let you know.",
                                    "score": 1,
                                    "author": "Aleash89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mostly in discord, ive joined a good amount of servers and even mod so",
            "score": 3,
            "author": "jaemjenism"
        },
        {
            "level": 0,
            "comment": "Why are people protesting?",
            "score": 3,
            "author": "mayssi"
        },
        {
            "level": 0,
            "comment": "what protest? what’s going on?",
            "score": 3,
            "author": "Lucky_Chain7959"
        },
        {
            "level": 0,
            "comment": "I’m going to catch up on all the adulting I’ve been putting off lol, plus I’ve been wanting to see the new spiderverse movie. Long term tho I’m not sure yet. \n\nI’d leave Reddit completely but the kpop community on here is the only thing stopping me. Rn I’m probably going to leave every non-kpop sub I’m in and also try some other platforms. Every time I’ve tried discord it felt like a giant chaotic groupchat which I’m not a fan of but maybe I’m using it wrong idk",
            "score": 3,
            "author": "expiredmilk32"
        },
        {
            "level": 0,
            "comment": "Perhaps someone can start a ~~subreddit~~ community on lemmy or tildes? Or kbin\n\nEdit: looks like [squabbles](https://squabbles.io/s/Kpop) already has one\n\nEdit2: Ok I think all of the alternatives already have kpop subs up and running now (/r/RedditAlternatives)",
            "score": 3,
            "author": "roombaonfire"
        },
        {
            "level": 0,
            "comment": "I use discord and twitter, my fandom is half-dead anywhere so it doesn't matter. Discord has a lot cool features to play with actually, but to be mod, you'll need a bit knowledge to set thing up, and it can be overwhelmed if there're too many people chatting. I know discord rolled out forum feature, I haven't used it much yet.",
            "score": 6,
            "author": "silverrose22"
        },
        {
            "level": 0,
            "comment": "Probably not youtube of course, theres some channel are getting on my veins especially on those short form video",
            "score": 2,
            "author": "fverbloom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shorts creators are sometimes so toxic. They'll say \"no hate\" and drop the most hateful opinion ever or say \"according to netizens\" and who are the netizens? Them, themselves.",
                    "score": 6,
                    "author": "KimAera-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m in discord servers that provide updates on groups i follow: aka photos updates, news updates!",
            "score": 2,
            "author": "myriverishere"
        },
        {
            "level": 0,
            "comment": "Mastodon is pretty cool, and there's a small but active KPop community.",
            "score": 2,
            "author": "iccebberg2"
        },
        {
            "level": 0,
            "comment": "Besides reddit, everywhere else is so toxic or spammy garbage when it comes to kpop imo. Guess just give it some time and do something else?",
            "score": 2,
            "author": "skinnianka"
        },
        {
            "level": 0,
            "comment": "what's this protest thing?",
            "score": 2,
            "author": "linsss777"
        },
        {
            "level": 0,
            "comment": "Wait. What protest?",
            "score": 2,
            "author": "VindictiveVixon"
        },
        {
            "level": 0,
            "comment": "I'll be wasting my time on YouTube mainly. Lol",
            "score": 2,
            "author": "doubtfullfreckles"
        },
        {
            "level": 0,
            "comment": "Tumblr for the win😌",
            "score": 3,
            "author": "seohotonin"
        },
        {
            "level": 0,
            "comment": "I’ll probably head back to quora. I have friends there.",
            "score": 1,
            "author": "VisenyaMartell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice! I have managed to make a couple of friends here that have been great to randomly discuss stuff with. I lack real world Kpop friends and it gets lonely without long form discussions and access to fans who enjoy TALKING.",
                    "score": 2,
                    "author": "BunnyInTheM00n"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We can all survive without KpopReddit for a few days.",
            "score": -9,
            "author": "FinchMandala",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really think you don’t understand that reddits about to change. This isn’t just the protest for 2 days. Some subs have already closed indefinitely with no return.\n\nOf course I can survive. And if it was limited to 2 days I wouldn’t care, but the entire space is now threatened and likey it could change very soon. Permanently.\n\nThen where do fans hang out? Discord I guess",
                    "score": 9,
                    "author": "BunnyInTheM00n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember when Reddit was proclaimed dead by a lot of reddit-users about 5(?) years ago and that wasn't the first time.    \nYet active user base has more than doubled since then, and most of the people that threatened to leave didn't go anywhere.           \n            \nSomething like 90% of the user base doesn't even use third party apps, and wouldn't even have noticed anything happening if it weren't for these protests. While it's an unpopular move by Reddit, Reddit will be completely fine.       \nReddit pretty much has monopoly on this kind of format (not to mention brand recognition), there's no real competitor to go to, so people will stay here.    \nThe protest is a way to get an opinion heard that will resonate more than just the regular threats of leaving, but it's no apocalypse.     \n        \nEven if an astronomical and unrealistic number of something like 700 million people left, there would still be more than twice the number of active users left compared to when I joined Reddit for the first time.    \nWith 90% of users not even being affected by the changes why would they all leave?           \nI don't see the realism in the doom-posts.   \nWhile niche subreddits can always disappear and pop up by their moderators whim at all times, this one (as in r/K-pop)won't go anywhere. If it did, another would take it's place, and I see that as a fairly safe bet.",
                            "score": 1,
                            "author": "WonderfulStrategy337",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel better now! This has been my one place to really delve in depth on everything kpop and id feel sad if it went away",
                                    "score": 3,
                                    "author": "BunnyInTheM00n"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am very aware. I moderate subs. You are looking at a worst-case immediate scenario.\n\nEdit: I didn't say I was an authority on anything. I think people are stressing out unnecessarily. You're not going to lose KpopReddit.",
                            "score": -3,
                            "author": "FinchMandala",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suppose that’s one take on it though I’m a bit more wary.",
                                    "score": 4,
                                    "author": "BunnyInTheM00n",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have *every* right to be wary. This isn't like anything that has happened in the past. I've read that the majority of mods use third-party tools as part of standard moderation protocols, so third parties not being able to use the API will *for sure* change things across the board on Reddit. Some mods have said that they will have to close their subs if they can't use third-party tools seeing as things will get too chaotic. Could that happen to some Kpop subs? It is likely.",
                                            "score": 2,
                                            "author": "Aleash89"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll just continue using twitter. twitter is fine if you follow good people and never go into the search results / click on trending topics. which is fine for me. my mutuals are all very level headed people, most of them have been kpop fans for as long as I have (10+ years) so we have no interest in the drama and keep to ourselves.",
            "score": 1,
            "author": "emergencyjam"
        },
        {
            "level": 0,
            "comment": "Watch and listen to kpop on YouTube",
            "score": 1,
            "author": "sourlemonades"
        },
        {
            "level": 0,
            "comment": "As far as kpop goes, I'm gonna be staying on Discord and twitter (I'm HELLA fucking multifandom outside of kpop, so I'm there for other stuff and art anyway). Mostly Discord because the one I go to is generally peaceful.\n\nDiscord is kinda like reddit DMs, but like multiple people at once. It's really nice, chill, moderated, can have a deep conversation, and things are in a chat so if someone tries to start something, it's much more noticeable than say a \"comment removed by moderator\" here on reddit. Depends on the discord server + activity of your fandom though, since some of them can be pretty slow.",
            "score": 1,
            "author": "Reunilu"
        },
        {
            "level": 0,
            "comment": "Wait what’s happening?",
            "score": 1,
            "author": "Accomplished_Garlic_"
        },
        {
            "level": 0,
            "comment": "Discord for me. Join the official discords for your favorite group's subreddits, if you don't know where to start.\n\nIf it seems too busy, try making a few friends or contacting someone else first if you're connecting with each other &lt;3",
            "score": 1,
            "author": "bananasoymilk"
        },
        {
            "level": 0,
            "comment": "Discord, Mastodon (hard to figure out), Tumblr maybe? That could be revived",
            "score": 1,
            "author": "HooTiiHoo"
        },
        {
            "level": 0,
            "comment": "Kbin.social is the most Reddit-esque of the bunch I've seen. I'll be sad to see rif go as it's the primary way I visited Reddit for years. I might use old Reddit for a while but with so many moderators using this party apps moderation is about to become a shitshow and it won't be long for bots and spam to start running the experience.",
            "score": 1,
            "author": "Onpu",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was my concern too and just abusive users getting away with whatever they want easier. That’s why I avoided certain platforms. I never get anything from seeing negative discussion constantly.\n\nKpop makes me happy. I like to be in spaces that support that! It’s my hobby so losing discussion spaces is concerning. I have zerooooo friends in real life to discuss Kpop with. I have a lot of friends but none remotely like Kpop. Well one. But she only like BP and 2 songs at that. \n\nI came to Reddit /Twice to tell everyone the good news I’d scored tickets this week and everyone was so happy for me. I told two IRL friends and they maybe said…cool? Like they legit don’t care. It’s fine.\n\nAnyways that’s why I like Reddit though",
                    "score": 4,
                    "author": "BunnyInTheM00n"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a robotics program that luckily starts on the day of the boycott. Also Tumblr",
            "score": 1,
            "author": "amityblightvibes"
        },
        {
            "level": 0,
            "comment": "I use FB and IG. I have several groups on FB and I follow the verified IGs of the groups and artists.",
            "score": 1,
            "author": "kofrederick"
        },
        {
            "level": 0,
            "comment": "What protest?",
            "score": 1,
            "author": "ChubbsNSFW"
        },
        {
            "level": 0,
            "comment": "What’s going on? I’m super confused.",
            "score": 1,
            "author": "SwordsOfSanghelios"
        },
        {
            "level": 0,
            "comment": "I'll be on Twitter, just chilling with some friends I met on Discord. I prefer Twitter over Discord as a platform because it's easier to tailor your feed to just the content you want to see and there's less chance of being attacked by trolls since you're not bunched together in a chat with them. But I feel like Discord is better for making friends since the people there tend to be more chill than Stan Twitter.",
            "score": 1,
            "author": "RumbleButtonBumper"
        },
        {
            "level": 0,
            "comment": "tumblr. im on there anyway more than anywhere else. and twitter, but mostly i just scroll and retweet on there... i generally don't interact",
            "score": 1,
            "author": "nym321"
        },
        {
            "level": 0,
            "comment": "Wait what's happening?! Is there a protest or something happening? Reddit has become my favorite space for Kpop news because it allows me to see everything in one place.",
            "score": 1,
            "author": "LoudPen85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reddit is shutting down all their third party apps which makes it harder for moderators as they use these to mod sites, and people who use these apps for good reasons, such as disability. Hence most reddit subs are going private (you wont see anything on these sites, they'll say \"this sub is private\") for June 12-13. Sone are shutting down indefinitely like kpopthoughts or at least until reddit backtracks which is unlikely at this point.",
                    "score": 1,
                    "author": "Casarel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most likely actually doing work",
            "score": 1,
            "author": "l-have-your-cheese"
        },
        {
            "level": 0,
            "comment": "Sorry I’m out of the loop, what’s going?",
            "score": 1,
            "author": "stsoleil"
        },
        {
            "level": 0,
            "comment": "I think you can make it for one day without kpop",
            "score": -20,
            "author": "avis_icarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "A swing and a missed the point;)",
                    "score": 8,
                    "author": "BunnyInTheM00n"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Allkpop is a forum like reddit",
            "score": -23,
            "author": "mannenavstaal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do *not* use *anything* AKP. Many years ago they uploaded nude pictures of a female idol from when she was a minor and coerced into taking them by a then-boyfriend. AKP even tried to sell the pictures to Dispatch, but Dispatch declined to buy and wrote a post exposing AKP for trying to sell the pictures. For the privacy of the idol, do *not* say her name.",
                    "score": 23,
                    "author": "Aleash89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yikes. By the sound of this kpop AKP is worse than Turkey AKP",
                            "score": 1,
                            "author": "mannenavstaal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk Turkey AKP, but the nude photo incident is just the tip of the shit iceberg when it comes to all the awful things they have done throughout their history.",
                                    "score": 1,
                                    "author": "Aleash89"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The AKP forum is separate to the AKP news site and it’s moderated separately. People are too prejudiced lol. I use the forum and it’s fine. As for “supporting” someone like the AKP creator just get ad block it’s not hard.",
                    "score": -14,
                    "author": "Direct_Bathroom_6242"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Youtube?",
            "score": 0,
            "author": "Ill-Combination8861"
        }
    ]
}