{
    "id": "149a1y2",
    "score": 2,
    "title": "Buying concert tickets for shows in Korea - yes24? NCT nation in Korea",
    "author": "FloweryRoad112",
    "date": 1686754678.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/149a1y2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys I'm a foreign nctzen and I really wanted to see nct127 before taeil and taeyong leave for military (which I think is end of this year right?). So I was thinking of going to the Korea NCT nation, but I know it's going to be really hectic and hard to score tickets, especially since there's only 1 concert. Does anyone know where/when the tickets will be on sale? Is it yes24 website? And has anyone been through the process, because I have no idea what to expect. I can't read Korean either, so will there be a translation option for each webpage, and does choosing seats and everything work just like any other website? Do we need a Korean number or address to get tix as a foreigner? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "* *Does anyone know where/when the tickets will be on sale? Is it yes24 website?:* It should be listed on the Yes24 global website that's in English. The Korean site will be in Korean so if you can't read it, it's the Korean site 😆 \n*  *And has anyone been through the process, because I have no idea what to expect*: You can try and ticket on the global site, up till the payment. Or you can go through with payment and cancel the ticket for a refund. \n* *I can't read Korean either, so will there be a translation option for each webpage, and does choosing seats and everything work just like any other website?*: It's in English. Work like which other site? \n* *Do we need a Korean number or address to get tix as a foreigner?*: No.\n\nTLDR: Try to ticket on the global site now. The process will be the same. However, I'm not sure if SM will have membership presale again since they had it for NCT Dream. If so, you'll have to sign up for the NCT membership which I don't know about as I'm not a fan of any SM artist.",
            "score": 1,
            "author": "justwannasaysmth"
        }
    ]
}