{
    "id": "lr438w",
    "score": 419,
    "title": "How are Kpop Idols not bald with just how many times they dye their hair",
    "author": "lunachappell",
    "date": 1614142379.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/lr438w",
    "media_urls": [],
    "other_urls": [],
    "postText": "So this whole question came up with the process of me thinking about how a month ago Jungkook of BTS had black hair and just now for the MTV Unplugged he had blond and today he revealed he had blue just how is he not bald\n\nNot to mention it's a popular Trend in like a clue to know that it come back is coming when at least one member changes their hair color\n\nJust like how are they not bald cuz I dye my hair a couple times and it is like painful because of the bleaching as well as it just like messes up my roots a lot",
    "comments": [
        {
            "level": 0,
            "comment": "Extensions. Especially with GG. Mamamoo Solar has mentioned on her YT channel that her hair is so fried that she has had to cut most of it off (hence her current short short hair). Most of the time, the have extensions for longer styles.",
            "score": 237,
            "author": "randomisawesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "there needs to be a List of kpop idols that have scalps of steel. solar, gowon from loona, dahyun from twice, who else?",
                    "score": 109,
                    "author": "voidaquariums",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hyoyeon from SNSD has been blonde consistently for a decade and only recently dyed her hair brown.",
                            "score": 149,
                            "author": "DAI27",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The fact Hyoyeon was literally blonde for 10 years straight still boggles my mind. And it was SUPER BLONDE. Like how his her hair still attached to her scalp",
                                    "score": 119,
                                    "author": "ziq123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bleaching can be very damaging and some naturally very dark people can't tolerate going light blonde but some people can. Staying consistently blonde is way less damaging than going black to blonde like Taeyeon has though. Once your hair is bleach, you only have to maintain the roots and then use color correctors (which are almost always conditioning). But changing light to dark colors several times a year is a horrible idea and normally no professional would recommend it.",
                                            "score": 17,
                                            "author": "Ronrinesu"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Guys here is a link: [https://www.instagram.com/p/CHE1jJGBKx7/](https://www.instagram.com/p/CHE1jJGBKx7/)",
                                    "score": 20,
                                    "author": "DAI27"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dahyun said in a live recently that her hair was fried from all the dyeing and that she wanted to give it a rest for a while.",
                            "score": 52,
                            "author": "hiroo916"
                        },
                        {
                            "level": 2,
                            "comment": "KEEMBO / Spica - Kim Boa has had bleached hair since debut in 2012 and still hasn’t gone back to her natural hair color. She had red hair at debut, but then dyed her hair blonde and has maintained blonde since",
                            "score": 23,
                            "author": "spica_star"
                        },
                        {
                            "level": 2,
                            "comment": "Rosé from Blackpink",
                            "score": 73,
                            "author": "shasha271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Us fans waiting for them to let Rosé have natural black hair",
                                    "score": 3,
                                    "author": "lividramen"
                                },
                                {
                                    "level": 3,
                                    "comment": "Gosh I love her past 3 hair colors!!!!!",
                                    "score": 8,
                                    "author": "TheYeeeingHeadbanger"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Rosé, Taeyong from NCT, G-dragon, HongJoong and Yeosang from ATEEZ, Mia from Everglow (Mia has consistently got platinum blond hair since Adios and it blows my mind).\n\nSometimes I wonder if those hairs are even real.\n\nEDIT: Well, Yeosang's hair is real, since he takes selcas and when it's unstiled it looks like it's completely [damaged](https://i.imgur.com/m1OqZ7P.jpg) from wearing blond for so long.\n\nEDIT 2:Hair clips are edited.",
                            "score": 13,
                            "author": "Flowy_Aerie_77"
                        },
                        {
                            "level": 2,
                            "comment": "felix from stray kids, had non natural light hair colors since debut in 2018 (blonde for most of the last 2 years) and only Just died his hair black",
                            "score": 9,
                            "author": "eboyisa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bang Chan form Stray Kids too, he had blond hair for God knows how long. I might be wrong, but didn´t the nickname crispy come from said damaged hair?",
                                    "score": 5,
                                    "author": "CreativeCr2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah lol. i didn’t say chan cause he stopped having blonde hair sooner lol",
                                            "score": 4,
                                            "author": "eboyisa"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "E:U from Everglow has had mostly blonde/light-brown hair, but I can't blame her, she rocks it!",
                            "score": 26,
                            "author": "hellomochi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also Onda",
                                    "score": 5,
                                    "author": "Sushilim"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hasnt Sorn from CLC always had like platinum white hair? Or is that judt her natural color",
                                    "score": 15,
                                    "author": "Hexus_Dragonz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dyed. She has dark hair based on her predebut pictures",
                                            "score": 12,
                                            "author": "nigirizushi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That what I figured. I didnt realize idols dyed their hair for that long until I came across Sorn",
                                                    "score": 9,
                                                    "author": "Hexus_Dragonz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And her hair looks so healthy! She needs to drop a hair care tutorial video.",
                                                            "score": 9,
                                                            "author": "Paparoach_Approach",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "sorn said on youtube recently that her hair is fried - she showed the little short bits that had broken off due to damage :(",
                                                                    "score": 20,
                                                                    "author": "mimorins"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel like Alexa is like that as well everytime I see her, her hair is almost the same color as Sorns",
                                                                    "score": 8,
                                                                    "author": "Hexus_Dragonz"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Rose has talked about how gentle hair stylist has to be and how she can barely touch her hair",
                            "score": 6,
                            "author": "Le0Stell1um"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Moonbyul cut her hair for the same reason and Wheein definitely cut her hair in 2020 but she was off camera for most of it so it's not well documented. Hwasa is the one who has gone the longest without bleaching her hair, having had a natural hair color since the 4 Seasons era. Solar actually cut her hair at the very beginning of 2020 to [an incredibly short bob](https://lh3.googleusercontent.com/F7Pf1eWuGrW5Fkl5Vjl2A6r3TFRlxNCZAs_4_YlltjoT6DJHe25tAf_BRl7_WDQKRdyWFWm2aL3UkZXh_8ACakYDKjf_aTQJ4A=w960-rj-nu-e365). But she messed up by bleaching her hair again for her solo comeback and that's why her hair started breaking off.",
                    "score": 9,
                    "author": "bitsysredd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn't hwasa dye her hair for Maria though? To get that red she would have had to bleach her hair first. Though Hwasa has said that her hair doesn't grow very long anymore because of constant bleaching...",
                            "score": 4,
                            "author": "randomisawesome",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah. She also bleached her hair in 2019 for the 4 Seasons tour and you can see it at the very beginning of Queendom. I honestly forgot because it was black for most of Queendom. 😂 Hwasa has cut her hair a lot so it's hard to tell how long it will grow. She wears a bun often these days so it's hard to tell how long her hair is now but I bet it's not much longer than at the beginning of the Hip era. There's a [video](https://youtu.be/ubdu9cf5VLo) of her for her spread in W magazine and she talks about her hair care, among other things,...but the English subs haven't been added yet.",
                                    "score": 4,
                                    "author": "bitsysredd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think she talker about her hair during their Yes I Am era when she first was trying to grow her hair out. I think that was when she mentioned her hair does not grow very long easily. \n\nI think during Maria, her natural hair was down to her shoulders. You can sorta see where her natural hair ends over the extensions.",
                                            "score": 3,
                                            "author": "randomisawesome",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, during the Aya + Dingga promo period there was a distinct and noticeable end between her actual hair and her extensions. My inner Black mom wanted to comb her hair so bad so the extensions would blend with her natural hair but too much combing makes extensions hard to take out. There's a [video](https://youtu.be/tge28bsuOH0?t=225) of Uhm Jung Hwa taking out Lee Hyori's extensions after Refund Sisters promotions and it doesn't seem worth all the trouble. 😂",
                                                    "score": 5,
                                                    "author": "bitsysredd",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is gonna scare me off of ever wanting extentions haha",
                                                            "score": 2,
                                                            "author": "randomisawesome"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My guess is that their hair is extremely damaged but since East Asians naturally have more thicker hair and more protein which keeps the hair stronger but that doesn’t mean Kpop idols don’t bald. There are many Kpop idols who have confessed to them balding and having bald spots because of hair dye. Some have started balding as young as 20 because of hair dying. Plus some companies use filters to make the hair of the idols to make them look nice and healthy. Also some idols may use Hair extensions because it definitely is possible some idols hair unfortunately falls out. Even if their hair is done professionally it still is extremely damaged unfortunately:/.",
            "score": 247,
            "author": "hobi_",
            "replies": [
                {
                    "level": 1,
                    "comment": "They definite use extensions, even the guys, I remember JB pulling out a hair piece on cam years ago.",
                    "score": 59,
                    "author": "SharnaRanwan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup,that alone is proof about how mistreated Kpop idols hair is.",
                            "score": 2,
                            "author": "hobi_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "pls the edits of idols that make them look bald will become reality if they don’t rest their hair",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely will,bet some idols are happy once they go to military because now they get a break 😭",
                            "score": 5,
                            "author": "hobi_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hyunjin from SKZ is going to look like an AirPod 💀💀",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "NOOOO ISTGGGG💀😭",
                                            "score": 5,
                                            "author": "hobi_"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Asian hair that changes hair colour a lot here. It’s a lot of treatments but doable. If their hair dresser know their way around the products, it’s not that bad. They hopefully know how far they can push the hair on bleach. My hair does need a bit more product and care than most hair, but it’s still pretty smooth and soft",
            "score": 72,
            "author": "brucelovesyou"
        },
        {
            "level": 0,
            "comment": "probably lots and lots hair treatment!",
            "score": 99,
            "author": "_rey___"
        },
        {
            "level": 0,
            "comment": "I’m an Asian who dyed her hair blonde/light for nearly 4 years! Honestly just going blonde it’s not too bad on the scalp as long and you get it done by a good hairstylist and with some Olaplex. Plenty of Hollywood stars have naturally dark hair but are bleach blondes, and honestly their hair looks good most of the time.\n\nThe problem is changing colors drastically constantly, which is probably what hurts the idol’s scalps the most. Bleaching an inch of your hair as it grows out isn’t that harsh, but having to put in color corrector to remove dark hair dye and then bleaching is absolutely killer. And I mean you can see when these idols are off schedule without their hair done it looks completely fried.",
            "score": 66,
            "author": "upvotes-please"
        },
        {
            "level": 0,
            "comment": "They're not bald but they're definitely balding. Someone save those poor scalps",
            "score": 36,
            "author": "E1lySym"
        },
        {
            "level": 0,
            "comment": "I guess it also depends on the hair quality and strength of the  idols. IIRC, Namjoon from BTS has pretty strong hair and roots  according to his hair dresser which makes it easy for his hair to recover from the variety of colours his hair has been dyed into till now.",
            "score": 28,
            "author": "spicychilli290",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think his hairdresser once said that his hair had to be bleached eight times in a sitting or two. So they could get the previous color out and then switch it.\n\n*Edit: switched \"dyed\" with \"bleach\"",
                    "score": 8,
                    "author": "Polardragon44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. That's also one other thing he had said.....thanks for reminding me",
                            "score": 7,
                            "author": "spicychilli290"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of seventeen, they seem to have a rotation system to dermine which members will start dyeing their hair for the next comeback. I'm saying this because Wonwoo kept his hair black or brunette for a very long time until they started to change his hair colour like crazy during Fear era but few of the members who were dyeing their hair for previous eras went back to black. Maybe there's a strategy in addition to high quality hair treatment",
            "score": 31,
            "author": "wlstjffls"
        },
        {
            "level": 0,
            "comment": "It's only bleaching that damages your hair, so going from blond to blue doesn't do any harm.",
            "score": 10,
            "author": "kokodrop"
        },
        {
            "level": 0,
            "comment": "Some companies will pay for hair implant treatments, especially for male idols. This is a popular (and expensive) procedure in Korea rn. You may notice certain idols known for their wide forehead or balding hairlines will never show their forehead, and one day they start revealing their perfect handsome hairline. It may be thanks to hair implants!",
            "score": 18,
            "author": "soulsberry"
        },
        {
            "level": 0,
            "comment": "Kim Heechul told in the variety show my little old boy that his scalp was in a bad condition from all the bleaching and therefore he stopped the bleaching for a while before going all blonde with his bob style haha. But he said it does affect his scalp because they do it so often and that his hair is basically fried. And in sj returns yesung went to get a hair treatment at the salon because his scalp was so dry from the bleach. \n\nAs an East-Asian myself, bleaching is really hard on my hair and it does fry my hair if I bleach my hair too often.",
            "score": 10,
            "author": "cphilipsen"
        },
        {
            "level": 0,
            "comment": "For JK, he wasn't really a big fan of dyeing in the previous years. He loved his black or brown hair, so I doubt that his hair is exyremely damaged. Most bizarre color back that I can recall for him was when he once did cherry koo in 2018. \n\nHe got experimental in the late 2020s, surprising us with blonde... and then coloring it blue in the span of 3 months. \n\nBut, the blonde actually works as a primer for the blue. Before dyeing it blue, you have to be blonde first. So, it basically counts as 1 hair color lol. \n\nAlso, other idols who are into coloring their hair often is at risk to have thekr hair damaged. I remember jimin saying that he has to stop constantly changing his hair color because it dries up his hair. \n\nGood alternative would be the temporary color spray, what yoongi used during \"Run\" to achieve mintyoongi lol. \n\nTo add, I think these idols get topnotch haor treatments anyway to lessen the damage brought about by not just coloring, but of constant styling: hair straightening, curling, hairspray etc. Company has to invest in topnptch haor treatment.",
            "score": 35,
            "author": "Aggressive_Average_4"
        },
        {
            "level": 0,
            "comment": "Some idols do have hair balding or thinning from dying especially males, Chenle showed his hair loss on vlive",
            "score": 8,
            "author": "lalalala1230123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can’t believe chenle is balding before he turns 20, like goddammit sm",
                    "score": 3,
                    "author": "Radioactive_pi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly it’s heartbreaking how much of their health idols sacrifice 😭",
                            "score": 3,
                            "author": "lalalala1230123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think some of them use semi permanent colors that don’t damage their hair very bad and they only last for a couple of months!",
            "score": 43,
            "author": "purpleorcas",
            "replies": [
                {
                    "level": 1,
                    "comment": "The more damaging is the bleaching, I think",
                    "score": 39,
                    "author": "nigirizushi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah especially with virgin black hair it can be very damaging to bleach a lot",
                            "score": 9,
                            "author": "purpleorcas"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even permanent dye isn't that damaging by itself, it's more that the dying process destroys the oil that naturally protects your hair, so you need to be more careful when washing it afterwards. Bleaching on the other hand, is much more aggressive, and it will damage both your scalp and hair fiber if you do it often.",
                    "score": 12,
                    "author": "reiichitanaka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dye my hair just as often (if not more) than idols and using semi permantent colours doesnt really do much damage. And a lot of colours fade back to a semblance of blonde so u dont have to bleach every time. Blue and green r the two worst offenders. They dont fade back to blonde and would require a rebleach. Several actually. I rebleached my hair twice juat a month after dying my hair blue and it was still blue afterwards. Just lighter. \nIts the bleaching that does the damage. If they go from having bright green hair to silver blonde then theyv probs melted their hair rip\nIf theyv stuck to pink, red, or orange (even some purples and silvers) then theyr hair is probs not in that bad of a state. \nHair does grow pretty fast tho and especially male idols probably can restart the whole process every 3-4ish months",
            "score": 32,
            "author": "felixismybogancrush",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it depends a bit on the dye and your hair type as well -- if I dye my hair blue, it goes straight back to that yellow/red shade you get from bleaching black hair, so there's no issue with re-dying it. I've noticed recently a lot of idols are leaving their roots natural too, which really minimizes damage.",
                    "score": 10,
                    "author": "kokodrop"
                },
                {
                    "level": 1,
                    "comment": "You can use pink shampoo and conditioners(toners) to pull the green/blue out and then silver toners to get your hair back to a nice blonde colour, instead of bleaching. Might take a few attempts though, but should be nicer for your poor roots.",
                    "score": 6,
                    "author": "KeuliseuOseutin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YoungK from Day6 revealed that for a while in 2017 (when they did the Every Day6 Project) he just had bleached hair and he was spraying it a different colour for each comeback. Sorry if I have made a mistake with the colours, but this is from what I remember:\n\nJAN-MAR: white blonde\n\nAPR: dusky pink\n\nMAY: strawberry blonde\n\nJUN: blue\n\nJUL: orange\n\nAUG: dark reddish purple\n\nSEP-NOV: black\n\nDEC: very dark brown\n\nAs you can see, his scalp eventually needed a break even with this technique!",
            "score": 5,
            "author": "KatieBootss"
        },
        {
            "level": 0,
            "comment": "I've had my hair six different colours in the space of as many months - can confirm I'm not bald!\n\nAs long as you're choosing non-permenant colours, avoiding colours that stain badly (green, blue) or going for opposing colours one after another (eg pink to green), you can have healthy dyed hair. The hair dye itself shouldn't damage your hair - it's really colour stripper, bleach and heat that ruins your hair if you overuse it. Obviously some idols hair is absolutely fried, but it's possible to have crazy colours and keep your hair healthy. Gowon from Loona going from blonde to green is a good example, along with Jungkook going from blonde to blue.",
            "score": 9,
            "author": "Liv__October",
            "replies": [
                {
                    "level": 1,
                    "comment": "That might make since to why I've had different experiences cause I like to dye mine blue and green",
                    "score": 5,
                    "author": "lunachappell"
                },
                {
                    "level": 1,
                    "comment": "Yeah, in the last year I bleached my hair, went silver, then back to blonde, then light blue and dark blue split dye, and have now had it as a turquoise and royal blue split dye since last summer. The semi-permanent colours can be left on for hours and do nothing damage wise (I watched a youtuber who would leave Manic Panic dye in her hair overnight which I personally found a bit weird lol but it won’t do anything bad). It’s only the bleach that is going to damage hair and as long as you don’t use it often, it tends to be alright in most cases. Plus you only really have to do the roots after bleaching it once and unless you’re the lightest shade of blonde there is or a pastel colour, you can get away with not doing the roots for quite some time.",
                    "score": 3,
                    "author": "Hopeless-Cause"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only idols that is saved from balding is Shuhua😏",
            "score": 14,
            "author": "idleknow"
        },
        {
            "level": 0,
            "comment": "Honestly you can see bald patches, lack of thickness and atrocious hair quality in most idols. The reason it’s not overtly notable is because they go for floofy hairstyles that cover up these problems, both genders use hair pieces/ extensions and because most started off with thicker hair, it’s not immediately noticeable how much they’ve thinned already. Plus extensive hair treatments, these idols are going to the best hair stylists and doctors, they’re not leaving anything to chance.",
            "score": 5,
            "author": "real_highlight_reel"
        },
        {
            "level": 0,
            "comment": "I bleach like idols. I maintain a delicate lilac colour from what is originally dark brown hair. I don’t have Asian hair but the principles are the same:\n\n- Olaplex or similar protein treatments will make strands healthier after bleaching. \n\n- Unless you’re over-bleaching at the scalp, as in, bleaching it so so much that it dissolves the hair, the hair won’t fall out at the scalp. The good salon pros that idols visit aren’t going to overbleach them to baldness.\n\nBleaching damages hair and can also damage the scalp, think blisters and skin sensitivity. But it does not stop the hair growing from the follicle. It doesn’t cause baldness. For idols going bald there are other factors causing it. And the appearance of thinner hair from over-bleaching broken stands isn’t baldness as the hair will still grow bar other factors.",
            "score": 3,
            "author": "larablockberry"
        },
        {
            "level": 0,
            "comment": "i mean yeah you have to bleach the hair before you dye it a bright colour so it makes sense it went through 2 phases",
            "score": 3,
            "author": "avis_icarus"
        },
        {
            "level": 0,
            "comment": "yeah way these kpop stars wont go blad in their 40s",
            "score": 3,
            "author": "japhetM"
        },
        {
            "level": 0,
            "comment": "Yeah sometimes it’s concerning to me how often they dye their hair. And it’s so unnecessary for them to change their hair like every comeback or whatever. Do they rlly think we’re gonna get bored if their hair is the same??lol",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, sometimes the colour doesn’t even fit the comeback, like the mv will be solid yellow and black or black and white, apart from someone’s bright ass pink hair",
                    "score": 2,
                    "author": "Radioactive_pi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "how is no one mentioning taeyong from NCT. dudes scalp is probably fried.",
            "score": 3,
            "author": "iwinwinyuwinwinta"
        },
        {
            "level": 0,
            "comment": "They have hair treatment regularly or just simply keep their hair short.",
            "score": 6,
            "author": "Why_mylife"
        },
        {
            "level": 0,
            "comment": "maybe because of the hair products they used ??",
            "score": 5,
            "author": "ekstine"
        },
        {
            "level": 0,
            "comment": "chenele from nct literally showed his bald spots on a livestream lmao no amount of product can help the amount of times they have to bleach their hair. their are 2 idols who come to mind whose hair is most likely damaged beyond repair and should probably just shave it off and start over are bangchan from stray kids &amp; mark from nct. don't get me wrong, i'm genuinely fans of them, but their hair has been looking ROUGH lately lol",
            "score": 4,
            "author": "clubroo"
        },
        {
            "level": 0,
            "comment": "Kasper (artist that competed in Unpretty Rapstar 2 and Show Me the Money) used to guest frequently on a YouTube channel that talked about Korea before she debuted. In her episode where she talked about being a trainee, she mentioned that her company at the time had been forcing her to maintain blonde hair, so her hair would fall out in clumps whenever she brushed it.",
            "score": 2,
            "author": "spica_star"
        },
        {
            "level": 0,
            "comment": "I wonder about Rosies hair lol. She did say her hair is dry during the “twErk” IG live",
            "score": 2,
            "author": "TheYeeeingHeadbanger"
        },
        {
            "level": 0,
            "comment": "Chenle from NCT wears extensions as well as Solar from Mamamoo but she wears them for the length. I think most idols also get hair treatments",
            "score": 2,
            "author": "Doyoungzen"
        },
        {
            "level": 0,
            "comment": "Baekho from Nu'est has naturally curly hair, his hair get straightened for every show and every shoot. Bleach also hurts his scalp and hair so he confessed that he had to have buzzcuts although he hated it. He managed to get his hair a bit longer in Esquire photo shoots last autumn, just for a few months but he was really happy. Then he had to cut it again.",
            "score": 2,
            "author": "bonettes"
        },
        {
            "level": 0,
            "comment": "28 here.\n\nI bleached my hair for a whole year about 5-6 years ago, and my hair took so long to recover. \n\nI have SO MUCH GREY in my hair now, and it doesn’t run in my family to go grey until 35-40. When you attack your scalp with bleach, your hair follicles lose their pigment cells, and you will go grey quickly. \n\nSo from experience, if you want to avoid going grey quickly, please buy a wig. They are more cost effective and depending on quality can be better looking than bleach dyed hair. \n\nAlso, even if your hair doesn’t go grey, the follicular will grow weak- the first 6 inches of hair I grew out when I went back to natural were so weak and I still experience terrible fall out, even with high quality natural products. \n\nTake care of yourselves my loves 💛",
            "score": 2,
            "author": "The-Cat-Lady"
        },
        {
            "level": 0,
            "comment": "It also seems like TXT Yeonjun’s hair/scalp is fried that’s why he’s growing his hair out. He did a vlive once and it looked like his hair was thinning",
            "score": 2,
            "author": "s0nicscrewdriver"
        },
        {
            "level": 0,
            "comment": "I remember the SuperM members mentioned scalp clinics are popular for idols. Apparently there are scalp clinics? 🤷🏻‍♀️",
            "score": 2,
            "author": "Szia813"
        },
        {
            "level": 0,
            "comment": "Pls I swear Jimin dyes his hair every other day but he still has hair what-",
            "score": 2,
            "author": "istolejiminsjam"
        },
        {
            "level": 0,
            "comment": "i think it depends on how strong their scalp is and how well they take care of their hair. \n\ni have not had my natural hair color since 2018. and bleach my hair every month (month  and a half give or take with the pandemic) and i am not balding haha. the idols who tend to keep their hair one color for a long time are just getting possible color touch ups and their roots bleached so they should be fine. \n\nthe reason he was blonde that one day and blue a few days later was most likely him bleaching (which makes it blonde)  and they will color it later to reduce damage and let the scalp calm down. when i first went from black to blonde we did this method to reduce damage so you dont need to use a stronger bleach or double process same day",
            "score": 1,
            "author": "meeeh12345"
        },
        {
            "level": 0,
            "comment": "Sometimes idols have blonde hair and get their hair sprayed or chalked to give color for performances or appearances",
            "score": 1,
            "author": "itzayy"
        },
        {
            "level": 0,
            "comment": "I'm a stan and I honestly feel like they need to calm down on the hair, I mean it's their life their hair, not mines but like they could get bad hair damage and the companies don't realize that, but like ig the reason why JK is dying his hair so much is bc of how bighit only let his hair be shades of brown for like 7 years since debut, so now that he's a grown man lol he decided to bleach and self dye his hair blue. the manz is just experimenting lol",
            "score": 1,
            "author": "Draco_simp_wbu",
            "replies": [
                {
                    "level": 1,
                    "comment": "From what I was told it wasnt that bh didnt want him to dye his hair its just that he didnt want to dye it alot but now he experimenting",
                    "score": 2,
                    "author": "lunachappell"
                },
                {
                    "level": 1,
                    "comment": "I'm fairly certain that Jungkook himself has said that he doesn't like dying his hair that much.",
                    "score": 2,
                    "author": "Sovereign-Over-All"
                }
            ]
        }
    ]
}