{
    "id": "qd9q9n",
    "score": 401,
    "title": "What is your biggest kpop flex?",
    "author": "strawbananajuice",
    "date": 1634878870.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/qd9q9n",
    "media_urls": [],
    "other_urls": [
        "https://youtu.be/Aw70N_aaTWc)"
    ],
    "postText": "My friend and I were reminiscing about funny stuff that happened throughout our years in kpop and I got reminded of this incident. \n\nMy biggest flex - Back in 2013 I managed to snag tickets to watch Exo's (technically first in their career) concert and got a spot in the standing pit by the back barricades right next to the extended stage. They were throwing gifts during encore since it was Christmas eve and lo and behold I caught a pair of gloves that Sehun kissed and threw into the crowd. There is even a [fancam](https://youtu.be/Aw70N_aaTWc) of him doing it. \n\nWould love to hear other fun stories of your kpop flexes!",
    "comments": [
        {
            "level": 0,
            "comment": "not sure if it's a flex?? (esp bc other fans have received replies from our favs, some multiple times on twt and fancafe, but) i won a 30 second long (💔) video call with my ult for a japanese album release event with only one album. i had bought the album weeks after i thought first press had sold out, but was able to get a first press copy (so i got a pc and the lottery code), and entered for the event that day, which had also happened to be the deadline to apply for the call/any overall events for that time.",
            "score": 221,
            "author": "matchasnowbubble",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d consider that a flex AND luck on your side lol.",
                    "score": 31,
                    "author": "Dreamer_Of_Time"
                },
                {
                    "level": 1,
                    "comment": "That’s a big flex",
                    "score": 7,
                    "author": "imelt_slowly"
                },
                {
                    "level": 1,
                    "comment": "So how did the call go? Any memorable bits?",
                    "score": 7,
                    "author": "cuteseal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "unfortunately i spoke too fast bc i was nervous so i don't think he understood anything 💔 but he did listen intently and had the cutest laugh 🥺 and in the beginning he said with a smile \"oh! (my name)! 반가워! (bangawo/tr: nice to meet you)\"",
                            "score": 14,
                            "author": "matchasnowbubble",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha I would have done the same!",
                                    "score": 3,
                                    "author": "cuteseal"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched Monsta X with President Moon and the King of Norway at a private concert in the Oslo opera. Also shook hands with Moon.",
            "score": 163,
            "author": "NishinosanTV",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay but how did all these once in a lifetime events come to happen all at the same time??",
                    "score": 36,
                    "author": "6pcChickenNugget"
                },
                {
                    "level": 1,
                    "comment": "My ult bias, Moon Jaein 😻😻😻",
                    "score": 70,
                    "author": "plantlovinglunatic"
                },
                {
                    "level": 1,
                    "comment": "Holy crap now that’s something. How does it feel being the chosen one?",
                    "score": 11,
                    "author": "airaK_666"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've met Tiffany twice (she remembered me the second time), Sunny and Taeyeon.",
            "score": 93,
            "author": "SpoonAtAGunFight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats amazing! I also wonder how idols remember their fans from just meeting them once or twice since they probably meet a lot of people all the time!",
                    "score": 28,
                    "author": "strawbananajuice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I won a signed polaroid from my ult (there were only 8 winners out of thousands I still can't believe it happened TT) oh! and my fanart got featured in a video they did recently 🥲💗",
            "score": 87,
            "author": "19C0RE",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oops I probably should have put that in the post😅 my ult is Ateez !!",
                            "score": 8,
                            "author": "19C0RE"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "that's so cool! Imagine being that lucky-\n\nalso which video did they feature your fanart? I'd love to see",
                    "score": 3,
                    "author": "Mina_aniM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah thank you!! it's [this video!](https://youtu.be/guZgmxWBdkA) I'm not one of the ones they react to though😅 I'm the rainbow picture at the 6:49 time mark &gt;&lt; (they also put it on screen at 00:51 but it's behind some words lol)",
                            "score": 4,
                            "author": "19C0RE",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ran into Suho &amp; Sehun while they were filming Exo ladder in LA. Didn't approach them ~~which I kinda wish I at least waved~~, but I was close enough that it wouldn't be considered social distancing. I didn't actually notice it was them until I saw the camera guy &amp; had already walked passed them.",
            "score": 74,
            "author": "paradisetrain"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 67,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now I want to know who the group is so that I can support them. This is so sweet 💛",
                    "score": 20,
                    "author": "Individual-Cap941",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i agree!! would love to know too if OP is comfortable with sharing!",
                            "score": 18,
                            "author": "strawbananajuice"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, I want to know too😞😞",
                            "score": 5,
                            "author": "JamonLunar"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for responding! I will definitely be looking into them and I know what I'm listening to on November 4th now ;)",
                                    "score": 7,
                                    "author": "Individual-Cap941",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's a mega flex",
                    "score": 16,
                    "author": "libertysince05"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not exactly sure how impressive either of these are but I was an ASC hangout member for FTISLAND's appearance and I believe less than a year later my video submission for Juniel's appearance on A Song for you was also chosen and aired. \n\nMy fav thing about the ASC appearance is they tweeted out they'd emailed everyone and I hadn't gotten anything so I figured I wasn't in. I ended up getting dm-ed on Twitter later that week that I got in. The stress was only increased by the fact it was college app season.",
            "score": 59,
            "author": "sillyhappyperson"
        },
        {
            "level": 0,
            "comment": "Idk if this fits but I once posted at r/nextfuckinglevel of a video of a behind the scene in seulrene's naughty mv and it gained 11k upvotes",
            "score": 188,
            "author": "WrongdoerOptimal9207",
            "replies": [
                {
                    "level": 1,
                    "comment": "do you have a link to it? would love to see it too!",
                    "score": 30,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Here it is](https://www.reddit.com/r/nextfuckinglevel/comments/lxc6tl/this_behind_the_scenes_footage_of_a_music_video/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
                            "score": 50,
                            "author": "WrongdoerOptimal9207"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh, that was you !",
                    "score": 25,
                    "author": "Nej_Illjuna"
                },
                {
                    "level": 1,
                    "comment": "omg i remember seeing that a while ago actually",
                    "score": 5,
                    "author": "evilsana"
                },
                {
                    "level": 1,
                    "comment": "I remember that",
                    "score": 6,
                    "author": "thatnorthafricangirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure if that's a flex but I went to several kpop concerts for free because of my job. Was pretty awesome to see GD and BTS (my ultis) for free. But I've quit the job so no more concerts for me lol",
            "score": 92,
            "author": "Bubbly_Illustrator72",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok so now please tell me what your job was cause it sounds like a dream.",
                    "score": 21,
                    "author": "waterlilyypond",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "maybe a journalist or fansite employee/person lol idk what they’re called.  i met a person streaming on reddit live once and she said she worked for a fansite and was paid to take pictures and she said she got to meet idols all of the time and get to go to shows for free\n\n\nidk if that’s what the other person did but that definitely sounds like a dream lol",
                            "score": 13,
                            "author": "i_love_mino",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "definitely sounds like fansites picture helpers. they don’t work for any fansites per se but they do attend as much events as they can to take photos and sell them on to fansites who can’t be there but needs the photos to post on their sites. if they get requested to go for a certain event, some will request for the fansite to pay for their tickets to cover the costs",
                                    "score": 8,
                                    "author": "strawbananajuice"
                                },
                                {
                                    "level": 3,
                                    "comment": "photographers for press also get a pass, one of my acquaintances was one and she got into her fav concerts for free",
                                    "score": 6,
                                    "author": "onetrickponySona",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm; I've done press for quite a few kpop shows and got a free ticket for each one I did press for",
                                            "score": 6,
                                            "author": "LakeofTimber"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I worked in the PR/VIP-department of a luxury hotel. We would get free tickets for a lot of concerts (most of the time a very limited amount like 2-3, sometimes no limit). Sometimes it's a gift from the organizer, at other times the concierge got them and no guest bought them. So no, unfortunately not a reporter (even though I would love to be one)",
                            "score": 6,
                            "author": "Bubbly_Illustrator72"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think it’s a flex per say but I often get hearts on my comments on Jessica’s youtube page and if she actually reads the comments then yay! If not then… well at least her team acknowledges me hahah oh and I once walked pass EXO’s Kai but didn’t notice it until later (lol why is that guy so familiar? Hmm maybe I’ve seen him before OH WAIT SH-)",
            "score": 33,
            "author": "Scenareo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The walking pass an idol without knowing and subsequent oh shit! moments are the funniest and saddest! 😂",
                    "score": 17,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I remember being so sad but also thinking I wouldn’t approach him or talk to him anyways? So why does it matter?😂",
                            "score": 4,
                            "author": "Scenareo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "plus it makes a good story! “that time i walked passed kai and didn’t realise it” 😂",
                                    "score": 5,
                                    "author": "strawbananajuice"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like all my flexes are from 2017-2018, haha, I need to do more again! \n\n* Within the first year of me getting into kpop, I went to Tokyo and during the 10 days I was there I went to concerts with Seventeen, BTS, and SMTOWN. So I saw all of EBS in less than two weeks!  \n* I own Jonghyun’s LP, which I bought at SMTOWN COEX for original price. \n* I went to two of Jonghyun’s The Letter concerts at COEX Atrium\n* I pulled a Cherry Bomb Doyoung polaroid from an album (which I traded for my friend’s Taeyong). \n* I was at the pre-recordings for NCT 127’s comeback performances for Cherry Bomb and Zero Mile at MCountdown\n* EXO Kai looked directly at me and winked at Dream Concert. \n* I caught a frisbee signed by EXO Kai at ElyXiOn dot in Seoul. \n* I managed to get a ticket for NU’EST W’s Dejavu comeback showcase and vlive zoomed in on my for a few seconds\n* I was second row at NU’EST W’s Dejavu comeback pre-recording at MCountdown. I’m also visible behind the MCs at the live show\n* I went to a NU’EST W fansign where I impressed Baekho and Ren by saying I came all the way from Sweden. \n* I was given a flower by JR who told me “Hello, beautiful, thank you” in English.",
            "score": 77,
            "author": "Dessidy",
            "replies": [
                {
                    "level": 1,
                    "comment": "noooo i’m so envious of all your encounters with exo!! especially with kai since he’s my bias in exo 😂 \nmy other exo flex would be meeting suho at the airport when he was transiting and he was playing hide and seek using shinee minho as the pillar to hide while looking at us 😂",
                    "score": 27,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohh, but that sounds amazing and hilarious!",
                            "score": 4,
                            "author": "Dessidy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the … the LP? oh my god, i remember almost 2 years into being a shawol and i didn’t know it existed because it was that rare ………. you lucky soul!",
                    "score": 13,
                    "author": "SHATINGSTAR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just saw it in store then and thought it was kind of neat and bought it together with some other merch. I had no idea it would become this sought after! I’ll never part with it. I bought his novel at the same time too!",
                            "score": 11,
                            "author": "Dessidy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😱😱😱😱😱",
                                    "score": 6,
                                    "author": "SHATINGSTAR"
                                },
                                {
                                    "level": 3,
                                    "comment": "You… are lucky. Gosh I wish I had his book, as someone who writes myself. But the cost now ☠️",
                                    "score": 3,
                                    "author": "airaK_666"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I was given a flower by JR who told me “Hello, beautiful, thank you” in English.\n\nDead!!!!!\n\nThose where awesome experiences... I'm excited just reading them.",
                    "score": 3,
                    "author": "libertysince05"
                },
                {
                    "level": 1,
                    "comment": "&gt;I was at the pre-recordings for NCT 127’s comeback performances for Cherry Bomb and Zero Mile at MCountdown\n\nwhat id do to see 0 mile live... and the fact theyre probably never gonna perform it live ever again 😔",
                    "score": 3,
                    "author": "spidey-dust"
                },
                {
                    "level": 1,
                    "comment": "IM FROM SWEDEN TOO",
                    "score": 3,
                    "author": "Fireheart42069"
                }
            ]
        },
        {
            "level": 0,
            "comment": "my bias from vav (ayno) liked 3 of my comments on instagram. it's not like he doesn't do it often but it still made me so happy lol\n\nupdate: now it's 8",
            "score": 28,
            "author": "vivisgotguts",
            "replies": [
                {
                    "level": 1,
                    "comment": "he is my bias too!!! i just answered his question on his caption thats why I commented few mins later i received a notif that he liked my comment omg my heart literally stopped for a min. i immediately checked if he really likes the comments 😂😂😂",
                    "score": 4,
                    "author": "m0chacake",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He’s my bias and literally the only member who hasn’t liked my comments 😭🤧",
                    "score": 3,
                    "author": "doubtfullfreckles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "omg im sorry 😿 it's most likely to work if you're early but sometimes he just doesn't like any, wish you luck next time",
                            "score": 2,
                            "author": "vivisgotguts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1) I had a front and center barricade spot at Sunmi’s last concert in LA. She’s a literal angel &amp; gave lots of fan service to my best friend (who organized the fan event that evening) and I. We ended up in her IG photo from the concert as well. \n\n2)Key responding to my question on an IG live in 2017. I asked if he preferred classic Disney films to Renaissance Disney and he chose classics then named a few he likes. \n\n3) I somehow managed to pull one of Key’s hand taken polaroids from his first album on the first try.\n\n4) zico laughing at me when he walked on stage during his solo tour because I was front row and making fun of him for being late on stage. At the end of the night he held my hands &amp; thanked me for my support to him and block b. (These guys regularly check their socials and respond to bees personally so they can and will recognize fans from online)\n\n5) at svt’s ode to you tour last year right before the pandemic I managed to snag Vernon’s attention with a sign I made him. He spent the whole night unsuccessfully attempting to read it. At vip sendoff he finally waltzed right up to me, read it, and laughed. At the end of sendoff he walked back up to my section, looked around until he found me and directly told me goodnight and he liked my sign. \n\n6) at the same OTY date i started chanting hoshi’s name which prompted the rest of the stadium to follow the chant making hoshi come out on stage and make us do “what time is it? 10:10!!” And a “HORANGHAEEEE” cheer.",
            "score": 27,
            "author": "bbyriss97",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; at svt’s ode to you tour last year right before the pandemic I managed to snag Vernon’s attention with a sign I made him. He spent the whole night unsuccessfully attempting to read it. At vip sendoff he finally waltzed right up to me, read it, and laughed. At the end of sendoff he walked back up to my section, looked around until he found me and directly told me goodnight and he liked my sign.  \n  \nNow I’m also curious, what did the sign say?",
                    "score": 5,
                    "author": "Dessidy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I posted about it on r/kpopthoughts a while back but my girlfriend wrote a b-side for a girl group! She mentioned it completely out of nowhere and I highkey freaked out. Didn't know the song and I don't follow ggs but I'm still super impressed\n\nI didn't wanna mention which group/song and ended up deleting the post but I still think it's cool",
            "score": 68,
            "author": "TwoHungryBlackbirdss",
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s amazing!!!",
                    "score": 9,
                    "author": "strawbananajuice"
                },
                {
                    "level": 1,
                    "comment": "Oh yo I remember that post!",
                    "score": 3,
                    "author": "doubtfullfreckles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably the biggest flex in my collection is my collection of IU fansign albums, numbering over 20. I've attended every fansign of hers since her first one, going back over 10 years.",
            "score": 65,
            "author": "MadamBeramode",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow! i would imagine her in person fansigns will be super hard to get in with all the competition! this is indeed a great flex!",
                    "score": 14,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly not quite as hard as you think because her dedicated fandom (those who buy albums) is relatively small in comparison to boy groups and the major female idol groups. Also Uaenas as a whole aren't as *extreme* when it comes to having to meet IU and as a whole are a generally laid back fandom. \n\nBoy groups and big female idol groups have much stiffer competition.",
                            "score": 22,
                            "author": "MadamBeramode",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh Wow i didnt know that! i thought since shes super popular her dedicated fandom will really be all out buying her albums to get into fansigns too. \n\nDefinitely agree with the boy group competition its INSANE.",
                                    "score": 9,
                                    "author": "strawbananajuice"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s a crazy flex 😳",
                    "score": 2,
                    "author": "imelt_slowly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "most of mine are reddit related lol \n\ni used to have the top post of all time on r/kpopthoughts (it was overtaken by a post about jonghyun and it’s still the second top post though so i’m not mad about it lol)\n\nmy write up on hyun jinyoung got a good amount of upvotes on r/HobbyDrama (i’m very proud of it tbh please read it it’s pinned on my profile)\n\ni posted a meme on r/DeadbyDaylight after all-kill was announced which got a lot of upvotes\n\nfinally idk if this is a flex but i wrote my senior thesis on kpop lol",
            "score": 59,
            "author": "anhonorandapleasure",
            "replies": [
                {
                    "level": 1,
                    "comment": "ooh that's interesting can I read the thesis, if you don't mind?",
                    "score": 9,
                    "author": "dazzlinganddepressed"
                },
                {
                    "level": 1,
                    "comment": "Link the meme",
                    "score": 3,
                    "author": "Polish_Duck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[here](https://www.reddit.com/r/deadbydaylight/comments/lx0ihf/hhey_guys/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf), it’s also one of my most awarded posts lol",
                            "score": 12,
                            "author": "anhonorandapleasure",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you",
                                    "score": 4,
                                    "author": "Polish_Duck"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh you're the one who wrote that rejection letter post- yeah you definitely deserve top post/second top post of all time lmao",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I had once made a kpopthoughts [post ](https://www.reddit.com/r/kpopthoughts/comments/ljssiq/i_found_the_oldest_kpop_mv_which_was_uploaded_on/?utm_medium=android_app&amp;utm_source=share)on the oldest kpop MV to be posted on YouTube and linked it, and when I went back to that video a few months later I saw a comment that said \" is anyone here because of the reddit post? Because I am\" and 1 person replied \"yep\"! It's so cool haha \n\nAnother flex of mine is that 1st gen is so my brand that I once commented on a recent thread about how I'm a college fresher and someone commented \"I never knew you're so young considering your 1st gen knowledge\".\n\nAaaand another flex is that my hobbydrama posts about Baby V.O.X. got 2.3k upvotes (I had to upload twice so 900 the first time + 1.4k = 2.3k).",
            "score": 18,
            "author": "SeeTheSeaInUDP"
        },
        {
            "level": 0,
            "comment": "Not sure if this counts as a flex but.. I saw Mark Tuan when he came to my country for LOTJ shooting.. given that he was one of my first biases it was an amazing moment!!",
            "score": 18,
            "author": "SamosaBubbleTea"
        },
        {
            "level": 0,
            "comment": "I haven't spend a single dime on kpop",
            "score": 56,
            "author": "Zzflx",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is indeed worthy of a flex",
                    "score": 17,
                    "author": "strawbananajuice"
                },
                {
                    "level": 1,
                    "comment": "That’s the biggest flex I have read yet!",
                    "score": 3,
                    "author": "imelt_slowly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was front row at a bts concert in 2015ish and the ticket only cost about $200 aud. I've met a few idols but it's the one that keeps me sane. Whenever my faves are insulted by their fans I find I don't really care since I held hands with all the members. 😐\n\nI won a video call with my ultimate bias and he replies to my messages often in the fancafe. But he's not as popular as he was in the 90s so I don't think many people care. 😵\n\nBaro from B1A4 sung to me and Sandeul took my polaroid camera and took a photo on it! I was in the second row and their fan interaction was amazing. Then I fell over in front of Sandeul at the high touch and cried LOL.\n\nI also saw Beast/Highlight, held their hands then saw them backstage too. Dongwoon said \"Pink Pink\" when he saw my hair.\n\nI saw BAP twice! Front of my section both times (because I waited at the theatre all day LOL)\n\nAnd I saw G-Dragon in the VIP section for only $100",
            "score": 16,
            "author": "pink_fluffy_crop_top"
        },
        {
            "level": 0,
            "comment": "I have the most upvoted post of all time on r/kpoopheads",
            "score": 78,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\&gt;  Infantalizing the sexuality of an idol is underrated toxicity.\n\nNAURRR 😭\n\n[Here's](https://www.reddit.com/r/kpoopheads/comments/i2d885/we_forced_a_bot_to_read_1000/) the link to the post if yall want to check it",
                    "score": 44,
                    "author": "WrongdoerOptimal9207"
                },
                {
                    "level": 1,
                    "comment": "biggest flex out there",
                    "score": 9,
                    "author": "clubroo"
                },
                {
                    "level": 1,
                    "comment": "That post itself is big brain energy.",
                    "score": 13,
                    "author": "ShelteredHomeschool"
                },
                {
                    "level": 1,
                    "comment": "Hey, I've been curious for a long time, and at this point I'm too afraid to ask there... I remember there's not even a single clue what was going on in that subreddit and an outsider such as myself would surely be confused.\n\nWhat is that subreddit is mainly about? It seems to be pooping on idols/kpop in general, but I see BP and some mentioned a lot, so who?\n\nTL;DR who are you guys circlejerking about",
                    "score": 9,
                    "author": "jalovitrue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "as a frequent contributor of the sub, mainly it’s making jokes about jyp, lee sooman, yg, jopping, and a few other things like that. also, we worship felix and mark lee. i recently finished a professional 5-week course on the art of jopping, you should check it out if you have time lol",
                            "score": 6,
                            "author": "chicken_nugget_tree",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[https://en.wikipedia.org/wiki/Jopping](https://en.wikipedia.org/wiki/Jopping) Jopping as in, the moves jumping and popping, or the music itself?\n\nAny idea why they're the subject of jokes/worship?\n\nAlso, I've seen terms frequently used there, like uj etc, would be really nice if there was a glossary/faqs or something there 😂",
                                    "score": 2,
                                    "author": "jalovitrue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "**[Jopping](https://en.wikipedia.org/wiki/Jopping)** \n \n &gt;\"Jopping\" is the debut single by South Korean pop group SuperM. It was released on October 4, 2019 as the first single from the eponymous debut extended play by SM Entertainment and Capitol Records.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&amp;message=OptOut&amp;subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/kpophelp/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
                                            "score": 4,
                                            "author": "WikiSummarizerBot"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i didn’t understand a thing from that post too 😂",
                            "score": 4,
                            "author": "strawbananajuice"
                        },
                        {
                            "level": 2,
                            "comment": "Circlejerk sub for kpop",
                            "score": 11,
                            "author": "wameniser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love you",
                    "score": 4,
                    "author": "skeptical_cell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*my nævis we love you",
                            "score": 4,
                            "author": "chicken_nugget_tree",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Æmen🙏",
                                    "score": 2,
                                    "author": "skeptical_cell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I met F(x) when they were filming a tv show in my hometown..I chatted to Sulli for a bit (RIP) and Victoria.",
            "score": 15,
            "author": "storyofadream"
        },
        {
            "level": 0,
            "comment": "I own A.C.E's entire discography (i feel like owning cactus and callin is a flex in and of itself haahah) and Tiffany Young posted photos i took of her on her instagram (and tagged me too omg) !!",
            "score": 17,
            "author": "orangeyall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so jealous of your a.c.e collection 😭😭😭",
                    "score": 2,
                    "author": "duebruh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A video question of mine was shown to ITZY and I got a [\"Hi\" from Yuna (and the other members)](https://youtu.be/oNjQOWj4TD0?t=1144).",
            "score": 13,
            "author": "yuyulikesramen"
        },
        {
            "level": 0,
            "comment": "I randomly got a Polaroid from a Yukika album! She’s my favorite soloist and I still can’t believe it",
            "score": 16,
            "author": "Starryy_nightt"
        },
        {
            "level": 0,
            "comment": "Way from Crayon Pop called me pretty, more than once 😅",
            "score": 13,
            "author": "Tabi5512"
        },
        {
            "level": 0,
            "comment": "Flexing for a friend here but she DMed Zico on Instagram as a joke just saying hello and asking how his day was. He didn’t respond, but he opened the message and read it.",
            "score": 40,
            "author": "GrillMaster3",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is somehow hilarious to me, zico reading random dms considering he probably gets bombarded with it. \n\nwhich reminds me of a story of how my friend’s now husband, before they got together, dmed txvq’s changmin when drunk saying how great of a person she was and how dare changmin not know of her existence cos she’s in love with him 😂 don’t think changmin read it though",
                    "score": 21,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, we were pretty shocked that he wound up reading it. We came to find out that most of Block B check their DMs pretty routinely, exceptions being Kyung (enlisted and radio silent) and PO (doesn’t manage his own social media).",
                            "score": 4,
                            "author": "GrillMaster3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lol idk how i’d feel if my fav left me on seen 😭",
                    "score": 5,
                    "author": "i_love_mino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She didn’t take it too hard, she was just glad she didn’t say anything embarrassing or rude. Apparently it’s pretty routine for Block B to leave fans on read, though sometimes they do respond, or they’ll ask for certain art fans have made and stuff!",
                            "score": 4,
                            "author": "GrillMaster3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i got the phone number of sona-k from O21, t-ara soyeon replied to my instagram dm once and anne from gwsn reply to my tweet in a video",
            "score": 36,
            "author": "eunchaeyeon",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you get the number 😳?",
                    "score": 5,
                    "author": "imelt_slowly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i asked her if she have any social media account other than weibo and she said she's more active on wechat so she actually gave me her phone number 😭",
                            "score": 5,
                            "author": "eunchaeyeon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She randomly gave you her number?! That’s for real the biggest flex on this thread",
                                    "score": 3,
                                    "author": "imelt_slowly"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was front row at a B.A.P concert and my bias Daehyun saw my sign that said \"Alpha Daehyun\" (Descendants of the Sun reference) and waited to get my attention to do a salute gesture to me\n\nI went to BTS TRB concert and got to meet all of them through hi touch and honestly, seeing them perform their older songs live is a flex itself alone \n\nWent to multiple Monsta X concerts, got many interactions with my ult Kihyun and took a super cute picture with him during a photo session \n\nI met DPR Live in Korea outside of a club he performed at (this was before he released Jasmine) and talked to him! He actually told me he was heading to Maui for an MV shoot, which turns out to be for Jasmine \n\nStudying abroad allowed me to see many artists I'm a huge fan of, like who gets to spontaneously see Crush at a club 😭\n\nI went to a Monsta X fansign and Kihyun remembered me\n\nI sent a video of me singing a song that Jae of Day6 covered on his old youtube to his old ig (this was before their debut) and he saw it and told me I had a great voice\n\nAhhh i've honestly been very blessed and am thankful I made so many great memories during my kpop phase!",
            "score": 34,
            "author": "uwuyen",
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s amazing! you have many good experiences! \n\nthe bts flex though! i can relate 😂 i still remember seeing them a couple of times at festival concerts during their less well known days and when they suddenly exploded in popularity i was like … what tf happened?! 😂",
                    "score": 8,
                    "author": "strawbananajuice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Day6 Jae replying to my candid tweet is my peak and never again have I come close",
            "score": 13,
            "author": "SkyloTC"
        },
        {
            "level": 0,
            "comment": "I got a signed I.o.i album sealed in 2020",
            "score": 12,
            "author": "jazza-bonazza",
            "replies": [
                {
                    "level": 1,
                    "comment": "WOW FLEX!",
                    "score": 2,
                    "author": "strawbananajuice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me and Jinsoul (my bias from LOONA) locked eyes and she waved at me because she liked my sign with her name on it.\n\nI also have 1 of the limited copies of Chungha's Gotta Go single album, and also her signed Flourishing album.",
            "score": 10,
            "author": "Django2chaiined",
            "replies": [
                {
                    "level": 1,
                    "comment": "i love chungha! she was my one pick throughout produce 101!",
                    "score": 3,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She is so amazing!! Those 2 albums I consider prized possessions of mine",
                            "score": 3,
                            "author": "Django2chaiined",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve got a few, some of them summed up [in these pictures](https://imgur.com/a/GOxfZMx).",
            "score": 11,
            "author": "bluebirdgm",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh my god 2010?! in LA?! AND SNSD OT9 PREFORMED RIGHT THERE IN FRONT OF YOU?!?! and that pic of sooyoung- she was right infront of you!! what a dream! \\*sigh\\*- i can only wish.",
                    "score": 10,
                    "author": "waterlilyypond"
                },
                {
                    "level": 1,
                    "comment": "I went to sm town too but in NYC instead !",
                    "score": 2,
                    "author": "adachi15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My biggest flex is probably that I saw ioi in concert",
            "score": 11,
            "author": "hobipeach",
            "replies": [
                {
                    "level": 1,
                    "comment": "is nayoung prettier in person?  she’s outstanding already but i feel like she’d be glowing irl 😭",
                    "score": 3,
                    "author": "i_love_mino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh at this point I didn’t know any of the girl’s names but I was FLOORED by how pretty chungha was",
                            "score": 6,
                            "author": "hobipeach"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "(happened to my friend but i'm gonna flex FOR her) she got to meet nct 127 backstage at this festival (she somehow managed to win meet &amp; greet tickets that the festival was doing, wtf why's her luck so good) and she got to hug mark lee? man i'm jealous every time",
            "score": 67,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow! that’s really insane way bigger flex than mine!",
                    "score": 12,
                    "author": "strawbananajuice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i guess meeing siwon in jerusalem haha",
            "score": 9,
            "author": "wujudaestar",
            "replies": [
                {
                    "level": 1,
                    "comment": "knowing how devoted he is as a christian the coincidence is hilarious 😂",
                    "score": 12,
                    "author": "strawbananajuice",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I managed to get front row at Sunmi’s concert and during Noir she went up to me and put the mic in my face to sing along. Sorry for ruining everybody’s ears hahaha.\n\nAlso, Getting Onew to say my name during a vlive hahahah and having Key read my comment during his instalive.",
            "score": 12,
            "author": "laurequipe"
        },
        {
            "level": 0,
            "comment": "1) was a bts fan since 2013 so i got to see their older songs being performed live + met them a couple of times (was super easy back then)\n\n2) got free concert tickets because i used to work freelance covering concerts / kpop events, saw groups like (vixx/infinite/beast/secret) etc and attended press conferences where i got to see all of them upclose hahaha",
            "score": 8,
            "author": "helpmeicantpick"
        },
        {
            "level": 0,
            "comment": "I'm on such good terms with my favorite smaller group that their staff doesn't even check my DMs before letting the boys read and reply.. They also initiate some of our conversations, so it's not just me bothering them all the time. \n\nEric Nam and I have text back and forth a few times. And I'm discord friends with one of his brothers.\n\nJooheon and Wonho have both told me they love me. It's absolutely just fan service during fan calls, but they're my ults so I'm counting it.",
            "score": 9,
            "author": "HatGirlAlex"
        },
        {
            "level": 0,
            "comment": "I posted Twice's Cheer Up MV on r/kpop (I don't think karma races were a thing back then haha)",
            "score": 11,
            "author": "rodsepp"
        },
        {
            "level": 0,
            "comment": "No idol encounters or exclusive goods for me lol but I used to co-run a blog (long defunct by now) that posted romanized fanchant guides for various K-pop groups and it got fairly popular. It was pretty complete during its prime and it did reach 1M+ hits which I don’t think it’s bad at all for such a niche interest within K-pop.\n\nWith the amount of new groups to cover and irl adulting, we just lost track. I’m pretty sure I alone posted around 300+ self-made romanizations tho. It was fun while it lasted lol.\n\nI also know by heart a good amount of fanchants, mostly from older and/or less known groups, and I still remember them. Weird flex but ok.",
            "score": 9,
            "author": "RGBSignal",
            "replies": [
                {
                    "level": 1,
                    "comment": "then i’m sure you will remember “neon na reul won hae [WON HAE!]” 😂",
                    "score": 3,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s just part of the song for me now",
                            "score": 4,
                            "author": "RGBSignal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this isn't as big as the other comments here but I once liked a bts tweet 16 seconds after it was posted😭😭can't believe this is the most impressive thing I've done in my years of being a kpop fan",
            "score": 23,
            "author": "mekoomi"
        },
        {
            "level": 0,
            "comment": "I was a winner of a kpop dance cover competition thrown by the artist to promote their comeback. It was Sori's Initial S, and I recorded my cover a week before giving birth.\n\nEdit: oh yeah, she wrote me a personal comment on my yt dance video",
            "score": 7,
            "author": "exyxnx"
        },
        {
            "level": 0,
            "comment": "ultimate biggest flex is probably my 15 or 16 BTS fansigns going back to 2013! second biggest flex is maybe having gotten drunk with 3 different nugu group members (3 different occasions though not all at once) - they were all extremely nice and one of them fed me dried squid.",
            "score": 21,
            "author": "citylovelights",
            "replies": [
                {
                    "level": 1,
                    "comment": "where do i find these nugu group members and their hangout? 😂",
                    "score": 6,
                    "author": "strawbananajuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they were invited to parties hosted by a friend of mine who kind of tangentially works in the industry, back in the before times when people could safely gather in groups LOL but the hot place is apparently a karaoke bar called Milk!",
                            "score": 12,
                            "author": "citylovelights"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "which groups though 👀",
                    "score": 8,
                    "author": "wujudaestar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Speed, Up10tion, and Bigflo! real nugu action",
                            "score": 10,
                            "author": "citylovelights",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omg funnnn",
                                    "score": 3,
                                    "author": "wujudaestar"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "- Won a hi touch for day6 and only one in 3 people won (or something of that number.... Not everyone won!). It was super cool =) \n\n- During the day6 concert, Sungjin looked and my friend and I a few times and laughed because we were holding this funny meme sign haha. We were in the first row that’s why. \n\n- Not really Kpop but Ji Seokjin feature my comment on his youtube channel lol",
            "score": 9,
            "author": "justwannasaysmth"
        },
        {
            "level": 0,
            "comment": "I won a signed Polaroid of my fav soloist Sunmi! \nI keep it framed on display",
            "score": 7,
            "author": "colorinredd",
            "replies": [
                {
                    "level": 1,
                    "comment": "careful to keep it out of direct sunlight! (or lights in general) i heard it stripes the colour off!",
                    "score": 3,
                    "author": "strawbananajuice",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been super blessed, even though these groups are not that popular.\n\nMy first is that I got to see not only A.C.E's concert in New Jersey, the first one they sold out, but I got to see them busking in New York the next day. In the vlive, you can actually hear me say \"Be careful, it's wet!\" to Byeongkwan and he looks at me says \"Okay\" and waves at me. Then, I later shout \"I love you!\" and both he and Jun look right at me and say \"We love you more!\"\n\nThen, I luckily won the fan meeting video call with Dongkiz with their most recent comeback. I got to tell them how much they made my terrible year better with their music, and my bias Kyoungyoon said \"I love you\" and I got to say I love you too. I had some great little moments with each of them, including Jonghyeong doing a bit of the dance to ICY by ITZY, but the whole thing was just an incredible experience that still makes me giddy when I think about it.",
            "score": 6,
            "author": "InfiniteChoice291"
        },
        {
            "level": 0,
            "comment": "I STILL think about how Wonho had a very brief conversation with me on his Instagram live!!!!",
            "score": 8,
            "author": "namelessnoona"
        },
        {
            "level": 0,
            "comment": "I got on an episode of After School Club back in 2013? My internet went out right after I did my talent tho 😭 (subsequently, Eric Nam called me by my whole government name when I told him during run-through to just say my first and last name)\n\nOther flex, I coordinated getting Boyfriend (kpop Group) Chicago-style deep dish pizza when they came to Chicago.",
            "score": 7,
            "author": "LakeofTimber"
        },
        {
            "level": 0,
            "comment": "This might only be a small flex, but to this day, I am part of a group of only around 60,000 people who have watched NCT 127’s Kick It live in person. \n\nWhen Neo Zone dropped, the Houston Rodeo was their first live performance. By the time they made it back to Korea for music shows, the pandemic had already driven away live audiences. We have *still* not had another truly live performance of Kick It since, and it’s been well over a year. Crazy to think about.",
            "score": 8,
            "author": "Dragonaichu",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a super big flex compared to other but at the Infinite Effect London 2015 concert of Infinite we were (me and my 2 friends) noticed a few times by the members.\n\nWe were on the first row of the balcony and we just were dancing,singing and doing lots of hearts and Hoya first noticed us,then Dongwoo who told Sungyeol to watch who said it too to Sungjong (hope you follow ahha) and the Woohyun \"throw\" us a heart too ahha\n\nThe only member who didn't really noticed us is Sunggyu :( \n\nWe also began the \"Dolawa Dolawa,Dasi dolawa\" encore thing. (It's their first song and the lyrics are perfect for that haha)\n\nI also own some albums pc and merch that people would kill me for.",
            "score": 8,
            "author": "Mainokutan"
        },
        {
            "level": 0,
            "comment": "I have SVT's debut EP (17 Carat) signed by all of the members. \n\nI've been to 2 High Touches (MonstaX and TXT) and an ITZY M&amp;G where Yuna said she liked my hair so we are basically best friends now.\n\nBeomhan responded to my comments on an IG Live when he lost his passport.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "A couple of friends and I attended an ITZY concert where we got to high-five the girls. As we were the last ones in line, we managed to say some quick words to them and Yuna even gave us a heart in response. I also got picked for the photo event, so I took a picture with the members at close proximity. Super unforgettable experience!",
            "score": 5,
            "author": "hermoomin"
        },
        {
            "level": 0,
            "comment": "Idk if it's a flex but I watched a live performance of Alexa pre-debut, and 2 members of in2it waved at me. This one is a very small thing but I got noticed by Eric nam on my birthday :D\n\nFunny story- hobi liked my fanart on weverse, which made me SO happy and decreased my insecurity about my art, only to find out it was an impersonator and real hobi probably never saw it, plus people started being mean under my tweet about this :D",
            "score": 7,
            "author": "sad--air"
        },
        {
            "level": 0,
            "comment": "Jessi responded to a comment I made on one of her lives about a guy in the background being cute. And then she went on a tangent about it LMAOOOO",
            "score": 6,
            "author": "bimzalazim"
        },
        {
            "level": 0,
            "comment": "My biggest flex is making semi-viral tiktoks exposing SM &amp; them banning my videos &lt;3",
            "score": 15,
            "author": "clubroo",
            "replies": [
                {
                    "level": 1,
                    "comment": "as an ex-sm company stan i laugh so hard at this because i TOTALLY understand the exposés",
                    "score": 8,
                    "author": "strawbananajuice"
                },
                {
                    "level": 1,
                    "comment": "That’s some type of flex. 😳",
                    "score": 3,
                    "author": "imelt_slowly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve been shadowbanned ever since 🥴",
                            "score": 2,
                            "author": "clubroo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t know if it’s a flex because it certainly wasn’t fun at the time, but I was blamed for ex-Super Junior member Kibum deleting all his Instagram posts two years ago. It was over Christmas as well, so the hate was *really* fun to deal with. Now I laugh about it, because he did come back in the end and most people knew I wasn’t the reason he did that. \n\nSpeaking of Super Junior, Sungmin’s liked a few of my comments to him on Instagram before. I also tuned into Yesung’s Instagram Live once, even though I never really watch idol livestreams, and I like to believe he read my comment out loud, lol. He was just testing filters so I commented something like, ‘뭐해요?’ Just a simple, ‘What are you doing?’ A few seconds later, he said 뭐해요. Now, it’s a common enough phrase that it was probably a coincidence, and maybe he was just asking the viewers that question. But I’ve decided he was reading my comment hahahaha\n\nI’m friends with Ladies’ Code Sojung on Facebook. She posted the link on her Twitter many years ago. She also liked a few of my replies to her over on Twitter around that time too. \n\nI met Hyolyn at her concert in 2019. I bought VIP tickets because I had all these plans to tell her how she inspired me, what Sistar meant to me as a teenager, and I don’t know... just talk to her about cats, I guess. My online friend also asked me to tell her they loved her too. But when the moment came and it was my group’s turn to get the photo taken with her, I went mute (I’m autistic). Couldn’t say a word, not even a meek ‘hi’. Since the meeting was pretty short - it’s mostly just two photos, then you have to leave - I thought I’d blown my chance and that Hyolyn wouldn’t talk to me, especially if I was unable to talk. To my surprise, though, Hyolyn took my hands and said, “It’s so nice to meet you!” I kind of just stood there like a dummy, probably gawking at her, because I still couldn’t speak. It meant a lot because the security were trying to usher us all out and take me away after the photos, but Hyolyn grabbed my hands and spoke to me. Like she wouldn’t let me leave without at least acknowledging me. Bare minimum, maybe, I don’t know; it was my first and currently only time meeting a celebrity, especially one who was an inspiration to me throughout my teenage years. But it really did mean a lot.\n\nMore recently - and I still can’t believe this happened - was waking up at about 4am to catch Minzy’s AMA on the main K-pop subreddit. 2NE1 were my first K-pop group and got me through my teenage years. They’ll forever be my ult bias. I wasn’t really expecting her to respond to me, let alone answer all my questions since I’d typed up about seven and I didn’t want her to spend all her time answering my questions when she could answer several people instead. I figured that if she did respond, she’d choose maybe one or two to answer, since that’s what I’ve seen other artists do in previous AMAs. Was very shocked when I got the notification that she had not only replied to me, but also answered every single question. I remember just squealing into my pillow. Now every time I listen to a 2NE1 or Minzy song, I smile all big when I hear her voice because it’s like, ‘Wow. She knows I exist!’",
            "score": 15,
            "author": "tiatamago",
            "replies": [
                {
                    "level": 1,
                    "comment": "now i’m really curious what did you do to make kibum deleting his ig posts! \n\nand hyolyn is so sweet! that’s totally great! it really only takes a little bit of kindness from idols and these memories are really precious to fans and will remember them forever, however insignificant it might be to the idols themselves!",
                    "score": 5,
                    "author": "strawbananajuice"
                },
                {
                    "level": 1,
                    "comment": "Wait what lol\nYou made Kibum delete his insta???\nWhat did you do??",
                    "score": 2,
                    "author": "OfficeTimely2198",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So it was Christmas Eve 2019. About a month before, he announced he was taking a break from Instagram. Knowing his tendency to just... completely vanish for years at a time, I thought he would be leaving for good. But then, on Christmas Eve, I got the notification that he had posted. It was a picture of Home Alone, though I can’t remember what the caption said. So out of excitement and overall surprise to see him back so soon, I commented, ‘YOU’RE BACK??’ \n\nI often commented on his posts and he’d never replied before so I had no reason to think he’d reply. Then my phone started blowing up with notifications related to the comment, and I realised that must mean he’d replied to me. Went to check and sure enough, he had! He simply replied, ‘sorry i’ll leave’. Everyone (and myself) was like haha, classic Kibum. Sarcastic as always. Took a screenshot, but within 10 minutes the post was gone. And then throughout the evening (my time; would’ve been middle of the night/early morning KST) his posts all began to disappear, one by one.\n\nThe Twitter fandom reassured me it wasn’t my fault since I was really freaking out in case Kibum had misinterpreted my comment as a hate comment. The Instagram fandom, on the other hand, weren’t so kind, coming to my profile and telling me my ‘hate speech’ was responsible for Kibum deleting his posts whereas other people told me I should have said something like ‘welcome back’ instead. Really sucked to deal with that on Boxing Day, but eh. He returned a few days later as if nothing happened and as far as I know is still around on Instagram, so I believe my friends when they told me he was probably planning on doing it anyway. \n\nTL;DR: Dared to excitedly ask him if he was coming back to Instagram after he took a break for a month. He replied saying sorry, he’ll leave. Thought he was being sarcastic/joking with me, since that’s how he’d interact with fans. He ended up deleting all his posts minutes later.",
                            "score": 16,
                            "author": "tiatamago",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to the first kcon in NYC",
            "score": 5,
            "author": "Superslimchick",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a flex!",
                    "score": 2,
                    "author": "imelt_slowly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In 2018, I went to Seoul to see Psy in concert twice. During the second or third encore, Psy plays Gangnam Style and shows audience members while he and the dancers sit and watch. During the Sunday show, they put me on the big screen and stayed focused on me for quite a while.\n\n&gt;!Should I even mention Psy on kpop forums? I'm starting to feel like I shouldn't talk about him at all because he's not as popular as some of the current idol groups.!&lt;",
            "score": 6,
            "author": "klynb"
        },
        {
            "level": 0,
            "comment": "not really a flex but still one of my proudest kpop moments\n\nduring got7 spinning top tour in berlin they told a story and jackson called bambam a liar and in sync JB and I went \"liar, liar, liar\" (uk the omg song..) my girlfriend absolutely burst out laughing.   \nI think this means that I am basically as cool as JB..Right?",
            "score": 12,
            "author": "ruma_p"
        },
        {
            "level": 0,
            "comment": "I won entry to Dreamcatcher’s fansign in London! It was amazing",
            "score": 5,
            "author": "azure_atmosphere"
        },
        {
            "level": 0,
            "comment": "My biggest album flex is that back in 2017 I found a seller on eBay selling Dreamcatcher’s debut single album, 2nd single album &amp; 1st mini album (both versions) all for $35 &amp; with photocards! It makes me happy cause now all their earlier albums are out of print &amp; now cost hundreds of dollars each! Also this year I found a seller on here on Reddit selling IOI’s Chrysalis limited album for about $15 I think. When I’ve seen them go for $200😱",
            "score": 2,
            "author": "eli_chiiii"
        },
        {
            "level": 0,
            "comment": "Not sure if this is my flex. Basically I’m from Melbourne, my friend is family friends with Rose’s (Blackpink) parents through Korean church. Somehow all Korean’s know each other here. And I grew up a suburb away from Rose.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ve been noticed by a bunch of 2nd gen and nugu gg members/artists on Instagram.\n\nThis may not be that impressive since they liked all the comments on these posts, but both of my ults, Gyuri from KARA and Rachel from April, liked my\ncomments on their birthday/graduation posts in the past year. Both of them mean the world to me so it was really special for them to like my comments even if they did it for others too. Gyuri and Eunjung from T-ARA’s youtube channel Beauty and View also followed me &amp; liked my posts on Instagram/comments on their YT channel when they were still active, but that was probably just their staff and not them themselves. It’s still cool to me though. \n\nJubi from Sunny Hill liked a post I tagged her in/viewed my story thanking her for it. This was the first time I was ever noticed by someone famous. \n\nKangyoon, Sujin, Dayoung and Gabin from Blady all viewed my story before and Kangyoon replied/like my message to her. Gabin reacted to hers as well. \n\nHyosung from Secret liked one of my tweets on Twitter and viewed my story on Instagram twice, Jieun from the same group also viewed my story two times. \n\nNoeul from Rainbow read and replied to my story once, viewed it two or three times. Jaekyung and Seungah also viewed my story but didn’t reply. \n\nJucy from EVOL reposted my story post about her birthday and replied to it. I think Hayana also viewed a story of mine once, but since her account seems to be gone now I can’t verify that. \n\nAreum from T-ARA has liked my comments to her and reacted to stories for her bday in the past. She also responded to me on live once.\n\nYellow Bee (when they were still active) liked a tweet I sent to them encouraging them abt their comeback, Annie and Ari also liked a YT comment of\nmine on MiniMani’s ToriTori Dotori video. (highly recommend u guys check the song out btw, it’s adorable) \n\nThere are a bunch of notices from others too, the ones I can remember being: Duri (D.Holic), Fly With Me/their member Shasa (they’re a dance team but they released a debut song so I count them too) Trinity (GP Basic), BiPa (Lip Service), Minji (Busters), Way/Choa from Crayon Pop, and Heyne (soloist, I love her w everything in me). Most of them were likes on comments or story views with the exception of Duri and Heyne, who replied to a comment and who read my message to her on live respectively. ( I also want to say Hami and Rena from D.Holic interacted with me too, but my memory is very poor and it’s likely they didn’t. )But yeah, the good thing about liking nugus is that there’s a pretty decent chance they’ll notice you, which has thankfully happened to me quite a few times.",
            "score": 4,
            "author": "minimonibusguide"
        },
        {
            "level": 0,
            "comment": "I got noticed by Jimin in Chicago 2019, my best friend and I had front row seats and near the end of the concert, I had my arms in the shape of the heart that he usually does and he somehow noticed. I made THE Park Jimin smile and laugh. I still can’t believe it.",
            "score": 5,
            "author": "kookiewithsugandtae"
        },
        {
            "level": 0,
            "comment": "KARA's Gyuri came to Mexico for a small presentation in Cancun. My gf and I live near and went to see her. The show featured 2 other groups besides her. My gf and I were the only ones in the audience with a KARA Lightstick (the big orange Karasia heart) and of the few that actually knew KARA songs. As soon as she stepped on stage she noticed us in the front row and gave us a lot of attention throughout the show. There was no space between the stage and the audience so we were very close but everybody was well-behaved. At some point Gyuri leaned over us and sang directly to my gf. Best fan moment tbh! \n\nShe also liked a comment I left for her bday this year. It honestly made my day. ♥️",
            "score": 5,
            "author": "alien_urbano"
        },
        {
            "level": 0,
            "comment": "Lee Know and I have the same birthday",
            "score": 10,
            "author": "ihateusernames0_0",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I guess mine would be I went to the last concert Everglow did before the pandemic smashed them all down. Basically went in March 2020 when everyone began to stop touring.",
            "score": 7,
            "author": "HugeRichard11"
        },
        {
            "level": 0,
            "comment": "My biggest flex is that two members from my favorite boy group have noticed me (my bias liked my posts that were about the group and he hearted the message I sent him) and another member responded to me on his live stream. Another flex is former T-ara member Areum liked my fan art that I drew of her. 🥺\n\nMy flexes are nothing compared to y’all’s though 😂😂",
            "score": 3,
            "author": "doubtfullfreckles"
        },
        {
            "level": 0,
            "comment": "I almost went to a twice and monsta x concert but turned it down because i was a baby kpop stan and didn't know who they were😭😭 the only flex i have",
            "score": 3,
            "author": "Smart_Entertainer375"
        },
        {
            "level": 0,
            "comment": "Jae from day6 made fun of my voice crack during a concert",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not mine but my sister's who doesn't have reddit but I showed her this post.\n\nHer and I got VIP tickets to an Apink solo concert which included meet and greet, hi-touch, and a photo.  My sister likes to cosplay a bit so put together a quick cosplay outfit that matched one of Apink's concepts (the schoolgirl look from Mr Chu).  As luck or fate would have it, Apink was wearing the same theme for their meet and greet outfits!  That was already cool enough but then Hayoung actually pointed at my sister's outfit and said something along the lines of \"oh we're wearing the same thing!\"\n\nMade that concert a little extra special.",
            "score": 3,
            "author": "akamikedavid"
        },
        {
            "level": 0,
            "comment": "I‘ve just secured VIP tickets for Eric Nam and a meet and greet is included. That’s my first time ever meeting an idol. Eric is a special one for me because I‘m a fan since I saw him on ASC back then. 🥺",
            "score": 3,
            "author": "imelt_slowly"
        },
        {
            "level": 0,
            "comment": "i got to meet ateez (their first ever tour and place in LA) and got to see the iconic mullet hongjoong! and wooyoung winked at me lol",
            "score": 3,
            "author": "sxtando"
        },
        {
            "level": 0,
            "comment": "I was acquaintances with an idol before debut! I went to camp with him 😊\n\nAlso pulled a special yearbook pc of haechan ao there's that!",
            "score": 3,
            "author": "EpicAngie"
        },
        {
            "level": 0,
            "comment": "This is very old, but at the very first KCON when they gave hi-touches out like candy, I managed to get one with NU'EST. I was just a casual listener of theirs, so I wasn't freaking out like the other fans. Everyone was especially freaking out over Ren, and I wasn't sure if he was nervous or uncomfortable about the whole thing. But for each member, I just politely handed them their album to sign and said hi, and after Ren signed it, he actually extended his hand out for a handshake! I was so surprised! I had been watching his interactions with each person from the line, and he hadn't done that with anyone else. I was so flustered when I shook his hand and he said thank you for coming. From then on, I've always seen NU'EST in a positive light :)",
            "score": 3,
            "author": "SSbroccoliP",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My friend is cousins with a member of her ult boy group but she's not too fond of him (because they're cousins, not because he's a bad person or anything) so I laugh at her every time I see her try to pull her bias and she ends up pulling him instead.",
            "score": 3,
            "author": "josephh_ie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I got a solo signed mwave RM album from a Japanese site for $40 this summer. Had it authenticated and I still don’t know how I got so lucky, considering they go for $200+ now",
            "score": 3,
            "author": "opall9"
        },
        {
            "level": 0,
            "comment": "When Bae Suzy came to the philippines for an endorsement, they held a free ticket giveaway on twitter. The same day they announced the raffle, I created a twitter account and my first tweet ever was about that raffle. A week later, I got a dm that I won. I went, saw an angel and it was the happiest day of my life that time.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I use to ride the school bus with Bobby from ikon , he even gave me an apple once.",
            "score": 3,
            "author": "ManagementGlad9761",
            "replies": []
        },
        {
            "level": 0,
            "comment": "One of my close friends went to the same church as Eric from The Boyz. She knew him and his family, and although she didn't have the nicest things to say about them (lol) it was cool learning that he went to Northwood High School in Irvine! I drive by that school every day lol.",
            "score": 3,
            "author": "AlwaysHaveNeverHold",
            "replies": []
        },
        {
            "level": 0,
            "comment": "small flex compared to the rest of you guys but i got noticed by STAYC on weverse twice! \n\nthe first time i posted a comment on J's post asking her what i should eat for dinner and she replied saying tonkatsu. when i saw the notification i couldn't believe it and i alm cried LOL. after that i took a screenshot n posted it saying thank you for noticing me, and she commented on the post saying \"btw, i like cheese tonkatsu the most\" HAHAHA\n\nthe second time i uploaded a pic of my dinner and asked sieun what she was having for dinner. i went to eat and when i came back, she left 2 comments on my post, the first one answering my question (she said she ate tuna sashimi) and the second one was \"wow you made that yourself?\" (referring to my dinner)\n\nthat was back when STAYC was super active on weverse. they're not as active now but they're so sweet!!!! and these are my first and only times being noticed by my favs LOL",
            "score": 3,
            "author": "ismokepretzels"
        },
        {
            "level": 0,
            "comment": "I have one of the ten signed group Polaroids from A.C.E's second generation fankit, I thought they all came with a Polaroid, but then when I checked out the benefits of a fankit, it said only ten exist. It's in my phone case now lol",
            "score": 6,
            "author": "Stoop_Girl",
            "replies": [
                {
                    "level": 1,
                    "comment": "i would have more anxiety about losing that pola than losing my phone 😂",
                    "score": 3,
                    "author": "strawbananajuice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've seen SHINee live 3 times.",
            "score": 2,
            "author": "tasoula"
        },
        {
            "level": 0,
            "comment": "my biggest and only kpop flex is b.a.p yongguk uploading a picture of my gift to his instagram (he deleted all of his pics at some point and started over, but you still can find it on tumblr archives and so). it was a fanmade graphic design typography poster",
            "score": 2,
            "author": "onetrickponySona"
        },
        {
            "level": 0,
            "comment": "One of my biases wiped his face with a towel and threw it into the crowd, which I caught lmao",
            "score": 2,
            "author": "unitaya"
        },
        {
            "level": 0,
            "comment": "During Dreamcatcher’s last tour in like 2018 when we got to take photos with the group I made a hand heart with Yoohyeon and it was the best moment of my life 🖤",
            "score": 2,
            "author": "lovemoontea",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I once went to a U-Kiss concert in NY and I was barricade. I also was the first 100 to be surprised with a high touch. At the end of the concert the members came down and Soohyun motioned for me to hug him and when I asked was he sure he nodded and motioned again for me to hug him. (Btw after a 2 hour concert he still smelled great) \n\nI also went to an even in NY for NCT 127 and happen to see Lee Sooman and got a hug.",
            "score": 2,
            "author": "Newxpat96"
        },
        {
            "level": 0,
            "comment": "I went to visit my brother in Melbourne during Blackpink's world tour. I was walking down this hip little street going to get a coffee and out of nowhere I see Rosé filming for what I now know was Blackpink diaries. I walked by her and she gave me a high five. She is so small and adorable and to be honest her visuals fucking rocked me.",
            "score": 2,
            "author": "Fairshake25"
        },
        {
            "level": 0,
            "comment": "I was a huge U-KISS fan and ended up getting to be interviewed (got asked questions?) by Eli on Simply K-Pop.",
            "score": 2,
            "author": "firephoenix0013"
        },
        {
            "level": 0,
            "comment": "i won a signed shinee photo pack before their concert started, then i got one of the signed balls they threw during the concerts (i got jonghyun's!!!!), minho noticed my handmade banner and laughed at it, THEN i won a signed album by the end of the concert by submitting a stopmotion that shinee themselves saw. i think that really is my biggest flex xD",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not much of a flex , but I guess being able to see all my favorite  kpop bands live . Went to SM town 2010 and got to see SHINee, Super Junior, SNSD, F(x) , and TVXQ . Then I was able to see Big Bang for their Alive tour and I also got to see 2ne1 for free !!! Also saw NCT 127 for free as well at the global citizen concert , but I hardly knew them since I only really keep up with 2nd gen kpop. Started listening to some NCT songs after that though lol. Epik High is coming to NYC in March so debating buying those tickets now.",
            "score": 2,
            "author": "adachi15",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I met KARD, UP10TION, Monsta X, MXM boys, Astro (all with fansigns, hitouch, some with polaroids too!) and got to see BTS live during their wings tour ! I’ve been to plenty other kpop concerts and have multiple signed albums!",
            "score": 2,
            "author": "luciferriising"
        }
    ]
}