{
    "id": "sdjfr0",
    "score": 431,
    "title": "What's your \"why are you booing me, I'm right?\" opinion for kpop?",
    "author": "exploding-fountain",
    "date": 1643239093.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/sdjfr0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have so many please tell me I'm not alone",
    "comments": [
        {
            "level": 0,
            "comment": "You don't need to watch each and every content, variety show, vlive of your faves. It doesn't make you any less of a fan",
            "score": 352,
            "author": "blissfulsunshine5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Realising this was a turning point for me. I'm a full time uni student. I can't be watching all the content that comes out because I no longer have the privilege of being a full-time kpop fan. Just watch what you want, and leave out things you don't want to keep up with.",
                    "score": 87,
                    "author": "SHOWTIME_12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't even try lmao I only watch them when I'm in the mood to or bored",
                            "score": 25,
                            "author": "Pixel-64"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree. As a full-time employee, I want to watch my idols content to chill and relieve stress. I don't want additional stress due to the pressure to keep up with everything they release.",
                    "score": 11,
                    "author": "hohocham"
                },
                {
                    "level": 1,
                    "comment": "I usually don't watch like any content my my faves put out lmao",
                    "score": 9,
                    "author": "istoleyourchesse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not going to open 20 tabs on my browser and stream a MV on them for all hours of the day. Honestly? I'm gunna watch it once or twice and then not watch it again for months probably lmaooo. \n\nI feel like you'd get crucified on twt if people find out you're not streaming or if you have a post go viral and then don't tell people to stream ____ in a tweet below.",
            "score": 115,
            "author": "jenjenjk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I like Momoland lol",
            "score": 110,
            "author": "FlavortownGuyF",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i dont give a Fuk about the voting!!!!!",
            "score": 834,
            "author": "elimac",
            "replies": [
                {
                    "level": 1,
                    "comment": "same. I’m not going to download a whole ass app just to vote! (I’m referring to all the posts I saw on yt about twice voting for MAMA or something I think)",
                    "score": 162,
                    "author": "cherrys_will"
                },
                {
                    "level": 1,
                    "comment": "Same. I’ve been an army for almost 7 years and I don’t think I’ve ever voted. Maybe twice for small shows? It just feels so pressuring. Being on twitter doesn’t help too. Feels like I’m being held at knifepoint or something. I’ll retweet though but I’m not gonna download a whole other app to vote, sorry😬",
                    "score": 85,
                    "author": "Tree-Nui-Tee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly just stopped voting after they won nearly every award😭",
                            "score": 33,
                            "author": "Money-Run6420"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lmao i found my people. Especially when they’re talking about using different accounts 🥺😂 man i really can’t be bothered to do all that",
                    "score": 44,
                    "author": "researcherinams"
                },
                {
                    "level": 1,
                    "comment": "This. If the voting system is simple then maybe I’ll give a few votes but if it’s really complicated and takes a lot of time then nah I got other things to do...",
                    "score": 23,
                    "author": "akaneko__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not every apology is forced. Some idols actually did exactly what they were accused of. Not everything is a conspiracy.",
            "score": 95,
            "author": "MelissaWebb"
        },
        {
            "level": 0,
            "comment": "That opinions are neither right nor wrong. They're not facts.",
            "score": 89,
            "author": "pm_nachos_n_tacos",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate that this comment actually fits the prompt",
                    "score": 15,
                    "author": "Pixel-64"
                }
            ]
        },
        {
            "level": 0,
            "comment": "some members of groups will always be more popular than others no matter how much you complain about it",
            "score": 521,
            "author": "hynjns",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boo. I mean, you’re right. But I like my fantasy where all members are equally poplar and loved.\nBut you’re right. There’s always a favorite. And unfortunately, there’s always a least favorite. And unfortunately, it’s often obvious. (Usually, just being “not as X” as other members.)",
                    "score": 146,
                    "author": "Rayesafan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having a bias proves that no member is equal.\n\nLike you, I love the idea that every member is equally popular, and for what it's worth, I talk about them as if they are. Obviously I have my bias, but after that every member is equal.",
                            "score": 39,
                            "author": "Chalaka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I feel like we have this weird politeness. Even calling our biases \"Bias\" kind of shows \"Well, see it's not them, it's ME. I'm just biased. But in reality, they're all great. It's not their fault that I have a bias for x.\"   \nBut group stans sort of protect those who are the least popular. Like \"I hope my bias gets more solo work, but why hasn't x gotten more solo work? Justice for x!\" \n\nThis is all different from solo stans. That's a whole other story.",
                                    "score": 8,
                                    "author": "Rayesafan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I used to go to nugu group events, find out who was the least popular and go out of my way to be hype af for that member. Very fun. There was a member of Alphabat that thought I was insane",
                    "score": 33,
                    "author": "qiaozhina",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think I’d really get boo’ed for this, but “who?” Isn’t the clap back you think it is when talking about nugu groups. Trust me, nugu stans are more surprised when you actually know who our faves are and treat them with respect.",
            "score": 238,
            "author": "echored99",
            "replies": [
                {
                    "level": 1,
                    "comment": "all it says it that you dont know how to google",
                    "score": 116,
                    "author": "cherrycoloured"
                },
                {
                    "level": 1,
                    "comment": "and when they talk about numbers when you hype up nugu groups oh god",
                    "score": 29,
                    "author": "ascorbicacidtablet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that hating on „problematic“ idols and then turning around and praising your equally as problematic favs is hypocrisy at its finest &lt;3",
            "score": 76,
            "author": "TresspassShownu",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Your idol isn't unproblematic. They just haven't gotten caught yet. :) \"\n\n(I do think there are exceptions, but I think so many of our idols have \"tea\" under the surface. I think there are problems they've caused, and problems that other people have caused them. But everything is hush-hush because, I would think, everybody has dirt and could possibly blackmail each other. \n\nBut I think that these \"problems\" wouldn't even be problems in the western music industry. So I don't think that most of them are bad people. I think a good percentage of them are good. But not spotless.)",
                    "score": 11,
                    "author": "Rayesafan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk if I’d get boos for this but I hate how Kpop companies create the perfect environment for obsessive fans ON PURPOSE (dating bans etc) and then act shocked when they get obsessive fans. It puts the bands in danger from stalkers but the companies don’t care they just want to farm the obsessive fans for money",
            "score": 79,
            "author": "xkluew",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was gonna say something similar abt how fan service should be done to an extent 💀🖐 i can name a few that are really open to jokingly flirt with a fan but sometimes u see fan call recordings of idols looking super uncomfortable with whatever the fans were saying 🖐 like pls RELEASE THEM FROM THE SHACKLES OF THE INDUSTRY I BEG 💀",
                    "score": 14,
                    "author": "A_Dima_456"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When are we gonna get mature girl groups now? Tired of seeing gg's coming out with like hard hitter beats, DOOM DOOM BOOM. Like its cool in all but give me something like automatic by red velvet or EXID's I love you (funny how I mention the two when they are all either my age or older than me.",
            "score": 195,
            "author": "Able-Lavishness7101",
            "replies": [
                {
                    "level": 1,
                    "comment": "these gg are getting younger… and younger.. it makes me uncomfortable and i’m only 23😭",
                    "score": 61,
                    "author": "timtumz6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YES IM ONLY 22 LIKE UMM im not gonna stan a MINOR. I'll call them cute but thats it! If thers gg's out there that are all 18 and above pls steer me the way cuz god lee",
                            "score": 13,
                            "author": "Able-Lavishness7101"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This!!! I really thought Brave Girls may have started a trend, and im so sad it didnt",
                    "score": 11,
                    "author": "sabaping"
                },
                {
                    "level": 1,
                    "comment": "THIS. PLEASE.",
                    "score": 11,
                    "author": "givenfever"
                },
                {
                    "level": 1,
                    "comment": "Yeah I tried it, but apparently the minor (age) girls are supposed to do the bubblegum concept, and I think it's right. I like the bubblegum concepts but I think they fit some voices and not others. I don't know.",
                    "score": 8,
                    "author": "hopkins_notakpopper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I had to put a number on it, I'd say 90% of kpop fans haven't got any genuine music knowledge besides what they hear. Which should be fine except that 90% are the ones that pretend to know everything an tell you what's good and what's bad or who is a good singer/rapper and is a bad singer/rapper. Listen to what you want and enjoy it and let others do the same.",
            "score": 60,
            "author": "Fairshake25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "K-pop members don't necessarily have to be close or bff's with one another just because they're in the same group. It's unrealistic and fans forcing the relationship is even weirder, when they're literally coworkers before it all. And stop shipping your faves together as if they're real. It's disturbing to see fans obsessively trying to make a ship canon just because the slightest interaction between them happened once. \n\nSo creepy.",
            "score": 239,
            "author": "Nigiriboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember when Loona members challenged Hyunjin and Gowon to hold a conversation on live and they were just like \"yea the weather is nice today........\"",
                    "score": 117,
                    "author": "uwuforlresident",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't know much about them, do they not get along or just not have anything in common?",
                            "score": 16,
                            "author": "The_Metal_Pigeon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd say they get along fine, it's more like they just don't really vibe with each other, which is fine.",
                                    "score": 49,
                                    "author": "Chalaka"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some ppl on Kpoprants should calm the fuck down.",
            "score": 487,
            "author": "Kooky-Particular-254",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sub was completely overtaken by Twitter stans and totally ruined. Seriously it’s just the worst people on there",
                    "score": 242,
                    "author": "Positivityjonesjr9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I essentially said that hey both fandoms were wrong cuz they shitted on each other’s fav and told the OP to calm down but got downvoted to hell and they tried to kick me out of that sub. Like did they want me to pick sides or sth?",
                            "score": 102,
                            "author": "Kooky-Particular-254",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like legit, they’ll jump on literally everyone who disagrees with them like earlier, I saw a comment clarifying the definitions of some words they didn’t use correctly and the op just replied “Didn’t ask”",
                                    "score": 59,
                                    "author": "PScorpion"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah that sub is stan twitter 2.0 judging from the comments.",
                            "score": 55,
                            "author": "RomanReignsDaBigDawg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The comments there are often worse than the posts. If your rant isn't fully backed up with 728 citations, you will probably be bullied into deletion within the hour. Even if you do completely back up your point, there's still at least 10 \"well actually\"s in the comments.",
                    "score": 70,
                    "author": "idaluiloona"
                },
                {
                    "level": 1,
                    "comment": "Yup. That sub is just a free pass to act like a douche.",
                    "score": 27,
                    "author": "FuriousKale"
                },
                {
                    "level": 1,
                    "comment": "I mean tell them to go touch grass",
                    "score": 21,
                    "author": "VijayMarshall87"
                },
                {
                    "level": 1,
                    "comment": "ikr! they delete each and every post relate to BTS or lock it even if people are being civil in comment section",
                    "score": 6,
                    "author": "Browsing_unrelated"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s okay to not care. Not everything an idol says and does wrong needs to be turned into an issue. Not every movement and expression an idol does need to be analyzed to fit your perception of them. Letting it go and not caring makes life much easier than fighting, arguing, and being offended over every little thing an idol does.",
            "score": 267,
            "author": "Stupiditysfinest"
        },
        {
            "level": 0,
            "comment": "Emojis doesn't freeze views!!",
            "score": 123,
            "author": "Browsing_unrelated",
            "replies": [
                {
                    "level": 1,
                    "comment": "idk who made all those rules but if i want to use this 🔥 under every mv  i will",
                    "score": 43,
                    "author": "SHOWTIME_12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NCT's OT22/23 dances are lacking in choreography, they should be doing stuff that takes advantage of the fact that they have so many members and showing that off, instead of just doing standard Kpop style formations",
            "score": 243,
            "author": "midnightsunwitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "the thing is, they tried that with Black on Black and got absolutely shit on, so now they focus on giving each member screentime/singing time in the center. and i'm speaking as a choreographer/dancer who had to fight for her life on Twitter to defend the formation choices when NCT 2018 first happened...",
                    "score": 127,
                    "author": "njrebecca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I know they have good reason, I’m just speaking as someone who loves watching big troops dance lol and I think they have the dance skills as a whole to pull off some really interesting stuff. My biggest gripe about NCT in general is that their experimental concept is severely limited by the need to make a profit and appeal to the public :(",
                            "score": 68,
                            "author": "midnightsunwitch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yes, I 100% agree as a dancer myself, your point actually applies to 90% of kpop groups. I'm not a SVT stan but they are one of the few groups who take advantage of large numbers for interesting formations and so I watch all their dance practices solely for that. Most of my favorite choreos are bc they have unique formations and have nothing to do with the actual dance. \n\n100% agree on your second point though. Although I love Dream (and I guess this could be my \"why are you booing me\" opinion), but they should've stuck to the graduation scheme and continued to shuffle in new members by using Dream as the gateway group. And then continuing to distribute to new units after they graduate. It would erase concerns with the introduction of new members before forming entirely new units (as I am sure SM is grappling with currently for NCT Japan). Of course SM (and us fans) couldn't deny the profitability of the current Dream lineup, I just wish they formed a new unit with the same members after inducting new trainees into Dream. \n\n(sorry for hijacking this comment with my own opinion, my bad)",
                                    "score": 62,
                                    "author": "njrebecca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely agree about Dream!! They’ve also set themselves up for failure in terms of ever adding someone younger than Jisung, which was also a part of the original concept of graduation. Kpop fans are too attached to the concept of maknaes. Literally their first member added should have been someone younger than him so they could have begun to break that mold early on",
                                            "score": 34,
                                            "author": "midnightsunwitch"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait people didn’t like the masterpiece that was Black on Black? How?? What do people even WANT?",
                            "score": 7,
                            "author": "kristiannah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There were a lot of complaints about certain members not having enough screentime/time in the center, ignoring the fact that only 3 people even have lines. Back then I had written many lengthy essays explaining the difficulties of blocking (that is, setting formations) for large groups of people and all the techniques we use to ensure that everyone gets at least SOME “center time.” I also listed out everyone who got at least one part in the center or center adjacent (on either side of the center or in the windows next to center) to indicate how the choreographers tried their best with what they had. \n\nNope, the MISTREATMENTTTTT RAWRRR naysayers were determined to only see the negatives. 2018 NCT twt was a fun time :   )",
                                    "score": 7,
                                    "author": "njrebecca",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The fact (to my knowledge at least) that NCT hasn’t done a human pyramid or that cheerleading move where you throw a member in the air and catch them is just wasted potential. All they have to do is do that once and people will be talking about it for a long time.",
                    "score": 18,
                    "author": "battlefranky69",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think one of the problems is that they've only released these songs in the middle of huge OT_ album releases, so there's not really enough time for everyone to practice a huge number altogether, not to mention trouble with coordinating 18-20+ people's schedules in the midst of preparing a major release like that (I mean, they couldn't even get Winwin back in Korea for the last one). I wonder what they could do if they did another full group choreography without other promotions around it.",
                    "score": 36,
                    "author": "idaluiloona"
                },
                {
                    "level": 1,
                    "comment": "I mean they don't even have a OT23/22 choreogaphy, they have Beautiful as 21 which I don't think should have that much of a choreo, and Black on Black (OT18) which is amazing.\n\nI think they could do more for future releases though, because I think they should promote more as NCT U and NCT as a whole, especially with  variety shows. So I would expect more choreos as a full group.",
                    "score": 28,
                    "author": "chonlipons"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My opinion: your favourite idols are not who you think they are, they at the end of the day will make offensive jokes, have sex and do and talk 18+ things, they will also have there own opinions but they will be made to keep that hidden\nYour favourite idols are enhanced and probably have minor or major enhancements to there face and body to fit the mould",
            "score": 37,
            "author": "JoonieWasTaken"
        },
        {
            "level": 0,
            "comment": "I'm tired of watching literal CHILDREN debut nowadays!! I don't want another bubblegum or girl crush group I want TWERK ANTHEMS, I want HAGS to debut 😫😫 bring back sexy concepts!!!!!!",
            "score": 37,
            "author": "rjc2k2",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS THIS THIS, I METIONED THIS HERE TOO IM SICK OF IT BRO. They kids arent they suppose to be in highschool AND GRAUDATE. Just reminds me of the 48's groups in japan WHEW",
                    "score": 7,
                    "author": "Able-Lavishness7101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That the landscape of K-pop would be way smaller and less diverse (and more boring, depending on your POV) if we banned playback vocals and backing tracks. Some dances these days are just not manageable to sing perfectly to. The product would suffer massively. So either we are getting rid of the coolest choreos or we swallow the bitter pill of altered vocals.",
            "score": 31,
            "author": "FuriousKale",
            "replies": []
        },
        {
            "level": 0,
            "comment": "fans of really big groups (ie bts, bp, twice, rv) dont need to stream their fav's new mv or vote for them in music shows - theyre gonna get numerous wins and hundreds of millions of views even if their fans put in minimal effort to do such things.",
            "score": 291,
            "author": "squarerooto",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really hate how smug BP fans are especially at some of their 'accomplishments' like w/ youtube views when they rent out whole net cafes to stream them non-stop to boost the numbers.",
                    "score": 163,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also bp has like 5 mvs you have barely any other bp concent of course you just gonna loop that thing \n\nWhich brings to mind rosé being surprised at one of their fan meeting/concert thingie that they still had empty sits eventho they just had 1billion views on their mv",
                            "score": 108,
                            "author": "fruitstration"
                        },
                        {
                            "level": 2,
                            "comment": "“My fav has more mv views than your fave” the kpop stan says as they roll out of bed at noon and reach for their 3rd bag of Doritos for the day.",
                            "score": 95,
                            "author": "Positivityjonesjr9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "kek 10/10",
                                    "score": 18,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you talking about for awards and charting in Korea or outside of Korea?",
                    "score": 24,
                    "author": "sadi89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Popularity doesn’t equal Quality music\n\nYouTube Likes/Views and Instagram followers doesn’t equal successful artist.",
            "score": 498,
            "author": "M_Prodigy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me and the whole pc cafe I rented out to stream my faves MV is angry at this comment. /s",
                    "score": 143,
                    "author": "Flywire789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My brain mixed up the tone indicators for sarcastic and serious, and thought you were serious for a second, but it sounded too satirical",
                            "score": 45,
                            "author": "Sol_01739",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not even gonna lie dude, I was having a stroke remembering if /s was serious or sarcastic, I was just hoping you’d get the joke 😭",
                                    "score": 7,
                                    "author": "Flywire789"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This opinion is the furthest thing from being unpopular though",
                    "score": 60,
                    "author": "97namu",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, but just because certain faves are less popular doesn’t mean they’re “better” music than more popular artists/groups.\n\nI think popularity/views/followers are more of an indication of better all-around branding. Which, is not something to sneeze at. Branding is an artform within itself. \nBut I’m not going to say that x song is better than y song because it’s less popular. X song and Y song might be equal in being \"good\", but not equal in branding and promotion+previous engagement with said group/artist.",
                    "score": 38,
                    "author": "Rayesafan"
                },
                {
                    "level": 1,
                    "comment": "&gt;Popularity doesn’t equal Quality music\n\nGoes the other way too. \n\nLess popular =/= quality music(or your taste lmao)\n\n&gt;YouTube Likes/Views and Instagram followers doesn’t equal successful artist.\n\nMaybe not successful *artist*,but for sure they're successful.\n\n\nAnd no one will boo you,bc this is a veryyyyyy popular sentiment",
                    "score": 48,
                    "author": "DenseProgrammer4265"
                }
            ]
        },
        {
            "level": 0,
            "comment": "a lot of them are business partners, not “family”",
            "score": 28,
            "author": "madrigalish"
        },
        {
            "level": 0,
            "comment": "blackpink is currently more of an influencer group than kpop artist. don’t got get me wrong I like the music they release. problem is they rarely do",
            "score": 26,
            "author": "whoatethespacecakes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That KPOP is the most overly sensitive industry where if you told someone to eat shit 10 years ago and they bring it up when you're famous 10 years later then suddenly your career is either over or you lose whatever opportunity you had. It's like man who cares it happened 200 years ago, like the Soojin issue, it's not like she drove someone to the brink of unaliving themselves.",
            "score": 321,
            "author": "JJosuke434",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously, out of all the problems the kpop community has, this has to be my least favorite. Its like nobody understands thats people can fucking change and what they said or did 42 years ago may not apply to them now. Its stupid how idols can get fucked over for some childish thing they did when they were.. idk, CHILDREN?",
                    "score": 153,
                    "author": "keiisobeiiso",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You put this on the industry but I have a lot of thoughts of international fans and the way they scrutinise and police idols in a completely disproportionate way than they do other western genres and artists.",
                    "score": 13,
                    "author": "Denethorsmukbang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't personally do it (I remember being young and broke) but Member Pricing makes complete sense when it comes to photocards and random goods. Some members will always be more popular than others and member pricing is a reflection of THAT not of talent or worthiness.",
            "score": 21,
            "author": "Mrs_Morpheus"
        },
        {
            "level": 0,
            "comment": "This is not a slight to Hwasa herself; she is an icon and the way she’s made a name for herself, for being herself, is amazing.\n\nThat being said, Hwasa would never have been able to go against Korean beauty standards and thrive in the industry, if she didn’t fit American beauty standards instead.",
            "score": 301,
            "author": "azure_atmosphere",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought she was American-Korean when I started to get familiar with her stuff, go figure",
                    "score": 45,
                    "author": "FuriousKale"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some Kpop artists have better Japanese discographies compared to their original Korean language counterparts.",
            "score": 20,
            "author": "battlefranky69"
        },
        {
            "level": 0,
            "comment": "Your fave won't marry you",
            "score": 17,
            "author": "personthingtodo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You don't have to know everyone's names, birthdays and best unpopular songs to announce yourself as a fan for their music\n\nLiterally every k-pop fan I meet shits on me because I don't recognise some random B-side song of a decent group\n\nDo I have to know every song? No",
            "score": 74,
            "author": "VijayMarshall87",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why I left kpop. I came back after years but I’m not telling anyone bc then I’ll be hoarded with WHO IS BIAS WHO S UR ULT WHO S UR ULT BIAS OK WHICH HOSPITAL WERE THEY BORN IN WHAT DID THEIR FAM DO JOSEON DYNASTY omg u don’t know fake fan",
                    "score": 11,
                    "author": "tsnv1011",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All companies suck, which is not a controversial statement, but companies whose CEOs are former or current artists/idols also suck! People just like them so much for their creative work and automatically think \"oh they know what it's like, so they'll treat their artists better and give them freedom\" no their main priority whether anyone admits it or not is to keep their company afloat. Even if their priority is the artists, they can't do shit without money and setting up a company already puts you at a loss. \n\nSure everyone openly meme-hates on JYP but I rarely see Psy getting criticized for doing less than the bare minimum for his artists. Everyone wants Pnation to rescue their faves but when's the last time we saw Dawn without Hyuna attached and what even went on with D.Ark? I love Ravi as an artist but why does he get so much praise just for getting his artists on random YT shows?\n\nLike why are people fans of CEOs. I would drop my faves if they set up their own companies. Everyone wants their faves to cancel their contracts and start their own company so they can have total freedom or whatever but I think it's super weird. I like watching people sing, not renting out basement studios and making ugly NFTs.\n\nedit: grammar",
            "score": 207,
            "author": "fruitballad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. Money and efficiency with resources is an obvious priority in a business.",
                    "score": 32,
                    "author": "FuriousKale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm so frustrated because as much as I hate the reality of it, denying it is insane to me? I always see fans calling for their idols' companies to go bankrupt because \"they deserve it\" but those idols and the employees will lose their jobs?? Why would a fan want that 😭\n\nI want to throw money at the music and merch I like to encourage the marketing team to keep doing what I like… and if I don't like what they're selling me I just don't buy it…",
                            "score": 24,
                            "author": "fruitballad"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm somewhat the same, but actually the complete opposite. There are a bunch of K-pop companies that just don't suck ass. You just don't know how to run a company or what goes on behind it.\n\nAnti-K-pop people often have a statement saying those companies treat those singers as trash and no as human beings. But that's everywhere on the planet not just the Korean ones. There are some extreme examples, yes. But the same goes usually for any other small company in any other country. \n\n\"Ooh, SM mistreated EXO again.\", \"Because EXO said they thought about leaving, they must have no control over anything they do. They can't voice their opinion.\"\nYet they had this statement on a non-live TV show. And so has the rest of the SM artist also been able to freely criticize their company.\nBesides them renewing their contract again, which means they very much like their position in the company. \n\nThis can be applied to every major company and their artist.\n\nBesides people just somehow always see a company being run by just the CEO and some managers?, like what? There're many other people in charge within the company, so certain decisions are definitely not as simple as you think. \n\nI'm always just so flabbergasted by the simple mind of fans. They say a company must do this and that like they've run a huge company of themselves for 40+ years.\n\nLike, their main group might've made a choice they didn't want a comeback this season. Yet the CEO gets criticized for it? \nI get that they're a spokesperson, but holymoly. People sometimes think that a single man just hates one member and that's why they're 'not getting the treatment they need' and hence are not part of a comeback. \n\nIt's insane to me that people actually think it's that simple.",
                    "score": 52,
                    "author": "Demi0Baozi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you though. When I say kpop companies suck, I mean in the way all companies suck because capitalism sucks. I don't care if my favorite idol talks about songs they made that were rejected and I don't whine about \"mistreatment\" based on biased translated hearsay, I'm honestly as neutral as I can be when it comes to the commercial side of things because that's just how the world and the industry works.\n\nSo I guess I meant more specifically that companies are bad because they can never be good or even neutral. And I dislike the idea of \"measuring\" a company's \"good\"ness when it's not an individual entity that can be judged like a person. It's a bunch of business guys no one knows making decisions in a closed room that aren't simple enough to be categorized as \"good\" or \"bad\" decisions because we as consumers of their products/services 1. don't know the big picture; and 2. are biased towards our own ideas of what's \"good\" for the artists.\n\nAll companies are bad because good ethics don't make a profit, and how bad/good they are when it comes to management of their artists can't be measured based on fans' whims.\n\nSomehow we use the word \"bias\" constantly but aren't aware of how it affects us. Like, I'm biased as hell, of course I want the best for my faves! I don't think it's gonna happen though, and I sure as hell won't embarrass myself by spamming some poor social media manager in a language they don't speak.",
                            "score": 21,
                            "author": "fruitballad",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly felt this one as a huge bts fan. ARMYs loooooove to glorify big hit’s ceos as if they haven’t become a huge corporation. Nowadays, any type of criticism targeted at the company is taken by company Stans as you being a solo. I was honestly surprised a large amount of the family openly spoke against their decision to enter the NFT market but a little merch drop made all the buzz around that dissipate. \n\nBut yeah, hybe’s ceo is just as awful as you’d expect from any ceo and it’s naive to assume anything else from the ceo of any multimillion(billion?) dollar company.",
                    "score": 4,
                    "author": "Waste-Scheme7887"
                }
            ]
        },
        {
            "level": 0,
            "comment": "big label privilege is real. \n\npeople hate to admit it but when you come from a big label your chances of success are automatically higher. \n\npeople may say treasure “flopped” cos they didnt do well and chart domestically but their sales are really good. \n\nfromis_9 moved to pledis/hybe and those hybe stans have been riding the wave ever since. Their sales increased threefold and the exposure this time was insane. Took them 4 years and despite all the issues, they still managed to survive and do well. \n\nyou can get the lousiest song but when ur under a big label it doesn’t matter your fandom is big enough to say “its not for everyone anyways” …\n\ntheres barely any “organic” success story these days but fans will refute",
            "score": 206,
            "author": "lsroom",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would agree, but I would argue that businesses know this and it’s not entirely a bad thing. \n\nThe real issues come from\n1- biases within the industry (which I would argue has hurt YG more, but that’s another conversation.) \n2- yes, delusional fans that’ll fight over this.",
                    "score": 31,
                    "author": "Rayesafan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. Big label privilege exists. YG groups were definitely hit by the consecutive scandals but they're still doing better than average. It's ok to admit it, they don't all have to have an underdog story.",
                            "score": 15,
                            "author": "SHOWTIME_12",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree. Love fromis_9 and that step absolutely helped in gaining popularity (also see the new MVs getting uploaded on the HYBE channel). You reach a completely new bubble with that.",
                    "score": 27,
                    "author": "FuriousKale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeap. While their loyal fanbase is still at the growing stage, being part of hybe helps to gain that exposure. Even if people listen once or twice, its still a counted view. I hope this year can be better and kinder to them, they deserve it so much",
                            "score": 9,
                            "author": "lsroom"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are some, BTS, Ateez, Mamamoo, and etc, but you're right, it's harder to think of organic success stories than idols/groups that became popular cause they were from a big company.",
                    "score": 49,
                    "author": "leafysummers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think vlives are boring and I don’t watch them",
            "score": 15,
            "author": "yuko_hiro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s weird to ship idols. They are real people, and people making fan content centered around a fantasized romantic or sexual relationship involving them is just strange. It definitely makes them uncomfortable too. Imagine if thousands of people made romantic edits about you and your coworker. It’s weird.",
            "score": 13,
            "author": "Cartoonist-Upstairs",
            "replies": []
        },
        {
            "level": 0,
            "comment": "/r/unpopularkpopopinions",
            "score": 107,
            "author": "littlebobbytables9"
        },
        {
            "level": 0,
            "comment": "Idols get surgery and that is OK. Not everyone is a «natural beauty» or needs to be defended for it.",
            "score": 13,
            "author": "Scenareo"
        },
        {
            "level": 0,
            "comment": "Just because they're your bias does not mean they \"deserve\" an equal amount of lines, and your bias getting fewer lines does not mean they're being \"mistreated\", even if they talk about how they wish they had more.\n\n\"Fair\" line distribution does NOT mean equal line distribution. Everyone has their strengths and the most lines go to the best singers/rappers. That's how you get good music.",
            "score": 13,
            "author": "meg0603"
        },
        {
            "level": 0,
            "comment": "There's a difference between having an impressive stage and having **_stage presence_**. Kpop stans barely know the difference.",
            "score": 76,
            "author": "nootthatdoots3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a whole ted talk on this.",
                    "score": 6,
                    "author": "Rayesafan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Live vocals mean the vocals are recorded simultaneously with the performance being shown on screen. \n\nRecording a version of the song two hours ahead of time while standing still and then lip syncing to it while dancing is still lip syncing. Lip syncing to track is lip syncing to track whether that track was recorded two months, two days, or two hours ago. \n\nSinging really quietly over the track which has the main vocal on it is not a live vocal performance. If it has the main vocal on it then it is not a backing track. It is a track. If I am struggling to hear you or distinguish you from the track vocals, then you do not get credit for singing live.",
            "score": 12,
            "author": "minpinerd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lip syncing isn’t really a big deal. At all. Lets not act like the main draw for 99% of kpop is live vocals. It’s all about spectacle, visuals, concepts, catchy choreo, and personalities.",
            "score": 12,
            "author": "superficialNASA"
        },
        {
            "level": 0,
            "comment": "Ggs are targetted majorly towards the male gaze.",
            "score": 119,
            "author": "SamEsme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to most women managed by men in the entertainment industry",
                    "score": 80,
                    "author": "technodoki"
                },
                {
                    "level": 1,
                    "comment": "Welcome to entertainment industries, beauty standards, life in general. you must be new?\n\nedit: but then again, i guess we could say the same about bgs too.",
                    "score": 39,
                    "author": "amillionstupidthings",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is a bit tricky because while girl groups in the past were traditionally male gaze-y with either cute/innocent concepts or downright sexually objectifying ones, the prominence of girl crush concepts in recent years is because of companies wanting to attract female fans (as admitted by people in the industry). There’s still male gaze-y aspects to it of course, because they don’t want to completely alienate potential male audiences, and also because most high execs are men.",
                    "score": 38,
                    "author": "iridescentt_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I personally would have to agree with this comment too. I once saw some stats about fan demographics for a number of girl groups (let’s see if I can dig them up), and they basically showed that the groups with cutesy or sexy concepts were more popular with men, whereas most other girl groups actually have more female fans or an equal number of both. The really interesting one was TWICE, who had a vast majority of male fans when they did their cute concept at the start of their career but now have more or equal female fans. (This fact in and of itself merits…. a heck of a conversation abt the nature of the male gaze for sure.)\n\nI also remember seeing this Reddit AMA from a Korean guy in the military and who he thought were super popular, and I remember a majority of them being groups that had either sexy or cute concepts. AOA was a big one at the time, and Lovelyz.\n\nGirl crush/appealing to female fans is definitely at the forefront at this point imo - and yeah there may be male gazey elements, but you can also tell there is a shift based on song topics with some groups, as in who they are singing to - eg. Itzy’s whole thing about self love which seems to be more female focused/neutral.",
                            "score": 30,
                            "author": "petrichor-pixels",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You summarised it well. So yeah, I wouldn’t say gg’s are targeted “majorly” towards the male gaze. Companies have stopped catering primarily to male audiences a long time ago; female fans are mostly whom they go after now.\n\nAn SM exec once said that “regardless of concept, fanboys will come” so instead, they work hard to market to women and maintain a strong female fanbase. Cause female fans tend to be more loyal and dedicated.\n\nThe vast majority of gg’s now have female dominated fanbases (especially internationally, but even in Korea), so I don’t know why this narrative that gg’s in general mostly target the male gaze or male audiences is still so prevalent. That (generally) hasn’t been true for the last 5 years *at least.*",
                                    "score": 17,
                                    "author": "iridescentt_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blackpink’s management/YG’s strategy isn’t working, they don’t have a strategy to begin with! They’re just dumb as fuck and don’t know what to do with their popularity!",
            "score": 160,
            "author": "hattokatto12",
            "replies": [
                {
                    "level": 1,
                    "comment": "are you really pretending this is unpopular lol",
                    "score": 6,
                    "author": "Denethorsmukbang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "U have no reason to go after an idol who did nothing wrong just cause of the fandom. It’s ridiculous because stan Twitter is SO toxic when you ask people they’ll be like “if they can’t control their fans they must be the problem” or “people give MY idol shit everyday” like….? Hello?? So?? This is an innocent person bruh u don’t even know this person why are you targeting hate towards someone who did nothing towards you just to get back at people u dislike on the internet….??? And then they act as if their idols would be proud of them and pat them on the head for being such kind hearted people. Like I’m not telling you to not defend your idol, but if you’re gonna bring down INNOCENT idols cause you think that’s the only way you can defend them then maybe you need to think about it for a bit. \n\nLike damn bro it’s never that serious why r u out here fat shaming, body shaming, and threatening random people. I assume these people r rlly young cause I don’t expect like a 18 yo to be saying that shit it’s embarrassing",
            "score": 11,
            "author": "Wild_Presentation782"
        },
        {
            "level": 0,
            "comment": "taste is subjective. not liking a song isn't a moral choice nor a personal attack!! despite the number of people who treat it that way and immediately jump on your throat for it",
            "score": 12,
            "author": "justahalfling",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Your faves probably aren’t as close as you fantasize about them being. Most of their “we’re family” rhetoric is a lie. I’m not saying none of these groups are super close, but most of the time, they’re just colleagues and there’s nothing wrong with that. Their job is to make music. If it upsets you to think they’re not always together or thinking of each other like family, then you’re projecting your own insecurities onto them.",
            "score": 11,
            "author": "shipsatdawn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "K-pop is not a meritocracy and just because an artist is popular doesn't mean their music is good.",
            "score": 98,
            "author": "HPDDJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "couldn’t agree more, I hate when stans try to lord their faves’ success over other stans (esp nugu stans) as though popularity dictates everything. of course successful groups do deserve their success, but talent itself isn’t the only factor in determining how “nugu” or popular a group is, yk? I think both popular group stans and nugu stans need to calm down with their superiority complexes and just. chill and promote their faves etc",
                    "score": 22,
                    "author": "crowlily",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;chill and promote their faves\n\nI'm respectfully hijacking this comment to say stan A.C.E 🥲",
                            "score": 28,
                            "author": "Stoop_Girl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All kpop groups had an influence in \"paving the way\". Some just had a bigger influence than others. No single group paved the entire way by themselves lol",
            "score": 252,
            "author": "MakkyMTC",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the only people who don’t agree with this are really aggressive army lol. And I’m army",
                    "score": 94,
                    "author": "snakesareracist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idols sing live more than people are willing to admit and they sound fine.",
            "score": 164,
            "author": "BetsyPurple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Springboarding off your comment here, sorry, but I 100% agree and I also think it doesn't really matter either if they do or don't. If they can manage it, all props to them, but at the same time other idols aren't lesser for not doing it. I don't understand why people get so desperate to prove one way or another if an idol is lipsyncing or not. It's not that serious if it's not a singing competition.",
                    "score": 35,
                    "author": "idaluiloona"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"More &amp; More\" by Twice is a masterpiece, especially the Music Video. I have no clue why people don't seem to like it.",
            "score": 215,
            "author": "deanveloper",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dont hate the song nor do I like the song.\n\nI like the choreography tho",
                    "score": 25,
                    "author": "DenseProgrammer4265"
                },
                {
                    "level": 1,
                    "comment": "I think in the context of time, the song threw many fans off that were used to a Twice that was a bit faster and a bit louder. So M&amp;M might have seemed too tame at the beginning. I like the song too. Loved the choreo and MV.",
                    "score": 11,
                    "author": "FuriousKale"
                },
                {
                    "level": 1,
                    "comment": "This is such a badass song and MV! This is the era I found out about Twice, which may bias me, but it really is an amazing song and album!",
                    "score": 42,
                    "author": "M_Prodigy"
                },
                {
                    "level": 1,
                    "comment": "More &amp; More is the song which made me check out Twice's music and I'll never understand the hate for it. It's such a gorgeous song.",
                    "score": 24,
                    "author": "discount-dinah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of the comments are mostly popular opinions so going to share my actual, extremely controversial reddit opinion that'll actually spark up some discussion on here lol\n\n&gt;! I think I was the minority of people on reddit that actually did find Momo and Heechul's age gap concerning and weird!&lt;",
            "score": 48,
            "author": "lalalaperson___",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too! It was weird because on Twitter everyone was disgusted and on Reddit everyone was happy",
                    "score": 14,
                    "author": "zipcodelove"
                },
                {
                    "level": 1,
                    "comment": "It was.",
                    "score": 5,
                    "author": "Huey-94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your faves are people with their own set of beliefs and values which you may not follow. They might not be the person you expect. They might not even be the most likeable person.",
            "score": 11,
            "author": "SHOWTIME_12"
        },
        {
            "level": 0,
            "comment": "Streaming is stupid.",
            "score": 10,
            "author": "JaeyunsCheesecake"
        },
        {
            "level": 0,
            "comment": "red velvets red concepts are better",
            "score": 141,
            "author": "0801pm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of them yes. Peek-a-boo counts as a velvet concept if I'm not mistaken and that song is hard not to love",
                    "score": 38,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i mean their RED songs though, not just the tame ones like red flavor and dumb dumb, i’m speaking as a zimzalabim enthusiast, a really bad boy advocate, a happiness supporter",
                            "score": 52,
                            "author": "0801pm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeeess a fellow Zimzalabim enthusiast! Never have I seen so much hate for a song right when it came out, especially on r/kpop, but that song is a bop and a half.",
                                    "score": 7,
                                    "author": "Muffin278"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No you're right and you should say it",
                    "score": 11,
                    "author": "HPDDJ"
                },
                {
                    "level": 1,
                    "comment": "Not sure if better but I do like them more than the Velvet concepts. Although amazing, other groups could do Psycho for example. But I don’t think other groups could pull Dumb Dumb and Rookie THAT well.",
                    "score": 5,
                    "author": "lavender-fog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "KPop lacks technicality in singing. Most main vocalists shouldn’t be main vocalists simply because they can sing a high note.\n\nI never realized that most KPop groups vocalists lack technique because fans will make you believe they were the greatest vocalists to ever grace the earth but if you pay close attention, most KPop artists, both male and female, doesn’t have strong technical skills. And it shows mostly when they sing comfortably (not moving around) and their voices are extremely shaky and pitchy. Having a solid technique should be the focus of training over uniqueness and “they’re the best among this group of people so they get the Mainers position.”\n\nAlso companies need to stop giving them more than they can handle. They’re ruining a lot of idols’ voices forcing them to consistently sing outside of their range.",
            "score": 89,
            "author": "BonBonnie0",
            "replies": [
                {
                    "level": 1,
                    "comment": "I absolutely agree with this wholeheartedly, but kpop fans decide they’re suddenly vocal technique experts every time I bring it up. But you can really see the problem when the best singers in groups aren’t even main vocals; technique doesn’t matter in kpop, only style and voice. On top of that, some of the actual best singers in kpop go completely unnoticed when compared to vocalists that have pretty average abilities but are extremely popular.",
                    "score": 30,
                    "author": "echored99"
                },
                {
                    "level": 1,
                    "comment": "adding onto this: and there seems to be a big fixation on having vocalists use their chest voices to hit those high notes which is… concerning… for vocal health. especially when it’s obvious that they’re straining for it and could easily just use their head voice / a mix and it would be fine?? i honestly don’t get it or why fans praise the vocalist’s performance when it just sounds painful.",
                    "score": 15,
                    "author": "whenyoubelieve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Considering how much lip syncing is done for K-pop performances, I wonder how often the vocalists need to hit those notes aside from when recording.",
                            "score": 13,
                            "author": "EyeKneadEwe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember there is an Akmu song where there is a note that Suhyun never (rarely?) sings live because it is not sustainable for her voice. I like that they have acknowledged the fact and take care of her voice.",
                                    "score": 8,
                                    "author": "Muffin278"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes the main vocalist should have the most lines, they are the main vocalist for a reason. Because when we try to be “equal” that’s when we get people flopping during encores and other live performances, people who can barely carry a single tune despite “training” for like 3+ years.",
            "score": 8,
            "author": "MelissaWebb"
        },
        {
            "level": 0,
            "comment": "Momo from Twice is not underrated. Literally everyone says that she is but she's definitely not when so many people bias her",
            "score": 8,
            "author": "JefferyTheAxolotl"
        },
        {
            "level": 0,
            "comment": "Honestly I feel like I have a lot of opinions like that, but I wouldn't be booed on Reddit but 100% would be cancelled on twitter lmao\n\nOne I think would maybe be booed here would be that enhypen has not showed enough to be as big as they are, especially with their more recent comebacks (especially comparing to how much the other big 4 gen groups are showing). I do feel like I should explain though that this is not because they're not talented (they definitely need to work on it though) but the songs and choreographies they're given just don't showcase them and their skills enough, specifically their title tracks/promoted songs",
            "score": 87,
            "author": "eyeamknowbuddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kinda agree except for Fever and Drunk-Dazed, I think those two tracks were amazing and showed them well, the only issue is that their company basically ignores the success of those tracks and keep trying new things that just aren't as good.",
                    "score": 20,
                    "author": "leafysummers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Drunk dazed and fever were good but it just made tamed-dashed so much more of a let down for me",
                            "score": 11,
                            "author": "eyeamknowbuddy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SM has been the front runner of kpop since its beginning and still is. For some reason people like praising the groups individually but as soon as you mention them as a collective people get shady. I don't get it, I thought everyone shared the opinion that SM made kpop what it is today, but apparently not.",
            "score": 193,
            "author": "sPEedErMEiN",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh that's popular here though",
                    "score": 58,
                    "author": "leafysummers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bighit absolutely ruined Jimins voice pushing this airy soft boy thing, he often sounds pitchy and out of breath and army dont realise 99% of the time when they try clapback at comments about his voice they use videos of him doing deeper songs from like 5 years ago. Filter suited him well but I heard serendipity live and a bunch of live recordings and hes super pitchy during it.",
            "score": 118,
            "author": "Darceymakeup",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not every member of NCT is close with every member of NCT. Just deal with that fact it’s not a big problem. I swear so many people are in denial over this because they don’t want to ruin their fantasy.",
            "score": 36,
            "author": "Seeginnah",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Projecting your sexuality onto idols as if that is somehow your right is fucking weird and invasive.\n\n It’s crazy how normalized it is in kpop spaces when you wouldn’t find that in any other community.. because you don’t assign sexualities to random real people just cuz it makes you “feel safe” thats insane.. they’re not dolls or movie characters.. people’s sexualities are none of your business. (and it’s especially awkward knowing that, statistically, there’s a big chance your “gay king” is homophobic😵‍💫)",
            "score": 85,
            "author": "97namu",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;when you wouldn’t find that in any other community\n\nOne Direction has entered the chat",
                    "score": 16,
                    "author": "azure_atmosphere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "plss half of them moved to kpop spaces the two communities are basically the same now",
                            "score": 15,
                            "author": "97namu",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This comment section already giving bland takes that definitely do not get booed on reddit.\n\nMy take is jopping copypasta gives high schoolers airdropping random pic vibes or twitter fans spamming fancams in that it's cringy and annoying.",
            "score": 142,
            "author": "leafysummers",
            "replies": [
                {
                    "level": 1,
                    "comment": "i'm booing you bc i love the copypasta but you're also 100% right",
                    "score": 52,
                    "author": "njrebecca"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop complaining about rants about kpop if it's on a r/kpoprants. It makes no sense when ranting is literally what the sub is for lol. Go elsewhere if you don't like it. Same with the UKO sub.",
            "score": 47,
            "author": "camelliaunderthemoon"
        },
        {
            "level": 0,
            "comment": "at this point there is going to be at least one person in every 5+ member group that is problematic. being either racist, homophobic, sexist- whatever it be.",
            "score": 58,
            "author": "jaeminsonly",
            "replies": []
        },
        {
            "level": 0,
            "comment": "99% of the idols that say they broke their nose/have a deviated septum are lying and/or using it as an excuse to get a nose job\n\nEdited to say: I have a deviated septum as well as tons of other people(1/3 of the population I just checked), and it has 0% effect on our lifes",
            "score": 98,
            "author": "MakkyMTC",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is an epidemic of deviated septums plaguing the kpop industry. Nearly every idol has had this condition corrected over the course of their career. I'm just so thankful that they can breathe properly again.",
                    "score": 55,
                    "author": "Drivershotbypolice"
                },
                {
                    "level": 1,
                    "comment": "The deviated septum is the lie almost everyone uses to cover up a nose job lol. I have a relative who claimed they got a deviated septum fixed and my mom swears they just wanted a nose job.",
                    "score": 50,
                    "author": "cubsgirl101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbf sometimes it's both",
                            "score": 25,
                            "author": "majbjorn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me wanting a nose job to fix my ugly nose is completely separate from me wanting a nose job so I can finally breathe properly. They are both true.",
                                    "score": 20,
                                    "author": "echored99"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "saying \"who?\" about artists as a comeback, especially artists like boa (yes, i have seen people say this about THE boa), is a terrible drag. the only person you're dragging is yourself.",
            "score": 4,
            "author": "basemoon"
        },
        {
            "level": 0,
            "comment": "Oh wait I have another. \n\nKpop stans constantly want \"unique\" music or \"fresh\" concepts but then hate everything quirky that comes out. Then they go and fall in love with songs that sound identical to 10 other songs. \n\nExample: Zimzalabim. \n\nSorry it's a fun song.",
            "score": 6,
            "author": "__fujiko",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Stray Kids is not that popular in Korea and in fact does not deserve the overhype it gets. It still takes them time to win a music show, yet their fans look down on every 4th gen group as if they're stanning Beyonce here. Their fans always attack The Boyz whenever they win an award from Melon, SMA, Gaon, and whatsoever. They always look down at The Boyz just because they're from a small company and SKZ is from JYP. If your group is insanely popular then why do television shows not feature them a lot?\n\nIt makes me infuriated tbh.",
            "score": 6,
            "author": "awkwardfina69"
        },
        {
            "level": 0,
            "comment": "I don't understand the concept of \"worst song\" at all? Prolly some of you are just blatantly hating the artists singing/performing it.\n\nIn my case I don't really have \"worst song\", I love kpop tracks that I find fun or interesting to listen to.\n\nedit: just added a word",
            "score": 14,
            "author": "jnjj7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some people like to think that their opinion is a fact. They're confusing \"my personal least favorite song\" with \"this is bad/the worst period.\" Sadly it's a tale as old as time, and spans every genre of music, movies, literature, theater, and everywhere that a human has an opinion on something.",
                    "score": 9,
                    "author": "pm_nachos_n_tacos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ITS. NORMAL. FOR. IDOLS. TO. DATE! STOP. BEING. SO. POSSESSIVE. AND. TOXIC. OVER. THEM. WHEN. THEY. DON’T. AND. WON’T. KNOW. YOU!\n\nI know that line of text is annoying but I’m so fucking sick and tired of “fans” getting so upset and toxic over their favorite idols dating. Like, get out of that delusional mindset that you’re gonna meet in a cafe somewhere and hook up with them. It ain’t gonna happen!",
            "score": 14,
            "author": "kookiewithsugandtae"
        },
        {
            "level": 0,
            "comment": "Wa da da was an amazing title track and although I love MVSK it would not have been a good title track",
            "score": 46,
            "author": "Road_Brilliant",
            "replies": [
                {
                    "level": 1,
                    "comment": "No but you’re right. I love MVSK and sonically I prefer it as a song but Wa da da has an incredibly catchy chorus and dance, which is perfect in terms of marketability.",
                    "score": 19,
                    "author": "multistansendhelp"
                },
                {
                    "level": 1,
                    "comment": "Yes! Title tracks should be ear catching, while I love MVSK it doesn't stand out as a debut imo",
                    "score": 9,
                    "author": "Mrs_Morpheus"
                },
                {
                    "level": 1,
                    "comment": "Also that Shine is the best song on the First Impact album",
                    "score": 6,
                    "author": "Road_Brilliant"
                },
                {
                    "level": 1,
                    "comment": "You’re actually right. Also I don’t even like mvsk.",
                    "score": 6,
                    "author": "MelissaWebb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "K-pop isn't a genre.",
            "score": 70,
            "author": "Pixel-64",
            "replies": []
        },
        {
            "level": 0,
            "comment": "These are some very safe opinions. \n\nMy opinion is that 99% of complaints about Cultural Appropriation come from Americans and that such complaints are actually Americans trying to dictate to countries and people they view as inferior under the pretence of social justice activism. \n\nI expect booing and Reddit Cares reports to follow. But, you know I'm right.",
            "score": 154,
            "author": "SafiyaO",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man as a black person who is sick of everything in kpop being called CA when it’s really not I feel this on a spiritual level. People don’t even know what Cultural appropriation truly is anymore because it’s just a buzz word used by woke people to force their own views on others. I say this as a person who considers themselves “woke”\n\nEdit: how does one even spell person wrong",
                    "score": 59,
                    "author": "missbeast17"
                },
                {
                    "level": 1,
                    "comment": "Hahaha agreed. As an actual Native American I get so pressed when I see people saying someone wearing feathers or face paint is CA, like we have reasons and designs in our cultures and random face paint or feathers is NOT appropriating our cultures. And then when I say something I get attacked because I don't look \"Native enough\" but get attacked by non-Natives ugh.",
                    "score": 71,
                    "author": "TigRaine86",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Too bad I don't have any awards available cause this comment surely deserves one. Americans need to understand they're not the center of the world and they don't dictate what's right and what's wrong.",
                    "score": 48,
                    "author": "PatitasVeloces"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Army spreads a lot of misinformation and are on the whole very unknowledgeable about kpop. I like BTS and their music infinitely more than their fandom.",
            "score": 73,
            "author": "Windboy226",
            "replies": [
                {
                    "level": 1,
                    "comment": "Btw why would one like a fandom?? Literal unknown people on the internet?",
                    "score": 24,
                    "author": "DenseProgrammer4265",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "stream/voting culture is weird to me and honestly unfair. it kills all the fun whenever i see bigger groups like BTS or BP because i know they gonna win… it’s annoying really even if i’m a fan and it makes it boring at the end because it’s always the same results.",
            "score": 15,
            "author": "likeacherrybomb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "everyone gets cancelled for dumb reasons. Everyone does mistakes but some idols get bashed for the tiniest reasons",
            "score": 16,
            "author": "Hannajeongin"
        },
        {
            "level": 0,
            "comment": "You're idols aren't all good people",
            "score": 15,
            "author": "thecatiswise"
        },
        {
            "level": 0,
            "comment": "Making fun of JYP the person isn’t quirky, isn’t cute, isn’t fun, and goes too far sometimes. Light joking around is okay but give him the basic amount of respect you’d give to a person you’ve never met before.",
            "score": 43,
            "author": "Stupiditysfinest"
        },
        {
            "level": 0,
            "comment": "Just because you stan a nugu group doesn't mean u can act superior.. idk when this shit started but those who stan nugus always act like higher beings.. saying they dont follow mainstream groups and act as if everyone who follows them have trash music taste.. bro ur group is a nugu for a reason",
            "score": 43,
            "author": "dadadadahhh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Music elitists/ music snobs have existed forever, and funny enough I always found it a bit unusual that kpop was the opposite way from everything else I was ever used to. Outside of kpop, if you liked 1 group only AND it happened to be the most popular group, you were considered a basic, poser, sheep with no taste. It was the people with the widest variety of groups \"you've probably never heard of\" that touted it as if it was a badge of individuality and breaking free from the mainstream. But in kpop, so many people try to be part of the biggest fandom, reduce themselves to liking one group only as some sign of \"loyalty\", and mock anyone who goes outside of what everyone else is doing. And they wear all this like a badge of pride and to show how cool they are for being part of the big popular kids club. It's hilariously opposite worlds. I guess it was only a matter of time before the hipster elitists showed up in kpop too.",
                    "score": 30,
                    "author": "pm_nachos_n_tacos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just because a group sings live for their performances doesn't mean that they should have... who cares if it's live if it sounds terrible.",
            "score": 52,
            "author": "TigRaine86",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hating on BlackPink is not a new take. Its not tea. It’s just biased hate.",
            "score": 36,
            "author": "Rayesafan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When you state facts about what a fandom or a person has done. Or agreeing with someone on said issue. I literally gor bombarded by a certain fandom yesterday because I said I was a part of it and exited because they were pretty toxic. 🤷‍♀️🤷‍♀️ \nWhy do you have the need to bring down other groups? Just make your little memes and edits or write a fanfic with that time. Or maybe even touch some fucking grass. Seriously.",
            "score": 6,
            "author": "lami208"
        },
        {
            "level": 0,
            "comment": "The way companies sell albums it reminds me to loot boxes in videogames. Some countries want to regulate this aspect in videogames because both for underage and adults can be dangerous and addictive. The attitude of buying extra albums to get more cards and collectibles is not very different for gambling, so restrictions can be very reasonable.",
            "score": 5,
            "author": "charliewoodhead"
        },
        {
            "level": 0,
            "comment": "Okay I'm still too afraid to actually name names, but there are some kpop idols where SO MANY of their fans are in the comments of videos like \"omg their STAGE PRESENSE IS AMAZING, PERFORMING QUEEN/KING!!!\" or \"THIS MEMBER ALWAYS HAS THE MOST UNBELIEVABLE STAGE PRESENSE, IT JUST BLOWS YOU AWAY!!!!!!\" \n\nand then you watch it and it's just... the most average performance ever. Like it's not bad, they hit the choreography, and their vocals aren't bad, but thats it, really... nothing particularly remarkable or eye-catching.",
            "score": 6,
            "author": "meg0603",
            "replies": []
        }
    ]
}