{
    "id": "siuzzv",
    "score": 471,
    "title": "What’s a song you thought would totally KILL, but then just didn’t?",
    "author": "usagicassidy",
    "date": 1643824310.0,
    "url": "https://www.reddit.com/r/kpophelp/comments/siuzzv",
    "media_urls": [],
    "other_urls": [],
    "postText": "When I heard Superhuman by NCT127 I thought it was maybe the best K-Pop song I’d ever heard. Then it just… didn’t take off or top charts or win awards like I thought it deserved to. Are there any songs you were CONVINCED would change the game and then just didn’t?",
    "comments": [
        {
            "level": 0,
            "comment": "I was SO SURE Dreamcatcher's BEcause would get them their first win, but damn, the Korean gp and music shows are really intent on sleeping on them. Super sad. It makes me feel horrible every time I think about it because the girls really really deserved it. I know DC is getting traction and their company probably don't care much about music show wins since it's out of their hands, still, is 1 music show really that hard to give.",
            "score": 140,
            "author": "stanTWICEstan",
            "replies": [
                {
                    "level": 1,
                    "comment": "That Odd Eye should have been the song tbh. I personally don't even follow Dreamcatcher but Scream - Boca - Odd Eye was SUPERB.",
                    "score": 7,
                    "author": "SeeTheSeaInUDP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, IKR?! Odd Eye being the ending song for their trilogy is legendary, honestly, all 3 could have won w/c is such a bummer.",
                            "score": 2,
                            "author": "stanTWICEstan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seeing this makes me sad bc this song popped up on my shuffle once and I fell in love with it instantly :(",
                    "score": 2,
                    "author": "Dadadada_dadadadada"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weki Meki‘s COOL. I thought it would finally catapult them to the next level. It got some traction and got more fans than their other songs but Fanmu fucked up and didn’t do anything after the push.",
            "score": 345,
            "author": "HonigMitBanane",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like it was a very similar for Picky Picky too- that went viral on twitter (at least on my corner of gg stan twt lol) and it almost felt like maybe it could be the next BBOOM BBOOM but.. nah :/",
                    "score": 127,
                    "author": "velvetujung",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bboom Bboom wasn’t just the song though, before the song went viral, JooE went viral for [the way she danced with Hong Jin Young](https://youtu.be/Mi4eduKxLWg) which landed her [Tropicana ads](https://youtu.be/1hl0g7nupTQ). The ads became a meme of their own, they were used as a form of rickroll in the Korean gaming community. When Momoland started promoting for Bboom Bboom, JooE was put if the first time in her career [in the center](http://res.heraldm.com/phpwas/restmb_jhidxmake.php?idx=5&amp;simg=201804231510230583476_20180423151316_01.jpg) of promotions, even the center of the thumbnail in their MV. There was a lot of anticipation for this comeback outside of typical Kpop fandom because people wanted to see JooE being funny again. And the song delivered. The same people who shared the JooE meme would share the song too. \n\nThere was nothing to pull the general public to anticipate the Weki Meki comeback like that. And sadly, this is extremely common in Kpop, lots of songs that could get big get buried because there is no anticipation for them. For example, in my opinion, Love So Sweet was of the best songs last year, it was exactly what made me fall in love with Kpop back in the 2nd gen, but the song flopped. But people don’t care about Cherry Bullet though, and FNC does not have a significant number company stans to keep it afloat.",
                            "score": 99,
                            "author": "Yelesa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love cherry bullet 💔😢 love so sweet made me check them out",
                                    "score": 18,
                                    "author": "FantasticMidnight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have followed them since their debut because of Haeyoon who was in Produce 48, and man, she had a really nice set of pipes. But they faced difficulties from the very beginning, they lost 3 members in less than a year and FNC is really hated in general, and Mina’s mental health issues took centerstage. \n\nThis group needs a miracle, they really deserve it.",
                                            "score": 9,
                                            "author": "Yelesa"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This one for me too - I remember being so confused at the complete lack of discussion on Reddit about that release. I saw mentions of the fandom maybe not liking it a lot but I absolutely love that song, and a lot of Weki Meki title tracks in all honesty.",
                    "score": 30,
                    "author": "prince3101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I first heard Cool when it shuffled on a playlist and I thought \"why have I never heard of this song before???\"",
                            "score": 10,
                            "author": "FantasticMidnight"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cool literally changed the trajectory of my life",
                    "score": 15,
                    "author": "FantasticMidnight"
                },
                {
                    "level": 1,
                    "comment": "I so agree with this, this song should have been SOTY and they should have blown up with it yet there are STILL people who don't know it??!",
                    "score": 4,
                    "author": "TigRaine86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blooming Day by Exo-CBX has no music show wins 😭",
            "score": 93,
            "author": "believedinme",
            "replies": [
                {
                    "level": 1,
                    "comment": "HOW!???",
                    "score": 9,
                    "author": "DestinyCrusader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because of Twice?",
                            "score": 4,
                            "author": "fitchbit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "NO WAY??",
                    "score": 6,
                    "author": "reversepsyched"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought Get Down by Boys Republic would boost their popularity at least a little. The song is great, the choreography is great, and the video is really exciting and brutal. I was really impressed! But it was their last comeback ever, sadly.",
            "score": 88,
            "author": "spinereader81",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get Down is still on my daily playlist. That chorus is one of the most epic I've ever heard. A shame they couldn't rise with it... It's legit one of the best k-pop songs ever\n\n(But I'm sorry, the part of the video where they dramatically drop the severed head and it's very clearly a mannequin always made me lose it haha)",
                    "score": 19,
                    "author": "Nej_Illjuna",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still on my regular played as well! Truly a great underappreciated song.",
                            "score": 3,
                            "author": "sahelli"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah don't make me cry, I LOVED Boys Republic, and 'Get Down' is still such a bop to this day. \n\nI used to be a fan of quite a few groups like Boys Republic, IMFACT, Uniq, BIGSTAR and History, but seeing their talent go unappreciated just makes me so sad that these groups never made it big. :(",
                    "score": 2,
                    "author": "aural89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Love Bomb](https://youtu.be/-SK6cvkK4c0) not getting any wins still blows my fucking mind.",
            "score": 328,
            "author": "Hebbie_Darry",
            "replies": [
                {
                    "level": 1,
                    "comment": "The song that got me into kpop. The girls just impressed me so much. It's insane to know it wasn't that successful in terms of wins",
                    "score": 45,
                    "author": "PrincessZaiross"
                },
                {
                    "level": 1,
                    "comment": "i have this song on repeat and to find out that fromis are only now establishing their presence in the scene is wild",
                    "score": 28,
                    "author": "Smooth-Screen-5352"
                },
                {
                    "level": 1,
                    "comment": "yup! I've seen a lot of people say they deserved their first win with WE GO, not Talk &amp; Talk, but nah, they deserved it waaay back with Love Bomb! (tho Talk &amp; Talk ofc deserved its win, it just shouldn't have been their first)",
                    "score": 53,
                    "author": "velvetujung",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fromis 9s feel good was the song I thought they would blow up with.",
                            "score": 23,
                            "author": "asteroid_b_612",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the gap between fun and feel good made it impossible for that to happen, they'd been away too long to get much attention.",
                                    "score": 15,
                                    "author": "PragmaticCoconut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Makes sense! I just got into them about half a year before they came out with feel good so I had been watching / listening to all their previous material and catching up when feel good came out.\n\nIt seemed so much more trendier (? Not sure if that’s the right word) than their previous stuff and the song itself was so good. \n\nI’m so so so happy to see them get wins lately and tripling sales of their albums. It seems like they’re finally getting the attention they deserve!",
                                            "score": 2,
                                            "author": "asteroid_b_612"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw the thread title and immediately came to the comments to say the same thing. I literally CRIED the first time I heard that song, I thought surely it would become a phenomenon. And yet ??????????? The absolute definition of underrated masterpiece",
                    "score": 3,
                    "author": "u1tr4me0w"
                },
                {
                    "level": 1,
                    "comment": "Yes, totally agree!",
                    "score": 8,
                    "author": "glamtart"
                },
                {
                    "level": 1,
                    "comment": "Easily one of the best kpop songs I've ever heard, if not the. It was my favorite fromis TT, until DM came.",
                    "score": 3,
                    "author": "MintMuch"
                },
                {
                    "level": 1,
                    "comment": "I freakin love this song. This was Gyuri's comeback after PD48 right?",
                    "score": 2,
                    "author": "jabbachew"
                }
            ]
        },
        {
            "level": 0,
            "comment": "liar liar by oh my girl",
            "score": 152,
            "author": "nahws",
            "replies": [
                {
                    "level": 1,
                    "comment": "The roller skate shoes!! 🛼",
                    "score": 15,
                    "author": "Jahshahwah"
                },
                {
                    "level": 1,
                    "comment": "This song is so overlooked but so good",
                    "score": 23,
                    "author": "JefferyTheAxolotl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 200,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "BIG AGREE\n\nI think in general I enjoy NCT Dream more than I do any other NCT music, but My First and Last was just so good!! I can't believe it wasn't a huge hit. I loved it performance/dance-wise as well.",
                    "score": 52,
                    "author": "cloudfloofs"
                },
                {
                    "level": 1,
                    "comment": "This song has really stood the test of time. It's always up at the top of Dreamzens favs lists.",
                    "score": 19,
                    "author": "badsies"
                },
                {
                    "level": 1,
                    "comment": "My First and Last earned Dream their first win and their first triple crown. \n\nIt didn’t blow up among the GP but it was definitely a nctzen fave at the time.",
                    "score": 11,
                    "author": "SLXO_111417"
                },
                {
                    "level": 1,
                    "comment": "Yes. For me it’s We Go Up as well.",
                    "score": 11,
                    "author": "lavender-fog"
                },
                {
                    "level": 1,
                    "comment": "This song is nostalgic af 😭😭 and its not even old nor the singers are older than me 🥲 the fact that i'm older than their oldest member and still felt like this was sung when i was 5 😂",
                    "score": 8,
                    "author": "jabbachew"
                },
                {
                    "level": 1,
                    "comment": "All of their songs slapped around this time (before mark initially left imo)",
                    "score": 3,
                    "author": "slyhuff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GFRIEND's Apple. Blew my mind, and I thought it might bring them back to the spotlight finally, but it didn't chart at all. Same with MAGO tbh.",
            "score": 238,
            "author": "pornypete",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apple was so good and MAGO was honestly flawless. Still gets stuck in my head.",
                    "score": 63,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Absolute perfection. I’m still sad we didn’t get to see where they were going with this newer concept. I hope VIVIZ gives us something like that.",
                    "score": 17,
                    "author": "BonBonnie0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "cherry bullet's love so sweet. i didn't listen to it when it came out, but when the girls went on gp999 and so many of us started checking them out, i thought it would go viral, but it didn't make much noise anywhere :/ (outside the gp999 fandom)",
            "score": 194,
            "author": "renjunation",
            "replies": [
                {
                    "level": 1,
                    "comment": "I knew nothing about the group but loved the song! \n\n:( sad it didn’t get the attention it deserved",
                    "score": 8,
                    "author": "csiqueiros15"
                },
                {
                    "level": 1,
                    "comment": "I heard it as background in a video, instantly loved it and was quite surprised that it hadn’t done as well as I thought it would have. I’m not really a gg music fan but this pulled me in instantly, so I thought more fans from a diverse background also might have liked it but unfortunately not.",
                    "score": 7,
                    "author": "amores_perros"
                }
            ]
        },
        {
            "level": 0,
            "comment": "literally anything by Dreamcatcher, but I'm surprised Odd Eye and BEcause didn't push them up further.  I know that they aren't nugu by any sense of the word, but still.",
            "score": 236,
            "author": "unacceptableinsider",
            "replies": [
                {
                    "level": 1,
                    "comment": "especially with BEcause having the theme of the movie “Us” i did think it was gonna do significantly better since it woulda attracted people to the MV at least",
                    "score": 31,
                    "author": "chyehe"
                },
                {
                    "level": 1,
                    "comment": "They are pretty nugu in Korea though...",
                    "score": 16,
                    "author": "MicaLovesKPOP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the one thread in this sub (?) where a Korean native answered questions on how idol groups are known in Korea, and they had no idea a 'Dreamcatcher' even existed... maximum pain",
                            "score": 32,
                            "author": "SkyloTC"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "apparently, exid's every night isnt that successful considering its the goat kpop song imo",
            "score": 114,
            "author": "ascorbicacidtablet",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was pre-Hani vid, that’s why, people didn’t know them so they didn’t check them out. Still my favorite song from them though.",
                    "score": 33,
                    "author": "Yelesa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "fair point",
                            "score": 1,
                            "author": "ascorbicacidtablet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was one of the first k-pop songs I heard after being introduced to BTS by a friend! Whenever I think of Every Night, I also think of Blackpink Playing With Fire b/c they were both on my first tiny kpop playlist 😊",
                    "score": 10,
                    "author": "1PlayerPanic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh wow good story!! playing with fire is also a great song !!! i hope they come back soon (i mean??)",
                            "score": 4,
                            "author": "ascorbicacidtablet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think EXID's Street is one of the best kpop albums of all time, GOAT like you said. I dunno if it got attention back when it came out, but it certainly doesn't get mentioned in throwback posts/videos.",
                    "score": 4,
                    "author": "Rumi2019",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "the first time i heard it was on react channel 🤣",
                    "score": 3,
                    "author": "Motor-Box2850"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i was shocked when i became a uni and discovered dr. bebe didn't get pentagon any wins. daisy is an amazing song but dr. bebe takes the crown for me. the emotions in the song itself and pentagon's acting/performances are so powerful, i'm blown away every time",
            "score": 25,
            "author": "hxnbin-cloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "That whole album is incredible! Worship U still makes me so happy when I listen to it.",
                    "score": 3,
                    "author": "1PlayerPanic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mago, it’s one of my favorite songs but apparently it didn’t do well in South Korea at all",
            "score": 22,
            "author": "oiksahoe"
        },
        {
            "level": 0,
            "comment": "Hotshots Jelly - or really anything off of their final album. I always thought their songs were so catchy, sad they never really got any mainstream recognition",
            "score": 19,
            "author": "Pembeerley",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Body Talk by Hotshot!",
                    "score": 3,
                    "author": "Rumi2019"
                }
            ]
        },
        {
            "level": 0,
            "comment": "mr potter - dia was literally out here doing actual magic for nothing 😭 they ended up in a lot of random dance compilations on yt bc of the suspenders choreo but literally no one talks about it 🥲",
            "score": 58,
            "author": "Pixiecrimson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just heard that song a few weeks ago. I love it !!",
                    "score": 3,
                    "author": "FlavortownGuyF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shine by Pentagon deserved so much more, it was a masterpiece. And it should’ve won music show awards too",
            "score": 111,
            "author": "tasi_the_one",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah like it went viral and everything ??? But still no wins :( it was a cultural reset honestly",
                    "score": 9,
                    "author": "sapphiclov"
                }
            ]
        },
        {
            "level": 0,
            "comment": "SF9 - Now or Never\n\nMany Kpop fans have heard this song but didn't/do not know it's from SF9. I think the song was ahead of its time and in other circumstances, it would have made SF9 a lot more famous!",
            "score": 84,
            "author": "dopamineh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of SF9’s songs tbh!! Easy Love and O Sole Mio were soooo good, fit the trends and were easy to listen to. I thought that they would hit big soon after but for some reason they’ve never been able to gain traction despite Rowoon and Chani having generally good GP recognition",
                    "score": 37,
                    "author": "njrebecca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So true! They really deserve more",
                            "score": 11,
                            "author": "dopamineh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You're right! Loads of current releases have an anti-drop chorus and strong baseline like Now or Never. That song deserves so much more!\n\nThankfully, since Kingdom they've gained some attention, especially since Teardrop. I hope they get noticed more!",
                    "score": 7,
                    "author": "Clark-KAYble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes exactly! And I hope so too :)",
                            "score": 5,
                            "author": "dopamineh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I assumed Cinema by CIX would have a Love Scenario moment on the Korean charts. One of the catchiest pop songs I’ve heard yet it didn’t really get much attention at all.",
            "score": 51,
            "author": "woodzcix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bad Dream is so good too",
                    "score": 11,
                    "author": "Jahshahwah"
                },
                {
                    "level": 1,
                    "comment": "Ikr. It’s a type of song that Korean GP would very much vibe into.",
                    "score": 3,
                    "author": "moonlightscone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What I Said by Victon!!",
            "score": 72,
            "author": "Longjumping-Curve713",
            "replies": [
                {
                    "level": 1,
                    "comment": "This song reigns supreme!!!",
                    "score": 8,
                    "author": "Huxeley"
                },
                {
                    "level": 1,
                    "comment": "It is one of their best songs :)",
                    "score": 7,
                    "author": "DP-06"
                },
                {
                    "level": 1,
                    "comment": "what i said is so good!!",
                    "score": 7,
                    "author": "ceesoning"
                },
                {
                    "level": 1,
                    "comment": "It served everything from the visuals, to vocals, to rap, and to the point dance.",
                    "score": 4,
                    "author": "ShelteredHomeschool"
                },
                {
                    "level": 1,
                    "comment": "Or Mayday!! It's one of my all time favorite songs and it's so sad how nobody knows it 🤕💔",
                    "score": 3,
                    "author": "lami208"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back then in 2012 I thought that Tonight would finally blow Spica up because it was IDEAL. Coupled with a Lee Hyori reality show, Catchy, radio friendly song, Mature concept.\n... You Don't Love Me got them a nomination for music show winning but that's where it went down.",
            "score": 98,
            "author": "SeeTheSeaInUDP",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg I LOVED spica so so so so much\nI'll be forever mad how underrated they were",
                    "score": 26,
                    "author": "bitchmaycry"
                },
                {
                    "level": 1,
                    "comment": "Tonight is still one of the best songs in kpop and I listen to it regularly. It should have been huge.",
                    "score": 3,
                    "author": "TigRaine86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anything by GWSN",
            "score": 46,
            "author": "desertrainBG",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed",
                    "score": 7,
                    "author": "FantasticMidnight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CLC Helicopter teaser was a banger. The song is nice but I thought they could do more.  \nhttps://youtu.be/0UsyhnBZHsw",
            "score": 109,
            "author": "nofoodnogood",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anything by CLC really…",
                    "score": 73,
                    "author": "wordgenius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Facts",
                            "score": 4,
                            "author": "partypwny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That song is a legit bop.",
                    "score": 6,
                    "author": "DP-06"
                },
                {
                    "level": 1,
                    "comment": "I loveddddd that song. I can’t believe it didn’t win music awards",
                    "score": 2,
                    "author": "mahalnamahal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Funnily enough, Rollin' by Brave Girls, then it first came out 2017. I was so happy, then that song blew up last year, it literally made me cry.",
            "score": 64,
            "author": "Tabi5512"
        },
        {
            "level": 0,
            "comment": "Sting by Stellar",
            "score": 40,
            "author": "MyLemonCake",
            "replies": [
                {
                    "level": 1,
                    "comment": "this song is so amazing and underrated and the following song Crying was so good too, it’s a shame that they tried to use gimmicky ways to get big and that ended up staining their reputation when they released legit songs later on",
                    "score": 13,
                    "author": "njrebecca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Sting” and “Crying” deserve the “Rollin’” treatment!",
                            "score": 13,
                            "author": "MyLemonCake"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1! 2! 3! POP!",
                    "score": 5,
                    "author": "skolgyrlstriker"
                },
                {
                    "level": 1,
                    "comment": "Vibrato also",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ateez - Wonderland \n\nI don’t think it won any shows, it’s the favourite among atinys but still",
            "score": 121,
            "author": "JoonieWasTaken",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m just a casual listener so I won’t call myself atiny but damn you’re right. Why do people not talk about it more? That song is a banger, I could never get tired of it. (All their songs slap tbh, not a single skip)",
                    "score": 30,
                    "author": "Tree-Nui-Tee"
                },
                {
                    "level": 1,
                    "comment": "First song I heard of theirs, totally drew me in.",
                    "score": 15,
                    "author": "annrkea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same",
                            "score": 5,
                            "author": "TisTwilight"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbh I wasn’t the biggest fan of the original song, but the symphony 9 version is SO GOOD",
                    "score": 9,
                    "author": "csiqueiros15",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It has been my most listened song on spotify in 2021. Yes, I am obsessee with it. I really dont get why they got no wins with it.",
                    "score": 7,
                    "author": "viv-heart"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Golden child - Ddara\n\nActually any song by them but....things just don't work, I thought after One(lucid dream) and Ram pam pam they will rise but..yeah bad luck ig",
            "score": 13,
            "author": "Acceptable_Wing_6586"
        },
        {
            "level": 0,
            "comment": "NCT 127 - Limitless",
            "score": 92,
            "author": "izakanzer"
        },
        {
            "level": 0,
            "comment": "mcnd - ice age, super fresh and unique concept for a debut",
            "score": 33,
            "author": "iwinwinyuwinwinta",
            "replies": [
                {
                    "level": 1,
                    "comment": "MCND seriously makes nothing but bangers, I'm on the edge of my seat waiting for their big break",
                    "score": 2,
                    "author": "TwoHungryBlackbirdss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Literally anything by Weeekly excluding After School. All of their other songs are overlooked but they're all so good",
            "score": 50,
            "author": "JefferyTheAxolotl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish they blew up during debut the title track, MV, concept, and etc. was amazing!",
                    "score": 3,
                    "author": "cricketpancakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish they did too tbh, most of their music is so unappreciated",
                            "score": 2,
                            "author": "JefferyTheAxolotl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "wind flower by mamamoo !! it's such a beautiful song and the lyrics are very relatable but people didn't respond to it that much when it came out 😭",
            "score": 10,
            "author": "Onodi_17"
        },
        {
            "level": 0,
            "comment": "It could’ve been a hit or atleast done better than it did if kfans didn’t do that fuck ass boycott…",
            "score": 60,
            "author": "reversepsyched",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh I actually don’t know about this. What happened?",
                    "score": 15,
                    "author": "usagicassidy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tl;dr the promotions for Superhuman were very heavily US or western centric as it coincided with their neocity tour and kfans got really mad about not being the center of attention for once and well yeah they boycotted the release of the Superhuman sigh.",
                            "score": 102,
                            "author": "reversepsyched",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow. That’s so dumb. It’s hard to be a fan and also part of the “fandom”. My first time hearing Superhuman WAS on the Neocity tour. It affected me so deeply. Am I not deserving of being a fan just because I live in Los Angeles? Lol so weird.",
                                    "score": 42,
                                    "author": "usagicassidy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Superhuman was also performed [in its entirety](https://youtu.be/qHcCDGoyZJ0) like a whole month before it officially released, which kfans were pissed at. Felt kinda weird when it actually released cuz I had already watched the whole thing lol",
                                            "score": 13,
                                            "author": "randomneeess",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just Do It by Booseoksoon. I was honestly expecting for it to give SVT their first true viral hit but it didn't happen. It deserved better.",
            "score": 60,
            "author": "cloud-aura",
            "replies": [
                {
                    "level": 1,
                    "comment": "The world needs another Booseoksoon comeback",
                    "score": 3,
                    "author": "HotSweatyCheetos",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bling bling and bday by ikon",
            "score": 42,
            "author": "indiandiplomat96"
        },
        {
            "level": 0,
            "comment": "The hype surrounding \"You Think\" by SNSD was big compared to her twin sister \"Lion Heart\", but it fell off the chart fast and got forgotten.\n\n\nLastly, all KARD's pre-debut songs.",
            "score": 9,
            "author": "bokte7"
        },
        {
            "level": 0,
            "comment": "Bad Love by Key deserves more!!! The whole album was amazing",
            "score": 8,
            "author": "Clark-KAYble"
        },
        {
            "level": 0,
            "comment": "Cherry Bullet’s Love So Sweet! I had it on replay for so long.",
            "score": 40,
            "author": "Alaerias"
        },
        {
            "level": 0,
            "comment": "ANY PENTAGON TITLE TRACK BEFORE DAISY CAME OUT😭\n\nEvery title track was so good! I was always surprised that they never got any wins before Daisy",
            "score": 27,
            "author": "euphoric_dreamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "i mean shine was a total hit internationally, and in korea it even managed to break in the melon chart and they extended promotions because of it. the dawn-hyuna scandal really hurt them after that. but even if daisy got them their first win, shine is still their most known track by far. im pretty sure we could consider it a minor hit in korea and a major one amongst international kpop fans. the wins have nothing to do with it because they had some heavy competition iirc",
                    "score": 17,
                    "author": "renjunation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was so happy seeing Shine grow so popular but I meant it more in a first win kind of popularity? Glad they finally got it with Daisy though!\n\nSeeing Shine on everyone’s playlists did really put a smile on my face so I also didn’t mind it at the same time",
                            "score": 5,
                            "author": "euphoric_dreamer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah... it's just that a first win really means nothing these days, specially if it's from the show. it's not that i want to downplay their achievements or anything, and i really liked daisy. but breaking in the melon chart, having more than 200m views on youtube and having your song go viral and be in plenty of people's playlists is wayy more important imo than 1 music show win, as meaningful as it may be for some, idk",
                                    "score": 8,
                                    "author": "renjunation",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's sort of complicated - Sorn from CLC \\[or, formerly, I guess\\] actually talked about how some people in the industry won't even talk to you or allow you on their broadcasts or shows if you don't have a first win, and that companies \\[or, her company at least, which is also Pentagon's company\\] measure how much money to put into the group based on how well they're doing, and one of the quantifiable ways to check that is a music show win. So yeah, they're not actually useful, but people in the industry can act really snobby about them, refuse to let groups without wins do things, and can have the company sort of just lose interest in the group as a whole. Pentagon is fully self-producing so they managed to float along for a while without one, bcs Cube didn't have to spend a lot of money outsourcing for albums and shit \\[also why Pentagon has 13 fucking mini-albums lmao\\]",
                                            "score": 9,
                                            "author": "sweet_nebulae"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apink - [Only One](https://youtu.be/kCSFdRf0210) \n\nthought the song captured Apink's essence quite nicely, a nice balance between their innocent yet mature image after their breakthrough with \"Luv\". i'm really surprised the gp didn't like Only One that much",
            "score": 7,
            "author": "omichrony"
        },
        {
            "level": 0,
            "comment": "[Dr. Feelgood](https://youtu.be/gGN_W4VBZFo) - Rania\n\nI first heard this song on a video and been listening to it quite frequently.",
            "score": 9,
            "author": "Luminnai",
            "replies": [
                {
                    "level": 1,
                    "comment": "That one shot in the chorus was something else though. \n\nI remember when this came out and I think this was one of the first times choreography really featured this move and they just zoomed right up on it! A few years later I saw it pop up in a lot more dances. Once it made its way to SNSDs Lionheart, you know that move was normalized lol",
                    "score": 3,
                    "author": "midgethemage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Boyz - No Air this song is just so upbeat and just a great song to jam out to. It's the song that made me a fan of them. Out of all their other songs, this one is still my favorite and am still shocked to see that not many people know about it.",
            "score": 9,
            "author": "lorfelf"
        },
        {
            "level": 0,
            "comment": "Hello Venus-What are you doing today?    \nKim Sori-Dual Life    \nShannon-Why Why    \nTahiti-Phone Number    \nLovelyz-WAG ZAK    \nAndamiro-Hypnotize    \nHeyne-Red Lie    \nD-Unit-Talk to My Face    \nShe’z-My Way    \nNS Yoon G-Yasisi    \nPurfles-1,2,3    \nBestie-Thank U Very Much    \nDal Shabet-Big Baby Baby    \n4Ten-Go Easy    \nBull-dok-Why Not?    \nTiny-G-Miss You    \nKiss&amp;Cry-Domino Game    \nLip Service-Yum Yum Yum    \nGLAM-Party (XXO)    \nEVOL-Get Up    \nSonamoo-Round n Round    \nZ.Hera-XOX    \nMelody Day-#LoveMe    \nFIESTAR-You’re Pitiful",
            "score": 9,
            "author": "Jahshahwah"
        },
        {
            "level": 0,
            "comment": "Weki Meki's Tiki Taka was one of my favourite 2019 releases and an absolute summer bop yet it went completely under the radar. \n\nI thought Lovelyz' Moonlight would have more popularity as a Queendom final performance (like Aoa's Sorry, Idle's Lion, Mamamoo's Destiny). It was such a good song and yet it's the least popular song by far.",
            "score": 10,
            "author": "thatdoesntmakecents"
        },
        {
            "level": 0,
            "comment": "Taemin’s advice",
            "score": 37,
            "author": "97namu",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait, did this song never win any awards or anything? i love taemin’s solo work but to me, advice is BY FAR one of my most favorite songs by him",
                    "score": 9,
                    "author": "pancakeking1012"
                },
                {
                    "level": 1,
                    "comment": "That song was literally SOTY for me last year!!!",
                    "score": 5,
                    "author": "icysunshine28"
                },
                {
                    "level": 1,
                    "comment": "This song was definitely something else!",
                    "score": 2,
                    "author": "krysalyss28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always thought Hyolyn’s songs would go viral (at least on Kpop Twitter). Songs like Dally, Say My Name and Layin’ Low would be eaten up by international stans. Dally was pretty viral there, but I expected it to be at like 70-80M streams on Spotify. It’s still at 40M. That’s a lot of streams in its own right, but I expected more. She deserves way more credit, both domestically and internationally (domestic success would be harder though, I understand). Her voice is immaculate and her songs are super catchy.",
            "score": 22,
            "author": "avastans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just here to co-sign this.",
                    "score": 4,
                    "author": "SamEsme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "not exactly what you were asking but I honestly thought Scientist was going to be one of the highest streamed Twice MVs but it isnt to 100 million views yet even. Which it still has a ton of views I just thought it'd do AT LEAST as well as Alcohol-Free but it's not even to half of Alcohol-Free's views yet lol",
            "score": 42,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly Scientist is just too weak of a title track. It's not a bad song at all but it's just kind of underwhelming, especially when in contrast to The Feels that was released just a while before.\n\nedit: I'm not claiming The Feels is necessarily \"better\", but it's undeniably more impactful than Scientist which is a calmer less upbeat song.",
                    "score": 54,
                    "author": "AobaSona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh gosh we differ in opinion there, The Feels is okay for me but Scientist is so great!",
                            "score": 6,
                            "author": "TigRaine86"
                        },
                        {
                            "level": 2,
                            "comment": "I actually like Scientist way more than The Feels. It’s my favorite title track since more&amp;more.",
                            "score": 23,
                            "author": "HonigMitBanane"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be fair, every song I like seems to not be massive with everyone else. I kinda lowkey feel proud I'm helping boost YouTube views by a dozen a week lmao.",
            "score": 7,
            "author": "FinchMandala"
        },
        {
            "level": 0,
            "comment": "someone already mentioned skz here, so i'm gonna go with one of my 2020 faves: Nature's Girls. i loved their take on the horror concept and the song itself. i thought they would do it again for their next comeback, but... 😥",
            "score": 6,
            "author": "purrpuIl"
        },
        {
            "level": 0,
            "comment": "Taemin's Advice.\nThat song was literally SOTY for me last year",
            "score": 8,
            "author": "icysunshine28"
        },
        {
            "level": 0,
            "comment": "A lot of Blackpink’s collabs with big name western artists. I thought they’d at least chart significantly with one on the hot 100, but nope.",
            "score": 5,
            "author": "kumquat4567",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thought it'd be cool to compile all the songs here into a playlist on Spotify \n[Here](https://open.spotify.com/playlist/1ipnLoNZRBq6HF8qIBEmkT?si=hjCXMSqFRCOCX_cpoCwqIg&amp;utm_source=copy-link)\n\nI'm new to Kpop, so this post really helped introduce a lot of new artists to my life!",
            "score": 5,
            "author": "shorts_onfire"
        },
        {
            "level": 0,
            "comment": "Free Somebody by Luna. Honestly, the best female solo debut from SM. Apparently, the GP expected a ballad from her and didn’t vibe with her dance track.",
            "score": 4,
            "author": "YoonJeonghan1004"
        },
        {
            "level": 0,
            "comment": "I really thought 0x1 LOVESONG would hit Korean charts harder",
            "score": 11,
            "author": "asianpaleboiii"
        },
        {
            "level": 0,
            "comment": "WJSN - SAVE ME SAVE YOU\n\nWEKI MEKI - TIKI TAKA\n\nTWICE - SCIENTIST\n\nTXT - BLUE HOUR\n\nTAEYEON - WHY\n\nPENTAGON - too many to mention\n\nOH MY GIRL - Remember Me\n\nITZY - Loco\n\nEXO - Power\n\nATEEZ - too many to mention",
            "score": 17,
            "author": "trblskr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tiki taka is kpop gold",
                    "score": 5,
                    "author": "FantasticMidnight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally agree with OP! superhuman (and that whole EP) deserved way better. I saw superhuman live in 2019 and it was amazing TT",
            "score": 4,
            "author": "mochi_haechan7"
        },
        {
            "level": 0,
            "comment": "TxT's Magic had so much potential as their first English single and I was so sure it would gain traction in the west but it really wasnt promoted hard enough. The MV sort of disappointed me as far as something to draw in new fans.\n\nOlly Murs was the lead writer on this song so I was surprised it didn't do better. Trouble maker was huge in 2012 but magic didn't even chart.",
            "score": 25,
            "author": "Dancingwithsomebody",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this song so much and am shocked it wasn’t as beloved by everyone else - it had all the right elements to it.",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was prime summer bop material. And the dance was 🤌\n\nToo bad it only got like 3 promos in the US (Colbert, Corden, mtv fresh out) because if it had been pushed harder it would have had at least top 40 potential. This is the kind of stuff that is the reason why hybe ended their distribution deal with Columbia records.",
                            "score": 7,
                            "author": "Dancingwithsomebody"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "magic is such a great song, and i totally agree with what you said about the mv!",
                    "score": 2,
                    "author": "ceesoning",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right? The space robots concept just didn't vibe with me and I don't think it fit the song very well? It also didn't showcase much of the dancing which is one of their strong points. Glad the boys had fun making it though",
                            "score": 3,
                            "author": "Dancingwithsomebody"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly too many to name. Fromis\\_9's Love Bomb and Feel Good, Kard's Don't Recall and Gunshot, Weki Meki's Cool... Right now I seeing WJSN's Super Yuppers on my timeline basically every single day but somehow that MV is only sitting at 3.5M views after almost a month.\n\nAlso I'm heavily biased on this but loona could've made way more noise during the OEC era. Both Girl Front and Sweet Crazy Love are great songs and their sound is really palatable for a wider public.",
            "score": 9,
            "author": "SrgtButterscotch"
        },
        {
            "level": 0,
            "comment": "Anything by MCND",
            "score": 8,
            "author": "Super_Green7106"
        },
        {
            "level": 0,
            "comment": "tbh I thought Rose by D.O and Scientist by Twice would take Korea by storm. Well, it still did but not as much as I thought it wud :((",
            "score": 7,
            "author": "calbeeismydog"
        },
        {
            "level": 0,
            "comment": "CLC Hobgoblin. They were robbed by the industry",
            "score": 3,
            "author": "icyruios"
        },
        {
            "level": 0,
            "comment": "Jelly by Hotshot, always thought it deserved to blow up, kind of like killing me by ikon vibes",
            "score": 3,
            "author": "myungjoke"
        },
        {
            "level": 0,
            "comment": "astro's [crazy sexy cool](https://youtu.be/xeUx0AN2kCA). when i started getting into them, i was genuinely shocked to hear that this song didn't even get a single win; it's just so good! and while i'm really glad that they got their first win with all night (ntm all night has one of my favourite concepts till date), csc deserved also deserved so much more. \n\nanother one would be gfriend's apple. i've only ever been a casual fan of theirs, but GOD did this song blow me away. the song, the mv, everything about was so stunning that i was sure it would gain a lot more traction :(",
            "score": 3,
            "author": "natalie_6791"
        },
        {
            "level": 0,
            "comment": "ATEEZ - Answer… she’s an icon and she deserved better!! \n\nalso ONF’s popping and goosebumps….. they were paid dust for no reason….. \n\nalso i really thought weeekly’s after school and holiday would be bigger in korea?? but after school seemed to have mostly gone viral on international platforms… truly wild bc it’s such an incredible song",
            "score": 3,
            "author": "euphemismx"
        },
        {
            "level": 0,
            "comment": "Gfriend’s Apple &amp; Mago\n\nBTS - boy in luv\n\nKard - Gunshot",
            "score": 29,
            "author": "unvillagex",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm still sad about Gunshot, it's such a good song!",
                    "score": 12,
                    "author": "a-lexthunder"
                },
                {
                    "level": 1,
                    "comment": "BTS Danger deserved so much more",
                    "score": 14,
                    "author": "LoverYoungTrue"
                },
                {
                    "level": 1,
                    "comment": "Boy in Luv is in my top  five bts songs. (don't know where to put all the cyphers, love them equally.)",
                    "score": 3,
                    "author": "grimesofficial"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so surprised no one has said God's Menu yet. Legit one the best songs in Stray Kids' discography and a big leap from their other work, yet it didn't get any awards. It was the song that actually got me into them. I was so impressed by the lyricism and theme that I thought it had to be one of the biggest songs in kpop. Though I guess everything happens for a reason. I feel like if it wasn't underrated we wouldn't have gotten Cheese, which is also a banger.",
            "score": 20,
            "author": "Homieknight923",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait, god’s menu never got any awards???? i cant believe that",
                    "score": 5,
                    "author": "pancakeking1012",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s their most popular song, I can’t believe it either",
                            "score": 2,
                            "author": "spaggetti04"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any title track from Pentagon😭",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Stray Kids' I am YOU. Before knowing that MIROH was their first win, I 100% thought that I am YOU got them their first win. Imagine my disappointment when 15 minutes later, I found out that Get Cool was the more popular one of the two.",
            "score": 5,
            "author": "jein777"
        },
        {
            "level": 0,
            "comment": "Love Maze and Magic Shop by BTS \n\nalso Baepsae and Ddaeng \n\ntheir older songs are quite unknown to many people, even tho they are amazinggg",
            "score": 5,
            "author": "DP-06"
        },
        {
            "level": 0,
            "comment": "Nonstop by nct 127 a banger",
            "score": 2,
            "author": "prathi20"
        },
        {
            "level": 0,
            "comment": "Favourite by NCT127. It has such a pop-friendly sound I thought this would be what would finally get them widespread GP recognition like their breakout hit😭",
            "score": 2,
            "author": "SamEsme"
        },
        {
            "level": 0,
            "comment": "GIVEN-TAKEN by ENHYPEN. It deserves more attention tbh. One of the best debut songs out there... Can't believe it didn't have any music show win...",
            "score": 2,
            "author": "thraiarahabaki"
        },
        {
            "level": 0,
            "comment": "OOPSY by WekiMeki\n\nDAWNDIDIDAWN by Dawn (E-Dawn)\n\nLover Like Me - CL",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dawn’s entire album was so good! Butterfly was my fav b side and just aaahhh, I also thought it’d get more attention but it just passed unnoticed ;_;",
                    "score": 2,
                    "author": "krlights"
                }
            ]
        },
        {
            "level": 0,
            "comment": "APink’s %%(Eung Eung)\n\nI thought it was the greatest thing ever.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I thought Everglow's First would be much bigger than it was - like, asespa's-Next-Level big. I still think it's the better song, and in my top 3 of 2021. And it's my contender for Music Video of the year as well. (On the other hand, I thought the chorus of Pirate was stupid, but somehow that one seems to be bigger than First. Oh well...)",
            "score": 2,
            "author": "Rare-Information5080"
        },
        {
            "level": 0,
            "comment": "(Disclaimer: I’m a Blink.) The preview trailer for On The Ground made me so hyped for the song but, although it’s good, it didn’t hit the way I thought it would 😭",
            "score": 2,
            "author": "Nabi_Tee"
        },
        {
            "level": 0,
            "comment": "I can’t stop me. I thought it would be what The Boys was for SNSD.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[Oh My Mistake!](https://youtu.be/D2MhwXZ8IgM) - by APRIL\n\nDespite the bullying, and not thinking about the members if you will, this song is crazy catchy. Suddenly, it has became a catchphrase for their current situation rn.\n\nBut the song is an absolute bop. This song was on repeat on my playlist way back.",
            "score": 2,
            "author": "jabbachew"
        },
        {
            "level": 0,
            "comment": "Summer Rain by GFRIEND",
            "score": 3,
            "author": "crystaltwizone"
        },
        {
            "level": 0,
            "comment": "Di-sease by BTS. When I first heard that song I thought it would definitely be the next big thing. However it’s very underrated and not talked about a lot. One of my favorite BTS songs.",
            "score": 2,
            "author": "Hopeful-Sympathy-453",
            "replies": [
                {
                    "level": 1,
                    "comment": "My god that song is so good. Truly undervalued.",
                    "score": 2,
                    "author": "usagicassidy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Levanter by Stray Kids",
            "score": 1,
            "author": "VariationInside4329"
        },
        {
            "level": 0,
            "comment": "The Boyz the stealer",
            "score": 1,
            "author": "litzpk"
        },
        {
            "level": 0,
            "comment": "I thought FOR SURE BEcause by Dreamcatcher would be the one. It even got played during a volleyball match (I think) in the Olympics that year.",
            "score": 1,
            "author": "beastrickwillis"
        },
        {
            "level": 0,
            "comment": "Itzy Loco.\n\nWhen it dropped I was awestruck but it seems like it ended up being just another comeback. I genuinely thought it would be like the turning point for their careers.",
            "score": 1,
            "author": "my3altaccount"
        }
    ]
}