{
    "id": "10o6ogw",
    "score": 3,
    "title": "Stamford Street Apartments",
    "author": "johnnie_daniels",
    "date": 1674995665.0,
    "url": "https://www.reddit.com/r/KCL/comments/10o6ogw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m looking to book a room at Stamford Street Apartments. How’s it? And which rooms would have the best view? (London Eye/Thames)",
    "comments": [
        {
            "level": 0,
            "comment": "Eh, it depends what you are looking for in an accommodation. The parties are kinda mid, the fire alarm goes off once a week at 2 in the morning, and there aren't any good common areas like in the other accoms. That being said, the flats themselves(particularly the refurbished ones) are quite nice, the gym is great, and the proximity to Waterloo and Strand campuses is amazing. \n\nYou aren't given any choice for which room you get, so its a complete gamble. Some people have a horrible view of a dumpster or a courtyard, while others (like myself) can see the Shard.\n\nI hope this was helpful.",
            "score": 3,
            "author": "EyeBlueAechDee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey thanks man! This was really helpful. \n\nI think the fire alarm is a thing in most accommodations. Might go for the refurbished ones then. \n\nIt’s pretty close to Strand, that’s why I was keen.",
                    "score": 2,
                    "author": "johnnie_daniels"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The rooms are tiny but the location is unbeatable. It's pretty much pot luck in terms of where you are and who you're with.",
            "score": 2,
            "author": "bogus-thompson"
        },
        {
            "level": 0,
            "comment": "Hi Mate. I’m looking at accoms atm, firmed KCL for politics in Sep. What ones are u chiefly looking at rn because SSA is pretty much the best i can see too?",
            "score": 1,
            "author": "Outrageous-Company15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey mate! I’m starting Political Economy in Sep. \n\nI was looking at SSA and Hayloft. Those are the closest to Strand and are priced reasonably too.",
                    "score": 2,
                    "author": "johnnie_daniels",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll have a look at Hayloft. That’s interesting, we will have our lectures n stuff in Bush/Strand together so perhaps I’ll see u. Maybe end up in a few seminars, Pol Econ and Pol share a few modules in the second year. Also, have u firmed KCL yet? Is the portal open for u?",
                            "score": 1,
                            "author": "Outrageous-Company15"
                        }
                    ]
                }
            ]
        }
    ]
}