{
    "id": "11l15eb",
    "score": 1,
    "title": "Dropping a class with a conditional offer",
    "author": "Mxlia12",
    "date": 1678200162.0,
    "url": "https://www.reddit.com/r/KCL/comments/11l15eb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently received/accepted an offer for an International Relations MA. I am planning to drop a class at my current institution which is an elective that I don’t need to graduate. Dropping the class won’t impact my GPA, so I should be able to maintain it. In your experience, is this enough for KCL to rescind the offer? I’ve been trying to get an answer directly through the message from my application for about a week with no response. On a similar note, I’ve been trying to get a hold of someone for weeks that isn’t an automated email about funding and visas since I’m an international student. Do you have any recommendations? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I wasn’t exactly in the same boat during my final semester at my undergrad in America, I withdraw from a class after applying to UCL because I got a 4 out of 100 on a handwritten law midterm when I forgot to provide the accommodation memo to the professor to type my exam due to my dyspraxia which I pretty much never needed to use. ( I think it’s called in the UK) I was already maxed out on credits I didn’t need that class, he was like too late you can type the next one. I also may have made the mistake of being political when most students in this uni in New York don’t tolerate opposing not just views but even ideas, and it was graded by the young TA not the professor. We had a distinguished professor who was the only conservative in the department and retired due to the political climate in academia. My handwriting is bad but I doubt she couldn’t actually read it. Anyway I got a conditional offer after graduating which I already met and that was it. Didn’t matter at all. Fortunately I had no problem meeting the conditional offer even bombing 2 finals ending with 2 B- 3 A. My conditional offer for kings isn’t too hard to hit but I gotta make up for term 1 a little. \n\nAlso where are you from? If you’re from USA very straight forward and simple. I feel sorry for my friends in China and India however.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}