{
    "id": "139h7mv",
    "score": 1,
    "title": "Atlas or Scape Canada Water Accom",
    "author": "Jaden_525",
    "date": 1683362819.0,
    "url": "https://www.reddit.com/r/KCL/comments/139h7mv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! so I'm deciding between booking either Scape Canada water or Atlas for accom. They both look like great options so I'm having trouble picking. The journey to campus (strand) seems like it would take roughly the same time from either. The issue I have in picking is that if I book Atlas I'd get a non-ensuite, but with a bathroom shared with only 3-4 other people and I think only 6-8 people sharing the kitchen, whereas in Canada Water I can book an ensuite room for the same price but with a shared kitchen between much more people in a flat. Also, I know that Canada Water has a free gym which is a plus. So if anyone who has lived in either or knows about sharing bathrooms/kitchens in accom with many people can give me any help in picking or let me know of any other factors I can consider I would be very grateful. Thanks!!",
    "comments": [
        {
            "level": 0,
            "comment": "i'm in scape currently and it's alright: when i first moved in the accomodation wasn't ready and there were a lot of maintenance issues which took a long time to solve. and the accom tried to fix this by bribing people with chocolate in exchange for 5 star reviews.\n\nhowever, it has gotten better, and i would recommend it it has a lot of amenities: gym, bluetooth speakers, lockable cupboards, dishwasher, quite a few events with free food.  it takes about 30 mins to get to strand which is really not bad at all, and there are buses that take longer but slightly more convenient. the area is good, a bit boring for me personally but it's easy to get out and explore. i would say it's relatively safe except for the 'balaclava boys' who cycle in the neighbourhood and snatch people's phones. so you do have to be vigilant and keep your phone in your pocket. \n\nfinally, the hobs are induction so you'll need induction-compatible hobs!",
            "score": 2,
            "author": "tossin_glitter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info!",
                    "score": 1,
                    "author": "Jaden_525"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’ve had one of my friends staying over at atlas and she’s regretted it for the whole year. the locality is pretty sketchy and it’s not really accessible to campus, you’ll have to walk a lot to reach the bus stations. \nthe plus point was that she took the studio room, which was pretty great. \ni’d highly recommend you taking canada water. it’s a bit far but it’s very easy to commute between campus and the accommodation!",
            "score": 1,
            "author": "Quiet_Vermicelli_681",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 1,
                    "author": "Jaden_525",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Thank you!!\n\nYou're welcome!",
                            "score": 1,
                            "author": "exclaim_bot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 3/4 person flats in Atlas have a tiny kitchen with no space for multiple people to be cooking at one time, there is also no social space in the flats… I’d go for Canada Water if I were you, much better area to be in too!",
            "score": 1,
            "author": "Agreeable_Chicken_2"
        }
    ]
}