{
    "id": "13i8tzw",
    "score": 2,
    "title": "Not meeting KCL conditional offer",
    "author": "Ok-Watercress8849",
    "date": 1684158434.0,
    "url": "https://www.reddit.com/r/KCL/comments/13i8tzw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was offered HL 655 for KCL offer and 34 total, but with my M23 IB exam, I don't think I can meet the HL offer nor total score. do you think KCL will still accept me if I miss by 1 or 2 total score? or will they reject me straight off.",
    "comments": [
        {
            "level": 0,
            "comment": "I’m having a similar issue, I’m applying for my MSC &amp; my cumulative GPA ended up as a 3.23, when my conditional requirement was a 3.30. I’m planning on trying to appeal with the admissions committee. \n\nI think you can do the same! Just explain your situation &amp; highlight your experience.",
            "score": 4,
            "author": "TelephoneBroad3276",
            "replies": [
                {
                    "level": 1,
                    "comment": "how do you appeal with the admissions committee? what do you have to do?",
                    "score": 2,
                    "author": "Ok-Watercress8849",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All you both have to do is send a message to Admissions informing them of your results (send documents that confirm these results) - then basically what happens is that these are looked at against the programme requirements and if you are not meeting (it is helpful if you inform them of this in your message along the document and say that you would like to still be comsidered!) then Admissions automatically checks whether they could still extend you an offer. Can’t guarantee anything! But yeah this is the procedure :) hope this helps!",
                            "score": 5,
                            "author": "maiianaiia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I applied to Unis in 2021 for the 2021-2022 calendar year. While I cannot speak for Kings, I had 2 offers from Exeter Uni both for 35 overall with 666 minimum in HLs. I got a 38 with a 765, and they rejected me from both offers because 765 is not 666 minimum although one would assume they might be equivalent. \n\nHave faith in yourself for exams, work hard - but do have a good backup option.",
            "score": 1,
            "author": "SuccessfulChest719",
            "replies": [
                {
                    "level": 1,
                    "comment": "Business and Computer Science were the courses applied to\\*",
                    "score": 1,
                    "author": "SuccessfulChest719"
                }
            ]
        }
    ]
}