{
    "id": "37lvib",
    "score": 0,
    "title": "Prospective international student with questions D:",
    "author": "Raptorrocket",
    "date": 1432828743.0,
    "url": "https://www.reddit.com/r/KCL/comments/37lvib",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm specifically an American student. I plan to apply for the Sept. 2016 term.  My degree/program would be an Msc in Disasters, Adaptation &amp; Development.\n\nI've been looking into funding and luckily fafsa will help out.\n\nMy major complications are that I'm completely out of my element in regards to applications for schools and their processes.  I'm finishing my Bs currently but the application process here was literally guaranteed acceptance.\n\nSo my main questions currently are:\n\nAs far as rooming I was thinking the intercollegiate halls, specifically the International Hall.  It's catered and that really appeals to me because otherwise I would have to cook (which I'm absolutely deplorable with) and also I'd have to figure out cost estimates for food/cookware. Has anyone lived here? Is it in a safe area? It looks like it's literally one stop on the tube and maybe a little walk further to get to Strand which is where my department would be.\n\nAlso, with the oyster card how much approximately would a monthly tube card be? Is that a thing...can I get monthly tube cards?\n\nAs far as the application process, what order of things am I looking at?  It seems like everyone contradicts each other.  I imagine it's application, funding, housing, visa? But to figure out how much I'm eligible for from Fafsa, I need to contact the admissions office at King's...except I can't apply yet for that term because they aren't accepting applications for 2016.  I also can't look at Fafsa for the 2016 term.\n\nI'm totally at a loss.  I'm fairly certain with my experience and grades that acceptance won't be hard to achieve. However I'm unsure about the actual funding and housing process...as well as a student visa. I need to prove I can live on my own, which includes all money from the fafsa and other loan lenders if needed. But to get my student visa I need to know HOW much I'll be getting as well as that I have placement at the university/housing.\n\nSo overwhelming X.x\n\nThanks for any help you guys can provide!!!",
    "comments": [
        {
            "level": 0,
            "comment": "monthly zone 1 pass is [123.30](https://www.tfl.gov.uk/cdn/static/cms/documents/tube-dlr-lo-adult-fares.pdf) but you wouldn't need it to get to lectures.  the walk to the stand campus is ~15 mins.  You could easily spend less on travel for social events but if you go out a lot it might be worth it.  \n\nI've not lived in those halls but the area is very safe.\n\ncan't help you on the application stuff. maybe the international student support [page](http://www.kcl.ac.uk/campuslife/services/student-advice-support/how/intlstudentsupport/index.aspx) will help?",
            "score": 2,
            "author": "diracnotation",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so glad to hear about the area being safe. I figured at most I'd rent a bike. I think I'll opt for an oyster card and only use public transport as necessary. And yes thank you :3",
                    "score": 1,
                    "author": "Raptorrocket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even though International Hall is catered, the food there is notoriously bad. I would suggest another catered hall, such as Connaught Hall or College Hall.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will look into those both! Thank you! :3 I'm looking for convenience mostly. I'll be new to London and I'd like a straight shot to strand or as close to as I can get, preferably in walking distance.",
                    "score": 1,
                    "author": "Raptorrocket"
                },
                {
                    "level": 1,
                    "comment": "Oh...so looking on a different website it says dinner is an additional 5-6 pounds. But on the school website it says two meals are provided in the fees. I'm so confused D: It's not worth paying the additional for catering if I'm going to only be provided breakfast.   Edit: Also all three have the same menu xD",
                    "score": 1,
                    "author": "Raptorrocket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are several fantastic intercollegiate halls. They are all in 'safe' areas, don't worry, and should have a good mix of students. I'd recommend College Hall, I stayed there and it's a beautiful location, but check out the descriptions to see what works for you. Some of them are in very nice areas, some in average areas, but all great and give a good perspective of London life. A stop or two on the tube from the Strand is more than anyone can hope for - Zone 1 or 2 is great!! Remember some colleges in UoL start at a different time, therefore I believe one issue with intercollegiate halls is that that due to term times, King's students arrive a week early (so no one is there) or a week late (so everyone else is over fresher's week/meeting people). Can't remember which! I think some King's halls do catering but you should consider living in shared self-catering kitchen halls as it is a great way to meet people and cook crap (everyone does!)\n\nZone 2 travelcard on Oyster was about £80 a month for unlimited bus, tube and train within zones 1-2 last year I think. Bikes are good if you are in zone 1 but London is not overly bike friendly (old, narrow, traffic-y streets) so don't rule out the good old tubes and buses, especially when it rains!\n\nCan't your school help with the process? As I'm not an international student I can't advise on the order, but I would assume it is main application first, then housing/visa separately but maybe at the same time if the visa needs time to process.",
            "score": 1,
            "author": "abyssinia06",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! I'm primarily hoping for International Hall but I'm not putting all my eggs there. And yay rain haha...I'll buy an umbrella then xD And thank you, I'm planning to stay in zones 1 and 2 so that will be nice, especially if they include travel in the cost of living for my loans. And yep! I'm waiting to hear back from them for another issue but when they respond I plan to ask about the process in more detail if I can't find it.",
                    "score": 1,
                    "author": "Raptorrocket"
                }
            ]
        }
    ]
}