{
    "id": "6jhoga",
    "score": 3,
    "title": "KCL Rigor for Informatics major??",
    "author": "Lightweightforlife",
    "date": 1498435596.0,
    "url": "https://www.reddit.com/r/KCL/comments/6jhoga",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there! I'm studying abroad in the 2017-2018 school year at KCL as an informatics major. I've just finished year 2 of my 4 year program in the US. I've completed most all of the foundation computing courses at my school and have taken a few upper level courses. Does anyone know what the rigor for informatics is like at KCL? Are level 6 classes crazy hard? Should I stay away from them if I'm trying to enjoy my time and not be overloaded with corsework 24/7? Or are they doable? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Graduating this July in Kcl, i wouldn't say level 6 are crazy hard. Out of the 6 modules I've chosen for my final year (term 1 &amp; 2), I'd probably say only 1 of them was unreasonably hard in terms of the exam. The rest I've found okay, although some took a lot more effort than others of course. I took Optimization methods, text searching and processing, algorithms for the www, distributed systems, software measurement and testing, internet systems. Didn't receive my results yet but expecting to graduate with a first. Optimization methods was the one really hard exam for me, but mostly because it was a bit of a wildcard this year, compared to other years' exams.\n\nThe only marked coursework i had was for internet systems worth something like 15% i believe, the rest were all 100% exam. The security level 6 modules get a lot of praise from everyone I've talked to, although i didn't take them myself.  ",
            "score": 2,
            "author": "ThrowawayDudeGuyMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your information! ",
                    "score": 1,
                    "author": "Lightweightforlife"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah agree the security module I took was really good.\nTeaching for the rest of the courses for the MSc level was subpar",
            "score": 1,
            "author": "the_only_redditor"
        }
    ]
}