{
    "id": "l6eatr",
    "score": 5,
    "title": "Hi :) I have to decide if I'll apply to KCL for Maths, and I'm wondering: Can anyone give me an estimate of how much everything would cost me per year (excluding tuition fees)? I'm only interested in an en suite place, near the university",
    "author": "MALLY10FE",
    "date": 1611781268.0,
    "url": "https://www.reddit.com/r/KCL/comments/l6eatr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm not a big spender (no other option...)\n\nAlso, how difficult is Maths there?\n\nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "When I was in halls about 3/4 years ago my rent was £800/month, then cost of living probabky about £300/month, and I was hardly a big spender. Travel is expensive and central London isn't cheap.",
            "score": 2,
            "author": "Crusadaer"
        },
        {
            "level": 0,
            "comment": "Umm I’m sure they have something about that on their  website. But I’d say roughly around £1300 a month.",
            "score": 1,
            "author": "AR7_",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait, you mean rent only?????\n\n*passes out*",
                    "score": 2,
                    "author": "MALLY10FE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gonna assume you mean student accommodation. In which case they have all these things listed on the website.. from what I remember it’ll run you c. £210 a ~~month~~ week for an en suite. At the low end, so you’ll likely be looking at more. I do, however, **highly** reccommend getting an en suite. The cost is worth it. I am frugal to the nail but damn, nah. The stories I’ve heard. \n\nWork out what campus you’ll be on and get accommodation closer to that. \n\nIn terms of spending that’s up to you. Work it out yourself as it’s highly subjective. This stuff isn’t too intense, especially for a future maths student. (;\n\nI jest, but seriously, a lot of this is either subjective or easily searchable on Google. The one thing I recommend, however, (bar the en suite) is to go for uni’ accommodation at least for first year. Private is just a pain. Also consider travel. You might want to walk/cycle for free, bus &amp; Tube will cost, obviously. \n\nIn terms of budgeting, it’s really easy to eat healthy and eat cheap. Honestly it’s the junk and crappy food that’s expensive. It takes time out of your day but you can meal prep (there’s a sub for this I forget. Probably /r/MealPrepSunday off the top of my head) to limit it but honestly you need to eat well doing an intensive degree. Placebo effect or not, it does you well in the long run. My proudest moment at uni’ was doing a full week’s shop with £32 - and £17 of that was a bottle of whiskey. \n\nCan’t say for a pure maths (I assume) undergrad’ degree, but I’m continuing doing an MSc and the maths side is taught very well at both under and postgraduate from my experience. \n\nEdit - month to week. What is time but a concept anyway. Tell *that* to your landlord.",
                            "score": 2,
                            "author": "Crambo-clink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "210 per month ONLY??? Isn't that far too low? I mean, it's great, but I was wondering whether or not to include King's because people have been scaring me about the costs. But 210 is pretty great. I hope you don' tmean per week?",
                                    "score": 1,
                                    "author": "MALLY10FE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry. I mean per week. Freudian slip.",
                                            "score": 1,
                                            "author": "Crambo-clink"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, that's their estimate for the average monthly cost of living, including rent. In Wolfson House (non-en suite) I was spending about £900/month. But, that was with some super savvy budgeting. Ping me a message if you want a chat about living at KCL, and the costs involved.",
                            "score": 1,
                            "author": "q-the-light"
                        },
                        {
                            "level": 2,
                            "comment": "The £1300 a month I mentioned is for all your expenses for the average person. Rent food travel etc.",
                            "score": 1,
                            "author": "AR7_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s a few bursaries available such as the Kings Bursary, and based on your household income you can apple for King’s Affordable Accommodation Scheme (KAAS). It slashed the rent from £250 to £169 (student applying for Stanford Street Apartments)\n\nI’d highly recommend it because at the end of the day it’s London and you’re at a prestigious university.",
                                    "score": 1,
                                    "author": "EntertainerOk6472"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im with the other comments here, count about 800-900£ per month for accomodation in halls, and 300-400£ per month for living expenses (varies if you are in catered halls etc...). \nYou can go under this budget, but I do not recommend it at all, you wouldnt have a good life (horribly long commutes, bad eating habits, no going out for saving purposes and hence not meeting people etc...).\n\nSo yes, If you cannot afford this, or if you feel like this will be tight, I very strongly recommend to consider studying elsewhere. Finances are an important part of life, and if you constantly limit yourself and count every penny you spend, you will end up frustrated with your overall experience, limited in the people you are friends with, and even potentially unhealthy (if you end up eating a lot of the cheap and horrible Tesco meal deals for example, like I did in my first year). There are great unis in much cheaper cities, where you may end up having a much better life. \n\nHope this helps.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Halls are 200£/week, SSA is probably the best option for you. If your family income is under 35k it’s 169£/pw under KAAS (you have to apply as soon as possible though), there’s a 1600£ living bursary a year if your family income is assessed by SFE and is under 35k.",
            "score": 1,
            "author": "craygarry"
        }
    ]
}