{
    "id": "ng4mnx",
    "score": 10,
    "title": "How Hard Is It To Get In As An American?",
    "author": "[deleted]",
    "date": 1621427770.0,
    "url": "https://www.reddit.com/r/KCL/comments/ng4mnx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an international (American) student applying specifically to King’s College London, University College London, and the University of St. Andrews. However, I have heard that American students usually have an easier time getting an offer from these schools because they pay more tuition, and therefore, is less selective. These schools mainly require a 5 on AP test, but would they admit me if I submit 3s or 4s? Has anyone reading this gotten into these schools as an American? How hard is it?",
    "comments": [
        {
            "level": 0,
            "comment": "It definitely depends on what major you apply to. Some will have easier entry requirements or be more friendly to Americans. But if your scores/grades don't match up with the general American entry requirements, I think it would be pretty hard and you'd need to write a good statement or take more tests to prove that you are able to keep up.",
            "score": 3,
            "author": "squeaks-m-cello"
        },
        {
            "level": 0,
            "comment": "Would love an update on this if you get any helpful answers! I’m an American looking to apply as well :)",
            "score": 2,
            "author": "e3tezq"
        },
        {
            "level": 0,
            "comment": "just don't come",
            "score": 2,
            "author": "FewTransportation710"
        },
        {
            "level": 0,
            "comment": "I can answer questions about the process if you need, I got in this year- I had really good test scores though.\n\nIt's easier in some ways than applying to the top American schools",
            "score": 1,
            "author": "eggplant_avenger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi I am an American international student applying specifically to King’s College London as well, and I am interested in applying for an undergraduate in Nursing and I have an Associate’s degree. I know credentials work differently here, but my main area I am most concerned about is financial aid and packages (if any) they offer. Would you say there’s some potential in getting a not so bad tuition ?",
                    "score": 1,
                    "author": "psychoxbby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey! Good luck and hopefully I'll see you in London next fall. If you have questions about credentials I can help too, but I think UCAS and the unis provide a lot of information already.  \n\n\nTuition is pretty much fixed for international students, it's \\~35K a year. Financial aid isn't as generous as it'd be at Oxbridge or the way the Ivies do it here. I'm self-funding and it's honestly a little rough, but I think there are scholarships available to nursing students that will cover a big chunk of the cost.",
                            "score": 1,
                            "author": "eggplant_avenger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope to see you next fall as well!! Would you suggest looking at other U.K. schooling that may offer a bit more international scholarships + funding? I probably will end up being self funding as well and while I know it can be a bit rough (but doable) I wonder if it’s worth going to the school for and instead continue my education here in America? I do wish to be able to relocate + travel + have the opportunity to learn somewhere else if I could but financial just scares me a bit as my family doesn’t make the greatest income. I have not seen any nursing scholarships available for nursing students just yet (probably because the next semester application hasn’t opened up yet) but I would just have to hope I would be able to qualify for those as well 😭this entire process is so nerve racking",
                                    "score": 1,
                                    "author": "psychoxbby",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know! It was so stressful sometimes without any support or friends who knew what to do.\n\nIt's worth looking around and emailing other unis in the UK, and it'll be cheaper to attend outside of London if you don't mind studying in a different part of the country.\n\nI would look into study abroad programs too, I did one at LSE and Kings had an agreement with my university here so I could pay tuition here but attend classes there (so it was covered by my scholarship). It's not exactly the same experience, but I still loved it. \n\nIf it's something you really want to do, I think you should go for it, even if it means a year or two of saving up. That's just me though, my whole family has been very supportive (but too poor to help 🙁) and they've been talking me into it",
                                            "score": 1,
                                            "author": "eggplant_avenger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think I really do want to study in London but wouldn’t mind looking into other Unis outside of London! \n\nI was looking at study abroad programs except my main goal is to be able to get into a nursing school and study abroad programs are only for a year or a semester of schooling 😭\n\nI think I am going to try and attempt to make it happen even if it means I probably have to take out student loans + working, as my family probably won’t be able to fully support me either😕",
                                                    "score": 1,
                                                    "author": "psychoxbby"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "where else would you suggest studying outside of London ? I have been looking into Manchester and UCL but I’m not too sure about which colleges would offer more scholarships + financial aid 🤷🏽‍♀️😭",
                                                    "score": 1,
                                                    "author": "psychoxbby",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't know enough about funding to recommend much in that respect, but I applied to a lot of schools just because I'd like to live in the area. \n\nI *loved* Canterbury so I originally wanted to go to Uni of Kent (it also has a good program in the area of law I want to study). York had a nice vibe to it too, and I know people who went to Nottingham who loved it. \n\nI'd recommend staying away from the bigger cities if you want to keep cost of living down, and go through uni websites to see if they offer a good bursary. All of the admissions teams were very kind and helpful, and they helped me through the process a lot.",
                                                            "score": 2,
                                                            "author": "eggplant_avenger"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also what are the steps would I be taking if I were to apply? I do know I want to apply and need to apply through UCAS but this is my first time applying internationally and the websites + links have all really really confused me and it’s a lot to process.",
                    "score": 1,
                    "author": "psychoxbby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think this is everything, but you might find other steps along the process:  \n\n\nYou can do everything through UCAS, so just work your way down the menu on the left. I'd say right now you should start thinking about your statement and who you want to be your reference. You can send the invitation to your reference any time, obviously earlier is better.  \n\n\nUCAS only lets you pick five schools, so unless you're totally set on King's (which is a great university and I'd totally get it if you were) you should do some research on other schools.   \n\n\nThe other parts of the application are pretty straightforward, it's just work and education history. Once you have everything finished there's a small fee (like 50 squids) and then just wait for a decision. I think KCL does interviews for nursing, but I don't know much about that process.  \n\n\nUsually Americans will get unconditional offers since we already have all of our grades. If you accept I think you're pretty much locked in. I got my offer within a week or two of applying (mid January). They gave me a link to apply for housing in May (iirc) and I  just got my CAS number today, which means I can now apply for a visa. King's is really good about holding events before all of the major milestones after you're admitted, so I won't get too into all of that here (but DM me if you ever have questions about the visa process or whatever, if you'd rather not ask KCL directly)",
                            "score": 1,
                            "author": "eggplant_avenger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "THANK YOU SO MUCH FOR THAT INFORMATION. MY MIND FEELS A BIT MORE AT EASE NOW THAT IVE FINALLY FOUND SOME ANSWERS. How would you say financial wise it is for American international students? I’m a bit worried the tuition will be quite pricey and I do not want to default to taking out massive student loans. I understand it can come out to being about ~30K + living per year and I really don’t want to go into debt for a school although I am really interested in King’s.",
                                    "score": 1,
                                    "author": "psychoxbby"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\*For U.S. International Students who have recently been offered a conditional offer from KCL..!!\\*  \nI was recently offered a conditional offer from the KCL sociology department. My entry requirement was to obtain a 55444. In my offer letter, I was provided with a link that showed the list of entry requirements specifically for U.S. students. In this link, there was a list of combinations of SAT - Subject test, SAT (regular), and AP exams. In the list, I saw that I met one of the entry requirements which consisted of obtaining a 700 or above in SAT subject test, SAT at 1350, and one 5 and one 4 in AP exams. I emailed the sociology admissions team, asking them to update my offer. However, I got a response from them that I don't meet the entry requirements because KCL is not considering SAT subject test scores anymore.   \nHowever, recently I was also offered a conditional offer from the history and international relations department of KCL as well. The admissions officer updated my entry requirements from 55544 to receiving two 5's on AP exams, 700 or above in SAT subject test, and SAT at 1350.   \nDoes anyone know which department is right? The website doesn't mention anything about KCL not accepting SAT subject test scores anymore. Is KCL actually not accepting SAT subject test scores anymore? Was anyone able to change their entry requirements from only AP exam scores to a combination of AP scores, SAT subject test scores, and SAT score?   \nThank you!",
            "score": 1,
            "author": "Better_Joke6298"
        }
    ]
}