{
    "id": "106ygtm",
    "score": 5,
    "title": "Couple questions regarding COSC 1p03",
    "author": "torrentialsnow",
    "date": 1673221869.0,
    "url": "https://www.reddit.com/r/brocku/comments/106ygtm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am very scared taking this course. Been a while since I did 1p02 and haven’t kept up with coding since then. I keep hearing this is a super tough class. For those of you that have taken the class where you were very new to programming how difficult is this class? And is there a good crash course on 1p02 topics I can look into to prepare?\n\n\nAnd are there labs and tutorials in the first week?\n\n\n\n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "imo Not a course you can afford to fall behind in. Had it last year and it beat my ass. If you can familiarize yourself with the data structures beforehand it will help you a lot. \n\nGood luck!",
            "score": 3,
            "author": "DanKaise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya I definitely need to get a better study schedule going. \n\nAnd do you know of labs and tutorials start on the first week?",
                    "score": 1,
                    "author": "torrentialsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those start second week",
                            "score": 2,
                            "author": "DanKaise"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took 1p02 about 3 years ago, and just got 81 in 1p03 last semester. It's fine if you just keep up",
            "score": 3,
            "author": "no1likesuwenur23",
            "replies": [
                {
                    "level": 1,
                    "comment": "What would you recommend as the best place to go for when you need help? Just emailing the teacher or TA? Or is there a math help center equivalent for CS?",
                    "score": 1,
                    "author": "torrentialsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes there is a CompSci help center, you have to bring your own laptop though as there aren't any computers in the room (I never used it because of that fact, despite wanting to)",
                            "score": 2,
                            "author": "no1likesuwenur23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, appreciate it.",
                    "score": 1,
                    "author": "torrentialsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best to join the computer science club and then discord, we can help you out.",
            "score": 2,
            "author": "2Fruit11"
        },
        {
            "level": 0,
            "comment": "keep up with lectures, tuts, and labs. don't fall behind. If you do, get help asap either from brock, friends or elsewhere. assignments should be started minimum a week before they're due, the earlier the better. the midterm and final exams are heavily based on past exams (based on last semesters exams). study past papers and you will do well. it's not super hard once you get it. good luck and feel free to dm me",
            "score": 2,
            "author": "benchwarmer_guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, appreciate the help.",
                    "score": 1,
                    "author": "torrentialsnow"
                }
            ]
        }
    ]
}