{
    "id": "10z3voh",
    "score": 6,
    "title": "Does anyone else think the Brock parking lot is enormous?",
    "author": "ProductEmbarrassed",
    "date": 1676065221.0,
    "url": "https://www.reddit.com/r/brocku/comments/10z3voh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been at Brock for a few years now and after discovering notjustbikes on youtube, I see some glaring issues with the campus. Despite bus passes being offered to every student, I feel like way too many people are opting to drive simply because the space is available. The parking lots are bigger than the school itself and they only serve one purpose: to store cars. I wish St. Catharines wasn’t such a car dependant hellscape and I feel like Brock has an obligation to do better by the community. Also at the East Academic crosswalk, I’ve seen people blow the light and almost hit students trying to cross. Huge parking lots are ugly and stressful to navigate through for everyone. I could go on but I’m curious if anyone else feels the same way…",
    "comments": [
        {
            "level": 0,
            "comment": "You’d think there was 13 parking spaces in total just based on how much a parking pass costs tho",
            "score": 18,
            "author": "meVERSUSmath",
            "replies": [
                {
                    "level": 1,
                    "comment": "another reason to take the bus. not having to worry about parking/paying to park or having your car get dinged. Walkable spaces are more pleasant to exist in and it doesn’t hurt your wallet as bad.",
                    "score": 1,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not everyone can take the bus.  Many of those parking on campus are driving in from out of town because that's the only way they can afford their education.  Yet they are still paying for a bus pass they can't use.\n\nI realize you've watch a doc about evil cars, but bikes in the case of Brock are only useful for a select few who live close to campus, but not on the bottom of the hill.",
                            "score": 2,
                            "author": "toddster661",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "look i understand that. we live in a car dependent country and people have no other option. what i’m saying is that most people who have access to the bus that can quickly get them to school aren’t taking the bus because they think it’s less convenient. there is no justification for the parking lot to be bigger than the school. the people who live close that have bus access should be taking the bus. i’m not saying to abolish all parking spots. to create a lot bigger than the school encourages people who live close enough to just choose to drive instead because they know a spot will be available. if you build it, they will come and brock chose to build a huge parking lot. also i’ve seen people biking up the hill by brock but u won’t catch me doing that cause i don’t want to be roadkill. there’s literally bike related signs up and down the hill so clearly brock expect some people to bike but bike infrastructure is more than just a “share the road sign.”",
                                    "score": 1,
                                    "author": "ProductEmbarrassed"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Were you not here when they blew up Zone 2 parking to build the Canada Games centre? They took away my ability to park, so I just parked somewhere else. \n\nWe’ve got a balance on campus, you can walk around, live, and eat on campus. And the rest of us can make our education possible in part by having the access to parking.\n\nI’m glad I have somewhere to store my car while in class, and it’s okay that that patch of asphalt doesn’t do anything useful to humanity while i’m not using it. Same for the campus buildings when they’re not in use. Something doesn’t have to be 24/7 useful and aesthetically pleasing to justify existing. And cars are an incredible tool of mobility that save me and others and enormous amount of time, and free us from insane costs of living in dense neighborhoods.",
            "score": 15,
            "author": "somekyle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could have sworn they put another huge parking lot next to the canada games centre. I’m not saying abolish all parking spots, but the lot should not take up more space than the school itself. I believe in the “if you build it, they will come concept” and clearly, they built a big ass parking lot",
                    "score": -2,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eventually they rebuilt the large Zone 2 parking, but for a year it was mostly not there (had a much different footprint before).\n\nYou're right, in some cases if you build it, they'll come; and if you don't build it, they won't, at all.",
                            "score": 3,
                            "author": "somekyle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also. If you're riding the bus why are you navigating the parking lot. It's really not difficult to follow",
            "score": 5,
            "author": "paperbagprincess1",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://brocku.ca/brock-news/2022/03/campus-security-looking-for-witnesses-of-on-campus-crosswalk-incident/ Also people have been hit at that cross-walk before. The campus should be designed for people, not cars.",
                    "score": 4,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So? It’s not the parking lots fault someone got hit.",
                            "score": 5,
                            "author": "Longjumping-Mix-3642",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "when you force everyone to drive, there’s bound to be idiots on the road. people also can’t get run over when cars aren’t there, not a tough concept",
                                    "score": 3,
                                    "author": "ProductEmbarrassed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No one is being forced to drive. The bud pass is literally forced on us. The chance of getting hit by a car is so low it’s negligible",
                                            "score": 6,
                                            "author": "Longjumping-Mix-3642",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "also somebody literally got hit on campus last year, how many people need to get clipped, nearly hit, or killed before something changes? we’re operating on 1960s infrastructure, why would we not want to innovate?",
                                                    "score": 4,
                                                    "author": "ProductEmbarrassed",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Because it works. Cars are great and work well. Again parking lots are not dangerous. The risk of even having a close call is very low. Why force us to take a bus when cars are fine?",
                                                            "score": 1,
                                                            "author": "Longjumping-Mix-3642",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "car dependency is a terribly inefficient system. the only reason you think it’s great and works well is because that’s how the community was designed: around car based infrastructure. requiring a car is insanely expensive when considering the initial cost, insurance, gas, maintenance, and parking. when looking at European communities, particularity ones in the netherlands, it can show you what other viable forms of transportation look like and how people can easily get around without needing a giant metal death box. ever have the feeling when you’re driving and you realize you’ve been on autopilot? people feel invincible in cars and roads are designed to make the process as comfortable as possible which is bad because it creates that autopilot feeling which is when accidents happen most often. watch some notjustbikes videos, i used to think the way you did until i realized there’s a better alternative[notjustbikes video on “stroads”](https://youtu.be/ORzNZUeUHAM)",
                                                                    "score": 3,
                                                                    "author": "ProductEmbarrassed",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Cars are more efficient. A bud will not take you where you want when you want. You are beholden to their schedule. With a car I’m able to do what I want and when. “Giant metal death box” what do you think a bus is? Idk about you but I have never once “felt invincible” in my car.",
                                                                            "score": 0,
                                                                            "author": "Longjumping-Mix-3642",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "so you think cars = freedom? you’re entire dependent on roads to get you from place to place, you require gas that can just arbitrarily go up in price on a whim, you get in an accident? you’re fucked. you need to pay for parking, pay for maintenance, find a mechanic who won’t screw your over. cars are just another headache. i just want to be able to get bread or basic ingredients or do basic activities without having to worry about needing a ride or having to pay for gas. like i said before, bus infrastructure sucks ass because all the money goes towards facilitating private infrastructure in the forms of cars. also the number of single people driving their cars is insane, we know there’s an ecological crisis and the planet is heating at an unprecedented rate, how can we just sit idle and not act upon this issue? also have you never planned out a drive based on heavy traffic? also a [not just bikes video](https://youtu.be/KkO-DttA9ew) on why car dependency in ontario is horribly inefficient",
                                                                                    "score": 2,
                                                                                    "author": "ProductEmbarrassed",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "you’re right, nobody is being forced to drive but when you design the entire community around roads and parking lots, that infrastructure coerces people into driving. would you rather every person on the bus drive? cause they are packed in the morning/evening. that’d be a lot more cars on the road and then we’d need a bigger parking lot to accommodate them, so what do you think? public transit should also just be free by default imo",
                                                    "score": 1,
                                                    "author": "ProductEmbarrassed",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t care if they drive at all. If they want the buss or not I don’t care. Also No such thing as free when it comes to government",
                                                            "score": 1,
                                                            "author": "Longjumping-Mix-3642",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "less people driving = cheaper gas. supply and demand. people who ride the bus are literally saving drivers and the community money on road maintenance and gas prices. also when i say free, im referring to where our tax money is being spent, which is primarily on repaving roads and a police force who protects the wealthy. it’s all about money and if you have little, it’s dehumanizing. communities existed before cars, we just need to go back to designing places on a human scale and that involves retrofitting obsolete car based infrastructure.",
                                                                    "score": 2,
                                                                    "author": "ProductEmbarrassed",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Call it obsolete all you want it’s more convenient to have cars",
                                                                            "score": 0,
                                                                            "author": "Longjumping-Mix-3642",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "no it’s not",
                                                                                    "score": 2,
                                                                                    "author": "Fast-Custard7692",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I used to live on campus as well at lowen and every day I’d have to walk through the huge parking lot there and cross at the cross walk by Dhowes which was pretty sketchy sometimes. I’m just trying to draw attention to wasteful and ugly space.",
                    "score": 3,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s true though. There are some “stop for pedestrians” signs but the drivers barely stop. I almost got hit once when tried to cross the stress… now i’m just waiting it’s empty to walk :(",
                            "score": 2,
                            "author": "hongun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“share the road” signs are insulting, i know what you mean. drivers do not listen to signs but they will listen to physics if it means their car will get damaged. more speed bumps and more narrow lanes force drivers to pay attention and slow down more than a “children a play” sign ever will",
                                    "score": 2,
                                    "author": "ProductEmbarrassed"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People commute from outside St Cats.",
            "score": 3,
            "author": "paperbagprincess1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I understand that but the majority of students live in st. catharines, I can’t imagine there being that many outside commuters to warrant a parking lot that is bigger than the school itself.",
                    "score": 0,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah bus St Catharines his system is trash. If you don't live near the school, it takes like 2 hours to commute each way. It takes me 20 minutes to drive...it's the obvious choice.",
                            "score": 6,
                            "author": "poetris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "this kinda proves my point that most municipality’s see buses as something for poor people and therefore cater to cars. Buses are only trash because the city barely invests in them, same with bike lanes. this is why i advocate for better public transit because it shouldn’t take you a 2 hour bus ride to get to school when it sounds like it’s relatively close to you.",
                                    "score": 2,
                                    "author": "ProductEmbarrassed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're right. But you said giant parking lots made people drive. It's not the lots, it's the transit system.",
                                            "score": 4,
                                            "author": "poetris"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s justified by cars being fairly ubiquitous. Getting between cities in Ontario and Canada Ritter requires a car or is easier with one. Therefore many have cars and will opt to use them instead of the bus because it’s more convenient",
                            "score": 2,
                            "author": "Longjumping-Mix-3642"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not, during my last year at Brock they literally oversold the parking spaces, and many people straight up just didn't have spots to park on campus. Let there be parking, fam.\n\nBesides lots of students would straight up not be able to come to campus without parking. Brock has students who live in Dunnville for example.",
            "score": 2,
            "author": "Blakebacon",
            "replies": [
                {
                    "level": 1,
                    "comment": "i understand that some people have to drive, but the majority of the parking sports are probably being utilized by students who think driving is more convenient and have access to a bus that comes every 30-15 minutes. to have a school lot that is bigger than the school is absurd. maybe the parking lot wouldn’t be packed if there were more viable options to get to school but all we got is car or bus. also to ride your bike around brock is essentially suicide. that’s the issue with car dependency is that it utilizes massive amount of space and still fails to facilitate everyone in a efficient manner. consider rush hour and how congestion the parking lot is in the mornings/evenings. it’s just a bad system that’s dangerous, isolating, and ugly as hell",
                    "score": 1,
                    "author": "ProductEmbarrassed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree it's enormous",
            "score": 2,
            "author": "Expert_Anywhere9051"
        },
        {
            "level": 0,
            "comment": "Ok so 8 months a year you build an enormous transit infrastructure to move students within half an hour to campus from St Catharines and the surrounding area. Then you park it all for 4 months when the majority of students are not there. Is that more efficient?",
            "score": 2,
            "author": "Curious-Ant-5903",
            "replies": [
                {
                    "level": 1,
                    "comment": "people go to brock year round, the place also acts as a community centre for families who want to take their kids swimming or to sporting events",
                    "score": 2,
                    "author": "ProductEmbarrassed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cars are not bad. A city being car dependent isn’t bad. It’s not bad for the “community” that brock gives us parking space. Navigating a parking lot isn’t stressful at all if you’re not a child",
            "score": 1,
            "author": "Longjumping-Mix-3642",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cars are not bad in themselves, but car dependency is bad for cities. Here a few reasons why: \n\n1) Since cars are the main option for transportation for most people as they are seen as the most efficient form of transportation, everyone wants to drive. This causes an unnecessary amount of congestion on roads as for most people as there is no viable alternative to get around. Public transit in this country is nowhere near good enough to compete with cars, so everyone drives. The best way to reduce congestion is to get more piece off the road. \n\n2) Having thousands of cars drive on your city’s roads everyday also create more wear and tear on the roads, meaning you have to waste money servicing them more often. More cars also mean more pollution too. \n\n3) Above ground parking is a waste of space that could be avoided if more cities privileged public transit, biking, and even walking as viable modes of transportation in the manner they do with cars.",
                    "score": 5,
                    "author": "ohflow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1. There is little to no meaningful congestion outside of Toronto in some areas\n\n2.upkeep isn’t really waste \n\n3. It’s not a waste of space",
                            "score": 1,
                            "author": "Longjumping-Mix-3642",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why bother relying if you’re not going to elaborate your points in the slightest? Regardless I will quickly rely to each of your points. \n\n1) Nobody knows, probably not even you, what you meant by “meaningful congestion.” Nobody likes getting stuck in traffic or moving 20% of the posted speed limit due to congestion. This literally happens daily in downtown St. Catherine’s during rush hour. Also occurs daily Glendale and Glenridge. I used to live on Glenridge and work downtown, so I would hop on a bus and it would take 20 minutes to reach the downtown terminal! With no traffic this route takes like 7mins. This is a painfully bad take bud.\n\n2) Upkeek in itself is not a waste and I never said that. My point was that cars weigh a lot, having thousands of pounds of force cross over roads every minute of the day creates a lot of wear and tear on the roads, causing them to need to be serviced more frequently then they should. Servicing roads costs lots of money. How to save the city money in the long run? Reduce the amount of cars that are on the roads, even by just a fraction and this will improve the lifespan of your roads. \n\n3) Parking is necessary for cars, but at the same time parking takes up a lot of space. This is space that could be used more efficiently. For example, you could have more businesses or housing in place of many parking lots. Both of which generate tax revenue for the city whereas parking does not. Not to mention we are in a housing crisis, and more housing wouldn’t hurt. Obviously some amount of parking is always necessary, as cars still serve a useful purpose. \n\nAlso, limiting transportation options to one single option in any city is a bad idea, here it just happens to be cars.",
                                    "score": 3,
                                    "author": "ohflow"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an incredibly narrow-minded take, and basted on OPs posting history, this seems to be the case generally for OP.\n\nNot just bikes fails to consider that not the entire world lives in a city. This youtube channel is based in Amsterdam, a city with excellent public transit because the geography and population density supports it.\n\nCanada is an extremely large country, with an extremely low population density. It is not reasonable or sustainable to create an expansive public transit network. Canada is highly dependent on cars due to this factor. It is also ignorant to suggest most students live on campus, Brock University finds itself in a unique situation where it is the university that predominantly serves most of the Niagara Region and a large portion of the Hamilton region. The Niagara Region does not have an expansive transit network as it shares some of the aforementioned problems that Canada has broadly.\n\nFurthermore, public transit is quite unreliable, as transit does not run late at night. Students often-times like to spend nights at friends dorms who live on-campus or spend late nights in the library studying. Often past the times in which St. Catharines transit runs. The transit does not run because the number of people using transit between these hours is much too low to be sustainable.\n\nLastly, some people like the convenience and comfort of their own car. As someone who takes public transit to and from Toronto frequently, if the city wasn't so undrivable, I would much prefer to take my vehicle. I frequently run into people strung out on drugs in transport terminals, often using them in the terminals, and it genuinely feels like an unsafe and uncomfortable experience. I would also like to leave on my own schedule, rather than waiting for a TTC train, waiting for the delay to end inside a TTC station somewhere along the line, and then waiting at the GO station for another half an hour. When I want to leave, I like to be able to leave.\n\nIf you want the big-city transport go to a big-city. St. Catharines simply does not and could not have infrastructure to sensibly support a model like this.",
            "score": 1,
            "author": "the_panda0116",
            "replies": [
                {
                    "level": 1,
                    "comment": "look i’ve made 1000 different arguments in the comments about the very issues you’re saying that i fail to see. why do you think public transit sucks so bad and why do you feel like your car is more efficient? probably because all of southern ontarios infrastructure was designed around cars. cars do not belong in cities because they require a huge amount of space and less dense neighbours should have alternatives to car use. it’s just a horribly inefficient system. \ni probably would agree with you if i was still in high school because i had no concept of what a world without cars would look like. u can say canada is a big country and has tons of space which makes cars necessary, but the population density varies from place to place. southern ontario has a very high population density. \nyou also prove my point that most money goes into private car related infrastructure as you mention that buses don’t run late at night. obviously people are going to drive if a bus isn’t running like come on, think for a moment. bus and train infrastructure was defunded which has forced people to drive because trains barely ever run because there’s zero funding that goes towards it. \nand you talk about how bad driving in toronto is, maybe because it was a city designed for pedestrians and then it was turned into a car infested hellhole because of conservatives in the suburbs who wanted to drive into the city. now the place is a bunch of parking lots and space that only caters to one portion of the demographic. \nnotjustbikes was also born and raised in london ontario so he has first hand experience with the infrastructure and the flaws that come with it. he literally made a video on the evolution of toronto and how cars took over [link](https://youtu.be/KkO-DttA9ew). please broaden your “narrow-minded take” and think outside of car-centrism please",
                    "score": 2,
                    "author": "ProductEmbarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because you only chose to respond to about half of what I said, this is the last ounce of my time you're getting.\n\nNot everywhere can have a fucking bus at all times, it makes no sense to run a bus to Pelham at midnight.\n\nCars are 10x more convenient than public transit. No junkies, and freedom to leave at the exact moment I desire. \n\nSure it works for some large cities I.e. toronto, it does not work for 90% of the Niagara Region, making St. Catharines inaccessible by car, would block off the rest of those centre's who vastly prefer to travel by car because it is extremely practical. By and large Southern Ontario is made up of rural communities with the occasional city. We have sparse areas with high densities.\n\nAnd btw, if you're going to make this a political rant about Conservatives, at least do some fucking research. Conservatives just brought in a huge grant for transit within the greater golden horseshoe, and NRT is expanding because of this. They're also completing an Eglinton crosstown extension, building a whole new line in Toronto (the Ontario Line) building a new GO station in Hamilton, bringing all-day go to STC and NF (stations will reopen in the spring currently closed because they're also having the infrastructure upgraded) and they're also extending the subway network in Thornhill.\n\nOn the federal side Pierre Poilievre has been a huge advocate for high density housing in areas that already support transit infrastructure.\n\nSo yes I have done my research, maybe you should before screaming about politics on reddit.",
                            "score": 0,
                            "author": "the_panda0116",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ok pretty sure i addressed nearly all of your points and you honestly helped argued in my favour before. i may have been a little general about conservatives but i would love to see where you got your information from, sorry when i mentioned them once but you cant say this isnt a political issue as it historically has been with toronto. Just watch the NJB video i sent you before, it will be illuminating. also you seem to mainly rely on personal preference because you hate drug addicts and love the freedom of “cars.” oh hell ya i love getting stuck in traffic and having to work around rush hour but ya let’s just build [one more lane](https://environmentaldefence.ca/2020/09/15/why-building-more-highways-wont-make-your-commute-any-better/). i love having to pay for gas that can just get more expensive out of nowhere. i love relying on the kind hearts of mega corporations to have my best interests in mind. i love paying for insurance, and maintenance, and new tires and all that other stuff. it’s not about completely gutting car infrastructure, im saying there should be more than 1 option for people and it’s clear that cars are the priority while buses/public transit are viewed as some means to get poor people around. NJB has talked about how the netherlands has the best car based infrastructure as well as it forces drivers to pay attention while here, the roads are wide and are designed to make people feel as comfortable as possible. i’m sure you’ve been driving and have found yourself realizing “oh shit, im driving on autopilot” and that’s all because of road design. our infrastructure is from the 1960s, im just asking for some innovation im not trying to take away your precious car. car dependency creates ugly, isolated communities that give kids [asthma](https://e360.yale.edu/digest/vehicle-pollution-causes-4-million-new-child-asthma-cases-every-year). we are in the midst of a climate crisis and it might have something to do with forcing people to use a combustion engine to do the most basic things like go to work, buy groceries, go to a friends house, go out for food, go to school, go to the gym… anything. build the infrastructure (properly, not just a bike gutter next to a fast road), and people will use it.",
                                    "score": 2,
                                    "author": "ProductEmbarrassed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're not saying there should be more than one option. Your initial argument was against the size of the parking lot. Your argument is based on you not liking that option provided to other people. If you don't like paying for it, don't utilize it. Simple as that.\n\nSources:\n\nPierre high density near transit:\nhttps://storeys.com/pierre-poilievre-housing-plan-canada/\n\nGreater golden horseshoe:\nhttps://www.ontario.ca/page/connecting-ggh-transportation-plan-greater-golden-horseshoe\n\nSt. Catharines GO:\nhttps://www.metrolinx.com/en/news/expanded-service-on-go-and-up-express-%E2%80%93-including-niagara-falls-\n\nOntario Line:\nhttps://news.ontario.ca/en/release/1002490/ontario-takes-next-steps-in-building-signature-subway-line\n\nJust to name a few. Do some of your own research, you seem hellbent on proving one point without looking into any others if you honestly knew nothing about this.",
                                            "score": 2,
                                            "author": "the_panda0116",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "the size of the parking lot directly ties to my argument of car dependency because it illustrates the prioritization of private transit. you can get a lot of information when you analyze how space is used and i’m saying that in making a parking lot bigger than the school, the message is you better have a car and drive. the mandatory bus pass is a step in the right direction but as you mentioned before, they don’t run late at night and are pretty infrequent which tells me brock/st catharine’s isn’t doing nearly enough for people in the immediate area. also you’re right, i don’t like the option that’s provided because it only benefits those who drive and can afford a car and pollution impacts everyone. additionally, the albedo effect of the parking lot/surrounding roads directly contributes to climate change. a parking lot is necessary as i understand not everyone lives close to the school and canada was built around car dependency but that should not equate to a lot this huge. i truly believe that ugly public space negatively impacts peoples mental health and parking lots are sad, empty places. so are the roads that lead to them. also the whole “if you don’t like paying for it, don’t use it” argument is not effective because students are being coerced into driving as buses are inconsistent a lot of times, biking is essentially suicide, the roads are terribly unpleasant/ugly to walk along and the parking lot is huge. plus i’ve found the bus to be more convenient as i carpooled with a roommate the other day and it took her at least 5 minutes to find a parking spot which almost caused me to be late for class. i’ll look into those articles u sent though, thanks for sending them. i hope i don’t come off like i hate you either, i just think that the way we utilize space says a lot about what societal expectations are and that driving is directly correlated to so many issues we face in our daily lives. as a kid i never knew why i hated going out so much but i figure out it was because being trapped in a car felt like a major waste of time. i also had no autonomy as a child because nothing was near our house and my parents were always afraid i’d get hit by a car if i rode my bike anywhere. bikes paths and pleasant walking paths encourage exercise which can make a commute feel like less of waste of time and public transit can create a greater sense of community. just wanted to address the ripple effect of the parking lot here because it’s not just about the parking lot, it’s the message it sends. thanks for the discourse and for sending those links",
                                                    "score": 1,
                                                    "author": "ProductEmbarrassed"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}