{
    "id": "11asx19",
    "score": 5,
    "title": "Will I get in trouble for this??",
    "author": "mai1041",
    "date": 1677249529.0,
    "url": "https://www.reddit.com/r/brocku/comments/11asx19",
    "media_urls": [],
    "other_urls": [],
    "postText": "I submitted an essay on Monday for an english course, and I got 12% on my turnitin report which is the highest score ive ever gotten on an essay. I immediately started panicking and when I checked the report it highlight 3/4 sentences that were nearly identical to an online source Ive never seen before. (Also all the sentences marked come from the same source, so it makes it look even more suspicious)\n\nIs my prof going to think I plagiarized? I wrote the entire essay myself but it’s extremely weird that turnitin picked up these sentences as plagiarism. Help lol",
    "comments": [
        {
            "level": 0,
            "comment": "Bruh 12% is soft lol. I got 31% and nothing happened. It just depends on what the essay is on, if its on a book or a reasearch essy you’re likely gonna have a high %.",
            "score": 26,
            "author": "GroundbreakingFly771"
        },
        {
            "level": 0,
            "comment": "Pretty sure someone told me anything over 20% is a red flag so you should be okay with 12%. It’s nearly impossible to not have similar sentencing with another source on the internet which is one of the flaws with turnitin",
            "score": 6,
            "author": "kingofstorms_"
        },
        {
            "level": 0,
            "comment": "Bud, you’ll be fine, my bio labs have come back at 32% with no concerns what so ever. 12% won’t even be a ding on their radar.",
            "score": 3,
            "author": "GrantTheRant"
        },
        {
            "level": 0,
            "comment": "As long as you cited everything else correctly, this is likely a false positive or a coincidence that it happened to be somewhat similar.",
            "score": 3,
            "author": "CohnJena68"
        },
        {
            "level": 0,
            "comment": "I would definitely email your professor. Mention your situation, and ask what your next steps are. But take initiative, and that'll count for something.",
            "score": 2,
            "author": "MedioXrity"
        },
        {
            "level": 0,
            "comment": "Should be fine, profs usually allow 15-20 sometimes even more.",
            "score": 2,
            "author": "Mainlexinator"
        },
        {
            "level": 0,
            "comment": " If you cite it you’re chilling",
            "score": 2,
            "author": "Exciting_Profit766"
        },
        {
            "level": 0,
            "comment": "The type of essay you are writing will drastically influence the amount of overlap turnitin locates in your writing. For example, an argumentative essay should have largely original content as it is a position that you are making the case for given different evidence. Explanatory/exegetical essays will have much more overlap with other sources since you are merely repeating and clarifying what has already been said by others. The amount of direct quotations will also affect this too. \n\nThat being said, you probably have nothing to worry about. If they even decide to check you for academic misconduct (which is extremely unlikely) they will conduct an interview and ask you to explain things. As long as you can explain why you wrote things and give clarification on your writing to ensure that you understand the content enough to have written it yourself, you will be fine.",
            "score": 1,
            "author": "ohflow"
        },
        {
            "level": 0,
            "comment": "Nah you're good",
            "score": 1,
            "author": "daveferns"
        },
        {
            "level": 0,
            "comment": "Profs usually give some leeway when it comes to turnitin, especially lately. Turnitin has, at times, started flagging people for page numbers and commas, which obviously drastically increases plagiarized % scores. I'm sure you'll be completely fine.\n\nIf you're really worried about it though, email your professor and explain the situation. As long as you cited everything else correctly, I'm sure they'll be understanding.",
            "score": 1,
            "author": "MedicalGreek"
        },
        {
            "level": 0,
            "comment": "unless it’s dr. volk you’ll be fine. he reported me for 10% report😐",
            "score": 1,
            "author": "Cool-Magician466",
            "replies": [
                {
                    "level": 1,
                    "comment": "i have dr. volk should i try to keep it as low as possible when submitting",
                    "score": 1,
                    "author": "Glad-Parking4427",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes. so many people i know got in trouble with him in second year. definitely the worst prof i had when it comes to that",
                            "score": 1,
                            "author": "Cool-Magician466"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve gotten 35% on turnitin. Your paper is being measured against other classmates and articles. 12% is nothing.",
            "score": 1,
            "author": "ILookandSmellGood"
        },
        {
            "level": 0,
            "comment": "12% is fine",
            "score": 1,
            "author": "grehvinifawcid"
        },
        {
            "level": 0,
            "comment": "That’s not a lot you’re good :)",
            "score": 1,
            "author": "Feisty-Guitar8047"
        }
    ]
}