{
    "id": "11uxtkv",
    "score": 1,
    "title": "3rd year co-op BACC spring class",
    "author": "BigPrint5091",
    "date": 1679168006.0,
    "url": "https://www.reddit.com/r/brocku/comments/11uxtkv",
    "media_urls": [],
    "other_urls": [],
    "postText": "would you say the 3rd year spring class is easier than the 2nd year if so by how much 4th years?",
    "comments": [
        {
            "level": 0,
            "comment": "Third and fourth year courses make u wanna cry. I was in coop and I had to drop it. Those of u who stayed through it I commend you🫡",
            "score": 2,
            "author": "NarutoUzamaki45"
        },
        {
            "level": 0,
            "comment": "Third year spring was probably the toughest semester. These marks matter the most if you are going into the MAcc program, and you need all of them for CPA. So in short you need 60% for all 4 major courses that are done in 8 weeks. Get ready for a midterm or two a week for the middle 4 weeks and then 4 exams during the final week. While you can do well in these pretty easily, you just need to put in more effort than the first two years. A lot of work and a lot of assignments but manageable nonetheless. \n\nIt is considerably harder than second year I maybe did like an additional 2 hours a week in second year on top of class compared to like 10/20 hours more a week.",
            "score": 1,
            "author": "bolwlywlywly"
        },
        {
            "level": 0,
            "comment": "A lot of ppl told me marks dont matter, experience does, but at the end of the day you have to choose whether u want shitty grades (potentially failing) plus co-op OR u want good grades and no co-op. Thats how I thought abt it when I made the decision to drop coop bc u do need high marks for MAcc if ur leaning in that direction. Obviously everyone is different, some are able to handle more than others but it ultimately depends on you. I personally didn’t think the stress was worth it and im glad I got out of it. I’m 4th yr BAcc btw",
            "score": 1,
            "author": "NarutoUzamaki45"
        },
        {
            "level": 0,
            "comment": "I wouldn't say that the 3rd year spring semester is noticeably harder than 2nd year spring in my opinion, but the toughest part for me at least was going from a 8 month work term to school on a very very fast turnaround. There was definitely an adjustment period for me.",
            "score": 1,
            "author": "the_hume_3"
        }
    ]
}