{
    "id": "122qofj",
    "score": 17,
    "title": "Is anyone in COMM 3P26? with greg gillespie. Please tell me i’m not the only one who think he’s an awful marker and overall prof",
    "author": "[deleted]",
    "date": 1679846294.0,
    "url": "https://www.reddit.com/r/brocku/comments/122qofj",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hi, alumni here. This is a throwaway account, just for starters, if you're curious about my lack of post history. I don't really use reddit anymore, but a peer brought this thread to my attention; I'll take any opportunity to share when it comes to Greg, because his behaviour is downright insulting from an academic standpoint. The reviews on RateMyProf are accurate to a T (except for the singular review claiming him to be a saint, which I suspect to be written by him on an alt account), but I highly suspect that there are many more stories of his torment left untold.\n\nGreg Gillespie is likely one of the most widely loathed professors at Brock, and would not have a job if not for tenure. He is unprofessional, unethical, discriminatory, and delights in inflicting cruelty upon students. He doesn't follow his own rubrics, even with how sparse they are, and rarely reads the content of submitted essays. When he does, it is only to belittle the author. It is an unspoken rule amongst staff and prior students alike in my department to heavily warn away anyone who expresses interest in his courses. As people have wizened to his wicked ways over the years, he's had his courses removed from my department's list of suggestions for electives.\n\nThere has been an ongoing case for several years against him through OMBUDS. Much of this is due to his lack of adherence to any sort of educational standards, though the case I heard of was much more dire. Until recently in his course on tabletop games, he would fail students who did not present *unique* receipts of purchase for the two book reviews that made up 80% of the course mark. That would be noble, **if they weren't his books, being sold through a site that he makes maximal profit off of.** It's a half-step away from extortion. After being pressed by OMBUDS (but not forced, as OMBUDS lacks that power), he slyly changed it into a *suggestion*.\n\nIf you're up for it, I heavily suggest getting in touch with OMBUDS to continue providing a voice of student discontent. There's only so much they can do, and unfortunately tuition will continue to be siphoned into his ill-deserving pocket, but one can dream that they might move him to a position in which he can't mentally and emotionally abuse university students ever again.",
            "score": 10,
            "author": "DesperateGremlin",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s crazy how this guy has been getting away with this.this semester I took the course 3p26 and I had to drop the course because of a technical issue that happened and he didn’t want to accept my midterm which was worth 30%. I took 2p20 during covid which was also offered by him and I failed the course because of how hard he marks.Anyway back to the main point ,I had to discuss with my department and with the ombudsman and I was able to drop the course and my refund is still processing.I also told them they need to evaluate students experience taking his courses and also get back with what is going to be done because this is actually abuse.,for sure they are going to do nothing about it. I just need to know whether there’s an actual authority or an office at brock that can legit hear students out because how he is still teaching is beyond me",
                    "score": 3,
                    "author": "Conscious_Page4746"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't need to tell me twice. He's incredibly vitriolic and mean, and doesn't care about anyone but himself.",
            "score": 6,
            "author": "TheSalacom"
        },
        {
            "level": 0,
            "comment": "If you check out his rate my prof pages you’ll see you’re not the only one.",
            "score": 3,
            "author": "kingofstorms_",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s fact he teaches cool sounding courses but ruins it with his teaching",
                    "score": 3,
                    "author": "kingofstorms_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yup. I had him for 2q91 instead but he was still as bad there. Awful marker and doesn’t give constructive criticism and also never gave us a rubric for what he wanted",
            "score": 3,
            "author": "LeekyLysol"
        },
        {
            "level": 0,
            "comment": "Funny thing is Brock won’t do anything about it even though you complain which is sad because a lot of students will fall into the trap cuz of the types of courses he teaches",
            "score": 3,
            "author": "Conscious_Page4746"
        },
        {
            "level": 0,
            "comment": "I dropped his class after I got my marks back because I knew I would be miserable for the rest of the semester lol",
            "score": 2,
            "author": "Lavyrinth"
        },
        {
            "level": 0,
            "comment": "Not in it, but had him before. And yes, many agree. Even faculty.",
            "score": 2,
            "author": "grehvinifawcid"
        }
    ]
}