{
    "id": "124w9s5",
    "score": 3,
    "title": "Nursing in Brock Questions",
    "author": "Blafee",
    "date": 1680025013.0,
    "url": "https://www.reddit.com/r/brocku/comments/124w9s5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a high school student hoping to get into the nursing undergrad program. My average is currently a 91 highest being a 96 and lowest being a 90. In horrible at math though, so I was wondering if they preferred Advanced functions over Data management for a grade 12 Uni math. Another question I have is: How many courses do you have to take on top of your major? Esp first year",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! I'm not in nursing but I took a look at the website and it seems like you can take either math. I'd recommend taking the one you think you will do better in. For the courses, (you can see this yourself by googling Brock 2023 undergraduate calendar) I'm not sure what you mean by on top of the major, but you do not get any electives in first year, and you would take a full course load of 5 classes a semester.",
            "score": 3,
            "author": "_daisychain_",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok tyty",
                    "score": 1,
                    "author": "Blafee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nursing student here! I preferred data over advanced functions and I haven’t had any troubles. First year you get no electives but on top of major classes (communication, health promotion, health assessment and hospitalization) you also take anatomy, psychology and biology 1 and 2. Stats is useful for bio. First semester you will have 5 classes and second you’ll have 4 (psyc runs all year)",
            "score": 3,
            "author": "Emotional-Bad-4822",
            "replies": [
                {
                    "level": 1,
                    "comment": "tyty",
                    "score": 1,
                    "author": "Blafee"
                },
                {
                    "level": 1,
                    "comment": "I might be accepting Brock nursing. How do you like the program? What other school did you consider? Are you glad with you decision? how is student life?",
                    "score": 1,
                    "author": "Grand-Shirt-9018"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, nursing major here! I personally took advanced functions, but any math credit was fine. As long as it's an U course.  In your first year of nursing, you have to take 8 courses all together. But they tell you the exact ones you have to take, unfortunately there is no option on what to take. You have to take psych, biology 1P91 and 1P92, kinesiology, plus your nursing courses. All the courses you have to take are in the nursing 2023-2024 course calendar. The 8 courses make up 5 credits since 2 are counted as full credits.",
            "score": 2,
            "author": "Alone-Baker3253",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok thanks this helped a lottt 🫡🫡",
                    "score": 1,
                    "author": "Blafee"
                }
            ]
        }
    ]
}