{
    "id": "129r8hz",
    "score": 1,
    "title": "What is the German program like?",
    "author": "worldscenariania",
    "date": 1680455133.0,
    "url": "https://www.reddit.com/r/brocku/comments/129r8hz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Asking for a friend. This is a discipline he is considering studying. As of now, he is a high school student set to graduate this following June with a focus on majoring in history as his postsecondary goal.",
    "comments": [
        {
            "level": 0,
            "comment": "The German minor only has one professor (or sometimes two if Professor Wolfe is teaching) but she is very good so you’re friend can definitely pursue a minor in German",
            "score": 1,
            "author": "kingofstorms_"
        },
        {
            "level": 0,
            "comment": "Side note: I majored in history. I'm not saying your friend shouldn't major in it (I loved the program and I learned a lot), but he really needs to think about what the end goal is (what kind of work, pay, career trajectory, etc.). It can be a challenging area to find work in. I completed a BA in history from Brock. Then a diploma in nursing. Followed by one year of post-graduate studies in cultural heritage conservation. I am currently finishing up a certificate in occupational health, safety and environmental system. I had no luck finding well-paying, permanent, long-term jobs in the history field. I spent 5 years as a nurse before becoming a health and safety technical writer, and then landing my current job as a training advisor in the mining industry (which I love!). My point - have your friend consider where he sees himself in 5-10 years and what he hopes to do for a living, because good jobs related to history can be challenging to come by. I know some people who have done really well - keeping in mind that it took a good decade of part-time, seasonal jobs to finally land something permanent and/or well-paying. All the best to your friend!",
            "score": 1,
            "author": "Pocket_Hedgehog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because you mention it, he seeks to major in this field to fulfill the undergrad prerequisite into Teachers College. From what I am aware, within the next few years, there is going to be an influx of teachers retiring. This is a good opportunity for him and I hope things go well for him in the near future.",
                    "score": 1,
                    "author": "worldscenariania"
                }
            ]
        }
    ]
}