{
    "id": "134x0zd",
    "score": 5,
    "title": "Diversity at brock??",
    "author": "Sweaty_Specific9015",
    "date": 1682965248.0,
    "url": "https://www.reddit.com/r/brocku/comments/134x0zd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I’m a grade 12 student who grew up in the GTA and have always been surrounded by different cultures and types of people. It is very likely that I’m going to attend brock for con Ed but I’ve heard it’s extremely white- is this true? For people who are currently attending, is there a good amount of diversity?",
    "comments": [
        {
            "level": 0,
            "comment": "i see plenty of diversity on campus tbh, im an arab student myself",
            "score": 9,
            "author": "Total-Opportunity-71"
        },
        {
            "level": 0,
            "comment": "Current Con-Ed student also from GTA and Filipino. I grew up the same way and I gotta say yes, it is mainly white. There have been a lot of instances where I would be the only or one of the very few POC in a classroom. The campus in general is still heavily white but there is some noticeable diversity. Everyone is pretty considerate though so 🤷🏻‍♀️",
            "score": 7,
            "author": "Fluffy68plus1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Con-Ed program is good though! So I wouldn't let it stop you if you're really passionate about teaching 😁",
                    "score": 2,
                    "author": "Fluffy68plus1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much this really helps!!!!",
                            "score": 2,
                            "author": "Sweaty_Specific9015"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm also from the GTA, and I can confidently say that St. Catharines is infinitely less diverse than the GTA, no competition.",
            "score": 7,
            "author": "MedioXrity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Has that at all affected your experience there?",
                    "score": 1,
                    "author": "Sweaty_Specific9015",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fewer good food options.",
                            "score": 4,
                            "author": "Comfortable-Expert-5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "basically just white ppl",
            "score": 3,
            "author": "YoursTrulyHO"
        },
        {
            "level": 0,
            "comment": "Can't speak to Con Ed, but Goodman (Brock's business school) is diverse. Campus in general seems diverse to me, but individual programs may be different.",
            "score": 2,
            "author": "somekyle"
        },
        {
            "level": 0,
            "comment": "Trust me fam, you’re good but yah I agree the diversity at Brock is mostly Caucasian. However, there are culture clubs where you can find the same people as you. Also if you sit in the couches in the library beside the window you’ll pretty much see a blend of ethnicity",
            "score": 2,
            "author": "jaydelacruzzz"
        },
        {
            "level": 0,
            "comment": "Outside of the international students its all white lol especially programs like con ed. Im brown and grew up playing hockey and went to Catholic high school so i was used to being around mainly white people. But if youre used to being in diverse areas, get ready for a culture shock.",
            "score": 2,
            "author": "GroundbreakingFly771"
        },
        {
            "level": 0,
            "comment": "Outside of the international students its all white lol especially programs like con ed. Im brown and grew up playing hockey and went to Catholic high school so i was used to being around mainly white people. But if youre used to being in diverse areas, get ready for a culture shock.",
            "score": 0,
            "author": "GroundbreakingFly771"
        },
        {
            "level": 0,
            "comment": "Omg I wanted to attend their too for concurrent Ed, and I’m a little scared cause I’ve heard the same thing. Im a POC student as a Muslim Pakistani.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Im a business kid so idk about Con-Ed. The business kids are white-er but its by no means dominated by white people. To be fair though, I'm white.",
            "score": 1,
            "author": "WhatsMyAccordion"
        },
        {
            "level": 0,
            "comment": "I feel it's pretty diverse. But I agree maybe not as much as the GTA.",
            "score": 1,
            "author": "grehvinifawcid"
        },
        {
            "level": 0,
            "comment": "It’s diverse. Lots of local students from Niagara region so yes many Caucasian people too. But also what seems like half of Brampton ends up in Brock’s first year accounting program too lol. This is what it was like 7 years ago when I started there. I’ve been back and it’s even more diverse. There were always many Asian international students, and now it includes African and Indian students too - although the international groups usually keep in their circles. Niagara region itself has increased in diversity. I remember going to the hospital on fourth ave in second year. I felt weird being the only brown guy in the emerg. But now it’s mixed-not to gta levels but not where you’re the only one lol. Never had outward issues with racism either. Diversity would be more of an “issue” at schools up north than any in southern Ontario. Niagara is pretty local relative to the gta with many people moving there in the last 10 years from the gta",
            "score": 1,
            "author": "Immediate_Turnover96"
        },
        {
            "level": 0,
            "comment": "Brock is pretty diverse. Con-Ed is pretty White.",
            "score": 1,
            "author": "jpears86"
        },
        {
            "level": 0,
            "comment": "Majority are white, true, but also quite diverse, as an international student from China I would say I had good experiences there.",
            "score": 1,
            "author": "Mphite"
        },
        {
            "level": 0,
            "comment": "Dis guy said extremely white I’m fucking weak 😭😭😭😭😭😭",
            "score": 1,
            "author": "boodlum-foodlum"
        },
        {
            "level": 0,
            "comment": "Would not recommend brock tbh, probably best to go elsewhere",
            "score": -3,
            "author": "johnhoj189",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you mean in terms of diversity or the school in general?",
                    "score": 1,
                    "author": "Sweaty_Specific9015",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "School in general",
                            "score": -3,
                            "author": "johnhoj189"
                        }
                    ]
                }
            ]
        }
    ]
}