{
    "id": "140o29w",
    "score": 3,
    "title": "Hi! Game Programming Students Here?",
    "author": "Mangoru123",
    "date": 1685908027.0,
    "url": "https://www.reddit.com/r/brocku/comments/140o29w",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently enrolled in the BrockU Game Programming program and I thought it would be great to connect with other students who are either already in the program or planning to join in the fall. I tried some of the Discord servers but couldn't find anyone.\n\nIf you're studying or have studied game programming at BrockU, I'd love to hear about your experiences, tips, and advice regarding the program. Or if you'd like to connect and be friends that works for me too. (that way I won't be by myself the first day)  \nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "So you are gonna be a freshman in Brock in Sept. this year, right?",
            "score": 1,
            "author": "BobZ-2235155833",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yessir",
                    "score": 1,
                    "author": "Mangoru123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why u choose Brock? I think there is a lot of better universities to study programming, like Waterloo, u know",
                            "score": 1,
                            "author": "BobZ-2235155833",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well for one Waterloo was hard to get into for comp sci and brock and otech were the only unis that offered game programming. I know that comp sci is more practical as a degree but i heard that in the game program you get to make alot of long term projects which may look good on a portfolio as a programmer",
                                    "score": 3,
                                    "author": "Mangoru123"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey! im going into game design in september:)",
            "score": 1,
            "author": "swagycat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wsup",
                    "score": 1,
                    "author": "Mangoru123"
                }
            ]
        }
    ]
}