{
    "id": "147zyrq",
    "score": 2,
    "title": "Second Year Course Selection",
    "author": "annonymous-22",
    "date": 1686610193.0,
    "url": "https://www.reddit.com/r/brocku/comments/147zyrq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a Psych Major and have planned on taking these courses for the fall:\n\nPsyc 2F23 \nPsyc 2P01 \nPsyc 2P20 \nPsyc 2P25 \nPsyc 2P12 \nPsyc 2P90 \nCHYS 2P10\n\nIf anybody has taken any of these courses please let me know if they were hard/easy and any other info, also please leave suggestions of second year psych and elective courses to take\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "You can’t take CHYS2p10 and psyc2p12 together. They’re equivalent courses \n\nAlso are you allowed that many courses? Usually I see limits of 6, not 7 \n\nI’m not a math girl and I hated 2f23, but I landed a 70 in it. Tim’s a good prof if he’s doing it this year. Chys was good - one debate presentation, I think one essay, and the rest were bite sized assignments or participation marks. Very easy. The others I haven’t taken.\n\nI have heard 2p25 is ridiculously hard though. Interesting content but the prof makes the exams very tricky.\n\nIf 2p90 is with Scott, you’ll love it. He’s also a great prof.",
            "score": 1,
            "author": "StephKrav",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not a math girl at all either, but it says under my prerequisites “PSYC 2F23 &amp; 2P01” so it seems like I need to take it :/",
                    "score": 1,
                    "author": "annonymous-22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, that seems right for a psyc major! Make sure you go to all the tutorials. They really do help.",
                            "score": 1,
                            "author": "StephKrav"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "2F23 wasn't too bad, depends whether you can do math lol. Tim is an amazing prof tho! Go to tutorials, they tell you what will be on tests, and walk you through different types of questions\n\n2P01 was pretty easy, just make sure you talk lots in seminar and start looking for volunteer work early on\n\n2P20 was decent, very brain based if that is something you enjoy. Labs were interesting and fun, assignment answers were practically handed to you\n\n2P25 was stupid difficult, Prof Ashton makes his exams ridiculously hard for no reason\n\n2P90 was one of my favs, Scott is the best. No big tests or exams, just a few papers and biweekly quizzes. He gives automatic extensions, but every assignment is worth a lot, so be careful\n\nIf you're interested in mental health related topics, I recommend PSYC 2P15, loved that course and it wasn't too difficult. Depends on what you plan on taking later on/your strengths and interests.",
            "score": 1,
            "author": "Lemonloaf55",
            "replies": [
                {
                    "level": 1,
                    "comment": "for 2P01, are you just suggesting I look for volunteer work or is this a mandatory thing I have to be doing for this class? \n\nThank you so much for your opinions, they really are a big help!",
                    "score": 1,
                    "author": "annonymous-22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I second 2p15. Amazing class!",
                            "score": 2,
                            "author": "StephKrav"
                        },
                        {
                            "level": 2,
                            "comment": "I should've clarified lol. As of last year, part of the requirements for 2P01 is 40 hours of volunteer work before the end of the year\n\nBrock hosts a volunteer fair early on in the year, I'd recommend looking there. BBBS is also great, they give a lot of hours.\n\nGood luck with year 2!",
                            "score": 1,
                            "author": "Lemonloaf55",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is BBBS? Also, am I able to look for volunteer hours somewhere online from now? \n\nAgain, thank you for your help!",
                                    "score": 1,
                                    "author": "annonymous-22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "BBBS is just Big Brothers Big Sisters, and they take lots of uni volunteers\n\nAnd I’m not too sure if you need to start looking rn, I just suggest getting the volunteering set up sooner rather than later, waiting till April won’t be fun lol",
                                            "score": 1,
                                            "author": "Lemonloaf55"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "2p20 was okay as long as you have a good TA. the prof is nice and accommodating. midterms and exams are pretty specific and lectures can be boring at times. personally i wouldn’t take it but do as you will with this info\n\n2f23 is all statistics — if you took data management in hs you’ll be fine for the first half. Reno is my prof and i think he’s one of the best in the psych department. very approachable and fair. you have to stay on top of things in order to do well, you cannot let yourself fall behind in this course\n\n2p25 was okay. his midterms were tricky. if you don’t wanna tank your average, i’d suggest taking 2p30 instead. best of luck!",
            "score": 1,
            "author": "Empty_Pin4994"
        }
    ]
}