{
    "id": "ngc0oj",
    "score": 23,
    "title": "Fall 2021 - Online classes &amp; On Campus",
    "author": "RagingAcid",
    "date": 1621445823.0,
    "url": "https://www.reddit.com/r/brocku/comments/ngc0oj",
    "media_urls": [
        "https://brocku.ca/fall/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "https://brocku.ca/fall/guide/",
            "score": 1,
            "author": "dkbki"
        },
        {
            "level": 0,
            "comment": "The timetable (which will be released soon) reflects A.\n\nThe difference this time around is that we have plans in place to move classes (especially big classes) online if we need to.\n\nBasically ‘plan for the best, but prepare for the worst’ as they say.",
            "score": 13,
            "author": "BrockuStaff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting...but what happens if part way through the semester everyone has to go back online and are trapped paying rent? I get it’s technically not the university’s problem but is this being considered? This could be a big unnecessary financial strain for some students.",
                    "score": 7,
                    "author": "ShwamyASC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think this is definitely a consideration, but I would also say that student representation has been advocating for a return to as normal as possible activities. Students really want and need to be back on campus for a variety of reasons (research, social, financial, etc.) and while there are very legitimate concerns, we need to have a preliminary version of the timetable up so that people can plan their courses and find leases if they need to.\n\nIt’s a very cloudy crystal ball right now, and I think everyone is trying to strike the right balance. Vaccinations look to be ramping up, which is helping everyone’s confidence level as well. \n\nPlease keep in mind, the timetable is Fall *and* Winter. Even if we are forced to reduce campus activities in the fall, the hope would be to return in January. Ideally that doesn’t leave too many people on the hook for leases they don’t need.\n\nFor Residence, the university did grant pro-rated refunds for everyone living on campus in 2020 who had to move out early. I think that was the right thing to do, and I doubt most landlords did that. \n\nI’ve attached an image that the federal government shared. I’m sure our planning committees have way more information than this, but this does a good job showing where we hope to be in fall.  https://i.imgur.com/oZ8AT1C.jpg",
                            "score": 5,
                            "author": "BrockuStaff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 2,
                                    "author": "ShwamyASC"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Ottawa and *really* can't afford to move back to St. Kitts if in-person isn't guaranteed (which I know is difficult/impossible)",
            "score": 10,
            "author": "HolyHipHop_TJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s going to depend on how picky you are about living spaces. You will be able to find something if you wait till July but it may not be easy to find a great place.\n\nThe only reason to look/sign earlier is that you will have more options and more room to negotiate as you’re not desperate.",
                            "score": 2,
                            "author": "This-Minimum-6616"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like scenario B is the most likely for the fall imo.",
            "score": 2,
            "author": "ShwamyASC",
            "replies": [
                {
                    "level": 1,
                    "comment": "As hopeful as I am for scenario A, I feel like B is the most likely.",
                    "score": 5,
                    "author": "slimyfishy12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think worst case scenario is they go with A but not enough students are vaccinated, cases increase and we go to scenario C.",
                            "score": 1,
                            "author": "ShwamyASC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh absolutely. The reason I'm hopeful for A is because I really struggled with being entirely online this year, but even if we get B I should have at least 1 class in person since I'm planning on taking 4X00+ courses this year",
                                    "score": 3,
                                    "author": "slimyfishy12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It should be hybrid for all classes. Half of the week’s lectures should be moved online. In-person exams should be no problem as long as there is enough distancing.",
                                            "score": 4,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}