{
    "id": "xolvhv",
    "score": 2,
    "title": "FNCE 2P91 Hoover midterms and finals",
    "author": "_BigE57_",
    "date": 1664204737.0,
    "url": "https://www.reddit.com/r/brocku/comments/xolvhv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, this might be a bit too early to ask, but how are Hoover's midterms and finals for FNCE 2P91? I have him right now and I want to know how I can better prepare for his exams. Also, are his exams all word problems based, or are there some MC questions as well?",
    "comments": [
        {
            "level": 0,
            "comment": "I had his in-person class last year, which used 'Connect' online portal for tests and the exam. I did way better in his class than I expected. Like another mentioned, just be a pro at his example questions, and suggested study work. His questions followed those for my class.\n\nAlso he was like, undergrad prof of the year at Goodman last year, he's a great prof, very helpful. Just bring any troubles you have with questions to him, don't leave studying to the last minute where you won't have time to seek his help.",
            "score": 4,
            "author": "somekyle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice! I'm glad to hear that his test format is similar to the in class questions.",
                    "score": 2,
                    "author": "_BigE57_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t have any answers to your questions but want to point out that I have that class with that teacher as an asych course right now and we just had a test. Each calc question was worth 10% which annoyed me as it wasn’t multiple choice.",
            "score": 3,
            "author": "White-Tupac"
        },
        {
            "level": 0,
            "comment": "His class notes and the problems in there are the exact same as the exams. Know how to do every problem on the in class notes and you’ll do great",
            "score": 3,
            "author": "NiceGuy531",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "_BigE57_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had hoover last semester for FNCE 2p91. The best way to prepare for quizzes is to focus on example questions and try understanding them since most of his exam questions were very similar to example questions. I had done this course and exams online so I am not sure what it’s going to be like in person. Overall he is a great prof and was very generous in allocating part marks.",
            "score": 1,
            "author": "usmwaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wouldn't say he's generous with part marks part lol. Had him last Fall and it was either all or nothing with no exceptions n a friend who had him last winter said it was the same thing. And on top of that every short answer was worth like 3-5 marks out of 35",
                    "score": 4,
                    "author": "mo20ik"
                }
            ]
        }
    ]
}