{
    "id": "yhuo62",
    "score": 6,
    "title": "Brock bussing and rideshares gone downhill",
    "author": "rs226",
    "date": 1667174403.0,
    "url": "https://www.reddit.com/r/brocku/comments/yhuo62",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is it just or has it been extremely hard finding ways to commute to Brock from Brampton/Mississauga? There used to be a 1h 30ish min Megabus that went from Square One to Brock but that got cancelled and it was replaced with a Go Bus that goes from Brock to Hamilton go, and now it takes a few bus transfers and close to 3 hours to get to Square One now. On top of that, the Brockride share groups have gone completely downhill! it went from being a group for students charging 10-15$ for ride shares to random people (not brock students) trying to profit off of students, people trying to scam and prey on students and those people now try to charge 30-50$ per seat for rides, all of that makes it super difficult to find ways to commute to Brock!\n\nI wish Brock would do something to bring back a bus similar to the megabus that used to be here before covid :(",
    "comments": [
        {
            "level": 0,
            "comment": "Im not sure if this will help, but if you do have a car, instead of driving all the way to Brock, you can drive to Aldershot GO Station, (which is only 25 minutes from Square One) and you can park your car there and take the 18K directly to Brock Uni. It does suck not being able to take a bus directly from Brampton to Brock but I think taking the direct go bus from Aldershot GO is the next best thing.",
            "score": 4,
            "author": "yayahco",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! It totally slipped my mind that I could take the Aldershot Go bus straight to Brock!",
                    "score": 3,
                    "author": "rs226"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think commuting from Brampton to Brock should even be a thing.  1.5h drive at the best of times.",
            "score": 8,
            "author": "Mysterious-Salary380"
        },
        {
            "level": 0,
            "comment": "It's really hard from mississauga to brock uni as I have been finding since I started but still didn't got anything",
            "score": 3,
            "author": "Emotional_Fox1189"
        },
        {
            "level": 0,
            "comment": "I agree",
            "score": 3,
            "author": "Shawn13337"
        },
        {
            "level": 0,
            "comment": "I commute from Brampton. Tuesday’s, Thursday’s and fridays. Shoot me a message and we can talk",
            "score": 3,
            "author": "Resident_Mine_3322"
        },
        {
            "level": 0,
            "comment": "30-50 bucks isn't that unreasonable for going 99km. Unless you're commuting daily (which isn't a great idea) it is what it is... There's people that commute home on weekends much farther than Brampton and it's a pain. But, you chose to go to uni 100km from home.",
            "score": 5,
            "author": "tyrnvalo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The way I see it, and the way I've noticed it going since I've been at Brock (since 2017) ride shares are usually students who are already going home or to brock, and its more of a \"since I'm going that way already, I can take you with me if you pitch in for gas\" so up until this year majority of people I've taken ride shares have only ever asked for 10-15$. And yes with increasing gas prices the cost did go up, but now brock students who offer ride shares are asking for 15-20$ in my experience, and I've noticed that its non-Brock students who charge more, and its justifiable for them because they often are going out of the way to take people back and forth, but the purpose of ride shares is brock students helping other brock students out! But also this has happened because the ride-share group became public this year, allowing anyone to join, so it's not just brock students in those groups anymore. It now includes people who are trying to make profits. \n\nI also don't commute daily, but it's the odd weekend or weekday I need to go back home or return to brock, and it's very difficult to find rides those days, so I've been driving.  I've encountered a conflict with ride-shares and bussing this year that I've never had to deal with before. You are right commuting has turned into a huge pain this year! I've been able to rely on the mega bus that went from Square one to BrockU",
                    "score": 2,
                    "author": "rs226"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel you. I was commuting all last year and got massively ripped off. $20-35. Only found a few decent people this year.",
            "score": 2,
            "author": "benchwarmer_guy"
        },
        {
            "level": 0,
            "comment": "That’s too bad, but not a surprising situation as so few people need such a service, not enough demand to support a healthy business.",
            "score": 1,
            "author": "somekyle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve always thought a bus from atleast square one would be super convenient for a lot of people, i remember the mega buss that went from BROCK to square one would often be completely full!",
                    "score": 2,
                    "author": "rs226"
                },
                {
                    "level": 1,
                    "comment": "there's actually a fair bit of demand. from brock students, and people who just need to commute. the bus going from Fairview mall to Burlington (connecting to mississauga/brampton) is usually full 2-3 times in a row in the afternoon-evening. Lots of people go Toronto as well.",
                    "score": 2,
                    "author": "benchwarmer_guy"
                }
            ]
        }
    ]
}