{
    "id": "zqv0td",
    "score": 3,
    "title": "HLSC courses available in Spring/Summer term",
    "author": "simmy_sandhu",
    "date": 1671559228.0,
    "url": "https://www.reddit.com/r/brocku/comments/zqv0td",
    "media_urls": [],
    "other_urls": [],
    "postText": "Did anyone know what hlsc courses are available to take during spring/summer ?\nDid anyone took hlsc 4p50, 4p59 and 3q97 in summer?",
    "comments": [
        {
            "level": 0,
            "comment": "4P99 is usually held and is a week long vs the regular 12 weeks (1 semester)",
            "score": 1,
            "author": "itsmarq",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you taken it in 1 week before? If so, how was the format &amp; everything? Was it overwhelming or did they make accommodations?",
                    "score": 1,
                    "author": "Confident-Zone-2657",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did the 1 week version of 4P99 and I thought it was really good. I've heard some horror stories from my friends who took the regular 12-week term offering so I highly suggest taking the spring week long one. \n\nI took it online so it might be different if it's in person but there's an assignment due each evening (very basic just to prove you listened to lecture) I think a couple quizzes, and a final paper due 1 week after the course ends. \n\nI can't remember any specifics about Mark breakdown or anything but it was honestly a really easy course so I'd recommend it for sure.",
                            "score": 1,
                            "author": "MedicalGreek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks!! Does this apply to any other courses for 3rd and 4th year? I regret not taking biostats in the summer bc it was horrible during the year lol",
                                    "score": 1,
                                    "author": "Confident-Zone-2657",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The only other upper year course I took in spring/summer was HLSC 4P50, I also found it very easy in the summer, if I remember correctly it was a month long between July and August! \n\nI'm not sure what it was like in the regular school term so I can't say if it was any harder, but the summer offering was good! Once again it was a few easy quizzes and assignments throughout the month and a final paper!",
                                            "score": 2,
                                            "author": "MedicalGreek"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s usually HLSC 2P07, 2P27, 2P50, 3P07, 3P19, 4P50, and 4P99 are usually guaranteed to be offered at least since I’ve been at Brock. And then they’ll also throw in some other electives too like 4P59, etc.",
            "score": 1,
            "author": "kingofstorms_"
        }
    ]
}