{
    "id": "130aunw",
    "score": 22,
    "title": "Too late to make friends?",
    "author": "Expert-Holiday950",
    "date": 1682572968.0,
    "url": "https://www.reddit.com/r/Anu/comments/130aunw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Feel kind of ridiculous posting this but I’ve just been feeling so down about it. Transferred to B&amp;G from off campus this semester and I just feel so lonely. I’ve talked to people here and there but we’re in week 8 now and I’d say I literally have 0 friends at this university. Just feeling lost and wondering if anyone has any advice? It’s at a point I’m considering just moving back home and going to a uni there.",
    "comments": [
        {
            "level": 0,
            "comment": "As cliche as it says, it really can be worth forcing yourself to go to campus events sometimes.  The discord is also really good if you're not great at socials, as the platform tends to attract us types",
            "score": 13,
            "author": "Thomas_633_Mk2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where can I find this discord server?",
                    "score": 3,
                    "author": "wot_im_mad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://discord.gg/4fsfKuve",
                            "score": 5,
                            "author": "Thomas_633_Mk2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude I’m at bng n in the same situation - dm if ur down to hang out sometime!",
            "score": 2,
            "author": "Interesting-Soil-443"
        },
        {
            "level": 0,
            "comment": "I can relate. If you are up to it, we can meet for coffee, take a walk around campus sometime :) DM me if you'd like!",
            "score": 2,
            "author": "Blu8674"
        },
        {
            "level": 0,
            "comment": "Go to parties (either held by people on accom. or interhall organised events). Also join a few clubs/societies and turn up to events and/or gatherings.",
            "score": 1,
            "author": "powderedsnow88"
        },
        {
            "level": 0,
            "comment": "Reload Bar &amp; Games in civic has monthly Social Deception  and UNO events on weds and thurs nights that are great for meeting new people",
            "score": 1,
            "author": "Junior_Historian_891"
        },
        {
            "level": 0,
            "comment": "I thought B&amp;G was really well socially connected",
            "score": 1,
            "author": "Visasisaboi"
        },
        {
            "level": 0,
            "comment": "From personal experience I can tell you B and G is a super friendly place. Go and talk to the co President Will. He will be friendly and introduce you to other people. Also talk to your SR. I know them all this year - they’re all amazing!",
            "score": 1,
            "author": "HappytobeRidden80"
        }
    ]
}