{
    "id": "137ldde",
    "score": 7,
    "title": "Questions on Bachelor of Advanced Computing",
    "author": "RockyChicken182",
    "date": 1683208428.0,
    "url": "https://www.reddit.com/r/Anu/comments/137ldde",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I want to ask some questions regarding BAC and the ANU campus. \n\nFor background context, I am an International Student from Singapore, and I received my offer for Bachelor of Advanced Computing (Honours) recently. I'm currently serving National Service (mandatory army :c ) and will probably enter ANU around the July 2024 intake (maybe even later in Feb 2025 intake). Before this, I have also completed a Diploma in Information Technology from a local polytechnic here in Singapore, in which I have experience in programming and software engineering, including an internship experience.\n\n&amp;#x200B;\n\nNow I have some questions that I want to ask about the course and ANU campus  \n\n\n1) I have heard that BAC is more research-intensive than BIT. Does that mean we will be doing less coding/programming? And what kind of research projects/assignments will we be doing? (Sorryz I'm abit confused on what type of research work we are going to do in BAC haha)  \n\n\n2) How is project work usually graded? Does it hugely affect our semestral grades?  \n\n\n3) How are the coursemates in BAC? Are they friendly?   \n\n\n4) I will also be visiting Canberra and the ANU campus around Sep 6. I know there won't be any guided tour on that day, but is it possible to have a ANU representative to bring me around the School of Computing building, to have a look around the classrooms and facilites?  \n\n\nThat is all I have for now! If you can help me out, that will be greatly appreciated!! : D  \n\n\nThank yous! Sorryz for the lengthy post HAHAHA",
    "comments": [
        {
            "level": 0,
            "comment": "1) I'm about to finish a BAC and I wouldn't say it is extremely research intensive. There is a good balance between computing theory and computing practice and we have only had to do two truly open ended research projects: first in the research methods course to familiarise you with research before your honours, then your honours project.\n\nSo don't worry too much about \"research\" per say, it's a pretty standard computing degree.\n\n2) I'm not entirely sure what you mean by this. For every course there will be assessments, then the grades for the assessments will be combined with given weighting to provide an overall score for each course in the semester. So if you do a project for an assessment, it will count towards your course grade just as an essay, test, etc. would. How these projects are graded are up to the lecturer.\n\n3) I've found people to be reasonably friendly. Naturally a lot of the computing courses are less social than things like politics, philosophy, etc. But I've never had any issue having a chat with people.\n\n4) If you are there during normal working hours all the buildings will be open and working to have a look around. You could shoot an email to the student association for computing: https://cs.club.anu.edu.au/ and I'm sure they could organise someone to give you a little tour.",
            "score": 4,
            "author": "hartybreakfast"
        }
    ]
}