{
    "id": "eiv9um",
    "score": 2,
    "title": "ANU vs USYD vs UNSW for settling in USA later with a CS degree",
    "author": "fickbruhh",
    "date": 1577950970.0,
    "url": "https://www.reddit.com/r/Anu/comments/eiv9um",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've received an offer letter from these three universities for admission into Bachelor of Advanced Computing! My plan is to do Bachelors here and relocate to the USA for masters and eventually land a job in a big tech company.\nWhich university will be the best for me ?",
    "comments": [
        {
            "level": 0,
            "comment": "1. If you're decent you can land a job from a big tech company with just a 4 year bachelor+honours degree. That is unless you don't want to be a \"software engineer\" and want to head into a specific field of research (AI, for example). Check out the E3 visa program.\n2. UNSW probably has the best undergrad CS courses in Australia, and they also have close connections to industry in the US -- if you have an offer to UNSW I wouldn't worry with USYD.\n\nGiven the information you're asking, maybe you're wondering why the fuck someone would choose to come to ANU. A big reason I came to ANU was cause of the fact it wasn't in Sydney. For me, getting away from my parents and having a near-zero commute to uni was super appealing -- even if it meant the added stress of working part-time and putting money into accommodation (if you're lucky your parents can help with that, which if you can take you by all means should). As far as the quality of our CS department, it's fine -- I've compared notes with people from unis in Sydney and it seems relatively the same in terms of chaos. If you're a comitted interested student you can take on research projects or find work within the faculty relatively easily too.\n\nHappy to answer more questions.",
            "score": 3,
            "author": "dearbrothermycroft",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I know a bachelors degree is enough but I want to do Masters in the US later sometime in the future, for that I heard they need some sort of research in the undergrad years, as I'm an international student I don't know about the research opportunities at USYD/UNSW that's why I'm a bit confused what to do",
                    "score": 1,
                    "author": "fickbruhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough. Didn’t realise you were an international applicant. My apologies.\n\nIf you’re doing a degree with an honours year you’ll get the opportunity to do a research thesis as part of your 4th year, usually. Always worth referring to the course information page.\n\nANUs advances computing degree has research built into it before the honours year cause that’s what it’s “supposed to prepare you for”.\n\nObviously you can ignore my comments on the merits of moving away from your home city, since you’re already doing that — but it’d probably be worth doing some research the differences between Canberra and Sydney. I’d give you a review but I’d be quiet biased (I did leave Sydney).",
                            "score": 1,
                            "author": "dearbrothermycroft"
                        },
                        {
                            "level": 2,
                            "comment": "What's your motivation for pursuing a Masters in the US? Most people would not recommend it unless you're trying to find a job in the US or prepare for a PhD.\n\nIf it's the former, it's quite possible to get a job in the US straight out of undergraduate given you are an Australian citizen and eligible for the E3 visa. Unfortunately, it is very difficult given you are an international student due to the H1B lottery and everything.\n\nIf it's the latter, you might as well just apply for the PhD directly. With most programs, you get a Masters along the way anyways.\n\nAlso consider whether you want to do a Masters in computer science or in engineering. A Masters in engineering is considered more practical and sets you up directly for work. If it's computer science, you're better off doing some research which ANU would be quite suitable for (depending on which field you're interested in).\n\nAlso consider the fact a tech company would usually rather hire a US citizen than an international applicant, so you aren't guaranteed job even if you go to Stanford, UC Berkeley, etc. for your masters.\n\nAnother option you can consider is getting a job at a top tech firm in Australia, and then doing an internal transfer. I will say from what I have heard, they work much harder in the US offices than in Australia.",
                            "score": 1,
                            "author": "ugwu123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely UNSW for CS.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is USYD for CS? I'm leaning towards USYD more! Will that be a wrong decision?",
                    "score": 1,
                    "author": "fickbruhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "USYD IT and Computer Science department has way too many student complaints. Student satisfaction is shit according to what I have heard from USYD graduate themselves and rea on USYD Rants on Facebook. Apparently some infamous teaching staff like John don't give a damn about students.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}