{
    "id": "jbi5ht",
    "score": 3,
    "title": "Please help me with survey on living in student accommodation!",
    "author": "horriblesquidparty",
    "date": 1602742337.0,
    "url": "https://www.reddit.com/r/Anu/comments/jbi5ht",
    "media_urls": [
        "https://www.reddit.com/r/Anu/comments/jbi5ht/please_help_me_with_survey_on_living_in_student/"
    ],
    "other_urls": [
        "https://forms.gle/TJRjjf8iLvZv2jFe7](https://forms.gle/TJRjjf8iLvZv2jFe7)"
    ],
    "postText": "Hi, I'm a design major at USYD. Kindly asking if any of you who have lived in any type of student accommodation in Australia could complete my 2-5 min survey? Trying to see how we make it easier to build friendships more easily between residents for my design report.\n\n[https://forms.gle/TJRjjf8iLvZv2jFe7](https://forms.gle/TJRjjf8iLvZv2jFe7)\n\nThanks! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Let me tell you, the connection formed in student housing that really needs fixing is the connection between UniLodge and my bank account",
            "score": 7,
            "author": "watkykjynaaier",
            "replies": [
                {
                    "level": 1,
                    "comment": "yep. wouldn't recommend unilodge",
                    "score": 2,
                    "author": "starwarsfan7533",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "New student moving into Kinloch next year here, if you don't mind me asking what's so bad about it? The fees seem reasonable enough from what I can tell and I haven't heard much other negative feedback until now?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the fees are reasonable, and I always thought kinloch seemed nice :) I personally had a bad experience at Davey lodge when I was given a room with no windows, very poor wifi signal, and was charged randomly for things I didn't know about. doubt you'll run into the same problems at kinloch though!",
                                    "score": 2,
                                    "author": "starwarsfan7533",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, sweet, thanks for sharing your experience. I'll try and keep an eye out for some of those miscellaneous fees and whatnot",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They can have issues regarding payments.  I'm at LK and their system just repeatedly was unable to debit my account despite having hundreds of dollars more than it wanted in there.  The staff were lovely about it but having to go down to the front desk every week to dispute my late fee and pay until management let me set up an automatic deposit was quite frustrating (and the first few times I got a late fee, quite stressful!)",
                                    "score": 2,
                                    "author": "Thomas_633_Mk2"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}