{
    "id": "khysgm",
    "score": 12,
    "title": "Whole class of 300 students penalised 30% of total mark?",
    "author": "tomk23_reddit",
    "date": 1608614148.0,
    "url": "https://www.reddit.com/r/Anu/comments/khysgm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is this true? Anyone come from that class?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, this really happened. I know several people who took the course and needless to say they’re not very happy about it.",
            "score": 12,
            "author": "watkykjynaaier",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow killing spree. thats unbelievably thoughtless act by a top uni",
                    "score": 8,
                    "author": "tomk23_reddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Surely the decision won’t stand though. It’s unfair, immoral and borderline illegal because it infringes upon a basic constitutional right of “the presumption of innocence”. The legal burden of proof should rest on the university to prove (beyond a reasonable doubt) that all 300 (or a partial) people did plagiarise. Otherwise, no penalty should be applied besides a reshuffle of distribution among the assessments of course to compensate for the fact that the assessment at hand is compromised.",
                            "score": 9,
                            "author": "Opengangs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "agree. one mispenalise too many i would say",
                                    "score": 3,
                                    "author": "tomk23_reddit"
                                },
                                {
                                    "level": 3,
                                    "comment": "The decision will likely stand. As a current ANU student, based on my own experiences, it would not be in the University’s institutional character to intervene. Stuff like this happens all the time on a smaller scale and nothing gets done, ESPECIALLY with regard to excessively harsh grading. Now that it’s been picked up by the media the University might step in, but ordinarily it would be very unlikely that the decision is walked back.\n\nEDIT: Just googled it and what do you know, they’re walking it back in the least helpful way possible",
                                    "score": 1,
                                    "author": "watkykjynaaier"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The article in the ABC's website today covers it pretty well   \nhttps://www.abc.net.au/news/2020-12-21/anu-computer-science-students-penalised-over-alleged-plagiarism/13004718",
            "score": 8,
            "author": "bohlsi"
        },
        {
            "level": 0,
            "comment": "The matter was resolved and the group punishment overturned.",
            "score": 3,
            "author": "ElysiumDawns",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.abc.net.au/news/2020-12-22/anu-apologises-reverses-penalty-for-students-over-plagiarism/13008274",
                    "score": 2,
                    "author": "ElysiumDawns"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My boyfriend is in that class and said how annoyed he was that it’s a blanket deduction on the A3 and M3. Surprised this sort of thing is permitted. It’s always a risk with online exams that this could happen but the faculty should have put measures in place.",
            "score": 2,
            "author": "LadFarquaad"
        }
    ]
}