{
    "id": "mgaftq",
    "score": 8,
    "title": "Conditional Offers - What are they like?",
    "author": "magnemite_fucker",
    "date": 1617089377.0,
    "url": "https://www.reddit.com/r/Anu/comments/mgaftq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, \nI am a year 12 student applying for early entry.\n\nI was wondering what the conditions on  a conditional offers are like for HSC year 12 students. \n\nDo they:\n- just require HSC completion\n- achieve a certain ATAR? If so is the ATAR higher or lower than the advertised selection rank?\n- or some other condition\n\nAsking cus I’m not confident with exams at all and don’t think i can meet the advertised selection rank, hence the early application.",
    "comments": [
        {
            "level": 0,
            "comment": "The minimum ATAR requirement will be written on the conditional offer letter. \n\nRemember, once adjustment factors/bonus points are taken into consideration, your ATAR might be higher than predicted. So don't write yourself off just yet!",
            "score": 6,
            "author": "Enceladus89"
        },
        {
            "level": 0,
            "comment": "An update for anyone else who is interested. \n\nI emailed ANU asking the exact same thing and was told that offers this year don’t require meeting a specific ATAR but so require completion of the HSC and achieving an ATAR but there is no minimum ATAR.",
            "score": 5,
            "author": "magnemite_fucker",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is good! I am also a year 12 student who completed their early entry. I believe your update described a system that is new to this year. However is that not exactly the same as an unconditional offer?",
                    "score": 1,
                    "author": "allyourparts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From what I've heard, usually conditional offers are for the advertised selection rank, not lower",
            "score": 3,
            "author": "Empty-Yoghurt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thanks. \n\nJust seems weird that it’s early entry and the results being analysed are year 11 results but yet achieving the advertised selection rank is necessary. Not really seeing the difference between a normal entry apart from getting a reserved spot if i meet the requirements.",
                    "score": 2,
                    "author": "magnemite_fucker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So it’s conditional to you getting the ATAR needed! But even if you don’t think you’ll get it, I’d do it anyway. You never know! And bonus points count towards it as well.",
            "score": 3,
            "author": "AntiqueMango27"
        },
        {
            "level": 0,
            "comment": "This year early offers are unconditional, so if you get an early offer you simply need to finish the HSC and receive an ATAR (any ATAR no minimums) to enroll.",
            "score": 3,
            "author": "scoobiedoobertie",
            "replies": [
                {
                    "level": 1,
                    "comment": "~~Not too sure about that one chief.~~\n\nedit: [actually](https://imgur.com/gallery/s5CjgeL) you are be right",
                    "score": 4,
                    "author": "magnemite_fucker"
                },
                {
                    "level": 1,
                    "comment": "I believe this was true for last year due to COVID, but I’m not sure about this year",
                    "score": 2,
                    "author": "RocketLads",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what I thought as well but the ANU site for domestic undergraduate applications does say “Offers released on 9 August 2021 are based on your Year 11 results and these will be honoured for study in 2022 as long as you complete Year 12 and achieve an ATAR”\n\n[source](https://anu.edu.au/study/apply/domestic-applications-anu-undergraduate)\n\n[second source](https://anu.edu.au/news/all-news/information-for-prospective-students)",
                            "score": 3,
                            "author": "magnemite_fucker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "my school had a webinar with a person from anu and she was adamant that no minimum ATAR was required",
                                    "score": 3,
                                    "author": "scoobiedoobertie"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}