{
    "id": "mwtf2d",
    "score": 3,
    "title": "Double degree question",
    "author": "itsbriggsybitch",
    "date": 1619178376.0,
    "url": "https://www.reddit.com/r/Anu/comments/mwtf2d",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m currently applying to study undergrad at ANU for next year and I’ve been thinking about doing a double degree. I’ve always been set on doing International Relations but I understand that it’s a very common degree and paring it with another degree would help a lot with job prospects, etc. \n\nCan anyone who’s currently doing or has completed a double degree tell me about the workload? I’d rather stick to just one if it’s going to entirely drain my social life (as I’ll have to work as well). \n\nAlso what are some good degrees to pair with it if I do decide to go down this path? I would do polsci but I’ve heard that it overlaps a lot. \n\nAnd lastly, how would I apply for a double degree through direct apply? I’ve already filled out the application, but I couldn’t figure out how to choose preferences for a double degree not just a single. \n\nThank you for the help!!",
    "comments": [
        {
            "level": 0,
            "comment": "Currently doing PPE/IR double, only in first year but the workload has been significantly less than I had expected. I can only speak for how my first 7 weeks have gone but I have never felt as if I have needed to sacrifice meaningful social experiences just to get work done.",
            "score": 5,
            "author": "WhichVA"
        },
        {
            "level": 0,
            "comment": "The workload isn't different if you're doing similarly difficult degrees and the same number of subjects per semester, you just study for longer and typically do fewer electives in each degree.\n\nDouble degrees can be used to lower workload, eg: Law and the usual Arts or Commerce means you're doing fewer law subjects a semester.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The workload is just as normal. However, if you choose two degree which have significant differences, you might beed to study 5 years instead of 4. \n\nIt’s common to take double degree within a college",
            "score": 3,
            "author": "rayprofit"
        },
        {
            "level": 0,
            "comment": "To pick a double degree option on the ur direct application, you have to search up- double arts, humanities, sciences and business or something - and then u can opt for two degrees through that option. Hope that helps:)",
            "score": 1,
            "author": "muchtrust03"
        },
        {
            "level": 0,
            "comment": "i’m literally in the same position as you are. However, I think i’m going ahead with PPE/IR double as it seems boundless and I get to decide what I would want to do after that because i’ve heard how different things are at school and uni.",
            "score": 1,
            "author": "wholisheet"
        }
    ]
}