{
    "id": "ot4ekc",
    "score": 4,
    "title": "Parking fines? what can they do?",
    "author": "[deleted]",
    "date": 1627454025.0,
    "url": "https://www.reddit.com/r/Anu/comments/ot4ekc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys,\n\nI have a parking fine for activating the app on the wrong ANU parking station number (apparently invalid permit) I paid for my parking and everything.  it was 122400 instead of 122490 or something.  \n\n\nI graduated this year and plan not to return to ANU anytime soon\n\nHas anyone experienced not paying their fine?  \nWhat has happened? What can they actually do?",
    "comments": [
        {
            "level": 0,
            "comment": "If it’s your first fine, usually they let you off with a warning - contact the parking office and see if they can let you off. Otherwise i’ve heard stories of people not being able to graduate due to unpaid fines so I’d try and get it rectified asap",
            "score": 9,
            "author": "nang18"
        },
        {
            "level": 0,
            "comment": "If you sent this to them as an email I'm sure they would dismiss the fine. \n\nOn the other hand if you leave it then there is a small chance your fine is one of the ones that they send through to the ACT Magistrates Court (there's a cap on how many they can send). You're then given a deadline to pay the fine by the court. If you don't pay the fine a court date is set for you. If you don't show up in court you're held in contempt, fined more, they suspend your license and record a conviction.\n\nI know this because it happened to me! I left the country and received an ANU parking fine in my absence. I attempted to renew my license upon returning to Australia two years later and discovered it had been suspended! I had to schedule a court date and have my contempt of court conviction overturned. They dismissed the thousand dollar court fine but I did have to pay the original parking fine and a late fee.\n\nSo that is what they can do :)",
            "score": 5,
            "author": "ThinkRodriguez",
            "replies": [
                {
                    "level": 1,
                    "comment": "jesus! thats so insane!  what bastards!  they must just fricken hate the students completely!  \n\n\nI have sent in for a withdrawal so hopefully they will let it slide with my good behaviour (fingers crossed!)",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think your chances are good.  They're normally pretty happy to waive the fine if you've got good behaviour + a decent reason.  I got a fine waived semi-recently for accidentally parking in a residential space with a surface permit.  I think I was technically within the 5 years for good behaviour too (I'd gotten a ticket 4-5 years before, which was also waived for good behaviour).",
                            "score": 2,
                            "author": "mustardsadman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The parking office is a fucking nightmare, they require a stat dec to dispute fines, are very callous, and can and will take you to small claims court to enforce the fine.",
            "score": 3,
            "author": "Lilac0",
            "replies": [
                {
                    "level": 1,
                    "comment": "they are complete fuckers! you're right! been very cold!",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know, they aren't trying to be malicious, they're just doing their job",
                            "score": 2,
                            "author": "BouncingAndVivacious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True but they make it so so so hard when all you did wrong was press the wrong button on a mobile phone app.\nPaid for the parking with good intentions and everything.\nThere's no understanding for simple human error",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, that's true",
                                            "score": 1,
                                            "author": "BouncingAndVivacious"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just explain it to them in an email, attach the receipt of payment (and/or screenshot from banking app showing payment), and they might let it slide.",
            "score": 2,
            "author": "CiggieButtBrian"
        }
    ]
}