{
    "id": "p0xc39",
    "score": 2,
    "title": "Compsci Vs Engineering @ ANU",
    "author": "SomewherePatient9170",
    "date": 1628497758.0,
    "url": "https://www.reddit.com/r/Anu/comments/p0xc39",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone,\n\nLike a few people on this sub, I recently got into the Flexible Double Engineering and Advanced Computing program via direct application. I was\nwondering if anyone with experience of the college of engineering and computer science could advise me on which degree (Between bachelor of\nengineering or bachelor of advanced computing) is better in terms of organisation, relevance to the real world, and job prospects. I have heard\nsome not so good things about engineering at ANU (I was doing a laboratory tour with one of the engineering researchers for Year 10 work experience and he quietly pulled me aside to tell me to do engineering at UNSW was better than at ANU so now I am very skeptical about pursuing engineering at ANU), so am leaning more towards computer science right now.\n\nAny advice would be much appreciated! Sorry if this is asking a questions which has been asked hundreds of times before, I couldn’t seem to find anything about this in earlier posts.",
    "comments": [
        {
            "level": 0,
            "comment": "I currently study engineering at the ANU, and regarding engineering vs comp sci, it is very similar in terms of organisation as far as I am concerned. Both degrees are managed by CECS (College of Engineering and Computer Science), and through engineering you will end up doing a few comp classes anyway (not sure about vice versa). In terms of relevance and job prospects, both will ultimately get you very similar career prospects, with many people working across disciplines. Really, comp sci or engineering should come down to which you are more interested in. Try looking at some job websites and the sorts of roles you would be doing in either field, and see which interests you more.\n\nAs for ANU vs UNSW, I can't say more than UNSW has a better range of majors than ANU, so if you want to do something the ANU doesn't offer the choice is easier, although based on you asking comp sci or engineering you might not know what exactly it is you are interested in yet. As for that engineering researcher, did they do a degree at ANU, and if they are still working at the ANU are they just a disgruntled employee looking to pay out on the ANU. Who knows? Also, accomodation and all that, so you have to ask if moving to either is worth it for yourself personally, with all the associated costs.",
            "score": 2,
            "author": "mariana_trench1"
        }
    ]
}