{
    "id": "pkt38o",
    "score": 5,
    "title": "Semester 1 vs Semester 2 Intake? What’s the difference",
    "author": "queenofdisaster112",
    "date": 1631172776.0,
    "url": "https://www.reddit.com/r/Anu/comments/pkt38o",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys I’ve been accepted into a master degree of Digital humanities and Public culture at ANU. Planning to start my study next year in July. (25 July 2022) Winter session I guess.\n\nLately, I’ve been researching about compulsory courses for my first enrollment. I came across a bit of unpleasant experience while doing my academic preparation. Why (the hell) most of the interesting courses units are available only in Semester 1.\n\nIt’s required for me to do 4 introductory courses out of 10 following choices. However when it comes to program start date that is compatible to mine, there are only 2 I can enroll. \n\nSo It becomes doubtful even more what’s the difference between those two intakes.\n\n\nThanksss",
    "comments": [
        {
            "level": 0,
            "comment": "I would email the convenor of that degree and get their advice.",
            "score": 2,
            "author": "ElysiumDawns",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sent an email to College of Arts and Social Science a few hours ago. Hopefully they’ll get back to me soon. \nLet’s see their solution next week, otherwise I’ll email to the course convenor. \n\nThankss",
                    "score": 1,
                    "author": "queenofdisaster112"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I joined this semester and had a similar issue. Luckily for me, however, I had 3 compulsory courses that were available for this semester. I ended up just taking 3 courses, hoping to make one up later in a summer or winter session.",
            "score": 1,
            "author": "WildBoot9208",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh thanks for sharing !! \nI have to say how lucky are you. \n\nIt doesn’t seem fair to me to make up 2 later in Summer session where I have to enroll about 3 way more stressful disciplines.\n\nWhen Winter session students are expected to have too much free time. It is going to be a colossal waste of time.",
                    "score": 1,
                    "author": "queenofdisaster112"
                }
            ]
        }
    ]
}