{
    "id": "s1cglp",
    "score": 6,
    "title": "How do I enrol into my courses?",
    "author": "Organic_Geese",
    "date": 1641906271.0,
    "url": "https://www.reddit.com/r/Anu/comments/s1cglp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am starting my bachelors of commerce this year and just received my offer, however I have no idea how to enrol into my courses even after watching the video and reading website information. I don’t know which courses are compulsory and how to enrol courses in my major. Will ISIS tell me if I’ve enrolled in too many/not enough courses? Do I have to enrol in every course within my major? Help.",
    "comments": [
        {
            "level": 0,
            "comment": "Hi, I do bachelors of commerce too. To enrol in your course, since your first year and I am assuming you have done no courses at all yet, you have to do the compulsory courses.\n\n1. Go to programs and courses website and find the Bachelors of Commerce program:[https://programsandcourses.anu.edu.au/program/BCOMM](https://programsandcourses.anu.edu.au/program/BCOMM)\n2. From there click **Study.** Usually at the bottom of the page there is a Study plan you can go off of, or you can build your own. There is also a First Year Advice page if you would like more help.\n\nI'm not sure which major you want to do for Commerce, but most commerce students start with STAT1008, BUSN1001 and ECON1101. If you want to do a Finance Major, to take FINM1001 you need to complete or be studying STAT1008 at the same time.\n\n&amp;#x200B;\n\n**To enrol in your courses, go to ISIS ANU Website, and there's a course enrol, click S1 2022 session and then it will ask for a course code:**\n\n*Lets do ECON1101 as an example:*\n\n1. **Go to:** [https://programsandcourses.anu.edu.au/program/BCOMM](https://programsandcourses.anu.edu.au/program/BCOMM)\n2. Click **Study/First Year Advice**\n3. Click a course you want to do **eg. ECON1101** (will take you to this page: [https://programsandcourses.anu.edu.au/course/econ1101](https://programsandcourses.anu.edu.au/course/econ1101))\n4. Go to **Class Tab**\n5. There will be a heading: **Offerings, Dates and Class Summary Links**\n   1. Since you are starting **S1 2022**, there is a \\*\\*class code (\\*\\*its called **class number**, its a **four digit code**)\n   2. Copy that code and go back to the ISIS course enrol page, and **Paste the four digit code in**)\n\n**Tip:**\n\nPeople will say that it will show up on Wattle after you enrol, it usually shows up closer to the beginning of term date, so don't worry, your wattle is not broken. The tutorial times for first year commerce subjects are EXTREMELY competitive, (advice from a second year myself), the time you want could be gone in 30 seconds, so I advise you not to leave it to the last minute and actually stay by your phone and refresh the tutorial sign up page when the convenor tells you the time tutorial sign-ups open so you don't miss the spot you want.\n\n&amp;#x200B;\n\n**Edit:**\n\nSome courses will not be available in Semester 1, but may be available in Semester 2.\n\n&amp;#x200B;\n\nI hope that helps, if not just DM me and I'll see if I can explain it better.",
            "score": 7,
            "author": "timtxnn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't worry if the video is confusing, they don't explain it very well lol. You're better off asking a person for help",
                    "score": 2,
                    "author": "timtxnn"
                },
                {
                    "level": 1,
                    "comment": "hi mate, how can i select my tutorial time? I don't find \"enrolling in tutorial\" button on Wattle page.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi! So I’m guessing you’ve enrolled into your courses, usually the courses you have enrolled into show up two to three weeks before the semester begins (it’s late I know). \n\nAnyway, when they show up onto your wattle, the convenor will post a message saying when they plan on opening up tutorial times for everyone, they introduce themselves etc (some convenors are more organised than others). Or they would have already added a section on the Wattle Course if you open it up. It will show a button for tutorial sign up times and usually gives you a date and time to tell you when they open up.\n\nSometimes they set a date and time that is super super random and that’s usually because they haven’t booked a time slot in to allow people to start signing up for tutorials. They usually spread tutorial sign ups throughout the 2-3 weeks to spread them out because they don’t want wattle traffic to be too high.\n\nThe tutorial sign ups typically open right before O week or during O week, the latest would be week 1 because there are no tutorials week 1.\n\nIf there are any questions DM me or reply here :)",
                            "score": 3,
                            "author": "timtxnn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! really clear and organized answer😄",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}