{
    "id": "s54fku",
    "score": 13,
    "title": "Overwhelmed 2022 student",
    "author": "airbackwards111",
    "date": 1642310549.0,
    "url": "https://www.reddit.com/r/Anu/comments/s54fku",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys! I don’t know if this is just me but is anyone else feeling really overwhelmed?\nLike I have no idea how to enrol in the course I want and what classes am I supposed to do like ahhhhhh \nAnd how do I find out when my contract for my accommodation starts and i’m so confused!\nthanks in advance for any help :)\nbtw i’m staying at fenner (from melbourne) and i will be doing science advanced honours!",
    "comments": [
        {
            "level": 0,
            "comment": "You can enrol into your courses on [ISIS](https://isis.anu.edu.au/). Once you have logged into ISIS you can start enrolling into your courses by clicking on the \"Course Enrolment\" button. \n\nANU provides a recommended course structure on their [programs and courses](https://programsandcourses.anu.edu.au/program/ascad) website. However, since you are studying a Bachelor of Science your options are much more flexible than most other degrees and your courses will wary depending on your subject of interest. The Bachelor of Science degree requires you to complete at least one science major which dictates a lot of the courses that you will be required to take. For example, students interested in Physics might complete the necessary courses for the [Physics major](https://programsandcourses.anu.edu.au/major/PHYS-MAJ).\n\nI cannot comment on the accommodation question.\n\nI hope this was helpful. If you have any other questions feel free to DM me.",
            "score": 8,
            "author": "hkatt__",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks heaps!",
                    "score": 1,
                    "author": "airbackwards111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey its super fair you're feeling overwhelmed! Just to answer your questions:\n\n- The start of your accommodation period should be outlined in your contract and/or email with acceptance of residency at Fenner. Have you recieved these yet? If you want, you can also email Fenner Hall directly to ask.\n\n- Regards to enrolling, check out this super helpful comment on another post: https://www.reddit.com/r/Anu/comments/s1cglp/how_do_i_enrol_into_my_courses/?utm_medium=android_app&amp;utm_source=share\n\nIf you have anymore questions or confusions, I'd recommend joining the 'New @ ANU' Facebook group and asking questions there. There are also loads of postings about starting first year group chats there as well which I'm sure will be helpful :)",
            "score": 5,
            "author": "dismissivefrappe",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the help! i haven’t received any email from fenner yet so maybe i’ll call.\nand that linked post was super helpful :)",
                    "score": 3,
                    "author": "airbackwards111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! It's so ok to be overwhelmed about starting Uni. It's a massive step from high school, but there's lot's of avenues for support to make sure you transition as smoothly as possible :).\n\nThe questions about enrolling have been answered, but basically from my experience the deadline for enrolling isn't a few weeks away. You have time! I recommend attending as many O-week information sessions and drop ins organised by the College of Science :) \n\nAbout the accommodation, if you have been accepted into Fenner and accepted the contract, then you're best bet for contract timing is by calling Fenner reception. Contract dates for many colleges start on the 9th of Feb, but recommend you confirm it yourself. \n\nHope this helps! Enjoy and relax until the move in to Canberra! :D",
            "score": 2,
            "author": "the_siklad"
        },
        {
            "level": 0,
            "comment": "Yooo I'm also doing B of science advanced honours this year!  From what I know, you should have received a matriculation email a few days ago, and it will have all the usernames and website links you need to do all of those things. They also have tutorials and help pages if you have any trouble.\n\nThe biggest problem or confusion I'm having at the moment, is how the timetabling works. I saw that I should use the unofficial timetable viewer, because of how bad the ANU official one is. But I don't know whether I have to work out which lectures and classes every single week, or whether we have a cycling timetable or something. And some of the very first Chem1101 lectures repeat all the way into week 5, so I don't really know what to do either.",
            "score": 2,
            "author": "QIUqiu3n"
        },
        {
            "level": 0,
            "comment": "Welcome to uni life!\n\nUnfortunately you gotta start finding stuff out for yourself because people won't do it for you (unless you ask) :)",
            "score": 1,
            "author": "rdood2",
            "replies": [
                {
                    "level": 1,
                    "comment": "u/airbackwards111 try reaching out to the college student services teams. I've generally had a good experience with them",
                    "score": 2,
                    "author": "Loose_moose1301"
                }
            ]
        }
    ]
}