{
    "id": "sdtjih",
    "score": 4,
    "title": "textbooks?!",
    "author": "mejadra",
    "date": 1643271511.0,
    "url": "https://www.reddit.com/r/Anu/comments/sdtjih",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey, I'm starting my Bachelor of Archaeological Practice this year and ofc there's quite a lot of textbooks I'm going to need. is there often opportunities to buy secondhand books on campus once I arrive (I don't live in Canberra) or should I be buying them now? I've heard at some unis the 'prescribed texts' tend to be more like optional recommendations and not actually used in class, is that the case here or will I 100% need them? \n\nthanks &lt;3",
    "comments": [
        {
            "level": 0,
            "comment": "Search libgen on Google. Never buy textbooks first hand, it's a scam.",
            "score": 3,
            "author": "StrangeOwl1400"
        },
        {
            "level": 0,
            "comment": "Hi there! Congratulations on starting your degree! In my experience I would wait until the first week of courses to find out from your lecturer if you really need them (or once you are enrolled and can access the courses wattle page sometimes they have more information about required textbooks there). I have found that many lecturers can send pdfs of chapters or even the whole book if it is really required reading. Some second year students often have pdfs or old textbooks they can share/sell or you can find pdfs online. Often the course will say its prescribed reading but it is really further reading. But I did a bachelor of science so I can't 100% say for archaeological practice.",
            "score": 2,
            "author": "mangrove-holly"
        },
        {
            "level": 0,
            "comment": "Also if you can't find the text online (sideeye to Phil and pols coded classes that prescribe new or out of print books) check out studentvip or any textbook change on FB!",
            "score": 1,
            "author": "theninety_nine"
        }
    ]
}