{
    "id": "tm680j",
    "score": 9,
    "title": "How does ANU go with young students?",
    "author": "brightkidthrowaway",
    "date": 1648125311.0,
    "url": "https://www.reddit.com/r/Anu/comments/tm680j",
    "media_urls": [],
    "other_urls": [],
    "postText": "My kid is potentially going to be 16 in first year.  They skipped a few years and recently were diagnosed with ADHD. They are on track to get an ATAR  of 80 which gets them into enough courses they want to do.  \n\nHow’s ANU for younger kids? How are they with supporting students with ADHD?\n\nMy current idea is that they can do a “fun” degree first, and then when 19 can go and do a second, more serious degree once they work out what they want to do.  Would this work?",
    "comments": [
        {
            "level": 0,
            "comment": "I'd worry about the social side of things a little, if only in terms of the fact that a lot of club/society events involve drinking/going out etc., as well as the bar on campus. I read that you're from canberra so I'd presume they have a support network in other aspects of life (extracurriculars etc.) but nonetheless I'd be wary on those grounds (and imo the difference in maturity, intelligence aside, of a 16 year old and 18 year old). I'd recommend looking around at the campus life activities at the kind of things your kid would be interested in and what kind of vibe you get from them. \n\nIn terms of your \"fun degree\" \"serious degree\" plan, I'd be cognisant of the HECS-HELP limit (unlikely to meet unless your kid does 2 higher student contribution band degrees and fails a fair few units, but worth being aware of). [https://www.studyassist.gov.au/help-loans/combined-help-loan-limit](https://www.studyassist.gov.au/help-loans/combined-help-loan-limit) As well, the student entitlement to CSP ([https://www.studyassist.gov.au/help-loans-commonwealth-supported-places-csps/student-learning-entitlement](https://www.studyassist.gov.au/help-loans-commonwealth-supported-places-csps/student-learning-entitlement)) means that with your plan, presuming 2x 3yr degrees, your child would only be eligible for one more year of CSP learning after the \"serious degree\". This could be problematic if they wanted to do something based on the second degree in a post-grad setting. (Non-CSP postgrad studies can be very expensive)",
            "score": 14,
            "author": "panarypeanutbutter"
        },
        {
            "level": 0,
            "comment": "Just adding onto this; if they're in student accomodation they'll get special care until they're 18, mostly being that the checks for their wellbeing are done much more frequently.",
            "score": 9,
            "author": "Thomas_633_Mk2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, luckily we are Canberra locals and only a short bus ride to ANU.",
                    "score": 7,
                    "author": "brightkidthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was not as young when I started my degree, but I do have ADHD. It is very easy to get any help needed through access and inclusion. All professors I have had, have made the appropriate changes to the teaching plan in order to meet what my Education access plan asks for! For ADHD you only have to submit documents once as it is a lifetime condition.",
            "score": 4,
            "author": "iPurple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow.   Thanks. Is it easy (i.e ADHD friendly) to get?  I suppose the thing that worries me is that as they are young, they might be treated differently by staff / have higher expectations.  I expect passes not distinctions…",
                    "score": 1,
                    "author": "brightkidthrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who has taught at University, regardless of age there will be little 'expectation' for your child beyond 'turn up and have done the prep work' (and even then...). \n\nTeaching at University is a lot more hands off than you would have been used to seeing with their high school. Papers get graded with student numbers (not names) and tutorials don't really focus on individuals too much. In large courses they aren't even marked by the tutor of the class students are in. To be honest, I may have very well had a 16 year old in my classes but I never would have known. \n\nA question that you may want to ask yourself is how will a pass average affect your child's ability to apply for their secondary 'serious' degree? Once you have a UG degree, that is counted far more highly towards future applications than an ATAR and a P average will cause some serious issues if your child wants to undertake a competitive PG (or even UG) degree. Particularly if you are thinking along the lines of medicine, law, pharmacy or optometry, a P average will tank their chances of entry. \n\nCould I suggest reaching out to the [ANU Future Student Enquiry Team](https://www.anu.edu.au/contact-anu/future-student-enquiry) to talk about potential options or issues that you're concerned about? I would explicitly mention your plan re: initial degree with a PG plan.",
                            "score": 6,
                            "author": "vaguelyambiguous1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless your child is in a hurry to go to uni I think a gap year (or two) could be valuable. It'll give them some time to earn a little money, maybe travel, and experience some independence before heading into university at the same age as their peers. Some work experience under their belt will likely be more valuable in the long run than an initial \"fun\" degree.\n\nAs others have said, going in at 16 will likely present some obstacles to fully engaging in social activities.",
            "score": 5,
            "author": "GM_Twigman",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was why I thought they could do two.  By the second degree they could do all the social things.  They are the one pushing to head off to uni.  I thought a second year 12 at least would be good. The gap year idea was also suggested pre covid. I don’t know if I should be the one putting the breaks on as it’s not my life.",
                    "score": 4,
                    "author": "brightkidthrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who would have started uni at 16 also, I am so glad I did a second year of year 12. I then started uni the following year, and even then I feel was too early for me to start. I wish I had taken a gap year or had gotten some more life experience prior to beginning my first bachelor degree. It would have saved the confusion of which area I wanted to pursue further in my studies. I ended up swapping between degrees and taking some time off to move overseas, still not knowing what I wanted to study. The lack of an end goal career wise really impacted my ability to engage with University work. I would not recommend starting a degree for the sake of studying, if your child would like the intellectual challenge then perhaps gaining experience through volunteering or work, while completing single units in University studies for the intellectual challenge. \nEmotional maturity is most definitely something you should consider for your child entering University. \nPerhaps they can enrol in another year of year 12 (maybe even at a different school), and complete University subjects then too, just to get an idea what it's like and if they feel up to it, or to inspire them. I must also express that even though you do not wish to dictate what path your child follows, I would like to encourage you to consider the impact it will have on them emotionally late down the line. Especially considering the fact that they are indeed only a child, and what they want to do now, they might not see as being the best decision later in life.",
                            "score": 3,
                            "author": "SnowfallSilence"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't recommend doing two bachelor degrees. They're only 16, go to Tafe, do some work, whatever else for a couple of 'fun' years. Then apply for uni in two years when ATAR is still valid, and they've got more of an idea of what they want to do.  \n\n\nIt's only two years, but there's a huge difference between 16 and 18.",
            "score": 6,
            "author": "speorgenote",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately they will be 15 at the beginning and while they can go to university, it looks like CIT isn’t an option.  Why not two bachelor degrees?  How will that differ from a double degree?",
                    "score": 1,
                    "author": "brightkidthrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a 17 year old at anu right now, I can tell you that the social aspects kinda suck-most socialising at anu happens via alcohol in some form or another, so your kid is most likely gonna feel stranded and unable to go to many events - as others recommended, let him have fun with a gap year, he will enjoy that far more. Also, the financial burden of a first fun degree is not negligible, especially if he doesn't plan to use it for much. If you want him to do two degrees, Id recommend picking two that are complentary and complete them simultaneously",
                            "score": 5,
                            "author": "H_u_m_a_n-B_o_t"
                        },
                        {
                            "level": 2,
                            "comment": "Two degrees means two lots of fees. A double degree you pay slightly more, but not as much as two separate degrees. Double degrees are generally connected in some way as well.   \n15 is crazy young. No matter how smart or mature they are, it'll be really hard socially and would put a damper on the whole uni experience.   \n\n\nCould they get a part time job for a while, then look at CIT once they turn 16?",
                            "score": 3,
                            "author": "speorgenote"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.anu.edu.au/students/health-safety-wellbeing/access-inclusion/eligibility",
            "score": 3,
            "author": "Enceladus89"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is doing Specialist Maths and Specialist Maths Methods.  He understands the work well enough to help others in his class, but can’t write the knowledge down thanks to dysgraphia. We have only just got this diagnosed thanks to his ability to mask.\n\nI don’t think he is going to go the programming route. He has been exposed to it since he was tiny (both parents code), but he has never been interested.",
                    "score": 2,
                    "author": "brightkidthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey! I started Uni at 17. My advice would be to have some serious talks with your kid. I was really ready to go to uni and no other option appealed to me but going young does have some costs primarily socially. If they want to get involved with clubs etc they may find themselves unable to take part in various events or feeling a bit on the outside of them not being able to drink. That being said I am meeting more and more people who don't drink, and non alcoholic beer etc are a great way to feel included without actually participating, and there are lots of social activities that don't involve alcohol.   \n\n\nIf your child is passionate about a career path or an area of study and there is nothing else that appeals to them then that passion and drive would be worth coming to ANU early. If they just want the uni experience though and they don't really have clear goals in mind I would recommend against it. Doing two degrees is a very long time to be studying, let alone if they want to do something postgrad too. Particularly having ADHD they may feel very burnt out from that duration of study, stress and deadlines and may not have the energy and drive left to do the degree that will help them in the career they really want.",
            "score": 2,
            "author": "mangrove-holly",
            "replies": [
                {
                    "level": 1,
                    "comment": "He isn’t passionate about anything at the moment - he thinks he wants to study maths, but doesn’t know what he wants to do with it. After this term I’m thinking that maybe Uni isn’t the right course for him and maybe CIT might be better.  He needs to learn how to study.\n\nI’m assuming Uni is a bit tighter now than it was in the 90’s.  A friend was a regular at the Uni Bar and always showed his student card to get the discount on beer.  No one noticed he wasn’t 18 until 2nd year.",
                    "score": 1,
                    "author": "brightkidthrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am an ANU academic, and my concern would be that your son may not be socially ready to enter college.   As  academics, we have a duty-of-cae to assist under-age students, but we really cannot control outside of the classroom.   Some subjects, such as genocide studies or law courses that deal with crime, need a certain level of maturity.   Maintaining a good GPA is important, especially if postgraduate studies or an application for study of a 2nd degree is considered by ANU\n\nI do not know much about UC, but there are a lot of Canberra-based students who attend there.  It is a good school and might not have the academic pressures of ANU.    A second year at a good college might also help to raise his ATAR.\n\nSome degree programs are offered online and might be an option to consider.   I am from the US, where there are options to take university-level courses as a secondary school student.  That is something while I was in secondary school and it helped me to mature and grow. I would suggest consulting with an educational counsellor to potentially explore options.   Whether it's at CIT or an online set of offerings, there are a number of possibilities for finding a topic that suits your child.\n\nOn medical issues, I would suggest speaking with Access and Inclusion at ANU.    I cannot speak for all academic staff, but we take accomodations seriously.   I am not aware of accomodations leading to discrimination at ANU, but there are procedures in place to address these issues if they arise (including criminal referrals if necessary).   There is a general view that students are diverse and it is important to accommodate different needs that is different from what I observed a generation ago in tertiary education.",
                            "score": 1,
                            "author": "Substantial-Oil-7262"
                        },
                        {
                            "level": 2,
                            "comment": "sounds like CIT could be a good choice for him until he is a bit more sure what he wants to do! ANU also offers extension programs for Canberra high school students if he was interested in a second year of year 12 [https://www.anu.edu.au/study/apply/preparatory-bridging-courses](https://www.anu.edu.au/study/apply/preparatory-bridging-courses). Specialist maths is one of the options!",
                            "score": 1,
                            "author": "mangrove-holly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "His current idea is either the Mathematical Sciences degree or teaching.  He really has no idea.",
                    "score": 1,
                    "author": "brightkidthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gap year",
            "score": 1,
            "author": "Good_Echidna535",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe.",
                    "score": 1,
                    "author": "brightkidthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had the option to start ANU at 16 too, but I wouldn't recommend it. Particularly around campus, there are lots of social opportunities that aren't available if you're underage (as much as the colleges work to avoid that). And I only had to miss out for a few months. But if they're particularly mature, your kid might be fine - really depends on their maturity and what they're interested in.\n\nThat's just my 2c, but whatever your kid decides I would encourage them (and you) to take your time. There are so many factors to consider, and they can all have significant impacts on social and academic outcomes.",
            "score": 1,
            "author": "Pl4nty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you a Canberra local? I’m wondering if keeping him in his current co curricular activities with the kids his own age might work.",
                    "score": 1,
                    "author": "brightkidthrowaway"
                }
            ]
        }
    ]
}