{
    "id": "utimaq",
    "score": 5,
    "title": "Anthropology and field studies in Vietnam/Indonesia at ANU?",
    "author": "Uuula0",
    "date": 1653011478.0,
    "url": "https://www.reddit.com/r/Anu/comments/utimaq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I found ANU anthropology ranks quite high on QS anthropology subject ranking and the field study courses interest me a lot. \nI am applying to transfer to ANU from a liberal arts college in the U.S. because we don’t have a lot of classes like zero on southeast asian studies and few on anthropology.\nSo I am wondering if anyone has taken anthropology classes or field study classes and willing to share some insights?",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve taken two Anthropology classes and they’re both been pretty good. The teachers are some of the best i’ve had in uni",
            "score": 2,
            "author": "Happy-Orange21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing:) Can’t wait to study anthropology at ANU",
                    "score": 2,
                    "author": "Uuula0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a master of anthropology student at ANU and I am in my final semester. I came from Europe to this university in Australia because I also wanted to be more exposed to Southeast Asian studies during my anthropology studies. The anthropology department and program is undergoing a lot of changes at the moment. The master program has shrunk from 2  years to 1 year, many professors left, and there are courses which content is totally different from what it says on their course summary page.  I definitely feel like ANU will descend on the world ranking for anthropology. If it doesn’t, I’ll have learnt to not factor in these rankings ever again when searching for a good uni. I do feel that I could’ve better studied anthropology elsewhere and paid waaaay less for tuition. That being said, I do have a positive experience in terms of community at ANU. But when it comes to academics, I’m not quite convinced that it is worth the tuition fees.",
            "score": 1,
            "author": "myavailableusername"
        }
    ]
}