{
    "id": "w8hzu5",
    "score": 5,
    "title": "Future ANU prospect Questions",
    "author": "thanksbrainihateit",
    "date": 1658836993.0,
    "url": "https://www.reddit.com/r/Anu/comments/w8hzu5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Howdy! I am a high school student who has decided to start looking into uni kinda early. I go to a small alternative school where the main focus is just getting people to finish the required education. There isn't anyone there I can really talk to about uni, and I just wanted to ask some questions.\n\nI'm sorry if some of these questions are obvious or stupid, and I did try and research them but couldn't find the right answers.\n\n1. Early Entry: easy to get? very hard? I know not everyone gets it, but what would give me a really good chance of getting it? Could you tell me your experiences? if you applied and didn't get it can you tell me about your application? If you did, the same thing?\n2. Units: The course I want to take is 4 years, and has 48 units a year. Is that a lot? A little? A standard amount? If I do it full time, could I schedule it so I have some days off to work?\n3. Student housing: Is it worth it? Should I use the money I would spend to just rent an apartment? Is it expensive? do you have a decent amount of privacy? do you share rooms?\n4. General quality of ANU: Do you like it? good campus, teachers and classes?\n\nThanks in advance :)",
    "comments": [
        {
            "level": 0,
            "comment": "1. I got early entry in 2020, never had super high results in high school so its probably not very hard (although being the first covid year i can imagine the admission numbers changed a lot that year). They place an emphasis on activities done outside of school (such as volunteering, work experience etc.) so make sure you get a good reference letters for that.\n\n2. 48 units is the ‘normal’ amount, but its really up to you how many courses you take, a lot of people do less than four. Some even do more. Personally i do 3, which i love because i get to dive into the courses more, getting more out of it while also having more time for non-university stuff\n\n3. Yes i think its worth it, there are a lot of different types of accommodation on campus ranging from private studios, to shared apartments. Private room with shared facilities, catered/non catered etc. Privacy would depend which accommodation you choose. Personally i think that your personality is quite important when choosing accommodation. In my first semester, i was at a hall which was all very extroverted, and as an introvert myself i got overwhelmed and didn’t have the greatest time there. Then 2nd semester i moved to somewhere more private and absolutely love it.\n\n4. I love the campus, its massive and so peaceful. I love just walking around in the sun! Teachers have mostly been good so far, but I’ve certainly noticed significant differences between some. I’ve had courses where tutorial classes are very big (around 30-40 students) which kind of made dampened the experience, especially as I remember ANU advertised having small classes. \n\nFeel free to dm me if you have more questions or want me to elaborate on something!",
            "score": 3,
            "author": "Happy-Orange21"
        },
        {
            "level": 0,
            "comment": "Hey OP! Good on you for looking into it early! To answer your questions:\r  \n1. It varies from year to year, so I'd actually recommend contacting the College of the School that you are interested in. It also depends on a few other factors beyond marks - have a look on this webpage for more details: https://www.anu.edu.au/study/apply/domestic-applications-anu-undergraduate/applying-to-anu-application-details/changes-to . \r  \n2. I remember how daunting it was understanding Units and coursework when I was entering ANU - you'll have plenty of opportunities to learn about it during the first few weeks. Basically, 1 course (eg. Introduction to Statistics, or CHEM1101) is 6 units, so to graduate with 48 units within 4 years you can do 4 courses per semester. The general expectation is that you do 8-10 hours of combined attendance/personal study per course. You can also do courses in non-semester periods if they are offered, such as in the Summer/Winter/Autumn/Spring . In my experience, you do have opportunities to shift your tutorial times around to do work - if you are struggling with timetabling around then you can contact the Course Convener for advise.\r  \n3. I had an awesome time on student housing! I highly recommend it if you are not from Canberra, especially in first year. It's a nice way to adjust to university life and meeting new people. You have a choice between catered/non catered options, as well as share rooms or studio rooms. You can find details on each of the options here: https://www.anu.edu.au/student-residence-cost-comparison . \r  \n4. I've had a wonderful time at ANU. I'm a bit biased (although all these views are my own!) , but overall what you put in is what you get out. If you go to lectures, engage in tutorials and ask questions, engage in campus activities, it will be very enriching! \r  \nHope this helps, and best of luck! :)",
            "score": 3,
            "author": "the_siklad"
        },
        {
            "level": 0,
            "comment": "1) - Don't know when I went to Uni there was no early entry   \n2) - That is a normal workload - If you do Arts - you have less contact time (lecture / tutes) -but more asignments, if you do STEM - you have more (classes  / tutes / pracs etc.,). You should still easily be able to organise 2 full days of per week.   \n3) YES ! I could not cook, so this provided me all hot meals, a social group to interact with and older students to help with. Move into college first year and then decide what to do for second year.   \n4) I liked ANU - it is one of the better looking campuses around Australia. Teachers / classes etc., will vary by course / year - but I would say on Average ANU is a good level.   \n\n\nIn summary, I liked my time at ANU and college there (Burgmann) - College made it easier for me to move from living with my parents in a small country town to starting uni.",
            "score": 5,
            "author": "SomeoneInQld"
        },
        {
            "level": 0,
            "comment": "* I got early entry last year, which I wasn’t expecting with the grades I had. They weren’t the highest. However with the ongoing covid situation then, ANU may have really needed the students so they handed out more early entry offers than usual. Had a 85.90 prediction rank, ended up getting a lot lower, so thanks to my early entry offer, here I am studying at ANU. Make sure you’ve got activities either done in or outside of school as part of your application too!\n\n* That’s a “standard” or like others said “normal” amount of units. Depending on what your courses are like, workload is different for everyone. I do 4 courses a semester (48 units a year) and have scheduled my timetable to have two days off campus. So yes, you can definitely have time to work as long as you can manage your time well. Although the courses I take are a bit towards the content heavy side so I feel quite occupied with doing uni work outside of uni.\n\n* I don’t live on campus/student housing (I’m not from CBR but I have family here) but coming from talking with friends and other students’ experiences, I think it’s worth it! If you’re extroverted and not afraid of putting yourself out there, then I think you’ll fit right in on campus accomodation. You’ll meet heaps of new people, which I wish I had if I lived on campus. I’d suggest to see how it goes first year and you can decide to move around after.\n\n* I’m enjoying ANU so far, both classes and campus wise. The campus is huge and really nice! I’ve yet to explore more. Some teachers are better than others, I didn’t like this particular teacher last semester, they weren’t good at all. It depends who you get. As for classes, nearly all have been a positive experience and through tutes I’ve got to meet new people.\n\nHappy to answer any more questions if you have any! (including campus living, I can ask my fellow ANU buddies).",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}