{
    "id": "xab6as",
    "score": 7,
    "title": "Wanted to ask about how the communal bathrooms are",
    "author": "FarPool7",
    "date": 1662769837.0,
    "url": "https://www.reddit.com/r/Anu/comments/xab6as",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I recently got offered early entry for ANU, and got accepted for B&amp;G Hall. Which is great, however I only realised after getting accepted that most B&amp;G rooms have no self contained bathrooms and instead there are only communal bathrooms + showers. What makes this particularly bad for me is I'm a trans woman and I don't think I'd feel particularly safe having morning showers etc. in a communal space. But I thought I'd ask, for anyone that's in B&amp;G how bad are the communal bathrooms? Like are they usually really crowded and rowdy? Also in general, how is your experience there (esp. if you're trans/queer)?\n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "Personally knowing people from a lot of the colleges, I’d say B&amp;G have one of the most inclusive and diverse college cultures available on campus. They’re a tight knit group and some of my closest mates came from B&amp;G. In regards to communal showers - I haven’t been in one in B&amp;G specifically but overall in my college, there was never any issues that made me feel unsafe or unwelcome.",
            "score": 8,
            "author": "nang18"
        },
        {
            "level": 0,
            "comment": "the shower/toilets in the residential blocks are all non-gendered and have 3 enclosed shower cubicles and 3 enclosed toilet cubicles. doors pretty much go to the ceiling but only a hook or two to hang clothes on so lots of people would wear a towel to the bathroom. basically the size of a toilet cubicle without a toilet. not ideal but hope that gives you some idea. not really a big enough space outside for people to hang around in from my experience",
            "score": 5,
            "author": "kitchenjzargo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Following this I highly recommend a dressing gown instead of covering with a towel as it provides extra coverage and definitely reduces vulnerability. Other than that, above covered everything but feel free to get on the B&amp;G page on the ANU to see the 3D tours yourself. Compared to other bathrooms I've been in, it feels much safer and trust me when I say that people feel just awkward as you when you see them in there:)",
                    "score": 2,
                    "author": "Sweet_likehoney84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I know this is a super late response, but thought it might be reassuring if you're still thinking of living at B&amp;G. I'm also a trans girl and I've actually had a really nice experience with the shared bathrooms. They are all gender neutral, which has honestly made me feel safer than the vast majority of public bathrooms since I feel less worried about people being discriminatory. Everything is in cubicles, so you have complete privacy. Also, people aren't really rowdy or obnoxious and noise complaints are taken care of very quickly. Just in general, B&amp;G is a really welcoming space for LGBTIQA+ students and I've definitely never been made to feel unsafe there.",
            "score": 2,
            "author": "NamazuGirl"
        },
        {
            "level": 0,
            "comment": "Privacy is reasonable with locked doors. It won't be crowded, everyone has a different timetable and lifestyle so chances are you will be the only person (or two) in the bathroom at a particular time.\n\nSpace can be limited tho, takes a few days to adapt like what to bring with you into the shower, etc. A bag or basket might come in handy for those shower stuff.",
            "score": 1,
            "author": "CloudyRowly"
        },
        {
            "level": 0,
            "comment": "currently live at bng!! we are a super inclusive hall (am queer woman* myself) and i’ve never had a bad experience in the bathrooms - people have weird schedules so you’re unlikely to be there in the same time as anyone else, there’s also often curtesy waiting (if you hear someone leaving or coming in, wait until they’re in/out and then you go) but yea bathrooms are fine (not manky but not like. gorgeous) feel free to pm if u have any questions!! :-)",
            "score": 1,
            "author": "1997d1ana"
        }
    ]
}