{
    "id": "y231ua",
    "score": 8,
    "title": "Accomodation",
    "author": "ProperEnd3849",
    "date": 1665578873.0,
    "url": "https://www.reddit.com/r/Anu/comments/y231ua",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys! so I got an early offer for next year MD ( international placement) and I need to find a place to live and I have a tons of question.\n\n1. Im sorry if this has been asked multiple times but how does the hall system works in ANU? which hall would be good for someone who needs his own bathroom, AC and space for computer? \n2. Is living off campus in uni lodge or renting an apartment better? ( How much is the cost difference gonna be?)\n3. How is the parking ( I have a car) condition going to work if stay in one of the halls.\n4. is staying off campus bad for an introvert like me? I'm worried I'm gonna struggle to find friends.\n\nThanks a lot!!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Hello, I can help you with your qns.\n\nIf you are after own bathroom and AC, UniLodge is your only choice. Kinloch, Warrumbul and Lena Karmel Lodges are the only accommodation on campus with AC. \n\nI recommend you live on Campus at least for the first year. Gets you connected with fellow ANU/UniLodge residents. Renting in the suburbs is competitive and much more expensive if you are wanting to be near the Uni vicinity.\n\nParking is centrally managed by ANU via vPermit. search on the ANU website for more details. UniLodge residents have parking in the building, $95 a month. \n\nHope this helps!",
            "score": 2,
            "author": "vanitysha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the answers!!!\n\nAre the communal bathroom usually clean? I'm a tiny bit sensitive about that.",
                    "score": 2,
                    "author": "ProperEnd3849",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes they are, cleaners come in every morning to clean it. Thursday nights can get a bit nasty with the occasional mess that residents leave after getting intoxicated. However generally it’s pretty clean especially in the new halls.",
                            "score": 1,
                            "author": "vanitysha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How are the noise? does it get super loud? are they strict with the rules ( like is there curfew and stuff?)",
                                    "score": 1,
                                    "author": "ProperEnd3849"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nose level are pretty decent. If there are any disturbances after 10pm feel free to call the duty senior resident to help you sus out the noise level. Otherwise ressies are pretty respectful. No curfew, except for the 10pm noise one daily.",
                    "score": 1,
                    "author": "vanitysha"
                }
            ]
        }
    ]
}