{
    "id": "ywqjjm",
    "score": 2,
    "title": "Law Admission",
    "author": "Mysterious_Will_4048",
    "date": 1668596707.0,
    "url": "https://www.reddit.com/r/Anu/comments/ywqjjm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just wondering if there is a chance I can be admitted to law with a predicted score of 96.67.\n\nI didn't initially apply for law as part of the early entry offers, as I wasn't sure I wanted to study such, however after the November 1st reconsideration round thing I've put it as the top of my preferences. I know the cutoff listed on their website is 97, however at the open day the Admissions officer seemed to imply some leniency - does anyone have experience of being admitted with an ATAR/ predicted ATAR or equivalent score similar to mine? For clarity's sake I've applied for the double in Law and Philosophy, am not in a postcode or school that offers any sort of ANU related gateway scheme and have no sort of medical exemptions/ considerations that would boost my score. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Couple of things.\n(1) Below the ATAR threshold it depends on demand/spaces in the course as to whether you would get in. Short answer is yes there is leniency. You also might get leapfrogged by students who are eligible for ATAR adjustments due to background, postcode etc.\n\n(2) It's worth clarifying that the Bachelor of Philosophy is a special program at ANU with a research focus and high expectations. Think of it like a precursor to a PhD, which is a Doctor of Philosophy (but can be any discipline). As far as I know you cannot Double that with Law.\n\nSo if you want to study law and philosophy/arts look at the Bachelor of Politics, Philosophy and Economics / Bachelor of Laws (Honours) Flexible Double Degree, or the Arts/Law Double Degree with a Major in Philosophy, for example.",
            "score": 3,
            "author": "ditfos"
        },
        {
            "level": 0,
            "comment": "Bachelor of Philosophy (Honours)—Humanities and Social Sciences &gt; which I believe is the only (non science) philosophy bachelors degree at anu, has an atar requirement of 98",
            "score": 1,
            "author": "allyourparts"
        },
        {
            "level": 0,
            "comment": "You’ll probably get in with that score. And honestly, even if you don’t, heaps of people transfer into (and out of) law after their first year at ANU as they realise where their interests lie. After you’ve been at ANU for 12 months you only need a 5.6 GPA to transfer (credit = 5 and distinction = 6).",
            "score": 1,
            "author": "pinkretainer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think under the double law degree you can do law and philosophy - idk if it's like, a philosophy minor or something tho lol",
                    "score": 1,
                    "author": "Mysterious_Will_4048",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Law /PPE (see my other comment) - the way that course is structured I don't think Philosophy is a Major as such but there's plenty of PHIL content.\n\nLaw/Arts you could Major or Minor in Philosophy. There's a lot of overlap in courses between the two options from a quick glance but PPE is more constrained in terms of making you do Political Science and Economics as well. Arts you just pick whatever you want as long as you have at least one Major (8 courses) and one Minor (4 courses) minimum.",
                            "score": 3,
                            "author": "ditfos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh right - thanks for clarifying :)",
                                    "score": 1,
                                    "author": "Mysterious_Will_4048"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}