{
    "id": "589lzy",
    "score": 2,
    "title": "MTIID--any thoughts?",
    "author": "pornfkennedy",
    "date": 1476873612.0,
    "url": "https://www.reddit.com/r/calarts/comments/589lzy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been shopping around for a decent graduate program in Music Technology, hopefully heavy on the programming/ software aspect of it--looking to get into app development, algorithmic/generative music and creation of Augmented Reality sound installations, which means classes in Java and Unity etc. I know these are available at CalArts, but does anyone have any first hand experience they share?",
    "comments": [
        {
            "level": 0,
            "comment": "I just graduated from the program with an MFA, here's a short takeaway.\n\n* You'll learn programming in ChucK, which is a music C-like language (it's built on C++). You can study with Spencer Salazar there, who is the lead developer for the language, which is a big plus. Several times I've gone to him and asked if we could fix something about the language, and he usually can do it fairly fast.\n\n* Following ChucK, you'll learn Processing, which is great transition language and works well with ChucK, most of my audio/visual works combine the two.\n\n* You'll have the option to learn VST development as well, there is a C++ class for that, just note that it's very demanding. \n\n* There are some art and tech classes that teach Unity, and although they're outside of the MTIID program, you're encouraged to step outside of the program and search out what you want your art to be.\n\n* For generative/algorithmic music, ChucK is amazing, but you can also use Max/MSP if you're comfortable with that. There is a sister program, Experimental Music Practices (ESP), and their faculty is amazing. Clay Chaplin is a heavy Max user, and teaches a Max class every now and again.\n\n* Scott Cazan is an amazing teacher, I think this might be his last year, but he was all about generative/algorithmic/genetic programming. Really great teacher, I hope they replace him with someone in the same wheelhouse or set of skills.\n\nLet me know if you have anymore questions, I spent the last three years there and got a lot out of it. For the most part, the school is really about finding your niche, I migrated more toward the experimental electronic composers and found a foothold there. The ESP program became a great resource for me as well.",
            "score": 3,
            "author": "dkfjsal"
        }
    ]
}