{
    "id": "cdr8if",
    "score": 7,
    "title": "High school Sophomore wanting to know what it takes to make that 3% acceptance rate into Character Animation...",
    "author": "_ZellBell_",
    "date": 1563244827.0,
    "url": "https://www.reddit.com/r/calarts/comments/cdr8if",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I’m pretty obsessed with CalArts right now... and probably will be for a long time. Art isn’t just a passion of mine it’s my entire life. I can’t go a day without it. I’ve been cramming in life studies but I’m no where near good enough yet and I wanna know what direction I should take my art in and what specifically CalArts is looking for.",
    "comments": [
        {
            "level": 0,
            "comment": "(Just a foreword I am not a Calarts student myself, I’m still in Highschool, but I did go on a Calarts kick for awhile and I’ve heard lots of different tips about applying there. Hope some of it can help you out ^^)\n\n\nMy advice would be to just keep practicing... and try not to copy what you see in other Calarts sketchbooks, and you shouldn’t render everything (i.e. make everything look perfect), you should show some sketchier things, show how you went about drawing. I’ve heard that you should try to take things you see in real life and try to make them into something that could become some sort of story. Like life studies of dogs into dog characters or something. \n\nBut I’d say you should just keep trying to improve as much as you can, take life drawing classes, sign up for a precollege program, etc.\n\nThere’s also Portfolio Day where you can go to get your portfolio reviewed by representatives from the colleges you want to go to, and they’ll tell you what you should change/work on. Here’s Calarts webpage about it: https://calarts.edu/admissions/tours-and-admissions-events/us-events/portfolio-days\n\nGood luck dude!",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much this was so helpful!",
                    "score": 2,
                    "author": "_ZellBell_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CalArts char anim alum here. My best advice is to avoid making art with the intention of being “good enough” for CalArts admission. I was rejected two times in a row and only after I gave up drawing for CalArts and began drawing for myself did they accept me. When I submitted my last portfolio for review, I selected work that was very personal and represented my vision of beauty, as an artist. I no longer felt the need to prove my talent to anyone because it was self-evident in my work. While my draftsmanship did improve, the talent was there the whole time and I had just been obscuring it by drawing for the approval of the portfolio review committee instead of my own.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello! It's actually more like 6% Please reach out to the school's animation counselor. They are there to look over your current work and give advice on where you can personally improve. You can also visit a National Portfolio day to get more advice on you work.  Overall, you want to be doing observational life drawing for an hour+ a day. Try to challenge yourself by drawing with different mediums. Most of your drawing should figure drawing/urban sketching.",
            "score": 3,
            "author": "amisamiamsam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! This is great advice! There’s this coffee shop I love to go to called Vienna. I’m assuming it would be good to just go there and draw the environment?? Also, my art teacher says I have an opportunity to sell my art there in a couple weeks. I’m not expecting any buyers but you never know unless you try and at least I got my name somewhere. But I’ll totally take that advice. Just wondering, where should I go to contact the animation director??",
                    "score": 2,
                    "author": "_ZellBell_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://calarts.edu/admissions/meet-our-counselors - just find the counselor for animation and send her an email. The coffee shop sounds like a great way to get some drawing experience, but you can also try finding local figure drawing classes, the zoo, a park, the bus, the car, airplanes, local monuments/downtown areas, the sky is really the limit.",
                            "score": 3,
                            "author": "amisamiamsam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much! Really means a lot. This is quite uplifting for me sense I’ve been so down and scared about my art ability so thanks again!",
                                    "score": 1,
                                    "author": "_ZellBell_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "no problem! you still have so much time to improve, and at times you need to become your biggest cheerleader. Keep at it!",
                                            "score": 1,
                                            "author": "amisamiamsam"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thank you this is so helpful!!",
                    "score": 1,
                    "author": "_ZellBell_"
                }
            ]
        }
    ]
}