{
    "id": "dmh9pd",
    "score": 5,
    "title": "Im sorry, but i need help/advise",
    "author": "The-Anselmo-Soto",
    "date": 1571927685.0,
    "url": "https://www.reddit.com/r/calarts/comments/dmh9pd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, Im a 16 years old kid from Mexico.Ive being in love with the idea of animation and that cutthroat industry. And my dream is to get accepted into CALARTS, and work hard for 4 years, to continue working hard for the rest of my life to make people happy. It's my destiny, I can feel it. Im a really passionate person-OK enough about me. Now to the point I've been reading everything there is to read about CALARTS online. I know every requirement and their standards. I'm basicallly all set, I practice on hours daily but.I just CANNOT shake away the feeling that I'm not good enough, and that I dont have enough time to inprove, specially with school. My biggest concern I have is that i won't be able to do my portfolio and sketchbook because of Highschool and that if i don't put enough time into it; I'll simply suck. To those who have been accepted/graduated. How was your approach to doing them, and is there any tips you can give me on time management or something. I really desperately need to know. Thanks for reading.(Im sorry if this may be off-topic)",
    "comments": [
        {
            "level": 0,
            "comment": "If it's important to you you'll find the time, no excuses. The school has the guidelines online they are very straightforward and a councilor is available over the phone or via e-mail .. You still have a couple years before your portfolio will be submitted so develop your strategy/style and how you will express/present that to the school. As for tips, submit your work not what others tell you you should do. You want to stand out, not be another cookie cutter animator",
            "score": 3,
            "author": "k2_jackal",
            "replies": [
                {
                    "level": 1,
                    "comment": "God, thanks. You're the first person that gives me that advise. It's normally worded diferently. But you're right. Ill keep it in mind. Thaaanks:D",
                    "score": 2,
                    "author": "The-Anselmo-Soto"
                }
            ]
        }
    ]
}