{
    "id": "fvn502",
    "score": 1,
    "title": "I have two questions for Calarts.",
    "author": "SlasherBandit",
    "date": 1586126877.0,
    "url": "https://www.reddit.com/r/calarts/comments/fvn502",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm planning on applying for CalArts 2021 soon, and I had two questions: 1. Are pets allowed to live with students in their dorms, at least the smaller ones? And 2. Do students get roommates, and if so, how does the whole roommate system work? Please and thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "You can only have service animals living in the dorms- no other pets. \nMost rooms are occupied by 2 students, but there are a few singles and triple rooms. They are assigned based on a survey Reslife sends out. Housing is not required for anyone.",
            "score": 2,
            "author": "amisamiamsam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see. Are Emotional Support Animals also forbidden to live in the dorms?",
                    "score": 1,
                    "author": "SlasherBandit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d check with Reslife. They might be considered service animals",
            "score": 1,
            "author": "amisamiamsam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see. I have one last question. Do students who aren't from/living in California but still live in the US have any special perks or restrictions compared to the California-bound ones?",
                    "score": 1,
                    "author": "SlasherBandit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No extra perks. The only thing is: Housing is limited. As long as you get your paperwork in time, this isn’t really an issue. Most people who want housing get it.",
            "score": 1,
            "author": "amisamiamsam",
            "replies": [
                {
                    "level": 1,
                    "comment": "u/amisamiamsam how is the dorm situation at CalArts? Are the rooms and bathrooms OK? Some of the videos and photos online are scary. I am considering attending in the fall but a tad nervous about the dorm situation - especially since I cannot see it in person with the COVID-19 closing campus. Have they been updated or are they gross and old. Thank you!!!!",
                    "score": 1,
                    "author": "mbnan2020"
                }
            ]
        }
    ]
}