{
    "id": "g4btiw",
    "score": 5,
    "title": "How seriously are letters of recommendation taken for the animation program?",
    "author": "shellllcityyy",
    "date": 1587318070.0,
    "url": "https://www.reddit.com/r/calarts/comments/g4btiw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know I need two letters of rec but I am afraid that I haven't taken enough art classes throughout high school and haven't kept in touch with my teachers.",
    "comments": [
        {
            "level": 0,
            "comment": "I'd say not a critical one in the admission process; your portfolio comes first, then the essay, then maybe the letter of rec/gpa. A general rule of thumb is to have one from someone who understands your artmaking process and therefore is able to talk about you as an artist, and the other from someone who can represent you as a hard working, nice, smart individual, so maybe from your employer/coach/mentor/teacher etc. \n\nIf you're struggling to find someone to write your letter, maybe you can take a couple online art courses and ask the instructors about writing one? Maybe email the admissions office, explain your situation and ask them if you can have both letters from someone who are not art-related.",
            "score": 4,
            "author": "qkrtjddmsrmfla",
            "replies": [
                {
                    "level": 1,
                    "comment": "So it doesn't have to be a school teacher then?",
                    "score": 2,
                    "author": "shellllcityyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it doesn't have to be from school teacher! Anyone who can vouch for you should be fine. I got both letters from my private institutor and mentor.",
                            "score": 2,
                            "author": "qkrtjddmsrmfla",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok!",
                                    "score": 2,
                                    "author": "shellllcityyy"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}