{
    "id": "ibsxvl",
    "score": 3,
    "title": "Graphic Design Alumni: Give me your honest opinion",
    "author": "[deleted]",
    "date": 1597719415.0,
    "url": "https://www.reddit.com/r/calarts/comments/ibsxvl",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's hard to ask this question in the right space to get the perspective I'm looking for, but here goes...\n\n**tl;dr**: Alumni, do you feel that when it comes purely to *the quality of your work* and *your graduating* *portfolio* (not the network you made, not the prestige of the name of your school) that it was worth the tuition (assuming $45k a year is a lot to you)? Since you were talented enough to get admitted, do you feel you would have gotten just as good on your own, given time and online courses? What would you do in my situation (read below)? I know there are scholarships, but I'm not betting on that happening.\n\n\\_\\_\\_\n\n**Context:** I am 27M, already have a degree, already well into another career. A few years ago, I fell in love with graphic design. I even took a hiatus to work as a designer of sorts. I went in knowing it was just a foot in the door, but the work I was doing just wasn't getting me any closer to the work I dreamed of—at best, I did milquetoast mock-ups of enterprise apps in a very UX/Research-ish role.\n\nI know for some that's great, but it just wasn't very visual or creative work. I wasn't learning skills applicable to what I wanted to do, and I wasn't making portfolio-worthy pieces. So I went back to my old career (it paid better), trying to plan a break for the real deal this time—on the side, no less—which has been... slow and frustrating.\n\nIn my search for something more, I've met designers who do what I want. They're all very encouraging, giving me tips and such. But my work quality just isn't there. My suspicion is the applicants are just like these nice people who give me tips: they went to competitive art schools, they put in the time (and money), and they're just better because of it. But no one says this out loud.\n\nLet's make an assumption that lets me hope: even if I'm less talented than some, I can still work hard (and get creative) to get somewhere good. Then I have two options: self-study or go to school. I'd like to think I can come up with a decent alternative to a quarter mil in debt, but maybe not. We all know it's not the piece of paper anyone cares about as much as it is the resulting portfolio. But will I be able to make an impressive one in reasonable time without going through a program?\n\nTo complicate things further, let's take into account that I do not have a place to stay for free in LA, and I am not independently wealthy, so I will be incurring living costs alongside tuition. Is it a bad idea to work while going to school to help mitigate those costs? It seems like it's hard enough just trying to make the most of your classes to become the best designer you can be.",
    "comments": [
        {
            "level": 0,
            "comment": "What do you want to do with your degree? UI/UX?\n\nAlso are you looking at the BFA program or the MFA?",
            "score": 1,
            "author": "jonjacquet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for reaching out. Realizing this is a slow sub and not much graphic design activity in particular lol.\n\nI already do UI/UX. Looking to do graphic/visual design with technical skills. I’ve got the technical skills (CS background, worked as engineer). I just don’t have the strong style and acumen I want in things like typography.\n\nLike I said, I’m ok but not great and it’s taking me a while to improve on my own. I get ideas and struggle to realize them.\n\nPlus I don’t have much of a professional network. Sick of working in the tech industry on apps. Was hoping attending a school would help me broaden out in that way too.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh ok. Yeah, if you were going for UI/UX I don't think I'd recommend this program because UI/UX is a very small part of what they offer but if you want to expand your knowledge and skills of Graphic Design then CalArts will absolutely do that.\n\nIt's an amazing program... But it's also very expensive.... but it's also worth it... but it's also very expensive haha... The price is hard to justify but at the same time I wouldn't have a fraction of my graphic design experience had I not gone through this program.\n\nIn fact, I was one of the few in my class that had a job during my years at CalArts. And  about 4 months before graduation I quit my job and immediately regretted not quitting year 1 because suddenly I had more time to do the work. And there is a lot of work. It's an intense program with lots of all-nighters. But the program really will broaden your vision. You'll learn about different methodologies for approaching a project, different analog and digital techniques, color theory, type theory (you mentioned you wanted to focus your typography skills.... you will). You'll learn how to talk about design which for people who learn on their own— it can be hard to convey exactly what a design is missing or why it sucks.\n\nAlso a critical part of the program is the studio space. Designers (in the same year) all work in one shared space. Everyone's in the trenches with you meaning lots of collaboration and giving and receiving feedback. Thinking not only about your own work but being inspired by your classmates around you makes for an environment that's hard to recreate.\n\nThe teachers are also solid. Critical but supportive. Sometimes they can seem cruel but they end up getting so much out of you. I still remember being ripped to shreds during my second year end of year review. But it only made me focus more the next year. I have a friend who went though a different design program and all the teachers had sunshine and rainbows in their eyes. He couldn't do anything wrong apparently, so he would run his projects by me if he wanted an honest look at his work.\n\nThe hard part is that there are many many designers who learn on their own and become very successful. I think it depends on how you learn and feel about your current methodologies. I started the Calarts design program when I was 26 not because I was necessarily bad at design but because I felt like I kept hitting walls with my (looking back) very limited design knowledge. \n\nIf you think maybe you can do it on your own I would say keep reading and researching and making and making and making. Now's the perfect time because I definitely wouldn't do this program during COVID. I think the group studio aspect is too important to miss out on and I assume they're not doing that and it's mostly online. Maybe I should have led with that? haha. My bad. \n\nHopefully this helps.",
                            "score": 1,
                            "author": "jonjacquet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very helpful! Thanks. I forgot to mention I’m considering the 3-year MFA program. I am... older than 26 (but not yet 30!). I would hope to start late next year if I get in.\n\nI’ve pretty much decided I’m going to try to get in to a good program even if it takes me a few tries, and even if I don’t get a decent scholarship. The only two I’m seriously considering are this MFA and ArtCenter’s. Do you have any insights on the latter? I’ve heard that CA is more of a fine arts program and AC more “pragmatic” while still emphasizing good style. I know both have been offering special tech-oriented minors and electives that are think are super cool.\n\nMostly depends on what I get into but I’ve heard good things about both.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah, I don't know much about ArtCenter, unfortunately.\n\nBut good luck with everything!",
                                            "score": 1,
                                            "author": "jonjacquet"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}