{
    "id": "ki2h52",
    "score": 25,
    "title": "I hope this will be my time.",
    "author": "mynameismace",
    "date": 1608631291.0,
    "url": "https://www.reddit.com/r/calarts/comments/ki2h52",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know... attending a certain institution won't grant you success, but I've always been magnetically attracted towards CalArts. I just submitted my application to CalArts Character Animation and this has been my third time (maybe last.) I've been having a lot of conflicting thoughts lately... I appreciate how much I've grown as an artist and as a human being, but I really wish I could finally be a student at CalArts. I know I'm good enough, I have put in the WORK to get to where I am today. Somedays it's really hard to keep pushing, but I can't let go of my goals and dreams no matter what... Letters come in March, and I pray this will finally be my time to lift off to the next level. Good luck to anyone else applying, you are strong and never give up. I'm typing this from my studio apartment at 2 A.M. in Los Angeles.\n\nUPDATE 3/22/21 - I was accepted. Never give up, I'm out. ✌️",
    "comments": [
        {
            "level": 0,
            "comment": "Same boat but I’m waiting to see if I’m accepted and starting in January. The wait... ugh!",
            "score": 2,
            "author": "truexbleu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good luck man. You got this!",
                    "score": 1,
                    "author": "knolifeblossom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m in!!!!\nMFA VoiceArts!!!!! Starting in January!",
                            "score": 2,
                            "author": "truexbleu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "AAYYYYY!!! So happy for you. Hope you enjoy your time",
                                    "score": 2,
                                    "author": "knolifeblossom"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best of luck!! You’ve worked so hard and whichever path takes place is going to be amazing!",
            "score": 2,
            "author": "shoebillmfs"
        },
        {
            "level": 0,
            "comment": "Any update??",
            "score": 1,
            "author": "truexbleu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I was accepted.",
                    "score": 3,
                    "author": "mynameismace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you feel being accepted?",
            "score": 1,
            "author": "toclosetoquestionit"
        }
    ]
}