{
    "id": "mnck0d",
    "score": 2,
    "title": "help with calarts bfa application process",
    "author": "liz6970",
    "date": 1617955887.0,
    "url": "https://www.reddit.com/r/calarts/comments/mnck0d",
    "media_urls": [],
    "other_urls": [],
    "postText": "i am so incredibly sorry if this is full of stupid questions, applying for university is apparently really stressful and im pretty much on my own trying to figure everything out. \n\ni am currently a junior in high school, i'll graduate in summer 2022. i want to apply to calarts for fall 2022, so immediately after i finish hs. i would be an international \nstudent, and would pretty much be relying on scholarships to pay for my tuition and other expenses. \n\ni am just a tiny bit confused regarding the entire application process, especially the finaid stuff, and i just wanted some advice \n\nas far as I understand, i would need to apply sometime in winter or spring, and receive my admission or rejection letter in march-april. i would aslo need to apply for finaid in late winter.\nafter you get accepted calarts im sure will provide information on what to do next, but i'd like to prepare beforehand. i'm guessing here they want you to send your english proficiency exam, apply vor the visa and show them proof of the fact that you have the financial means to attend their school. \n\nthis last bit is what im most confused about, and i would really really appreciate it if anybody could tell me if i got it right? they only look at your scholarships AFTER you get accepted right? and the english proficiency exam is also something you need to send only after being accepted (i know they want the exam centre where you took the test to send the results directly, so i'm guessing this is possible only aftwr you've been accepted, otherwise they'd just end up with countless random exam results from strangers). \n\nalso, what other costs are there besides the tuition and other fees that they have listed on their site? im pretty sure that stuff like housing and food and health insurance are all included in tuition and fees and my scholarships can pay for that, but i'm talking about other stuff i might have to pay out of pocket for? like textbooks, a laptop stuff like this \n\nlastly, i might have missed this but when are you supposed to apply for on campus housing and what are the requirements for that? i swear i didn't see much about that \n\ni know this is pretty incoherent and long-winded, but i would really appreciate some more info. if you can also only answer one of these please do, something is better than nothing. also are these things that i can email the calarts admissions email about? or is that for portfolio and admission requirements only \n\nTLDR: application procces and timeline confuses me, some questions i have\ndo i send the english proficiency exam results only after being accepted?\ncan i apply for scholarships now and if i get enough of them will i need to show proof of them only after being accepted? or am i missing something?\nany additional stuff i would need to pay for out of pocket besides the tuition and fees they list on their website?\nwhen and how do yoh apply for on campus housing?\ncan i mai the admissions email address with these sorts of questions?",
    "comments": [
        {
            "level": 0,
            "comment": "hello! i'm an international student that got accepted this year. i'll try to answer your questions to the best of my ability, so bear w/ me on this one:\n\n1. ***Do I need to apply for scholarships while applying?*** Yes, it is *encouraged* for you to look for **OUTSIDE PRIVATE SCHOLARSHIPS** that can support your education if ever that you do get admitted for the Fall 2022 semester. However, once you do get accepted to CalArts, you are automatically eligible for their institutional scholarships. Examples of these include the *Merit Scholarship*, which is awarded to the top 30% of each incoming class and the *Access Grant,* which I got, is awarded by each school based on their personal criteria. The Access Grants are also limited to each incoming class and vary based on one's eligibility. I personally got $16,000 per year, which will be carried over for 4 years ($64,000 in total) while a friend of mine got $5,000 however she did receive a $20,000 equity grant from the school as well. These institutional scholarships are renewed every year and you don't need to apply for each AY.\n2. ***Do I need to send my English proficiency test exam score after being accepted?*** No. You will only need it if the Office of Admissions asks you so. They will look at how proficient your English skills are based on the transcripts/artist statement that you'll be submitting. You can be waived for this (just like me lol).\n3. ***Are there any additional things that I would need to pay besides the tuition and fees?*** Yep. This will include your books, your meal plans (if ever you choose to dorm), and a damages fee (just in case you break something from any of their labs) that can be refundable upon graduation.\n4. ***When and how will I apply for on-campus housing?*** I can't answer this question to you yet, as my fellow accepted students and I haven't really received any information about housing except for a survey that was sent to us. Sorry :(\n\nADDITIONAL INFO:\n\nThey'll only ask for your Declaration of Finances along with your VISA status once you answer the decision reply form. Also yes, you can e-mail CalArts Admissions on these matters! Here's their e-mail: [admissions@calarts.edu](mailto:admissions@calarts.edu). I've also asked them similar questions when I was interested in applying just like you. Don't worry, you got this! Good luck and I hope to see you in Fall 2022! :)",
            "score": 4,
            "author": "deltashit",
            "replies": [
                {
                    "level": 1,
                    "comment": "hi, do international students need to fill in FAFSA? or is that just for us citizens",
                    "score": 2,
                    "author": "yuoopta73847",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "sadly, FAFSA is just for domestic students :(",
                            "score": 3,
                            "author": "deltashit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks sm for answering!! I wrote this half asleep when i woke up today so i really appreciate you taking the time to decode my post and reply so thoroughly. If you (or anyone else reading this) applied for us based private scholarships, could you please share them? They're harder to find then i expected, and most scholarships in my home country are much less substantial since the money exchange rate is. not good. \n\n\nAlso how reliable is the tuition &amp; other fees calculator on the calarts website? like if i manage to get scholarships of about 60 thousand dollars (which is what the calculator showed my total expenses would approximately be) will it be enough, or should i expect to need more than that? And approximately how much would you say you had to pay for the stuff that isn't included in the tuition and other fees? \n\nNot sure how well i worded these last questions, i guess i'm just asking how much money do you think i'd need in scholarships and then on top of that to pay out of pocket for other stuff that can't be covered by scholarships? I thought knew but everything is so expensive and the difference between like 60 thousand and 65 thousand is too big for me to just whip out if it turns out i need more, so i really would like to know in advance\n\nAnyway thanks again for your answer!!! It was very helpful :)",
                    "score": 1,
                    "author": "liz6970",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To answer your question on outside private scholarships, I'm still in the process of looking and finding scholarships that will help me! I'll be contacting my financial aid liaison if ever I do get awarded :)  However, I won't be able to answer your questions in regards to the reliability of the net price calculator and your cost of living in campus if ever you do get accepted. It's best to contact the Admissions Office for these matters. Hope that helps! :)",
                            "score": 1,
                            "author": "deltashit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeaah that's ok, thank you anyway. i was a little scared of contacting the admissions office in case my questions turned out to be rather daft, but it would definitely be easier if i got this sort of information directly from them and not some poor student that has to answer my endless stream of questions haha. Anyway thanks again for the help!",
                                    "score": 1,
                                    "author": "liz6970"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}