{
    "id": "p7qhl3",
    "score": 7,
    "title": "Job Placement",
    "author": "Bio_Bob_Official",
    "date": 1629416447.0,
    "url": "https://www.reddit.com/r/calarts/comments/p7qhl3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I have a couple of questions regarding job placement/employment.   \n1) How is job placement with CalArts? \n\n2) Does the school do a good job with networking opportunities or internship opportunities? \n\n3) If there are school-coordinated internships, is it common to pair up with businesses/entities in Santa Clarita? \n\n4) Do CalArts grads tend to stick around Santa Clarita for employment, or do they leave elsewhere?   \n\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "In regards to character animation -\n\n1. I don't have specific numbers but I know that, spitballing here, a third to a half of my class had some kind of job/internship by our third year. And those are only the people I was immediately aware of\n2. I don't think any other school does more to provide networking/internship opportunities than Calarts - they go above and beyond to connect their students\n3. School coordinated internships... not too sure. I know you can get jobs on campus and during the summer assisting professors with art-related stuff but it isn't too common. Santa Clarita is more of a suburban/bedroom community, most animation work is going to be down in the San Fernando Valley/LA, and increasingly more remote these days.\n4. Santa Clarita specifically? Im not too sure - IMO, since graduating most people are either out in the greater LA area or elsewhere. I know a few of my classmates are still in SCV tho",
            "score": 1,
            "author": "JamesHeelis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! If you don't mind me asking, in regards to point 2, do you have any specific examples of how CalArts connects their students with internships and network opportunities?",
                    "score": 1,
                    "author": "Bio_Bob_Official",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Calarts hosts an event called Portfolio Day each year in which the broader animation industry sends recruiters to the school to look over student work and hire them for projects. They also host talks by animators each friday during the schoolyear and students occasionally get hired that way. Most of the faculty in character animation are actively working in animation and may recommend students they see as potentially being valuable members to projects/directors in the industry. At the end of the year, Calarts hosts 'Open show' and 'Producers show' where the industry gets the chance to observe student films. Lastly, Calarts hosts their student's portfolios on their site - given that calarts has a reputation for producing prolific animators, this allows studios to quickly hire people from the school.",
                            "score": 1,
                            "author": "JamesHeelis"
                        }
                    ]
                }
            ]
        }
    ]
}