{
    "id": "bm8vwv",
    "score": 3,
    "title": "Accommodation Megathread",
    "author": "LewisI224",
    "date": 1557340231.0,
    "url": "https://www.reddit.com/r/heriotwatt/comments/bm8vwv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Either questions about on-campus accommodation or off-campus renting can be asked here. Also a place to look for other people to rent with.",
    "comments": [
        {
            "level": 0,
            "comment": "This sub seems a bit dead but I hope someone can give me advice. I’m an overseas student who’s just received an offer for a MSc program beginning this September, and I’m not sure how to go about finding accommodation. It’s not too late to find a flat, it it? What are the best websites to search apartments, and where do I find a flatmate? And what’s the best neighborhood to live in? Thanks in advance.",
            "score": 3,
            "author": "4Blu",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you're going into first year you'll have a guarantee of accommodation campus. Otherwise I would say you're definitely not too late to get a flat (Me and my flatmates don't have one yet). Good sites too look on are Rightmove and Zoopla for private flats or there's also a range of private student halls available in the city. A popular one for Heriot-watt students is Mill House. You can find a Facebook group run by the student union [here](https://www.facebook.com/groups/flatmateHW/) to find flatmates if youd prefer a private flat. Hope that's helped 😊",
                    "score": 3,
                    "author": "LewisI224",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, I’m in MACS too!\n\nThanks for the advice, I’ll definitely join the Facebook group. I’m trying to find a flat because I’m kind of over the whole dormitory thing. Do you think it’s absolutely necessary to see the property before I move in, as HW’s website says, or can I just (sub)lease sight unseen?",
                            "score": 3,
                            "author": "4Blu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean legally it isn't necessary I don't think but there would be a risk involved. I've probably went to see 5 or 6 flats and there's only one I had no intention of renting. All the other were perfectly good flats.",
                                    "score": 3,
                                    "author": "LewisI224",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you!",
                                            "score": 3,
                                            "author": "4Blu"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like this is gonna be super late, since I’m coming through clearing. Anyways. I’ve had my place confirmed at the uni for a couple days now (which in terms of clearing is quite a while), and it says the next thing to do is apply online for accommodation and stuff but the campus accommodation application site isn’t actually working with my ucas code and DOB even tho it should do by now... any ideas for a bit of advice?",
            "score": 3,
            "author": "spreadhummusnothate",
            "replies": [
                {
                    "level": 1,
                    "comment": "you can fire off an email to halls@hw.ac.uk and hopefully they should be able to sort it out. I wouldn't worry about accomodation running out unless you're after the cheapest one (£115? I think) in which case it's almost definitely all taken.",
                    "score": 2,
                    "author": "LewisI224",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeahh I’ve emailed them this morning. And I left a voicemail on the phone number so I guess they’ll get round to it whenever they get a chance. But Yeahh it was mostly about the whole running out thing. And nah tbh I was probably looking for one of the ones in a 5 person flat thingie. With the shared kitchen but your own bathroom. I’d have thought they’d be really popular so they’d be gone fast wouldn’t they?",
                            "score": 3,
                            "author": "spreadhummusnothate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm pretty certain in the £165 and £170 flats there's always empty rooms but the £140 ones do fill up. I know they keep some rooms available for clearing and conditional offer students though so there should be some £140 rooms left.",
                                    "score": 2,
                                    "author": "LewisI224"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have another, maybe weird, question - do we have the right to pin stuff like postcards, photos on the walls of our room ? Or do we have a pin board ?",
            "score": 2,
            "author": "Qwanties",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the contract has a bit about not putting anything on the walls but there is a pin board in every room for you to use as you please.",
                    "score": 2,
                    "author": "LewisI224"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do we have a possibility to know where is our room localized (first, 2nd floor etc) in the hall ?",
            "score": 2,
            "author": "Qwanties",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you have a 3 digit room number then yeah. The first number is the floor and the next two are the room. So 108 would be room 08 on the first floor. Hope that helps :)",
                    "score": 2,
                    "author": "LewisI224",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks a lot !",
                            "score": 2,
                            "author": "Qwanties"
                        }
                    ]
                }
            ]
        }
    ]
}