{
    "id": "jc33l4",
    "score": 4,
    "title": "New international student",
    "author": "[deleted]",
    "date": 1602821836.0,
    "url": "https://www.reddit.com/r/heriotwatt/comments/jc33l4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I'm applying for Heriot-Watt University, January batch and I'm pretty nervous about it. I have some questions about the accommodation, part time jobs and some other stuff. Would anyone please help me?",
    "comments": [
        {
            "level": 0,
            "comment": "Sure, ask away and I’ll try to help!",
            "score": 2,
            "author": "PPIInsurance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would I get a job in Scotland after I complete my course in finance? I mean are there sufficient jobs?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plenty of jobs but most are in takeaways etc",
                            "score": 3,
                            "author": "hjc135"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely, just drop your questions in the comments and we'll try to help",
            "score": 2,
            "author": "benlmao",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a graduate, going to study masters. Can I work in a finance firm part time based on my qualification?\nAnd what are some best part time jobs",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know much about being able to work in a finance firm as I am only an undergraduate, but I would assume if you are qualified, they are keen to take you on and it would timetable around your masters then I can't see why it wouldn't be feasible. And with part time jobs, there are so many in Edinburgh to choose from, I personally work in a supermarket and find it pays relatively well for the effort I put in",
                            "score": 2,
                            "author": "benlmao",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Has the covid situation affected the part time job market badly? Because if I come to edinburgh and don't get a job It'd get a bit difficult.",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah right, yes it has massively, I should have said that in my previous comment. We're still very locked down so at this very moment in time jobs are limited but *hopefully* should all blow over soon",
                                            "score": 2,
                                            "author": "benlmao",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am applying for the course in January so hope it gets better till then",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}