{
    "id": "1uooid",
    "score": 1,
    "title": "Is Goldsmiths as full of shit as \"But is it art?\" makes it seem?",
    "author": "poolus",
    "date": 1389154359.0,
    "url": "https://www.reddit.com/r/goldsmiths/comments/1uooid",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don't know if this place is dead, but...  I am a US looking at Goldsmiths for a possible MA in Anthropology.  The program seems great, but the hate on this subreddit is strong and that documentary I think exposes some real problems in the culture.  Are the humanities anything like what I see in \"But is it Art?\"  Lemme know.",
    "comments": [
        {
            "level": 0,
            "comment": "not really, you can get the odd student than can fit into that stereotype. From what i've heard about the anthropology though (mainly the BA) is that its going through a lot of changes that have made the course pretty shit, and its evident though teachers and students attitudes ",
            "score": 2,
            "author": "coleys",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info.  I suspected that the documentary was cherry picking a bit.  Can you elaborate on the changes in the anthro if you know any more?",
                    "score": 1,
                    "author": "poolus"
                },
                {
                    "level": 1,
                    "comment": "\"its going through a lot of changes that have made the course pretty shit, and its evident though teachers and students attitudes\"\n\nI'd be interested to hear about the kind of changes. I graduated last year, but didn't notice anything in particular. ",
                    "score": 1,
                    "author": "QuackCandle078"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2nd year BA Art student here. I can't speak for the humanities course itself but all the anthropology and culture studies students I've met seem happy and are nothing like the stereotype of students shown in the Documentary. \nGood luck with you decision.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fellow anthro student here. The university IS like that to a degree but you'll never meet those people, the humanities depts are like a whole different university, in my opinion. Goldsmiths is a good choice, full of stuff to do and there's usually some interesting anthro event going on. ",
            "score": 2,
            "author": "believethehype1",
            "replies": [
                {
                    "level": 1,
                    "comment": "awesome thanks!",
                    "score": 1,
                    "author": "poolus"
                }
            ]
        }
    ]
}