{
    "id": "rwis2",
    "score": 2,
    "title": "I just got accepted to Goldsmiths...Wondering what you guys think of the school?",
    "author": "GaryBuseyTeeth",
    "date": 1333732649.0,
    "url": "https://www.reddit.com/r/goldsmiths/comments/rwis2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Since I'm in the US its hard to get a sense of what the school is like beyond Goldsmiths' own press materials or figure out what kind of reputation it has. I got into a coupla fine arts schools, just trying now to decide which is best.\n\nSo I'm wondering...what do you guys think of the program/school in general? Is it a good community of people?",
    "comments": [
        {
            "level": 0,
            "comment": "It's hard to describe Goldsmiths. So here's some random words and reasons I have said about the place in my time there.\n\nHipster (a few people dress, act and talk like hipsters)\n\nDifferent\n\nSmall (a very small campus, nice if you like to know people and see faces regularly, not nice if you want to get away from that school-type life)\n\nCheap (cheap area of London for all sorts, still expensive just cheaper around New Cross and Lewisham but it does mean some areas are run down)\n\nSchool 2.0 (many students from London commute from family homes and miss out on the social life but there are many in halls, full every year)\n\nFriendly (Everyone is friendly here. Never had any problems!)\n\nFun\n\nMature (A lot of mature students here it seems)\n\nPolitical\n\nArty\n\n\nWhat are the other schools you have applied for? A few of my friends go to art schools and I could ask them what they're like for you. I don't study art so I have no idea what the course is like but I do know it is something Goldsmiths is well-known for.",
            "score": 6,
            "author": "cyport",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your feedback, I seriously appreciate it! \nI got into Pratt in Brooklyn New York, SAIC in Chicago, and PAFA in Philadelphia, so Goldsmiths is the only UK uni that accepted my application (applied to Slade &amp; GSA in Glasgow but wasn't so lucky with them, ah well). \n\nIt's really good to hear that its a smaller community and has a mature/friendly/political crowd, all of those are things I'm definitely looking for. It's maddeningly more expensive for international students so I'm just trying to do all my research and make sure I choose the right place to go into debt for :)\n\nOne last thing, and dunno if you would know this being that you're not in the art department - but is it almost exclusively conceptual art or is there some technical/traditional work coming out of there as well?",
                    "score": 1,
                    "author": "GaryBuseyTeeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem :) That's great if you are looking for those things in the college. I wasn't really so it was strange at first but it's not an issue any more. I don't know much about the art department I'm afraid but I think it's an independent course. Someone else here might know more.\nI have to say that's an amazing choice of places to go! ",
                            "score": 2,
                            "author": "cyport"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, I really really appreciate you taking the time to write this all out, this is definitely the sort of thing I wouldn't be able to find by just researching the school online and I'll definitely take it all into consideration. \n\nI did stumble across an article reviewing 'Goldsmiths, but is it art?' not too long ago and it raised some concerns since I'm more interested in developing skill in painting/sculpture etc than in making high-concept installations (or, for that matter, shoplifting things by swallowing them and shitting them out, is that for real?!!).\n\nI'm also glad you brought up money issues too, because thats one of my main concerns. They already charge international students significantly higher tuition, and the US dollar/pound exchange rate isn't working in my favor at the moment. I'm sorry its' been such a negative experience for you! But congratulations on finally graduating, and thanks again for getting back to me about this :)",
                    "score": 2,
                    "author": "GaryBuseyTeeth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's quite an amazing place, yes! \nPeople are really nice and friendly, something that I haven't seen as much in the rest of the University of London Colleges.\nThe art department is one of the best in the country. Just look at how many famous artists went to Goldsmiths!",
            "score": 2,
            "author": "timetopretend"
        },
        {
            "level": 0,
            "comment": "I think the university is a joke to be honest. I'm so glad that I've left. ",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea, that was the consensus I was hearing and I ended up declining their offer. Watching \"Goldsmiths, but is it art?\" was the real nail in the coffin for me",
                    "score": 1,
                    "author": "GaryBuseyTeeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah people are being overly grouchy, I was in the English department and it was FANTASTIC! But if you're doing art and it's not your flavour, it makes sense not to come.\n\nAll the ill-feeling in this thread makes it feel like some of these people went to an entirely different university to me!\n\nGood luck with your further studies :)",
                            "score": 2,
                            "author": "eepba"
                        }
                    ]
                }
            ]
        }
    ]
}