{
    "id": "11b12tk",
    "score": 4,
    "title": "Yale Financial Aid??",
    "author": "abitiouslynerdy",
    "date": 1677270263.0,
    "url": "https://www.reddit.com/r/yale/comments/11b12tk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Yale requested a verification statement of household Information. I heard that it might mean something but I don’t know???? I sent it in so im not worried and it seems they have updated things on my financial aid portal asking for other things as well.",
    "comments": [
        {
            "level": 0,
            "comment": "Just do it. Not sure what you’re even asking.",
            "score": 6,
            "author": "jtherese",
            "replies": [
                {
                    "level": 1,
                    "comment": "For anyone not sure what im asking, im basically wondering if it means anything that they asked for my verification statement because some people on reddit say it does.",
                    "score": 1,
                    "author": "abitiouslynerdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It means they need verification! Maybe some numbers didn’t line up or make sense in the original application, or there were some missing pieces. There’s no use reading into it just do what they ask and be truthful.",
                            "score": 6,
                            "author": "jtherese"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m gonna copy what I posted in another thread: \n\nAfter doing some CC ‘research’, a couple things:\n\nA) Requests for more financial aid info in REA often indicated acceptance. However, this was within a week or two before decisions were set to release.\n\nB) Sometimes, said documents contained a Yale student ID- which are for matriculated students. From what I heard there, everyone who got one got accepted.\n\nC) Finally, some students were able to find said SID by emailing the financial aid office and asking for it.\n\nHowever, since we didn’t have a SID yet, + the fact that decisions are still a month away, don’t take it as much yet. But I agree, at the very least it’s not *bad* news, so you likely at least haven’t been rejected *yet*.",
            "score": 3,
            "author": "jejwhduwiay",
            "replies": [
                {
                    "level": 1,
                    "comment": "What would you even say in such an email? Like bro pls give me an SID?",
                    "score": 1,
                    "author": "Vox65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My thought exactly. Better to just wait it out imo",
                            "score": 1,
                            "author": "jejwhduwiay"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take that as a good sign, tentatively. Did they email you, and for what doc?",
                            "score": 1,
                            "author": "jejwhduwiay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would think. What doc?",
                                            "score": 1,
                                            "author": "jejwhduwiay",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Domestic or int’l?",
                                                            "score": 1,
                                                            "author": "jejwhduwiay"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I received an email in March about missing financial aid documents before decisions came out and I got in. Same thing with Columbia.\n\n  \nDid you have a Yale ID in your email? If so, I think it means they are either highly considering you or already have you down as accepted. Otherwise, they would not have shared your information with the financial aid office!",
            "score": 2,
            "author": "lichar13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check your FAFSA. The government randomly selects student aid applications for a verification process and then schools ask for this form. Upload it into IDOC….",
                    "score": 2,
                    "author": "allpanicnodisco1986"
                },
                {
                    "level": 1,
                    "comment": "Doesn’t everyone have a Yale ID?",
                    "score": 1,
                    "author": "allpanicnodisco1986"
                }
            ]
        }
    ]
}