{
    "id": "1232qw8",
    "score": 0,
    "title": "Shocking Twitter post",
    "author": "OkFoundation4254",
    "date": 1679871197.0,
    "url": "https://www.reddit.com/r/yale/comments/1232qw8",
    "media_urls": [
        "https://www.reddit.com/r/yale/comments/1232qw8/shocking_twitter_post/"
    ],
    "other_urls": [
        "https://twitter.com/yakinik\\_tabetai/status/1639881687432667137](https://twitter.com/yakinik_tabetai/status/1639881687432667137?s=46)"
    ],
    "postText": "A student from Japan tweeted a post that describes an incident where she fell asleep in a dorm room with four male friends. When she woke up, she found that her hands and feet were tied with duct tape. According to her friends, they had done it as a prank. She panicked and shouted loudly. Although there was no real malice, she realized that if someone had malicious intent in this situation, she would definitely lose due to physical differences.\n\nThis was so shocking... at least to me.\n\nTwitter Link\n\n[https://twitter.com/yakinik\\_tabetai/status/1639881687432667137](https://twitter.com/yakinik_tabetai/status/1639881687432667137?s=46)",
    "comments": [
        {
            "level": 0,
            "comment": "Uhh, what's that gotta do with Yale? Also, I can't read katakana, hirogana, or kanji, so I'll just take your word for it.",
            "score": 14,
            "author": "Chief_Christmas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will put the text translated by Google.\n\n&gt; It was still spring break and my female friends hadn't returned to campus, so I was studying in the dorm room with four male friends, but I got tired of reading and fell asleep on the sofa for a few minutes. When I woke up with a strange feeling, my hands and feet were tied with packing tape, and I panicked and screamed, but my friend said it was a prank.\n\n&gt; They're all good people and I don't think there's really any malice in them, but if you're in a situation where there are four boys and one girl and you can't move your limbs while you're sleeping, you're bound to panic. In fact, in this situation, if the other party had malicious intentions, no matter how much I tried to resist, I would definitely lose due to the difference in physical strength.\n\n&gt; I thought I should be careful. Also, sleeping too deeply is dangerous at times like this, but there's nothing you can do about it.I thought I should be careful. Also, sleeping too deeply is dangerous at times like this, but there's nothing you can do about it.",
                    "score": -5,
                    "author": "OkFoundation4254"
                }
            ]
        }
    ]
}