{
    "id": "12d3dhc",
    "score": 27,
    "title": "Life at Yale",
    "author": "lgr4367",
    "date": 1680741006.0,
    "url": "https://www.reddit.com/r/yale/comments/12d3dhc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am a admitted student, and I am feel a bit nervous about coming to Yale. I was hoping to gain some insight from current students. \n\nI have done so much research, watched videos, etc. Based on these videos, people seem happy, but I just want to know the honest truth. I know it will be hard, but how hard to manage? I am pretty good with time management but majority of people are at Yale. I am asking this out of my nerves. I quite literally am scared of having to transfer out. (I know some people will respond to this saying, if you feel like you will transfer out do not come). I am up for any challenge, I just need to know what it entails. Are classes really that bad if you are not a STEM major? \n\nTo give some background I plan on majoring in Sociology but it is bound to change. \n\nAny insight about Yale is helpful to me!",
    "comments": [
        {
            "level": 0,
            "comment": "They wouldn't have admitted you if they didn't think you could handle it. I see looking at your post history that you're FGLI from a rural background, and maybe you're worried that you aren't prepared enough from your secondary education. I came from a similar situation and have done really well at Yale academically. It's definitely a struggle sometimes, but never even close to the point where I've felt like transferring out (and I'm doing CS). You'll do great! There are a lot of support systems (especially during your first-year) to prevent you from failing.",
            "score": 26,
            "author": "Plasmed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 1,
                    "author": "lgr4367"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You'll be fine. Everyone starts out with Imposter Syndrome. The classwork is not crushing - I was ChemE, one of the most intensive majors, and while there are definitely \"crunch times\", you'll still have plenty of free time.",
            "score": 20,
            "author": "Pandaemonium"
        },
        {
            "level": 0,
            "comment": "I'm an incoming Physics PhD student, and the impression I got when visiting for the open house is that there are more resources to support you than you can even imagine. You'll be fine if you make it enjoyable!",
            "score": 12,
            "author": "TinyTourist449"
        },
        {
            "level": 0,
            "comment": "I'm a rising senior. If you end up accepting, DM me and I'll introduce you to some of my friends. It's hard to break into social circles, and harder yet to find people you want to socialize with. It was legit a struggle for me my first couple of years, so I'd love to help anyone make friends at yale.\n\nSo yeah, even if someone other than OP is struggling, DM me homies. Worst case scenario, you don't vibe with them, and you're back where you started :)",
            "score": 9,
            "author": "SirWillyworth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also ik that in and of itself can be stressful! I won't blast you with a big group (dunno if I have enough friends to even get a big group lmao), I like to keep it small and friendly.",
                    "score": 4,
                    "author": "SirWillyworth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is so kind of you! I have noticed quite a difference between Yale and Harvard students. You all are so kind and welcoming!!!",
                            "score": 1,
                            "author": "lgr4367"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What a lovely offer. Pauli Murrays FTW!",
                    "score": 1,
                    "author": "housestarks"
                },
                {
                    "level": 1,
                    "comment": "This is so kind!! I just got accepted as a transfer from CC and I don’t know what to do 😭😭 it’s ucla vs yale for me",
                    "score": 1,
                    "author": "Humduhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a friend who did a couple years of college and some military stuff before transferring to Yale as well. lemme know if you want their digits!",
                            "score": 1,
                            "author": "SirWillyworth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes please!!! I would really appreciate that, I have no idea what I’m doing",
                                    "score": 1,
                                    "author": "Humduhh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "DM'd ya!",
                                            "score": 1,
                                            "author": "SirWillyworth"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You'll be perfectly fine, especially as non-STEM. Grade inflation is quite generous at Yale and I made it through as premed despite being a horrible procrastinator lol",
            "score": 2,
            "author": "Feels_tripper"
        },
        {
            "level": 0,
            "comment": "Yale is only as hard as you make it. A LOT of freshman feel like you do, it’s just imposter syndrome. The graduation rate is 97% and that includes a lot of students who were admitted for non-academic reasons. You’ll be just fine if you don’t overwhelm yourself. Take 4 classes your first semester including at least one that is just for fun. One step at a time and give yourself some grace.",
            "score": 2,
            "author": "Arboretum7"
        },
        {
            "level": 0,
            "comment": "The Non-stem classes here are FANTASTIC. In fact, I think Yale is best known for social sciences and humanities than Stem. \n\nIn fact, I was thinking of majoring in Econ, which is approached as Stem here, and after taking the introductory sequence I’ve realized that it does not come even close to the humanities and social science classes I’ve taken so far.",
            "score": 1,
            "author": "el_olvidador"
        },
        {
            "level": 0,
            "comment": "Hey, totally understandable! If you are not a Stem major, our Humanities/Social Sciences classes are AWESOME!!!!!!!!! Can't comment on STEM becz I don't really enjoy STEM in general lol. I've honestly learned so much from my classes, and they have definitely shaped my personhood + challenged many of my assumptions.\n\nAs for handling workload, it's really up to your own decision. You can take 3 classes first semester. Or you can take 3 classes that are relatively challenging (~3/5 on coursetable) and 1 gut (easy) class since adding all the classes up together, the workload can get a bit intense. Start small and build up to however you'd like to work. Don't worry! If you got into Yale, we have so many resources for you to use if you reach out for them! Profs are often understanding too.",
            "score": 1,
            "author": "IglooWater"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol wut….",
                    "score": 3,
                    "author": "lgr4367"
                }
            ]
        }
    ]
}