{
    "id": "12dcijq",
    "score": 2,
    "title": "Insight into Yale's two-year CS master's",
    "author": "Kingandpawnendgame",
    "date": 1680766502.0,
    "url": "https://www.reddit.com/r/yale/comments/12dcijq",
    "media_urls": [],
    "other_urls": [
        "https://gradschool.cornell.edu/financial-support/stipend-rates/).",
        "https://gsas.yale.edu/academic-requirements/teaching-fellows-requirements/teaching-levels-types).",
        "https://www.cs.cornell.edu/ms/admissions/applicant-faq"
    ],
    "postText": "Hello!\n\nTL; DR: I recently received admission to the fully funded two-year CS master's programs at Yale and Cornell, and I want to ask for some insight into the former and hopefully the latter. **Please read below for my comparison of both programs.**  \n\n\nRegarding stipend, Cornell's package is quite generous, equivalent to that for doctoral students. You can find the rate publicly available [here](https://gradschool.cornell.edu/financial-support/stipend-rates/). They also include additional health insurance not mentioned on that site. Yale's offer was for TF-20, whose rate you can find publicly available [here](https://gsas.yale.edu/academic-requirements/teaching-fellows-requirements/teaching-levels-types). Although unsure of its reliability, Payscale shows the COL is 11.2% lower in Ithaca than in New Haven (NH). Given these numbers, I believe the fiscally prudent option is evident.\n\nBoth have a roughly equal courseload distribution: about six classes interspersed with thesis research across the two years. Cornell, however, requires a minor and for one to be a \"top TA\" (not quite sure how achievable this one is :)) to maintain funding. There are some nuances to the latter: see [here](https://www.cs.cornell.edu/ms/admissions/applicant-faq#:~:text=Is%20financial%20support%20guaranteed%20while%20I%20am%20a%20student%20in%20the%20program%3F) if you are curious. Yale has neither of those requirements. In addition, they allow students that do not identify a thesis advisor in time to replace their thesis with coursework, presumably while keeping their funding. This is quite nice since advisors may not be as inclined to work with a master's student compared to a Ph.D. with a longer time commitment.\n\nChecking the CS offerings of both schools shows that Cornell has more classes spanning my research focus (distributed systems). Yale also offers a good number of courses in this field as well.  \n\n\nSo, what is your opinion of Yale CS, graduate study and NH in general? I would appreciate any insight, even better if you know about Cornell's program :)",
    "comments": [
        {
            "level": 0,
            "comment": "Former Yale CS undergrad here who did the combined 4-year BS/MS. I can't speak to the financial considerations so keeping that out of scope, and I'm also not terribly familiar with Cornell for CS graduate study besides general reputation.\n\nYale CS experience differs a lot between undergrad and grad. While I'd very enthusiastically recommend Yale for an undergraduate CS degree, the quality of the grad community and opportunities available for graduate study in CS at Yale are fairly limited, especially compared to a well-known CS graduate program like Cornell's. Most specific fields of CS will be covered only by a couple graduate classes and professors at Yale, so you may exhaust your options quickly. To be blunt, in most of our graduate classes the strongest students were usually the undergrads.\n\n\\&gt; In addition, they allow students that do not identify a thesis advisor in time to replace their thesis with coursework, presumably while keeping their funding. This is quite nice since advisors may not be as inclined to work with a master's student compared to a Ph.D. with a longer time commitment.\n\nAt Yale you shouldn't need to worry about this. Nearly every professor was happy to work with students (both BS and MS) in my experience and is was very easy to find thesis advisors.",
            "score": 1,
            "author": "KindlyReality3015",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the thorough response, much appreciated. After checking current and historical course offerings for my research interest, I am inclined to agree on your point of exhausting course options. In my experience, it was also a similar scenario at my university as very highly motivated undergraduates exhaust their CS curriculum and have to branch out to grad classes to learn more.\n\nBut it's heartening to hear that faculty are willing to advise non-Ph.D. students. Since you were also an undergraduate, your experience may differ but just out of curiosity, how was the process of identifying a thesis advisor? Also were you a Teaching Fellow? if so, could you speak to your experience as one?",
                    "score": 1,
                    "author": "Kingandpawnendgame",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Identifying a thesis advisor was pretty straightforward for me. There were a couple areas I was interested in researching further, so I reached out to three professors via email. I had taken courses with two of them, but not the third.\n\nI then met with all three in their offices to learn more about the type of research their labs were focused on and what projects might be available for a semester of undergrad research. All three professors had interesting projects to choose from, but ultimately I selected one and shared my decisions with the profs.\n\nI was a teaching fellow for three semesters. I generally enjoyed the role since I TAed for professors I liked and classes with interesting problem sets. Teaching any material is a good way to dive deeper into it, so I found TAing to be great for improving my own knowledge while giving back to the community.",
                            "score": 1,
                            "author": "KindlyReality3015"
                        }
                    ]
                }
            ]
        }
    ]
}