{
    "id": "12g94e0",
    "score": 20,
    "title": "Questions from a '27 Admit!",
    "author": "No-Dragonfruit-5409",
    "date": 1681015625.0,
    "url": "https://www.reddit.com/r/yale/comments/12g94e0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am so excited to be accepted to Yale for the Class of 2027, but not 100% committed because I have some hesitations, and I would love it if anyone could help me learn more about Yale with the questions below!\n\n* How is the LGBTQ community at Yale? This is something really important to me for college, so does Yale live up to the \"gay ivy\" name (specifically for queer women)?\n* I am from the west coast; how is the culture shock living on the east coast?\n* How is being pre-med at Yale? Are there supportive advisors and a non-competitive atmosphere, or not? Are there ample research and hospital opportunities? Is there a good or bad or good curve for intro bio/chem/physics classes?\n* What is the culture of Yale? Are students truly kind and collaborative, or is it a stressed-out culture?\n* Safety-wise, I have parents worried about the C+ rating on Niche for Yale safety. Is New Haven/Yale an unsafe area, and what advice do you have for students to be safe?\n* What is your least favorite and favorite thing about Yale?\n\nThank you so much 😌 I never got a yale interview, sooo this is my first chance to really learn anything from current/former Yale students.",
    "comments": [
        {
            "level": 0,
            "comment": "There is a tight LGBTQ community at Yale and a center too! If you get yourself involved in the community, they are the most inviting people you’ll meet. I have some friends part of the community! And outside of that- Yale is very accepting and no one really judges each other. \n\nThere is alot of advising, I was premed but I felt out of place because of the lack of preparation from high school but I know there is ALOT of resources. I also took 5.5 credits my first semester and wasn’t able to make Chem because my classes were very far apart so that’s my mistake, I also like public health more!\n\nI love Yale because we are more collaborative, no one is competing to get the better grade and honestly with who I’m around, no one ever talks about their grades or shares it. The only thing I have experienced is people telling me I probably did better than I thought, on that end really supportive. The professors don’t want you to fail either. \n\nSafety isn’t an issue, I think it’s more of a community stereotype and it’s not right for anyone to label a community of color dangerous. I walk around freely at like 2/3am and it’s fine.",
            "score": 10,
            "author": "Positive_Excuse_205",
            "replies": [
                {
                    "level": 1,
                    "comment": "what do you major in?",
                    "score": 1,
                    "author": "eithercryorpanic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure yet",
                            "score": 1,
                            "author": "Positive_Excuse_205"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Current Yale student. Let me try to answer a few of your questions the best I can:\n\nIn my experience, people tend not to give a fuck what your sexuality is. I haven’t seen many trans/non-binary people tbh but there are so many gay/bi students that nobody really bats an eye. If you’re looking for an LGBT+ community I’m sure you can find one, but most people just hang out with everyone. It’s not like high school where there’s a designated “gay clique.”\n\nPeople are generally less friendly that where I’m from (Midwest) but it’s not terrible.\n\nEh I don’t really like the STEM departments at Yale. Imo they seem more interested in concentrating their resources on the few USAMO prodigies than educating everyone.\n\nThe culture is the best part of Yale. Sure it’s a top school but the people are way more chill.\n\nYale is safe. The worst that will happen is beggars approaching you and asking for money.\n\nFavorite thing about Yale: the culture.\n\nLeast favorite thing about Yale: the day night cycle. In the winter the sun sets at 4 and most college students wake up late. That means you wake up, are stuck in classes all day, and then it’s already dark out. I think I got a mild case of seasonal depression during finals week it was so bad.",
            "score": 13,
            "author": "Flavorful_Water",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! I'm a recent admit and am considering majoring in applied math. Could you elaborate on your comment on the STEM department?",
                    "score": 1,
                    "author": "Silly_Philosophy_984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. Great! tbh you kind of know all the LGBTQ+ ppl directly or indirectly by the end of ur first year LMAO. In class and other moderated places, we often share our names + year + college + pronouns. But if you're looking to date, the circle is not that big.\n2. west coast best coast! more than diff in coastal culture, watch out for the weather. Seasonal depression is real. But for culture, Yale has a distinct culture in it of itself, so I would say it's more of a Yale culture shock you experience rather than an east coast culture shock. There's just so many diverse people from everywhere with so many diff interests, it's insane!\n3. not pre-med, can't answer.\n4. most students are kind and collaborative! i think we are less stressed out than the other ivy league schools, but you still have to work hard. Prob also depends on your major/field; if you're pre-med, you'll generally be stressed out anywhere lol. But I think people enjoy their time here at yale and go play outside and party etc.\n5. Ur experience will depend on how you present yourself, ex tall dude vs short fem. Also, on the time. Generally, during the day and esp on/near yale campus, you're completely safe. But at night (&gt;11pm), the further you get from yale, esp at yale's edges, you might wanna be a bit careful. Not to say anything will happen, but New Haven is a city. Honestly, I experienced a few weird stuff like being catcalled, asked out by a really old dude, etc. But when I'm walking with friends, people don't approach me/us so I recommend always walking with someone if you're going far out at night (&gt;11pm). I'm from the suburbs, so I've never experienced feeling scared going out at night before lol. It seems most people don't experience shit like that tho, and again, I'm not experiencing that on the daily LMAO. We do have escort walking by the yale police (free, anytime) if you want to use it; i've used it twice! (Essentially, while I agree with the others that yale is generally safe, I don't think it's *completely* safe).\n6. Least favorite: not rlly any affordable stores within walking distance, kind of middle class overpriced. Aka no target/h&amp;m/ulta/etc, but there is a CVS, whale tea (boba), etc.\n7. Most favorite: foods amazing, profs care, lots of support and resources, yale is what you want of it.",
            "score": 1,
            "author": "IglooWater"
        }
    ]
}