{
    "id": "135yqfp",
    "score": 2,
    "title": "Mansfield apartments bus stops",
    "author": "timeless1999",
    "date": 1683058098.0,
    "url": "https://www.reddit.com/r/yale/comments/135yqfp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI'm an incoming graduate student for the school of music, and have a room in Yale's Mansfield apartments. This question is for those who have lived/are living in those apartments, or otherwise have good knowledge of the bus system. \n\nI might completely be misunderstanding the shuttle system, because I've never had to use one before. But it seems like the Yale shuttle does not have a close stop to the Mansfield apartments at night. The closest one I can see is 10-12 minutes away, which makes me nervous as I'm a woman and would like to avoid walking that long in the dark at night, and possibly alone. \n\nIs there some service or stop that I am missing that would get me closer to my apartments at night, so I wouldn't need to walk for so long in the dark? Also with those apartments being seemingly so far from the University/downtown is it hard to use the bus system (or any other service I may be missing) to get groceries, pickup food, etc? What was your overall experience there like?\n\nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "After dark, the orange line converts to dropping people off by request all the way up to the divinity school. Otherwise, you can take the orange line to Edwards and Prospect.\n\nEdit: for your reference, you can catch the orange line any time of day at College and Wall St. That might be your most convenient pickup location when you’re going home.",
            "score": 5,
            "author": "TreeOfFinches",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check this page out and you can read more about daytime versus nighttime routes: https://gsa.yale.edu/compass/living-new-haven/getting-around-transportation-and-safety/yale-shuttle-system",
                    "score": 3,
                    "author": "TreeOfFinches",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!!",
                            "score": 1,
                            "author": "timeless1999"
                        }
                    ]
                }
            ]
        }
    ]
}