{
    "id": "13dv1p3",
    "score": 10,
    "title": "ENGL 120",
    "author": "taipeix101",
    "date": 1683734585.0,
    "url": "https://www.reddit.com/r/yale/comments/13dv1p3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! As an incoming first-year I've been looking through *ENGL 120: Reading and Writing the Modern Essay* syllabi from past semesters, and everything's so interesting! Some of my favorite pieces of literature are memoirs, essay collections, short story anthologies, and other forms of non-fiction like feature stories. The syllabi also mention authors I absolutely love, such as Jhumpa Lahiri, James Baldwin, David Foster Wallace, and Joan Didion. However, I have never formally been taught how to *write* because of how the education system in my country works. Sure I can Credit/D the class if I end up struggling, but would you recommend taking other introductory writing classes (ENGL 114 or an FYS) my first semester before taking ENGL 120? I will definitely take more writing classes to get used to the more \"academic\" style of writing, but the style of writing ENGL 120 covers is something I cannot wait to explore, and hence the question.",
    "comments": [
        {
            "level": 0,
            "comment": "You can start with English 120, especially if you’re okay not getting an A. I would just use coursetable to pick a professor that has a reputation for being helpful and supportive — the professor makes a huge difference for all the intro English courses.",
            "score": 7,
            "author": "NotAPurpleDino"
        },
        {
            "level": 0,
            "comment": "Ive taken 114 and 115, and while I cant speak on 120, I would say that 114/115 are both structured in a way that's very accessible, and very friendly in terms of grades. It's a straightforward process to learn a lot, and get a lot of practice writing and analyzing things. Drafts and feedback are really good too. Obv this depends on the instructor, but the English department at Yale, including the TFs, are very strong.",
            "score": 6,
            "author": "VanderVolted"
        },
        {
            "level": 0,
            "comment": "120 is a spectacular class.  Take it with Sexton",
            "score": 4,
            "author": "MrBulldog25"
        },
        {
            "level": 0,
            "comment": "ENGL 120 is amazing! It was one of the biggest influences on how I think about writing by making me pay attention to what I'm putting onto the page and why. I took it with Kim Shirkhani.",
            "score": 2,
            "author": "xquizitdecorum"
        },
        {
            "level": 0,
            "comment": "Great class! It’s a lot of personal essays so it doesn’t have to be “academic” so to speak. In fact my highest grades were on essays were I wrote comedy.\n\nI’d take it. I don’t think anyone gets lower than a B+ so it’s low stress too.",
            "score": 2,
            "author": "YungCereal"
        }
    ]
}