{
    "id": "13ujblh",
    "score": 3,
    "title": "skipping linear algebra?",
    "author": "u1121123211234321",
    "date": 1685330111.0,
    "url": "https://www.reddit.com/r/yale/comments/13ujblh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming freshman here planning on majoring in math (pure or applied idk) + either CS or economics.\n\nI took a full linear algebra course (year-long, proof-based, focused on theory) in high school my junior year, and have also taken a many electives in which I applied linear algebra (graph theory, quantum information, differential equations, etc) so I would say I have a pretty good grasp on the fundamentals of the topic. I also have very extensive experience in proof-based math in general (took proof-based classes on algorithms, number theory, and complex analysis as well).\n\nI looked at the MATH226 syllabus available on Canvas and the course topics seem very similar to the class I took. The textbook my school used (Axler's LADR) was also listed as helpful reading. As such, I'm wondering if it is worth taking an intro linear algebra class again in college? I'd rather be able to jump straight to MATH255/256 if I can, such that I have more room to take other classes that interest me.\n\nI know MATH225/226 is a required course for the math major (and maybe others?) but the math major FAQ says that I can potentially substitute my high school course for it if I provide the necessary materials. I have the materials, but my question is, would this be a good idea? Should I take it again anyway? I don't want to burn myself out first semester but I also don't want to be bored.\n\nThanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "You would probably be fine content-wise skipping 225/6, but I'd still recommend taking 226 unless you're very averse to repeating material -- it's a great opportunity to meet with other math-oriented students early on, many of whom will go on to be top performers in their majors (whether that be pure math, or physics, CS, etc).\n\nGiven your background though, it would also be a good idea to take a more advanced proof-based math class simultaneously, such as 350 (Abstract Algebra) or 345 (Modern Combinatorics). This combination of first year course + more advanced course was common for the more prepared students when I was at Yale (ex. those with USAMO/IMO backgrounds or serious exposure to math research through summer programs/camps). I would toss in S&amp;DS 410 (Statistical Inference) as a contender here too, if you want a serious proof-based class with a more applied flavor.\n\nDo feel free to DM if you have any follow up questions.",
            "score": 8,
            "author": "ladywindermeresfan"
        },
        {
            "level": 0,
            "comment": "Junior math major here. I took 225 as a first year, and I think it’s worth taking 226 even if you’ve seen a lot of the content before—for one, it might cover different or additional material, even if the syllabi are similar, and it’s a really good opportunity to make friends in the department. That’s not to say you won’t make friends in higher classes, but it might be worth it to sort of stay with your cohort. I made a lot of friends in linear algebra, and I’m glad I’ve continued to have classes with them.\n\nIt could also be worth it just as a refresher (linear algebra is everywhere, after all) or as a way to ease into college with slightly easier classes to start. \n\nGiven your experience, I don’t think you can go wrong either way—just my thoughts, feel free to ignore them entirely\n\nIf you have other questions about the major/taking math classes in general, feel free to dm and ask!",
            "score": 3,
            "author": "Magnusterra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who are you and why can I not guess who you are the current junior pure math major circle is regrettable small",
                    "score": 3,
                    "author": "thattophatkid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol my friend (freshman) took math 302, 350 with us in his first semester youre fine. I agree the hard stuff is interesting, but you will probably burn out at some point too if you just try to take all the intellectually interesting classes.",
            "score": 3,
            "author": "thattophatkid"
        },
        {
            "level": 0,
            "comment": "You sound extremely talented when it comes to math, and I'd say you should definitely skip it. Courses (especially introductory ones) are designed for the \"average\" incoming student, so outliers on either end will have various issues with them. I don't doubt you'll be able to figure out a concept you might have missed on your own down the line if need be either.",
            "score": 0,
            "author": "tell-me-your-wish"
        }
    ]
}