{
    "id": "3s9lrh",
    "score": 92,
    "title": "Anybody wanna sign my petition to make this our new mascot?",
    "author": "OpiatedDickfuzz",
    "date": 1447159412.0,
    "url": "https://www.reddit.com/r/yale/comments/3s9lrh",
    "media_urls": [
        "http://i.imgur.com/nHFk16c.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[\"our\"](http://imgur.com/V2NgvNC)",
            "score": 47,
            "author": "EuphoricNeckbeard",
            "replies": [
                {
                    "level": 1,
                    "comment": "http://youtube.com/watch?v=RUFT35S7Jb4",
                    "score": 16,
                    "author": "Impune"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's my favorite college in new haven. ",
                            "score": 6,
                            "author": "apalehorse"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "if i write a petition to ask people to stop spamming shit about an irrelevant nut yelling at a professor, will you sign that?",
            "score": 5,
            "author": "apalehorse",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are you canvasing this sub? What's your connection to Yale or the surrounding community? \n\nSubs are being bombarded by nonstop posts about this, reposts, vote brigading and histrionics because people like you are angry. But what you apparently don't realize is that nothing that you post reaches the people you are mad at. Instead, you're just bombarding subs with people who want to have normal conversations. Last night there were posts with such high quality content as - screw your shit SJW school.\n\nIf you really want to do something, write a letter to the editor of your local paper, set up a talk at your local library, donate money to the ACLU or Donald Trump, but don't kid yourself - right now you're just shitposting on the internet for upvotes.",
                            "score": 15,
                            "author": "apalehorse"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not irrelevant. She got him hired, she has a right to get him fired. She is a part of Yale leadership.",
                    "score": -9,
                    "author": "RecallRethuglicans"
                }
            ]
        }
    ]
}