{
    "id": "3salav",
    "score": 82,
    "title": "Fascism at Yale | The Harvard Law Record",
    "author": "fascismatyale",
    "date": 1447175427.0,
    "url": "https://www.reddit.com/r/yale/comments/3salav",
    "media_urls": [
        "http://hlrecord.org/2015/11/fascism-at-yale/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It would be interesting to replace 'fascist' here with 'puritanical.' We are often reminded that when English Puritans came to the Massachusetts Colony (and eventually founded Harvard), they came for the purpose of religious freedom, but what's usually left out of that narrative is the fact that their legal definition of religious freedom extended only to other Puritans. It did not grant freedom to Quakers or atheists. Dissent was punishable by banishment because dissenters were seen as a fundamental threat to the social order, an evil that could not be tolerated. \n\nOur 18th Century First Amendment was a revolutionary change, pun intended, but now, it seems that student protesters want to take us back to the 17th where certain utterances (should I invoke witchcraft, apropos of Puritans and Halloween?) have the power to cause harm at a distance. \n\nI've been paying attention to this trend, and I think there is a distinction between people working pragmatically on social justice issues and those for whom these issues have become a campaign for moral purity, a campaign that, among other objectives, purports to ferret out secret heresies in the words of the others. \n\n",
            "score": 40,
            "author": "Lycanthrowrug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brilliant comment. Now that you point it out, there are obvious parallels. It's a fine line, trying to make the world a better place by fostering acceptance and inclusiveness, and forcing the world into a \"better place\" through intimidating people into accepting and including. ",
                    "score": 10,
                    "author": "sjmdiablo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My current hypothesis is that those who conceive of social justice in terms of a quasi-religious moral purity campaign are utopians, and they see anyone they perceive as not being on their side as an obstacle to the realization of that utopia -- in contrast to activists who have specific, realistic goals and rational strategies for how to achieve those goals (like the people who mapped out and executed the same-sex marriage strategy). \n\nActivists with rational strategies know that they don't need everyone to agree with them to achieve their goals. Puritans cannot tolerate non-believers. \n\nThe irony at Yale is that you have a student screaming at a professor who's already essentially her natural ally -- if she had a plan that included allies she didn't want to alienate. ",
                            "score": 11,
                            "author": "Lycanthrowrug"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yale was founded as a Puritan institution. The students are living up to its heritage.",
                    "score": 3,
                    "author": "Guomindang"
                },
                {
                    "level": 1,
                    "comment": "Well said. For some reason the \"puritanical atheists\" are the ones that scare me the most --- they assume their moral purity is universal value beyond religion, and thus should be the sole purpose that humanity strives for. If you disagree, you are just not progressive enough and despicable for making pathetic compromises with the reactionary under the hood of pragmatism. ",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "10/10",
            "score": 17,
            "author": "-HeyBub-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can only give it 9/10 for not understanding what an ad hominem attack means.",
                    "score": 0,
                    "author": "billybobyale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I can only give it 9/10 for not understanding what an ad hominem attack means.\n\nWhy the hell should we listen to anything someone with a stupid username of \"billbobyale\" says?  it's a silly username and he probably smells bad too.  don't listen to him.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "isn't that ad hominem? ",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "um, yeah.  I was being ironic",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I now know to never trust a caramelized pistachio",
                                                            "score": 5,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "An argument against something attacking the person saying it, and not actually attacking what they are saying.\n",
                            "score": 3,
                            "author": "A_Bit_Of_Nonsense",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's more subtle and I find many people miss it. But here it goes: an ad hominem attack is when your conclusion is that they are wrong because of something orthogonal to the argument. But it is not the same thing as claiming they are wrong and following said claim with an exclamation about their character.\n\nExample:\n\n1) You are wrong because you are an idiot. \n\n2) You are wrong, you idiot. \n\n[1] is an ad hominem attack. [2] is not.",
                                    "score": 2,
                                    "author": "billybobyale"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is how you know this sub has been brigaded by non-Yalies... some shit from Harvard is getting upvoted.\n\nHey Harvard - only we get to call Yalies fascists!",
            "score": 13,
            "author": "quentin-coldwater"
        },
        {
            "level": 0,
            "comment": "Definitely worth reading! Thanks.  (And yes, the rivalry is ack'd at the start :-) )",
            "score": 11,
            "author": "jay314271",
            "replies": [
                {
                    "level": 1,
                    "comment": "Another HLS student (not the article's author) here. Looking forward to our football game against you guys. :) ",
                    "score": 4,
                    "author": "fascismatyale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am enjoying your user name.",
                            "score": 3,
                            "author": "jay314271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am enjoying your enjoyment of my user name. ",
                                    "score": 3,
                                    "author": "fascismatyale"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I will hate your teams forever but this was a great read. Thanks.",
                            "score": 3,
                            "author": "citybythesea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope everyone gets the moral of the story, do not #BlackLivesMatter.\n\nAny other form of such aggro-activism is toxic.  BLM, not even once.",
            "score": 9,
            "author": "cottonvillage"
        },
        {
            "level": 0,
            "comment": "I once attended a party where a third wave feminist was attending. I refereed to the group as \"guys\" and the third wave feminist proceeded to berate me and ended her abuse saying \"female superiority.\" \nLater on that year, one of her friends (who I have the misfortune of sharing a house with), decided to park in the drive way blocking my access to the street so I couldn't attend work. I got angry at her for this and I yelled at her. To get revenge, she got three suited thugs to show up later that night (the girl is attractive). The thugs proceeded to request that I leave my room, which I didn't. Anyways, fuck third wave feminists. ",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope are no third wave feminist living in Pittsburgh, everyone is a guy.",
                    "score": 8,
                    "author": "MutthaFuzza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From what I understand of the situation from people on campus, the protests were not actually in response to the Christakis email. Don't know if anyone can verify or refute the validity of that.",
            "score": 1,
            "author": "FishFilet1337"
        },
        {
            "level": 0,
            "comment": "While I disagree with the call for resignation, I don't think it's inherently fascist. If a professor had said things that were overtly racist, then calls for their firing would be appropriate.",
            "score": -15,
            "author": "mer_mer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the point is \"acting\" vs \"believing.\" \n\nImagine if you will, the worlds most polite racist. A person that fundamentally believes that, say, Scots are superior to Englishmen. Yet, this worlds most polite racist, always, and without fail, treats all Englishmen with dignity and respect, while maintaining his belief that they are somehow inferior. \n\nIf the actor doesn't disrespect or treat the Englishmen any different, should he be punished for it. In fact, many religious sects, predominantly the jewish tradition, do have elements of this in their religions, yet we oughtn't go try and bankrupt them if they treat everyone with respect and dignity. ",
                    "score": 17,
                    "author": "scoofy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Might want to edit: That Scots are fundamentally *superior* to Englishmen",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you",
                                    "score": 2,
                                    "author": "scoofy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "http://youtu.be/EX98LGnvc1E\n",
                            "score": 1,
                            "author": "hebsevenfour",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;[**Al Murray - Scots, Scousers and Geordies [5:14]**](http://youtu.be/EX98LGnvc1E)\n\n&gt; [*^ahenderson666*](https://www.youtube.com/channel/UC-ZMAB_XBrj518idRJsAb8w) ^in ^Comedy\n\n&gt;*^800,602 ^views ^since ^Dec ^2010*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)",
                                    "score": 1,
                                    "author": "youtubefactsbot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm actually very surprised that I'm getting pushback on this. A university hires professors on the basis that they are serious scholars that can be trusted by their students. Research and opinions of these scholars are implicitly and explicitly endorsed by the university. Think of all the headlines that say \"Yale researchers have found...\" and barely mention the people who actually did the work. \n\nUnfounded, overtly racist remarks would be cause to call a scholar's reasoning abilities into question, and to rescind the university's endorsement of their research. This is particularly true of this instance, where the professor in question is a sociologist, and issues of race are directly related to their research.\n\nAs an aside, as a Jew, I find this accusation of some sort of superiority complex specific to Judaism to be misplaced. Every religion involves a good deal of hubris to explain how they somehow have answers that no one else has. Judaism has this \"chosen people\" line, but most modern Jews (if they are even religious) see this as more of a responsibility or contract than an inherent superiority. For instance, unlike most other religions, Jews believe that it is basically harder for Jews to \"get into heaven\" than non-Jews. Jews must uphold all of the religious laws, while non-Jews only have to be good people.\n\nEDIT: by the way, acting on racist remarks, or making remarks that may incite action is hate speech. I think we can agree that the bar for getting fired should be lower than the bar for going to prison.",
                            "score": -8,
                            "author": "mer_mer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A university hires professors on the basis that they publish in high impact journals and get lots of funding. \n\nftfy\n\n",
                                    "score": 7,
                                    "author": "kicktothefinish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Too true.",
                                            "score": 0,
                                            "author": "mer_mer"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Let me start by admitting i am indeed an interloper, though i have degrees from Boston University and the University of Edinburgh if anyone needs bone fides. \n\nSo, I think you misunderstand me. I think most racist remarks should be grounds for dismissal if they are inflammatory and said to hurt people (think: Michael Richards), i do not however think that making other (debatably) racist remarks should be grounds for dismissal if they in the pursuit of truth (think: Larry Summers or James Watson (though Watson perhaps less so)), because we want to have an open society on campus where the pursuit of truth is paramount. \n\nHere we have a finer distinction, that i think should satisfy you.\n\nTo your dancing around the \"chosen people\" line, i think it's trivial to see how this could be considered offensive to many, especially more strongly held versions of more orthodox communities.",
                                    "score": 3,
                                    "author": "scoofy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then I think we are in full agreement. The original article implied that any time you call for someone's resignation when they are exercising free speech, you are behaving in a fascist manner. This is where I think it went too far.",
                                            "score": 0,
                                            "author": "mer_mer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So, this isn't an issue of free speech, again, it's an issue of open society. It's fine to call for someone's resignation for exercising types of free speech (see: Michael Richards). The article however, is explicitly talking about firing people for their beliefs, themselves (which is more along the lines of Larry Summers).",
                                                    "score": 3,
                                                    "author": "scoofy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This seems pretty clear to me:\n\n\nTactic | Fascist or Not Fascist? | Explanation\n---|---|----\nCalling for people to be fired for expressing their beliefs | Fascist | You are (1) calling for recriminations (2) for people expressing what they believe",
                                                            "score": 0,
                                                            "author": "mer_mer",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Here we have an equivocation then. If by \"expressing their beliefs\" we mean all free speech, then you're concern is warranted, but i don't think that's what they mean. I think they mean *literally expressing what one believes about the world*, which is inherently different than using language as a punitive measure to inflict harm. ",
                                                                    "score": 2,
                                                                    "author": "scoofy"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The Jewish religion says Jews are the chosen people. That's a fact man. ",
                                    "score": -2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We let theists teach science using the same argument",
                            "score": 0,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In this case nothing overtly racist was said. So the calls for resignation are fascist. ",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you that it is disturbing, but my point is that this kind of call for the firing of a professor exists on a continuum. In this case, I think it's ridiculous, but some students apparently feel that the email that was sent out was hurtfully racist. If they were right, then they would also be right to call for the professor's firing.\n\nAnyways, I'm just pointing out that sometimes there are gray areas, and we should be very careful when labeling either as racist, or as fascist.",
                            "score": -2,
                            "author": "mer_mer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How's that buddy? How does that not intrude on Freedom of Speech?",
                                    "score": 2,
                                    "author": "billybobyale"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Several days later, students disrupted an event held by the William F. Buckley, Jr. program that was designed to highlight the importance of free speech.\n\nThat is funny since the CUCKservative Buckley was a CIA asset whose mission was to neuter the real conservative movement since it stood in the way of the MIC.  ",
            "score": -4,
            "author": "buckmurdock"
        }
    ]
}