{
    "id": "5tgsf0",
    "score": 62,
    "title": "Calhoun College to be Renamed For Grace Hopper",
    "author": "Sentinal76",
    "date": 1486839928.0,
    "url": "https://www.reddit.com/r/yale/comments/5tgsf0",
    "media_urls": [
        "http://yaledailynews.com/blog/2017/02/11/calhoun-college-renamed/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So proud to be a Hopper today! Boola boola!",
            "score": 22,
            "author": "Pandaemonium"
        },
        {
            "level": 0,
            "comment": "Boola boola! Very pleased with this decision.\n\nLet's not forget the reasoning they gave behind originally choosing to keep the name: we don't want to sweep Yale's history under the rug, to just pat ourselves on the back and say \"we're so progressive, we've learned so much from our past.\" We're still learning. As President Salovey noted in his announcement, Calhoun remained a name for eighty-six years. I was at Yale during that time and while I hated John Calhoun, it neither occurred to me to change the name of the college nor how much a student of color might have had trouble living there. We all have more growing to do, more work to do.",
            "score": 17,
            "author": "TheRealmsOfGold",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; We all have more growing to do, more work to do.\n\nI think this is it. We aren't always right but we are always learning. In 100 years people might look at our era and say 'I can't believe immigration was a big deal', 'I can not believe the way they treated animals', etc. All of these could be true, it doesn't make us bad people today, but as our people grow and learn there are better people to honor in such a manner. ",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "What I found really interesting--aside from Salovey's gracious acknowledgment of his own error months earlier when he advocated against this decision--was that he also noted the apparent lack of any account for these considerations back when CC was first named. There's got to be more there, and I'd love to read more about that.",
                    "score": 7,
                    "author": "PhD_sock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I'd be curious to hear how the Witt report developed, and I expect there's plenty of transparency for anybody who asks. The part of President Salovey's announcement that resonated the most for me was that no strong arguments, under the Witt guidelines, were found for keeping the name — alongside the (perhaps more obvious) reasons for changing it.\n\nI remember my reaction reading the original decision: I went from \"You evil clueless Neanderthals\" to \"Whoa, hm, uh, that's actually very solid reasoning\" in about fifteen seconds. The \"solving this is more complicated than eliminating ugly monuments\" point is *really* good — I'm just glad they realized that we could face our history better and rename the college at the same time.\n\nBut I also remember being at Yale in the twenty-first century and hating John C. Calhoun — but, at the same time, never having either the thought\n\n1. \"we should rename the college\" or\n2. \"I wonder what challenges students of color face daily just living here\"\n\ncross my mind. In myself alone I see how much growth there still is to do.",
                            "score": 7,
                            "author": "TheRealmsOfGold",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I absolutely agree on all points. Calhoun's irrelevance to Yale is of course obvious, and the genuinely detestable aspects of the man himself are plainly recorded in his own words and deeds, which don't of course negate his more positive achievements. I wanted the name change simply because I found it unconscionable that, out of the hundreds of incredible Yale products, we continue to honor--and having a college named after an individual *is* a monument to that individual--a man who not only didn't have any particular connection to Yale, but was on top of that a particularly rotten human being. \n\nAt the same time, renaming and everything that goes with it is hugely complex, so I'm glad that Salovey took heat early on but remained committed to seeing this process through. It gives me (a non-white student, FWIW) some cause for hope to see real deliberation and care produce, in the end, a decision unquestionably correct, morally speaking. ",
                                    "score": 3,
                                    "author": "PhD_sock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean a Yale class valedictorian, who formulated his political opinions at Yale, learning the value of secession under a man who also has a residential college named after him, has no connection to Yale?",
                                            "score": 2,
                                            "author": "Forgot2TurnOffMySwag",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Either you are just shitposting or you're just shitposting.\n\n&gt;a Yale class valedictorian, who formulated his political opinions at Yale\n\netc. etc. describes literally hundreds of people over hundreds of years. It holds no particular relevance.\n\nAs for the rest of it: no, John Calhoun in fact does not have any particularly strong connection to Yale history. Certainly not in light of many others associated much more profoundly with Yale, and who never were monumentalized the way Calhoun was because they happened to be the wrong sex or the wrong color. ",
                                                    "score": 3,
                                                    "author": "PhD_sock",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Eh, I never liked Calhoun but I'm pretty sure he was the first Yale alum to become a major politician. That's a big deal. ",
                                                            "score": 1,
                                                            "author": "mutesa1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A bigger deal is that he was one of the worst shits to be produced by this country. Seriously, can we knock off the \"but but he did X Y\" it DOESN'T. MATTER because the rest of his gigantic asshattery completely obliterates anything good the dude may have done. He's a black stain on the pages of history and that's exactly what he deserves and Yale doesn't need to honor him when it can choose from so many better options. ",
                                                                    "score": 1,
                                                                    "author": "PhD_sock",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Calhoun, as most people will know, failed in his efforts to keep slavery alive. The most he did was own slaves and promote it in Congress. But if we call him one of the \"worst shits\", we must certainly look at the namesake of this college. Elihu Yale made his living trading slaves, but because he donated 417 books and nine bales of goods, he has a college named after him. At least Calhoun attended, and was even a valedictorian. Elihu Yale has even less of a connection than Calhoun; as far as we know, Yale never even saw the place.  But since Calhoun was more famous and prominent, it's totally fine to wear sweatshirts bearing Yale's name, have coffee mugs, and promote it to some of the family members of those Elihu enslaved? At least Calhoun College was confined to Yale; we've turned a notorious slave trader into a worldwide brand. How is that not worse? And don't tell me it's better because the school has \"eclipsed the man,\" it still bears his name. I don't think the fact that Yale University is more famous than Elihu Yale bears any weight with people in Chennai.",
                                                                            "score": 1,
                                                                            "author": "mutesa1",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So we'll rename Yale. What's your point? It's well-known that most institutions bearing the names of anyone that are more than a hundred years old or so are, more likely than not, named after white male colonial and/or imperialist assholes. \n\nI really do not see what literally any of your post--which states well-known information about Elihu Yale--has to do with Calhoun's deserved removal. ",
                                                                                    "score": 1,
                                                                                    "author": "PhD_sock",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To quote Salovey: \"Unlike other namesakes on our campus, he distinguished himself not *in spite of* these views but *because of* them.\"",
                            "score": 9,
                            "author": "Pandaemonium",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's a start. It's very possible that, in time, other buildings may also be renamed. Elihu Yale himself made his fortune off ill-gotten gains, so there are very good arguments there.",
                                            "score": 4,
                                            "author": "PhD_sock"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should actually look up, I don't know, Calhoun's Wikipedia page. ",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't know why you would jump to that conclusion. \n\nInteresting logic. ",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're reading pretty far into it. ",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm very pleased to learn this. I never thought there was much of a choice though!",
            "score": 16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. You guys just want to erase history, don't you. Frankly, a university is the last place people like you should be.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yah but to be honest, the brand recognition is so strong with Yale I doubt they'd ever even consider it.",
                    "score": 3,
                    "author": "vanillacupcake4"
                },
                {
                    "level": 1,
                    "comment": "TIL",
                    "score": 1,
                    "author": "Supreme_panda_god"
                }
            ]
        }
    ]
}