{
    "id": "o38a51",
    "score": 55,
    "title": "We need to normalize struggle at Yale - please watch my story and join the cause or share",
    "author": "graceable",
    "date": 1624077504.0,
    "url": "https://www.reddit.com/r/yale/comments/o38a51",
    "media_urls": [
        "https://www.reddit.com/r/yale/comments/o38a51/we_need_to_normalize_struggle_at_yale_please/"
    ],
    "other_urls": [
        "https://www.youtube.com/watch?v=F9HVcwN_tgU",
        "https://www.facebook.com/groups/153781646632170"
    ],
    "postText": "Yale can be great, but it's a pressure cooker. On behalf of a newly formed alumni group, Elis for Rachael, I'm looking for people to contribute to a short-video compilation about personal experiences with struggle, particularly struggle at Yale.  \n\nMy own story is about depression, hospitalization and withdrawal and ends with some words of encouragement and solidarity. It's five minutes. I'm putting it out there in the hopes I can get others to join with their own stories, and from there we can make some waves! \n\nhttps://www.youtube.com/watch?v=F9HVcwN_tgU\n\nPM me if you are interested in submitting a brief video or written testimonial (3-5min). Or email me at yalewellnessreform@gmail.com\n\nElis for Rachael is a group formed in the wake of Rachael Shaw Rosenbaum's death by suicide, made up of Yale alumni, current students, and Rachael's loved ones. Our goal is to support students in their calls for mental health policy reform.\n\nAlumni, students, and family are welcome to join: \nhttps://www.facebook.com/groups/153781646632170",
    "comments": [
        {
            "level": 0,
            "comment": "What a kind message.  Thank you for sharing.",
            "score": 3,
            "author": "one-who-bends"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Understandable. But on the other hand, the other schools you were considering were probably also high powered places with a similar high stress / hyper-achievement culture. Yale, IMO, is long overdue for substantive improvement to some of its mental health policies. That said, I know many people who truly loved their time at Yale, and I wish you the same.",
                    "score": 31,
                    "author": "graceable"
                },
                {
                    "level": 1,
                    "comment": "i see these same posts for my state school. it’s an issue wherever you go and seeing people take action on it should reassure you that your classmates will be caring people",
                    "score": 7,
                    "author": "dearwikipedia"
                }
            ]
        }
    ]
}