{
    "id": "u20x4k",
    "score": 31,
    "title": "general advice for prefrosh asking about majors and degrees",
    "author": "mekade24",
    "date": 1649775116.0,
    "url": "https://www.reddit.com/r/yale/comments/u20x4k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Everyone enters Yale undeclared for a reason. When you get to campus you are going to be inundated with advisors and mentors who are trained to help you figure this stuff out. It's great to look at course listing and major requirements before coming to Yale, but chances are you are not going to end up in the major you thought you would before you came to campus- most people don't and that's a good thing. Have fun exploring course search, but don't stress about it because you literally have years to figure that out. Same with dual degrees and double majors, which you can declare your junior and senior year.\n\nAlso, you're going to be stressed about your major for four years- why start now?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes! Thank you! Also reposting what I’ve commented on eleventy-seven different “Can I double major in X and Y??” posts)  \n\nLPT: you don’t have to major in something to have a fulfilling educational experience in that topic. You can always take the classes that interest you rather than just to meet the major requirements.  \n\nI promise you, having a paper that says you met two different sets of requirements isn’t nearly as exciting as being a “double major” sounds",
            "score": 19,
            "author": "bulldog1425",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also (someone correct me if I am wrong) but your \"piece of paper\" will only include one of the majors: your transcript will contain both, sure, but your diploma will only display one. More of a symbolic gesture than anyone else, but I think the messaging behind that is important",
                    "score": 8,
                    "author": "gp_13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you recommend going about picking classes for the freshman fall semester? And do freshman fall classes have much bearing on things later down the road (like access to internships/research, availability of various majors, post-grad admissions, etc.)?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you're leaning STEM, there are pre-reqs that most STEM majors require, it's good to start on those first year. If you find that you are no longer vibing with STEM (like I did), it's not much of a loss, you've got your STEM distributional reqs at least mostly out of the way. If you are leaning humanities, you can honestly take a variety of classes that sound fun to you to figure out what exactly you like and might want to commit to. Definitely would suggest getting into a first year seminar at some point too! I don't think your first year course decisions will really affect you down the road, you don't need to stress whether a first year course will look good for post-grad admissions and stuff like that.",
                    "score": 2,
                    "author": "clever_rosebud"
                }
            ]
        }
    ]
}