{
    "id": "uebjes",
    "score": 8,
    "title": "How Competitive is it to get into the Global Affairs Major?",
    "author": "russian-rabbit",
    "date": 1651198800.0,
    "url": "https://www.reddit.com/r/yale/comments/uebjes",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm choosing between Princeton (planning to major in the School of Public and International Affairs) and Yale, where I'm planning to major in Global Affairs. I've recently discovered that admissions into the Global Affairs is \"competitive.\" How competitive is it and is it possible for me not to get into the major (I listed it in first place when I applied)?",
    "comments": [
        {
            "level": 0,
            "comment": "i don't think it's that competitive. i'm not a global major, but i've only ever met two people who applied and didn't get in versus the dozens i know who applied and did. that's anecdotal, though, so take from it what you will. (but whether or not u listed it on ur application won't make a difference.)\n\non a different note, i highly, *highly* advise not basing ur decision on princeton vs. yale on global alone. i came into yale seriously dead-set on studying global, took two classes in the department, and decided it wasn't for me. ur academic interests will invariably change throughout college, so please don't weigh ur major too heavily picking a school! \n\nbest of luck &lt;3",
            "score": 17,
            "author": "tinybirds_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for replying! Definitely helpful.",
                    "score": 2,
                    "author": "russian-rabbit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not *too* competitive, I can't think of anyone I know who got rejected. Whether you listed it on your application will not weight into any sort of decision.\n\nI will also second what u/tinybirds_ said in terms of deciding between colleges. Most Yalies change major, and you are unlikely to be unique in that regard. Other factors (academics in other fields you're interested in, social life, location etc etc) are v important.",
            "score": 3,
            "author": "Islamism",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hence why they're applying. No competition is basically a participation trophy.",
                    "score": 1,
                    "author": "wooton6777"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're actually Russian, you should stay away from global affairs. You might hear some things that aren't Putin's propaganda.",
            "score": 1,
            "author": "wooton6777"
        }
    ]
}