{
    "id": "um1xan",
    "score": 21,
    "title": "Has anyone here done the First Year Scholars at Yale (FSY) program?",
    "author": "cerprus",
    "date": 1652131936.0,
    "url": "https://www.reddit.com/r/yale/comments/um1xan",
    "media_urls": [],
    "other_urls": [],
    "postText": "title. Has anyone done the program before? It seems great but I feel like it’s a lot of added stress for what was supposed to be a super stress-free summer.. any thoughts? Did anyone like/dislike? Thanks :)!",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! I did FSY last summer and it was so amazing :D definitely helped me prepare a lot for Yale and you get to meet so many amazing people. In the end, I think it’s extremely worth it and you’ll make so many great memories considering it’s in person this year",
            "score": 13,
            "author": "Intelligent_Bit3332",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since you were being graded in the classes, how stressful was it? Were the professors more lenient since it was the summer? Did the majority of people get As in both of their classes (English and Math)?",
                    "score": 2,
                    "author": "rqr124",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmmm to me it was definitely stressful at times but a lot of it was very manageable. I think one of the great things that FSY does is to make sure that we are adequately supported throughout the summer, especially considering the various backgrounds that all of us are coming in with! My Professor always made sure to be readily available to meet during office hours and we are assigned a writing partner that is there to help us through the process and provide feedback. As far as I know, the majority of people did receive A's and the lowest I've heard of someone getting is a B. Overall, the professors are very understanding of things and will be there to support you :)",
                            "score": 2,
                            "author": "Intelligent_Bit3332",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, this may sound like a stupid question, but does Yale cover room and board too? Like did you have to pay for food or pay for a room?",
                                    "score": 1,
                                    "author": "Imgettingtfoutofhere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry for the late response, but yes! FSY is completely all expenses covered :)",
                                            "score": 1,
                                            "author": "Intelligent_Bit3332"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "thank you sm for the insight :)",
                    "score": 1,
                    "author": "cerprus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did FSY back in 2019 and it was the best way I could’ve spent my summer before first year! It really allowed me to be comfortable at yale as a FGLI student, and the 1.5 credits I got from it were super important to my later semesters (decreasing workload). Highly recommend!",
            "score": 11,
            "author": "clever_rosebud",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, and most of the friend groups from my FSY cohort I still see hanging out together around campus! I was a more floaty person, but I’m still close with two of my FSY friends and I hang around a few others occasionally as well :)",
                            "score": 1,
                            "author": "clever_rosebud"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anybody know how difficult the courses are? I'm not sure how well prepared I am for strong rigor, especially considering how this summer was supposed to be the last one we had in a while where we were free and all",
            "score": 3,
            "author": "Automatic-Minimum-11",
            "replies": [
                {
                    "level": 1,
                    "comment": "the understanding i have of FSY through the first-years i’ve worked with is that, while FSY takes up part of your summer, it actually prepares you for the rigor you’ll experience at college. it’s a way to get ahead on credits so you can take it a bit easier your first year (and not worry if you need to drop a class or two) while acclimating you to the rigor at yale. it has the added benefit of providing social structure as well, where you are able to meet with a cohort of FGLI students and make friends prior to your first-year.\n\nninja edit: if it wasn’t clear, i would highly recommend doing it if you were invited to the program. i don’t think you would ever regret it.",
                    "score": 8,
                    "author": "TreeOfFinches",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much! This really was an insightful answer. I'm convinced that this would be a great opportunity, but I just have a few holdbacks.\n\n1. Rigor. I'm not sure how rigorous the courses will be, which scares me as I would rather not start off my Yale academic career with a less than stellar start. Also, I'm not great at math and it's been a while since I've done real math work, so I'm worried about diving right back into headfirst this summer. On the flip side, it'd obviously help with the transition into Yale. As a side note, I don't know what major or path I want to pursue, so picking the right classes would be tough.\n\n2. Friends. I think that FSY would provide me with a great opportunity to adjust socially and make good friends at Yale, but I also have my friends back home. This is essentially the last time I get to hang out with them for an extended period of time before we all head our separate ways, and to spend my entire summer at Yale would break my heart. I've been looking forward to this summer where'd I be relatively stress-free where I'd spend a ton of time with my friends, and going to FSY would obviously cap that.\n\n3. Am I even guaranteed a spot? It seems more people were nominated than they have spots, so it'd be annoying if I were to accept my FSY offer only to find out I couldn't go. This isn't a real holdback tbh, just something that's crossed my mind lol.",
                            "score": 2,
                            "author": "Automatic-Minimum-11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rigor — If you do not do FSY, you will be much more bombarded come the fall. FSY is meant to provide you the structure to combat the rigor that you’ll face here, not to be some absurdly difficult program. It will help you make connections with professors, people in the FGLI community, teach you better studying techniques, help you access tutoring resources, and much much more. If you are concerned about rigor in general, you are much better off attending FSY than not.\n\nFriends - I can’t speak to this, other than to say that you will be very rewarded socially at FSY. Another commenter mentioned that FSY often leads to some of the longest-lasting friendships here, and from what I’ve seen/heard that is true. But if you feel that the best thing for you is to stay home and be with your friends, just do that. Speaking from the point of view of a college senior, what I have to say about that is a little callous but true — I only wish I had more time with the amazing people I’ve met here, and the people you’re meant to stay friends with from high school will stay your friends, regardless of a summer spent away. I understand though that as a high school senior I probably would have been concerned about the same thing as you.\n\nSpot - No idea how this works, but I’m sure other FSY participants in this thread can speak to it :)",
                                    "score": 3,
                                    "author": "TreeOfFinches",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much! Genuinely very helpful! \n\nI heard that there was a website where I could review courses at Yale, to see how hard it was or what it's about with a review of the professor. If true, could you pass me the link so I could check out some of the FGY classes?",
                                            "score": 2,
                                            "author": "Automatic-Minimum-11"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this^",
                    "score": 1,
                    "author": "cerprus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FSY is meant to prepare you for college courses, and the class that you do take is not meant to be super hard. The idea is to give you a slow introduction to Yale, and make sure you have some credits to fall back on, in case you need to drop a class during your first or second semester.\n\nI did not do FSY but I have many, many FGLI friends who did, and not one of them regrets it. They all had a beautiful time and consider it among their best Yale experiences---and also, they basically did no work the whole time. The FSY friendships are some of the longest-lasting at Yale. I would strongly strongly recommend doing it. PM me if you want more details or have more questions",
                            "score": 5,
                            "author": "EgoSumAbbas"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i don't think the class is that hard (at least my friends who did FSY describe doing very little work overall)",
                    "score": 1,
                    "author": "EgoSumAbbas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's encouraging! I'm a bit worried about math bc I haven't really done math in over a year, so I'm not sure diving headfirst into a math course would be a great idea.",
                            "score": 1,
                            "author": "Automatic-Minimum-11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, you'll have to take a math class at Yale eventually, right? Might as well do it in the safest and most supportive possible environment!",
                                    "score": 1,
                                    "author": "EgoSumAbbas"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it is a great opportunity and Bulldog Days wasn’t immersive enough for me – I want to make connections and feel confident when first year begins so hopefully it’ll go great and it won’t be too stressful!",
            "score": 2,
            "author": "SheyIsWatching"
        },
        {
            "level": 0,
            "comment": "Hi! I did FSY last summer and even though it was virtual, I still loved it! I took an ENGL 114 seminar on climate change and it was super interesting and engaging. My professor was quite lenient on due dates, especially when I had a death in my family. I also took the calc 2 class and although it was challenging, I felt supported by my professor and the TAs (super helpful!). FSY was definitely not easy for me, but I’m super grateful that I did it because it gave me a jumpstart on credits and adjusting to the rigor of college. I’m also still great friends with the people from my counselor group too!",
            "score": 2,
            "author": "sparklyunicorn32",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can we choose the math courses? Like statistics etc Or is it only calc?",
                    "score": 1,
                    "author": "SheyIsWatching",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You take a placement test to get placed into calc 1, 2, 3, or statistics",
                            "score": 1,
                            "author": "sparklyunicorn32"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did FSY 2019\n\n\nIt's a must-go if you get the invite: you really don't want to miss out. \n\nThey keep your schedule booked with deans and advisors to meet,  which is what added stress for me, but there are also a lot of structured fun days (like ropes course plus the beach). \n\n\nThe classes are only stressful in that they'll be your first Yale courses. The curriculum is only 1.5 credits (compared to an average of 4--5 credits a semester). They also significantly shorten the workload (our final research paper was only like an 8 page requirement) because of the timeframe. \n\n\nMeeting 75 people and getting to know campus before the start of your freshman year is an incredible headstart. \n\n\nAlso, keep in mind that this is essentially free summer school, which opens up your schedule for the later years. Only needing to take 1 more WR credit class after FSY was amazing.",
            "score": 2,
            "author": "Echo__227",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is super insightful and helpful, thank you!\n\nJust a few questions:\n1.) What's your background in math? I personally struggle a bit with math and it's been a while since I've done any, so I'm worried about going to FSY and struggling with it. Keep in mind I'm not sure what I want to major in and that I virtually have 0 experience with calc. Do you think I'll be able to keep up? Also, I'm not familiar with research papers. Did you mean 8 pages single spaced, 1.15 spaced, or double spaced?\n\n2.) Is there any place where I can get more info/reviews on the courses being taught (both FSY and Yale courses in general)? I feel like it'd be helpful for me to know what I'm getting into. \n\n3.) What is WR? I'm not super familiar on the distribution requirements and the terminology that comes with it.\n\nThank you so much!!!",
                    "score": 1,
                    "author": "Automatic-Minimum-11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1) I personally have a strong background in math and calc, but there's a placement test to sort into 3 levels of math. If it's the same as when I went, it's Statistics, Intro to Calc I, and Intro to Calc II. The math course was only half a credit, so it was pretty much just two lectures and a problem set a week then a final. There are sessions with ULAs (tutors for the course) every week to go over the problem set material, and you can work in groups on the problems, so you can reach out to your friends if you don't understand something.\n\nDouble-spaced 12 point, and by \"research,\" I mean the kind where you check out a bunch of library books and cite some authors to make your points, not like actual primary investigation \n\n2). Your FSY info should have an overview of the curriculum, and beyond that, you can use the website \"coursetable\" to find descriptions, reviews, and difficulty ratings on courses, or you can check out courses.yale.edu for a class description and syllabus\n\n3). Yale has a distribution system for graduation where courses may have an attached \"distribution credit\" that can count toward the total you'll need. \n\nYou'll need 36 normal credits to graduate (as in, just make sure you get 4.5 courses a semester), but you'll need some of those to be \"writing\" courses, some to be \"quantitative reasoning,\" etc. \n\nYou can check all this stuff on your \"Degree Audit\" page on SIS, which I think you can access even if you have no declared major yet\n\nHere's a breakdown: \n\nWR:  Writing courses. These are usually assigned on the basis of whether a course will make you write about 20 pages of material, so they can be in any subject. Most students need 2 WR credits to graduate. FSY has English 114, which will give you your first. I did my second in a history class junior year. These are often seminars, so they can be hard to get into and you want to make sure you like the subject. (\"Seminar\" meaning the class size will be limited to like 20 people whereas a lecture can have 300)\n\nQR: Quantitative reasoning. I think you need 2? but I never paid attention to it. Any math course will give you one, but there are also some science courses that will. There are a few courses that kind of flub the designation that the humanities majors love to take to avoid much math. \n\nL: Language. There are specific intro language courses to take so you'll know them. Most people need 3 semesters of one, but if you place into a high level at the start then it's fewer. These classes are a pain and a half because they meet 5 days a week and have daily homework and class participation. Needs to be completed by the end of your junior year. You can take an online placement test before the start of the semester if you want to start at an intermediate level in a language, or you can start learning an entirely new language at L1. \n\nThe others are more subject distribution than work-type distribution: \n\nSc: Qualifies as a science class \n\nSoc: Qualifies as a social science class \n\nHu: Qualifies as an arts &amp; humanities class. \n\n\nThey use these just to make sure you get enough exposure. Most courses will have a subject designation like that, but fewer courses satisfy the work-type ones above. You can use coursetable to filter courses by the type of distribution credits they have when you start to schedule your first semester.",
                            "score": 1,
                            "author": "Echo__227",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a final for any math class that you would choose? Is there also a final for English, or is there just a final paper? (This is pertaining to FSY’s courses)",
                                    "score": 1,
                                    "author": "rqr124",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Specifically for FSY, I believe the curriculum is set so that all attending students have the same workload and frequency. \n\n\nMy year was a problem set every week, a final in math, and three papers to write, at like 5, 6, and 8 pages.",
                                            "score": 1,
                                            "author": "Echo__227",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Would you say it’s totally doable to get an A in both classes as long as you attend office hours and get the help you need?",
                                                    "score": 1,
                                                    "author": "rqr124",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think most people got As in both classes",
                                                            "score": 1,
                                                            "author": "Echo__227",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m planning on taking Calc 2 if I attend. If you took it, do you have any thoughts on the class or pieces of advice for it? Thank you for the quick responses btw. It’s extremely helpful",
                                                                    "score": 1,
                                                                    "author": "rqr124",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I recall the course being almost entirely focused on summation series and Taylor approximations\n\n\nIt may be helpful to review the notation for a discrete summation series\n\n\nJust make sure to take notes in class and try to work on the psets as a group. Also, you'll have to scan in your work, which can be done at most of the Yale printing locations, so be on the lookout for the big black scanner-printer machines",
                                                                            "score": 1,
                                                                            "author": "Echo__227"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This was insanely helpful, thank you so much!! Definitely referring to this when selecting my courses this fall. \n\nThis was supposed to be my last stress-free summer where I had no obligations and could hang out with my friends, and it seems like a real shame to give that up on such short notice given I've looked forward to this summer for many years now. In general, how manageable was FSY for you and your classmates in terms of workload and stress? As I stated earlier, I am worried about not being able to keep up in the math course...",
                                    "score": 1,
                                    "author": "Automatic-Minimum-11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The maths courses literally won't be an issue. Everyone got the psets done pretty quickly. \n\n\nWriting essays in such a short time interval when your days are booked with activities from 9 a.m. to 9 p.m. in addition to daily class readings was hella crunch, but ultimately better to get that done when you have nothing else going on than to do it in your freshman year. \n\n\nFSY starts in like late June and ends a few weeks before school (unless you also want to join a Camp Yale program, which is advisable), so you'll still have like a month of summer to goof around with your friends. I remember having like a week of sleepovers with my buddies to get 100% completion on Spider-Man PS4 before I left.  \n\n\nFSY is definitely about the most fun thing you can do with your summer. It's more work, but that work is also *engagement*, ya know? Like personally, I much preferred writing essays in the common room with my friends than what I would have been doing at home, which is sitting alone playing video games for 12 hours a day.  There's also an activity about every week, like water balloon fights or the ropes course and beach trip.",
                                            "score": 1,
                                            "author": "Echo__227",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was genuinely 50/50 coming in here, but your consistent replies and unending advocacy has me leaning pretty heavily towards going. Thanks a ton!\n\nEdit: but just in case this changes anything in terms of how manageable you think I'd find it, I have no real background in stats or calc. Like I couldn't solve a single integral or derivative...",
                                                    "score": 1,
                                                    "author": "Automatic-Minimum-11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You'll probably go into the Intro to Calc I course, which shouldn't require any prior experience with it\n\n\nNobody has any prior experience with stats, but it's supposedly the \"gut\" math course (the one you take if you really need a math credit but you hate math)",
                                                            "score": 1,
                                                            "author": "Echo__227",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "LMAO, I'm prolly gonna be one of those people you mentioned earlier who attempts to take QR classes that aren't even math lol\n\nAny advice on whether I should pursue stats or calc 1?",
                                                                    "score": 1,
                                                                    "author": "Automatic-Minimum-11",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Intro Calc I would probably be the best if you plan to take Calc I at all in your undergraduate career, but it is very much heavy on modeling word problems and such\n\n\nI don't know much about stats-- I think the full semester course incorporates Python programming, but I don't recall that being a part of the summer intro. I believe that class was more number crunchy in the psets-- like, the math is easy but tedious, whereas in the other classes, the math is a little complex to think about but not too many calculations\n\n\nThis is entirely variable based on the year, but location could be a factor. In my year, the calc classes were in the Poorvu center of Sterling Library (a five minute walk from our dorms in Ezra Stiles), whereas the S&amp;DS kids had class on Science Hill (~20-30 minute walk) and they hated that",
                                                                            "score": 1,
                                                                            "author": "Echo__227",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Once again, thank you! Not to be cheesy, but I genuinely believe that people like u who are so helpful and kind (towards a complete stranger on the internet in need of help) are what makes Yale Yale. Greatly appreciated",
                                                                                    "score": 1,
                                                                                    "author": "Automatic-Minimum-11"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh also, are we able to select which English class we want to attend? If so, is there a limit to each class? Or are we randomly assigned?",
                                    "score": 1,
                                    "author": "Automatic-Minimum-11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They're all the ENGL 114 *designation* because the workload and format is the same, but you'll get a choice between what the *subject* is.  \n\n\nFor example, in my year there were 6 classes taught by 6 professors. I opted for one that was about narrative structures, so we'd have to read excerpts about narrative elements and wrote an essay over the movie Memento. Other classes were about like, American agriculture and food deserts or immigration. There's a wide variety",
                                            "score": 1,
                                            "author": "Echo__227"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You rank your top three (or that’s what happened in 2019) and most people I knew got their top choice (or second)",
                                            "score": 1,
                                            "author": "clever_rosebud"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey I had a question. For FSY, do you stay at the Yale campus the entire length of the program or how does that work? Like can you leave on days you don’t have any schedule events?",
                    "score": 1,
                    "author": "Disastrous_Report433",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can leave at will, just be conscious that there are a lot of events and they'll get pissed if you miss any of them\n\n\nI know a few kids went to NYC over weekends, and I stayed in an AirBnB with someone for a few days. \n\n\nYou just also have a group counselor who'll check up on you if you're missing from one of the events, so you can't play hookey on anything",
                            "score": 1,
                            "author": "Echo__227",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. Would you say the workload is difficult to manage if you’re not there as often. I’m only thinking of leaving on days where the schedule has no planned events.",
                                    "score": 1,
                                    "author": "Disastrous_Report433",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The workload will probably be the same to handle, but there aren't many days without planned events",
                                            "score": 1,
                                            "author": "Echo__227",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I understand. Last question, do you stay in the regular dorms while you’re there and how does that work? Like how extensively do we need to pack?",
                                                    "score": 1,
                                                    "author": "Disastrous_Report433",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You stay in the regular dorms. In my year, we all had rooms in Ezra Stiles. Generally there will also be summer session srudents on campus. \n\n\nDefinitely pack minimally. Not worth it at all to decorate your dorm because 1. you won't be there often 2. time flies 3. it's not going to be your freshman year dorm.\n\n\nEssentially all you really need are stuff like bedsheets, towels, shower caddy, laundry bag, swimsuit, athletic wear, etc. You'll want a fan, but it's better to just get one in New Haven than try to pack one. You'll need paper and pencil and whatever you need to organize it (like a binder), which you can either pack or get from Family Dollar or Stop &amp; Shop pretty easily. \n\n\nThey should provide a list of everything you might need to remember to pack, but a lot of it will be pretty superfluous",
                                                            "score": 1,
                                                            "author": "Echo__227",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you so much, helped a lot",
                                                                    "score": 1,
                                                                    "author": "Disastrous_Report433"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}