{
    "id": "vfkc5h",
    "score": 6,
    "title": "CS and Math vs. Statistics and Data Science",
    "author": "BunnBunn12",
    "date": 1655602575.0,
    "url": "https://www.reddit.com/r/yale/comments/vfkc5h",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am considering which of these would combine best with a more social studies major to allow me to really explore quantitative finance and/or tech in the future. A couple specific questions:\n1. Does the CS and Math joint going into CS in enough depth?\n2. Does S&amp;DS gridlock you into specifically data science?\n3. Would it be worth getting a certificate in Data Science if I get the CS + Math degree? Vice versa?\n4. Are there significantly more women in either major? \n\nThank you so much in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "dont get too fussed up about the major. You can always count a class from another major towards your major. Also keep in mind that it's perfectly possible to take the same classes you would as a double major while only majoring in one subject. Advantage: learn the same knowledge and don't have to write an extra thesis",
            "score": 6,
            "author": "thattophatkid"
        },
        {
            "level": 0,
            "comment": "CS Math looks a little better for an application to a quant finance place, and a lot better for an application to a tech place. It's also more relevant to doing a job in tech, while CS Math vs Stats is kind of a wash in quant and either one could be more relevant depending on what type of quant stuff you specifically end up doing.",
            "score": 3,
            "author": "ardx"
        },
        {
            "level": 0,
            "comment": "S&amp;DS is significantly easier to complete than CS&amp; Math. Quant finance places do not care, they only care about your interviews. Tech places may care a tiny bit but also only really care about your interviews.",
            "score": 1,
            "author": "PM_ME_ROMANCEWORRIES",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which do you think would better prepare me for interviews?",
                    "score": 1,
                    "author": "BunnBunn12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CS &amp; Math, but it's extremely marginal. ~99% of the academic knowledge that's useful for the quant process and ~90% of the academic knowledge that's useful for the tech interview (SWE) process comes from taking a data structures course and an algorithms course. Neither course at Yale has restrictions on which majors can enroll in them.\n\nAs the other commenters have alluded to, you shouldn't stress too much about the seeming employability of your major. As long as your GPA isn't terrible, having Yale on your resume will be sufficient to get interviews almost anywhere.",
                            "score": 2,
                            "author": "ladywindermeresfan"
                        }
                    ]
                }
            ]
        }
    ]
}