{
    "id": "wswgj8",
    "score": 37,
    "title": "Tips for homesick/overly emotional international students",
    "author": "Firm_Law_4943",
    "date": 1660964231.0,
    "url": "https://www.reddit.com/r/yale/comments/wswgj8",
    "media_urls": [],
    "other_urls": [],
    "postText": "My parents won't fly with me to help with move in. Wont see them again till the end of schoolyear. And i'm at the airport crying my eyes out.\nTips on feeling less overwhelmed fellow yalies?",
    "comments": [
        {
            "level": 0,
            "comment": "You're gonna do great. It will be hard at times but you'll make some amazing friends and learn a ton of interesting stuff. Next thing you know you'll be feeling like this at graduation. Emotions are part of the human experience and you'll probably look back on yourself with more kindness in 10 or 20 years. Hang in there, you're not alone.",
            "score": 27,
            "author": "jwdjr2004"
        },
        {
            "level": 0,
            "comment": "I can guarantee you that your mum is crying, too, as you’ve just left a huge hole in her heart, but she’s so proud of you! You got into Yale! And you’re traveling all by yourself across the globe to start an incredible new adventure. Soon you’ll make new friends and have roommates and be busy with classes and the homesickness will ease. Thank goodness for modern technology: Zoom and FaceTime will help you stay connected with family back home! You can do this. Good luck with your orientation trip!",
            "score": 17,
            "author": "CometofStillness"
        },
        {
            "level": 0,
            "comment": "That's a tough situation,  suggest settling in with your classes, getting to know New Haven and your classmates. I faced a somewhat similar situation moving to Yale from California to start grad school.  It takes a while to adjust but once you make the adjustment you'll grow to love your new home. I have been in New Haven since June and love it.",
            "score": 9,
            "author": "aao1959"
        },
        {
            "level": 0,
            "comment": "If you can, video/call home often. It will help both you and your family. Change is hard, but it is a necessary part of life. You have a great future ahead of you, and your family is probably very proud and excited for you. When you get to campus, try to get out and meet people &amp; get involved in clubs or activities early so you will connect with some locals and feel less lonely. Don’t hide in your dorm room - it will make homesickness worse. Good luck!",
            "score": 5,
            "author": "Significant-Being250"
        },
        {
            "level": 0,
            "comment": "uh if it helps i was too lazy to call my parents so didnt talk to them for an entire yr",
            "score": -16,
            "author": "thattophatkid"
        },
        {
            "level": 0,
            "comment": "EAT SOME HOME COOKED FOOD ROFL ')",
            "score": 0,
            "author": "Xer73"
        }
    ]
}