{
    "id": "yfx654",
    "score": 0,
    "title": "What are/were your favorite classes/professors at Yale?",
    "author": "puddingkat",
    "date": 1666982684.0,
    "url": "https://www.reddit.com/r/yale/comments/yfx654",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a prospective student, but I want to push myself out of my comfort zone in college and take great classes with great professors in subjects I hadn't considered before.  I'd love to hear from those with personal experience!  Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Astronomy 120 Galaxies and the Universe with Faison during the academic year. Generally any 100 level astronomy class is great. These courses are also offered in the summer but you miss the magic of the course because of the fast pace, so I only recommend taking them during the academic year. Astro 120 with Faison was an amazing experience. If I could change my major I’d change it to Astronomy. The class is not easy, but it is highly, highly rewarding. Life changing if you let it!",
            "score": 8,
            "author": "CarsOnForbesAt3AM"
        },
        {
            "level": 0,
            "comment": "John Pittard’s Philosophy of Religion course was spectacular!",
            "score": 7,
            "author": "Rogue_the_Saint"
        },
        {
            "level": 0,
            "comment": "Jonathan Spence on Chinese history and Glenda Gilmore and Joanne freeman on US history. Sadly Spence died and Gilmore retired I believe.",
            "score": 6,
            "author": "smegmamayo1"
        },
        {
            "level": 0,
            "comment": "Death with Shelly Kagan is great but I’d recommend Credit/D. Also loved The Criminal Mind with Arielle Baskin-Sommers and Health of the Public with Christakis",
            "score": 3,
            "author": "Feels_tripper"
        },
        {
            "level": 0,
            "comment": "Sickness and Health with Carolyn Roberts - it's an AFAM/history of medicine course and Dr. Roberts is still rated my favorite lecturer at Yale (I'm currently a senior, so that's a lot of profs to beat out). She's such a lovely person too and really cares about making connections with students.",
            "score": 3,
            "author": "clever_rosebud"
        },
        {
            "level": 0,
            "comment": "All my Japanese classes and Writing Humor with Ryan Wepler were my favorites!\n\nI majored in CS, so I could recommend a few electives there if you’re interested. And if you aren’t a CS major but have an interest in it, CS50 is a fun course where you’ll learn a lot.",
            "score": 2,
            "author": "YungCereal"
        }
    ]
}