{
    "id": "zrxqs4",
    "score": 17,
    "title": "Double Majoring at Yale",
    "author": "543845",
    "date": 1671649709.0,
    "url": "https://www.reddit.com/r/yale/comments/zrxqs4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I was recently admitted to the class of '27, and I would like to explore both computer science and biochemistry while at Yale. Ideally, I would like to double major in the two fields, but I have heard that doing so may be exeedingly difficult and take away from the Yale experience. Any advice?   \nAlso, I hope to do pre-med, so keeping a good GPA is a must, which leads me to my second question: How challenging is it to get good grades at Yale? What is the grade inflation like?  \n\n\nThank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "no explicitly just biochem major at yale-- you probably would want MBB-- molecular biophysics and biochemistry. other options are EEB, ecology and evolutionary biology or MCDB, molecular, cellular, and developmental biology.\n\nbenefits of double majoring are extremely small-- just take CS classes and major in biochem or vice versa. if you need to apply for a job in a certain field, you list the relevant courses that you took in that field (ex, \"BS, Biochemistry, revenant coursework, \"C++ whatever whatever\" or whatevs) plus if ur pre med you have a career path decided that does not require a cs degree. you dont need a sheet of paper to specify that you fulfilled all the exact reqs, just take the classes to gain the skills you want to gain. MCDB has more overlap w pre med reqs, so you should probably major in that.\n\nto explain the issues with double majoring more-- there are specific reqs that may not be practically very helpful or interesting to you that you have to spend one out of your 36 classes total on. I know some cs majors that struggle with extremely theory-heavy (ie, not about actual programming) cs classes. you probably dont need to do these to just have cs knowledge and be able to work in the field after college if you want to. but if you tie yourself to majoring in it, you lose the flexibility of other classes you could take for that slot, you cant credit/d it if its tanking your gpa, you cant drop it, etc.\n\nwe also have a certificate in programing you should considering instead of a cs major.",
            "score": 13,
            "author": "spocks_bowlcut",
            "replies": [
                {
                    "level": 1,
                    "comment": "CS and MBB are not gentle on the GPA, but yale is no worse than the same programs at similar schools.",
                    "score": 4,
                    "author": "spocks_bowlcut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Noted. Maybe I would be better off then choosing one or the other",
                            "score": 2,
                            "author": "543845"
                        },
                        {
                            "level": 2,
                            "comment": "Math is harder in the goa",
                            "score": 1,
                            "author": "thattophatkid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We have a biochemistry and biophysics major",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "true, also MBB oops. will add.",
                            "score": 2,
                            "author": "spocks_bowlcut"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much! That gives me a lot to think about.",
                    "score": 1,
                    "author": "543845"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't know whether this will influence any decisions but at Yale humanities majors have the same acceptance rate to med school and science majors do -- they will help you pick the right classes to make sure you have all the requirements no matter what.\n\nLooking at what a double major would entail,\n\n* 6 courses for the MBB prerequisite\n* 10 courses for the BA in MBB (13 for BS)\n* 10 courses for a Computer Science major (11 as you'll definitely want to take a prereq class like CS50 if you haven't yet).\n* 3 courses for the language req (always worth remembering).\n\nI rounded some .5 credits here and there but that's 29/36 classes just going towards your major alone, personally I would want more room to explore. You'll also be working really hard as these are all courses on the harder side.\n\nThe degree is intentionally structured to not allow minors and let you pick classes you're interested in without having to worry about whether you get a qualification out of it or not. Exploring a subject by doing 5-6-7 courses in it without going the full way and majoring is not a sunk cost!",
            "score": 4,
            "author": "film_socialisme",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a good point. It might be better then for me to forgo the computer science degree initially, take some classes in it, and then see if it’s right for me. That’s definitely a plus at Yale: I can explore both areas (and the humanities), and then I can figure out what’s right for me",
                    "score": 2,
                    "author": "543845"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I double majored in exactly those two fields (it’s not thaaaaaat uncommon) - feel free to pm",
            "score": 3,
            "author": "tell-me-your-wish"
        },
        {
            "level": 0,
            "comment": "!remindme 1 day",
            "score": 1,
            "author": "HitmanDebt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will be messaging you in 1 day on [**2022-12-22 19:27:26 UTC**](http://www.wolframalpha.com/input/?i=2022-12-22%2019:27:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/yale/comments/zrxqs4/double_majoring_at_yale/j157y85/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fyale%2Fcomments%2Fzrxqs4%2Fdouble_majoring_at_yale%2Fj157y85%2F%5D%0A%0ARemindMe%21%202022-12-22%2019%3A27%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20zrxqs4)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                    "score": 1,
                    "author": "RemindMeBot"
                },
                {
                    "level": 1,
                    "comment": "Also feel free to pm if you’re interested as well!",
                    "score": 1,
                    "author": "tell-me-your-wish"
                }
            ]
        }
    ]
}