{
    "id": "1051lzw",
    "score": 18,
    "title": "Is the Fordham alumni network really what everyone says it is?",
    "author": "Such_Bottle_8821",
    "date": 1673029924.0,
    "url": "https://www.reddit.com/r/Fordham/comments/1051lzw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Everywhere I look, I see people saying that they got internships and research positions from Fordham alumni, especially during the summer. I know a lot of school in a state such as New York can boast that, but I want to know if any of you feel that Fordham's alumni network stands out. Thanks to all!",
    "comments": [
        {
            "level": 0,
            "comment": "The Fordham gabelli network in my experience is incredible. You can find atleast one Fordham alum at almost any job you’re applying to. Gabelli also sends a lot of internship opportunities to apply to every week via email and events. It’s just up to the students to take advantage of.",
            "score": 15,
            "author": "Fun_Air_4926"
        },
        {
            "level": 0,
            "comment": "If you're looking to live &amp; work in the NYC metro area, there's a ton of Fordham alumni.  This will potentially help with your career, social circle, etc.\n\nAs you get further from NY/NJ/CT, the network shrinks rapidly (i.e., folks will be hard-pressed to know what Fordham is outside the tri-state).  \n\nIt's hard to assign a \"value\" to this (IMO, it matters less and less as your career progresses), but it doesn't hurt especially as you're starting a career.",
            "score": 4,
            "author": "briankev"
        },
        {
            "level": 0,
            "comment": "Little late to the party but I'll echo what the other comments are saying. I got my sophomore and junior banking internships through managing directors who hired exclusively Fordham students for intern roles and I know a lot of friends with similar experiences. Gabelli grads are always happy to help out current students through networking events, coffee chats, and putting fellow Fordham resumes into the right pile. Additionally, our office of professional development is really good and goes out of their way to help students get high level internships and full time job offers within NYC. Outside of NYC, YMMV.",
            "score": 3,
            "author": "LethalGuacomole"
        },
        {
            "level": 0,
            "comment": "I find Fordham alumni almost everywhere I go and they all are very helpful and interested in supporting students and alumni. I got multiple internships through alumni connections.\n\nWhile Fordham alumni are certainly centralized in New York, I’ve stumbled upon alumni working in Hong Kong, Egypt, and Ireland (there’s a relatively large alumni community there), amongst other places. \n\nThe thing about alumni networks is that you have to be actively networking to benefit from them. You might get a leg up from going to the same school, but you won’t get the real benefits until you create a relationship, which being a Ram is a jumping-off point for.",
            "score": 1,
            "author": "TheWindow234"
        }
    ]
}