{
    "id": "1388tqy",
    "score": 9,
    "title": "Grade deflation for undergrad",
    "author": "katzupokj",
    "date": 1683255960.0,
    "url": "https://www.reddit.com/r/Fordham/comments/1388tqy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I committed to Fordham RH with a major in political science! I’m starting in the fall and my end goal is to attend a good law school. However I’m really worried that I won’t be able to maintain a high gpa (3.7 or 3.8) because of all the talk about Fordhams grade deflation. \n\nI’m willing to put in the work for the gpa, but is it really as hard as people say? Thank you and any replies are appreciated!!",
    "comments": [
        {
            "level": 0,
            "comment": "I never experienced grade deflation in a single one of my poly sci classes",
            "score": 4,
            "author": "Conn-man"
        },
        {
            "level": 0,
            "comment": "grade deflation is only rlly a thing here in STEM",
            "score": 4,
            "author": "ImageOk2953"
        },
        {
            "level": 0,
            "comment": "Please stop lying to this child the grade deflation here is insane… I feel like you guys must be bots bc I’ve legit never met any student here who doesn’t feel that way…",
            "score": 3,
            "author": "Guavafan5",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are you majoring in?",
                    "score": 1,
                    "author": "SavageCyclops"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rate my prof is your best friend for finding classes where grade deflation doesn’t occur. Very rare in poli sci or core classes. Becomes more of a problem when you’re a junior/senior taking upper level major requirements and running into more tenured professors, who love having their course be known as the “hard class”.",
            "score": 3,
            "author": "nottoodifferent"
        },
        {
            "level": 0,
            "comment": "Grad student and instructor here: I honestly wonder if this is true grade deflation. Grade deflation means purposely changing the curve of the class so that the average is less than a C. However, incoming undergrad GPAs at Fordham average an A-. This means that in order to avoid grade *inflation* (changing the curve of the class so that the average is higher than a C), we need to have much higher expectations of every student than they ever faced in high school.\n\nIn my department, we are strongly discouraged from either grade inflation or grade deflation. We are expected to have a class average of a C. This means a few people will get As, most will get Bs and Cs, and only a few will fail. \n\nBut yes, students who had an A- average coming in from high school can and do fail. High school is easier than college. \n\nGrade deflation isn’t when someone didn’t continue to see the same performance they did in high school. Don’t expect that a normal grade will be the same grade you got in high school for the same amount of work. Grade deflation is when the class average is intentionally lower than a C.\n\nThat said, there are a very small number of “weed-out” classes that do this. I don’t know if there are any in poli-sci. As far as I know, there are none in my department either. I think that organic chemistry is one in biology? These are intentionally difficult classes because they feed into extremely difficult programs. The point is to get people to change their major before waiting four years and being unable to graduate anyway because they couldn’t handle the classes or final project.\n\nIf you want to maintain the same grade that you did in high school, expect to work much higher for that same grade. Remember, a 3.7 incoming GPA is only just higher than average here, and average performance warrants a C or a B if you are lucky. Only exceptional performance warrants an A.\n\nBut there is better news: a C isn’t a bad grade! In high school it’s a bad grade *because* you need good grades to get into college. For most jobs, they won’t care what your college GPA is. They only care that you graduated. So if you get a C, it’s fine! You graduate with a C! C is average. Average performance earns diplomas. That’s all you need. So reframe the whole “good grade” thing in your head. Don’t count every point. Just make sure you’re not failing outright. That’s honestly all that matters.",
            "score": 6,
            "author": "Square-Ebb1846",
            "replies": [
                {
                    "level": 1,
                    "comment": "Organic is a weed-out course at other universities. Gen Chem and Gen Bio tend to weed out more at Fordham.",
                    "score": 4,
                    "author": "NegativeBee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I second this",
                            "score": 2,
                            "author": "cakepan777"
                        },
                        {
                            "level": 2,
                            "comment": "Oh really? I will definitely take your word for it, since I don’t teach those. Thanks for the info!",
                            "score": 1,
                            "author": "Square-Ebb1846"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was honestly the most delusional thing I’ve read all week",
                    "score": 0,
                    "author": "Guavafan5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So you expect Fordham to have an average graduating GPA equivalent to its average admission GPA? That would make a fordham degree practically worthless, but go off.",
                            "score": 2,
                            "author": "Square-Ebb1846"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "was in the same position as you, but realized its possible to maintain a 3.9 with hard work",
            "score": 1,
            "author": "AVOUND"
        },
        {
            "level": 0,
            "comment": "A 3.5 at minimum in Poli Sci is easily done. Anything beyond that will require work.\n\nUnless you're a student-athlete, I don't see how anyone in that department could get less than 3.5.",
            "score": 1,
            "author": "BorEqua"
        },
        {
            "level": 0,
            "comment": "as long as you dedicate yourself you should be fine! i have a 3.9 rn so i’m sure you can also achieve the same!",
            "score": 1,
            "author": "earfcake"
        },
        {
            "level": 0,
            "comment": "Not necessarily grade deflation, but almost all the classes that I’ve taken had an A set at 94/94.5/95 which makes it more difficult than other schools where the A might be set at 92 or even 90. That’s what I think people are usually referring to when they say its more difficult to get higher grades at Fordham.\n\nFordham also does not offer A+’s like many other schools do, even if you score 98%+. When you apply to law school you will get your LSAC GPA generated for you based on your transcript. A is 4.0 and A+ gives you like 4.1 or 4.2 or something to boost your LSAC GPA. So you also lose out on that advantage when applying to law school.\n\nThis being said, I am not a Poli Sci major, maybe they have easier grading than other majors. But most likely its the same.",
            "score": 1,
            "author": "jengk"
        }
    ]
}