{
    "id": "13aoxbx",
    "score": 3,
    "title": "Campus change",
    "author": "misosmind",
    "date": 1683468823.0,
    "url": "https://www.reddit.com/r/Fordham/comments/13aoxbx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m an incoming freshman and I was wondering if there’s any way I could change my campus before classes start? Or do I have to wait a little to transfer? RH to LC, thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I would spend time at rh first before going to lc. Lc is depressing as fuck",
            "score": 9,
            "author": "Far_Principle_455"
        },
        {
            "level": 0,
            "comment": "Speak to your advisor. They can help with that.",
            "score": 5,
            "author": "Professional_End4209"
        },
        {
            "level": 0,
            "comment": "yeah i was able to switch from RH to LC, you just have to fill out a form thats in the applicant portal\n\nit should be closer to the bottom thats like “change major form” or something like that and you have to state your reasoning for wanting to switch",
            "score": 3,
            "author": "SeaworthinessFun4473"
        },
        {
            "level": 0,
            "comment": "It looks like the deadline for requesting an internal transfer is May 15th so you would still have time if you were already a student. I can't find anything about the process for incoming students, but it might be the same. \n\nAre you referring to a a change of colleges or just a change in where you're living? The latter may be easier to manage. Reach out to Dean Rebecca Stark-Gendrano rstarkgendrano@fordham.edu and see if it's possible. \n\nhttps://www.fordham.edu/fordham-college-at-rose-hill/student-resources/academic-resources/internal-transfer/",
            "score": 2,
            "author": "SerDavosSteveworth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "misosmind"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i transferred from RH to LC before i started my freshman year, they’re just very different environments so make sure u rlly wanna switch before submitting the online form. dm me if u have any questions!!",
            "score": 1,
            "author": "abzmendoza"
        }
    ]
}