{
    "id": "13k74tx",
    "score": 1,
    "title": "Grade appeal",
    "author": "sadalways3",
    "date": 1684341906.0,
    "url": "https://www.reddit.com/r/Fordham/comments/13k74tx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone done a grade appeal and actually have it go through ? If so - how long was the process",
    "comments": [
        {
            "level": 0,
            "comment": "I’m a grad student. I’ve done three grade appeals, I believe. All of them have raised my grade, albiet not always as much as I wanted. \n\nYou need evidence to get it to go through though. Evidence means things like rubrics, written assignment descriptions, emails from the professor providing clarification, etc, along with pointing out how your work meets the criteria laid out.\n\nPlease be aware you need to provide the evidence to the professor before escalating above their head. This may work in your favor: if they dismiss you without explanation or throw a temper tantrum then the next level up is more likely to be sympathetic so long as you were respectful yourself.\n\nPlease note that even if a grade appeal is granted, it may take a while for your account to reflect the grade change. Sometimes it happens in days, other times it takes weeks to fully process.",
            "score": 3,
            "author": "Square-Ebb1846",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am trying to get my 88 to a 90. I’m not too sure how possible this might be since the final essay is what made my grade go down and I don’t have much control of how she grades. I’ve emailed her and I’m still waiting for a response but I doubt she’ll do anything to help me",
                    "score": 1,
                    "author": "sadalways3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would suggest asking for itemized deductions and feedback on your essay, then compare to the assignment description and/or rubric and/or syllabus and/or whatever other instructions she gave. \n\nI once had a professor give me a B- on the one assignment we had in an entire class, but when I asked for feedback, most of the feedback was that I was missing stuff he explicitly told me to cut out from an earlier draft. He told me it was a fair grade, but when I appealed to the department head, the department head decided that I had followed the professor’s instructions and gave me an A on the assignment. Since it was the only assignment, it raised my grade from a B- to an A.\n\nIt may also be worth noting that I had a 6-page appeal against this person and he dismissed it without reading it. I filled an official complaint against him and he wound up turning in his resignation before the end of summer. So that was a particularly bad situation.\n\nBut ask for the feedback and made your appeal on that.",
                            "score": 1,
                            "author": "Square-Ebb1846"
                        },
                        {
                            "level": 2,
                            "comment": "Faculty member here; the key part is that you need an argument for why the final essay was graded incorrectly. The argument cannot be \"I want a higher grade\" (because, lots of people do!). And when you make a grade appeal you are claiming the instructor made a mistake in how they graded you. And mistakes happen - but it is on you to prove it.",
                            "score": 1,
                            "author": "Spirito84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100% agree with this. That’s precisely why the first step is to contact your professor. I have absolutely had my equipment fail to read a full document and graded half an assignment simply because I didn’t get the full file, I have accidentally put grades in the wrong place just because my papers weren’t alphabetized correctly when I inputted grades, and more. \n\nI have also had professors blatantly discriminate against me or retaliate against me (the B- to A was retaliation. One of the others was discrimination and the final one was just a really bad professor who didn’t want to admit he didn’t teach the materials). \n\nThat’s why asking for a list of itemized deductions is so important. If the grade on the final paper was fair, your final grade is fair. \n\nAlso, keep in mind that unless the final project is one of only a few assignments or worth a really high percentage of the grade (like 80%) or unless you got a really, really low grade (like 30% or lower), it probably didn’t actually change your grade all that much. When professors incorporate lots of assignments, they do it because it adds flexibility for you. You can do poorly on an assignment or two and still do well on the assignment. In other words, Final projects often make very little difference in the final grade unless you were right on the cusp to begin with.\n\nIf your final paper was worth 30% of your final grade and you had an 85% average in the rest of the class, then it would actually be impossible to get to a 90% overall without rounding or a curve or extra credit, even if you got a perfect grade on the paper. Here’s the math: \n85 (former average)*.7 (weight of all other assignments) = 59.5\n\n100 (perfect score on essay) * .3 (weight of essay) = 30\n\n59.5 (weighted grade of all else)+ 30 (weighted grade of essay) = 89.5\n\n89.5 (weighted total) / 100 (highest possible) =\n89.5% (final grade)\n\nConversely, if you had an overall average of 95 points on all other assignments and the final essay was worth 30% of your total grade, you would only need a 79 on the final essay, which should be ridiculously easy for someone averaging a 95. Here’s more math:\n\n95 (points of all other assignments) * .7 (weight) = 66.5 (weighted total of other assignments)\n\n90 (goal score) - 66.5 (points you’ve already earned) = 23.5 (the weighted score you need)\n\n23.5 (the weighted score you need) / .3 (unweight that score) = 78.33 = 79 (rounded up) \n\nThese formulas can be easily modified, too. Just plug in your overall average without the final essay to the overall average spot, 1-the weight of the final assignment for the weight of all other assignments, and the weight of the final project rather than the numbers I guessed at.\n\nSo ask yourself whether your final essay is graded the same way all other assignments are, whether your course average was high enough that a 90 was even plausible , whether you believe your final essay was actually worth the amount of points you would have needed according to the formulas I laid out, etc. If you figure out that the course was graded fairly and you would have needed a final grade substantially different than all other grades to change your grade to a 90, you’ll lose your appeal. If you find that you would have needed an exceptionally low grade on your final compared to all other scores to bring your grade that far down, definitely appeal.",
                                    "score": 1,
                                    "author": "Square-Ebb1846"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, I have. A professor gave me a C when I had As and Bs on every assignment so I told him it made no sense, showed him all my calculations based on the syllabus, and told him he needed to change it or I would take it to the deans. It was effective but obviously don’t be aggressive like me lol",
            "score": 2,
            "author": "cakepan777"
        }
    ]
}