{
    "id": "mi1kfs",
    "score": 23,
    "title": "Best freshman dorm to live in at Rose Hill",
    "author": "Funny_Sorbet_7519",
    "date": 1617301370.0,
    "url": "https://www.reddit.com/r/Fordham/comments/mi1kfs",
    "media_urls": [],
    "other_urls": [],
    "postText": "Please send helpppp, Idk where tf to live lol. If you could leave your thoughts on where to live at rose hill for freshman, I would really appreciate it :)",
    "comments": [
        {
            "level": 0,
            "comment": "They all kind of suck in their own way, but that's just part of the freshman experience. Loschert and Alumni Court South have elevators but no AC (I lived in Loschert and the first week after move-in, in late August, was hell because it was so hot in the dorms at night. My roommates and I had to get a big-ass fan so we could sleep comfortably). Alumni Court South  has a reputation for being a rowdier dorm in general. Martyr's has AC but the rooms are TINY and there are no elevators. Queens/Loyola from what I hear are ok (one of them, I don't remember which, has private sinks in the dorm rooms), but you need to be accepted to their respective programs to live there in most cases. If Faber is still the way I remember it, it's not too bad, but because half of the building is offices for Modern Languages and Poli-Sci, it's sort of awkward to run into a prof while you're just vibing in your pajamas and going to do laundry.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That being said:\n\nLoyola for days",
                    "score": 3,
                    "author": "Nicofatpad"
                },
                {
                    "level": 1,
                    "comment": "That’s funny. When I was in north it was the definitely known as a party while south was not. What floor were you?",
                    "score": 2,
                    "author": "soulexpectation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was on the third floor. ACS was known as the coke dorm because when I was a freshman, people were literally doing drugs in the basement dorm rooms lol",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey third floor as well! 332 right here. And to be fair our floor/wing figured out you could crank the showers way up, open a window and smoke weed in the bathroom so better than coke but that’s college for you!",
                                    "score": 2,
                                    "author": "soulexpectation"
                                },
                                {
                                    "level": 3,
                                    "comment": "why is every basement floor of every freshman dorm at fordham notorious for doing drugs lmfao. Our basement floor in martyrs was known for that too",
                                    "score": 2,
                                    "author": "qrntviltrs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm screaming, my partner was an RA at Fordham and he has so many horror stories about his residents (most are from ACS though lmao)",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the best answer is Loyola. The rooms are the best freshman dorms on campus. Can't beat a walk-in closet, sink + mirror, air conditioner, wood floors, and more space than you'll know what to do with.",
            "score": 5,
            "author": "IdkWhatScreenname",
            "replies": [
                {
                    "level": 1,
                    "comment": "don’t you have to write an essay to get in to Loyola? Or is that just for the Manresa Scholars program?",
                    "score": 1,
                    "author": "Funny_Sorbet_7519",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Manresa scholars all have to live in Loyola, it’s an ILC (integrated learning community). So yes, you need to write an essay to get in.",
                            "score": 4,
                            "author": "qrntviltrs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "(Ranked from best to worst)\n\n1. Loyola - it’s an ILC so you’ll have to apply for it, there’s an extra class you have to take once a week if you live in this dorm but nothing difficult. The rooms have their own sink in it, wooden floors and honestly just the nicest freshman dorms on campus. Most rooms are triples though. \n\n2. Loschert/Alumni Court South - iirc loschert is what people call on “off-brand south” lol. But they’re exactly the same in terms of layout (I think). No air conditioning so it’s HOT in the first maybe 3-4weeks of the fall semester but you should be good if you get a fan, there are also elevators. Also, south is what everyone considers the most social dorm. \n\n3. Queens court - dunno much about queens but it’s split into two wings. One wing you guys get walk-in closets and the other wing gets a sink in the room. Queens is also an ILC and if you live there you have to sign that you’ll swear to sobriety and won’t drink alcohol lmfao. I heard RAs there are strict because of this but those are just rumors. \n\n4. Martyrs Court (Jogues) - if your a STEM major you should definitely apply to jogues. It’s an ILC as well and most people that lived there are STEM majors, but also probably the best wing out of all the wings in martyrs court (there’s 2 other ones: Lalande and Goupil). Jogues is slightly better than the other two wings from what I heard; full kitchen, renovated bathrooms and smaller wing so less people so it’s easier to do laundry lol. Lalande and goupil both have to share laundry. \n\n5. Martyrs Court Lalande and Goupil - exact same room layout as Jogues, smallest dorms on campus. Honestly not as bad as what many people say, most of the fun people I met in freshman year were from martyrs court. Communal showers are relatively clean but they’re only covered using curtains, it’s not like... a shower cubicle if that makes sense. Also forgot to note they remove the air conditioner after the fall semester, and NO elevators in all of martyrs court. So if your on the top floor then good luck. \n\nLast dorm is Faber but I literally know nothing about it. I’m a junior but never even met anyone who lived in faber their freshman year lol.",
            "score": 5,
            "author": "qrntviltrs"
        }
    ]
}