{
    "id": "tlj2h0",
    "score": 3,
    "title": "Overnight stay/sneaking in Walsh",
    "author": "bonoboyouhobo",
    "date": 1648074859.0,
    "url": "https://www.reddit.com/r/Fordham/comments/tlj2h0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello :) I’m gnna be living in Walsh this upcoming fall. I have a girlfriend that goes to LC and I would love her to sleepover in Walsh when it’s hard for her to commute back during late hours. What r some ways to have her stay overnight? Also if I have a friend as an RA in the building would that help? Thank u :)",
    "comments": [
        {
            "level": 0,
            "comment": "Sign her in as a guest, then come back down and have her sign you out. Walk back in 15 mins later and you’re golden",
            "score": 5,
            "author": "RickyFinn",
            "replies": [
                {
                    "level": 1,
                    "comment": "can you further explain how this would work 🥲",
                    "score": 1,
                    "author": "bonoboyouhobo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can sign in guests to any building they don’t live in, but with the current rules in place they have to leave by 3 am to prevent these overnight visits. Sign her into the building as a guest, then significantly later, walk back down with her and sign her out, but give her your room key beforehand. Once she is signed out, she walks up to your room and lets herself in while you walk outside. Loiter for 20 mins or so, then let yourself back in using your ID. Head upstairs and knock to have her let you in, and you’re fine. She has “left” without leaving.",
                            "score": 2,
                            "author": "RickyFinn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a former RA, dont put your friend in that position. It’s a fireable offense. If you wanna sneak someone in go ahead and do that but don’t involve someone who’s job it is to follow the rules (aka be a good friend).",
            "score": 3,
            "author": "organizedotter"
        }
    ]
}