{
    "id": "tvpqp0",
    "score": 5,
    "title": "Financial aid appeal",
    "author": "Lilly826",
    "date": 1649035941.0,
    "url": "https://www.reddit.com/r/Fordham/comments/tvpqp0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Really want to go to Fordham and I submitted an appeal asking for more aid, does anyone know if Fordham typically approves appeals?",
    "comments": [
        {
            "level": 0,
            "comment": "They didnt approve mine",
            "score": 1,
            "author": "DespotOfMorea",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you don’t mind me asking, did you provide specific reasoning? Or did you simply ask for more aid because you couldn’t afford it?",
                    "score": 1,
                    "author": "Lilly826",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think I said something along the lines of not being able to afford it, its been a while.",
                            "score": 1,
                            "author": "DespotOfMorea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you end up going? If so was it worth the price?",
                                    "score": 1,
                                    "author": "Lilly826",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes and I have no idea. I have no way to compare, and over 1/3 of my time here was online.",
                                            "score": 2,
                                            "author": "DespotOfMorea"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I appealed every year, and they always increased my aid, but not by much",
            "score": 1,
            "author": "fromapocalypsenow",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are considering Fordham. But we don’t have a fixed income, so the financial aid package might be varies yearly. Do you think that we can appeal every year based on it?",
                    "score": 1,
                    "author": "mywu1367",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My financial situation was more complicated than was shown in my Fafsa, so my appeals always centered around that, if you explain your situation in your appeal they will consider it I think. I’ve heard some people have had trouble appealing past freshman year. If you have a genuinely changing situation they will try to help you. It also helps if you have a good record to show, I’d imagine they’re more likely to help dean’s list-type students",
                            "score": 2,
                            "author": "fromapocalypsenow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you.",
                                    "score": 1,
                                    "author": "mywu1367"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}