{
    "id": "u10ryo",
    "score": 3,
    "title": "5 courses per semester for Freshmen?",
    "author": "sat20twenty",
    "date": 1649656726.0,
    "url": "https://www.reddit.com/r/Fordham/comments/u10ryo",
    "media_urls": [],
    "other_urls": [
        "https://www.cognitoforms.com/FCRHDeansOffice/fcrhreducedcourseloadrequest2](https://www.cognitoforms.com/FCRHDeansOffice/fcrhreducedcourseloadrequest2)"
    ],
    "postText": "Attended admitted students day today at Rose Hill. Was told that freshmen are required to take 5 courses per semester. There is also a load reduction form to reduce to 4 courses [https://www.cognitoforms.com/FCRHDeansOffice/fcrhreducedcourseloadrequest2](https://www.cognitoforms.com/FCRHDeansOffice/fcrhreducedcourseloadrequest2) \n\n*Most colleges require 3 courses per semester*.  I am worried about the load of 5 courses or 4 courses (if load reduction request is approved). Is this load something manageable?\n\nWould like to hear from current Fordham students on their freshmen year academic load.",
    "comments": [
        {
            "level": 0,
            "comment": "Freshman year academic load is manageable. Keep in mind most of the courses you are taking freshman year are core requirements. They are 3 credit classes. Major / upper level classes are 4 credits, hence the load reduction when you are taking those.\n\nWhere are you getting the info that most colleges require only 3 courses a semester? I’ve never heard that to be the case.\n\nYou could always take less courses and go for a part-time student status. But then you will have to plan extra semester(s) out.",
            "score": 8,
            "author": "Argo4444",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking at Union College or Ursinus college. Both of these colleges have 3 courses per semester. As well as Lewis and Clark in Portland, Oregon.",
                    "score": 1,
                    "author": "sat20twenty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So looking at Lewis and Clark. The minimum courseload for full time is 12. Normal full time courses is 16 credit hours. You’ll note that Fordham’s reduced load is 12 and normal load is 15/16.  This is on par for lewis and clark. Their classes are 4 or 5 credit hours. So in order to take only 3 courses you see either underloading on 4 credit courses or taking 3 of the 5 credit courses (5 credit likely has prerequisites and are not freshman classes?). Either way this is the exception not the norm. And, comparing to Fordham’s courseload, you are taking relatively less-intensive classes in terms of 3 credits versus 4. The total credit hours per semester actually works out lower than 16 for the freshman year 5x3=15. So on a credit hour basis, assuming your professors are assigning homework and papers in line with the course’s design, the work should be the same if not lower.",
                            "score": 1,
                            "author": "Argo4444",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the convincing answer!",
                                    "score": 1,
                                    "author": "sat20twenty"
                                },
                                {
                                    "level": 3,
                                    "comment": "A follow-up question: How many classroom hours per week and how many hours of class-work outside of class per week (approximately) for freshman course?",
                                    "score": 1,
                                    "author": "sat20twenty"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah FCRH kids usually take 4 or 5 classes a semester here. I'm not sure how manageable it is for them, but in Gabelli we typically take 5-6 and I haven't encountered any problems aside from the typical crunch time when everything comes due at once. \n\nThe only insight I have into FCRH is we had course selection a few days ago here, and a lot of kids were running up or surpassing their credit hour limit, which indicates a lot of students were trying to take 5 classes and maybe some 1 credit programs on top of that. TLDR; This is a very roundabout way of saying I believe FCRH kids are comfortable with even 5 classes.",
            "score": 3,
            "author": "Icomefromalandupover",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it common to see waitlists on certain courses during course selection? i.e. a student may find it difficult to enroll in a course of their choice.",
                    "score": 1,
                    "author": "sat20twenty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Typically for core requirements there are more than enough classes not just to go around, but for you to get one of your top choices. As you move into more specific categories like major requirements however, you may only see one or two sections available for a given class or sections that fill up quickly. If a course you need is unavailable however (or if you had a lot of problems on registration day), administration usually can wedge you into a closed or waitlisted section that works well with your schedule. Just last week I had to do that for Legal Frameworks of Business and it wasn't too difficult.",
                            "score": 1,
                            "author": "Icomefromalandupover"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I promise the workload will be okay. 5 classes really isn't bad and they are only 2 times a week for 1 hour and 15 min. At first it may seem really overwhelming but you will adjust to it and find a way to make it work",
            "score": 1,
            "author": "blueberryserendipity"
        },
        {
            "level": 0,
            "comment": "the workload is completely doable. 5 classes reduces to 4 typically when you become an upperclassman because you're taking more major-centric courses, most of which are 4 credits (4 classes 4 credits each = 16 credits for the semester). if you are in FCRH and not a STEM major, you will be limited to 18 credits per semester which allows for the four four-credit classes, but if you really want to take more, you can fill out a form requesting to bypass the credit limit. \n\nFreshman year i planned my five classes so i never had class after 12:45 except for one day of the week. you'll be doing more writing and reading than you're used to in high school, but everybody does it and you'll be completely fine",
            "score": 1,
            "author": "Ancient-Library-4117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hello. In order to promote inclusivity and reduce gender bias, please consider using gender-neutral language in the future.\n\nInstead of **freshman**, use **first year**.\n\nInstead of **upperclassman**, use **upper-level student**.\n\nThank you very much.\n\n^(I am a bot. Downvote to remove this comment. For more information on gender-neutral language, please do a web search for *\"Nonsexist Writing.\"*)",
                    "score": 1,
                    "author": "GenderNeutralBot"
                }
            ]
        }
    ]
}