{
    "id": "ue62qh",
    "score": 2,
    "title": "Applied accounting and finance classes at Lincoln Center?",
    "author": "matcha-aa",
    "date": 1651182139.0,
    "url": "https://www.reddit.com/r/Fordham/comments/ue62qh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got accepted as an undergrad for Gabelli in Applied Accounting &amp; Finance Rose Hill but honestly prefer the location of Lincoln Center better despite my major being primarily at RH. Could I take some classes at Lincoln Center? How long is the Ram Van commute from RH to LC? Commute using subway?",
    "comments": [
        {
            "level": 0,
            "comment": "I’m an RH rising sophomore and I took many classes at LC my freshman year! Schedule LC classes so that you don’t have to travel during rush hour so that the ram van only takes about 35 mins. However, if you do have to commute during rush, the D train runs express in the bronx in the peak direction so it’s like four stops only from LC to RH—super quick!",
            "score": 2,
            "author": "edub114",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for responding! Still a bit wary about going to Fordham even though I am committing as of right now, because if I get off the waitlist for UC Davis there is a chance I may go. Visited Fordham last summer but maybe I wasn't in the best mood that day, but I think it was solid. I did really like the greenery though. Of course everything is what you make of it, but if I do end up going to Fordham I'm scared I won't like it--hopefully everything works out in the end",
                    "score": 2,
                    "author": "matcha-aa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s totally a mixed bag and definitely not for everyone, but the business program is really strong and respected in New York. Even if you don’t love it, if you tough it out and work hard you’ll end up exactly where you want to post grad :)",
                            "score": 2,
                            "author": "edub114",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's very reassuring to hear!",
                                    "score": 1,
                                    "author": "matcha-aa"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}