{
    "id": "uhum1q",
    "score": 3,
    "title": "How bad can your grades be before you will get your acceptance rescinded after fordham receives the final transcript of senior year?",
    "author": "Slight_Love_7906",
    "date": 1651625481.0,
    "url": "https://www.reddit.com/r/Fordham/comments/uhum1q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi i’m a current senior in high school and I was just wondering if I have 1 D on my final transcript for second semester in ap econ, will fordham rescind my acceptance? I got accepted into the gabelli business school and I was just worried that I might get a letter of rescinded notice because of my D.",
    "comments": [
        {
            "level": 0,
            "comment": "most gabelli students rocking with a D all throughout high school u good",
            "score": 5,
            "author": "paula2343",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was probably lead in the crayons we were eating. Affects our grades. Can’t think Gud.",
                    "score": 3,
                    "author": "legal_dumpsterfire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn’t worry abt that. You’ll be fine",
            "score": 2,
            "author": "organizedotter"
        },
        {
            "level": 0,
            "comment": "but i read on a lot of different posts that getting a D on your final transcript has a possibility to get acceptance rescinded…. my weighted gpa would be a 3.69",
            "score": 2,
            "author": "Slight_Love_7906"
        },
        {
            "level": 0,
            "comment": "and will i get an email having to explain why I have a D on my final transcript?",
            "score": 1,
            "author": "Slight_Love_7906",
            "replies": [
                {
                    "level": 1,
                    "comment": "what u majoring in?",
                    "score": 1,
                    "author": "AVOUND",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "business marketing",
                            "score": 2,
                            "author": "Slight_Love_7906"
                        },
                        {
                            "level": 2,
                            "comment": "my weighted gpa would be a 3.69",
                            "score": 1,
                            "author": "Slight_Love_7906"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol i’m thinking the same thing, i got like a 70 something in gym bc i just never went and i hope they don’t give me a hard time about it….",
            "score": 1,
            "author": "emilyreginaa"
        }
    ]
}