{
    "id": "uwfk9d",
    "score": 16,
    "title": "Is Fordham Too Cliquey and Snobby?",
    "author": "Nova-Sila",
    "date": 1653355826.0,
    "url": "https://www.reddit.com/r/Fordham/comments/uwfk9d",
    "media_urls": [
        "https://www.reddit.com/r/Fordham/comments/uwfk9d/is_fordham_too_cliquey_and_snobby/"
    ],
    "other_urls": [
        "https://www.tiktok.com/@fartmas/video/6970550787122400517?is\\_copy\\_url=1&amp;is\\_from\\_webapp=v1&amp;q=fordham&amp;t=1653355271156](https://www.tiktok.com/@fartmas/video/6970550787122400517?is_copy_url=1&amp;is_from_webapp=v1&amp;q=fordham&amp;t=1653355271156)",
        "https://www.tiktok.com/@fartmas/video/6971427231058955526?is\\_copy\\_url=1&amp;is\\_from\\_webapp=v1](https://www.tiktok.com/@fartmas/video/6971427231058955526?is_copy_url=1&amp;is_from_webapp=v1)"
    ],
    "postText": "So I recently got into Fordham and am committed. However, I have seen a lot of negative TikToks (link below) as to how the school is very snobby and cliquey and not worth the money. Not just from TikTok, but also from other sites. I even joined a Fordham Class of 26 Instagram page and many people seemed cold, dry, and straight-up rude to me for no reason. When I click on other people's profiles, I'd see they only follow specific groups of people/individuals and ignore everyone else. \n\nAnyways, is Fordham actually a snobby school? Or is there a lot of diversity and it is possible for anyone to find their group of friends within the school?\n\n&amp;#x200B;\n\n[https://www.tiktok.com/@fartmas/video/6970550787122400517?is\\_copy\\_url=1&amp;is\\_from\\_webapp=v1&amp;q=fordham&amp;t=1653355271156](https://www.tiktok.com/@fartmas/video/6970550787122400517?is_copy_url=1&amp;is_from_webapp=v1&amp;q=fordham&amp;t=1653355271156)\n\n[https://www.tiktok.com/@fartmas/video/6971427231058955526?is\\_copy\\_url=1&amp;is\\_from\\_webapp=v1](https://www.tiktok.com/@fartmas/video/6971427231058955526?is_copy_url=1&amp;is_from_webapp=v1)",
    "comments": [
        {
            "level": 0,
            "comment": "I wouldn’t use reddit or tiktok as reliable gauges to understand the social scene at Fordham. Ask people who are at the school already",
            "score": 29,
            "author": "dior-mirror"
        },
        {
            "level": 0,
            "comment": "im not gonna say fordham is perfect but like, it's not \"hell on earth\" lmao, if you know how to find your people by going to clubs and being an agreeable person there are more than enough ways to enjoy your time there.\n\nlike /u/dior-mirror said i don't think basing your holistic opinion on the school on one tiktok of a girl crying is worth your time.\n\nAs for the money part, most people are kinda rich or get a lot of financial aid. Most of my friends have merit scholarships so that was a connection point.\n\nRegarding diversity, it's definitely not the worst but i would not say we are a super diverse bunch lol, but if you're coming from outside new york i would say comparatively, probably. If you're respectful of the bronx residents you can access tons of diverse cuisines and cultures right off campus at stuff like the night market, it's a good time",
            "score": 9,
            "author": "succsuccboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the insight. Would you say the school is worth $130,000 debt? Because that’s how much I’ll owe after 3 years xD",
                    "score": 3,
                    "author": "Nova-Sila",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "uhhh, not sure about that lol. I don't know your financial situation and if you're already committed I don't want to worry you but that is a lot of coin to spend.\n\nIf you're a business major or in that field I can understand it since that's what fordham is known for best but otherwise I can't say that I'd come here for that much debt after",
                            "score": 7,
                            "author": "succsuccboi"
                        },
                        {
                            "level": 2,
                            "comment": "No school is worth that much debt",
                            "score": 3,
                            "author": "boundaryram"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok so here's my perspective \n\nI completely sympathize and understand what she is going through and she is right about somethings. Social life in Fordham is hard (not the worst, people are for the most part friendly) but some people can be very reserved and stay within their friend circle. There are so many people I've tried to be friends with, got their contact info and they would never text back and or just straight up ghost me. I get it. in additions the academics can be stressful (the core curriculum  is INSANE), the bureaucracy  is impossible to deal with and it makes the cost not worth it.  \n\nFordham as a school must step up in general to be more accommodating, provide better counseling services, more opportunities for students to socialize (alot of events start in late times that are not convenient for everyone, especially for commuters), and create a more inclusive student body. \n\nThat being said, the others are right, this person's account alone is not the best representation. A lot of people who liked Fordham and are doing their best might take offense, the person should've maybe said 'its not for everyone' or that it wasn't right for her. Fordham is still a great place, and you take initiative to join clubs, overcome being shy, make connections with faculty, and do interesting things (research, internships) and utilize the resources properly you will meet tons of great people and not necessarily classmates. Your professors are your peers too and they are very nice and open to talk. You just have to do your best to make the first move to interact with people. \n\nFeel free to DM me to talk more, I can connect you with some of my friends and acquaintances !!",
            "score": 6,
            "author": "the_hipster_nyc"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}