{
    "id": "vfchnc",
    "score": 16,
    "title": "Is Urban Plunge Worth it?",
    "author": "Yankeeman457",
    "date": 1655577732.0,
    "url": "https://www.reddit.com/r/Fordham/comments/vfchnc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi I'm an incoming freshman to Rose Hill and I saw the application for Urban plunge. I was thinking about doing it as you move in 3 days early however I know little about it. Is it worth doing? What are the activities like?",
    "comments": [
        {
            "level": 0,
            "comment": "I’m old as hell, but Urban Plunge was one of my Fordham highlights. I especially recommend it if you’re not local-ish — it helps demystify the area and you’ll at least know some friendly faces before the chaos of NSO.",
            "score": 9,
            "author": "estelle2839"
        },
        {
            "level": 0,
            "comment": "I’m a upcoming sophomore and I went my freshman year and it was great. Since its a three day program with activities it gives a good opportunity to develop some close friendships or at least get used to meeting people in a new place. Also it’s very nice to get a head start in moving in. It’s also connects you with organizations or volunteer programs if you are someone who is into social activism or want to know more about that in the area of New York. I think the program changes a bit every year so I am not sure what the activities will be like for you but I got to plant trees and that was fun and then we also had a excursion at the end where we went into groups and explored an area in Manhattan but Im not a rose hill student so mayyyy be diff",
            "score": 5,
            "author": "CJO888"
        },
        {
            "level": 0,
            "comment": "Definitely do it.",
            "score": 3,
            "author": "gloarnd"
        },
        {
            "level": 0,
            "comment": "If there’s even a hint of wanting to do it, do it. Don’t let these opportunities pass you by. You’ll have a head start",
            "score": 4,
            "author": "42Ozukuri"
        },
        {
            "level": 0,
            "comment": "i personally really enjoyed plunge ! it's a great introduction to nyc and fordham, and moving in early is really nice too. it's not as crowded, which makes getting your stuff into your dorm a lot easier. i also met some of my closest friends through plunge, so it definitely helps create connections as well.",
            "score": 2,
            "author": "aesthertic"
        },
        {
            "level": 0,
            "comment": "What’s the downside?",
            "score": 1,
            "author": "SonOfElroy",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I did it, the downside was that it was cold in the rooms we met in (Lincoln center btw) and also it can be kind of tiring since you are doing things all day",
                    "score": -1,
                    "author": "CJO888"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Plunge gave me the best experiences I had as a fordham student! It is kinda volun-tourism but some friends of mine are running it this year and working to make it less of that. It is great for learning about and gaining an appreciation for the Bronx (and showing you that peoples perceptions of it are based mainly in racism…). You’ll be doing orientation like stuff (icebreakers), volunteering, reflections, and a lot of people find their close friends from it. I wish they had it for upperclassmen bc I would have done it every year if I could :) \n\nFeel free to Dm me if you have any specific questions!!!",
            "score": 1,
            "author": "silversucculent"
        },
        {
            "level": 0,
            "comment": "1000% do Plunge. I will be one of the Captains this year and we are developing a great program. Please reach out if you have any questions.",
            "score": 1,
            "author": "Inisfada1"
        }
    ]
}