{
    "id": "vhxf7i",
    "score": 2,
    "title": "first semester language course",
    "author": "MeanPollution722",
    "date": 1655875510.0,
    "url": "https://www.reddit.com/r/Fordham/comments/vhxf7i",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey I'm a first year at fordham and I'm in the process of constructing my schedule for my first semester\n\nis it required to take a foreign language core for the first semester? will it put me behind if I don't or is it fine if i just start in my second semester?\n\nI'm at rh btw! I'll take any and all advice!",
    "comments": [
        {
            "level": 0,
            "comment": "It’s advisable you take a language course in the first semester (though not required). You have to complete a minimum sequence of courses until you reach the 2000 level (usually 4 courses) if you are Liberal Arts major. So you don’t want to fall behind.",
            "score": 5,
            "author": "HelpfulRough4383"
        },
        {
            "level": 0,
            "comment": "you can start it whenever, you don't have to take it the first semester! it takes 4 semesters to complete it (if you start from the beginning, obviously if you place into a higher level itll shed a semester or two) but its up to you how you utilize and plan it out",
            "score": 5,
            "author": "counterfeitemotions"
        },
        {
            "level": 0,
            "comment": "Just note if you are a stem major you don't have to take a language course",
            "score": 1,
            "author": "tugglepuggle"
        },
        {
            "level": 0,
            "comment": "If you are starting at the most basic level, most languages only offer it in the fall but otherwise you should be good!  It goes 1001, 1501, 1502, and finally 2001 but if you take the placement test and can skip one, that lightens the work a lot!\n\nIt’s not required but tbh it is nice to get the core out of the way so you don’t have to deal with them as an upperclassman",
            "score": 1,
            "author": "silversucculent"
        }
    ]
}