{
    "id": "vsytn0",
    "score": 2,
    "title": "Monthly payment plan",
    "author": "Taengoorene",
    "date": 1657137141.0,
    "url": "https://www.reddit.com/r/Fordham/comments/vsytn0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve enrolled in the monthly payment plan but it still shows I have a balance on my ebill. I already deducted my downpayment which haven’t show up on the ebill, there would still be $500 left on the balance. Shouldn’t the monthly payment plan covers everything on the bill?",
    "comments": [
        {
            "level": 0,
            "comment": "i emailed my advisor about it so i’d say email yours as well",
            "score": 2,
            "author": "chaebb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I emailed the financial aid office and did you get the same problem?",
                    "score": 1,
                    "author": "Taengoorene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah i got an email stating that i still had a balance left to pay. i am not enrolled in the monthly payment plan but i chose the future payment option. i emailed my advisor like 3 hrs ago so i’ll let you know when she responds",
                            "score": 1,
                            "author": "chaebb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I didn’t know future payment is an option, when do you have to pay for it?",
                                    "score": 1,
                                    "author": "Taengoorene",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i set it up so i pay monthly, but i believe you can do it whenever you want. but i’m p sure i might’ve done it wrong considering i got the email so the monthly payment option might be the best",
                                            "score": 1,
                                            "author": "chaebb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Isn’t yours the same as the monthly payment plan if you pay monthly?",
                                                    "score": 1,
                                                    "author": "Taengoorene",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "technically? i didn’t register through nelnet (i think that’s what it is?) i just did it through the payment option on the ebill suite through the future payment tab",
                                                            "score": 1,
                                                            "author": "chaebb"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "advisor responded and said to call student records  718-817-4900",
                                                            "score": 1,
                                                            "author": "chaebb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Alright thanks for letting me know",
                                                                    "score": 1,
                                                                    "author": "Taengoorene"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "but i don’t know why they’re emailing about the bill, i doubt most people can pay it all at once but im unsure as if we are supposed to pay the full amount by tmrw",
                                            "score": 1,
                                            "author": "chaebb"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I second this, what is future payment? I don’t see it on their website",
                                            "score": 1,
                                            "author": "commeilfaut26"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}