{
    "id": "wiujjx",
    "score": 1,
    "title": "How hard is it to get into Fordham for me?",
    "author": "Brave-Particular4113",
    "date": 1659918295.0,
    "url": "https://www.reddit.com/r/Fordham/comments/wiujjx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone! I want to apply ED to Fordham this fall. However, I am extremely worried. I have 5 Cs on my transcript and …bad regents scores. I know it sounds bad. (and it is pretty bad haha) However, I can explain why this happened. If you want to know, you can PM me. On the bright side, my essay is strong (I’ve gotten it checked by multiple people) and I have very strong extracurriculars and awards. How much will this effect me? I’ve always wanted to attend Fordham.\n\nEDIT: you guys are so helpful 🥹🥹🥹",
    "comments": [
        {
            "level": 0,
            "comment": "If you have a story to tell about your grades- then make an effort to tell that story to admissions.",
            "score": 6,
            "author": "SpiritStreet234",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! :)",
                    "score": 1,
                    "author": "Brave-Particular4113"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I’m an incoming freshman at the Rose Hill campus (if you are debating between LC and Rose Hill, I HIGHLY recommend the RH campus instead of LC if you want a more “typical” college experience). I applied EA for Film&amp;TV and got in first round of admissions. I had a C in Algebra II my junior year and a C in both semesters of AP Psych in my senior year. I was in the average demographic of their ACT range (I had a 29 super score) and submit my scores. I also had a great essay. My GPA was a 3.7 weighted. So, I was a fairly “average” applicant. I truly expected to get no merit scholarship from Fordham because of my average-ish grades. But, I think my essay SAVED me on that. I ended up getting 25 grand per year off of tuition all for merit. I truly believe this is because of my essay. I think you could have a great shot. Reach out to your admissions counselor at Fordham and try to form a relationship with them. This can help too. Best wishes and go Rams!",
            "score": 5,
            "author": "Economy_Cucumber_914",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried emailing my counselor but I never got a response :,) Thank you so much for your help though! This made me feel much better :-)",
                    "score": 1,
                    "author": "Brave-Particular4113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hello, call the admissions office. They should be able to help you get in contact with your counselor",
                            "score": 1,
                            "author": "Flyingpuppy123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imo you have a solid chance of getting in, but be prepared to fight for your life for financial aid because they may use your grades as an excuse to make you pay out your ass in tuition",
            "score": 3,
            "author": "Long_Efficiency_523",
            "replies": [
                {
                    "level": 1,
                    "comment": "my family’s income is around ~35K and we have one source of income too, im gonna try to get as much possible from FAFSA as well",
                    "score": 1,
                    "author": "Brave-Particular4113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you should ask your parents how much they make again… How is your family living on 35k?? I don’t want to intrude but that seems like way too little for 3+ family. I make about 30k a year as a student working minimum wage… sorry if i’m being insensitive i’m just curious",
                            "score": 1,
                            "author": "Flyingpuppy123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have two different incomes, one personal + one business but we would use personal on my FAFSA (most of the business income doesn’t go towards us)",
                                    "score": 1,
                                    "author": "Brave-Particular4113"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "not sure why everyone is making fordham look like it’s some terribly hard school to get into, because it’s not. Truth be told, any average applicant with a decent gpa and a ok sat score or even no sat score can get in no problem. Especially if you have ECs, it’s not hard at all. Truthfully, some SUNYs are harder to get into than fordham is (binghamton, stony brook). You don’t need to be a stellar applicant. Just apply, do well on your first semester of senior year, have a some what compelling story, and have a decent explanation for the Cs",
            "score": 2,
            "author": "Zealousideal-Light-4",
            "replies": [
                {
                    "level": 1,
                    "comment": "i might need to send in my normal marking period grades because i want to apply ED. my semester ends january. is that possible ?",
                    "score": 1,
                    "author": "Brave-Particular4113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah bro just apply",
                            "score": 1,
                            "author": "Zealousideal-Light-4"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "seeing as you’re applying ed, your chances of acceptance are already a bit higher. as for your grades- fordham is all about the cura personalis; meaning they will look at your entire profile with no preference for grades and/or stats. like you, i had a great essay, as well as a wide range of extracurriculars, but my grades weren’t the best (though i excelled in languages and arts, science and math had basically been the death of me). i got in ea—&gt;deferred—&gt;regular decision, with a nice scholarship. \nthe thing about fordham, is that a lot of students with stellar scores looking to attend ivy leagues or other prestigious colleges tend to apply to fordham as their safety school. if you look at applicant scores - all in the top stats. however enrolled students tend to have lower stats - still excellent ones, though more within your reach. \n\ncontinue working hard and don’t give up hope - i hope to see you on campus next year! best of luck for the upcoming application season :)",
            "score": 2,
            "author": "Deep_Yard_8942",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! this definitely made me feel better :)",
                    "score": 1,
                    "author": "Brave-Particular4113"
                }
            ]
        },
        {
            "level": 0,
            "comment": "do you have sat/act scores? any strong ecs? i believe there’s an additional space where you can write explaining grades and whatnot, so i’d recommend using that to your advantage as long as it doesn’t repeat anything in your main essay",
            "score": 1,
            "author": "chaebb",
            "replies": [
                {
                    "level": 1,
                    "comment": "im not going to be submitting my sat scores (that’s going to be explained in my additional information section, i don’t want to go into details here haha) and i have very strong ECs! (ex: multiple leadership roles, multiple awards, i am on several political campaigns, i’ve worked at law firms, etc.)",
                    "score": 2,
                    "author": "Brave-Particular4113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "when did you get Cs? earlier or later? i do believe you should be able to get in but considering you’re doing ED as well",
                            "score": 1,
                            "author": "chaebb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i had 2 my freshman year and 2 my junior year. they were in subjects that i am terrible at :,) however my humanities subjects (what i plan on majoring in anyways) are extremely strong. like i have a 101 in english and 99 in my social studies areas",
                                    "score": 1,
                                    "author": "Brave-Particular4113",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "then that’s not bad, i think you have a fair chance of getting in then",
                                            "score": 1,
                                            "author": "chaebb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "thanks for ur help!!! i really really really appreciate it :))))",
                                                    "score": 1,
                                                    "author": "Brave-Particular4113"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly just a coin flip lol",
            "score": 1,
            "author": "5n0wy",
            "replies": [
                {
                    "level": 1,
                    "comment": "„lol dılɟ uıoɔ ɐ ʇsnɾ ʎlʇsǝuoH„",
                    "score": 1,
                    "author": "Upside_Down-Bot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're from New York state (documentation status doesn't matter) you should reach out to Fordham's HEOP program https://www.fordham.edu/academics/academic-resources/heop/. HEOP is one of the best things Fordham does.  It takes students with challenged grades and low-income family and gives them a TON of financial aid and academic support to make it to graduation nearly debt free. Reach out to the staff at the program and talk to them to see if you'd be a good fit, it's really an amazing resource.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "the website says that i must be inadmissible according to fordhams traditional admission criteria however i am TECHNICALLY admissible",
                    "score": 1,
                    "author": "Brave-Particular4113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd reach out to the staff anyway. Admissable is a somewhat flexible term.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}