{
    "id": "xl97xc",
    "score": 1,
    "title": "Merit Aid without NMS",
    "author": "weirdanon05",
    "date": 1663871319.0,
    "url": "https://www.reddit.com/r/Fordham/comments/xl97xc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm an HS senior planning to apply to Fordham, mostly in the hope of getting good merit aid. However, I did not get National Merit Semifinalist. I do have a good SAT (1550+) and competitive extracurriculars (published research, leadership, etc.)\n\nHow much merit aid would I be able to get? Are significant scholarships (full-tuition or near it) limited to National Merit Scholars, or has anyone gotten significant merit aid without it?",
    "comments": [
        {
            "level": 0,
            "comment": "i submitted no SAT scores, good extracurriculars (although they were unrelated to my intended major) &amp; i was able to get the fordham jogues scholarship w/the maximum amount of $10k per year",
            "score": 4,
            "author": "anonymousgirl_25"
        },
        {
            "level": 0,
            "comment": "i should also mention they look for quality of extracurriculars, my friend applied to fordham with a 97 average and meh extracurriculars, i had a 91 average w/good extracurriculars and only i ended up receiving a scholarship at fordham",
            "score": 3,
            "author": "anonymousgirl_25"
        },
        {
            "level": 0,
            "comment": "National recognition scholars based on ethnicity can get up to a full ride. I got the national Hispanic recognition scholarship and I got a full ride!",
            "score": 1,
            "author": "bella307d"
        },
        {
            "level": 0,
            "comment": "i got like $28k without national merit. idk if you consider that significant, but i did. i had a 32 act and 3.9 uw/4.5 w",
            "score": 1,
            "author": "emmyc7"
        },
        {
            "level": 0,
            "comment": "i was commended but not a semi finalist and didn’t submit any scores and i got 25k so you can definitely get a lot of you have good essays and ECs",
            "score": 1,
            "author": "Outrageous-Grape-262"
        }
    ]
}