{
    "id": "10sgrjk",
    "score": 8,
    "title": "Wanting to get more involved",
    "author": "MrBoxer42",
    "date": 1675418582.0,
    "url": "https://www.reddit.com/r/Harvard/comments/10sgrjk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I’m a new HES undergrad student and I really want to get more involved with the Harvard community. Any suggestions for how I can become more involved, attend events, join clubs and make friends? I live outside of Boston but am more than willing to fly in for these things.\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": " HBS Rugby is always happy to have anyone. Fun group, lots of socials, tours and events. Incredible alumni association. Men’s and women’s teams.",
            "score": 5,
            "author": "buschcamocans",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.hbsrugby.org",
                            "score": 2,
                            "author": "buschcamocans",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Thanks!\n\nYou're welcome!",
                                            "score": 1,
                                            "author": "exclaim_bot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can also join the Harvard archery team. Shooting practices are open to all Harvard affiliates. You can shoot as much or little as you like during regular practices at the QRAC. There's a minimum requirement of involvement if you want to join the team for team competitions, but you don't have to be a competing member.\n\nI also enjoyed working out with the Harvard Boxing Club. They meet on the mezzanine of the MAC several times per week. You have to pay the $50 athletic club/MAC fee but other than that, you just show up ready to get sweaty and exhausted and feel amazed you can count yourself part of a club whose membership included Teddy Roosevelt and JFK. \n\nI would have killed to compete with Harvard Curling but COVID killed it for two years, and then my timing in region never matched up with the season. Biggest regret in life. You can attend a learn to curl/open event or get more involved as a member on the competing roster. Up to you. \n\nDM me for more details.",
            "score": 2,
            "author": "raycathode13"
        }
    ]
}