{
    "id": "1283xcq",
    "score": 8,
    "title": "Yale vs Harvard as a member of the FGLI and rural community",
    "author": "lgr4367",
    "date": 1680305831.0,
    "url": "https://www.reddit.com/r/Harvard/comments/1283xcq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was recently accepted into Harvard College. I applied to Yale EA and was also accepted. However, I just need some advice/insight from students with a similar background/backstory to me at Harvard. I live in a small rural town and I am a member of the FGLI community. I plan on majoring in either Sociology or Philosophy. My questions are:\nWhat has it been like for you? \nDo you feel supported both academically and mentally as a FGLI student? \nWhat are some resources they have specifically at Harvard?",
    "comments": [
        {
            "level": 0,
            "comment": "The FA has been amazing. They have a winter coat fund. Boston is bigger than new haven but Harvard is a bubble just like Yale. From my friends experiences at Yale, the academic and mental challenges are the same with varying levels of support that are up to you to seek out. It's definitely been interesting and completely different than anything I expected.",
            "score": 6,
            "author": "ultrastarman303"
        },
        {
            "level": 0,
            "comment": "Same situation, harvard vs yale as a first Gen from rural AL. \n\nI ended up choosing harvard bc I wanted to be in a bigger city (it comes with more opportunities and things to do ). aide was also much better at Harvard for me. I also got a better “vibe” at visitas than at bull dog days, but that was just me. \n\nI truly think based on ur background of rural and FGLI, your experience at Harvard and Yale will be very comparable. The people who attend either one are very similar tbh, and so are the on-campus resources. There is no wrong decision you can make :) if you wanna talk more abt harvard, feel free to DM.",
            "score": 4,
            "author": "PlodderFun",
            "replies": [
                {
                    "level": 1,
                    "comment": "also I don’t know how yale students get to school, but flying to Harvard was pretty easy bc Bostons size and public transport. Idk where yale students fly in to, but I’m guessing it’s not as convenient to get to if you’re going back and forth.",
                    "score": 2,
                    "author": "PlodderFun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "since you’re rural, i’d suggest harvard. having access to boston is amazing and i think college is a great time to see if you’d like to keep living somewhere rural. i’m not sure about FGLI resources at Yale. some harvard students feel there aren’t enough FGLI resources, though many students are working to improve it. We have a pre orientation week called FYRE for FGLI students and the community within it is very strong. It’s great for meeting other FGLI students and will help teach you about the resources available to you at Harvard",
            "score": 2,
            "author": "AlpacaSquad"
        },
        {
            "level": 0,
            "comment": "I think where people get into trouble is not asking for what they need, and you don't need to be FGLI to have equal issues struggling here for different reasons and there are lots of resources -- the university wants you to succeed.\n\nFinancially every campus is going to have a divide between people who can go out or hit the dining hall or head into the city or fly home on breaks, and that is unfortunate but you've earned your spot and unless you throw it away it's all temporary. e.g., there are limits as to what any institution can do here, much comes down to knowing why you're here and being focused. \n\n&gt;I plan on majoring in either Sociology or Philosophy.\n\nOh, well... tough fields but good luck!\n\n**Edit:** It occured to me if you don't have parents guiding in this area, you may not realize just what something like Philosophy entails in terms of competitiveness of employment. The humanities aren't funded the same way as STEM, and there are far fewer TT positions so you're stuck as an adjunct hoping your contract is renewed every year. It's often a way to get an expensive degree and then have to move overseas to teach English to be employed. These aren't the kind of things the university will bring up, but you are going to have to cast a wide net and be willing to listen wherever you end up.",
            "score": 5,
            "author": "and_dont_blink",
            "replies": [
                {
                    "level": 1,
                    "comment": "The OP didn't indicate a plan for pursuing an academic career, so the reference to dim prospects of tenure track humanities positions may be irrelevant.",
                    "score": 2,
                    "author": "user1636",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It may be irrelevant to you, but it's the kind of thing we don't think about when someone is an FGLI. We often have people guiding and supporting us, giving a wider range of opinions and points to consider -- without that, they will have to create their own and seek it out, as the University isn't going to explain how stipends in the humanities are lower across the board.\n\nIf you have family in academia, you know and pick up on these things in ways someone wide-eyed coming in doesn't. The point is if they aren't going to pursue an academic career, they might not be aware there's literally nothing else for some of these degrees unless you come from a background that will have other options available to you. e.g., they can make whatever choice they like, but they're at a disadvantage due to a lack of context and information and they need to be mindful and seek it out.",
                            "score": 1,
                            "author": "and_dont_blink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can you go more in depth about this? I am doing a major I would be passionate about and enjoy. How is that not useful? I have spoken to some alums in the same fields who do a wide range of careers with it. Just want to hear your thoughts.",
                                    "score": 1,
                                    "author": "lgr4367"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}