{
    "id": "12a62mp",
    "score": 0,
    "title": "Anyone wanna help a fellow Boston student out?",
    "author": "Psychological-Air-84",
    "date": 1680487285.0,
    "url": "https://www.reddit.com/r/Harvard/comments/12a62mp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, im sorry to disappoint but im not one of you high and might Harvarders. However I am an international student (from Norway) studying in Boston, and before I leave in a few weeks I would really love to try to get a little «insider» view of Harvard campuses. Anyone willing to share some tips or show me around? \nPs: I already infiltrated the cafeteria at HBS once, love the library over there!",
    "comments": [
        {
            "level": 0,
            "comment": "Join the mail list for announcements from the Harvard Art Museums. https://harvardartmuseums.org. Their collections are spectacular and they have several events each week, ranging from lectures to workshops to tours, and even hands-on art making. \n\nAlso, go explore the Natural History museum and attached Peabody Museum. \n\nYou should sign up for a free Harvard Yard tour. It leaves from the Smith Center and you can sign up on Eventbright.",
            "score": 2,
            "author": "Beginning_Brick7845",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the tips ☺️",
                    "score": 1,
                    "author": "Psychological-Air-84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "generally, if you get a student outside of widener they can let you in. sometimes if you say you are a tourist just exploring the security guard can be nice too. the vibe is probably to just walk around during classes and drop in on a few",
            "score": 1,
            "author": "Far_Assist222",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha thanks thats what i wanted to. \nJust need to know when an interesting class would be starting so i could blend into the crowd going in",
                    "score": 1,
                    "author": "Psychological-Air-84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check out the Museums.",
            "score": 1,
            "author": "Temporary_Zone268"
        }
    ]
}