{
    "id": "12xuuth",
    "score": 29,
    "title": "Least favorite thing about Harvard?",
    "author": "Practical-Basket-349",
    "date": 1682367370.0,
    "url": "https://www.reddit.com/r/Harvard/comments/12xuuth",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Any time it comes up in conversation.\n\nProfessionally, it buys me a lot and helps with establishing authority (on things way outside my scope and focus) and negotiations. Comes with a fair bit of pressure, but that's a good problem.\n\nPersonally. It's really difficult to have conversations with people when they are too busy responding to how they feel about where I went to school.",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s why you say you go to school in boston",
                    "score": 3,
                    "author": "mED-Drax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But not Tufts . . .",
                            "score": 5,
                            "author": "Beginning_Brick7845",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no not BU…",
                                    "score": 4,
                                    "author": "mED-Drax",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No not BC…",
                                            "score": 4,
                                            "author": "Bgoodale"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Curious: Negotiations with investors or...?",
                    "score": 1,
                    "author": "CollegeAlum1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My least favorite thing about Harvard was having to graduate and leave the sacred, concrete halls of Mather for the cold asphalt of the real world.\n\nThat, and Dumpster House.",
            "score": 64,
            "author": "gacdeuce",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mather is just the concrete shoebox Dunster came in. The best thing about living in there is that at least you don't have to see the outside.",
                    "score": 5,
                    "author": "yaranga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d direct you to Mather’s housing day video circa 2009. Yes, Mather is the box Dunster came in, but what does that make Dunster?",
                            "score": 3,
                            "author": "gacdeuce"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What’s the significance of Dumpster House",
                    "score": 1,
                    "author": "NateBolan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The baggage. Someone can wear a Michigan hoodie or a Florida State tee and it's just a person wearing a shirt. But if you wear Harvard, it's often perceived as a \"statement\".\n\nPeople will ask \"Lol so did you REALLY go to Harvard?\" I stopped wearing them.\n\nIn the workplace, people that know I have a Harvard degree will sometimes give me weird shit about it. If you hand in a document that's got some goofy error because you've been working on it so long you got too numb to see it, I've gotten \"wtf is this bro. Aren't you supposed to have gone to Harvard?\" There are a lot of other weird microaggressions too difficult to explain. I think the brand kind of trips a switch in people who are naturally really competitive to subconsciously look for ways to try and take you down a peg.\n\nOther times it'll be a weird inferiority complex. Coworkers say weird things like *sad tone* \"Well I wish I could have gone to Harvard instead of my stupid cow college.\"\n\nAnd the \"cow college\" in question will be a high quality Carnegie R1 research University frequently competitive in national championship athletics. And I think what tf are you talking about? Literally everyone I grew up with either dropped out of HS, never finished community college or went to third tier schools on a band scholarship. All of us would have killed to go to that so-called cow college.",
            "score": 16,
            "author": "raycathode13",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I stopped wearing them.\n\nFunny. I have a friend who did this but for the opposite reason. He wears a Yale tank top to the gym so that when people say \"Oh, you went to Yale?\" he can reply \"No, I went to Harvard.\" Such a dbag.",
                    "score": 6,
                    "author": "FitzwilliamTDarcy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You misspelled \"legend\"",
                            "score": 5,
                            "author": "raycathode13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get the same response. I tell people I went to college in Cambridge.",
                    "score": 1,
                    "author": "Affectionate_Fig8355",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See if I tried that, it would backfire. People would think I went TO Cambridge.",
                            "score": 3,
                            "author": "raycathode13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Veritas waffles only had a symbol on the surface and didn’t actually contain any truth. For the price they charged I would have expected some actual truth. But they were tasty, so there is that.",
            "score": 38,
            "author": "Beginning_Brick7845"
        },
        {
            "level": 0,
            "comment": "The “I’m gonna be the President one day“ people can be a bit much. But in their defense, there’s a decent statistical chance that one of them actually will be.",
            "score": 51,
            "author": "MrChrisChill",
            "replies": [
                {
                    "level": 1,
                    "comment": "17.78% chance it ends up being someone who graduated from Harvard",
                    "score": 13,
                    "author": "lordgilberto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A good chance to revisit Bayes' Theorem and learn about the difference between likelihood and posterior probability",
                            "score": 18,
                            "author": "FinnW47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm only interested in very specific posterior probabilities.",
                                    "score": 2,
                                    "author": "raycathode13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or posterior *possibilities*, if you know what I mean 😉",
                                            "score": 6,
                                            "author": "Delicious_Progress_9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Heyyooooooooooo🥁",
                                                    "score": 1,
                                                    "author": "raycathode13"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Boston climate",
            "score": 12,
            "author": "Lie-Straight",
            "replies": [
                {
                    "level": 1,
                    "comment": "It ain't thaaat bad. Lol",
                    "score": 6,
                    "author": "Geoff_The_Chosen1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I mean if the worst thing about your time at Harvard is the weather that's a pretty great thing IMO.",
                            "score": 3,
                            "author": "FitzwilliamTDarcy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completing my science core (I’m old, not sure the requirements anymore)",
            "score": 2,
            "author": "FawnKnutsonn"
        },
        {
            "level": 0,
            "comment": "Partylife",
            "score": 1,
            "author": "Successful_Block_342"
        }
    ]
}