{
    "id": "13f6lb8",
    "score": 5,
    "title": "Help me choose my concentration",
    "author": "Ok-Mission1977",
    "date": 1683854979.0,
    "url": "https://www.reddit.com/r/Harvard/comments/13f6lb8",
    "media_urls": [],
    "other_urls": [],
    "postText": "&amp;#x200B;\n\nI was thinking about doing a Stats(quant finance track) and gov joint, but also like econ. How should I go about it I'm a pre-frosh, and honestly loved stats at Vistas seemed like a vibe that kinda pushed me\n\n1. How good is the quant finance track for stats couldn't find a lot about it online or on LinkedIn profiles with it\n2. How would you guys go about deciding do all of them set you up for decent jobs, or do you recommend some more than others? at least in the ones that I listed\n3. Any other advice",
    "comments": [
        {
            "level": 0,
            "comment": "In the kindest way possible, I would urge you to not choose your concentration. You won’t be able to even officially make this decision for another year and a half and you haven’t even taken a course at the college. I personally don’t know many people who didn’t alter their academic plans from what they thought they were going to do freshman year. I imagine you’ll probably experience something similar so it doesn’t make sense to choose a concentration just now with limited information or experience. I Can offer advice on class though. I’m an applied math graduating senior and I took three Stats classes and Tf-Ed one.",
            "score": 16,
            "author": "Helloiamwhoiam"
        },
        {
            "level": 0,
            "comment": "We'll help you when you get here. In August, think of what classes make sense to explore those areas, but other than that enjoy your summer. You got a year and a half to choose a concentration.",
            "score": 6,
            "author": "OliverAtom"
        },
        {
            "level": 0,
            "comment": "Joe Blitzstein, who sometimes posts on this subreddit, can answer questions about the stats concentration.",
            "score": 3,
            "author": "Confident_Promise_71"
        },
        {
            "level": 0,
            "comment": "Welcome to Harvard! Glad you enjoyed stats at Visitas. I agree with the other comments that you should not rush to decide on a concentration. You have plenty of time to explore options, and talk in person to various students and faculty after you get to campus. \n\nAlso, taking a Stat course in your first year would be helpful for all of the interests you mentioned, since here are a lot of Stat/Gov connections (e.g., check out [IQSS](https://www.iq.harvard.edu)) and Stat/Econ connections (e.g., the Econ concentration has a Stat requirement, and the entire field of econometrics is at the intersection of Stat and Econ). \n\nI think the quant finance track is a great option if you're interested in Stat and quant finance, but I helped create the track and co-run it, so you shouldn't be surprised that I think so.... We did have a loss recently in that Stephen Blyth, who used to teach [Stat 123](https://news.harvard.edu/gazette/story/2010/04/taking-finance-up-the-red-line/), left Harvard last year for Oxford. The future of Stat 123 is currently uncertain, but meanwhile the department introduced Stat 170 (Quantitative Analysis of Capital Markets), which is also very useful in finance. And many ideas from courses such as Stat 110 (Probability), 111 (Inference), 131 (Time Series), 171 (Stochastic Processes) and other Stat courses are very useful in quant finance. \n\nFeel free to let me know if you have other questions about the concentration!",
            "score": 2,
            "author": "joeblitzstein"
        }
    ]
}