{
    "id": "13r3xp1",
    "score": 21,
    "title": "Financial literacy at Harvard",
    "author": "Toe_Bean_Counter",
    "date": 1684977570.0,
    "url": "https://www.reddit.com/r/Harvard/comments/13r3xp1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone, I’m wondering if there are any resources to help students learn financial literacy (especially building wealth). For reference I’m at HLS but open to anything. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I have one word for you, Benjamin, index. Funds, that is. Black gold, Texas tea. \n\nSeriously, after you save enough to have an emergency fund, Put all you money in a low cost S&amp;P 500 index fund like you can get from Vanguard, Schwab or Fidelity. They’re all the same. Buy into it every month whether the market is up or down, and let the magic of compound returns work in your favor. There are few managed funds that beat the S&amp;P 500 over time. Warren Buffett advises that regular investors can’t do better. If you don’t think you’re smarter than Warren Buffett, I suggest you follow his advice. I follow Warren’s advice myself. Do a little Googling yourself and you’ll see that the sure money long-term is an index fund in the broader market. Sure, there are people who start a money management firm in their dorm at Harvard and found some of the great venture capital firms of the world. But those people literally are smarter than Warren Buffett and can beat him at his game. That’s not someone you should compare yourself to. \n\nVery soon you will be a well regarded lawyer making a substantial income. You will very quickly become a high net worth individual. And if your only investment strategy is to live below your means and to contribute to an S&amp;P 500 index fund every month, you will outperform 90% of all the fancy managed fund people who will soon be begging for your business.",
            "score": 23,
            "author": "Beginning_Brick7845",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup VTSAX and chill.\n\nNot sure how the different schools incorporate financial literacy into their courses (I think HMS at least a few years back was very inadequate) but most of what I learned at harvard about finance was from peers.\n\nEDIT: while not a harvard specific resource, I've found [the White Coat Investor by Jim Dahle](https://www.amazon.com/White-Coat-Investor-Personal-Investing/dp/0991433106) to be extremely helpful in terms of basic finance and investing for high earning professionals. You dont have to be a physician by any means, 95% of the basics apply to almost anyone here.",
                    "score": 7,
                    "author": "ducttapetricorn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly the kind of resource I was looking for, thank you! I see they also have a student version of the book. I’ll likely check out both",
                            "score": 3,
                            "author": "Toe_Bean_Counter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awesome! Glad to help! :)",
                                    "score": 2,
                                    "author": "ducttapetricorn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "100% agree.  And I am an HBS grad with a CFA who spent a career in investment management.",
                    "score": 6,
                    "author": "atheist1009"
                },
                {
                    "level": 1,
                    "comment": "This is so helpful! Do you have any input on what to focus on first between investing and paying down law school debt?",
                    "score": 2,
                    "author": "Toe_Bean_Counter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not the person you replied to but a big consideration is interest rates. \n\nInterest rates on loans (of any kind, educational, mortgage, car, etc) usually vary by a couple of percent, which may seem trivial at first but actually vastly changes the overall amount paid. \n\nTo give an example: a $500k loan at 30 years, with 3% interest rate would be $2100 per month while 6% would be closer to $3000. \n\nYou also have to consider what your potential investment returns are. Typically conservative estimates for index funds (ex: VTSAX etc) are 7-8% **REAL** (meaning accounting for inflation) each year or about 10% nominal. Of course those are averages and not guaranteed. \n\nThere's a lot of in-depth debates about what % loans you should pay off and in general 6% or above is considered high and should be prioritised before any sort of investments. Anything 3% and under in this economy (when considering inflation) is basically \"free money\" and should be paid minimally, of course there are nuances.",
                            "score": 4,
                            "author": "ducttapetricorn"
                        },
                        {
                            "level": 2,
                            "comment": "Sure. The big factor in your personal calculus is your expected income. If you’re going into public interest or something on the lower end of expected income you’ll need to be much more conservative and pay down your debt at the rate of maybe two to one versus investing. You still want to invest even as you pay down your debt but you need to get rid of the increasing expense of interest as fast as possible and you’ll need to curtail your lifestyle to do it. The compound effect of interest is working against you need to free yourself of that burden so you can start making compound returns work for you. \n\nNow here is where your personal situation might differ from most people and you may get well-meaning advice that doesn’t match your situation. Everyone is going to tell you that as a young student/new grad you need to scrimp and save and live as though you’re in poverty until all your loans are paid and you have a huge balance in your investment account. That’s good advice for most people, but if you’re planning to go into a firm right away, you may start with a high enough of a salary that you shouldn’t subject yourself to so much personal sacrifice in the beginning. You didn’t go through the trouble of qualifying for a high salary just to live off of max and cheese for the next ten years. You still want to live below your means, but you want to live comfortably below your means.  \n\nMy larger point is that if you are going into a firm, you should start thinking of yourself as a high net worth individual and handle yourself accordingly. It’s a weird feeling if you’re not from a wealthy background to go from starving student to high income overnight. It takes a little while to get used to it. The important part is that While you’re working through that process you start investing immediately as high net worth individuals do so that you get the advantage of extra time in the market. That was the number one mistake my wife and I made as we started our careers. We lived cheaply but we hoarded our savings far too long before getting them into the market. And when we did we didn’t invest efficiently. I wish we had followed my own advice ten years earlier. \n\nAs the poster above pointed out, paying back your loans depends on the interest rate. Calculate the cost of retiring your debt and reducing your interest payments in terms of a return on investment and balance that between your repayment plan and investments. You’re still going to want to prioritize paying down debt, but with a high income you are able to tolerate more debt without threatening your long term financial success.",
                            "score": 3,
                            "author": "Beginning_Brick7845"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fellow HLS student here: we have access to AccessLex which has a bunch of financial literacy resources. I’ve personally used their scholarship database, but haven’t played with their other financial resources. https://www.accesslex.org/max-by-accesslex",
            "score": 2,
            "author": "Pitiful-Location"
        },
        {
            "level": 0,
            "comment": "This is more minor compared to the broad index fund/compound interest (which is probably the most important) but getting a credit card asap and using it well is up there. Building a good credit score is pretty essential to having financial freedom so watch a couple youtube videos on the subject (I can give you some if you need) and start working on that. Credit cards also offer a lot of benefits like cashback or travel miles that you cant get through other payment methods. Just be sure to spend within your means and on time or the interest will fuck you.",
            "score": 3,
            "author": "trielock"
        },
        {
            "level": 0,
            "comment": "Aim to spend 50% of what you earn, consistently, save the rest. Do not buy expensive depreciating assets (cars!). Marry someone likeminded (a saver marrying a spender is a recipe for homicide). Pay off your debts asap. Interest owed compounds over time, in a magically horrible way. Once debts are paid you’ve got positive net worth, congratulations! Try to settle into a low cost of living area (nice house for your family around $500-700k) when possible. Buy your primary residence with cash (That homestead is usually protected from creditors). That way each month a good chunk of your earnings will now be flowing into your VTI VOO VTSAX index funds and compounding will be doing its magical thing to make you a multimillionaire. Once a multimillionaire, shift into a better balanced work situation and invest your freed-up time in your family, your community, and other things that give you joy. Now buy umbrella insurance and keep the liability coverage of your auto policies high.",
            "score": 1,
            "author": "Lie-Straight"
        },
        {
            "level": 0,
            "comment": "This is such a depressing thread.",
            "score": -2,
            "author": "Hyperbowleeeeeeeeeee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why do you keep leaving rude comments on this? I’m FGLI and feel totally lost sometimes. There’s nothing wrong with that",
                    "score": 7,
                    "author": "Toe_Bean_Counter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your question and the thread are a recipe for a pointless life. The top voted comment is basically \"ape Warren Buffet.\" What a depressing worldview. There are other subs focused completely on this drivel, so you won't have to hear any dissent.",
                            "score": -1,
                            "author": "Hyperbowleeeeeeeeeee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you’re confusing “how do I learn financial literacy” with “how do I maximize lifetime wealth at the expense of meaningful work and human decency.”",
                                    "score": 1,
                                    "author": "Toe_Bean_Counter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Care less about all these labels you're tossing around. Once you've accepted all the premises of your use of various words, you've already lost. Enjoy.",
                                            "score": 0,
                                            "author": "Hyperbowleeeeeeeeeee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I hope you’re doing OK",
                                                    "score": 2,
                                                    "author": "Toe_Bean_Counter",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I haven't validated you, so I'm sure you don't.",
                                                            "score": 1,
                                                            "author": "Hyperbowleeeeeeeeeee",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Are you coming onto me? Sorry, I'm not into it.",
                                                                            "score": 1,
                                                                            "author": "Hyperbowleeeeeeeeeee"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re at HLS you might also wanna check out https://www.biglawinvestor.com it’s a great starting point with financial resources and mock budgets for JDs if you’re planning on going the big law route",
            "score": 1,
            "author": "kongeri17"
        },
        {
            "level": 0,
            "comment": "The credit union (HUECU) provides a Wintersession series of seminars on financial literacy over 2 or 3 days in January each year. To join the seminars, you don't have to be a member of the CU, just affiliated with Harvard as student or staff.\n\nI recall it being very informative when I attended several years ago, and many of the attendees had very well thought out questions. It was a great experience all around. At the time, it was held at the Faculty Club—and they provided snacks and lunch. Given everything that's gone on over the past few years, I'm not sure if it's still held there these days or just over Zoom. Here's a link, though, if you're interested: [https://huecu.org/workshops/wintersession/](https://huecu.org/workshops/wintersession/) (it should update again in December with info for the 2024 session). \n\nIn the meantime, it looks like they may have posted a couple of their seminars from this past January to their YouTube channel.\n\nHope this info is useful!",
            "score": 1,
            "author": "Huxley7"
        },
        {
            "level": 0,
            "comment": "People say invest but that’s quite banal advice and honestly there are better ways to maximize returns. Invest in yourself not in the market(not yet anyways). Here’s my philosophy, you invest in all those etfs and real estate bs ONCE you’re rich. \n\nUse the money to help with your law hustle.",
            "score": -6,
            "author": "DoubleClipDrop"
        }
    ]
}