{
    "id": "148h3k8",
    "score": 5,
    "title": "Grad students: Looking for advice on student health insurance plan",
    "author": "Expert_Better",
    "date": 1686667570.0,
    "url": "https://www.reddit.com/r/Harvard/comments/148h3k8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m starting a PhD program in the fall and will be continuing my current full-time job as a part-time employee, so I’ll be able to stay on my health insurance plan. I’m trying to figure out if it’s better to do that, or to make the switch to Harvard’s student plan. I also will likely be leaving this job some time next year, either early on or mid-year, so I don’t know what the logistics are around getting on Harvard’s plan when I no longer have insurance through that job (or if they’ll even let me sign on at that time). \n\nWhat are other people’s experiences like in this space? I believe I have access to a financial aid advisor who can help me navigate some of this, but I wanted to first hear what actual students have witnessed.\n\nOn a related note - have any of you actually met with a financial aid advisor and if so, how helpful were they?\n\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "All I can say is that I have the student health plan and it's been pretty good. Have had regular checkups with my PCP at no cost. Had an ER visit with a CT scan and copay was like $100 which was then covered by the union fund. Have been to see three specialists over the past years, all were pretty easy to setup, I think copay was like $35 which was also then covered by the union fund.\n\nProbably either choice would be fine for you. Harvard will probably just tell you to stay on your employer health plan so they don't have to pay for your health insurance.",
            "score": 5,
            "author": "Abismos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got it, thanks!\n\nHere’s what feels like a dumb question - when the fees for the student health insurance plan hit our student account, do we have to pay that up front or does it come out of our stipend? I know they’re paying for our health insurance but I’m unsure of how the costs we pay come into play",
                    "score": 2,
                    "author": "Expert_Better",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Copays for specialists/ER showed up later and I paid them normally, like bank transfer or card I think, then request union reimbursement when they have their submission period. For prescriptions you pay at the pharmacy and can also request reimbursement for those receipts. Haven't had any other costs.",
                            "score": 3,
                            "author": "Abismos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I completely forgot there’s a grad student union! Looking into it now and I can see there’s a whole bunch we’re able to get reimbursed for which is fantastic. I currently use a mail order pharmacy for my prescriptions and seeing the copays associated with this under Harvard’s plan almost gave me a heart attack - so it’s sooo relieving to see this money can come back to me.",
                                    "score": 2,
                                    "author": "Expert_Better"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you’re on the GSAS financial aid package, you don’t have to pay for it up front. Both the bill and the financial aid gets posted to your student account in time for the thing to clear. I usually only have to pay a $25 student council fee every year but that might have been after the first stipend.",
                            "score": 3,
                            "author": "maps1122"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What’s the out of pocket max?",
                    "score": 2,
                    "author": "vertexnectarine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re a PhD student and have your stipend covered, the health insurance should also be covered. Excellent coverage. Went to Harvard health for urgent care and a bunch of PT, and there was absolutely no copay :)",
            "score": 4,
            "author": "sadphdbro",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I was wondering about, if there’s a difference for doctoral students vs others. I’ve been so confused looking over all the info packets on student health insurance while hearing coverage is great/not terribly expensive from a handful of folks, scratching my head. \n\nBut - the costs involved with prescription copay’s that I’m seeing suggest medications are super expensive especially if you use mail order pharmacy options, and that really flabbergasted me. I’m assuming this element of the insurance plan is consisted across students? Not sure if you know anything about this piece!",
                    "score": 1,
                    "author": "Expert_Better"
                },
                {
                    "level": 1,
                    "comment": "Question I forgot to ask before: Did you still have to pay the student insurance fee?",
                    "score": 1,
                    "author": "Expert_Better",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, I didn’t have to pay a free, but I’m also a STEM PhD student so I don’t know if GSAS does things differently from HGSE. My health insurance was completely covered. I think it should’ve come with your offer letter whether your health insurance would be covered. \nThe prescription copay depends on the medication. I think it’s covered to a certain percentage. My doctor found a cheaper alternative and it went from 30 bucks copay to 3 every couple of months.",
                            "score": 2,
                            "author": "sadphdbro"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would switch to the Harvard plan.",
            "score": 2,
            "author": "-Metacelsus-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any particular reasons why?",
                    "score": 1,
                    "author": "Expert_Better",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Harvard pays for your premium, and co-pays are low. Coverage is decent. I had insurance through my dad's job when I joined GSAS but switched to Harvard after turning 26. Harvard's was better.",
                            "score": 4,
                            "author": "-Metacelsus-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m switching to Harvard plan, I think it’ll be easier than dealing with network/ out of network ish. I’m taking sabbatical from my employer and they said our health plan is about 10k and I have to pay back if I don’t return. Harvard is about 5k for the year?",
            "score": 2,
            "author": "itswillertime"
        },
        {
            "level": 0,
            "comment": "[I would make sure that your plan follows GSAS and departmental policies](https://gsas.harvard.edu/policy/regulations-regarding-employment)",
            "score": 2,
            "author": "wyckyd_sceptre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reminder! I think I should be okay - I’ll likely be working less than 15 hours/week, and from much of what I’ve heard from current students in my program who have been willing to share what their experiences have been like with me, it sounds like the department (I’ll be at HGSE) doesn’t dig too deep to see if anyone’s working outside the school anyway. Hoping that remains true!",
                    "score": 2,
                    "author": "Expert_Better"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a grad student (masters not PhD) but the Harvard insurance is wildly expensive unless somehow it’s cheaper than your work insurance.  If you can afford it seems like great insurance but the estimate for insurance in my financial aid package was crazy expensive",
            "score": 1,
            "author": "The_other_one_2275"
        }
    ]
}