{
    "id": "hr852u",
    "score": 154,
    "title": "Trump administration rescinds rule on foreign students",
    "author": "vegatwyss",
    "date": 1594754981.0,
    "url": "https://www.reddit.com/r/Harvard/comments/hr852u",
    "media_urls": [
        "https://www.boston.com/news/national-news-2/2020/07/14/trump-administration-rescinds-rule-on-foreign-students"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 37,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "For now, yep! They’re reverting back to the March directive",
                    "score": 22,
                    "author": "bluejase_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are still in discussions with the schools on writing a new directive, but if you are in a program that is not normally online, then it will be OK.\n\nThe law is pretty clear on fully online education, so they need a reason for the exemption that makes sense to allow Harvard kids back but not allow University of Phoenix students to get visas.",
                            "score": 9,
                            "author": "SplamSplam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. Also a very high percentage of the tech companies that have grown in the past decade or so have been founded by either immigrants or children of immigrants. It's not that hard to see that many highly educated and skilled immigrants are job-creators.",
                    "score": 10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The government's attorney just walked into the room and announced they were folding completely, going back to the permissive March rule that suspends the in-person requirement for the duration of the emergency.\n\nProps to everyone involved: Harvard and MIT, their great lawyers, all the students who submitted testimony explaining what a hardship this would be, and *amicus* filers including hundreds of other universities, HGSU, and FIRE. Solidarity works!",
            "score": 39,
            "author": "vegatwyss"
        },
        {
            "level": 0,
            "comment": "Thank goodness",
            "score": 13,
            "author": "gdavtor"
        },
        {
            "level": 0,
            "comment": "A massive thank you to anyone who reads this who supported us.",
            "score": 7,
            "author": "dahliazuli"
        },
        {
            "level": 0,
            "comment": "Does anyone know how foreign exchange students that have gone home for the summer in countries where there are travel bans from entering the US are affected?",
            "score": 6,
            "author": "willduuu"
        },
        {
            "level": 0,
            "comment": "&lt;3",
            "score": 3,
            "author": "aghora_"
        },
        {
            "level": 0,
            "comment": "yay! now i can get rejected for some other reason!!!",
            "score": 2,
            "author": "sluttygrandmas"
        }
    ]
}