{
    "id": "umln9j",
    "score": 158,
    "title": "Duke Commencement speaker plagiarized the 2014 Harvard commencement speaker",
    "author": "jkitchen42",
    "date": 1652197349.0,
    "url": "https://www.reddit.com/r/Harvard/comments/umln9j",
    "media_urls": [
        "https://youtu.be/XnIW2yXYPdM"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "What was she thinking? The speeches are almost exactly the same!",
            "score": 61,
            "author": "adviceguru25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plagiarizing the personal stories really got me. I'd consider it very likely more issues would come up if someone looked back through her prior work.\n\nAs to what she was thinking, cultural differences between here and many countries in how plagiarism/cheating is viewed may be a component, as has the shift to viewing students as customers to be appeased across academia (look back through the events of the 2012 scandal here). It's often now about how likely you are to be caught and what the consequences will (or won't) be, as opposed to why taking someone's work and presenting it as your own effort is so wrong.",
                    "score": -12,
                    "author": "and_dont_blink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Surely any 4-year college student should know what is and is not plagiarism at this point.",
                            "score": 25,
                            "author": "adviceguru25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure, now tell me *why* it's wrong, especially if it becomes normalized. If that isn't instilled, it's just a generic honor code that can be used against you. Then let's talk about what happens if you get caught...\n\nIt's a larger problem where institutions as a whole have traded long-term prestige and branding for other things in the short term.",
                                    "score": -14,
                                    "author": "and_dont_blink"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Weird take. Southeast Asians know very well that plagiarism is wrong.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As do, I assume, citizens of Duke.",
                                    "score": 2,
                                    "author": "dwntwn_dine_ent_dist"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Southeast Asia\" pretty broad, as is the statement that they all view plagiarism as wrong. Someone can know something is wrong, yet it becomes trivialized and then normalized as [papers like this point out.](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=https://files.eric.ed.gov/fulltext/ED575015.pdf&amp;ved=2ahUKEwj8yaKgrtb3AhXsRt8KHS0SB6sQFnoECAUQAQ&amp;usg=AOvVaw1jbvPzWQbgxSIFrs2_hcPR) or [this one:](https://pubmed.ncbi.nlm.nih.gov/33667814/)\n\n&gt;Almost 96% (n = 153) of participants agreed that academic dishonesty constitutes a breach of professional codes of conduct with 97.5% (n = 156) stating it should be viewed as professional misconduct. Findings revealed 44.1% (n = 79) of participants reported engagement with at least one type of academic dishonesty. Of these, 55 (69%) reported involvement in two or more types.\n\nIn terms of there being different cultural norms (even within the USA) when it comes to academic dishonesty, there is a [wealth of data out there.](https://www.researchgate.net/publication/316462677_Academic_Integrity_in_Higher_Education_The_Case_of_Plagiarism_of_Graduation_Reports_by_Undergraduate_Seniors_in_Vietnam). Often it gets difficult because what one culture thinks of as fine is considered blatant dishonesty by another; eg \"She got the speech done, changed some words, and she DID give the speech what's the problem?\" There probably won't really be one.\n\nThe context of the question was why, and the answer is generally \"because I didn't think it was wrong, or I didn't think I'd be caught, or I'm generally not afraid of the consequences of being caught.\"",
                                    "score": -2,
                                    "author": "and_dont_blink",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Even if there are cultural differences, she went to a 4 year college in the US. She knew right from wrong in this context, and she chose wrong.",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If your argument is that academic dishonesty is wrong and she chose it, we are in agreement. But the context was *why*, and a surprising amount of people wouldn't see any issue with what she did, and it isn't being ingrained at the institutional level in the ways it was in the past.",
                                                    "score": 1,
                                                    "author": "and_dont_blink",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not denying that cultural differences might have a role in the tolerance of plagiarism across societies. I'm arguing it had no role here. Her being Pakistani has nothing to do with her decision to plagiarize. She has been in the U.S. long enough to know right from wrong, cultural differences plays no role in this discussion.",
                                                            "score": 6,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bro plagiarism is legit a thing in Asian countries too. This was not about culture, this was about being an arrogant and daft person lol",
                                                                    "score": 5,
                                                                    "author": "seeker_313",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;Bro plagiarism is legit a thing in Asian countries too.\n\nNot the OP, but you seem to be misunderstanding what you are responding to.\n\n&gt;This was not about culture, this was about being an arrogant and daft person lol\n\nFair take, I'll bow to your experience.",
                                                                            "score": 2,
                                                                            "author": "and_dont_blink"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You know plagiarism is universally regarded as unethical, right? What do you think, only Americans believe in intellectual honesty? Lmao",
                            "score": 3,
                            "author": "seeker_313",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does your comment seem like an intellectually honest representation of mine?\n\nCulture is simply a set of learned behaviors, and there's plenty of variation even within America. As noted in another comment, academic dishonesty is universally considered wrong, but also completely acceptable in some cultures  -- even the norm -- and has been becoming moreso on all campuses in general as they view students as a population to appease rather than educate.\n\nAgain, the context of this is wondering why someone would think it's OK to go up on stage and plagiarize someone's speech while just changing some words.",
                                    "score": -2,
                                    "author": "and_dont_blink",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "bro shes been at a US university for 4 years, there no way she wouldn’t know plagiarism is bad",
                                            "score": 4,
                                            "author": "revilo79",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think it's in question that she'd have been told about academic dishonesty? The question was why would she choose to do it's down the personal anecdotes -- likely because she didn't think it was wrong, OR she didn't think she'd be caught, OR if she was the repercussions wouldn't be dire.",
                                                    "score": -1,
                                                    "author": "and_dont_blink"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Duke should check all the work she's submitted. It's unlikely this is the first time she's done something like this.",
            "score": 54,
            "author": "Yazars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thieves rarely start with a bank.",
                    "score": 36,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, that’s damning.",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has the potential to dredge up Joe B’s plagiarism. Please delete all references.",
                    "score": -12,
                    "author": "Krambazzwod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That debacle made me lose all respect for him.",
                            "score": -9,
                            "author": "Thoreau80",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huh?",
                                    "score": 6,
                                    "author": "pinkerton_jones",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Joe B = Joe Biden. Google \"Joe Biden's Plagiarism Problem\"",
                                            "score": 0,
                                            "author": "SplamSplam"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did she say the content in the same sequence, too?",
            "score": 26,
            "author": "Ok-Kaleidoscope-7320",
            "replies": [
                {
                    "level": 1,
                    "comment": "Identically - it seemed so forced the entire time she was on stage",
                    "score": 40,
                    "author": "jkitchen42"
                },
                {
                    "level": 1,
                    "comment": "This has a useful side-by-side breakdown:\n\nhttps://www.thecrimson.com/article/2022/5/11/duke-speech-appears-plagiarized/",
                    "score": 3,
                    "author": "nellynai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What would be the consequences if she was found guilty of plagiarism?",
            "score": 16,
            "author": "Ok-Kaleidoscope-7320",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, she was going to work at an MBB firm so that may be on the chopping block",
                    "score": 29,
                    "author": "jkitchen42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also a big risk is that someone dives into her college works and finds evidence of plagiarism there--which could obviously throw her whole degree into question.\n\nThis could just be a one-off for her...but smoke, fire, etc...",
                            "score": 22,
                            "author": "farmingvillein"
                        },
                        {
                            "level": 2,
                            "comment": "Well that sucks",
                            "score": 4,
                            "author": "brokecollegekid69"
                        },
                        {
                            "level": 2,
                            "comment": "But arguably, consulting is all about copying past work, so…",
                            "score": 3,
                            "author": "nellynai"
                        },
                        {
                            "level": 2,
                            "comment": "I think'll it'll absolutely be on the chopping block. A prestigious firm doesn't want clients to google the name of a person working for them and find controversy",
                            "score": 1,
                            "author": "Soliantu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't finish the video I'm cringing so hard",
            "score": 12,
            "author": "RealPrinceJay"
        },
        {
            "level": 0,
            "comment": "That is the year I graduated.  I vaguely remember her speech listening to it again.  This is so odd.  Did she just search \"commencement speeches\" on YouTube or something?",
            "score": 7,
            "author": "mcjon77"
        },
        {
            "level": 0,
            "comment": "Parkash released the following statement to ABC11 on Tuesday night.\n\n\"When I was asked to give the commencement speech, I was thrilled by such an honor and I sought advice from respected friends and family about topics I might address. I was embarrassed and confused to find out too late that some of the suggested passages were taken from a recent commencement speech at another university. I take full responsibility for this oversight and I regret if this incident has in any way distracted from the accomplishments of the Duke class of 2022. \"",
            "score": 6,
            "author": "seinfieldjp",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is literally implying that a friend wrote it for her which is no better 💀",
                    "score": 15,
                    "author": "makmakt1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“I sought advice from ‘respected friends’” sounds a lot better than “I paid a consultant to write my speech,” which I’m guessing is what happened here. \n\nThe fact that she paid a PR firm to craft this apology shows that she has money and she isn’t afraid to use it.",
                            "score": 8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Did a friend write this public apology for her too? 🫣",
                            "score": 4,
                            "author": "nellynai"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She is lying even in her explanation. She was not asked to give the speech. She applied with the concept which was the the basis of the application.",
                    "score": 6,
                    "author": "Throwaway-change"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She probably had no idea the thing was plagiarized. She released an apology—a bad one at that—through a *PR firm,* that blames “friends and family” for grabbing select passages from the speech. So she’s got money. It’s much more likely that she paid one of these “friends” to write the speech and this is what they cobbled together. She probably got the speech, read it a few times, and was none the wiser. \n\nThey should look into her academic history to see if this has happened before. You don’t just wake up one day, on maybe the biggest day of your collegiate career, and plagiarize a speech.",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We don't know that she didn't 'write' the speech herself. That statement from the PR firm could be absolute bollocks for all we know. It seems to me that she's trying to evade full responsibility by playing the clueless victim of other people's shoddy work - 'oh I didn't plagiarise... no it was my friends and relatives! yeah them! I should've double checked but I didn't'\n\nAlso the statement doesn't really explain her ripping off the airport anecdote from the original speech. Unless she had an identical experience with airport security like the original speaker (which I doubt), then she had to have known that was a lie whether relatives/friends wrote that for her or not.",
                            "score": 4,
                            "author": "Lolking112"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huge yikes.",
            "score": 4,
            "author": "peebsthehuman"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The valedictorian at Duke was not chosen for top grades. Interested students were invited to submit concepts for the speech so she sought out the opportunity and had the fraud lined up before she embarked on it.  \n\nThis movie is going to take a predictable turn. In a matter of weeks people will switch over to defending her, saying she is being targeted by online bullies and she is a victim of patriarchal backlash because she tried to take her rightful place in the world. Details remain to be worked out but will likely be her dad \"making her\" apply, giving her this speech to read \"even though she wanted to write her own\", and making her read it.  \n\nEventually she'll get gigs as a motivational speaker sought after for her ability to inspire people to overcome their obstacles, and will probably run for office. Cynical prediction but wait and see :)",
                    "score": 7,
                    "author": "Throwaway-change"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Neither of these seem like interesting speeches",
            "score": 15,
            "author": "bruyeres",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol it’s the over-over-extended metaphor for me.  \n\nThis coulda been so simple — if she really loved the speech just preface it by saying “A while ago I heard a Harvard commencement address that I found interesting.  For Duke it might go something like this: “\n\nNobody listening would really care, and hardly anyone would remember she said she was basing it on another speech.",
                    "score": 20,
                    "author": "Temper03"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't be too hard on Duke, they lost to UNC twice.",
            "score": 8,
            "author": "Maverick721"
        },
        {
            "level": 0,
            "comment": "Almost hard to say plagiarized since it was far worse than the original. Come on, do better.",
            "score": 2,
            "author": "WildlifePhysics"
        },
        {
            "level": 0,
            "comment": "Seriously what they teach at Duke?",
            "score": 1,
            "author": "Pleasant-Lie-9053"
        },
        {
            "level": 0,
            "comment": "O ..M ….. G …. !!!",
            "score": 1,
            "author": "Electronic_Comb7733"
        }
    ]
}