{
    "id": "vs1j7d",
    "score": 2,
    "title": "Question on class locations",
    "author": "guidotheguido",
    "date": 1657037576.0,
    "url": "https://www.reddit.com/r/Harvard/comments/vs1j7d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, all,\n\nI'm starting a doctoral program next month and I'm currently trying to plan out my classes. Is there a way to see where courses have been held in the past, or, ideally, where they'll be held in the coming semester? The search on-line just lists TBA everywhere. I tentatively have two back-to-back courses with fifteen-minute breaks between them, and, as much as I want to take all four, I'm a bit hesitant to sprint across a still-unfamiliar campus twice a week.\n\nI'd appreciate any insights or suggestions. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Is there a way to see where courses have been held in the past\n\nThat does not necessarily indicate where they will be held in the future. But **in general**, most courses for a given department are in the same building.\n\nRegardless, 15 minutes is ample time to get between classes from most buildings",
            "score": 5,
            "author": "skieurope12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks very much! In my past visits, everything does seem to be quite close and it feels pretty integrated",
                    "score": 2,
                    "author": "guidotheguido",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. Unless you have a class in the observatory, all the buildings on the Cambridge side are quite close together.",
                            "score": 1,
                            "author": "skieurope12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's somewhat outside my purview, unfortunately",
                                    "score": 1,
                                    "author": "guidotheguido"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends a bit on your program, but, in general, the buildings and rooms should be a short distance apart. The classrooms are likely all within short walking distance from your home department's offices.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! That makes great sense",
                    "score": 2,
                    "author": "guidotheguido",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re welcome. Campus will feel small and intuitive to navigate before you know it. Make your ideal schedule now and you can always adjust if a certain class happens to be in some preposterous place, but that’s not likely to happen. Given that you’re in a doctoral program, it’s not terribly unusual to make little adjustments while you’re doing coursework and your department administrators will work to make sure that everything lines up for your success.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "15 min is usually more than enough time to get to the next class. I had a class in Vanserg all the way in the Divinity School and still made it to classes in Sever back when we only had 7 min.",
            "score": 2,
            "author": "foreverstarlit"
        },
        {
            "level": 0,
            "comment": "You can look at prior course syllabi on the Syllabus Explorer, which should include those locations usually.",
            "score": 1,
            "author": "honeymoow"
        },
        {
            "level": 0,
            "comment": "You'll get used to the campus map soon. If you happen to have classes between the SEC (very South) and Pierce (very North) like I did, I recommend getting a scooter or a bike or a bluebike membership (you get a school discount), or take the shuttle if the weather is bad, and you should be fine. SEAS classes can have this arrangement since SEAS splits its department all over the campus. But like others said, for other departments, the classes should be close to each other.",
            "score": 1,
            "author": "jk_xz"
        },
        {
            "level": 0,
            "comment": "Get a scooter",
            "score": 0,
            "author": "Pleasant-Lie-9053"
        }
    ]
}