{
    "id": "vt93f1",
    "score": 7,
    "title": "Need advice again for a J1 research acholar friend",
    "author": "DisassociatedDreams",
    "date": 1657165546.0,
    "url": "https://www.reddit.com/r/Harvard/comments/vt93f1",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'll go light on details to avoid identifying this friend of mine. Use your imagination I guess. \n\n PI asking them to go to their home to do \"personal chores/tasks\".\n\nPI asking them to do things that break workplace safety rules.\n\nAnd of course mandatory 60-70 hour weeks but I have been told previously that's \"\"normal\"\"for academia. \n\nThat stuff screams \"abuse of power\" to me but I am ignorant to academia \"norms\".\n\nIf this stuff is \"normal\" then academia is like half a century behind on workers rights holy shit. \n\nAaaaanyway, Friend is afraid to file a complaint or seek help for fear of retaliation if PI guesses who filed a complaint(small team). They could lose their visa and wreck their degree and career if they were kicked out of their project. \n\nSo. . .\nUh. . .\nAny pro tips or advice? \n\nI can't/won't do anything beyond seek information. Don't wanna cause trouble for them.",
    "comments": [
        {
            "level": 0,
            "comment": "Assuming your friend is in doctoral program? If so, they could start with the Dean of Students for GSAS. If they are a postdoc they could start with Omsbudsman’s Office? Those are just two thoughts. Both places really and truly are meant to support students or employees. They can at least listen and give best next place to go. Of course your friend is wise to proceed carefully. They can always do the “I am asking about a situation involving my friend”. And if then use the “in my friends case what would be your obligation to share information? To whom would it be shared?”\n\nhttps://gsas.harvard.edu/student-life/harvard-resources/office-student-affairs\n\nPatrick and Jackie are great. I haven’t worked with Sam at all so can’t say.",
            "score": 7,
            "author": "Cormyll666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a lot. Ill let them know. They also clarified a few things after a talk. \n\nThe acceptance letter did come from Harvard medical school. \n\nThey do actually get paid a small stipend and also get some small amount money from their home country. Stipend comes from the PIs grant.\n\nPI is actually not working at Harvard, wrong friend wrong PI, my mixup. PI just works at MGH(as far as we know).\n\n Friend is working on their PHD, is not a post doc.\n\nWith the funding and PI situation,  Does this make them a student or employee?? Both? Neither?  Some sort of quantum nonsense where they are both and neither? \n\nIt's so confusing to me, academia is convoluted. The program that accepted them is Harvand medical school, but the PI is not working at Harvard and the funding as far as they know does not come from Harvard(I don't know how to check either). Does Harvard just help arrange completely unaffiliated jobs for students to get practical experience? Is Harvard medical school just partnered with MGH but doesn't fund the projects? Is it all case by case?\n\n They are heavily considering just quitting and looking for another lab/program to finish their traveling reasearch scholar studies(I think that's the right name). They are so stressed and exhausted and its genuinely painful to see them go through that.  Ill see if they will give the \"theoretical anonymous friend\" thing a try. \n\nThanks again for the help.",
                    "score": 1,
                    "author": "DisassociatedDreams",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So things can get complex real fast around here. They should be in touch with the Dean of students of the program they are a student in (over at Harvard it’s weird but if PhD I imagine that is GSAS??? \n\nThe Dean of Students can at least IMMEDIATELY know, based on program, the best resources or best point of contact. \n\nHonestly, if they just want to find out where to start they could email Patrick or Jackie who can direct them right. That is no sleight to Sam, I just happen to know Patrick and Jackie’s work and they are both great. I am sure Sam is too, I just don’t know him personally. \n\nGood luck to your friend. I am rooting for them as I always root for students!\n\nAcademia especially at an R1 IS A FUCKING HELLSCAPE. So your friend is right to tread very carefully. Again, they can approach any situation by asking the confidentiality involved and also framing things as hypotheticals until they are confident the advice they are receiving is in their best interest as they see it.",
                            "score": 1,
                            "author": "Cormyll666"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your friend is on a J-1 visa at MGH and is not paid by Harvard, so I do not think GSAS would be able to help. Is the person running the lab affiliated with Harvard?",
            "score": 4,
            "author": "SplamSplam",
            "replies": [
                {
                    "level": 1,
                    "comment": "From what I was told, I believe the PI teaches at Harvard. Not sure if they are a tenured professor or what, but I will find out and get back to you. As for MGH thing, I  believe it was Harvard medical school that sent the acceptance letter. I know MGH and Harvard medical school are connected, but I won't pretend to know exactly how that partnership works. I'll clarify with my friend and let you know.\nEDIT:some of this is wrong, see my other reply in the chain for more updated (but still incomplete) Information.",
                    "score": 2,
                    "author": "DisassociatedDreams"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That does not seem normal but your friend is also in a really tricky situation. Is there like a department head they could turn to?",
            "score": 3,
            "author": "Sweet-Mango7199"
        },
        {
            "level": 0,
            "comment": "a prof at a different school got into a lot of trouble making their students run personal errands… but as others said, if your friend burns this bridge their career could also blow up if this comes out.\n\nIt also sort of depends on whether your friend got into this lab based on a personal relationship with the PI or whether they got here and then chose this particular lab. you said they aren’t paid by harvard, which is a bit odd, but assuming they are in a phd program at harvard, they can always elect to join a different lab.  I know a few that switched, one as late as 5 years in, soooo, that might also be an option.\n\n70+ hours though seems pretty normal. depending on program there are labs where people work much less, but 70+ doesnt seem that out of place to me",
            "score": 2,
            "author": "phonartics",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe their funding was provided by their home government. At least mostly. Ill doible check. And I am asking them more details about their program and will get back to you. They are a PhD student though.",
                    "score": 1,
                    "author": "DisassociatedDreams"
                },
                {
                    "level": 1,
                    "comment": "I am also blown away that my friends career hinges on her tolerating someone else's unprofessional behavior. \n\nIf my manager at any job I have ever had was having me run personal errands or take care of stuff at their house, they would get fired instantly as soon as it was confirmed by hr. \n\nAlso pretty shocked that some of the legal workers protections about forced unpaid overtime etc straight up don't apply to some academic student jobs (from what I have read).",
                    "score": 1,
                    "author": "DisassociatedDreams",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "academia is in the stone age of working conditions and norms. ive seen plenty of postdocs that plan to run labs the same way as they were treated because they see it as a rite of passage.\n\nalso i guess it’s a bit gray whether it’s you’re an employee or a student.  some places dont even give 401k for postdocs. post docs can also be on j1 visas, which is kind of odd afaik, because i thought the pt of a j1 was that you cant “work”",
                            "score": 1,
                            "author": "phonartics"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "if they're super-nervous about doing anything, they can start here, it's completely anonymous  - https://ombudsman.harvard.edu/",
            "score": 2,
            "author": "phdnotadoctor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "DisassociatedDreams"
                }
            ]
        }
    ]
}