{
    "id": "w4jp9n",
    "score": 0,
    "title": "CS 50 vs CS 1?",
    "author": "Livid_Ad8118",
    "date": 1658417740.0,
    "url": "https://www.reddit.com/r/Harvard/comments/w4jp9n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone? Im interested in taking a cs class this upcoming year and while I was planning on taking cs 50, I saw in a thread someone suggested to actually take cs 1. Both say they are for people with little or no coding experience so was just wondering what you guys think about both courses and any advice on which one to take?",
    "comments": [
        {
            "level": 0,
            "comment": "CS50 will actually teach you how to code.\n\nCS1 will teach you the very basics of programming and computer science.\n\nFor a first-year, I would definitely recommend taking CS50, even if you have no coding experience. It's a challenging course (especially for beginners), but it'll be rewarding in terms of the material you learn. Plus, you can always take CS50 pass-fail and the grading is fairly lenient.",
            "score": 5,
            "author": "adviceguru25"
        },
        {
            "level": 0,
            "comment": "I commented about CS50 [here](https://www.reddit.com/r/Harvard/comments/vs9h4u/cs_for_economics/if02btr/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3) a couple weeks ago. Lots of people take CS50 with no/little experience and it really is a good intro class.\n\nCS1 seems to be taken by people who want to learn a bit of coding but aren’t too interested in CS. It also seems to have a bit of an ethics/privacy spin. Read the Q guide too to see past students’ comments.",
            "score": 2,
            "author": "unsourire"
        },
        {
            "level": 0,
            "comment": "Take CS50.",
            "score": 2,
            "author": "Ok-Kaleidoscope-7320"
        },
        {
            "level": 0,
            "comment": "CS50 is an amazing class.  I completed. I have taken a lot of computer classes, but IMHO it was the best computer class I ever took.  With that said, I know nothing about CS1.",
            "score": 1,
            "author": "yourPWD"
        }
    ]
}