{
    "id": "wfopj5",
    "score": 0,
    "title": "How do class presidents work",
    "author": "Jazzlike-Yellow-9499",
    "date": 1659578180.0,
    "url": "https://www.reddit.com/r/Harvard/comments/wfopj5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve heard that some governing organization was replaced after last year. How does that affect student body presidents or class presidents? How do these and general student government work at Harvard?",
    "comments": [
        {
            "level": 0,
            "comment": "There are no class presidents, and I'm pretty sure how the HUA works first-years won't be able to hold an office until the spring when there are new elections. \n\nThere are still student-body presidents but they just run a different organization (HUA instead of UC). As for \"major changes\" (putting it in quotes here for a reason), they used to be representatives for each freshmen yard and each upperclassmen dorm, but those were replaced by officers relating to certain aspects of the university (e.g I think now the job titles are like an academic officer, social life officer, activities officer, etc.).",
            "score": 1,
            "author": "adviceguru25"
        },
        {
            "level": 0,
            "comment": "Please drop your name so I can make sure to not vote for you.",
            "score": -8,
            "author": "fredfredfredasdf",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fun drinking game, go through the Harvard subreddit and take a sip everytime someone says something snarky or rude for no reason",
                            "score": 3,
                            "author": "Phitsik23"
                        },
                        {
                            "level": 2,
                            "comment": "They could also have waited like 3 weeks and found out the normal way.",
                            "score": 1,
                            "author": "gacdeuce"
                        }
                    ]
                }
            ]
        }
    ]
}