{
    "id": "wo09fk",
    "score": 2,
    "title": "Best instructors/courses at the Harvard Kennedy school?",
    "author": "avery_404",
    "date": 1660461523.0,
    "url": "https://www.reddit.com/r/Harvard/comments/wo09fk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I'm not a Harvard student but have recently gotten the chance to take a course or two there. I was wondering what the best instructors/courses are at HKS? Thanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "Exercising Leadership by Ron Heifetz is a perennial favourite.",
            "score": 1,
            "author": "ObiWan_Zenobi"
        },
        {
            "level": 0,
            "comment": "\n\n\n\nHi! I just graduated from HKS actually. There’s a few star professors that it might be cool to take classes with depending on your interests. \n\nSince I was an international relations/security studies concentrator, I found the classes with Graham Allison and Ash Carter pretty interesting. However, my personal favorite is between Zoe Marks who has a class on Africa and Tarek Masoud who studies the Middle East. \n\nThere’s also a number of leadership and writing courses that are apparently worth their weight in gold. People swear by Ron Heifetz. I didn’t get the chance to take his class, but some have described it as “life-changing.” \n\nPM me if you want any more details!",
            "score": 1,
            "author": "ezikuhl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lovely, thank you so much!",
                    "score": 1,
                    "author": "avery_404"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of my favorite courses were: Arts of Communication; Entrepreneurship in the Public and Nonprofit Sectors; Agribusiness. \n\nIn general, I would recommend you take courses related to your career interests and that are taught by well-regarded professors.\n\nSince HKS is a professional school, your professors will be well connected in their industries and could possibly connect you to research, internship, and/or full-time opportunities if you do well in their course and establish a personal connection with them (by going to office hours and interacting with them on a human level).",
            "score": 1,
            "author": "TheArtofApplying"
        }
    ]
}