{
    "id": "wx175o",
    "score": 25,
    "title": "Considering dropping out of HKS",
    "author": "BudgetWeekly8317",
    "date": 1661391879.0,
    "url": "https://www.reddit.com/r/Harvard/comments/wx175o",
    "media_urls": [],
    "other_urls": [],
    "postText": "[deleted]",
    "comments": [
        {
            "level": 0,
            "comment": "Perhaps I am of the minority opinion, but it seems premature to speak of \"meaningful relationships\" if you're only a few days into a program. I can't speak to the specifics of HKS, but socially transitioning into any new program can be difficult. Give it time. If you still hate it after a semester, you can reevaluate.",
            "score": 55,
            "author": "Confident_Promise_71"
        },
        {
            "level": 0,
            "comment": "You're three days into orientation week. Turn down the drama and turn up the effort\nNo one would mistake me for a social and extroverted person but I've found nothing but welcoming people at Harvard and made lots meaningful relationships",
            "score": 71,
            "author": "bruyeres",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am three weeks into my programme. Not 3days.",
                    "score": 3,
                    "author": "BudgetWeekly8317"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My comment will come across as cliche/cringe to some, but I genuinely mean it.\n\nIt gets better. Stay the course. Interactions will get better and as you settle away from expectations and into your new reality—I truly believe you will find comfort in change.\n\nChange in your intellectual curiosity and change in yourself as you push boundaries in interactions which, in the beginning, feel rivalrous and surface level.\n\nThere will come a time where you will be deep into research, projects, psets, or assignments with your peers—these times are moments of growth and times you will develop a deeper connection with others. And you will find that your feelings are not so isolated and others will validate your feelings with their own experience/vulnerability.\n\nThe alternative is to lean in to comfort, lean in to what feels safe now; but ask yourself, who do you want to be and will your future self thank you dropping out? If the answer to the later is yes, then for sure transfer/drop out. However, remember why you started the program and know the future is not easily predicted. You had expectations of the program, and thus far, the beginning is not at all what you hoped for. This will happen again in the future, however, it will happen to be that your expectations of failure/disappointment are challenged. The future is not so easily predicted. Whatever you decide, I wish you the best.",
            "score": 22,
            "author": "Unchartedesigns"
        },
        {
            "level": 0,
            "comment": "My rule of thumb is it always takes a full month to get socially settled into an entirely new place. Patience. And honestly, someone trying to have deep, meaningful conversations if I've known them 3 days? That is usually offputting in its intensity. Give it some more time.",
            "score": 13,
            "author": "KittyScholar"
        },
        {
            "level": 0,
            "comment": "Felt so odd reading this from OP. I had a good time at HKS, and made friendships that have lasted for years since I left. Indeed, I remember thinking that I had “found my tribe” while I was at HKS. There will always be “feral networkers” in a place like Harvard; you got to put in the effort to sift through the chaff. Lots of smart, humble and nice people there, if you’re willing to put in the effort to also be smart, humble and nice in return :)",
            "score": 9,
            "author": "ObiWan_Zenobi"
        },
        {
            "level": 0,
            "comment": "A few days is much too quick to quit, relationships take time to build. Keep putting in the effort",
            "score": 8,
            "author": "Kumquat_KilIer"
        },
        {
            "level": 0,
            "comment": "Your feelings are genuine - I remember starting and feeling lost. It took time to adjust to the networking, the unending parade of events, and to be honest…not being the smartest person in the room anymore. Harvard is a place of incredible opportunity and that can be overwhelming to take in all at once. \n\nMy experience was that the feelings of alienation and anxiety about your program are temporary. You will find your way toward student and professional groups around campus that have people you can relate to and that will make life easier over time…or you will become too busy to care by the end of October. \n\nTake a deep breath. You will find your path.",
            "score": 5,
            "author": "Newnetherlander"
        },
        {
            "level": 0,
            "comment": "A lot of people say HKS is the most cliquey. But you’re three days into it. Remember why you came here and give it a fair shot. \nHKS is very diverse and ripe with opportunities, keep trying.",
            "score": 6,
            "author": "crispr-dev",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am three weeks into my programme",
                    "score": -1,
                    "author": "BudgetWeekly8317",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s still a relatively few days. In a couple of months you won’t even remember your first few weeks.",
                            "score": 2,
                            "author": "Beginning_Brick7845"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sure we can find a few thousand people to take your spot.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "So? If you complain about anything in your life I could also say that a poor unprivileged person would love to be you despite your problems",
                    "score": 3,
                    "author": "BudgetWeekly8317"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sorry but are you looking for pity?\nWould you like someone to say, “ there, there it will get better” \nYou are at school that people would die to get in…\nIf you want to quit. Quit.",
            "score": 4,
            "author": "yendor937",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Would you like someone to say, “ there, there it will get better”\n\nHonestly, yeah. I uprooted myself from the life I have known for years. I wanted a good time. It's been three weeks of discomfort and insecurity. I am looking for reassurance and I don't think I am a criminal to be wanting that.",
                    "score": 8,
                    "author": "BudgetWeekly8317",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In 3 months you will think very differently",
                            "score": 3,
                            "author": "Substantial-Past2308"
                        },
                        {
                            "level": 2,
                            "comment": "I know the feeling. Going to HLS was my first time living more than a few miles away from my family, wife (then gf) and her family, and my best friends. It’s tough—sorry if others haven’t been more understanding of that.\n\nI struggled for a semester or so to find my place socially during law school. Things sort of just fell into place eventually, and I’m glad I stuck it out. YMMV, but I’d guess it will get better for you.",
                            "score": 2,
                            "author": "PBJLlama"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, go with your gut. Even if in a couple of years you come to the conclusion that dropping out was not the wisest choice, those years would provide you with the crucial firsthand experience that makes your gut feel confident and positive, rather than being anxious and stressed in your program. Don't let Harvard be the most important part of your identity, especially when it doesn't make you feel good. You are the most important person in your life and your feelings and gut reactions matter.",
            "score": -4,
            "author": "birdcourse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your kind message. I am sorry people downvoted you. If anything reading this made me feel better",
                    "score": 2,
                    "author": "BudgetWeekly8317"
                }
            ]
        },
        {
            "level": 0,
            "comment": "some Harvard drop out turn out great:) follow your passion and dream",
            "score": 1,
            "author": "Pleasant-Lie-9053"
        },
        {
            "level": 0,
            "comment": "Been here. DM me to chat",
            "score": 1,
            "author": "obeyythewalrus"
        }
    ]
}