{
    "id": "wyhlut",
    "score": 16,
    "title": "CS 50 pass/fail",
    "author": "Dogmama2712",
    "date": 1661541168.0,
    "url": "https://www.reddit.com/r/Harvard/comments/wyhlut",
    "media_urls": [],
    "other_urls": [],
    "postText": "First year looking to concentrate in computer science. I have registered for CS50 this fall. I have heard it’s a weeder course so I’m thinking of taking it pass/fail. What are the pros and cons of doing this?",
    "comments": [
        {
            "level": 0,
            "comment": "I would say it’s the opposite of a weeder course, I wouldn’t say we even have weeder classes at math/cs/stat at Harvard.\n\nThe point of the class is to make CS more accessible to people that were not planning to concentrate on it originally. The class is pretty much a show, and you might end up putting 10h+ but I don’t know any single CS student that didn’t get at least an A- in the class.\n\nThis class is considerably easier than the theory classes.",
            "score": 30,
            "author": "boring_AF_ape",
            "replies": [
                {
                    "level": 1,
                    "comment": "i took it pass/fail in 1997 and almost failed",
                    "score": 6,
                    "author": "slurpeee76",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, I guess the class changed",
                            "score": 7,
                            "author": "boring_AF_ape"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you actually are going to put in the work (expect at least 10 hrs with no experience) then you should take it for a letter grade. Most of the class ends up with an A or A-.\n\nCS50 isn’t a weeder class. It’s tailored to be a course that anyone can take. The only reason people would say it’s a weeder course because they think it’s hard.\n\nIf you’re actually planning to concentrate in CS, you should take it letter graded, period. Taking it SAT/UNSAT only leads to cheating yourself in terms of effort.",
            "score": 16,
            "author": "adviceguru25"
        },
        {
            "level": 0,
            "comment": "CS50 is time consuming, but it’s also incredibly easy to get a good grade. I took it pass/fail and strongly regret it lol. In just trying to finish the PSets and make sure things work and stuff like that I had an easy A and did really well on the Final\n\nBig mistake :/",
            "score": 7,
            "author": "RealPrinceJay"
        },
        {
            "level": 0,
            "comment": "Take it for a letter grade. Just make sure you do decent on the test (around the median and an 85% should get you an A) and turn your psets on time and get all the correctness points. Lowest grade you’ll get is an A- if you do the work in the class.",
            "score": 5,
            "author": "Anxious_Positive3998"
        },
        {
            "level": 0,
            "comment": "I liked the class a lot but I was putting in 10+ on the PSETs",
            "score": 2,
            "author": "ChallengeDesigner370"
        }
    ]
}