{
    "id": "xhowj5",
    "score": 11,
    "title": "Switching PhD program",
    "author": "Hot_Ad_715",
    "date": 1663527457.0,
    "url": "https://www.reddit.com/r/Harvard/comments/xhowj5",
    "media_urls": [],
    "other_urls": [],
    "postText": "How feasible is it to change from one phd program to another? My advisor is in SEAS which is not where my program belongs. I want to move to SEAS and have been doing coursework in the program I want to switch to. Of course I should talk to my advisor eventually but I thought I should ask here first to see if anyone has experience in this process. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "You can’t transfer PhD programs like you change majors in undergraduate. You have to reapply.",
            "score": 23,
            "author": "professorbix"
        },
        {
            "level": 0,
            "comment": "From [GSAS admissions policies](https://gsas.harvard.edu/admissions-policies/transfer-different-degree-programs):\n\n&gt;Current or former GSAS students who wish to apply to a new degree program, change their degree, or to transfer to a different degree program must apply through the standard admission process. \n\nI know of exactly one case of within-Harvard transfer between PhD programs, and it is not a situation you want to be in. The student in question had failed the course-based written qualifying exam in his original program (I think twice) and was going to be kicked out. Because his research was going quite well, he was admitted into another PhD program his advisor was affiliated with that did not have a course-based qualifying exam.\n\nPlenty of people have advisors in other department or schools and find ways to make the course requirements work for them. Unless there are more serious issues than \"I'd just rather be in this other program\", it's probbaly easier to stay put.",
            "score": 13,
            "author": "aggressive-teaspoon"
        },
        {
            "level": 0,
            "comment": "Ummm, if your PhD program allows you to take the coursework that you want to in SEAS and your advisor in SEAS is someone with whom who your current program allows you to do research, why do you need to change PhD programs???\n\nIn other words, unless your current program is preventing you from taking certain classes in SEAS or preventing you from working with certain advisors that you want to work with within SEAS, why would you even bother with the headache of changing your PhD program? That makes no sense.\n\nIf you're doing it for the name on the degree or the school affiliation, let me tell you now that the subject or the specific school within Harvard that is listed on your degree doesn't determine what you go on to do in the real world--what you learn, what you do your thesis on and what you make of your journey in graduate school is what matters, and is what employers really look for. Go and study what you want to study and make your experience in grad school what you want it to be, but forget about changing your PhD program unless the program requirements or admin are making it difficult for you to study what you want to--from what you've written, that does not seem to be an issue at all.",
            "score": 10,
            "author": "Carbonylatte"
        },
        {
            "level": 0,
            "comment": "Usually impossible. Only seen it once in a special situation.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "does it matter what program your advisor is in?",
            "score": 1,
            "author": "phonartics"
        },
        {
            "level": 0,
            "comment": "I know of someone who changed departments within GSAS. I don't know the details though. I'd think that the place to start would be seeing if a faculty member in the department you want to be in is willing to work with you. From there, you could strategize about how to make it happen.",
            "score": 1,
            "author": "nicethrowaway97"
        },
        {
            "level": 0,
            "comment": "I tried, and found out it's not possible.",
            "score": 1,
            "author": "-Metacelsus-"
        },
        {
            "level": 0,
            "comment": "I don’t get it… why don’t you just keep your advisor as your co-advisor and find someone else from seas to be another co-advisor? That wouldn’t look bad to anyone and should be the easiest for yourself too",
            "score": 1,
            "author": "dolcevitaqui",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean find someone in ur current dept to be another co-advisor",
                    "score": 1,
                    "author": "dolcevitaqui"
                }
            ]
        }
    ]
}