{
    "id": "xjcte0",
    "score": 12,
    "title": "Where to Visit for a Short Trip to Cambridge",
    "author": "ChasingHorizon2022",
    "date": 1663689953.0,
    "url": "https://www.reddit.com/r/Harvard/comments/xjcte0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all, extension student here. I'll be on campus next weekend for our convocation event and I'll get to pretend to be a real life harvard student. I've planned a couple days ahead of then to check out the campus and surrounding area. Are there any good food spots or anything else around I should make sure to check out while I'm in town?",
    "comments": [
        {
            "level": 0,
            "comment": "Harvard-y things to visit:\n\n* Harvard Art Museums\n\n* Harvard Museum of Natural History (especially glass flower exhibit)\n\n* Memorial Hall. The doors on the sides are sometimes open and you can go in and look at the stained glass from inside, and Sanders Theater.\n\n* Walk along the Charles River, and over the Weeks footbridge. View of campus from the other side of the river is classic.",
            "score": 10,
            "author": "MiaHavero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very helpful thanks ✌🏻",
                    "score": 2,
                    "author": "ChasingHorizon2022"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can recommend the Harvard museums if they’re open! You might qualify for free admission if you have a student ID as well!",
            "score": 11,
            "author": "NonexistentMonk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm picking up my ID when I visit campus so I'll make sure to check that out thanks for the tip!",
                    "score": 3,
                    "author": "ChasingHorizon2022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also if you’ve got a partner or are going with someone, I’m 90% sure the free museum admission includes a free plus one",
                            "score": 6,
                            "author": "drewwil000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use your ID to walk through some of the libraries! They’re really neat spaces and each feel a bit different. Widener, Lamont, Cabot, Law School…",
            "score": 3,
            "author": "onigiri1994",
            "replies": [
                {
                    "level": 1,
                    "comment": "I intend to hopefully without looking too much like a tourist 🫠",
                    "score": 2,
                    "author": "ChasingHorizon2022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re not rushing somewhere without caring about your surroundings, you’re gonna look like a tourist no matter what. Might as well steer into it and take your time to enjoy it, and take some pictures (even more of a giveaway) if that’s your thing.",
                            "score": 3,
                            "author": "jljl2902",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You know I have to get a new LinkedIn profile photo 😂👌🏻📸",
                                    "score": 1,
                                    "author": "ChasingHorizon2022"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}