{
    "id": "xvaqaq",
    "score": 16,
    "title": "Anyone else freezing cold in dorms?",
    "author": "dhfsaklasjk",
    "date": 1664876766.0,
    "url": "https://www.reddit.com/r/Harvard/comments/xvaqaq",
    "media_urls": [],
    "other_urls": [],
    "postText": "The heat in my room (GSAS dorms) has not been switched on yet even though outside temperatures (and therefore temperatures in my room) are hitting the low 50s. This feels like it can't possibly be legal. I am so cold. Anyone else have this issue?",
    "comments": [
        {
            "level": 0,
            "comment": "Oh dear. It’s October in New England. 50s is still weather for short sleeves on a sunny day. Get ready…",
            "score": 23,
            "author": "gacdeuce",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. Unfortunately they will be in for a rude awakening come December.",
                    "score": 8,
                    "author": "Present_Note_9564"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IIRC, if you're in one of the older buildings (Conant or Perkins, I think?), there should(?) be storm windows you can pull down that can help keep heat in / drafts out. I don't know why they don't tell people about them until snow is literally blowing through the cracks in the window - but, it made quite a difference for me when I lived there years ago.",
            "score": 7,
            "author": "haltheincandescent"
        },
        {
            "level": 0,
            "comment": "I’m also living in a GSAS dorm and it’s getting super warm in mine (they definitely turned the heat on). Which dorm are you in??\n\nEdit: I have a thermometer in my room and it’s 75 degrees in mine",
            "score": 5,
            "author": "Imaginary__Potato",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow I wish I were you. I don't have a thermometer but my room is essentially in thermal equilibrium with the outdoors. During the day it's fine but at night it's really cold... (I'm in Conant)",
                    "score": 4,
                    "author": "dhfsaklasjk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dang that’s crazy. My room is now 79 degrees lol, so maybe the heat is too strong, but I guess that’s better than 50 degrees (I’m in child)",
                            "score": 1,
                            "author": "Imaginary__Potato"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "See^",
                    "score": 1,
                    "author": "Crazy_Mouse_1759"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro this happened to me and it turns out the heat knobs in your dorm room under the heating vent. This was a different school. So. Idk",
            "score": 3,
            "author": "Crazy_Mouse_1759"
        },
        {
            "level": 0,
            "comment": "After September 15th, residences are supposed to be heated to 68F during the day, and 64F at night. https://www.mass.gov/doc/105-cmr-410-state-sanitary-code-chapter-ii-minimum-standards-of-fitness-for-human-habitation/download",
            "score": 3,
            "author": "pattyorland",
            "replies": [
                {
                    "level": 1,
                    "comment": "The saddest part is that not needing heat is the exception (applies only June 15 to September 15)…\n\nAfter Harvard I need to move to SoCal…",
                    "score": 2,
                    "author": "PresidentMather",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Join the club! I moved straight to SoCal after! ☀️",
                            "score": 1,
                            "author": "Music_6"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You really don’t need the heat on when the outside temperatures are in the 50s.",
            "score": 5,
            "author": "Thoreau80"
        },
        {
            "level": 0,
            "comment": "the steam plant sends out chiller water for AC and heater water for heating, but there's only one set of distribution pipes.  every year in september/october and may/june they switch the system over, but it's never perfect and there are always a few days where the buildings are too hot or too cold.  \n\nmy advice:  embrace fall, [become mr. autumn man](https://www.theonion.com/mr-autumn-man-walking-down-street-with-cup-of-coffee-1819574012), i.e. wear a sweater.",
            "score": 2,
            "author": "Vermillionbird"
        },
        {
            "level": 0,
            "comment": "I’m on campus, didn’t get the heat turned on until yesterday! I was told it’s policy that they don’t turn it on until it hits the 40s, but if you call and complain to facilities they’ll switch it on. I called and mine turned on later that night lol",
            "score": 2,
            "author": "chipchip20"
        },
        {
            "level": 0,
            "comment": "Does anyone know the freshman dorms when it starts to turn on the heat and when it will stop by the heat?",
            "score": 1,
            "author": "Pleasant-Lie-9053"
        },
        {
            "level": 0,
            "comment": "Off campus ftw… after I heard about the dorms I got an apartment downtown",
            "score": 1,
            "author": "1636posted"
        },
        {
            "level": 0,
            "comment": "Have you tried talking to the building manager yet? Houses are already being heated, so afaik central should be pumping steam to the rest of campus as well.",
            "score": 1,
            "author": "thenerdwriter"
        },
        {
            "level": 0,
            "comment": "Back in the day they would warm up cannon balls .. I believe near stoughton .. and would carry them up to heat their rooms.. after cooled they’d push them out the windows… I’ve heard there are still indentations in the ground as a result",
            "score": 1,
            "author": "Greenwrench22"
        },
        {
            "level": 0,
            "comment": "this doesn't shift over for a bit, unless you're leaving windows open the interior will be above 65 at night so yeah it's legal. doesn't mean it doesn't suck to get used to if you're from a warmer climate, but kind of have to.\n\ntwo stop-gaps while you acclimate or succumb:\n\n1. hot water bottle. add the boiling water and keep it in your lap with even a light blanket over it, and you'll warm up entirely. one that wraps around your neck warms the blood. can buy these anywhere, even CVS. sleep with the damned thing; i'm told farmers used to heat stones by the fire and do something similar.\n2. learn to wear layers and understand why fingerless gloves keep coming back in style.\n\ni'd really avoid the ceramic heaters/electric blanekts you can buy, while they'll pump out heat they are fire magnets and can't trust how they're built. hard to live down causing another dorm fire like radcliffe or soldier's field or allston, though radcliffe is mostly memorable because the girls left a fat candle burning under the bed.",
            "score": 1,
            "author": "and_dont_blink"
        }
    ]
}