{
    "id": "y6hzrg",
    "score": 11,
    "title": "Best way to find an apartment",
    "author": "KitchenPay6973",
    "date": 1666029823.0,
    "url": "https://www.reddit.com/r/Harvard/comments/y6hzrg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am having trouble locating a good apartment starting this august and was wondering what ideas you guys have. Housing is such a mess and I’m afraid I’m a little late. What is the best place to find an apartment or sublease?",
    "comments": [
        {
            "level": 0,
            "comment": "If you’re looking for August now, you’re quite a bit too early. On campus housing applications are March/April, and most landlords don’t even know if tenants are staying on until the end of spring. You’ll have much more luck in the late spring/summer months - up to July even places will pop up for August move-in dates",
            "score": 10,
            "author": "goneonvacation",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok that’s awesome to hear. I appreciate the insight.",
                    "score": 1,
                    "author": "KitchenPay6973"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's very challenging and Harvard provides no support (unlike many other universities). \n\nI really liked a site called Sublet, where I found a decent place: https://www.sublet.com/ \n\nI also found another room via Craigslist, but Craigslist is full of scams so be careful and only give them money after you physically visited the place. A colleague of mine ended up renting a very expensive Airbnb though because he didn't find anything.",
            "score": 5,
            "author": "ebbarosa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "KitchenPay6973"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're looking way too early.\nBut when you're ready (I would say start looking in the Spring) I found it helpful to set up an apartment specific email address and sign up on all the sites for alerts.",
            "score": 3,
            "author": "plang00120012"
        },
        {
            "level": 0,
            "comment": "craiglist",
            "score": 1,
            "author": "justwonder1234"
        },
        {
            "level": 0,
            "comment": "Next August? Prioritise Harvard Housing starting March next year. If nothing works out, start looking at Craigslist or Facebook groups in June",
            "score": 1,
            "author": "freetrips"
        }
    ]
}