{
    "id": "1rvmrk",
    "score": 5,
    "title": "ACCEPTED!",
    "author": "historyofaheartbreak",
    "date": 1385948538.0,
    "url": "https://www.reddit.com/r/flaglercollege/comments/1rvmrk",
    "media_urls": [],
    "other_urls": [],
    "postText": "So....I was accepted to Flagler! Flagler has been my dream college since my freshmen year and now here I am, four years later, accepted and ready to graduate from high school. What do I do from here? I filled out my confirmation form, medical history form, and my housing agreement and roommate matching form and I'm planing to send them all in as well as my $400 deposit next week. What will happen after that? Also what should I bring with me to college? You know other than the average bedding, pillow, toiletries, and such....Also, do you have any tips for any info in freshmen next year? I'm a bundle of joy, excitement, and slight nervous wreck! Any and all tips would be accepted and very much appreciated!!! Thanks!!",
    "comments": [
        {
            "level": 0,
            "comment": "My advice? Take a deep breath and take the college experience as it comes to you. You sound like you're really pumped, and that's great, but don't let that enthusiasm prevent you from taking a moment to truly observe what is going on around you. Self awareness is key to surviving college. Sincerely, a senior. ",
            "score": 3,
            "author": "andrabesque",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! :D",
                    "score": 1,
                    "author": "Confessionta12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats on the acceptance! I was recently accepted to Flagler as well! So relieved to have another Redditor on campus!",
            "score": 1,
            "author": "Maxmakesthemillion"
        },
        {
            "level": 0,
            "comment": "Hi and congratulations on being admitted to Flagler. The best place to find all the information you are looking for is on the Admitted Students Pages on the Flagler website (www.flagler.edu/admittedstudents). Once you send in your deposit, we will send information to access your Flagler email and the Flagler intranet (MyFlagler). In January 2014, we will also begin an Admitted Student Facebook Group where you will be able to connect with current students, faculty, staff, and other incoming students.   \n\nSo, relax, enjoy the holiday season and the rest of your senior year.  If you have further questions feel free to contact your admissions director. Again congratulations!",
            "score": 1,
            "author": "Flagler_College",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! :D ",
                    "score": 1,
                    "author": "Confessionta12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!  I went to Flagler and lived in the dorms freshman year.  If you have a bike I would recommend bringing it.  There are bike racks you can lock it up at the dorms and it’s super fun to ride your bike around downtown St. Augustine and over the bridge to Anastasia Island state park.  Have fun!!!",
            "score": 1,
            "author": "ProfessionalEngine56"
        }
    ]
}