{
    "id": "117m673",
    "score": 2,
    "title": "Parking",
    "author": "dremocak",
    "date": 1676931073.0,
    "url": "https://www.reddit.com/r/CSULA/comments/117m673",
    "media_urls": [],
    "other_urls": [],
    "postText": "How often does the parking police come to check if we paid? I use pay by phone but I just feel like no one comes around and 8 dollars is a lot",
    "comments": [
        {
            "level": 0,
            "comment": "A lot - don’t chance it. I know $8 is a lot, but $80 for one time is more (or whatever the fine is now).  It only takes one time getting a ticket, then $8 will seem like a bargain.",
            "score": 14,
            "author": "gretchsunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate you! I mainly on campus for work a couple days out of the week but I’m not csula staff, luckily my work does reimburse!",
                    "score": 2,
                    "author": "dremocak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trust, just pay. They are definitely around. I've gotten ticketed on my way to buy a permit - I arrived, walked to the kiosk (which was kinda far away), and when I returned, I had a ticket waiting for me. And the appeal process is garbage too. I submitted a bank statement with a time stamp and everything and they didn't care.",
            "score": 9,
            "author": "reallyintothistho"
        },
        {
            "level": 0,
            "comment": "Don't chance it, you never know when they'll come. I've gotten 2 so far just because their sign that was behind a tree said \"staff parking\". Not my fault if your signs are covered by a tree which blocks the view of the driver.",
            "score": 2,
            "author": "kassidylynnk"
        },
        {
            "level": 0,
            "comment": "I wouldn’t chance it. The other day as I was parking, I noticed three of the workers in one car get out and go through all the cars on the floor. I usually wait in my car about 5-20 minutes because I’m early. By the time I was ready to head to class, there were about 15 tickets and the guys were still going around.",
            "score": 1,
            "author": "Dramatic_Patience_99"
        },
        {
            "level": 0,
            "comment": "You may not see them but they are definitely passing around so I would just pay the $8 it’s not worth the $60 ticket",
            "score": 1,
            "author": "Maleficent-Ad-9162"
        },
        {
            "level": 0,
            "comment": "The tickets I got were $60 and they add up if you don't pay them at a given date🤦🏾‍♂️. I just end up buying the permit. \n\nI feel like it should just be free parking but hey🤷🏾‍♂️",
            "score": 0,
            "author": "Square_Moment_3930"
        }
    ]
}