{
    "id": "13vbzfm",
    "score": 9,
    "title": "Am gonna get kicked out?",
    "author": "EndSilver5067",
    "date": 1685408307.0,
    "url": "https://www.reddit.com/r/CSULA/comments/13vbzfm",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m on academic probation I had a 1.1 gpa last term (2021-2022)now I have a 1.8 since I passed all my classes fall semester but this semester has been lackluster and I’ve failed one class the rest I passed but I ended up getting a D+ because my professor didn’t want to round up.Am I gonna get kicked out? I really tried well and I don’t wanna get kicked out and have to pay all the pell grants they gave me.Someone give their experience.Im an under grad second year heading into 3rd year for context.And I only need one class to declare my major since I have 44 of the credits I need.Has this happened to any of u failing one class on academic probation?",
    "comments": [
        {
            "level": 0,
            "comment": "When on academic probation I believe if you fail one class you have to leave for one academic year and then can try to be readmitted again afterwards. I would contact your academic advisor and see what you need to see what your options are for your Pell grants.",
            "score": 4,
            "author": "simpfornanami",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really? That’s sounds awful oh god",
                    "score": 1,
                    "author": "EndSilver5067"
                },
                {
                    "level": 1,
                    "comment": "R u sure about that 100% cause that sounds bad for me I miss out on a lot...",
                    "score": 1,
                    "author": "EndSilver5067",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would make an appointment with an advisor just to make sure but I’m pretty sure you could be placed on dismissal for a year. It sounds bad but you could take this time to reflect on the classes you’re struggling with and finding ways to manage your school time more efficient.\nThis happened to me at a different cal state and while I felt really embarrassed about it I was able to reevaluate what I was doing with school and work on my gpa.",
                            "score": 2,
                            "author": "simpfornanami",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She said I would have to do the same as I did last year which was academic dismissal and the sap appeal which I did and was accepted did u do that first?",
                                    "score": 1,
                                    "author": "EndSilver5067",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "wait so you’ve been on academic dismissal before?",
                                            "score": 2,
                                            "author": "simpfornanami",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes last year and also satisfactory academic progress aka sap I filed both out and was awarded to come back into csula.Academic reinstatement was what I had to fill out",
                                                    "score": 1,
                                                    "author": "EndSilver5067",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hmm I don’t know how many times you can be on academic dismissal and come back since you’ve done it once so definitely contact your academic advisor",
                                                            "score": 3,
                                                            "author": "simpfornanami",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My current student status says academic notice did urs say that?",
                                                                    "score": 1,
                                                                    "author": "EndSilver5067"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What cal state did u not go for a year for?Was my situation different from yours?How did u get kicked out sorry if I have many questions I’m just anxious",
                                                                    "score": 1,
                                                                    "author": "EndSilver5067",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My friend is going through this right now and the advisor said that you can get reinstated up to three times. but it’s very rarely that someone gets accepted the third time.",
                                                                            "score": 1,
                                                                            "author": "lemonadepoosh"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’ve never been academically dismissed and had to write an appeal ?",
                    "score": 1,
                    "author": "EndSilver5067",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right now it’s a 1.8 and I’m close to finishing the ge courses so going to a community college isn’t really like a good idea if I’m close to the finish line",
                                    "score": 1,
                                    "author": "EndSilver5067"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh wait I checked my old email I think I’m on financial aid probation not academic probation for low grades is they’re a difference?",
                                    "score": 1,
                                    "author": "EndSilver5067",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shit and my efc is 0 I can’t pay out of pocket could I appeal again my counselor said I could 3 times",
                                                    "score": 1,
                                                    "author": "EndSilver5067",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Alright thank you.But do u know if I can appeal twice in a row? I had a valid excuse before that was applicable to my situation(mental health).They even gave me more financial aid than last year",
                                                                    "score": 1,
                                                                    "author": "EndSilver5067",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What community college was that at?",
                                                                                    "score": 1,
                                                                                    "author": "EndSilver5067",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meet with a advisor and figure out what’s best for you! I had a really shit GPA my first 3 years but decide to take a Semester off to figure things out and came back more prepared. Regardless of situation, the advisors are gonna have to guide you through your situation.",
            "score": 1,
            "author": "Nolascoaj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks hopefully I’m allowed to stay in school",
                    "score": 1,
                    "author": "EndSilver5067"
                }
            ]
        }
    ]
}