{
    "id": "q7lmn3",
    "score": 5,
    "title": "Social life ?",
    "author": "reditwithmb",
    "date": 1634162154.0,
    "url": "https://www.reddit.com/r/CSULA/comments/q7lmn3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was looking to transfer here from my JC and I was curious as to the social life going on..I’m an extrovert and realize I’m happiest around a ton of people but COVID put a stamp in that. Trying to find a community if I go out there.",
    "comments": [
        {
            "level": 0,
            "comment": "Been at CSULA since 2019, there isn't much of a social life because the school leaned waaay too hard into a \"commuter friendly\" identity. That being said, there's gradually more and more clubs/events springing up as we return to campus full time",
            "score": 5,
            "author": "sidisnotvicious"
        },
        {
            "level": 0,
            "comment": "Joining clubs would be your best bet! Having mostly online classes in Fall has made it a little more tricky meeting people, but it's not impossible. \n\nSo far it looks like Spring is offering mostly/all in-person classes, so there'll probably be more in-person events for clubs and more chances to meet people then",
            "score": 2,
            "author": "fivefootwonder"
        },
        {
            "level": 0,
            "comment": "When I was there in the 2000s, there wasn't much of a social scene on campus. It was basically a community college that offered four year degrees--people drove in, took classes, and left. Things may have improved but I doubt it.\n\nI really can't recommend transferring to CSULA if you want a social scene. In fact, I don't recommend the school at all--the administration is inept, the social scene sucks and it's in a bad part of L.A. compared to UCLA. If your grades are good enough to go to a private college, that is your best bet. Despite having sky high tuition on paper, the actual cost of tuition isn't that expensive at private colleges with lots of money since their financial aid is more generous and they have less students who need aid in the first place. If your grades suck, try to transfer to Cal State Long Beach. It's an earthly paradise compared to CSULA. If your grades are in between, apply to a UC school and keep CSLB as a back up.",
            "score": 2,
            "author": "AlieanBreac"
        },
        {
            "level": 0,
            "comment": "I’m a third year, and have been online since my second semester of my first year, as far as Social life, it’s very dry, from what I’ve been there. You need to join a Frat or join a group to socialize. After I did that it’s been a lot better. U will also meet people in ur class to, but it’s not the same :/",
            "score": 3,
            "author": "R3D_Skillz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great response there! If you don’t mind me asking, how do we go about joining a group/frat? Are there any recruitment events? I’m a business admin major that transferred in this year, if that helps in anyway.",
                    "score": 1,
                    "author": "FrankyDon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, usually in the beginning of the semester, for the  first few weeks. However they do fundraisers or events through the semester, just go up to them and ask, most people are very lead back and hella chill. They are usually located when you’re walking through the main hall, there a bunch of tents and people either trying to get signatures or recruit people. You can also go online on Instagram or Google and find student-organized groups or Frats",
                            "score": 2,
                            "author": "R3D_Skillz"
                        },
                        {
                            "level": 2,
                            "comment": "Hey FrankyDon. Since this semester is at a close I wanted to ask if you are still interested in join a Frat? We will be rushing during Spring. Let me know if you are interested so I may provide some details! Btw I’m also a business major. ʕ•ᴥ•ʔ",
                            "score": 2,
                            "author": "R3D_Skillz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey there, little bit of late reply but better late than never! 😆\nI’m definitely still interested, we can pm here or dm me on Instagram, @frankydon",
                                    "score": 1,
                                    "author": "FrankyDon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ayyye that’s what’s up, thanks for replying and find some interest. I’ll add you on Instagram, my user is @_Oscarrrx I’m drop my Instagram here too, just in case someone else is interested in joining. A fraternity is a great way to building a community, connect with alumni and it looks good on a resume. Especially now with online class, it’s kinda difficult networking with other students.",
                                            "score": 1,
                                            "author": "R3D_Skillz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahoy R3D_Skillz! Nay bad but me wasn't convinced. Give this a sail:\n\nAyyye that’s what’s up, thanks fer replying n' find some interest. me’ll add ye on Instagram, me user be @_Oscarrrx me’m drop me Instagram here too, just in case someone else be interested in joining. A fraternity be a great way t' building a community, connect wit' alumni n' it looks jolly good on a resume. Especially now wit' online class, it’s kinda difficult networking wit' other students.",
                                                    "score": 2,
                                                    "author": "I-AM-PIRATE",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "??",
                                                            "score": 1,
                                                            "author": "R3D_Skillz"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " For your major 90% of the classes are offered in the evening, Saturday or online. I’ve only been able to get one class in the morning. \n\nThere is an accounting club that is popular but no where near what you’ll need if you’re an extrovert. \nAs a CSULA business major a lot of my peers work full time and are already on a career path. \nI’ve only meet a few who have time to socialize. \n\nThis is coming from a senior-business major. \n\nI would say google the frat organizations, see if they are your vibe.",
            "score": 1,
            "author": "According_River_2864",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forsure that’s also encouraging I guess so I can actually start getting my foot in the door workwise. I was going to switch to marketing if I go there and I have a possible remote opportunity lined up so that could all work out.",
                    "score": 1,
                    "author": "reditwithmb"
                }
            ]
        }
    ]
}