{
    "id": "tfy99i",
    "score": 5,
    "title": "Computer Information System Major Question",
    "author": "No_Oil_7544",
    "date": 1647479396.0,
    "url": "https://www.reddit.com/r/CSULA/comments/tfy99i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am planning on switching out of being a Pre-CS major, as of right now I am just not enjoying the classes with a lot of it just being critical thinking, and I was aware of it when I decided to go for that major, however I've lost interest. So i've been looking into other computer related majors that don't require as much math, since that was the main problem. And I heard CIS was something that I might have an interest, however I am still confused on what they actually do/ topics they study/ jobs available/ or the difference between it and CS. If there are other computer related majors that don't require as much critical thinking as CS please lmk! \n\nThank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "I made the same switch because of math. In CIS they mention that they prepare you to be an analyst type of role. I have worked as a system admin and business analyst after graduating. My positions are still technical and rely on computers, but they also involve some business concepts. I still do some programming / scripting in the jobs I have had.\n\nLet me know if you have any more specific questions.",
            "score": 3,
            "author": "Colombiangmr",
            "replies": [
                {
                    "level": 1,
                    "comment": "How were the math classes in CIS if their were any, but more specifcially how difficult were the classes?",
                    "score": 1,
                    "author": "No_Oil_7544",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Classes were pretty easy. I didn't have to take any additional math classes when I did CIS, but I was a transfer student. There were some classes that had math, but these are more like statistics, accounting, and finance. Personally, they weren't the funniest, but these were more real-life to me, so they made a bit more sense.\n\nOverall classes were pretty easy when I took them. I would do the same again, I was able to get a helpdesk role right after graduation. I also worked as a student assistant on campus in a semi-related field, so that helped.",
                            "score": 1,
                            "author": "Colombiangmr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alumni here, I also made the switch early in my time at CSULA. Half of the CIS classes tend to be business, so you'll be taking courses in marketing, economics, and finance which do end up using math although less abstract. Along with General IT courses such as Networks, Project management, and Databases. CIS is a really broad major, so the jobs and courses you can take are pretty wide.   \n\n\nGenerally, your options out of college are, Technical support engineer, Data analyst, Project coordinator, JR network admin, Helpdesk support technician,   \n\n\nif you focused on more coding classes you could land a job as a Jr web developer, jr software engineer, Jr Security Tester.  \n\n\nremember that Internships are key!\n\nComparing CS to CIS is similar to how an astronomer uses a telescope. CIS would be focused on making sure the telescope works while computer science would be focused on what is done using the telescope.",
            "score": 4,
            "author": "EpicStrategist",
            "replies": [
                {
                    "level": 1,
                    "comment": "In terms of difficulty of the classes how were they? Ik that it bases on interests and such but still if u had to compare CS to CIS and finding a job was it difficult?",
                    "score": 1,
                    "author": "No_Oil_7544"
                }
            ]
        }
    ]
}