{
    "id": "wa394r",
    "score": 8,
    "title": "Questions about Applying for Classes for Fall 2022",
    "author": "mmartinez599",
    "date": 1658993445.0,
    "url": "https://www.reddit.com/r/CSULA/comments/wa394r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a transfer student for fall 2022. I have no idea how to work anything on the student portal. My main question is do i need to complete orientation before I'm allowed to apply for Fall 2022? My next question is that my orientation is on Aug 10 and I saw that classes start on Aug 22 will it be to late for me to find a class? \n\nP.s  I'm a music major if that helps at all. \n\nThank you in advance. I hope I can find some answers.",
    "comments": [
        {
            "level": 0,
            "comment": "Unfortunately you have to wait for orientation to register for classes and as a fellow transfer student, I’m angry with you. I’m in public health and tbh I’m pissed us transfers aren’t given the same priority that upper division class members have when it comes to registering because a lot of my core classes are all waitlisted. \n\nThe advisors have been ZERO help for me because every time I reached out to ask about it and discuss my concerns they kept saying that I can’t make an advisement appointment until my orientation either. I’ve honestly felt really shit out of luck as a transfer student so far and I’m pretty pissed about it.\n\nCall your department and let them know your predicament, maybe they’ll be help.",
            "score": 3,
            "author": "apprehensivepears",
            "replies": [
                {
                    "level": 1,
                    "comment": " Me too, I had my orientation just the other day, and i’m a nutrition major. There’s still a pre req I need to take but there’s no classes open for it. Now there’s so many classes I can’t take until I can take that pre req",
                    "score": 3,
                    "author": "Pandax18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve legitimately considered speaking to the dean of student affairs because it just feels so backwards. Us transfers have such limited class options that not being able to get our classes in the Fall may seriously affect our ability to graduate on time.",
                            "score": 2,
                            "author": "apprehensivepears",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’d honestly back you up on that, I asked them mid June ish all these questions about tuition, classes, etc so I know what to expect &amp; can plan my life around it and they kept telling me to wait and check my email, which is super annoying. But yeah I mean I agree totally bc I wanted to graduate in 2 years but now I’m starting to feel like it might be 2 1/2 - 3 years",
                                    "score": 2,
                                    "author": "Pandax18"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nah you don't have to wait and you can check on your degree planner on what classes you should take. \n\nHonestly orientation is useless and so are the counselors",
            "score": 3,
            "author": "Environmental_Ad1048",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. Sorry to bother but do you mind explaining where I could find it. And dumb it down like I'm a really old person.",
                    "score": 1,
                    "author": "mmartinez599",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OK step 1 is login into your portal then go to your GET \n\nStep 2  when you login to your GET press self service and from there press student center \n\nStep 3 you'll see where it says Degree planner there you can see what classes you need to take \n\nStep 4 to enroll you just repeat the steps but instead press Enroll \n\nTo enroll you could either use schedule planner or just press search button after you have pressed enroll in the student center. You would just search the classes it days in your degree planner",
                            "score": 6,
                            "author": "Environmental_Ad1048",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg thank you so much you're a life saver. 👼🙏❤",
                                    "score": 2,
                                    "author": "mmartinez599"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I felt like the counselor didn’t help me much honestly.",
                    "score": 1,
                    "author": "AprilLosAngeles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you need help with enrolling to classes let me know",
                            "score": 1,
                            "author": "Environmental_Ad1048",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. I might take you up on that offer in the next few days",
                                    "score": 1,
                                    "author": "AprilLosAngeles"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}