{
    "id": "wp10ey",
    "score": 7,
    "title": "dorm room searches",
    "author": "jigglychinboy",
    "date": 1660573491.0,
    "url": "https://www.reddit.com/r/CSULA/comments/wp10ey",
    "media_urls": [],
    "other_urls": [],
    "postText": "y’all do they ever do room checks? plz lmk so i can finish up packing. i’m UNCOMFY🥺 also is south village wood or rug flooring so ik to bring a broom or a vacuum",
    "comments": [
        {
            "level": 0,
            "comment": "Yes room checks are done throughout the semester but they let you know ahead of time. The flooring is rug so bring a vacuum too.",
            "score": 5,
            "author": "Xersh_ShadowX",
            "replies": [
                {
                    "level": 1,
                    "comment": "do they search everything or just what belongs to the school (like the closet and the desk drawers)",
                    "score": 1,
                    "author": "jigglychinboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it's a visual inspection on what was already in the room and for items you have that might violate policies but it depends on your RA.",
                            "score": 2,
                            "author": "Xersh_ShadowX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "have they ever opened up drawers nd stuff",
                                    "score": 1,
                                    "author": "jigglychinboy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man what are you so worried about?",
                                            "score": 11,
                                            "author": "Experiment304",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For real lmao. Bro bring drugs or illegal shit😂😂😂",
                                                    "score": 7,
                                                    "author": "Mrbudddha",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "FR. And everyone knows nowadays you can't be too careful with so many sketchy people shooting up schools SMH",
                                                            "score": 6,
                                                            "author": "Experiment304"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "id j like to know if we’d have any privacy babes🧍it’s nothing like that😭plus we’re paying money for it to be our homes for the year. it’s not standard procedure to be searching student homes even though doing drugs amongst youths is common and (unfortunately) gun violence in the US is quite prevalent. was j wondering if they’d keep that same energy w our dorm room ITS RLLY NOT WHAT YOU THINK🥹💔",
                                                            "score": 1,
                                                            "author": "jigglychinboy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don’t think they’d go as far as to opening drawers. That’s really invasive",
                                            "score": 1,
                                            "author": "ChunkySquidy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi there! There were only ever 2 check ins, my RA never came in the room and only stood in the doorway. The only things they can check are things owned by the school (closet, desk) so if you don’t want something out put it in your own storage bin, ottoman, etc. and you’ll be chill. The flooring is carpet 👍🏻",
            "score": 2,
            "author": "Lower_Square_8512",
            "replies": [
                {
                    "level": 1,
                    "comment": "yea that’s what i heard too! thanks for the deets btw you’re such a babe c:",
                    "score": 1,
                    "author": "jigglychinboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! If you have any questions lmk, this is my second year housing so I got pretty familiar with it already :)",
                            "score": 2,
                            "author": "Lower_Square_8512",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "for sure! i’m super excited abt move in XD",
                                    "score": 1,
                                    "author": "jigglychinboy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s pretty hectic I won’t lie, but it’s still fun to meet your roommates and get used to the dorm life! I will give you a heads up, the fire alarm will go of CONSTANTLY, in the middle of the night, during class, early in the morning, etc. Thats the only downside for housing",
                                            "score": 1,
                                            "author": "Lower_Square_8512"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}