{
    "id": "116iyb1",
    "score": 6,
    "title": "Babson MSF Program",
    "author": "billywill3",
    "date": 1676828484.0,
    "url": "https://www.reddit.com/r/Babson/comments/116iyb1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am waiting on a decision on my MSF application and was wondering how competitive this program is and how many students usually are accepted. Also, I am wondering if this program would be worth it, if accepted.",
    "comments": [
        {
            "level": 0,
            "comment": "I am as well waiting for decision to my MSBA Application, from what I understand Babson is more well known for its undergrad. Would love to hear inputs regarding their stem programs and career prospects for an international student.",
            "score": 1,
            "author": "DarthRai11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here awaiting decision for MSBA, any information about the program - it’s reviews and career support/ prospects for an international student.",
                    "score": 1,
                    "author": "Easy-Adeptness-4457",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I applied to the MSBA program last week, how did it go for your guys? How long did it take to hear back",
                            "score": 1,
                            "author": "coopcuppacoffee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am also waiting on my decision for the MSF program. From what I have heard from a friend who is a current student, he has really enjoyed the program. He says the curriculum has very good classes, and that he feels well prepared to transition to a finance career after graduation. I applied to the MSF after he highly recommended it. \nOn another note, does anyone know when R2 decisions are coming out? I got accepted into another program and have to respond by the 16th but would rather go to Babson.",
            "score": 1,
            "author": "OppositeWrongdoer218",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you get accepted?",
                    "score": 1,
                    "author": "billywill3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes!! Did you?",
                            "score": 1,
                            "author": "OppositeWrongdoer218",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How much did you score in your gre? I scored 298 do i have a chance? I have work exp as a market research analyst at a Crypto portfolio management firm. Do i stand a chance?",
                                    "score": 1,
                                    "author": "Kizaashi13"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes i did!",
                                    "score": 1,
                                    "author": "billywill3"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Waiting for decisions too. I hope they reach out soon as I have got into other colleges and I have to confirm on admissions asap.",
            "score": 1,
            "author": "Idk14680",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. Good luck!",
                    "score": 1,
                    "author": "OppositeWrongdoer218"
                }
            ]
        }
    ]
}