{
    "id": "hfjnvl",
    "score": 5,
    "title": "Incoming freshman with a few questions about Babson and its student life",
    "author": "ilovebabson",
    "date": 1593080243.0,
    "url": "https://www.reddit.com/r/Babson/comments/hfjnvl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I plan on attending Babson in the Fall later this year and just had a few questions before making the final decision. I would appreciate if any current or past students can answer as many or as few of my questions as they would like, any responses are helpful as I have not been able to visit due to coronavirus. \n\n&amp;#x200B;\n\n1. How rigorous is the course load? Will I have free time to participate in sports/clubs/explore the cities. \n2. How is the food on campus/near by? Any recommendations of what to try/avoid?\n3. What are some residence halls you recommend\n4. What is the stigma around weed? Is the school super strict on drinking/smoking?\n5. What is the party scene like?\n6. Is it easy to make friends\n7. What are some negatives and things I should watch out for at Babson\n\n&amp;#x200B;\n\nThanks again to anyone who answers any of my questions, it would help me a lot!!",
    "comments": [
        {
            "level": 0,
            "comment": "Rising soph here:\n\n1) The course load is rigorous without a doubt but you will definitely have free time to do the things you enjoy. For me personally, I spend more time with my professional/social interests than I do on school work/hw and I am still able to comfortably manage everything. I think the biggest time sink academically freshman year might be FME, as you have to do more work outside of class than in class. (Make sure you have a good relationship with your team)\n\n2) Food on campus is good but Babo students always complain because there isnt a lot of variety in what they offer. Its easy to get bored of trim after a while. There are a couple spots students usually order delivery from if they don't feel like eating campus food sometimes. \n\n3) As a freshman I lived in Park Manor West, which is def the best dorm imo. But tbh, all freshman dorms are good except Mattos and Park Manor North.\n\n4) Babson, like all colleges, is strict on weed and it is illegal to do so, as Babo gets federal funding. Due to this, federal level laws apply on campus. But tbh a lot of people smoke and its a very common sight to see 24/7. You will prob see people smoking up on ur way to class just as you might see them smoking at parties. Just don't get caught by an RA, bc you will get in trouble. All this applies to drinking too.\n\n5) The party scene at Babson isn't great. There aren't really a lot of large parties that go down, and ur party scene is entirely determined by your friend group. If you can find people you enjoy being around, you will be fine. I feel partying at Babson is all about trial and error, and you will definitely understand what I mean after a semester here. Due to social distancing this upcoming sem, I doubt Babson's campus life will be as popping as before unfortunately for the time being. \n\n6) I would say yes. Remember everyone is like you. Leaving home for a new campus where they don't know a lot of people. You could go up to anyone randomly and they will be happy to talk to [you.](https://you.As) Just be yourself and avoid being fake/snakey. Remember that the friends you make during your first semester at Babson will probably look very different when compared to who are your best friends during senior year. It takes time to find the right people and you 100% will. If you are coming to Babson already knowing a good ammout of people from your city/ foreign country, make sure you also make friends outside that posse. It can get easy to stay inside your \"bubble\" of a social circle, but college is all about meeting new people.\n\n7) I made a lot of mistakes my freshman year, but I had fun and I don't regret anything. Academically, dont take your grades lightly. A lot of classes offer tutoring, so learn more about the resources babson offers. Babson offers so many resources for almost everything, but most people dont take advantage of them. Go to org fair, join orgs that interest you. You will meet amazing people you wouldnt have meet otherwise. Make friends with upperclassmen. Its easy to get lost at Babson, but having upperclassmen to guide you helps. If you dont know any upperclassmen, go join some orgs. Finally, if things are slow/ not going your way during the first semester, relax. It gets better :)",
            "score": 4,
            "author": "darknessduck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for taking the time to write that! It really has helped me gain a better perspective about the school as many other posts about Babson are from years and years ago",
                    "score": 1,
                    "author": "ilovebabson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of these questions are on YouTube. Check it out! I’m also an incoming freshman, that’s where I got most my answers.",
            "score": 1,
            "author": "hri1939",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay thank you! I haven't thought of to look on youtube",
                    "score": 1,
                    "author": "ilovebabson"
                }
            ]
        }
    ]
}