{
    "id": "ke39ik",
    "score": 7,
    "title": "Deferred students' acceptance rate",
    "author": "noir_066",
    "date": 1608096955.0,
    "url": "https://www.reddit.com/r/Babson/comments/ke39ik",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys I got deferred yesterday. (Asked for a very hefty financial aid) I had some questions regarding that-\n\n1. What percentage of ED1 applicants get deferred?\n\n2. What percentage of deferred applicants get in?\n\n3. Any advice on what I should do?",
    "comments": [
        {
            "level": 0,
            "comment": "1. No idea what the exact percentage is. I heard from an admissions rep that the ED admissions rate is similar to the regular decision rate (\\~25%).\n2. No idea.\n3. From a post last year: \n\n\"Deferral is not the end of the journey to get accepted. When I applied to business school I was wait listed. I reached out the my admission counselor on a frequent, but not obnoxious basis. I sent in an additional recommendation and reminded the school they were my top choice. I got in off the wait list. This is a deferral which means you are up against the regular decision pool. I think if you remind them that this is your dream school and if admitted you are coming that will go a long way. Ask the admissions counselor is there is anything else you can do to demonstrate interest. Just my quick thoughts......\"\n\n&amp;#x200B;\n\nAre you international or domestic? Admissions for domestic students is need-blind. Good luck!",
            "score": 3,
            "author": "axn626",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any idea when will ea results come?",
                    "score": 1,
                    "author": "Particular-Ad-7523"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can’t quickly find it for Babson but most colleges fill out a ‘common data set’.  Similar to a common application, schools fill it out, it is a standard form so apples can be compared to apples.  It’s mostly used for marketing and ranking but I used it during college searches.",
            "score": 1,
            "author": "ellasav"
        },
        {
            "level": 0,
            "comment": "They announced 4PM now should be in around 4 hours !",
            "score": 1,
            "author": "Pitiful-Coconut8583"
        }
    ]
}