{
    "id": "thf9vk",
    "score": 8,
    "title": "Waitlisted applicants",
    "author": "MariamMmohamed",
    "date": 1647637856.0,
    "url": "https://www.reddit.com/r/Babson/comments/thf9vk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! Who got waitlisted ? Is there still a chance of acceptance?",
    "comments": [
        {
            "level": 0,
            "comment": "I also got waitlisted. \nIf anyone admitted decide to go to another University, please tell the Admissions Offices that!!!\n\nThere are others who would like to be admitted from the wait-list.",
            "score": 4,
            "author": "Laou-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey! Who's still on the waitlist?",
                    "score": 1,
                    "author": "Working_Switch_2159"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's what i want to know, I really hope there is still a chance",
            "score": 2,
            "author": "veleux"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too!",
                    "score": 1,
                    "author": "OkComfortable7442"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IF THERE IS ANY AO ON THIS SUB \nI WANT TO TELL YOU THAT THIS IS NOT RIGHT. \nJUST NOT RIGHT.",
            "score": 2,
            "author": "aseriesofideas"
        },
        {
            "level": 0,
            "comment": "Even I got wait list after the Round- 1 still waiting for the waitlist results",
            "score": 2,
            "author": "Dull_Stress9628"
        },
        {
            "level": 0,
            "comment": "I was deferred from ED2 to recently accepted with RD (which looking at it now is a blessing since I'm not bound to one school anymore) One key thing I'd suggest is to write a really strong letter of continued interest. Update them on what you've been up to your senior year besides just what's on your common app. \n\nHere's a good video I watched after getting deferred: [https://www.youtube.com/watch?v=Ycruts18qqU](https://www.youtube.com/watch?v=Ycruts18qqU) \n\nFeel free to dm, I'm open to talking more about this",
            "score": 2,
            "author": "mob2942"
        },
        {
            "level": 0,
            "comment": "I got waitlisted too🥲",
            "score": 1,
            "author": "Glittering-Gear-1347"
        },
        {
            "level": 0,
            "comment": "Any ongoing student who got admission after being waitlisted...kindly advice.",
            "score": 1,
            "author": "Glittering-Gear-1347",
            "replies": [
                {
                    "level": 1,
                    "comment": "Write a really good, letter of continued interest... My grades barely improved through the middle of my senior year. And I'm a student that would need a lot of finaid to attend. I'm positive my letter of continued interest is what got me in.",
                    "score": 2,
                    "author": "mob2942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey , I also got waitlisted at Babson college , does anyone know when do the waitlist decisions come out . I was wondering after reading some stats on google stating that Babson admitted only 1 person from waitlist out of around 1200 for class of 2026 , that makes me so demotivated and reduced my hopes of getting in .",
            "score": 1,
            "author": "Many-Fig-2803"
        }
    ]
}