{
    "id": "xbcy7z",
    "score": 1,
    "title": "what are my chances of getting in?",
    "author": "Aggressive_Bit_8978",
    "date": 1662884065.0,
    "url": "https://www.reddit.com/r/Babson/comments/xbcy7z",
    "media_urls": [],
    "other_urls": [],
    "postText": "-I'm an international Indian student and will be applying to Babson in Fall 2023. Here are my stats:\n\nSAT: 1430 - 750 R&amp;W, 680M\nIELTS: 7+ (expected)\n\nAverage GPA: we calculate as a percentage out of 100\n9th- 75%\n10th- 88%\n11th- 86%\n12th- 90%+ (expected)\n\n\n**Extracurriculars:**\n\nXartup Fellowship: A practical knowledge-intensive program about startups for the youth. Was selected for the fellowship for my idea, and learnt more about the process of starting a company.\n\nASU Civic Leadership Institute: The program involved learning about civic political thought and  discussing topics like philosophy, politics, and US History. Debated on various topics like gun laws, abortion, and even artificial intelligence.\n\nYC Startup School: Attended YC Startup School while connecting with multiple people all over the world, creating a sort of Founders Club for high school and college students.\n\nBusiness Development Internship: Completed a 3-month in-person business development internship under the direct guidance of the head of a company.\n\nVolunteering: Volunteered at Sadhana Forest in Tamil Nadu, India, and participated in local volunteering in the city in the past year. Also completed a fundraising internship of sorts for an NGO in 2021.\n\nVideo editing Internship at school: (ongoing)\n\nOther-\n* was part of the student council in the school for an year\n* was part of the video editing team for school events\n* completed online courses and programs (some with and some without certification)\n* currently working on an app that allows you to manage your personal finance\n* started a dropshipping business in 2021 and made around 60K INR (750 USD) in net profit selling compact luggage. The business is no longer active.\n* also started and currently working on an new E-commerce startup, which has zero sales, with the product in development.\n\n**Essays/LORs/Other**\n\n1. LOR from an internship - 8/10\n2. LOR from Math teacher - 7/10\n3. Essays- I’d say they are an 8/10\n\n\nAlso needing scholarships/aid to attend.",
    "comments": [
        {
            "level": 0,
            "comment": "My understanding is that almost all international students pay full tuition. I definitely know of some “global scholars”, but I am not familiar with the scholarship eligibility requirements. Also, I really hope that this sub becomes more active/relevant for current students and less of a sounding board for prospective students.. like applying college is a chance, no student on this sub or at Babson can give you a percentage of how likely it is that you get in. You just can’t know these things because a whole admissions board reviews qualitative and quantitative information about you compared to other applicants… just apply to several colleges and try to practice mindfulness while you’re awaiting the decision.",
            "score": 4,
            "author": "cbdinfusedcocaine"
        },
        {
            "level": 0,
            "comment": "Hey! I’m curious, did you end up getting in?",
            "score": 1,
            "author": "Separate-Spinach36"
        }
    ]
}