{
    "id": "12c0gr3",
    "score": 3,
    "title": "Mac for Computer Programming",
    "author": "upshookt",
    "date": 1680650435.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/12c0gr3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm an aspiring international student however my current laptop is a macbook air m1. Will I be able to use this for the course or should I just sell it and buy a windows laptop? Can I get by with just using Parallels? Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "You're going to have an interesting time in the database classes. It's not impossible to setup, but the profs won't be able to help you.",
            "score": 7,
            "author": "WildRyc",
            "replies": [
                {
                    "level": 1,
                    "comment": "But i wanna is 1Tb necessary? Or 512gb will do?",
                    "score": 1,
                    "author": "koloye001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I looked into this because I needed one for term 4. My program was from home for terms 1-3 and I already had a desktop at home. \n\nI wouldn’t bother trying to use an Apple laptop for programming. Once they switched to their own chips from intel, mirroring windows became a lot more difficult. \n\nYes parallels exists, but it doesn’t support all the software used. I would sell it and get a windows one.",
            "score": 3,
            "author": "Fr0zenIc3"
        },
        {
            "level": 0,
            "comment": "You can get by for the first semester and then halfway through second semester. Second semester database will require windows or you will have some issues using oracle database with the new M1 architecture. \n\nSemester 3 networking the commands are not really transferable to Mac and a bit challenging finding the appropriate ones to pull subnet mask and configuration etc, and in java you will have issues with netbeans for an IDE so highly advisable to use windows.\nI was using a MacBook Pro M1 chip and had to end up purchasing a cheap windows device to complete most assignments in level 2 and level 3 even though I am running Parallels. The VM can only get you so far unfortunately.\n\nThis program is already challenging as it is, so don’t make it more stressful for yourself like I did.",
            "score": 3,
            "author": "wolf-of-bank-street"
        },
        {
            "level": 0,
            "comment": "I’ve used an M1 MacBook Pro this entire program. Only things I straight up couldn’t do was use some of the database programs in semester 2. \n\nThe stuff mentioned by others about networking commands are all doable you’ll just have to figure it out yourself. If you’re comfortable with Mac and its Unix based commands you’ll be fine. \n\nOther than that, my M1 blows a lot of others processors out of the water. Especially when loading up the virtual device and running the apps on it for Mobile Programming.",
            "score": 2,
            "author": "Gordupachup"
        },
        {
            "level": 0,
            "comment": "I am in a similar situation too, buying a windows machine seems to be a must now",
            "score": 1,
            "author": "koloye001"
        }
    ]
}