{
    "id": "12hxh2r",
    "score": 6,
    "title": "Thoughts on Medical Radiation Tech program at Algonquin?",
    "author": "royaaghbali",
    "date": 1681163225.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/12hxh2r",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey yall,\n\nI'm currently in the process of deciding if i’ll be attending AC or Fanshawe for Medical Radiation.  I was wondering if I could have a little insight into both the program at AC and the residences, as I am required to move out (I live in Vaughan, 4.5 hours away)\n\nThank you! Any and all responses are greatly appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated a few years ago from the Algonquin MRT program! It's a great program but definitely competitive and high workload, the year I got in we had 900+ people apply and only 54 got accepted. Second and third semesters you'll be taking 10+ courses depending on electives, plus labs on top of that so it's a grind. The clinical placement is 12 months unpaid and you could be placed at an out of town hospital. It's really a lot of work but Algonquin prepares you really well for the actual job and for the national exam. There's tons of job opportunities once you graduate and I absolutely love my job now so it's worth all the hard work! \nI didn't stay on res so I can't comment on that. Good luck!",
            "score": 3,
            "author": "ninjaprincess47",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks so much for your response I appreciate it! I hear it's a difficult program for sure, and congratulations to you! Did you get accepted straight out of highschool?",
                    "score": 1,
                    "author": "royaaghbali",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! Not really but kinda... I actually took two years off after highschool to work and travel a bit, then I did 1 year of university before deciding it wasn't what I wanted to do. I then applied to Algonquin so I still got into the MRT program based on my highschool grades but it was just a few years later :)",
                            "score": 2,
                            "author": "ninjaprincess47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hi there! I’m also interested in the program. Do you know what were the requirements? I know for Fanshawe it’s biology, chemistry,  physics, math and English with minimum of 70%. I didn’t take physics in high school but I did do pre-health sciences certificate.",
                                    "score": 1,
                                    "author": "Far-Canary5732",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it's just on the website, grade 12 English, Math, Physics, and then either Biology or Chemistry all with a 65% minimum. Although pre health should cover what you need to get in. Good luck :)",
                                            "score": 1,
                                            "author": "ninjaprincess47"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m currently in my clinical placement with Algonquin! They’re both great programs, the pass rate for both programs with the CAMRT exam is 80%+ which is great, not all schools consistently have such a high pass rate. \n\nI do believe Algonquin has classes specifically catered to CT, whereas Fanshawe it’s integrated into other classes. CT makes up a big enough portion of our licensing exam and if I’m being honest it’s not the easiest material so I appreciated that they were their own classes. \n\nClinical placements no matter where you go to school will be on a lottery, which means you can kinda be moved anywhere.",
            "score": 1,
            "author": "_jayray",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response I appreciate it! Best of luck on your clinical placement too &lt;3 Did you have to move out for school/placement?",
                    "score": 1,
                    "author": "royaaghbali"
                }
            ]
        }
    ]
}