{
    "id": "bf488w",
    "score": 24,
    "title": "I graduated the 2yr + coop Computer Programming course and now work for the government. Ama",
    "author": "[deleted]",
    "date": 1555707438.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/bf488w",
    "media_urls": [],
    "other_urls": [],
    "postText": "I see questions with regards to the computer programming course a lot here. I graduated from Algonquin a few years back and now am working full time. I'd love to help answer some questions for those who are considering going into the program this summer or fall.\n\n\nNew edit Nov 9th, 2021:\nIf you have questions that are not in this topic, please contact me through either this topic or message me. I don't have the reddit chat feature. If you had previously contacted me through that, I did not ignore you I just don't have that feature since I don't use reddit mobile - I use Joey on Android (which imho is the best way to navigate this site. )",
    "comments": [
        {
            "level": 0,
            "comment": "Did you bridge from your co-op into your job?",
            "score": 5,
            "author": "CatNamedNight",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did, in fact I and most of the graduates in my class year who got government jobs through coop did. So long as you know what you are doing and admit to what you don't know rather than bullshit it with the expectation you are willing to learn they will most likely hire you (eventually )",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm starting my govt co-op job on May 1st. Do you have any advice for me to help me make a good impression and improve my chances to being bridged to a permanent position?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When they teach you how to do something document it. So many places don't have good documentation. Making good technical documentation and showing a willingness, eagerness, and aptitude to learn really impresses them.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never comes up ever. They cared more about me admitting to what I did to know but showing initiative to learn and that I knew COBOL.\n\n  \n\n\nThat being said if you have the bare minimum GPA you may be passed up on the pool for those who have higher up. This can be mitigated with a great resume though, that or specific or unique skills.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't really give a detailed response on which is the best department as I've only been in one. Personally I feel more at ease in public sector. I don't worry about being downsized and in my particular department. I personally couldn't do contracts or short term contracts.\n\n  \n\n\nPersonally I went for COBOL. That's what got me the job. Being someone who was &lt;30 and knowing COBOL was a huge advantage for areas that still maintain legacy systems. Banks, credit card companies, and some airports still use COBOL so I found it useful. That being said it may make more sense to just check out Tutorialspoint or use your Lynda.com subscription and learn COBOL on your own and then learn C. It depends on how good you are at self directed research. That and if Mel \"Captain COBOL\" is still teaching.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mind if I ask what your starting salary was once you got hired on after coop?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Federal government salaries are all published.\n\nEdit: CS01 starts at 56k",
                    "score": 3,
                    "author": "durpfursh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't have to, depending on your skills and experience you can make the case to start at a higher pay tier.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "56k is the minimum.  The max for the classification is a pay capped CS05 at $141,426.",
                                    "score": 1,
                                    "author": "durpfursh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I started out as a CS01, which as the poster below had said, is publically available on the treasury board website. From there you can jump up a step each year until you earn CS02.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is CS-2 the max you can get with computer programmer diploma?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't believe so, but I don't care much for the administration side so I can't say for certain. If you need to check for specific openings you check jobbank.gc.ca for details and just use the filter tool for CS3 positions. I haven't been told that that would be an issue in my own pursuits other than I need to learn French. You might need to know or have experience in certain systems however since that is a tech lead level. Algonquin is very Oracle based so you might have issues in a Microsoft or IBM shop out of the gate.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's no problem. When I was looking into post secondary i also had asked for advice on Reddit. I don't mind at all giving back if this at all helps others who are in that situation too.\n\n  \n\n\nI am not bilingual. I know some Spanish but I do not know much french at all. This will impact my future career as I want to eventually move up to a CS03 position and then some and as you move higher up and take on roles you will need french. I don't want to go the manager stream but if I want to become a tech lead I will eventually need to know french as I will be expected to participate in meetings outside of my group.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If after a few years you think the government is not for you, how do you feel about your job opportunities to move into the private sector? Also, is French a requirement for the government jobs?",
            "score": 1,
            "author": "__senor__",
            "replies": [
                {
                    "level": 1,
                    "comment": "French is not a requirement for programming jobs in government, though you’ll need it down the road if you become a team leader.",
                    "score": 1,
                    "author": "GameDoesntStop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you get that graduate flair? I haven't actually played with those aspects of reddit yet. I'm slow in adopting the whole poweruser thing. I only recently installed Joey.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On the desktop site, it’s somewhere on the sidebar.",
                                    "score": 2,
                                    "author": "GameDoesntStop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks I found it",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think that I will have to brush up on my Java and SQL since I use neither at my work but I do think that Algonquin has prepared me for the private sector. Just the place I work at is currently one that supports legacy systems so unless I move to a private sector job that supports legacy I'll need to take a refresher of some sort.\n\n  \n\n\nFrench is not a requirement for my particular posting. However if you want to be a CS03 or if you are looking to eventually become a PL or manager you need to have a BBB.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if you do not have prior programming exp, is it possible to land a co-op with this particular course? How could you make yourself employable and competitive with other university grads (Ottawa, Carleton)?",
            "score": 1,
            "author": "tam3010",
            "replies": [
                {
                    "level": 1,
                    "comment": "I barely have had computer programming knowledge prior to my education at Algonquin. I had taken one class in highschool. If you know your stuff and do well at adapting and learning they are happy to teach you the rest.\n\n  \n\n\nUniversity students part time are comparatively cheap to train. The investment outweighs any shortfalls you may feel like you have.\n\n  \n\n\nThe coop is a huge must. I found that, and the teamwork aspect helped the most. I am not familiar with the University computer programs but I don't know how many of them have lab work where you work with groups. My employer was impressed with the work I did in a group for my final semester for the university of Ottawa and the study groups I was part of. So in short the coop experience and the collaboration. I studied with a group of students and we all helped each other out in different ways bringing us all up together rather than putting each other down to out compete one another.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you know anyone from the 3 year computer science course, and is there any difference on the job market or after graduation between your program and theirs?",
            "score": 1,
            "author": "Axonar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do know one person but I don't talk to him anymore. The main difference I remember with him was that in Algonquin we focused more on Oracle software (Java, SQL, MySQL, Oracle 11g, 12c,etc ) where he focused more on Python.\n\n  \n\n\nI noticed a slight preference in Algonquin graduates rather than university graduates at the place I work at simply for the prior experience working with those students during coop. I think it's the difference between hypothetically knowing something and actually doing it. That and knowing the intangibles. I mean at some point we're all googling code examples and checking out StackOverflow anyways. Anyone can do that. But to understand when and why those examples are used makes the difference.\n\n  \n\n\nThere was quite a high rate of Algonquin coop students staying with their coop placement post graduation. Many are government jobs at that.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for replying :D I was referring to the 3 year computer engineering tech program at Algonquin, so I'm glad to hear their co-op grads doing well",
                            "score": 1,
                            "author": "Axonar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I apologise. Unfortunately I do not have the answer to the question. I jumped on the coop route after a week or so of research. I wanted a better job than the retail job I was stuck with at the time.",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "did you find the co-op job through algonquin job portal or just self applying? also how many of your peers that were in coop ended up getting positions at government?",
            "score": 1,
            "author": "heythrwowey",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found it through the algonquin portal. It was pretty late in the game. I got selected late October/ early November.\n\n  \n\n\nEvery person except one in the group of 15 or so students I was close to landed a government job. The remaining one worked for a private company. It is very rare that, after putting in the work to train you that they will let you go. You're an investment and working with the coop program makes that investment much cheaper and safer. Just put in the work and look busy (and improve the documentation.) And you should be asked to return post graduation.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the difference between this and Computer Systems technician?",
            "score": 1,
            "author": "King-in-Council",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure, I think that is an answer that best can be answered by comparing the promotional materials. Off the top of my head I'm assuming that technicians deal with the physical components.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey bro I know   I am late but would really appreciate your response and advice . Sorry If these questions are a bit naive currently doing A levels and will be applying to unis / colleges for the Winter 2020 session \n\n1. I still haven't made my mind up to do a degree from a university or a college either way I would want to do computer science with co-op . What would you recommend ? As a student with a diploma did you find your self lacking applying to other jobs ? Will I have a disadvantage studying at a college ( as in less expertise / underqualified ) \n\n2. By 2 year + coop do you mean a totaly of 3 years or were those coop terms included in you study \n\n3. For an Undergrad would your recommend \nA. Computer science / computer engineering\nB.  Computer Programming\n\nOnce again , would appreciate the advice and if you have anything in mind other then these question be sure to let me know 😊",
            "score": 1,
            "author": "ozayfay",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. I don't beleive I can answer that question fully. I think the coop is more important. If you have something in mind college is a lot cheaper to pay off. Unfortunately I am not familiar with university provided education for computers. I'd think that would have a higher ceiling given the degree that which you are learning the theory. I'm earning a comfortable amount at my job and the government is the biggest employer here. I never found a lack of job opportunities after college.\n\n  \n\n\n  \n\n\n  \n\n\n2. I did two years of school and one year of coop. But one of those coop terms was during the summer. So really five semesters of school then two semesters of coop the. One semester school.\n\n  \n\n\n3. I feel like your guidance counselor would be a better person to contact or even going to the registrar's office and ask them to direct you to the right person. I went computer programming and landed myself a job. That's what I wanted to do. I don't know how future proof my job is. That is something you'll have to compare the curriculums for and research the trends going on where you wish to apply. Government is slower to adapt so current trends are fine. You can also check out to see what Blackberry is doing with automated cars and the other industries out there around the NCR. I am also personally worried about my career due to the rise of machine learning. I think that might be something you'll want to look into.\n\n  \n\n\nI don't have anything at the moment to add but I'll look over the question tomorrow when I am on lunch to see what I can add that might be helpful.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I am also personally worried about my career due to the rise of machine learning. I think that might be something you'll want to look into.\n\nI heard about it a lot lately, but doesn't it potentially affect basicaly every job as we know today? Is there any reason why programmers should be more worried about?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Programers are often about problem solving. We look at the facts. Weigh the variables. Come up with a set list of procedures to perform and an alrogithm to follow. \n\nIt's not too far out of the norm to see deep learning algorithms creating the proper calculus to solve the issues that arise in production. We already have a lot of self generating code as it is. \n\nProgrammers are also all competing for the same slice of pie. If you cant wrap your head around whatever is the hot market commodity at that given time or the language of majority it is easy to get lost. \n\nCase and point, I have to reteach myself Java because I forgot most of it after 3+ years of COBOL. \n\nThe fear seems to stem from either you will learn how to code for deep learning or machine learning or you will be coding for very specific things that it would not be cost effective to machine learn. But that gets thrown out the window if Quantum Computing becomes a contender. In which case you are faced against machine learning backed up by quantum computing.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly, it still seems to me that it would affect all human professions. Maybe programmers even would still have a place in fixing or fine tuning these AI systems?",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey! kind of late here. I am about to start the computer programmer course, but I am still contemplating potentially switching into the CET course down the line. One of the main reasons for this is that I hear that the CET course can get you directly into a CS-02 position while the computer programmers start at CS-01. So I guess my question would be, do you know anyone that took the computer programmer course that ended up getting a CS-02 role directly after graduation? Thanks for all the replies, they are very helpful!!",
            "score": 1,
            "author": "gon2killua",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, I don't know anyone who jumped to CS02 right away. I know a few people who got CS02 within a year of employment but that guy has horse shoes for says.\n\n  \n\n\nIt took me three years to get my CS02. There are some benefits for starting on CS01. That your pension buy back (for the time you were in coop) will be a lot cheaper than in a higher position.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "interesting thanks for the response. Did you work part time while doing the program? Did you have any experience with FSWEP?",
                            "score": 1,
                            "author": "gon2killua"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi,\n\nMy question is i do not have any background about programming and also i am not young anymore :) how hard to start from beginning?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I only had a bit of Basic in highschool but I really didn't grasp even something as simple as a loop.\n\n  \n\n\nI went back to Algonquin in my late 20s. Many of the other students were in their late 30s early 40s. I think that so long as you are good with getting a study group together. That really helped..having something explained from a different perspective that I didn't explain or explaining something explained to me that I didn't understand really made the difference.\n\n  \n\n\nI had a hell of a time with Object Oriented programming when I first started.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Algonquin in my late 20s. Many of the other students were in their late 30s early 40s\n\nThank you so much :)",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's no problem. Honestly it's enthusiasm more than age. I found that the ones fresh out of highschool had the hardest time since they didn't develop the study habits or social skills to form groups.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi there, if everything goes right, I'll be doing this course starting in May/2020. \n\nAre there a good number of job offers in this area? \n\nWas the course too difficult? Do I have to have some background? I'm learning Python before it starts.\n\nHow was your timetable? Any difficulty to conciliate the course with a part-time job in the beginning?\n\nThanks in advance!",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Government is always looking. I don't know the current market since I am indeterminate now but if you do CoOp I don't see why you wouldn't be picked up. \n\nI didn't find it insurmountable, but I had to change how I studied. I formed study groups and asked for help. I also had to spend a lot of time wrapping my head around object oriented programing and the like. My only background when I started was high school RealBASIC. I struggled a lot first semester but it got easier as I forced myself to study harder and work with others to figure out together. \n\nIf you want a bit of practice before going to school, anyone who had a library card has access to Lynda.com. There's plenty of resources there. That and the Android Course is 99% just the good Android Course. So if you follow that it gives you some good introductions to Java, SQL, and XML. \n\nI worked part time while at school. It really depends on what is available. I think I had enough of a time to work 1 weekday and 2 weekend days total. You could also try to find work near or on campus , they will be more accommodating I think. \n\nI do remember too when I had a full-time job I asked the coordinator if there was a way to have a compressed schedule and he was fine with that (it was Reg Dyer at the time I went). I didn't take that option though since I had quit that job. \n\nIirc I worked bestbuy when I first started so I had some leeway as product process works 6am on Fridays. Most of my classes ended before 6 too so I could do 6-close. I wish I could give you a more definitive answer.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks a lot! Another question that came up, I'm an international student, so gov. jobs won't be an option, because they ask for PR. Am I going to be too hindered by only having private sector options? Is that Kanata region really good as they say?\n\n\n&gt;I think I had enough of a time to work 1 weekday and 2 weekend days total\n\nDid that total the 20 weekly hours of a part time job? I'm pretty sure by my calculations that I'll have to work that 20 hours to mantain myself, as my wife will be working 40 hours, and we will be needing every cent to survive.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know the location of Kanata too well for coop placements but I know Algonquin made every attempt to get the international students a placement and if they couldn't they had coop placements with the school itself. So you should be okay for that. \n\nYou won't be hindered by private sector jobs. Private sector is where you make money. Government jobs are for stability and retirement. \n\nI think i worked 24 hours total. I also worked during the holidays when working a job that offered that for time and a half.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know if your still answering questions but I'll shoot. I am set to start the 2 year coop Computer Programming program this winter term. I got really lucky and ended up in a 3 month coding boot camp where they try to help you get a job once you finish. I'm contemplating not even going to college and perhaps just trying to get a job once this boot camp ends. It teaches the basics of HTML, CSS, JavaScript and Bootstrap. Is that enough to land a job or do you think it would be better to just go to college?",
            "score": 1,
            "author": "Sato837",
            "replies": [
                {
                    "level": 1,
                    "comment": "Coop is how I got in because companies saw it as a low investment with high gain. The issue with not going through coop is that you fall in that junior programmer with 13 years experience trap. With coop you get an in and since they has you for several months they want to keep you. \n\nWhat my boss said after a few months of being hired was \"we take college students, not for what they know, but because we know that they can learn\". That and you get interviews through a much smaller pool. Whenever you get an interview and they ask questions always ask \"based upon what I have demonstrated what is one skill I ought to work on between now and when I am hopefully hired that I should brush up on\". They love that. \n\nThe problem with having web programing as your took kit is that, while yes it is good to have, but so many companies just use drag and drop tools. Why create a website when you can just use square space or put shit together using the tools on Amazon? My friend went with web programming and eventually she got burnt out because of all the automated tools that the preferred. That and with web programming it is really stressful because it's an iterative process and customers never know what they want or how difficult it is to code for. \n\nFrom what I've been hearing, a major thing to focus on is cloud programming and mobile programming.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks so much for the quick reply! You make a good point, I think it's worth it to go simply for the coop itself.",
                            "score": 1,
                            "author": "Sato837",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Coop and learning how to work with others have been the best parts of my experience. \n\n\nI highly recommend you start a study group. Having a study group did wonders for me because when I knew something well I was able to help others and in doing so cementing my knowledge and when I didn't know something I had the help I needed. \n\nBe prepared to be very frustrated at the professors.  A lot of them are part time and very under paid so they will be .... Not the best. Though the java teacher I had was phenomenal.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My ultimate goal is to get into the government. Do they have a lot of co-op opportunity? If it's limited, what would someone do to better their chances of getting it? A professors recommendation, great GPA, good resume...?",
                                            "score": 1,
                                            "author": "Sato837",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A lot of my friends got their government coop placements from Algonquin.  It's also easier to hire from student than from an outside pool. The government is very risk adverse so hiring from a coop is preferential from what I've seen. \n\nThere's plenty of government jobs available and with remote work there's a strong likelihood that the pool would be even bigger. \n\nI found that the willingness to learn new technologies (even if 'new' is legacy) is what got me in the door.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's great to hear that a lot your friends got in. How was the procedure for getting co-op placements? Does Algonquin give you a list of places to apply and then you wait to be called for an interview?",
                                                            "score": 1,
                                                            "author": "Sato837"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks a lot for your help. When is the best cohort to join in September or in January?\nAlso, I am a permanent resident, any idea if gov coops prefer Canadian citizens over PRs. I mean do they highlight in the job application preference for Canadian citizens?\nThanks a lot :)",
            "score": 1,
            "author": "Severe-Sweet1590"
        },
        {
            "level": 0,
            "comment": "Necro-ing this thread a bit, but where are you now? I'm starting this program in Sept. and my primary concern is that I want nothing to do with gvmt jobs and working for the public sector, but it seems like the program sort of sets you up to work with gvmt. Are there even many companies in private sector to apply to for co-op? I don't want to pigeonhole myself into gvmt.",
            "score": 1,
            "author": "l0liMaster"
        }
    ]
}