{
    "id": "pjvjmm",
    "score": 16,
    "title": "Top 7 Tips (imo!) to stay ahead of your game in College!",
    "author": "coolin68",
    "date": 1631047440.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/pjvjmm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone,\n\nHope you’re all having an amazing day!! \n\nIs it Orientation Day for you? Tell me about it! What did you learn? \n\n**Did you join AC’s Day 1 Activities? How was it?!** \n\n— Tell me about your long weekend!? What did you do? Did you get absolutely blacked out, hangout with some friends / family, or just “hangout” ? Let me know, down below if you wish - \n\n **Here’s some tips for your College experience, whether you’re a Freshman, or a returning student!** \n\n*(I swear I will try and make this exciting as possible)*\n\n#Numero Uno \n\n**Get to know people!!**\n\nSeriously. As another redditor just posted about this, saying “talk to people” .. and making a rant post about it.. simply DO IT! :) It might make your nerves all anxious and all, but everyone else is just as nervous as you. So go out there, and literally just say “hey!” or “how’s your day” or literally, literally just anything. We’re all human, and we need that social aspect in our life. \n\nCollege is 110% more amazing with friends. - heck, even Online works, if you’re introverted... but push yourself out of that comfort zone, and you’ll feel alive. Everyone’s “bored” . Just talk !! \n\n*We’re all introverted to some sense, and open up and become extroverted to those who we’re comfortable with!*\n\n- If you’re in Residence? You’ll find so many new people. Write a sticky note on a door if youre so nervous! Go show up to those residence events, have some fun! \n\nMake lots of connections, and you wont regret it! \n\n#KAKS\n\nGoogle it, if you don’t understand! \n\n**Get a Tutor or Counselor when you need one**\n\nLook it, not everyone is a genius, and can remember everything handed to them. If you need help, don’t fret. You don’t look “dumb” , “lame” , whateverr you want to think... don’t be shy to say you’re not doing well. \n\nThis points back to Tip Numero Uno. \n\n**Talk.**\n\nPeople care about you, your classmates, and your professor. They want to see you do well !!! You’re all a team. So if you need help? Get a tutor. Talk to a buddy in your class to help you, the teacher, or one assigned to you thru your **Colleges Student Success.**\n\nIf you’re not feelin too hot, under the blue, and just want someone to talk to about things? Your student success will give you a student counselor to talk to. I can promise you that this will help you out tremendously, even if everything is okay - just say “boo!” and it will make their day. Everyone gets bored - just talk! :) \n\nHelp yourself out. Give yourself those grades you want. Talk to people - maybe a counselor! \n\n#THREEEE! \n\n**You need a calendar**\n\nLiterally. Trust me. \n\nYou’ll have assignments thrown at you, left , right , and center. Dont just think “I’ll remember it” .. **PLAN!!** your days, tests, assignments, etc., \n\nThat way, you won’t get everything mixed up ... and wont be buggin the teacher saying “when is this thing due again?” \n\nDays go by a lot smoother knowing when you have something on the go the next day, or week. Makes you plan things easier. \n\n#FANTASTIC FOUR\n\n**What fantastic four movie is your favourite?**\n\n**Whats your favourite character from the movie?**\n\nSince we’re talking about Fantastic Four, lets talk about \n\n**GROUP WORK and TEAMS!**\n\nAlso, kind of like Tobias “Four” Eaton, and Beatrice “Tris” Prior... theres teamwork in that! \n\nYou all want to beat that “big boss” at the end.. and defeat it with a massive score! \n\nThe best way to manage group work is to be a team player. Collaborate. Work together, and it’ll be an easier path to victory instead of trying to make it a “competition” ... everyone wants a good mark - have clear Objectives, Roles, and make some rules, if it helps any. You can tie things in from other members from your portion, and vice versa. This creates “flow” ...\n\nNo one wants to listen through a boring powerpoint when everyone just reads the slides... so look up, get your other members to slip in a word or two of what you’re saying - and it’ll make it more enjoyable. \n\nThis way, you “defeat the boss” , and get that beautifulll A+ . Which may be a “High Score” to you! \n\n#FAST 5\n\nYou like that I added in Fast and the Furious, eh? \n\nHopefully we all know Dom’s 1970 Dodge Charger. If not, its pretty damn fast! \n\nSo let’s relate this back at ya! \n\nYou definitely do not want to rush those assignments, tests, and get it all done super quickly. Even if is super duper simple... take your time, look through things, look for those keywords, and what they want you to do.. and do it to your best efforts...because your fast paced efforts? Probably are **not** your best... but we’re all different, so who knows! Maybe this rule doesn’t apply to you...\n\nBut take your time. Relax. Plan everything out. Work on it slowly, day by day a couple o days before the due date... just so you can review that assignment / study notes and make it all crystal clear. \n\n#SIX FLAGS\n\n**Try out new entertainment!**\n\nThis will bring back tip 1, 3, and 5. \n\nGo out and enjoy everything around your College campus, residence, and location you’re living in. \n\nYou’ll get to meet new people... but you’ll definitely want to have some fun while at College. You’ll learn **WAY MORE** about yourself while you’re away in College. That’s a fact! \n\nBut you cannot do this (I mean, literally be a rule breaker) if you don’t have the free time needed when you plop everything into a calendar... and get it all done super fast just to try out new things. \n\nAllow yourself to have those well needed breaks, and enjoy the college experience! \n\n#SEVEN NATION ARMY\n\nCouldn’t hold me back. \n\nDon’t know the meaning behind the song? \n\nIt’s about gossip, talking about eachother behind their backs.. atleast in my opinion, but also if you google it! He does mention it. \n\n**Stay away from Drama**\n\nLiterally, it’s College. \n\nWe’re all adults, and its a waste of time. Stay away from Drama as much as possible, if you can. \n\nIt’s a negative space of energy, and it’ll ruin your mood, and the other person’s mood , and everyone who’s involved. \n\nTry and stick with positive people, **meet new connections** , and live it up in a positive space. Nobody needs that negative energy, and bad friends.\n\nSo if you have someone in your life who is holding you back, away from your success and happiness? \n\nRip them away, and throw em out. \n\nYou’ll be sad at first, but more alive than ever to find that negative person, gone.\n\n#Magic 8\n\nBonus. \n\n**Have fun!!**\n\nCollege goes by WAY too damn fast, you’ll blink and it’l be December. It just happens!! \n\nEnjoy your program / College while it lasts... because you’ll miss it when its gone... does anyone else still miss High School? Because, same. \n\n————-\n\nHope all of you do well in your program, and best wishes to you! \n\nGood luck! \n\nHave fun! \n\nStay safe\n\nTake care! \n\n- and hope you enjoyed these little tips! \n\n**If you have read all of this, tell me what program you’re in! You’ll be able to maybe meet new friends, who are in your program!**",
    "comments": []
}