{
    "id": "sv06h0",
    "score": 5,
    "title": "DENTAL HYGIENE",
    "author": "meggerp",
    "date": 1645134130.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/sv06h0",
    "media_urls": [],
    "other_urls": [],
    "postText": "i’ve been super confused on acceptances and just general information there’s NO INFORMATION being shared, i’ve been trying to connect with people who have applied as well, so here’s what I have learnt today, I hope this can help some people: \n\n*AND NO I HAVEN’T RECEIVED AN ACCEPTANCE YET*\n\nalso if you know anymore information pls share :)!\n\n\n1) \nthere are only 58 people actually accepted into the program \n\n2)\nif you got the email that said acceptances are coming out march 1st, apparently that’s changed. I know of 4 people who got acceptances today (February 17) and they were both deans list pre-health students (they got early acceptance). TURNS OUT ACCEPTANCES START TMR FEBRUARY 18TH\n\n3)\nmake sure your calculating your hpat score properly, to get your proper score each of your 4 categories is out of 300 (I KNOW ITS OUT OF 8, 300, 300, &amp; 60) the highest score you can get is 1200: (4 X 300 = 1200) \nstudents closest too 1200, get offers \n\n4)\njust because 1000 + people applied doesn’t mean your competing with 1000 people that’s just the number of people who APPLIED it may not be their first choice either, there’s also a lot of people who didn’t write the hpat or were missing requirements. so the number of people may be a lot smaller than you think (still a lot of ppl though) \n\n5)\nif you completed your hpat, application, and got all your requirements in on time you have a huge advantage to others you’ll be considered first. \n\n6)\nif you took advanced pre-health check your first semester grades and see if you are over the GPA needed for algonquins agreement with competitive programs (for dental is 2.70 GPA MINIMUM) \n\n7)\nif you don’t think you will be considered and don’t wanna take dental assisting, APPLY TO CAMBRIAN (sudbury) AND CANADORE (north bay), they are SUPER easy to get into, it’s not too late and it’s a really good other option to consider if you’re worried!!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm apply to RT and have been hearing from quite a few people who have gotten in today and i've been freaking out!! This definitely helped!!",
            "score": 5,
            "author": "New_Conclusion6221"
        },
        {
            "level": 0,
            "comment": "I’m waiting to hear if I got into the DH and DA Programs too.  I’ll post here as soon as I get word.  🤞",
            "score": 2,
            "author": "neoeanmom24",
            "replies": [
                {
                    "level": 1,
                    "comment": "me too!!",
                    "score": 2,
                    "author": "meggerp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you heard anything yet?  I was waitlisted for both DH and DA and was informed today that I can call on or after April 1st to see where I am on the lists if not offered a spot before then.  Hope you got in!!!",
                            "score": 1,
                            "author": "neoeanmom24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha you pretty much summed it up!!",
            "score": 1,
            "author": "diginordagan"
        },
        {
            "level": 0,
            "comment": "An email was sent out to the prehealth students saying that “All offers should be out within the next couple of weeks”. Basically means that just because someone didn’t get an offer today that doesn’t mean they didn’t get in.",
            "score": 1,
            "author": "diginordagan",
            "replies": [
                {
                    "level": 1,
                    "comment": "omg which email i gotta check now, thank you so much",
                    "score": 1,
                    "author": "meggerp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not sure how many people they’re planning to accept in fall 2022, but for 2021 they only accepted 48 in the DH program. They’ve reduced numbers because of COVID.",
            "score": 1,
            "author": "somcurl2",
            "replies": [
                {
                    "level": 1,
                    "comment": "are you in the program?",
                    "score": 1,
                    "author": "meggerp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I’m in my second semester",
                            "score": 1,
                            "author": "somcurl2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what were your grades if you don’t mind me asking??",
                                    "score": 1,
                                    "author": "meggerp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I contacted the admissions office shortly after taking the HPAT and they told me I got 1101 on the test.\n\nI wasn’t sure how to calculate my score at the time but if it’s out of 1200 I got a 91.75%. I remember I did pretty badly on the science portion but my other scores must’ve outweighed it. I never took pre-health.",
                                            "score": 1,
                                            "author": "somcurl2"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "also congrats that amazing!! and did you take a pre-health?",
                                    "score": 1,
                                    "author": "meggerp"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I went to the advanced health programs open house in January and they said that because of covid they reduced it to around 30ish people for dental hygiene and 20ish for respiratory therapy",
                    "score": 1,
                    "author": "diginordagan"
                }
            ]
        }
    ]
}