{
    "id": "sxi3c8",
    "score": 2,
    "title": "CP or CET:CS",
    "author": "i-CARNAGE-i",
    "date": 1645410014.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/sxi3c8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all,\nMy name is Himanshu Sharma and I am an international student from India. Actually I am confused between CP and CET. I am not really sure that how much would paying an 1 extra year of fees would benifit me. So can anyone give me idea about this. Also is there any option of getting into CET advanced diploma after completing my CP diploma.",
    "comments": [
        {
            "level": 0,
            "comment": "I would say if you want to learn about the internal working of computers, then go for CET but if your focus is just on building programs then go for CP. From a job perspective, there is no difference as such, you will be getting the same set of jobs in your co-op term in both programs. My advice would be to go for CP and then go to university for a bachelor's after getting your PR. It will save you one year of international student fees which is roughly equal to 17,600 dollars, plus you will get into the industry pretty quickly which I would say is more valuable than that one year of study. There are some important courses like Data Structures that are only taught in CET. Don't worry about it, if you have the instinct to learn to program you will be better off learning such things by yourself (Trust me in most of the courses, you will be learning more from YouTube than lectures anyways). I am currently in the CET program and the quality of study is not that good. It's the same thing in every other college in Canada, I have friends studying at Centennial, Sheridan and Seneca College. Most of the time you will be just completing your assignments without even knowing what you are doing. At last, if you are worried about getting a job after CP. Believe me, you will be in the same position after doing either of the programs.",
            "score": 4,
            "author": "Dr__Shotgun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn bro, you've said it so on point and so clear....thank you so much😭. I am going to apply gor CP after this, thanks again. Also are there transfer options after CP?, It'll be really helpful if you can tell about it.",
                    "score": 1,
                    "author": "i-CARNAGE-i",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. If you are talking about transfers to university, then unfortunately no university will count credits from either CET or CP program. However, they may let you drop from 1-2 courses (which will depend on the program you select) but not more than that. But you can either do a 3-year or 4-year bachelor's after your diploma if you care about time. But as I said, you are never old to study. Select what's best for you. And addressing your last question in the original post, you can switch from CP to CET anytime but the best time for that is within semester 1 because semester 1 from both CET and CP are exactly the same. Otherwise, you have to do pre-requisites for the follow-up courses. All the best for your future!",
                            "score": 2,
                            "author": "Dr__Shotgun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok, Thanks once again. Now after seeing your response i have dropped the idea of transferring to CET and now I am more on the track of going for a bachelor's after getting PR. Till then I'll work hard and lear more. Thanks.",
                                    "score": 1,
                                    "author": "i-CARNAGE-i"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hi! I just enrolled in at Algonquin for Mechanical Engineering Technology and would like to switch to CET, after much consideration. I was wondering if switching programs is possible as well as would it better if I switch once my Student Visa is done. I am supposed to apply for it this week (as the processing times are lengthy). Will Algonquin allow for me to switch programs once I am in CA - or- will I have to come back with a new Study Permit for the switch?",
                                    "score": 1,
                                    "author": "eos-k"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The diploma is less important than the experience and skills you get.\n\nWhat are your career goals? That helps figure out which program you should take.",
            "score": 3,
            "author": "WildRyc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to work as a programmer. I really love to make break a problem than put the solution into the code and make a working program out of it. I have read somewhere that CET is more deep and have much to offer but I have also read that the grads of both the diplomas work under the same roof for same pay cheques. So atlast I would just say, I like to code and make programs and would love to take it as an occupation. Being an international student I also want to earn quick but also don't want that quickness to affect my education..........You see I am so much confused.😔",
                    "score": 1,
                    "author": "i-CARNAGE-i"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't speak for CP, but I think CET is more in-depth about computers than CP. There's still a lot of programming classes and you will learn multiple languages such as Java, C, C#, C++, COBL (if you take the COBL elective).   \n\n\nThere is value in taking CET, even if your goal is just to program. Understanding the computer will make you a better programmer, whether it's understanding memory allocation or understanding how to run your program on a Linux server. I absolutely hated compilers, but it made me a better programmer as well.   \n\n\nIt's up to you. I haven't heard bad things from the CP program and I would imagine that it's also a good program.   \n\n\nOne thing about CET, it is out of date. The learning is still important, but it could be better if the department put any effort into updating the program every once in a while.",
            "score": 2,
            "author": "mwbeaver87",
            "replies": [
                {
                    "level": 1,
                    "comment": "But being an International student I will have to pay 17-18k more on it if I will take CET and an extra year of life too. I have also seen students saying that at last both the programs give same type and same salary jobs. So don't you think doing CP for now and getting a job quickly and then going for a Bachelor's later after getting my PR would be a better option for me?",
                    "score": 2,
                    "author": "i-CARNAGE-i",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That might be a good way to go then. I was just describing why I think CET is good value, but a Comp Sci bachelors down the road is a good option.",
                            "score": 2,
                            "author": "mwbeaver87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for your opinion and advice. And yeah I also think that both CET and CP they both are pretty old. Courses in CP only have Java as programming language and don't have new gen languages like Python, C++ etc. I mean they should add another language than Java, to make the program more worthy and useful. Thats why I think Bachelor's will be a better option. Also bachelor's was my first choice but because of the high international tution fees i dropped the idea. But after getting a PR it will be in my reach. Also I am always open for learning so I think if I will get the job early then I will lear from my job too. Too many words too many talks but the main thing is, I'm going for CP and after getting PR will do Bachelor's.",
                                    "score": 1,
                                    "author": "i-CARNAGE-i"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}