{
    "id": "uf636c",
    "score": 6,
    "title": "Questions about the Computer Programming Program",
    "author": "OkDragonfruit3765",
    "date": 1651303473.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/uf636c",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been researching the computer programming program and I was wondering if any current attendants/ graduates could answer some questions\n\n1. Would you personally recommend to join during the fall semester or the winter semester? I ask because the fall semester is currently waitlisted and I doubt it will open up by the time school starts.\n2. What was your experience in trying to find coops/ employment after you graduated? Is having the 2 year diploma enough to find a job? I ask because wouldn't employers favor people who did the three-year program or have a university degree in CS ( or something related)\n3. How hard did you find the program? By this I mean is it something that would be out be out of this world for someone with very little/ no programming experience or would it be manageable as long as you put your head to the grindstone.\n4. What recommendations do you have for someone who was considering the program?\n\nThank you for reading my questions, and I hope some people will be able to answer.",
    "comments": [
        {
            "level": 0,
            "comment": "1. I joined during the winter semester and found that my peers were a lot older than me and were very serious about their schooling. This may have been because there weren’t many students coming fresh out of high school.\n\n2. Found a co-op in government after my 3rd semester. In my opinion, the two-year program doesn’t prepare you for acquiring a job in the private sector, so if that’s what you’re looking for prepare to learn about data structures on your own time.\n\n3. I had a lot of experience so I found most of it achievable, however the program caught up to my prior ability partly through the second semester. Definitely doable if you put the time in and treat it like a job.\n\n4. Study everything yourself. Don’t wait for teachers to teach things properly, because they never will, and you’ll notice that your peers spend a lot of their time complaining. Work hard, this program is only 2 years long and if you’re looking for a job soon after you can get in and out quickly without the crushed soul and brain fog that comes from spending 4 years at a university. The industry is all about your ability to learn new things, and this program is your chance to pick up that skill.",
            "score": 5,
            "author": "ScrimmlyBingus",
            "replies": [
                {
                    "level": 1,
                    "comment": "How hard was it to find the co-op within the government? Did you take the COBOL  course at the school to help with trying to find the government job.",
                    "score": 1,
                    "author": "OkDragonfruit3765",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I landed one interview and ended up getting that job. And yes, I took the COBOL course but my department doesn’t use COBOL at all as far as I’m aware so it probably would’ve been more helpful if I took the Business Intelligence course instead. That may vary depending on department and role.\n\nEdit: More info, the co-op job search goes by in rounds so I had to revise my resume since I didn’t get anything the first round. Keep our resume very concise and straight-cut so it actually gets through HR. The interview is your opportunity to show your personality.",
                            "score": 1,
                            "author": "ScrimmlyBingus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&amp;#x200B;\n\nWhat new things did you add on your resume? By that I mean weren't you looking for a coop during the same semester? Were you learning other things outside of class to try and make your resume stand out?",
                                    "score": 1,
                                    "author": "OkDragonfruit3765",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mostly took things out of my resume, things like high school and prior experience. I also made a little project that took like 10 minutes and put it on github, then mentioned my resume and linked my github in my resume. They brought it up in my interview so I think it was a good call, it turned out to be a nice talking point about my interests outside of school even if it was embellished a bit",
                                            "score": 3,
                                            "author": "ScrimmlyBingus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you need french to get a coop in the Gov?",
                                    "score": 1,
                                    "author": "Ottawaguitar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it might depend on the position, but for IT not usually. if you want to make a career out of it you’re going to hit a wall without french but they’ll put you through french classes if you get employed after the co-op (or during the co-op if you’re lucky)",
                                            "score": 1,
                                            "author": "ScrimmlyBingus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi there!\n\nIm currently enrolled in CP. I just finished my second term. Although I can’t speak for what it’s like after graduating/finding a job etc. \n\nI can tell you what my experience so far with the program. I came into the program with little to no experience with Computer Programming. I have a background in healthcare and when COVID started, I decided it was time for a change. I applied when the program was waitlisted, and unfortunately I didn’t secure a spot. So I re-applied again for Fall 2021 and successfully got in. \n\nThe program is challenging. Specially if you have no prior experience to CP, but it’s definitely doable if you put in the work. \n\nI find that second term was easier than the first, since I had some knowledge of the materials being taught. With my first term, I struggled with most of my classes since everything was new to me! I think the class I struggled the most was Math! \n\nI recommend signing up for free programming classes online. I find that codecademy helped a lot. And I watched tons of youtube videos about programming concepts.",
            "score": 4,
            "author": "sprdnz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the response. I will definitely check out codecademy to try and not be a fish out of water this coming winter term.",
                    "score": 1,
                    "author": "OkDragonfruit3765"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently in my last coop of CET\n\n1. I started in the summer term and honestly it doesn’t really matter when you start, you’ll typically have fuller classes with high schoolers in fall but after midterms people slowly stop showing up to class. \n\n2. Depending on your networking skills and other projects you’ve done. To really stand out to recruiters I highly suggest doing you’re own side projects so that your resume stands out. It doesn’t really matter if you’ve been in school for 2 or 3 years it’s the experiences you gained and that’s why going into the coop stream is so important. I only got into the private sector because a friends dad took a big risk with hiring me for my first coop but when it came time to apply for my second and third coop terms I had people requesting me. \n\n3. I started off CET not knowing how to code but after a month you’ll understand a lot more. I did have a bunch of breakdowns but I feel like any stem course will do that to y’a. Also GOOGLE IS YOUR FRIEND!!!\n\n4. Don’t plagiarize, keep networking and when it comes time to look for a job/coop it’s really important to know what you’re doing but you also need to have a good personality\n\nFeel free to pm me if you have any more questions",
            "score": 3,
            "author": "fruitypoptart"
        },
        {
            "level": 0,
            "comment": "Finished third sem going into coop terms\n\n1) Id wait for one thats not waitlisted\n\n2) Finding a coop isnt too difficult assuming that you get on it as soon as hireAC opens up for you\n\n3) I personally do not find it that difficult but some things can get pretty tedious , you may need to really sit down for a while when it comes to certain topics.\n\n4) Spend time learning on your own do not rely on the courses alone to pull you through, learn on your own time in a way thats fun for you and you'll do fine.",
            "score": 2,
            "author": "Due_Organization7681",
            "replies": [
                {
                    "level": 1,
                    "comment": "My maths skill is terrible, is it still possible to take this CP program? I've heard a lot of ppl dropped out from CP program. What do you think is the key to successfully graduate from this program?",
                    "score": 2,
                    "author": "MeAlwaysLucky414",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Theres only one math course and its just review of highschool stuff, the key to succeeding is having an analytical/programmatical mindset, if you learn and grow easily when it comes to tech and problem solving then you likely are good to go",
                            "score": 1,
                            "author": "Due_Organization7681",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks very much!",
                                    "score": 2,
                                    "author": "MeAlwaysLucky414"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for responding. In terms of your co-ops, did you have a hard time going about it assuming you don't have a university degree? ( I apologize if you do, I am only making the assumption and asking as I personally do not have one and was wondering what type of hinderance it would be on me)",
                    "score": 1,
                    "author": "OkDragonfruit3765",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have no higher education except for this, finding a coop should not be an issue for you, there are more jobs than students it's just a matter of getting in there early.",
                            "score": 1,
                            "author": "Due_Organization7681"
                        }
                    ]
                }
            ]
        }
    ]
}