{
    "id": "vs5ccd",
    "score": 3,
    "title": "How crazy is parking at Gonq?",
    "author": "RycoWilliams98",
    "date": 1657047631.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/vs5ccd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am immunocompromised and can't take the bus should I look into getting a parking pass or does it not really matter because its first come first serve?\n\n I am also commuting from Kanata so I guess fml for next year. Although I guess its not as bad as Carleton.",
    "comments": [
        {
            "level": 0,
            "comment": "Anyone know if the parking passes are worth buying?",
            "score": 3,
            "author": "WhereIsMyLactaid"
        },
        {
            "level": 0,
            "comment": "This year was 100% fine for me parking, but there were fewer people on campus due to restrictions",
            "score": 2,
            "author": "JustWannaPetAnimals"
        },
        {
            "level": 0,
            "comment": "I see the security team checking cars daily so if you park - pay or buy a monthly pass. They’re pretty vigilant. A few students in my class have gotten ticketed.",
            "score": 2,
            "author": "gitsproject2501",
            "replies": [
                {
                    "level": 1,
                    "comment": "Security doesn’t check cars. It’s parking services. And they’re absolute parking nazis. \n\nSecurity checks vehicles for damage, children, pets, and illegal activity.",
                    "score": 2,
                    "author": "IHaveBlackCousins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've heard from teachers that it gets pretty rough but haven't seen it personally.\n\nI will say though, I work across the street at College Square, and I've never seen parking limits enforced. Not sure if it's completely safe but that might be a plan C",
            "score": 3,
            "author": "CptJackal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know about now, but 7 or 8 years ago I parked at College Square once during exam week as I was in a jam. I was gone maybe an hour and came back to a nice $80 (if I remember correctly) parking ticket.\n\nI remember the same happening to friends quite frequently so I know it was pretty strictly enforced back then.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yeah ik they usually ticket you if you are there for more than an avg shopping time frame.",
                    "score": 2,
                    "author": "RycoWilliams98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah makes sense. I've never seen it happen on the Home Depot side but could be because theres been less demand. With so few people actually going to the campus. I've for sure seen people leave cars/trucks there overnight though.",
                            "score": 2,
                            "author": "CptJackal"
                        }
                    ]
                }
            ]
        }
    ]
}