{
    "id": "vvlqtl",
    "score": 5,
    "title": "Switching to Online",
    "author": "Advanced_Bumblebee49",
    "date": 1657436089.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/vvlqtl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\nI’m switching from campus to online. I just feel I don’t want to go back to campus. I’m currently studying Business administration (core) level 5 accounting. I wonder if anyone studying the same program online to give me some feedback about the difficulties that I will face, how I can make the journey easy on me, and recommendations pls\n\nThanks a lot",
    "comments": [
        {
            "level": 0,
            "comment": "I'm going into level 3 BA online. All your courses are released on day 1 on your acsis schedule. Likely will be a mix of classes on Brightspace and OntarioLearn. Access the course outlines right away and note your graded assignments/participations throughout the semester. Either print off each outline or copy it down somewhere for reference. \n\nYou should also go through each course on day 1 and setup any software or 3rd party websites (textbooks, pearson learning, etc)",
            "score": 3,
            "author": "Other_Dig_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the great advice I will consider all of them throughout the semester!",
                    "score": 1,
                    "author": "Advanced_Bumblebee49"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm on level 4 of the online BA Accounting program, although I'm doing it part-time. I work full-time amd have two kids so I love the flexibility of being able to do my readings and assignments whenever I have the time free rather than having to attend a scheduled class. With online I find the two biggest challenges are keeping organized to get everything completed on time and getting help when you aren't understanding a concept because you aren't able to ask questions face-to-face. \n\nThe first day of class I enter all my due dates into my Google calendar with a reminder a week ahead so I'm never scrambling to complete an assignment at the last minute. I also block off time each week to do the readings and coursework. \n\nSome profs are better than others at including examples and other resources to explain the material. Others basically have you read the textbook and a handful of notes. For some classes I like to review other sources to make sure I really understand the concepts (like Khan Academy for math stuff) and make sure I email the professor if I've tried and really can't figure something out. You definitely need to be proactive about seeking help if you need it because it's hard to clarify things outside of the usual classroom setting. \n\nFeel free to dm me if you have any questions!",
            "score": 3,
            "author": "Ter_Bear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your comment, I couldn’t appreciate more! I still have some questions. I will dm you",
                    "score": 1,
                    "author": "Advanced_Bumblebee49"
                }
            ]
        }
    ]
}