{
    "id": "wfg2qc",
    "score": 3,
    "title": "Defer Fees",
    "author": "Advanced_Bumblebee49",
    "date": 1659555971.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/wfg2qc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, \n\nI was a campus delivery student, and I just switched to online, but I already deferred my fees on ACSIS in Jun. \nI’m wondering if deferring the fees is different from campus to online delivery. Pls, help!",
    "comments": [
        {
            "level": 0,
            "comment": "Online does everything on a semester basis; if you deferred your fees for the fall semester then there is nothing more that needs to be done.",
            "score": 2,
            "author": "smjorg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for replying! \nI was wondering that because I was on campus delivery and I deferred my fees in June, and I thought I would stay there, but my plans changed, and I just switched to online delivery, and I thought the online delivery is different in terms of the feed deferral",
                    "score": 1,
                    "author": "Advanced_Bumblebee49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're deferring because you're going through OSAP, make sure to submit for the online program and every semester. I could be wrong, but from my understanding you get different amounts for online vs. On campus and on campus is paid yearly. Don't quote me on that, I've only been doing online.",
                            "score": 2,
                            "author": "smjorg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On campus, delivery is paid every semester too. \nIf I have my classes now, will I be able to add a clasx or change a class? On campus, I could do that on Acsis. I don't know if it's the same in the online delivery",
                                    "score": 1,
                                    "author": "Advanced_Bumblebee49",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My program hasn't allowed me the flexibility of choosing which courses I take when.  I have seen the option on ACSIS, though.",
                                            "score": 1,
                                            "author": "smjorg"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}