{
    "id": "wk3n0v",
    "score": 1,
    "title": "Parking Pass Question",
    "author": "RycoWilliams98",
    "date": 1660052506.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/wk3n0v",
    "media_urls": [],
    "other_urls": [],
    "postText": "How have first years who haven't recieved  there network account username logged in to parking services to buy a pass. Since I don't have a User ID yet can I even buy a parking pass. If so how can I bypass this.",
    "comments": [
        {
            "level": 0,
            "comment": "Your network account information is located in ACSIS under \"Network Account Info\". If you do not have anything in this section or you cannot log on to ACSIS, you need to contact ITS or Registrar's Office.",
            "score": 2,
            "author": "carbonatedair"
        },
        {
            "level": 0,
            "comment": "But the User ID section is blank.",
            "score": 1,
            "author": "RycoWilliams98",
            "replies": [
                {
                    "level": 1,
                    "comment": "As I said in my comment, if you do not have anything in that section or cannot log onto ACSIS you need to contact ITS or the registrar's office.",
                    "score": 1,
                    "author": "carbonatedair",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When did you get your user id in first year? I heard it could come out two weeks before classes start.",
                            "score": 1,
                            "author": "RycoWilliams98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm in my first year as well, starting this fall, I got mine in late July.",
                                    "score": 1,
                                    "author": "Chemical-Cap4826",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm thinking it's because I'm in a Graduate Certificate or something.",
                                            "score": 1,
                                            "author": "RycoWilliams98"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just did it, used the first part of my Algonquin email address, smit3244 and my password for ACIS and it worked just fine. It was just a guess and I was able to buy my pass.\n\n&amp;#x200B;\n\nHope this helps",
            "score": 1,
            "author": "Exciting-Throat-2002",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but I don't have my user id to create my email.",
                    "score": 1,
                    "author": "RycoWilliams98"
                }
            ]
        }
    ]
}