{
    "id": "wuvsrq",
    "score": 1,
    "title": "eTextbooks (vs hard copies)",
    "author": "Specific-Handle5983",
    "date": 1661180097.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/wuvsrq",
    "media_urls": [],
    "other_urls": [],
    "postText": "For those who use eTextbooks over hard copies, do you only get to keep the soft copy version for awhile? \n\nFor those who buy hard copy versions, do many also include a soft copy also?",
    "comments": [
        {
            "level": 0,
            "comment": "The etexbooks are usually a rental for a year or two. Most courses I've been in required the etextbook. The advantage is that they're cheaper, most allow you to download them and most have a text-to-speech function.",
            "score": 5,
            "author": "smjorg"
        },
        {
            "level": 0,
            "comment": "Id advise talk to profs and older students prior to buying either, some classes will never use them, some will guide you to free versions, some are used heavily, others claim to use them so they can increase sales.  Often depends the class and specific teacher.  \n\nMost hard copies don’t include a e book, but you can often find the electronic versions for free if you look hard enough or can get them from the library as a rental.",
            "score": 3,
            "author": "AMediumTree"
        },
        {
            "level": 0,
            "comment": "Only a suggestion.  My scenario was we are allowed open book to our exam for my licence.  We were not allowed electronic versions of the books.  So you may want to enquire.  As someone mentioned sometimes you need the ebook.",
            "score": 2,
            "author": "mytho1975"
        },
        {
            "level": 0,
            "comment": "etextbooks suck, i love reading ebooks most of my favorite books i have only read in ebook form but digital textbooks... fucking suck. Last semester i had two, one i had to download a specific program to read the damn thing and it didn't have any accessibility features to make the font bigger or change the font (dyslexic with poor vision), the other used a website that was fine for 80% of the semester but the last three weeks the site was unusable because of how many other students were trying to use it at once to study. \n\nI much prefer physical textbooks, i am able to use my blue overlay sheet (highly recommend for those with dyslexia), i can use a quecard to make sure that my eyes don't skim lines, i can make notes on the page and use sticky notes for my thoughts. plus they are big and heavy and make me feel like im doing the author a solid for buying a physical manifestation of their hard work.",
            "score": 2,
            "author": "thisonecassie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree and have decided on textbooks! Thanks for your input, helped!",
                    "score": 2,
                    "author": "Specific-Handle5983"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It will vary by course, I would wait until each prof provides textbook information.  Often the E-version of the textbook is required for evaluations.\n\nSome courses with eBooks the publisher will have an option to purchase an additional hard copy (either a \"real\" textbook or a looseleaf or less \"pretty\" version) for a fee of 20-30 dollars.  It's a good option if the eBook is only a one year \"rental\" and you like the book and want to keep it longer.",
            "score": 2,
            "author": "Tepal"
        }
    ]
}