{
    "id": "xeg4h8",
    "score": 1,
    "title": "Computer Engineering Technology (3 year) vs Computer Programming (2 year)",
    "author": "cheifofchads3",
    "date": 1663196523.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/xeg4h8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im wondering what the job prospects and salaries will be like for both courses. Will the 3 year course land a better position or salary or will it end up having a better career in the long run? And what about course difficulty between the 2.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm currently a student in the CET program, so I can speak on behalf of that.  I believe that job prospects are quite similar, but with CET setting you up for a wider range of positions. From what I've heard, CP is the easier program, although having never taken it, I can't comment beyond that. \n\nCET is a difficult program, it will require a lot of time and commitment but you will leave having learned a lot of useful information.  \n\n\nA little outdated but I think that this Graduate Employment Report may be a valuable resource to help you make your decision and will answer a lot of your questions. \n\nhttps://www.algonquincollege.com/employment/files/2019/07/2016-2017\\_GradEmploymentReport-sm.pdf?file=2019/07/2016-2017\\_GradEmploymentReport-sm.pdf",
            "score": 4,
            "author": "Dalcenn"
        },
        {
            "level": 0,
            "comment": "Job prospects are comparable, however what I have gotten the feel that CP tends to go into business systems and government whereas CET often ends up in private sector high tech like Nokia and whatnot.\n\nCET level 3 &amp; 4 are brutal compared to CP.  However, CP is nothing to sneeze at.",
            "score": 4,
            "author": "Darkwolfen"
        },
        {
            "level": 0,
            "comment": "Currently in the CP program and it is also a difficult program but can say without a doubt that it is easier than the CET program.",
            "score": 2,
            "author": "wolf-of-bank-street"
        }
    ]
}