{
    "id": "xxjh7l",
    "score": 2,
    "title": "Hi I'm trying to get accepted into full time business online",
    "author": "Apprehensive-Jury793",
    "date": 1665098648.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/xxjh7l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is there anyone in that course here I can ask questions about the program. \n\n1. How easy/hard is it\n2. What amount of time on weekly basis is approximately it takes to study\n3. How do tests work. Is it at a specific time?",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! I just started the full time business diploma online and it can be a lot if you don’t manage your time well. It is easy to get behind or miss assignments/tests if you aren’t prepared. I’d spend about 3-4 hours a day on average doing my school work. I don’t do any  school work evenings or weekends. I try to treat it like my “full time job” but It’s not like I’m sitting in my computer everyday from 9-4. The teachers suggest spending 3 hours a week on average per course. I also work 1-2 days a week. All of the assignments and tests are due on a specific date by a certain time. The tests are not proctored.",
            "score": 3,
            "author": "Competitive-Bar-5626"
        },
        {
            "level": 0,
            "comment": "I just finished business accounting (not sure if its the business your taking)\n\nJust like what the other reply said treat it like a full time job. I also worked 2 days a week. I found working about 5 hours a day for 5 days generally. Then bigger assignments would take up more time or certain classes need more module and homework/ studing time.",
            "score": 3,
            "author": "divinely_xa"
        },
        {
            "level": 0,
            "comment": "It will be easier the more technologically literate you are. Computer skills will significantly reduce time spent on the course overall.\n\nTests are typically assigned an amount of days or weeks to complete, and you do it on your schedule. Same for exam - typically 2 days long, and sometimes with timeslots.\n\nThe key to an online course like this is to understand what you HAVE to do, and to focus on it",
            "score": 3,
            "author": "Other_Dig_"
        }
    ]
}