{
    "id": "zpx8tv",
    "score": 4,
    "title": "Biotechnology advanced Algonquin college",
    "author": "Fuzzy-Ad2037",
    "date": 1671469759.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/zpx8tv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey I’m thinking of going into biotechnology  advanced at Algonquin college I don’t see a lot of info online about it. Can anyone who’s in the program give me some information on it what it’s like what’s coop like and some future jobs in biotech?. Overall how is the program",
    "comments": [
        {
            "level": 0,
            "comment": "As a first year who had just finished their first semester in the program, I can say that it is heavy, but manageable. For co-op, I am in the non co-op stream but what I can say is that during orientation day, I heard that students who are in the co-op stream start their search in second year.\n\n&amp;#x200B;\n\nI will now talk about the specific courses that I went through this semester\n\nBTC1300(Biosafety): This course is the easiest course that you will ever encounter in the program. All you do is complete certificates to get credit, as well as WHMIS and OHSA Training. This course is done online asynchronously.\n\n&amp;#x200B;\n\nBTC1305 - Understanding Biotechnology: This course is very interesting, you learn the theory aspect of biotechnology during the first half of the semester. You would learn about the different types of biotechnology that exist, and what each for their roles are. You also learn about DNA and genetic engineering. In the second half of the semesters, you will have guest speakers who will talk with you about their experiences in the program. Or talking about the job aspects of it, or even science. All of them were really interesting. I had Charles Nasmith as my professor for this course, one of the best professors you will see in the program. The midterm and final exams were very easy, as it was open-book and consisted of long answers.\n\n&amp;#x200B;\n\nBIO1300 - Cellular Biology: I had Charles Nasmith for this course as well. In this course you learn about everything, DNA, patterns of inheritance, layout of different cells, cellular respiration, and so on. You also had to do DSM's on Pearson for each chapter, the exams for this course were both closed-book and revolved around the lecture slides and DSM's. This course uses a virtual textbook.\n\n&amp;#x200B;\n\nCHE1302 - General Chemistry: This course is the hardest course that you will encounter during the semester, when I had the course I knew the concepts but the professor taught it in a way which I was not able to comprehend. We learned about matter, chemical reactions, chemical kinetics, thermochemistry, chemical equilibrium, compounds and nomenclature, and the list goes on. I had Mehdi Mostajeran for this course, a good guy but explains/teaches in a confusing way. This class has online assignments which are done by Pearson, you also buy a virtual textbook for this course.\n\n&amp;#x200B;\n\nNow I will go on to the lab portions of the program\n\nBIO1301 - Cellular Biology Lab: This course revolved heavily around the theory taught to you in BIO1300 and somewhat BTC1305. The professor that I had for this course was a complete bitch, I did not enjoy this course at all. Once I wrote an email asking for an extension because of my dad going through cancer at the time, who ended up dying two days later on the day of my 2 midterms. She had the audacity to  tell me \"No, any late submission will result in a 10% deduction, I ended up failing it even though the report I wrote was very brief and follows the rubric. There were other instances where I got in trouble for choosing to work with other people, she would tell me to work with someone who would never do the work with me. You learn things like how to use a microscope(your first practical),  gel electrophoresis(second practical), collecting DNA samples, making DNA samples, fingerprinting, etc. The professor I had for this course was Bodunde Oyetoran, the worst professor I had in my life by far.\n\n&amp;#x200B;\n\nSCI1000 - Essential Scientific Skills\n\nThis course was all about teaching us how to use technology in the lab, we uses spec-20's micropipettes, pH Probes, even burettes. This course had 3 practicals when I was in it, I had a professor by the name Rudy Jones. He is also one of the best ones in the program.\n\n&amp;#x200B;\n\nCHE1303 -  Chemistry Lab\n\nThis course taught us about titrations, making solutions, dilutions, etc. It also taught us the things we learned in CHE1302 from a more practical hand-on perspective. The professor that I had for this course was Jacqueline Glimet, a good professor. If you are ever confused with something, she will be willing to help you with the theory side of it which is really useful.\n\n&amp;#x200B;\n\nI will also share my timetable for both fall and winter term, but this is my general overview of the program so far. \\*Timetables to come eventually",
            "score": 1,
            "author": "FOTB_Toxizzo"
        }
    ]
}