{
    "id": "zyfcob",
    "score": 3,
    "title": "Anyone know when ACSIS should have all grades?",
    "author": "Bruins378863",
    "date": 1672345317.0,
    "url": "https://www.reddit.com/r/Algonquin_College/comments/zyfcob",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nMy grades have all been released in brightspace, however I only have 1/6 courses showing with a grade in ACSIS. Does anyone have any idea when ACSIS normally gets updated, as I imagine it should of been updated by now.\n\n&amp;#x200B;\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I already got all of mine maybe try contacting IT and see if there are any problems with your acsis.",
            "score": 1,
            "author": "Sure-Ad-3879"
        },
        {
            "level": 0,
            "comment": "I'm also missing 2 of 6 grades on ACSIS. I was going to wait until the new year to contact the college about it if they aren't up by the first week of Jan. They are probably behind with the updates as some profs sent in their grades late, and the college staff are probably off for the holidays. \n\nYou can always send an inquiry through the Algonquin contact page. They usually reply within a day.",
            "score": 1,
            "author": "Grumpycat26"
        },
        {
            "level": 0,
            "comment": "ACSIS mentions that the college is closed from December 23rd to January 1st; I don't know if that has anything to do with it? I still only have 1 out of 5 grades in ACSIS, but I have all assignment grades available on Brightspace now (though it took a while...).",
            "score": 1,
            "author": "kwakio"
        },
        {
            "level": 0,
            "comment": "I haven’t received all of mine in acsis either lol, I check everyday 😩",
            "score": 1,
            "author": "Competitive-Bar-5626"
        },
        {
            "level": 0,
            "comment": "College is closed until Jan 2nd.",
            "score": 1,
            "author": "auriem"
        },
        {
            "level": 0,
            "comment": "They say to wait 3 weeks until after the term has ended for all your grades to be posted.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}