{
    "id": "2lowgs",
    "score": 5,
    "title": "Laptops in Class",
    "author": "LostPicasso",
    "date": 1415470527.0,
    "url": "https://www.reddit.com/r/AcadiaU/comments/2lowgs",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do many Acadia students use a laptop versus pen and paper for taking notes in class? ",
    "comments": [
        {
            "level": 0,
            "comment": "Most of my classes are computer based, so most students use computers to take notes. There is some research to suggest that handwritten notes may help people remember better. I would suggest that it depends on the student and the class. \n\nNote: if you take notes by hand, then your aren't tempted to goof off in Facebook. ",
            "score": 5,
            "author": "dbenoit"
        },
        {
            "level": 0,
            "comment": "I'd say it's fairly mixed. Some classes will require you to use laptops (thinking particularly of business classes that use Excel) and some profs prefer you not to use them because you can get distracted and not pay attention. \n\nHeavily depends on the class. I use my laptop for most classes but I use a notebook in Econ because there's lots of formulas and graphs. Some people use notebooks for everything. ",
            "score": 3,
            "author": "mumblegum"
        },
        {
            "level": 0,
            "comment": "Yes, I would say the majority of my classes, everyone has a laptop out. Occasionally you get a prof that is anti-tech, but generally laptops are the norm.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "In most of my classes the majority of people take pen and paper notes. Sometimes professors will ask us to bring in our computers if we are doing something that requires it that day. This was my experience with geology and environmental science classes.",
            "score": 2,
            "author": "Lyesoap"
        }
    ]
}