{
    "id": "an9x44",
    "score": 7,
    "title": "WHAT IS THE DEAL WITH THE BRAWL ON SATURDAY? Does anyone know what happened? I wasn’t there but I’ve seen the video below...",
    "author": "winderre",
    "date": 1549336838.0,
    "url": "https://www.reddit.com/r/AcadiaU/comments/an9x44",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Earlier in the game #23 (Rodney Southam) was shaming a sexual assault survivor to a STFX player (see CBC or global article) that player told his coach and his coach told the on ice official and the Coach of Acadia. Nothing was done. A little bit later the STFX player was lining up for a face off and the Coach of Acadia sent out Rodney Southam to line up against him. The STFX player wasn’t happy with this and decided to take things into his own hands (first fight) and his team choose to stand up for him versus letting a player get away with absolutely disgusting comments that have no place in today’s world. This all probably would of been avoided if the on ice officials or the coaches of Acadia took #23 out of the game after the original incident. It’s obvious the coaches of Acadia care more about a hockey game than supporting victims/survivors of sexual assault.\n\nGo to the AUS video archives and rewatch leading up to the brawl and you’ll see all the events I mentioned happened.",
            "score": 9,
            "author": "Mikejohnson05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone’s from X. ",
                    "score": -1,
                    "author": "nathpenn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "POS",
                            "score": 2,
                            "author": "MableRed"
                        },
                        {
                            "level": 2,
                            "comment": "Actually never attended X or Acadia, went to SMU, but have friends who went to both. Lots of people new even before this game that those disgusting comments were made from a certain Acadia player before. One of their assistants even let it slip that they warned Rodney to never bring it up again. The AUS hockey community is fairly small so it’s easy to find out the facts. For those defending Rodney you should really look in the mirror, what would you do if someone made comments to you about someone close to you? He is scum, he deserves worst than he got, and I’m sure more facts about how big of a POS he is will come out soon. ",
                            "score": 2,
                            "author": "Mikejohnson05"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmm it is odd that the box score from November 3rd 2017 seems similar to this last brawl, also odd that Rodney Southam was the only player to get an extra unsportsmanlike on top of the fighting and other penalties, yet people still believe that he doesn’t need have a history of these disgusting comments.\n\n13:46 StFX - Anthony Difruscia: FIGHTING MAJOR 5 minutes 13:46 Acadia - **Rodney Southam**: FIGHTING MAJOR 5 minutes 13:46 StFX - Anthony Difruscia: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 Acadia - **Rodney Southam**: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 StFX - Aaron Hoyles: 10-MINUTE MISCONDUCT 10MINMISC 10 minutes 13:46 Acadia - Liam Maaskant: 10-MINUTE MISCONDUCT 10MINMISC 10 minutes 13:46 StFX - Cody Hendsbee: INSTIGATING MINOR 2 minutes 13:46 Acadia - Liam Maaskant: SLASHING MINOR 2 minutes 13:46 StFX - Cody Hendsbee: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 StFX - Cody Hendsbee: FIGHTING MAJOR 5 minutes 13:46 Acadia - Marc McNulty: FIGHTING MAJOR 5 minutes 13:46 StFX - Cody Hendsbee: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 Acadia - Rodney Southam: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 StFX - Regan Spears: GROSS MISCONDUCT GROSSMISC 10 minutes 13:46 Acadia - Liam Maaskant: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 Acadia - Marc McNulty: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 Acadia - Sam Fioretti: 10-MINUTE MISCONDUCT 10MINMISC 10 minutes 13:46 Acadia - Sam Fioretti: GAME MISCONDUCT GAMEMISC 10 minutes 13:46 Acadia - **Rodney Southam**: UNSPORTSMANLIKE CONDUCT MINOR 2 minutes",
            "score": 1,
            "author": "Mikejohnson05"
        }
    ]
}