{
    "id": "gyyg23",
    "score": 5,
    "title": "Chase court",
    "author": "frogggr",
    "date": 1591619491.0,
    "url": "https://www.reddit.com/r/AcadiaU/comments/gyyg23",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got into chase court can anyone tell me what it’s like?",
    "comments": [
        {
            "level": 0,
            "comment": "One of the nicer residence’s in terms of room quality for sure. Easy to get lost in at first but you’ll figure it out.",
            "score": 5,
            "author": "BeeMac0617"
        },
        {
            "level": 0,
            "comment": "Agree with everyone else here. It's a large residence with some isolated sections. So atmosphere can vary. I spent two years there as an RA and I really enjoyed my time.\nAlso, close to meal hall ;)",
            "score": 4,
            "author": "Weltenkind"
        },
        {
            "level": 0,
            "comment": "It is basically the \"retirement home\" where people move to in their second year. People usually try to co-ordinate with their friend group so they can all move in together in the same pod. This means that it can be really hard to make new friends because everyone already has their social group and routines set in stone, so to speak.\n\n\nBecause it is grouped in pods instead of the typical long res hallways it can be a different dynamic than the other residences. You can get really close to the people in your pod but are mostly isolated from everyone else. So if your group of 8 sucks you're pretty much screwed.",
            "score": 2,
            "author": "Subject_You_6847"
        },
        {
            "level": 0,
            "comment": "I've heard good things! Everyone I've met from Chase has been nice!",
            "score": 1,
            "author": "IronManHole"
        },
        {
            "level": 0,
            "comment": "Lived there for two years, it was great! Fun to walk through the sections and see everybody. It is generally a quieter residence. It was a quieter res my first year, and then people from the more active residences moved in and realized they all lived together, so it was a pretty active residence that year",
            "score": 1,
            "author": "crazysocksniper",
            "replies": [
                {
                    "level": 1,
                    "comment": "What is in each pod? I know there is a common area in each pod but the quality of the layout sucks lol I was wondering if anyone could help me understand the layout better",
                    "score": 1,
                    "author": "frogggr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most sections are shaped like a U and have ~12 rooms around the outside, and ~4 bathrooms around this inside. Each section has a fridge, microwave, and some couches. The 3rd and 4th floor has laundry in the middle of each section near the fridge.",
                            "score": 3,
                            "author": "crazysocksniper"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s conveniently close to meal hall which is a huge plus. Community can vary, there’s usually a smaller number of first years and a larger proportion of 2nd years or upper years. Either way you should have fun!",
            "score": 1,
            "author": "sekerk"
        }
    ]
}