{
    "id": "11a2lpb",
    "score": 175,
    "title": "Reply 1997 is a treasure I missed",
    "author": "humandisaster13",
    "date": 1677171513.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11a2lpb",
    "media_urls": [],
    "other_urls": [],
    "postText": "In my attempt to join the Shin-Lee fandom I started with **Hospital Playlist**(which has become very dear to me) and finished **Prison Playbook**. Loved them both so much so finally decided to watch **Reply** series. Although I see **Reply 1988** discourse all the time I can't say the same for the previous series of Reply. So I was hesitant but I finally did it. And boy it was so worth it! I ended up loving it so much that I'm in disbelief that the **Reply 1997** series hasn't been as popular among international kdrama fans as other dramas of its time when it has aged so beautifully unlike most of those dramas. I still regret watching this masterpiece so late! I wasn't sure of liking this at first since it relies heavily on nostalgia with the 1997 setting but with the right fansubbed translation the series could be enjoyed by everyone! \n\nThe series switches between the past at 1997 and the present at 2012. It's main protagonist is Sung Shi-won who is a crazy kpop fangirl and her gang which includes her childhood best friend Yoon Yoon-jae, another kpop fangirl Yoo-jung, nice guy Joon-hee, talkative Sung-jae and the late addition Hak-chan. It has four love tracks and three love triangles. It also has the very famous \"Who got married to whom\" storyline which piques the interest of audience. The show's writing is excellent because even after 12 eps it manages to keep you on hook about who the FL ends up with.\n\nMy most favourite thing about Hospital Playlist and Prison Playbook was the hearty laughs they gave me. Reply 1997 didn't disappoint me at all because even at its corny and slapstick moments it made me laugh so much. The goat sounds only made it better. Special shoutout to Sung Dong-il because I didn't have much of an impression of him in his HP cameo and even in Legend of the Blue Sea man was creepy. But him as a father was so endearing to watch esp when he saw all those kids as his own. Him along with Lee Il-hwa was one of the most amazing couples on kdramaworld.\n\nComing to the characters, I liked Jung Eun-ji as the FL very much. Having a loud personality it's easy to sound annoying but she played it very well. Couldn't believe that this was her debut. She was what Geum Jandi should've been. Innocent, charming and full of heart. \n\nThe first big surprise in Reply 1997 was Seo In-guk. This is my first drama of his and I was so taken aback by his acting chops. Be it as the brooding boy who is in love with his childhood best friend or the younger brother who had to sacrifice for his brother's sake, he was so amazing to watch. My heart sank every time he got his heart broken and swooned whenever he looked at the FL with lovetorn eyes. Shi-won is a better person than me because I'd have folded for his charms. Him finally kissing her as she counts still makes me giggle as I'm typing this.\n\nThe second big surprise was one of the main characters being &gt;!gay.!&lt; As someone who is annoyed by the constant homophobia in kdramas in the name of being funny I was so impressed by how a 2012 drama handled it much better than today's dramas.  When it was revealed that &gt;!Angel was not Shi-won or Yoo-jung but Yoon-jae's friend Joon-hee who is in love with him!&lt; I was shooketh. Kudos to the writer for actually giving the storyline a conclusion by &gt;!Yoon-jae getting to know the truth and still being good friends with Joon-hee who has now moved on!&lt;. \n\nThe storyline of the second couple Hakchan and Yoon-jung was hilariously cute. Hak-chan was already making me laugh so hard because he was the coolest guy until he was around girls but I adored how he comforted a heartbroken Yoon-jung reeling from rejection. The conclusion of their story was also fulfilling with Hak-chan surprising everyone by being there at her worst situation even though it's been years. Loved how he progressed as a better boyfriend by learning from his mistakes. He may have an addiction to adult movies but the only girl he loved was Yoon-jung. Confession: I didn't get the meta joke that the actor playing him was a Sechs Kies member himself until I finished the series but those who knew would've enjoyed it a lot. \n\nThe episodes in the beginning were just 30 mins long and as the series progressed it got longer and I could see it started being overindulgent. But I should know that by now since HosPlay and Prison Playbook also have this issue. It was a minor flaw though.\n\nAnd now to the major flaw. A series as beautiful as this SHOULDN'T have had that storyline of Shi-won's teacher asking her out. Yes, Tae-woong is Yoon-jae's brother so he knows Shi-won even before he was a teacher. I was so shocked when he told Yoon-jae that he was planning to ask her out as Inever saw it coming. Him saying that he has always looked at Shi-won as a woman didn't help his case either. It's a huge yikes and it was still yikes even if he had resigned before asking her out! I liked him as the brother figure but after that I really couldn't like him at all. It kept getting weirder when it was revealed that he was in love with Shi-won's dead sister. It looked almost incestuous and made me very uncomfortable. Even for 2012 standards this storyline was bad. So I hated it when they kept the game of \"Guess the husband\" going. Although Seo In-guk is the ML I was not sure since Reply 1988's ending got everyone upset. But thankfully the writer didn't let me down. Not a huge fan of childhood friends turned lovers trope but Shi-won and Yoon-jae have a very explosive chemistry and it only got better when they started dating. Such beautiful kisses that made me think why so many dramas of that period had fish kisses. \n\nLike I said before I'm still regretting why I watched this gem so late but it's never too late I guess. Wondering why this series hasn't had the same appreciation as 1988 and why Seo In-guk is still not as popular as the likes of fellow '87 liners like Ji Chang-wook or Lee Seung-gi. I will keep revisiting Reply 1997 scenes and snippets often and after some time I'll start Reply 1994 because Shin-Lee combo is truly one of the greatest kdrama combos!",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly out of the three Reply series, 1997 was the most successful when it comes to evoking nostalgia for me. I can't quite explain it but in 1997 they really put all their effort into making an atmosphere/vibe for the era while the latter installments were much more chatacter and story focused. If the goal of the Reply series were evoking nostalgia then dare I say 1997 was the most successful.",
            "score": 47,
            "author": "YesterdayClassic6919",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the fact that it's a bit unpolished actually makes it better and invoking that nostalgia. The lower budget and lack of experience of the actors (although they all did a great job, I'm not knocking them) contributes to the vibe. Everything feels very natural. \n\nThe main thing I didn't like is that Eun Jiwon looked to old for his role.",
                    "score": 7,
                    "author": "Lady_Lance"
                },
                {
                    "level": 1,
                    "comment": "I wasn't there at the moment but I totally get your point tho! The \"amateur\" production adds flavour to the coming-of-age genre.",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reply 1988 sees the most discussion because it's typically looked at as the strongest, the longest, the most recent, and the most impactful of the three. But all three Reply dramas, even the sometimes controversial 1994, are undeniably great stories worth watching.",
            "score": 26,
            "author": "Kerosu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oooh 1994 one was controversial? May I know why?",
                    "score": 1,
                    "author": "humandisaster13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It wasn't controversial for any serious or real reasons. It's just that general perception of it is more split compared to the other two, and many people found 1994's version of the \"Who's the Husband?\" mystery to be frustrating. There was also a lot of SML syndrome.",
                            "score": 1,
                            "author": "Kerosu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1997 is my favorite reply",
            "score": 18,
            "author": "ttam23"
        },
        {
            "level": 0,
            "comment": "I still rate the kissing scenes in Reply 1997 as the one of most sensual yet mature yet youthful yet cute 😍 it's just a good balance of nostalgia when you're in love! I remember having a crush on Seo In Guk after seeing how he kissed and held Jung Eunji in the drama 🙈🙈🙈",
            "score": 15,
            "author": "mikel_learns2rock",
            "replies": [
                {
                    "level": 1,
                    "comment": "From time to time, I still watch clips of that stair scene, that scene when In-guk \"broke in\" Eun-ji's place, and that scene when Eun-ji visited In-guk's place 🤭🤭🤭",
                    "score": 4,
                    "author": "Aua_G",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That boy understands the assignment and goes for extra credit. One of the best kissers in Kdrama.",
                            "score": 3,
                            "author": "NotLucasDavenport"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not a lot of 2012 dramas had great kisses. At least the popular ones! And I'm with you on the Seo In Guk crushing camp!",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Might be an oddball here but I loved Reply 1997 so much and I still haven’t finished Reply 1988 even tho I know it’s super good - idk why I keep having a hard time watching it through lol hopefully I can get around to finishing it one day",
            "score": 13,
            "author": "theofficialguac",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m the same. Can’t seem to get past 2 episodes of 1988, but i binged 1997 in two days",
                    "score": 5,
                    "author": "drx604",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was the same. I couldn't get past first 2 episodes mainly because of BoRa's screaming. I re-tried several times over few months, partly because it was so loved by everyone and I was curious why. And when it finally got me, I basically finished it as fast as I could. Maybe I just had to be in the right mood to get it. At the end, this becomes one of my beloved k-dramas.",
                            "score": 2,
                            "author": "cuplik"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are we the same person? 😁",
                    "score": 2,
                    "author": "Aua_G"
                },
                {
                    "level": 1,
                    "comment": "Wow you sound like me.",
                    "score": 2,
                    "author": "Important-Reference1"
                },
                {
                    "level": 1,
                    "comment": "1988 feels so long and dragging to me while 1997 is just the right length. And loved the whole setting, the music, the themes",
                    "score": 1,
                    "author": "Devoidoxatom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched Reply 1997 as it aired, and let me tell you it was super hyped. EVERYONE and their mother were hooked on it (that was back in the old dramabeans days) and wondering who’s ending up with who. It was super fun and resonated with a whole bunch of people and we all loved it a lot. They took cliffhangers to the next level with their mystery. Waiting for the next episode was torture. Good old days. I still remember that ost the two leads sang! It was so good. Unfortunately I’ve never seen the FL in another drama. She was sooo fun to watch. \n\nI never thought any other Reply series could top it so I even put off 1988 for a long time but bruh. 1988 was even crazy amazing. I didn’t know how they did it.  But regardless—— 1997 was definitely not slept on. Maybe 1988 is overshadowing it though, for good reason.\n\nEdit: something that’s stopping me from going back to rewatch it is definitely that brother/teacher character. Hated that hahaha.",
            "score": 12,
            "author": "ggghhhb",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should watch Work Later, Drink Now. It's like she's playing Shi-Won again.",
                    "score": 7,
                    "author": "invitrium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes will try! Love her crackhead energy.",
                            "score": 1,
                            "author": "ggghhhb"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! I remember when it was airing too and how popular it was. Plus the old dramabeans days. All the guessing. So nostalgic. It was so well loved. \n\nI think Reply 1988 was so good that it overshadowed Reply 1997. I absolutely love 1988 but Reply 1997 will always have a special place in my heart. Seo In Guk captured my heart in that show.",
                    "score": 3,
                    "author": "CandidHassey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Old dramabeans days~~~!! Nostalgic. The years after the website changed were dark years in my life. Nowhere to talk about drama at all. So glad to have this subreddit (which I discovered far too late!!)",
                            "score": 3,
                            "author": "ggghhhb"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Omg that's so nice to hear! Envying those who watched it while it was airing lol",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reply 1997 is one of my favorite K-dramas of all time, and it was one of the first I got into as I started watching them the year it came out. Can't believe it's been so long. Thank you for your wonderful write-up, I hope more folks discover and appreciate this series too!",
            "score": 11,
            "author": "ikuto-sama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! And yes! I wish 1997 receives the same love 1988 and other Shin-Lee dramas receive!",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loved that drama. Im in love with jung eunji",
            "score": 10,
            "author": "chnaww",
            "replies": [
                {
                    "level": 1,
                    "comment": "Still in disbelief that it was her first drama",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well the writer director team started out with ‘97 and it was a hit and truly a gem. ‘94 had less of a guess who is the husband theme because it was quite evident from the start as to who it would be and lastly they came out with ‘88 which had a solid blend of both guess who is the partner and filial bonding as well. Right from the 1st episode wherein middle child struggles are shown it just strikes a cord with the audience.\n\nThe write director nailed it as the reply series progressed. And would love to see more of it.\n\nAnother good thing is how the FLs parents have been portrayed by the same actors and they have done cameos in other works as well.\n\nThey have a universe (uju) thing going on and no one is complaining.\n\nWould love to see more works by the writer director.",
            "score": 8,
            "author": "Limp-Ad9853",
            "replies": [
                {
                    "level": 1,
                    "comment": "That exact Shin-Leeverse or uju is why I recommend to everyone who will listen to watch their Reply and their Wise Life series in order of release year.\n\nDong-Il and Il-Hwa were so good as the FL parents. I was really hoping that the rumours that Il-Hwa would cameo on HP season 2 as Gyeo-Wol's mom would come true.",
                    "score": 7,
                    "author": "invitrium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They confirmed that it was her voice only but would have been too good to see her on screen as well sharing screen with Jeong won’s hyung dong il",
                            "score": 1,
                            "author": "Limp-Ad9853",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If only there is a HP S3 or even a 1 hour special in our future. It seems impossible with the cast and the effort required to practice and record their songs.",
                                    "score": 1,
                                    "author": "invitrium"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes I love the running theme of having the same actors portray the FL's parents in all the series",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah I love Reply 1997.... seriously but great write up.",
            "score": 19,
            "author": "Tomato13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you :)",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really love Reply 1997 and 1994. It really have a special place in my favorite dramas. I really miss the nostalgia effect of that series, about time they make a new one.",
            "score": 5,
            "author": "whitefang0824"
        },
        {
            "level": 0,
            "comment": "R1997 remains my favourite K-drama and one of my favourite TV shows in general. The love and care and attention to detail that was put into it is palpable. Plus it started my hopeless crush on Eunji.",
            "score": 5,
            "author": "wankthisway"
        },
        {
            "level": 0,
            "comment": "As a FL character, I rate Shi-won better than 1988's Deuk-sun. 88 has other things going for it which makes it the best entry in the series.\n\nThe reason why I didn't like it as much as it's focus on 90's k-pop which I have zero knowledge about. So any references or jokes got lost on me. A Korean might prefer it to 1994 which can feel long and self indulgent.\n\nAnother reason is that the older brother is bland and creepy and can't didn't any support from me in the love triangle. The Shin-Lee team improved the quality of the love triangle as the Reply series progressed.\n\nI watched the Reply series in this order 1997 -&gt; 1988 -&gt; 1994 and liked them in the following order 1988, 1994 and 1997.\n\nIf you liked In Guk you should check him out in Shopping King Louie and The Smile Has Left Your Eyes",
            "score": 6,
            "author": "invitrium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Will definitely check out at least one of your recommendations.",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome post!",
            "score": 4,
            "author": "lmorgan601"
        },
        {
            "level": 0,
            "comment": "I’m glad I saw 1988 first though. It’s like they learnt all the lessons from previous replies and made it.\n\nIt’s my all time favourite kdrama.",
            "score": 11,
            "author": "giratina143"
        },
        {
            "level": 0,
            "comment": "I see Reply 1997 as like a rough draft for Reply 1988. There's a lot of similar characters and plotlines, but they're much more polished in 88. The writing felt rougher in 97, the dialogue wasn't as good and plot was often inconsistent. \n\nTo give some examples, halfway through the show, Tae-woong goes from an ordinary teacher to a millionaire, with barely any explanation. In one episode he says he is the only employee, but in the next episode he has a team of staff (including a co-founder). Shi-won has a part-time job, but in only one episode, it's never mentioned in the rest of the show. The worst example by far is how Shi-won's sister is only mentioned once and in Tae-woong's flashback, not one from her family.\n\nI completely agree about the teacher, for me, he was the worst part of the show. Not only was it creepy for a teacher to try to date his student, but he also was incredibly bland with nothing interesting about his character. I probably wouldn't recommend the show just based on him, he dragged down an otherwise decent show so much.\n\nAlso, I struggled to accept actors in the 30s portraying teenagers, I mean they looked the same in the flashforwards and flashbacks.",
            "score": 13,
            "author": "TeoKajLibroj",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Tae-woong goes from an ordinary teacher to a millionaire, with barely any explanation.\n\nThe scene about the 'acorn' being used as currency on his site was all the explanation needed to understand how he became a millionaire because Koreans would know it's a reference to the site Cyworld.",
                    "score": 12,
                    "author": "myweithisway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think some of the references in Reply are abit hard to follow unless you are very familiar with Korean History. When he showed the acorn that was enough to explain how he got rich as cyworld was so big back then.",
                            "score": 8,
                            "author": "Familiar-Ant2535"
                        },
                        {
                            "level": 2,
                            "comment": "My problem was that it didn't make sense for a millionaire to be working as a school teacher.",
                            "score": 2,
                            "author": "TeoKajLibroj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He didn't become a millionaire (from his site) until after he quit working at the high school.\n\nUnless you are talking about how he eventually donated much of his wealth and started teaching at university before becoming a politician?",
                                    "score": 2,
                                    "author": "myweithisway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But he had already set up the site before he quit working at the high school. Unless I'm mistaken, it mentions that he's a millionaire in the very next episode after he leaves the school (although I admit the timeline is unclear).",
                                            "score": 2,
                                            "author": "TeoKajLibroj",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't quite remember the details of passage of time either.\n\nAnyways, the only reason he ever taught at the high school to begin with was so that he can watch out for his little brother so even if he'd already made it big with his site, I don't think it's that out there for him to have been teaching at the school.",
                                                    "score": 1,
                                                    "author": "myweithisway"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes it was a bit weird to see the boyish Seo In Guk portray a serious judge lol",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for that post, i've been wondering for a while of i should try 1997",
            "score": 3,
            "author": "abra_van_kadabra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please do check it out!",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kang Joonhee is my emotional support k drama character. His role is just perfect. I wish they'd had the guts to show his boyfriend in his last scene, although I think I heard before it was actually the director in that car lol.",
            "score": 3,
            "author": "Lady_Lance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Join-hee is a cutie pie, a sweetheart and a smart cookie so I bet his date with the cool orange car was a hottie but with all the good stuff (brains, big heart, etc.) that Joon-hee deserves.",
                    "score": 5,
                    "author": "ThePietje"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the 3 Reply series was worth watching",
            "score": 3,
            "author": "TurbulentGlove1313"
        },
        {
            "level": 0,
            "comment": "I enjoyed Reply 1997 but did not enjoy the 'who's the husband' game. I was firmly Team Yoon Jae from the beginning to the end and never wavered.\n\nGood luck and enjoy watching 1994. This is the only one in Reply Series that made me wavered on the love triangle story. I kept flip-flopping the whole series LOL. Personally I enjoyed 1994 more than 1997 (seem most people liked the opposite).\n\nThe best thing from Shin-Lee combo is a lot of their rookie/young actors becomes (more) successful and famous after their dramas. Of course talent is important, but having a good storyline helps too! \n\nThey just did their mini youtube reunion of some sort and the PD said their budget for 1997 was very very low and he had rough time during filming since he did everything himself (shooting all day and editing the whole night). He said showering and sleeping was a luxury. LOL. [Video](https://www.youtube.com/watch?v=fgI2vBvWQHI)",
            "score": 6,
            "author": "cuplik",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg can't wait to finish the whole Reply series to catch up on all the Shin-Lee content online haha!",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just put the Reply series on my MDL just yesterday at the recommendation of someone here on kdramarecommends.  Your endorsement and review comes at the perfect time!",
            "score": 2,
            "author": "ThePietje",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha! Nice to see you here. Hope you post your thoughts once you watch the series.",
                    "score": 1,
                    "author": "invitrium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice to see YOU here! See, I took you seriously and I’m starting it tomorrow!",
                            "score": 2,
                            "author": "ThePietje",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let us know how you like them! I’m in the minority, in that 1988 wasn’t my runaway favorite, but I’m always interested in how other people see them when they watch for the first time. If nothing else, it’s a great time capsule and each one has some truly fun romantic moments. They also have at least one moment where you can feel your heart break, just a little!",
                                    "score": 2,
                                    "author": "NotLucasDavenport",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good timing on your part as I just finished **Reply 1997** last night.  I am glad I watched it! Every episode kept my interest and I looked forward to each new episode. That’s a compliment because I really don’t care for high school or university kdrama. I also really don’t like kdramas with lots of fighting and hitting.  I know it’s a trope but it’s one I dislike.  This series had a lot of fighting and hitting especially by Shi-won. Despite that, I still enjoyed it.  Oh wait…&gt;! I found the older brother Tae-woong very creepy. He was too into young girls for his age. That he went for the little sister of his dead fiancé was yucky. That he was going for Shi-won even after he found out Joon-jae had loved her for 8 years bothered me and that he was setting Joon-jae up on a blind date (regardless of how he tried to pass it off as something else) made me dislike him!!&lt; \n\nHey, what the the reason for the scenes with Tae-woong’s disgusting bedroom with the dirty plates, used food containers, dirty clothes, etc.?  To show us his other side? His true self? Am I overthinking that scene?\n\nSome of the things I really appreciated:\n\nThe story is like an onion slowly peeling away layer after layer, revealing history, answers to questions, etc. It’s in the last minute of the show that &gt;! I finally got an answer to how Joon-jae broke his arm!!&lt; I loved this kind of reverse engineering story telling. \n\nI really enjoyed the relationship between Shi-won’s parents and Joon-Jae and Tae Woong. So natural. It was special. \n\nI also enjoyed all of the friends and their various stories and character development. Those kids were so much fun. So full of emotions and drama just like teenagers everywhere.  The “goat” sound effect never got old. \n\nThe best acting for me was from Joon-jae. I’ve never seen this actor before and he was excellent at each stage/age. &gt;! His declaration to Shi-won at the karaoke place broke my heart! The scenes between Joon-jae and Joon-hee from close high school friends to adult roommates were so well done and also broke my heart. Joon-hee’s sexuality was handled and portrayed so well. What a beautiful relationship between those friends. The acting was perfection. !&lt;  Given my dislike of fighting, yelling and hitting, I wasn’t a fan of Shi-won but because Joon-jae wanted her, I rooted for that. I don’t think I want to see that actress again though. Ha ha! \n\nThanks to everyone, especially user invitrium, for encouraging me to watch the Reply series.  I will watch the next two in due course!",
                                            "score": 3,
                                            "author": "ThePietje",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So glad you liked it! The thing that you didn’t like is the number one problem people have with 1997, and although it didn’t stop me from enjoying it, it was far from my favorite thing I’ve ever seen in a Kdrama. If you’re looking for something else with Seo In Guk (Joon Jae) I like his performance in Doom at Your Service a lot!",
                                                    "score": 2,
                                                    "author": "NotLucasDavenport",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’ve heard good things about **Doom at Your Service**. I don’t like a sad ending. Am I ok to watch Doom?",
                                                            "score": 1,
                                                            "author": "ThePietje",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m gonna do mildly spoilery things so I’ll cover it:\n\n&gt;!There are sad circumstances and moments but it’s not a sad ending. In fact, some people, me included, felt like they made the ending too happy for what they had set up. But I know that romances are supposed to have happy endings so I can’t really complain.!&lt;\n\nMy very favorite thing about Doom is their concept of God, and how God relates to the people on earth. It’s a really fresh perspective on the role of belief and the idea that humans can influence how God behaves so that they won’t be without divine guidance. Also, it’s a smaller detail but the costume and makeup department killed it in this. Watch how SIG’s makeup changes the more he connects to people, and how his hair changes colors depending on his circumstances. It’s subtle but great storytelling.",
                                                                    "score": 2,
                                                                    "author": "NotLucasDavenport",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This sounds very appealing to me based on your input here. I’ll give it a try!  But I think I will wait until I finish the rest of the **Reply** series. I understand there are references back to **1997** and **1994** respectively.  I like that!",
                                                                            "score": 1,
                                                                            "author": "ThePietje"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Watch him in Shopping King Louis. He is adorable in it. I became a fan forever after seeing it. I saw it before Reply 1997",
                                                                    "score": 1,
                                                                    "author": "Tubacim",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks!",
                                                                            "score": 2,
                                                                            "author": "ThePietje"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "So glad you liked it. Shi-won is an unique FL character for her blend of aggression and shyness. While I don't understand Korean, I have read that she nailed the required dialect for the role and didn't have any prior acting experience.",
                                                    "score": 2,
                                                    "author": "invitrium"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Except for the FL part I agree with you word for word! Wonderfully put! Seo In Guk's confession was so heartbreaking and Shi-won was better than me cause I'd have immediately said yes",
                                                    "score": 1,
                                                    "author": "humandisaster13",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sometimes an actor or actress does so well in portraying their role that you don’t want to see them again for a while. It’s kind of a backhanded compliment. We can agree to disagree about the FL. What we both agree on is more important really. It was a terrific series and I was introduced to some really great new actors.",
                                                            "score": 2,
                                                            "author": "ThePietje"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I haven’t seen any of them. But I have them in the watchlist. I just keep running into other stuff that comes out or browse. Lol",
            "score": 2,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "Thanks for this post. I love Reply 1988 but i was hesitant in watching the other reply series. This post made me want to watch them now. 💕",
            "score": 2,
            "author": "randomaudrey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy that I made someone try this cute series :)",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reply 1997 is among my fave K-dramas! The story, the soundtrack, and of course the cast...everything is amazing. I am waiting for Eun-ji and In-guk to team up again in another show! 🥰",
            "score": 2,
            "author": "Aua_G"
        },
        {
            "level": 0,
            "comment": "Reply 1997 was my favourite out of the series with 1988 being an EXTREMELY close 2nd. 1997 was the reason I actually watched the entire series. Wish they didn't take it off Netflix.",
            "score": 2,
            "author": "ibzcnote604"
        },
        {
            "level": 0,
            "comment": "I tried and tried to get into ‘97 but I keep dropping it. The leads are way too immature for my taste and the lead actress screams like a banshee. She’s more annoying than Go Ara in 1994. 1997 is just not for me.",
            "score": 4,
            "author": "Flipperflopper21",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me Eun-ji's Shi Won was fun to watch but right now watching 1994 and not feeling it with Go Ara's Na-jung. To each their own ig lol",
                    "score": 1,
                    "author": "humandisaster13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I finished 1994 because of Chilbong. Go Ara is a shitty actress I don’t like her either.",
                            "score": 1,
                            "author": "Flipperflopper21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a very unpopular opinion but 1994 &gt; 1988 &gt; 1997",
            "score": 2,
            "author": "hyoyeon_spears",
            "replies": [
                {
                    "level": 1,
                    "comment": "I started 1994 but struggling to complete it but I'm definitely going to give it another chance",
                    "score": 1,
                    "author": "humandisaster13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1994 lead girl is the best out of all Reply lead girls. She knows what she wants and she is actually wise.",
                            "score": 1,
                            "author": "hyoyeon_spears"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your post/comment has been removed for having spoilers without using spoiler tags or incorrectly formatted or positioned spoiler tags. We suggest that our users err on the side of caution and use spoiler tags abundantly. This applies for both currently airing and aired dramas since not everyone has watched everything. \n\n**Reply to this comment \"mod I have fixed my spoiler tags\" once you have added appropriate spoiler tags for review by a mod.** If you do not do this, your comment will not be reviewed and *remain removed*.\n\nUse &gt; ! spoiler ! &lt; without spaces (\\&gt;\\!spoiler\\!\\&lt;) for &gt;!spoiler!&lt;. See our [Spoiler Tag Tutorial](/r/KDRAMA/wiki/spoilertags) for a guide on how to use spoiler tags, common mistakes, and situations in which spoiler tags are appropriate. Additionally, our sister sub r/kdramarecommends [spoiler tag style guide](/r/kdramarecommends/wiki/spoilertag_style_guide_kdr/) covers how to use spoiler tags effectively.",
                    "score": 1,
                    "author": "KDRAMA-ModTeam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mod I have fixed my spoiler tags",
                            "score": 1,
                            "author": "8Panda4Luv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Try again. The second half is backwards.\n\nYour post/comment has been removed for having spoilers without using spoiler tags or incorrectly formatted or positioned spoiler tags. We suggest that our users err on the side of caution and use spoiler tags abundantly. This applies for both currently airing and aired dramas since not everyone has watched everything. \n\n**Reply to this comment \"mod I have fixed my spoiler tags\" once you have added appropriate spoiler tags for review by a mod.** If you do not do this, your comment will not be reviewed and *remain removed*.\n\nUse &gt; ! spoiler ! &lt; without spaces (\\&gt;\\!spoiler\\!\\&lt;) for &gt;!spoiler!&lt;. See our [Spoiler Tag Tutorial](/r/KDRAMA/wiki/spoilertags) for a guide on how to use spoiler tags, common mistakes, and situations in which spoiler tags are appropriate. Additionally, our sister sub r/kdramarecommends [spoiler tag style guide](/r/kdramarecommends/wiki/spoilertag_style_guide_kdr/) covers how to use spoiler tags effectively.",
                                    "score": 1,
                                    "author": "KDRAMA-ModTeam"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So Seo In Guk is the ML right ?",
            "score": 1,
            "author": "AdMore2091",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup!:)",
                    "score": 1,
                    "author": "Aua_G"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The gay character. Did you know he’s an idol?",
            "score": 1,
            "author": "mang0es",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not until I finished the series tho! Hope he didn't face any negative consequences since Korean society is very conservative",
                    "score": 1,
                    "author": "humandisaster13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hated the creepy big brother teacher going after the FL. What made them think this was remotely a good idea? It’s a huge no for me otherwise I loved the series.",
            "score": 1,
            "author": "Tubacim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree! The older brother was probably too old for the deceased older sister too. And he’s way to friendly with his super young female students toward the remaining episodes where he takes them to a concert. Just NO! Yuck.",
                    "score": 2,
                    "author": "ThePietje"
                },
                {
                    "level": 1,
                    "comment": "Thank you! It made me uncomfortable and that whole arc was so odd",
                    "score": 2,
                    "author": "humandisaster13"
                }
            ]
        }
    ]
}