{
    "id": "11cihsr",
    "score": 40,
    "title": "Premiere Week: \"Delivery Man\", \"All the Liquors\" &amp; \"Divorce Attorney Shin\"",
    "author": "masbond84",
    "date": 1677421633.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11cihsr",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/11cihsr/premiere_week_delivery_man_all_the_liquors/"
    ],
    "other_urls": [
        "https://mydramalist.com/725297-delivery-man)",
        "https://www.youtube.com/watch?v=DXYJEzJ8eeI)",
        "https://mydramalist.com/733387-liquor)",
        "https://www.youtube.com/watch?v=ed9hgMJddsM)",
        "https://mydramalist.com/720931-sacred-divorce)",
        "https://www.youtube.com/watch?v=AqC-Sz64zr8)"
    ],
    "postText": "[ENA' Delivery Man](https://mydramalist.com/725297-delivery-man)\n\nPremieres **March 01 (Wednesday)**\n\n* Cast: Yoon Chan-young (*All of Us Are Dead*), Bang Min-ah (*Beautiful Gong Shim*), Kim Min-seok (*Lovestruck in the City*)\n* Synopsis: Seo Young Min works as a taxi driver to support himself. Somehow, Seo Young-Min begins to take only ghosts as his passengers and he grants their wishes.  Kang Ji Hyun happens to get in Seo Young Min’s taxi. She has no memory of who she was when she was alive. She doesn’t know why, but she isn’t able to leave his taxi. She, then, titles herself the sales manager of Seo Youn -Min’s taxi.  Seo Young Min and Kang Ji Hyun together grant the wishes of ghosts, including chasing after a serial killer. They have a helper in Do Kyu Jin. Do Kyu Jin is a workaholic ER doctor with a handsome appearance. He senses signs of sinister events in the ER, where people are in life-or-death situations. \n* Director: Kang Sol (*Show Window: The Queen's House*)\n* Screenwriter: Han Bo-kyung (*Show Window: The Queen's House*)\n* Teaser/Trailer: [Trailer](https://www.youtube.com/watch?v=DXYJEzJ8eeI)\n* Streaming: Viki &amp; Viu\n\n[Heavenly' All the Liquors](https://mydramalist.com/733387-liquor)\n\nPremieres **March 02 (Thursday)**\n\n* Cast: Kim Joon-hyung (*Love is For Suckers*), Won Do-hyun, Jeong Ho-gyun\n* Synopsis: Han Ji-yu is an employee on the marketing team of a liquor company. Park Ki-hoon, on the other hand, is a devilishly charming, skilful chef of a famous restaurant. When Ji-yu is asked to contact Ki-hoon’s restaurant in search of a potential collaboration, he runs up against a few walls—namely, Ki-hoon’s flat out refusal to sell any alcoholic drinks in his restaurant. But Ji-yu is not ready to just give up. What will he do to break the stubborn chef?  Two men from different walks of life learn to open up to each other through the intoxicating power of love. \n* Director: Kim Jin-yeol (*Individual Circumstances*)\n* Screenwriter: N.A.\n* Teaser/Trailer: [Trailer](https://www.youtube.com/watch?v=ed9hgMJddsM)\n* Streaming: Viki\n\n[JTBC' Divorce Attorney Shin](https://mydramalist.com/720931-sacred-divorce)\n\nPremieres **March 04 (Saturday)**\n\n* Cast: Cho Seung-woo (*Stranger*), Han Hye-jin (*Jumong*), Kim Sung-kyun (*D.P.*), Jung Moo-sung (*The Good Detective 2*)\n* Synopsis: The story of a talented divorce lawyer punnily named Shin Sung Han (the word “shinsunghan” means “sacred” in Korean). As an expert divorce lawyer, the incredibly sensitive Shin Sung Han must deal with clients who are wild beyond belief, but he finds solace in his two closest friends and fellow “40-year-old youths” Jang Hyung Geun and Jo Jung Sik. \n* Director: Lee Jae-hoon (*Run On*)\n* Screenwriter: Yoo Young-ah (*Thirty-Nine*)\n* Teaser/Trailer: [Trailer](https://www.youtube.com/watch?v=AqC-Sz64zr8)\n* Streaming: Netflix\n\nP.S. All info are compiled based from MDL, Google searches and respective streaming pages. If there's any incorrect or missing info, do inform me. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "If Delivery Man has even a slight hint of romance, she'd better be another coma patient ghost that actually wakes up this time. I mean, the entire synopsis reads like a list of overused kdrama tropes anyway, so give me a happy ending, and I'm on board.",
            "score": 17,
            "author": "GiraffeWC",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hotel Del Luna was a show that I couldn't honestly say I disliked, but that ending ensures I'll never watch it again.  &gt;! Not one single relationship works out for anyone on screen. Everything ends in varying levels of tragedy. I feel like that show existed just to make me feel sad, and I can't go through that again.!&lt;",
                            "score": 9,
                            "author": "GiraffeWC"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The way that trailer for Divorce Attorney Shin has me so hyped. Don't think I've watched a legal drama yet, but the promise of potential bromance and antics has me excited.",
            "score": 5,
            "author": "Helpful-Standard9107"
        },
        {
            "level": 0,
            "comment": "&gt;Seo Young Min and Kang Ji Hyun together grant the wishes of ghosts, including chasing after a serial killer.\n\nSo serial killer is also a ghost, or rather super ghost, manifests as black smoke.",
            "score": 3,
            "author": "RayInRed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe its a pretty woman in a red dress, there's literally like 5 variations on this they can choose from.",
                    "score": 2,
                    "author": "GiraffeWC"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do I have a feeling I’ve already watched “Delivery Man” before…",
            "score": 3,
            "author": "SpiritNo4460",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s like a taxi version of May I Help You lol but it seems like it’s leaning more towards it’s Hotel Del Luna inner spirit",
                    "score": 2,
                    "author": "kdramajames"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Started off strong NGL. Ep2 dragged on with the cleaner lady's story but ok, they'll get right to it in Ep3 - looking forward to it!",
            "score": 1,
            "author": "noideaabout"
        }
    ]
}