{
    "id": "11ew5u8",
    "score": 62,
    "title": "Delivery Man [Episodes 1 &amp; 2]",
    "author": "GodJihyo7983",
    "date": 1677651193.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11ew5u8",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/11ew5u8/delivery_man_episodes_1_2/"
    ],
    "other_urls": [
        "https://mydramalist.com/725297-delivery-man)",
        "https://mydramalist.com/people/88131-han-bo-kyung)",
        "https://mydramalist.com/people/89405-kang-sol)",
        "https://viki.com),",
        "https://viu.com)",
        "https://mydramalist.com/people/7652-yoon-chan-young)",
        "https://mydramalist.com/people/5313-bang-min-ah)",
        "https://mydramalist.com/people/2215-kim-min-suk)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags)."
    ],
    "postText": "* **Drama**: [Delivery Man](https://mydramalist.com/725297-delivery-man)\n   * Revised Romanization: Dillibeolimaen\n   * Hangul: 딜리버리맨\n* **Director**: [Han Bo Kyung](https://mydramalist.com/people/88131-han-bo-kyung) (Show Window: The Queen's House)\n* **Writer**:  [Kang Sol](https://mydramalist.com/people/89405-kang-sol) (Show Window: The Queen's House)\n* **Network**: ENA\n* **Episodes**: 12\n   * **Duration**: 1 hour 10 min.\n* **Airing Schedule**: Wednesdays and Thursdays @ 9:00 PM KST\n   * **Airing Date**: Mar 1, 2023 - Apr. 6, 2023\n* **Streaming Sources**: [Viki](https://viki.com), [Viu](https://viu.com)\n* **Starring**:\n   * [Yoon Chan Young](https://mydramalist.com/people/7652-yoon-chan-young) as Seo Yeong Min\n   * [Bang Min Ah](https://mydramalist.com/people/5313-bang-min-ah) as Kang Ji Hyeon\n   * [Kim Min Suk](https://mydramalist.com/people/2215-kim-min-suk) as Do Kyu Jin\n* **Plot Synopsis:** Seo Young Min works as a taxi driver to support himself. Somehow, Seo Yeong Min begins to take only ghosts as his passengers and he grants their wishes. Kang Ji Hyeon happens to get in Seo Young Min’s taxi. She has no memory of who she was when she was alive. She doesn’t know why, but she isn’t able to leave his taxi. She, then, titles herself the sales manager of Seo Yeong Min’s taxi. Seo Yeong Min and Kang Ji Hyeon together grant the wishes of ghosts, including chasing after a serial killer. They have a helper in Do Kyu Jin. Do Kyu Jin is a workaholic ER doctor with a handsome appearance. He senses signs of sinister events in the ER, where people are in life-or-death situations.\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on [/r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct), (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag in Markdown by writing &gt; ! this ! &lt; without the spaces in between to get &gt;!this!&lt;. For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).",
    "comments": [
        {
            "level": 0,
            "comment": "Ok here we go.\n\nI've said it before, but if there's even a hint of romance she'd better be a coma patient that wakes up before the show ends.\n\nI am literally begging the writers not to surprise me into another depressing post kdrama \"what did I just watch??\" session.",
            "score": 35,
            "author": "GiraffeWC",
            "replies": [
                {
                    "level": 1,
                    "comment": "Facts",
                    "score": 4,
                    "author": "kdramajames"
                },
                {
                    "level": 1,
                    "comment": "I have bad news...",
                    "score": 3,
                    "author": "AlfredusRexSaxonum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait did she die?",
                            "score": 3,
                            "author": "mesa9672010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw a kdrama where a dude was literally &gt;!murdered and buried!&lt;. They brought him back in a coma &gt;!just to kill him off again!&lt;.  It wasn't actually too bad overall, but I was like \"Why give me hope? Do people watch these just to suffer?\"\n\nThe point was nothings over til they roll those final credits.",
                                    "score": 4,
                                    "author": "GiraffeWC",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tbh, half the reason i watch melodramas is to suffer. Its a form of therapy believe it or not 😅. But damn they didnt say melodrama in the description of this series so why did they kill her off (if they did)",
                                            "score": 2,
                                            "author": "mesa9672010"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They showed the sus guy at her grave at the very least",
                                    "score": 2,
                                    "author": "AlfredusRexSaxonum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We didn't see a body being buried so it doesn't count!\n\n(I've watched too many makjangs to the point I'm conditioned to believe unless we watch the body go into the ground, there's a chance a trick was played.)",
                                            "score": 8,
                                            "author": "myweithisway",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "that's fair, i wouldn't be surprised if at ep. 9 they show us she was in a coma all along",
                                                    "score": 3,
                                                    "author": "AlfredusRexSaxonum"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This just happened to me watching &gt;!bring it on ghost!&lt;. He, the guy who sees ghosts, starts dating her, but she’s a ghost. Flash forward a bit, she was a coma patient and now awake after 5 years.",
                    "score": 2,
                    "author": "Puzzled_Kiwi_8583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw that one a while back. Outside of a bit where she randomly decides blind dates are necessary in college, I liked the fact it didn't give me any unwelcome suprises.",
                            "score": 1,
                            "author": "GiraffeWC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not there yet, but can’t wait. I need her to appreciate our boy.",
                                    "score": 2,
                                    "author": "Puzzled_Kiwi_8583"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this was really fun, I really loved the premiere! if all the episodes are like this, this drama could be very enjoyable and end my Asian drama slump. also, I got a lot of From Now On Showtime vibes and I loved the reference to that show.\n\ni just think it's funny that every season we get a kdrama about ghosts, taxi drivers or lawyers; we got 2/3 here. can't wait for an upcoming kdrama where a ghost lawyer helps fight injustice from his taxi.\n\nEP. 1: And sorry, pretty ghost lady. Working class people like money so much because we need it to survive. Stop shaming the taxi driver man for trying to make a living 😭😭 &gt;! Not all of us have sketchy high ranking cop murder dads. !&lt;\n\nEP. 2: the widow, &gt;!after a long, whirlwind day of being scammed and also finding out she's pregnant!&lt;, watching a dude high five the air and then yell at it for having &gt;! his mom's hair tie !&lt;: 🤨🤨🤨🫥🫥🫥\n\nAlso every time ghost girl calls him greedy and obsessed with money, I get so annoyed. I get that you're dead, but being homeless while trying to take care of your aged grandma isn't fun either, ma'am.\n\nAnyways, ep. 2 was less fun imo - very run of the mill storyline - but it was still engaging ig. I like the banter and dynamics between the leads. Based on the opening sequence (which was kinda cute &amp; reminds me of Good Job, another kdrama I liked), I guess that ghost girl and taxi boy will start investigating the murders. I think that will be a way more enjoyable storyline but let's see what happens.\n\nAlso since the FL is 30 and ML is 22, does this count as a noona romance?",
            "score": 13,
            "author": "AlfredusRexSaxonum",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Stop shaming the taxi driver man for trying to make a living\n\nTHIS!! So far I’m okay with everything, it was an enjoyable watch but she really need to stop. I know her character will get better but it was really annoying to watch her when she’s babbling about her rights and bickering with the other ghost, keep raising her voice demanding his attention while he’ was driving that lead up to the small collision. Huge respect to Young Min for being able to keep his calm most of the time.",
                    "score": 10,
                    "author": "siparipari"
                },
                {
                    "level": 1,
                    "comment": "Oooh what was the Showtime reference? My husband and I love that one and we just finished the first episode of this one and we didn’t catch it.",
                    "score": 3,
                    "author": "dissonantclear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it was when the taxi driver's grandma fell asleep watching a kdrama? Not sure which scene exactly rn... but at one point when halmeoni was watching TV, if you look at the screen, Showtime was playing! idk how but I immediately recognized the cop orabeoni and his hoobae who was crushing on him.",
                            "score": 8,
                            "author": "AlfredusRexSaxonum"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "About 20 mins in. I’m digging it so far however I think the show is airing out of place due to the Halloween tragedy last year. It would have fit right in better during the October season.",
            "score": 10,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "It's been a while since I've seen Minah on screen and I'm excited for this. Her character as a ghost who can't remember her identity seems interesting, and I hope her scenes and character development turn out well!",
            "score": 8,
            "author": "atzee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm looking forward to watching her as well, lets hope for the best.",
                    "score": 2,
                    "author": "GiraffeWC"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OK, so that was fun...not quite fully invested yet, but it has potential.  Everyone is likeable, no villains yet, no potential romance or anything like that.  Good enough though to keep watching.",
            "score": 8,
            "author": "jsb1685",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thoughts exactly...   \nI'll watch a few more episodes...",
                    "score": 4,
                    "author": "Ayalynn123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love ghost romance dramas so I am super excited for this",
            "score": 4,
            "author": "vienibenmio"
        },
        {
            "level": 0,
            "comment": "Ghost Kdramas are one of my favorite genres! I really liked episode 1.",
            "score": 4,
            "author": "lmorgan601"
        },
        {
            "level": 0,
            "comment": "I personally think &gt;!the FL isn't actually dead, they faked her death bc some person kept trying to kill her in the hospital!&lt;",
            "score": 5,
            "author": "vienibenmio",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe the doctor from that hospital was her boyfriend/ love interest",
                    "score": 2,
                    "author": "Deep_Article6253"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Ep 2**\n\nThe scene of Yeong Min telling Ji Hyeon to get out of his room had me in stitches! Like girl, why do you think it's okay for you to be there *even if* you are a ghost!\n\nThe whole insurance fraud arc was nicely done in how well it wrapped up in an episode. Now I'm looking forward to the stories of other ghosts!\n\nThe breezy comedy of this drama is hitting just right for me and I'm enjoying myself a lot while watching it.",
            "score": 4,
            "author": "myweithisway"
        },
        {
            "level": 0,
            "comment": "Writer Kang Sol pinned one of my favorite makjangs ever (Show Window) so I'm here to support their next work no matter what. I like the director for the most part but they can be a little uneven with some types of scenes being absolute perfection while others are a bit eye-roll inducing.\n\nMy initial impressions are (1) I love the animated opening sequence, so fun and cute! (2) Min Ah is gorgeous, especially when she's smiling!\n\nYoon Chan Young has grown up nicely from his SFD days.\n\nAnyways, overall liked the set up and enjoyed the humor and emotional beats.\n\nI want more makjang from the writer but I'll take whatever they serve up!",
            "score": 3,
            "author": "myweithisway"
        },
        {
            "level": 0,
            "comment": "Watching this because I liked [the poster](https://mydramalist.com/photos/Z8EXDj_3) It looked like a mix of **Taxi Driver**, **Arang and the Magistrate**, and **Hotel del Luna**, but lighter because of the bright colours. I'm curious how it will turn out!",
            "score": 2,
            "author": "LcLou02"
        },
        {
            "level": 0,
            "comment": "Not sure if I like this yet, but I'll keep watching for a few weeks",
            "score": 2,
            "author": "NaotoOfYlisse"
        },
        {
            "level": 0,
            "comment": "Lots of fun scenes, like the vibes between the ghost and the taxi driver.",
            "score": 2,
            "author": "BrownBallSackMTL"
        },
        {
            "level": 0,
            "comment": "After my my first episode it seems like it’s a taxi version of May I Help You/Hotel Del Luna which so far is off to a good start, I just hope the writers package this better than compared to MIHY.",
            "score": 2,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "I’m not fully invested yet but I’m getting there.",
            "score": 2,
            "author": "FewGeologist6071"
        },
        {
            "level": 0,
            "comment": "Definitely will return for episode 3. It isn't too heavy a show which is nice. I agree with the similarities to Hotel Del Luna, just hoping for a better ending",
            "score": 2,
            "author": "TerryMog"
        },
        {
            "level": 0,
            "comment": "Maybe I missed something but did &gt;!the FL and the ML's mother die around the same time?!&lt;",
            "score": 2,
            "author": "Excellent_Jelly_85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or maybe FL died while investigating ML's mother death",
                    "score": 2,
                    "author": "Deep_Article6253"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m liking it so far as long as the ghost Ji Hyeon tone it down a lil bit. She seems like entitled brat, thinking Young Min has nothing better to do than catering to her needs to know who and why she’s attached to the taxi. Her business idea was a nice start to accommodate Young Min needs while getting what she wants unless she’s attracting more dishonest ghosts than good ones. \n\nI guess we got two helpful taxi drivers weekly now and I’m not complaining. 😋",
            "score": 2,
            "author": "siparipari"
        },
        {
            "level": 0,
            "comment": "This is so funny. Absolutely love it and it’s going to be a hard one to wait each week for. Such a relief as I’ve been struggling to find a lovely drama to watch this year.",
            "score": 1,
            "author": "imapigoinkoinkk"
        },
        {
            "level": 0,
            "comment": "Are the English subs not showing up in ep 2 for anyone else on Viki? Ep 1 shows just fine",
            "score": 1,
            "author": "vienibenmio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've already seen Ep 2 and the subs were fine for me. Maybe try logging out and clearing your cache, sometimes that solves subtitle issues (in my experience).",
                    "score": 3,
                    "author": "myweithisway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It worked on my computer but not my Roku. Super weird",
                            "score": 3,
                            "author": "vienibenmio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You should check now. The same thing happened to me for every new episode of dramas I tried to watch last Thursday on Viki through my Roku. The problem seems to be solved but I don't know why it happened.",
                                    "score": 2,
                                    "author": "MirrorMask88"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just started this one but the opening taxi chase scene was really good like all the taxi drivers working together to solve crime - love the adrenaline \n\nI’m in it for the noona romance + as a girls day ult I pretty much watch everything with the girls in it lol as long as Minah sticks to the mature lady ghost look and the aegyo she did a couple of times I’ll stick around I really like ML as well would love to adopt him lool",
            "score": 1,
            "author": "iwillforgetthissmh"
        }
    ]
}