{
    "id": "11nal1x",
    "score": 33,
    "title": "Kdramas Made Me Do It - March, 2023",
    "author": "AutoModerator",
    "date": 1678411810.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11nal1x",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/11nal1x/kdramas_made_me_do_it_march_2023/"
    ],
    "other_urls": [
        "https://i.redd.it/8a1cwrz9ceg31.gif)",
        "https://giphy.com/gifs/mother-of-mine-kGiztx4M3fkVlfkQdz)",
        "https://i.redd.it/k7k3fwfs40e41.gif)",
        "https://i.redd.it/sdx50o1gpgg31.gif)"
    ],
    "postText": "Has watching Kdramas ever inspired you to [try something new](https://i.redd.it/8a1cwrz9ceg31.gif) or change how you do something? Have you been mesmerized by all the Korean food onscreen? Have you succumbed to the allure of the PPL? This post is to share with others what have you done this past month because of watching Kdramas and see who else is like you!\n\nShare things like:\n\n* Hours of sleep lost because you got [caught up in a binge!](https://giphy.com/gifs/mother-of-mine-kGiztx4M3fkVlfkQdz)\n\n* Korean food you ate or cooked -- advice about ramyeon flavors or soju is also welcome!\n\n* [A new hobby](https://i.redd.it/k7k3fwfs40e41.gif) you've picked up or a rediscovery of an old hobby you loved!\n\n* [The gorgeous coat](https://i.redd.it/sdx50o1gpgg31.gif) you bought despite living in a place without winter and other fashion choices!\n\n* Updates about your progress with learning Korean -- whether you are studying formally or just acquiring some basic knowledge through too many Kdramas watched!\n\n* Your new Dyson hairdryer or vacuum and other PPL inspired purchases -- Subway counts too!\n\n* Travel plans and anything else that comes to mind when you think of the phrase \"Kdramas Made Me Do It\"!\n\nShare only as much or as little as you are comfortable with, just remember to be respectful of others and their choices. Even if you hate Subway, others don't have to. Same goes for Kim Tan Worthy Sweaters^(TM).    \n\n---\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=month) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "Packed my bags and went on a trip to South Korea last Dec/Jan!! \n\nGot to see both Christmas and New Years in Seoul 😍",
            "score": 73,
            "author": "LazilyNebulous",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just came back from Seoul and let me tell you, the thing I miss the most is the food 😭",
                    "score": 22,
                    "author": "lovelifelivelife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "same!!! also especially CU/GS25's - so many snacks and what not I've not been able to find back home 😭",
                            "score": 1,
                            "author": "LazilyNebulous",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Completely amazed by their convenient stores tbh",
                                    "score": 2,
                                    "author": "lovelifelivelife"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m so jealous of you guys. *cries in broke* \n\n^(So happy that you enjoyed though. I hope one day I get to go, too!)",
                    "score": 10,
                    "author": "potionsofsirentears",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too! I want to go!",
                            "score": 4,
                            "author": "Master-Training-3477",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Planning a trip once BTS announce their ‘we’re back from military service’ tour. Can’t wait for the food and drink. Although in Australia we have some pretty good Korean places",
                                    "score": 11,
                                    "author": "000feebee000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That sounds like a great plan!!! I love BTS!!! \nIt is hard to believe they are in the military. (I hope it is not like the Kdrama I watched with Jung Hae-In.) Someday I would love to visit Australia, from there I would like to travel to South Korea.",
                                            "score": 5,
                                            "author": "Master-Training-3477"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ay! I fellow Aussie!! We do have some good options and honestly I've recently been seeing more Korean places open up near where I live!\n\nI also want to go back for a post military BTS tour! My friend was actually lucky enough to be on exchange while they had their Busan concert so she actually got to go see them with her own eyeballs - I literally had my trip booked to land few months after, so I was so jealous when I heard.",
                                            "score": 2,
                                            "author": "LazilyNebulous",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "🤙🏼Aussie Army 😁",
                                                    "score": 2,
                                                    "author": "000feebee000"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Aww a mood though - this trip for me was a couple of years of savings in the making, so I totally understand the feeling!!  I hope you get to actualise your dreams of visiting SK one day too :D",
                            "score": 2,
                            "author": "LazilyNebulous"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is my dream",
                    "score": 6,
                    "author": "Snoo-14784",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "sending lots of positive vibes to help make that dream a reality in the near future!!",
                            "score": 1,
                            "author": "LazilyNebulous"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Started watching kdramas Dec 2022 and went on a trip to Seoul end of January!",
                    "score": 3,
                    "author": "FortuneFearless2644",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "omg that's amazing- how did you find it? I hope it was a good trip!",
                            "score": 1,
                            "author": "LazilyNebulous"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Omg I also went and everyone said it would be super cold but it wasn’t cold at all but the food was so good i dream of it fr",
                    "score": 3,
                    "author": "Annaaer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No way! I found it absolutely freezing, I definitely underestimated the cold - do you come from a country where it's subzero often?\n\nAlso how was your trip!?",
                            "score": 1,
                            "author": "LazilyNebulous",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha yeah I’m from Scandinavia so I’m used to it being cold.. I had a very nice! There were so many things to do i wish i could’ve stayed longer",
                                    "score": 1,
                                    "author": "Annaaer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hubby and I are currently looking at a cruise next year - starts in Hong Kong but is apparently the one and only that disembarks in Seoul so that we could stay in Korea afterwards.  We aren't cruise-type people, but this one also visits several other Asian countries - might be our best opportunity to see that part of the world.",
                    "score": 3,
                    "author": "Kathryn_51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This sounds like it could be fun!! like you said, maybe the countries you'll be able to visit will make the cruise part of it bearable. It'd be cool if they had Japan on the itinerary too, since it's next door. I was initially hoping to do Japan + Korea but back when I booked, Japan hadn't opened their borders yet 😭 so I'll definitely be trying to get back up to that part of the world soon to visit more countries (and Korea again). \n\nIf you end up going on that cruise - let us know what it was like in one of the threads here post trip!!",
                            "score": 2,
                            "author": "LazilyNebulous"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I grabbed my friend’s wrist aggressively and pulled him away from his wife who was being a pain in the ass. \n\nI have not been invited back to their house since.",
            "score": 50,
            "author": "Necessary_Rooster_85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you do it in slow motion? It HAS to be in slow motion.",
                    "score": 27,
                    "author": "mackereu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With multiple camera angles",
                            "score": 17,
                            "author": "SHOWTIME_12"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wasn't brave enough to do that to an annoying person but I did stand very still and clench my fist.",
                    "score": 12,
                    "author": "patti_la"
                },
                {
                    "level": 1,
                    "comment": "Lol at this thread🤣🤣🤣",
                    "score": 5,
                    "author": "Entire-Ebb-927"
                },
                {
                    "level": 1,
                    "comment": "Lol",
                    "score": 2,
                    "author": "Master-Training-3477"
                },
                {
                    "level": 1,
                    "comment": "😂",
                    "score": 1,
                    "author": "Odd_Intention_1498"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still plugging away at learning Korean on Duolingo.",
            "score": 42,
            "author": "Telos07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here",
                    "score": 5,
                    "author": "Mechy_"
                },
                {
                    "level": 1,
                    "comment": "I use memrise, they use short little videos which, I find, are engaging.  Also, their choice of words and phrases seems more useful.\n\nMy only problem is that they use hangul a lot and I am still massively struggling with it.",
                    "score": 3,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "90 Day Korean has a fantastic free Hangul lesson. They use it as an introduction to their paid program but you don’t have to sign up to learn Hangul. They use a lot of memory tricks and pictures to help you pick it up easily.",
                            "score": 3,
                            "author": "Otherwise-Bird3682",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I went a little crazy and subscribed to Memrise and 90dayKorean, while they had a good holiday sale.  \n\nI also found KoreanClass101.  They have a nice format where you are introduced to a conversation after which they break it down for you.  I like it because they focus on listening and understanding and include romanization, which seems to be frowned upon by most other teaching systems.  I understand their reason, but for me, I want to focus on listening, not speaking, so pronouncing properly by reading hangul isn't a priority.  To be honest I doubt I'll ever get the hang of it",
                                    "score": 3,
                                    "author": "Martine_V"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I paid for the full access in Lingo Deer 😅",
                    "score": 2,
                    "author": "squigglysage"
                },
                {
                    "level": 1,
                    "comment": "Koreanclass101 is better 😊",
                    "score": 1,
                    "author": "FortuneFearless2644"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Made me go to the Asian Market and spend lots of money. Made me buy metal chopsticks. Made me listen nonstop to Korean music. Made me eat crispy fried chicken and drink beer on Friday night.   Made me go crazy for all things Korean.  ❤",
            "score": 38,
            "author": "Master-Training-3477",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nonstop Korean music—ditto!",
                    "score": 10,
                    "author": "naynever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh my, oh my god",
                            "score": 6,
                            "author": "dankpiece"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started learning Go/Baduk because of the glory. Excited for the new episodes tomorrow. Also interested in any good apps for it, been playing on BadukPop so far for correspondence games",
            "score": 21,
            "author": "Divided_Pi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought i was the only one , so glad that there are others  😅",
                    "score": 3,
                    "author": "Puzzleheaded_Ant6537"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started buying and using lots of face masks and eye patches! Love the brightening eye patches!",
            "score": 22,
            "author": "rolly-polly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooo, what eye patches do you use? I've totally fallen for the face masks and skin care products as well.",
                    "score": 4,
                    "author": "ysports23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recently bought Goodal Green Tangerine vita C eye gel patches and I LOVE them. I tried petitfe black pearl and gold and it just burned while on my skin. The Goodal patches don't burn at all and they leave my skin looking great! I heard some people can be sensitive to vitamin C skin products. Guess I got lucky",
                            "score": 9,
                            "author": "rolly-polly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "basically pricing airfare to Seoul… been doing it since Aug and just close out my browser.\n\n$1600 sigh",
            "score": 18,
            "author": "Flappadingo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just bought my tix! \n\nHot tip: Look at prices early in the morning. Or Tuesday Mornings. I saved about $100 per ticket. Which while not a lot, can get me a boat load of ttetbokki of my dreams.",
                    "score": 17,
                    "author": "hyperbolenow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Upped my winter coat game",
            "score": 18,
            "author": "DayDaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ended up buying so many jackets inspired by what PMY’s character wears in When The Weather Is Fine last winter. Won't have to buy any for years now.",
                    "score": 7,
                    "author": "potionsofsirentears"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i started skin care and i also remember i started using chopsticks 💀",
            "score": 18,
            "author": "Blare_fly"
        },
        {
            "level": 0,
            "comment": "I'm so glad I'm not alone.  Skincare, pork belly, and Duolingo.",
            "score": 17,
            "author": "cinereoargenteus"
        },
        {
            "level": 0,
            "comment": "I gained more weight eating noodles/ramyeon",
            "score": 17,
            "author": "Entire-Ebb-927",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried  kimchi,several times",
                    "score": 6,
                    "author": "Entire-Ebb-927",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fashion ideas,",
                            "score": 5,
                            "author": "Entire-Ebb-927",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am a kdrama addict,\n\nRarely watch western cinema, anymore  Now,\n\nbecause it feels  a bit meh compared to  kdrama",
                                    "score": 18,
                                    "author": "Entire-Ebb-927",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So true! I only watch Kdrama. I'm so afraid I'm going to miss something.",
                                            "score": 7,
                                            "author": "Master-Training-3477"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "During meals I eat several side dishes without guilt now,",
                                            "score": 3,
                                            "author": "Entire-Ebb-927",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "NOW INTERESTED in \n\nKeyless/keypad  Doorlocks\n\nUnderfloor heating ,\n\nThose pink gloves,(i cant get these where i am:(\n\nClear uncluttered floors,less furniture,",
                                                    "score": 9,
                                                    "author": "Entire-Ebb-927"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Made my first banchan: thinly sliced cucumbers, garlic, scallion, sesame oil and my newly purchased gochugaru. Crunchy and refreshing. Served it in a pretty little Asian bowl and ate it with chopsticks. Really nice addition to my meal! I also find myself handing people things using both hands.",
            "score": 16,
            "author": "barbarat2"
        },
        {
            "level": 0,
            "comment": "We no longer wear outside shoes in our home. Slides at the door for all! Several friends have also adopted the practice. Appalled at the years of tromping all over the house in dirty shoes!",
            "score": 16,
            "author": "Weatherwaxworthy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did the same.  I'm always amazed that in dramas, no matter what emergency is happening, i.e. someone might be dying, they will still take their shoes off at the entrance.  That's dedication!",
                    "score": 8,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have seen them slipping off laced shoes, putting on slippers while carrying the passed out/injured FL with no pause in their trajectory. I can only aspire!",
                            "score": 10,
                            "author": "Weatherwaxworthy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finished the first section of an online Korean course for absolutely no reason other than I want to watch dramas while I do dishes. I could be doing a hundred other things but that takes precedence.",
            "score": 14,
            "author": "demonita"
        },
        {
            "level": 0,
            "comment": "Found Kopiko candies by chance at the supermarket and I couldn't resist. They're actually very good! Although they don't really wake me up, they taste nice tho",
            "score": 10,
            "author": "witheyeslikeice"
        },
        {
            "level": 0,
            "comment": "Dramas started it but BTS finished it - Ramyeon. Bought a bunch of different kinds because of the dramas but I have wicked acid reflux most of the time. Finally I found not only a great tasting one but it’s not spicy so I can jazz it up just enough to not get heartburn and it’s Jin’s favorite! Have an entire case of the stuff now. All I have to do is add one of the four different kimchi types I have in my fridge right at this moment - cabbage, cucumber, perilla leaf and radish. Or one of the many frozen Korean corndogs I have because of Jinny’s Kitchen  - I can’t get enough of them. Jinny’s Kitchen isn’t helping with the ramyeon issue either! I wish I was joking about any of this but I definitely am not. \n\nStill plugging away at Korean but doing it slower at the moment. Having a stressful time in my life in general and I can’t focus on studying language well right now. I still practice and study daily but not as much as I would like.",
            "score": 9,
            "author": "tangledbysnow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Watching Jinny’s kitchen really makes me crave kimbap",
                    "score": 11,
                    "author": "lovelifelivelife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yes! That too but ramyeon or an already frozen corn dog is easier to make so of course I default to the easy one!",
                            "score": 3,
                            "author": "tangledbysnow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My Playlist has now changed into a carefully curated list of 90s Rock, 2000s emo punk and... KPOP",
            "score": 8,
            "author": "The_Ant_1983"
        },
        {
            "level": 0,
            "comment": "Definitely lost a lot of sleep but I'm taking more care of my skin. Fighting the urge to run away like in Summer Strike.",
            "score": 9,
            "author": "dionysusnyx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely, nighttime cleansing is a game changer.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything from food to skincare to clothing (coats and wide legged jeans)",
            "score": 6,
            "author": "miss50shadesofK"
        },
        {
            "level": 0,
            "comment": "Sooo many foods…tteokbokki, ramen, fried chicken, kimchi, soju, etc!",
            "score": 7,
            "author": "Billie_Lurk"
        },
        {
            "level": 0,
            "comment": "Tried iced americanos cuz I keep seeing those being ordered in coffee shops on dramas. Also on singles inferno when they had to compete for a special meal apparently ice americano was a treat. I had to see what the big deal was.",
            "score": 6,
            "author": "theedqueen",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was me a year or two back - I used to not be a coffee drinker at all/stayed the hell away from black coffee, but seeing iced americanos in dramas all the time pushed me to try it and now I can't function without one a day hahahahha \n\nWhat was your verdict though after trying it? Yay or Nay?",
                    "score": 1,
                    "author": "LazilyNebulous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I already like coffee but I usually get regular coffee or lattes. Never did Americanos before. I’ve tried it a couple times since and it’s been hit or miss. I think it really depends on the coffee shop. Some places it tastes like they burned the coffee beans so it’s awful.",
                            "score": 2,
                            "author": "theedqueen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's true!! burnt coffee (especially on an empty stomach) is just 🤢 sometimes",
                                    "score": 1,
                                    "author": "LazilyNebulous"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All of what everyone already mentioned and SOJU!",
            "score": 7,
            "author": "imJoyk"
        },
        {
            "level": 0,
            "comment": "Started learning korean on Duolingo! It was super easy and fun and i ended up ranking no 1 on the first league and no 2 on another lol small achievements. It’s been 21 days since I’m practicing and currently on the unit about saying where people are, and talk about food. Man it’s getting hard but i will continue 🥲 \n\nAlso went down the rabbit hole of watching GOT7 videos ( algorithm got me due to kdrama) the members are amazing, already knew JY and JW, i can go on all day about them but I’ll stop blabbering now 😂\n\n\nOh also bought my first ramyeon cuz i saw it at local mart and next is gochujang on my list. If anyone has any recs for trying out korean food please do tell (i can handle spicy pretty well but I’m a vegetarian, not vegan)",
            "score": 19,
            "author": "poppywhiskers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well done on doing well with korean language",
                    "score": 9,
                    "author": "Entire-Ebb-927",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 3,
                            "author": "poppywhiskers"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Youtube algorithm is phenomenal with the kdrama to GOT7 pipeline. For me, it started with their funny moments and slowly shifted into the music. Now I’m going to see Jackson Wang in May.",
                    "score": 6,
                    "author": "withloverei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s how they get us haha Omg JW concerts look amazing so happy for you! I’m still in the funny videos stage, I’m watching them play games for straight 3 hours without any skip. More plot twists than a kdrama",
                            "score": 4,
                            "author": "poppywhiskers"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What I am not liking about DuoLingo is how focused it is on reading.  I want something that focuses a lot on hearing and understanding words.",
                    "score": 4,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should try Memrise. It has a great hearing section with little video clips of native Koreans saying the words and they test you by giving you multiple choice of the word/phrase you just heard.",
                            "score": 1,
                            "author": "ME_B",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did get Memrise, maybe I missed that section? I'm doing the basic which does introduce words and test you, but it also asks you to write it out in Hangul, which slows me down.  I wish that I could just get the words, plus the testing with no test on how to write it.",
                                    "score": 1,
                                    "author": "Martine_V",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahh, I just checked and I think it's the \"Ready for review\" section, where you choose \"Learn with locals\" or \"Listening skills\", but those options are only available for the paid version. I can't really test it out cause I'm not paying for it anymore but if I remember correctly from when I was paying (a few years ago now..) I think I was able to choose those modules so that I could practice reviewing only the listening components.\n\nEdit: the learning aspect of it (like learning new words) isn't selectable though I think.. like they teach you new words always in the same way.. I think it's once you learned the new words and you can review what you've learned that you can choose the type of review with the paid version iirc. I could be totally wrong though cause it's been a long time since I used the app.",
                                            "score": 1,
                                            "author": "ME_B",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe they changed things, but I wasn't able to find those two options under Ready For Review.  And I do have a paid version.",
                                                    "score": 1,
                                                    "author": "Martine_V",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's odd, I even see those options on both the app for android and on the Memrise website (after logging in and clicking on the dots beside speed review), it's just that those options appear locked for me since I'm not paying right now.",
                                                            "score": 1,
                                                            "author": "ME_B",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is what I see.  If I click on Review, it leads me to the next review question.  I don't see \"Learn with locals\" or \"Listening skills\"\n\nhttps://i.imgur.com/d2TIW7W.png",
                                                                    "score": 1,
                                                                    "author": "Martine_V"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What’s duolingo, an app",
                    "score": 1,
                    "author": "Ritzcrackers0327",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, you can learn any language on it, it’s designed very well !",
                            "score": 1,
                            "author": "poppywhiskers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I will take a look.  Thank you",
                                    "score": 1,
                                    "author": "Ritzcrackers0327"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ooooh as a fellow vegetarian - if you're considering going out to eat, I've been to a fair few places where they've accomodate requests to make certain Korean dishes vegetarian! Must tries are tteokbokki and bibimbap (honestly this is the go-to easiest Korean meal for vegetarians I reckon). \n\nOR if you fancy a bit of cooking, both of those dishes are pretty easy to make too!",
                    "score": 1,
                    "author": "LazilyNebulous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooh thank you so much!! I don’t have any Korean restaurants nearby maybe I’ll take a trip lol\n\nI enjoy cooking anyway but i always felt I’d have to buy a bunch of new ingredients for korean and i got lazy lol But I’ll start small and look up those dishes. They make it look so scrumptious on the dramas 🥹",
                            "score": 2,
                            "author": "poppywhiskers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know the feeling! I'm a very lazy cook but a friend convinced me to make rose tteokbokki with her -and it was actually pretty easy - you can buy frozen tteok and then all you need to do is make the sauce! We went massively off recipe once we started making it, because we just added a bunch of random vegetables into the mix (like mushroom and broccoli hahahahah) but it tasted yummm :D\n\nGood luck - let us know how it goes and whether you make any dishes at home!!",
                                    "score": 1,
                                    "author": "LazilyNebulous",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just looked up rose tteokbokki and that’s such an interesting take! I do like the idea of mushrooms and broccoli. I’m one of those psychos who actually likes broccoli xD and mushroom is my all time favorite thing to have, the favours the texture is all too yum!! Oh i have frozen tteok in my amazon thanks for the hack 🥹",
                                            "score": 2,
                                            "author": "poppywhiskers"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "remember to check if they put bulgogi (beef) in the bibimbap which they'll do sometimes.  you can ask them to minus the meat or take it out yourself, but they're minced, so hard to take'em all out",
                                    "score": 1,
                                    "author": "BudgetRadish5717",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s something that has happened with me in the past,not the exact same thing, just in general. It’s one of my greatest fear when eating at a busy restaurant thanks for the heads up !",
                                            "score": 1,
                                            "author": "poppywhiskers"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i want to go south korea because of korean drama",
            "score": 8,
            "author": "nitisha_maharjan"
        },
        {
            "level": 0,
            "comment": "I tend to buy comfortable clothes rather than stylish ones. Slowly changing that inspired by Kdrama women and my oppa LMH's stylish outings.",
            "score": 15,
            "author": "mhfan_india"
        },
        {
            "level": 0,
            "comment": "I made it my goal in life to make to the best kimchi. The best part is I travel and live different places in the world two years at a time, so where ever i go I like to see if I can find the ingredients to kimchi. \n\nPS Moved to Albania and flew to Rome just go to Korean Market to buy gochugaru",
            "score": 6,
            "author": "Snoo-14784"
        },
        {
            "level": 0,
            "comment": "Bought a Nescafe Cappuccino machine and started drinking coffee drinks.   Also go to bb.q chicken at least once a week. Drinking Soju.",
            "score": 5,
            "author": "fefeh1"
        },
        {
            "level": 0,
            "comment": "Solo walks in the evening, appreciating little things like  changing of seasons and writing little notes to myself, Korean snacks and condiments, more neutral and monotone wardrobe, bags and accessories, vitamin supplements, unintentionally bowing while thanking someone, saying ok ok and samsung phones.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Tried so many Korean recipes that my husband is complaining that he just wants regular food. But I’m converted. Bought lots of ramen until I found the right one. Tried soju…like the peach flavoured one. Searched high and low for Kopiko candy until I finally ordered it off the web. Recognize some Korean words but don’t know how to write them such as “I like you”, I love you”, “go”, “brother”, “mother”, “queen”. The first one that ever stuck with me was the word translated as “sorry”.",
            "score": 4,
            "author": "peregrina2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "omg, as you listed that, the Korean words popped into my mind.  I guess I must have the very basic down",
                    "score": 2,
                    "author": "Martine_V"
                },
                {
                    "level": 1,
                    "comment": "Which ramen do you recommend?",
                    "score": 1,
                    "author": "Large-Lawyer9449",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Canada. I like the miso Sapporo Ichiban brand. I’m sure there must be other good ones if someone has recommendation.",
                            "score": 2,
                            "author": "peregrina2005"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A Korean BBQ restaurant opened up near us a couple of months ago.  We could choose which meats to grill - just like in k-dramas.  Also tried different sojus.  My favorite was the kimchi omelets although I don't recall seeing that on a drama - but it was soooooo good.",
            "score": 5,
            "author": "Kathryn_51"
        },
        {
            "level": 0,
            "comment": "I started studying Korean couple of years ago and went to Korea for a trip last autumn! I packed hiking shoes because of Jirisan drama (best choice ever, there are mountains everywhere!)\n\nNow I think of it, I started bowing slightly to random people at hello, sorry and thank you 😂",
            "score": 3,
            "author": "Impossible-Ground-98"
        },
        {
            "level": 0,
            "comment": "Much better with skin care now and it's made such a difference to my sun damaged skin. I remember watching an actress in Our Blues doing her skincare regime and feeling inspired.\n\nKIMCHI, oh my god, where have you been all my life.",
            "score": 3,
            "author": "Orongorongorongo"
        },
        {
            "level": 0,
            "comment": "I binged the second half of 2521 and couldn't sleep despite being so late due to the ending! Still love the show but wish they had gone a different route for the last few episodes.",
            "score": 3,
            "author": "sand2603"
        },
        {
            "level": 0,
            "comment": "Bought it ingredients and cooked tteokbokki.",
            "score": 3,
            "author": "naynever"
        },
        {
            "level": 0,
            "comment": "Bought a Samsung phone even I’m an iOS user (sold it soon after realizing I’m not happy with my purchase after the initial, ‘Oh this is too cute’ 😁",
            "score": 3,
            "author": "Puzzled-Tell-7108"
        },
        {
            "level": 0,
            "comment": "Developed a real tteokbokki obsession. And a skincare habit. But honestly my skin has never looked or felt better and tteokbokki is so much less bad for me than the snacks I used to eat :)",
            "score": 3,
            "author": "neon_winter7"
        },
        {
            "level": 0,
            "comment": "I sometimes think in korean words,\nKamchakiya!\nKamzamida etc\n\nSorry for the spellings",
            "score": 9,
            "author": "Entire-Ebb-927",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes I am in bed at night and Korean words pop into my mind",
                    "score": 5,
                    "author": "Martine_V"
                },
                {
                    "level": 1,
                    "comment": "I do the same thing. I need to learn more words 🤣",
                    "score": 4,
                    "author": "Purple_Lingonberry96"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Joined the Korean subreddit",
            "score": 2,
            "author": "squigglysage"
        },
        {
            "level": 0,
            "comment": "I went to a Korean restaurant in a small French city. And I could explain every dishes to my bf 😂 I went 3 or 4 times and tried gimbap, bibimbap, japchae, etc. It was very good. But I was too shy to try to speak Korean with owners",
            "score": 2,
            "author": "No_Conversation8023"
        },
        {
            "level": 0,
            "comment": "Made the drive to Toronto a couple times (I’m near Buffalo, NY) for good Korean BBQ, Korean Fried Chicken, snacks, and soju. Bought more neutral and stylish clothes, Korean skincare. A trip to Seoul is now on the bucket list!",
            "score": 2,
            "author": "dmarie6795"
        },
        {
            "level": 0,
            "comment": "Finish a drama - search the cast - finish their popular dramas - search the cast -.................♾️",
            "score": 1,
            "author": "Puzzleheaded_Ant6537"
        },
        {
            "level": 0,
            "comment": "Bought wood chopsticks and ramen bowls. Then tried to go back to top ramen and I can not believe I ate that crappy stuff. Can never go back to crappy ramen now",
            "score": 1,
            "author": "Aralnda"
        },
        {
            "level": 0,
            "comment": "Bought my first Dyson vacuum cleaner after watching sky castle. Am contemplating about buying one of those air humidifiers now. Does anyone has one, are they any good?",
            "score": 1,
            "author": "wheelofzen"
        },
        {
            "level": 0,
            "comment": "Started to learn Hangul 안녕허세요 I have a bottle of Soju in my fridge. Had it for months. I have a subscription for korean beauty products. I subscribe to a VPN, so I can watch shows outside of Denmark. Today I bought some very strong Samyang ramyon. Don’t touch that stuff normally.",
            "score": 2,
            "author": "Odd_Intention_1498"
        },
        {
            "level": 0,
            "comment": "Finally went to H Mart and bought supplies for making gimbap at home. And also delighted at being able to read Korean signs (even if incorrectly) \n\nKdramas made me do it all!",
            "score": 1,
            "author": "noideaabout"
        }
    ]
}