{
    "id": "11nl8i2",
    "score": 91,
    "title": "Reborn Rich: A solid kdrama",
    "author": "PapercutFiles",
    "date": 1678443363.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11nl8i2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just finished Reborn Rich today and I loved it. This is my second drama watch starring Song Jong Ki; the first one being DOTS.\n\nThe poster tagline was what got me interested:\n\n&gt;Reborn to the family that killed me \n\nThe story follows Hyeon Woo, a loyal and dedicated employee to the Soonyang Corporation, who gets murdered while following orders and gets reborn as Do Jun, the youngest member of the conglomerate family. \n\n**Things I loved**\n\n* Hyeon Woo/Do Jun didn't turn into a magnanimous person. In the hands of a different writer, they would've written his character to be suddenly different after he was reborn into a rich family. Thank God it didn't happen that way. He wasn't overly charitable to the people who was affected by the company's decisions (mass layoffs, cheated minority investors, etc). He did what he could as a person who could control the tide and lessen the burden of the ordinary people but that's it. No cheesy lines about *saving the little guy* or *giving back to the people*.\n\n* Chairman Jin Yang-cheol and Do Jun's relationship. From the get-go, they have a complex connection. Do Jun admired his grandfather but he's also the head of the family that killed him/Hyeon Woo. They share similarities in character but differences in motivation. The grandfather admires his grandson that is much like him and the grandson has grown to be wanting to impress him. \n\n* Do Jun's partner, Oh Se Hyun, is a good businessman. But he didn't turn into a confidant. That is to say— he wasn't in the whole being reborn of Hyeon Woo into Do Jun and wasn't aware of Do Jun's real motivation in taking Soonyang (which was to get revenge). It fits the bill because Se Hyun's motivation to help Do Jun was that he thinks that only competent people should run businesses (which Do Jun is). To show that big corporations shouldn't be monopolized by a single family. Doesn't make sense if they made him a confidant and helps DJ in his revenge. Because he's shown as a business partner more than a friend.\n\n* Hwa-Young's husband or Choi Chang-Je. The character development from a meek in-law walking on eggshells around the Soonyang family to a confident politician was so good. I love that he has his clear ideals and platform but bends them whenever he will get benefit. Lol a true politician right there.\n\n* The ending. &gt;!Hyeon Woo won. He got his revenge of taking Soonyang from the Soonyang family and uncovering who's behind his murder. A happy ending doesn't necessarily mean that he should've gotten Soonyang because that wasn't his goal in the first place. He specifically mentions not wanting to be chairman but only wanted buy Soonyang (in effect, taking the company from the family). It also wouldn't make any sense either if he also ended up with Min-Yeong after he's back to being Hyeon-Woo because what kind of person gets into a relationship with an accomplice to her fiance's murder? Their last meeting shows the Hyeon-Woo understood that wasn't right and parted ways with her in good terms. Which is the best possible conclusion between them!&lt;\n\n* The acting all-around. SJK was great as well as the rest of the cast. But Lee Sung Min was absolutely dynamite. He really played the role perfectly. From his little facial expressions of curiousity, approval, and disappointment to his family and Do Jun. He didn't just play a stone-cold businessman but he also showed some humanity in the character. Chairman Jin showed sentimantality towards his businesses (SY Motors/Semiconductors) and didn't just cut them off because of profit. He was also (at times) affectionate towards his grandchildren. And LSM did that all flawlessly. \n\n\n**Things I didn't love:**\n\n* Plot hole likes &gt;!the recording Hyeon Woo played during the trial in the last ep. Who recorded that? How? With what? Based on the scene, HW was too shocked to even think about recording the conversation, let alone having a device to record it on. Also, why did the call didn't end when he and the manager finished their talk? It seems funny to let the call continue then talk to another person after!&lt; or &gt;!Do Jun not anticipating Chairman Jin's death and having scenes thinking about it and how it will play out and what will he do!&lt;\n\n* The middle part of the drama got repetitive. Soonyang wants to buy x company or do y thing but Do Jun steps in their way. Soonyang siblings/chairman find a way to bypass him and thinks they won but in the end, it was all part of Do Jun's plan and he wins. The way Se Hyun kept saying the line \"just as you planned\" to Do Jun got old quick after the first two times.\n\n* The way Do Jun got instantly attracted to Min-Yeong. He already met her when he was Hyeon Woo but he fell for her when he became Do Jun? I feel like it's not really established how he got the feels for Min Yeong at the beginning. \n\n* Do Jun's brother just being there for comedic effect or as a guide to give Do Jun ideas. I mean, it's so obvious whenever he's on screen that he'll say some offhand comment and Do Jun will think of a way to solve his problem. The brother got one decent scene at the &gt;!hospital when DJ got hurt from the truck accident!&lt; but that's it. I know he's a minor character but his role and actions are just too predictable. It's off-putting.\n\n* There were so little scenes of child Do Jun. I wanted to see more of how Hyeon Woo first adjusted to the Soonyang family. Side note: The child actor was so good!!! I hope Kim Kang-hoon gets more roles.\n\n\n\nOverall, the it's a well-produced and solid drama perfect for binge watching. It kept the tone of the drama throughout, kept the romance minimal, gave great dynamics between the characters, and was gripping enough to get you hooked. Minus some repetitive arcs and plot holes, it's a great watch.",
    "comments": [
        {
            "level": 0,
            "comment": "The one criticism I have is the romance!!! It was so cringe and unnecessary. They should’ve been friends. The romance felt forced and just jam it in since there’s a boy and girl here.",
            "score": 64,
            "author": "JellyfishNumerous785",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's not fair to judge the romance cuz they cut out a lot of scenes to fit the time limits",
                    "score": 7,
                    "author": "AdhesivenessOwn7747"
                },
                {
                    "level": 1,
                    "comment": "There's *a bit of* chemistry between the two characters and their romantic scenes were minimal so I was fine with it for the most part but story-wise, it does feel a bit forced. I also side-eyed how Do Jun &gt;!jumped to proposing after he got released from questioning when they were still broken up and have had no contact between them!&lt;",
                    "score": 6,
                    "author": "PapercutFiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What chemistry?",
                            "score": 40,
                            "author": "OcelotSilver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😂🤣",
                                    "score": 6,
                                    "author": "JellyfishNumerous785"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the point is it's not a romance drama, But you need a female lead and love interest or else Korean Citizens won't watch. also she has a role as a prosecutor, so she mainly serves her role to the plot and the romance can be assumed from the scenes \"they didn't shoot\"",
                                    "score": 1,
                                    "author": "CL131"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really enjoyed this show and was surprised by how much hate the ending got. I will say it's a bit ridiculous that &gt;!Hyeon-woo somehow forgot having been present for Do-jun's death!&lt;, but if we explain that away as traumatic amnesia or something, the ending wrapped it all up nicely.\n\nI agree the romance arc was underdeveloped and a bit forced, as if the writers felt it was obligatory. The real core of the story was the relationship between Do-jun and the Chairman. All of their scenes together were dynamite.\n\nI ordinarily dislike makjang revenge stories, but I loved this show.",
            "score": 23,
            "author": "stillnotking",
            "replies": [
                {
                    "level": 1,
                    "comment": "People were angry because they wanted a happy ending for dojun\n\nBut also i think the ending leave some things for us to think about",
                    "score": 4,
                    "author": "Maleficent_Monitor27"
                },
                {
                    "level": 1,
                    "comment": "The death scene was what confused me too. But overall I really enjoyed the drama",
                    "score": 2,
                    "author": "SHOWTIME_12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially after Hyeon Woo said in the earlier episodes that he knows &gt;! *everything* about the Soonyang family. He also remembers the dates of significant points in the past.!&lt; But somehow was totally blindsided on the &gt;!Chairman's death. Sure, let's excuse him forgetting Do Jun's death as trauma but he should've known and prepared for the death of the literal guy who wrote (?) the autobiography in his workdesk.!&lt;",
                            "score": 5,
                            "author": "PapercutFiles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please correct me if I'm wrong because I'm honestly a little confused about this too, but wasn't he blindsided by &gt;!the Chairman's death because in his original timeline (not sure if timeline is even the right word), the Chairman died in the plane bombing but because Hyeon-woo, knowing the future, saved the Chairman from boarding that plane. But as a result, he no longer knew when the Chairman was actually going to die now in the \"timeline\" that he exists in with his interferences.!&lt;",
                                    "score": 2,
                                    "author": "jozeno",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I rewatched ep2 again earlier and it didn't say that &gt;!Chairman died in that plane crash. Do Jun specifically mentions that the incident wasn't in his autobiography!&lt;",
                                            "score": 3,
                                            "author": "PapercutFiles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ohh ok that makes more sense",
                                                    "score": 1,
                                                    "author": "jozeno"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently reading the webtoon. It's quite more detailed and steady paced than the drama. I doubt any romance will be involved from the looks of it. The latest chapter is nowhere near the end. Currently in the webtoon, Do Jun just entered college. This is like chapter 15 or 16. It's a lot more interesting quite frankly, to read it. Even though kts steady paced and detailed, every chapter is exciting leaves the reader at a cliff hanger. Definitely a good read.\n\nhttps://m.webtoons.com/en/drama/reborn-rich/list?title_no=4956",
            "score": 15,
            "author": "Overly_Sheltered",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the webtoon/novel is already finished in Korea since there are articles comparing the drama's ending to the original story.",
                    "score": 4,
                    "author": "PapercutFiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the webnovel is finished.\n\nthe webtoon format is ongoing. the official english licensed source is on the Webtoons site, but the official korean source is on Naver. Both sites have a freemium \"fast-pass\" system where the most recent chapters are behind a subscriber/paywall. they become free after a delay. it looks like the english version (including fast pass) is 15-ish chapters behind the korean.",
                            "score": 6,
                            "author": "dogdogdogdogdogdoge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see! Do you know if the webnovel has a full English translation? I can only see the webtoon ver.",
                                    "score": 1,
                                    "author": "PapercutFiles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "the webnovel is officially available in english on the app Yonder. Right now there's 147 chapters available. but i'm not sure how many chapters there are in total. there's like 5 bound volumes. other things sometimes use the literal translation of the korean title: The Youngest Son of a Conglomerate\n\nalso...with some googling, you can find up to date fan made translations of the webtoon.",
                                            "score": 3,
                                            "author": "dogdogdogdogdogdoge"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was a strong start but the last couple of episodes ruined it for me. The best parts were the references to future events like apple, titanic, home alone,etc.",
            "score": 12,
            "author": "EasyWalsh"
        },
        {
            "level": 0,
            "comment": "Compared to all the mediocre and bad dramas that came out in 2021 and 2022, reborn rich was super solid bc of grandpa, OMg I loved his mean ass so hard. Oscar worthy acting. The drama went downhill after he died and the last episode was just bad for me simply bc I grew to love the ML as the rich kid, not the broke dude (his real self lol). Still sad the rich one died. I had no connection to the broker character in the last episode.",
            "score": 10,
            "author": "Calca23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely same here. When broke kid approached the partner and that worked, I was puzzled how that would have worked and I wasn't even satisfied when it did.  rich DJ had more spunk and fire.",
                    "score": 2,
                    "author": "heart_headstrong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And i was wondering that Do Jun did so much for hyeon woo's parents but hyeon woo didn't even met Do Jun's parents to console them or anything \nI hated it how hyeon woo didn't try to prove that he is do jun at least",
                            "score": 2,
                            "author": "EffectiveFuzzy2911"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reborn Rich was okay for me. I enjoyed **Again My Life** a whole lot more. It has a similar story line of getting murdered, coming back to life and getting revenge. It was more fun.",
            "score": 8,
            "author": "Starrycats11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely enjoyed Again My Life more and didn’t feel it slowed as the episodes went on.  I was entertained by Reborn Rich as I liked the actors but it wouldn’t be something I would rewatch.",
                    "score": 3,
                    "author": "CategoryFinal8655"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watch the first episode and the last episode.\n\nEverything in between is pointless as hell lol. Never seen a writer so cluelessly drive the series off the cliff and kill it like this writer did.",
            "score": 19,
            "author": "OcelotSilver"
        },
        {
            "level": 0,
            "comment": "Definitely a solid drama. I must admit I’m one of those that were not satisfied with the last episode but it is one of my most favorite of all time. Also, thank you for telling us what the poster tagline meant.",
            "score": 6,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "I got the sense that DJ fell for MY because she lived how he wished he could- morally sound, fighting for good, etc.. in general, she stands out from the crowd as a shining symbol of honesty and justice in the middle of all the scum and deceit that surround him. Even her loving that boyband was a nod to her innocence. Being good and pure was her charm. The drama really should have gone more into it.",
            "score": 6,
            "author": "WhimsicalUnknown"
        },
        {
            "level": 0,
            "comment": "I actually quit after 6 episodes and was falling asleep during some of em before that. I can be a bit picky about shows cuz I've edited a lot of video and my patience for bad pacing is lower than others, but it definitely felt a bit slow and bland from what I did make it through. Didn't even like the color grade or framing, the shots just didn't feel like they were immersing me into the scene and between dialogue all that much. I like the actors I can see why it did well just from that alone, but I found it lacking overall and just didn't do much to draw me into the story. Wasn't the Vincenzo Pt2 people were hyping it as either, perhaps that also had something to do with it.",
            "score": 5,
            "author": "JohrDinh"
        },
        {
            "level": 0,
            "comment": "&gt;”It also wouldn't make any sense either if he also ended up with Min-Yeong after he's back to being Hyeon-Woo because what kind of person gets into a relationship with an accomplice to her fiance's murder?“\n\nI would say Hyeon-Woo was an “accomplice” because he was tricked into parking there - hence telling Director Kim, on the phone, that he’d arrived but he couldn’t see anyone/thing there. He was unknowingly used. Of corse this doesn’t mean that Min-Yeong would date him, but I don’t think she’d see him as an “accomplice” either.",
            "score": 4,
            "author": "mamapielondon"
        },
        {
            "level": 0,
            "comment": "Part of the problem with the romance, I feel, is that kdramas have primed us to think of dating as the final goal, the end state in the relationship, all the chemistry and attraction overflows and builds up to that objective: dating is the end.\n\nMeanwhile IRL what people generally do with dating is they feel a certain spark then they decide to date to see where it goes: the dating is means to the end, feeling each other out so as to whether they want to be together or not.\n\nWe're primed to expect scenario 1, because that's the typical kdrama endgame, but the show shows us scenario 2, and I think that's a contributing factor to why the romance feels flat. I will agree that the actors were failed by the script and the director here; we know they can both pull off romantic roles and chemistry, but it didn't really work out, especially with the real relationship focus of the show being Jin Yang-cheol and Jin Do-jun's relationship, which was just so much more compelling.",
            "score": 4,
            "author": "WhiskeyGolf00"
        },
        {
            "level": 0,
            "comment": "Yes!!!! It was solid from the jump! The ending was controversial for many but I felt it was the most logical one considering how the story played out. It made sense!",
            "score": 10,
            "author": "JellyfishNumerous785",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol what?\n\nThe ending, even ignoring massive plotholes and inconsistencies, doesn't make \"sense\" especially when vast majority of the people were left scratching their heads when the show literally spelled out its own message....in like few seconds as oppose to building up to it. \n\nThis isn't controversial. This is incompetent writing at its peak. I have no idea if people just turned their brains off for the show and started claiming the ending made sense when it clearly didn't.",
                    "score": 12,
                    "author": "OcelotSilver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea the show runners picked the ending they wanted. But it seems like they shot 15 episodes and then decided how they wanted the ending to go and then wrote that episode separately.\n\nSo yea it was a garbage ending because they had to put in a lot of new information to get the ending they wanted.\n\nSo it was terrible writing. Because vital information for the ending shouldn't be first mentioned in the final episode.",
                                    "score": 1,
                                    "author": "mishanek"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ending was absolutely garbage \nThe things do Jun did for HW's parents disappeared when he came back as HW \nWhat the hell is that ?\nLast episode ruined the whole experience",
                    "score": 1,
                    "author": "EffectiveFuzzy2911"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder why some people skip over Vincenzo.",
            "score": 7,
            "author": "IIM_Clutch",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are missing out! Hopefully they’ll figure it out soon lol",
                    "score": 3,
                    "author": "Mysterious_Name4326"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I liked that drama, but the first and last episode weren't it for me and I felt like it could have been condensed more to let more room for the actual plot, which was with Dojun.\n\nI liked the romance with Minyeong, I feel like Yeonwoo was attracted to her when he saw her in ep1 and when he saw her for the first time as Dojun, it kind of felt like love at first sight as he saw her realself. I do feel though, some moments were a little awkward, almost like he suddenly didn't like her anymore or something to then suddenly fall back for her. It wasn't consistent and I wish they developed it a bit more instead of keeping it in the back and use it only as a filler from time to time.",
            "score": 8,
            "author": "Lizzy348",
            "replies": [
                {
                    "level": 1,
                    "comment": "The romance was entirely forced and pointless. No build-up, just imagery \"these guys suddenly like each other\". \n\nMe and my brother started talking over the scenes or even skipping them entirely due to how generic and pointless they were. The show shined in its relationship between the grandson and grandfather. The romance, however, was flat as it can be.",
                    "score": 9,
                    "author": "OcelotSilver"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some time after finishing a show, my reaction about it reajusts. I remember loving **Little Women** while I was watching it, but now it is hard for me to understand why I liked it so much. On the other hand, **Reborn Rich**, which I saw shortly after, keeps climbing up my list. In retrospect, it is a solid drama and, imo, it is definitely one of 2022's best.",
            "score": 4,
            "author": "ILoveParrots111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm actually debating on watching either Little Women or The Glory next. Both seems to have been well-received in this sub and in general.",
                    "score": 3,
                    "author": "PapercutFiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven't seen the second part of The Glory, but those two are widely different shows. Little Women is fast-paced and over-the-top, while the Glory is dark, it gets hard to watch at times, but it is really good at getting an emotional response from a viewer.\n\nIt really depends on your mood.",
                            "score": 3,
                            "author": "ILoveParrots111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is the Glory gory? I saw it's a revenge story on some school bullies",
                                    "score": 1,
                                    "author": "PapercutFiles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love The Glory but found parts uncomfortable to watch, however, it’s so well acted.  Definitely one of the best shows I’ve seen,",
                                            "score": 2,
                                            "author": "CategoryFinal8655"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I wouldn't call it gory. I don't remember any disgusting stuff, but a character get  tortured pretty badly. Although, I find that the 1st episode is the worst in that regard.",
                                            "score": 1,
                                            "author": "ILoveParrots111",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the warning! I'll keep it in mind",
                                                    "score": 2,
                                                    "author": "PapercutFiles"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im not satisfied with ending but its good drama for me.",
            "score": 2,
            "author": "iBed_Yul"
        },
        {
            "level": 0,
            "comment": "This was a really good drama, but personally I had  hoped that they would have followed the novel's ending.",
            "score": 1,
            "author": "Boruto-sennin",
            "replies": [
                {
                    "level": 1,
                    "comment": "What was that?",
                    "score": 1,
                    "author": "FreeJSJJ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the novel Do Jun takes his revenge and becomes the owner of Soonyang Group. In the last moments of the novel he visits the place where Hyun Woo was killed to  pay  his respect to his previous life.",
                            "score": 1,
                            "author": "Boruto-sennin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The title makes more sense in regard to that ending. With the word \"reborn\", I was expecting for an endgame-DJ because HW got reincarnated as DJ. But the drama made it as if it was a time jump + body switching thingamajig.",
                                    "score": 2,
                                    "author": "MiserableEnjoyer"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks! I think the drama ending was slightly better if not for the plot holes",
                                    "score": 1,
                                    "author": "FreeJSJJ"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so salty with the ending. It was really good until the 14th episode and from comments I've seen everywhere, the webtoon ending sounds perfect. I don't see the need to change it. It would've been predictable but atleast sensible. Coming back to the present felt rushed, especially after taking a bullet to head and being perfectly alright in a week",
            "score": 1,
            "author": "Apart-Explanation-51"
        },
        {
            "level": 0,
            "comment": "I've said it before in other posts, but Hyunwoo having  &gt;!recorded evidence of the murder conspiracy!&lt; ruins this drama for me. Not even as a plot hole, but because of the implications it has on the purpose of the transmigration. The existence of the &gt;!recording!&lt; lessens the extent hyunwoo changed because of the transmigration in ways that affect the plot of the story. \n\nI hate that they tried to turn his revenge into some big societal message last second. I hate that he had to become rich and then poor again to be empowered to do the right thing. This show messed up all its messaging because it got to enthralled in the succsssion war and revenge. \n\nFor the ending to make any sense for hyunwoo as a character, i needed to believe that even with &gt;!recorded evidence!&lt; without having been dojun, he would have sided with the Soonyang family. I simply don't. The writers didn't do anything to make me believe that, and instead showed me that hyunwoo was a smart, caring, just man. If he sided with them after they tried &gt;!to kill him and left him to take the fall for the paper company!&lt;, then i would have expected him to be very different as Dojun. Secondly, the heart of the drama should have been relationships. Everyone points out how the dojun grandpa relationship is well explored and amazing, and i agree. The problem is that &gt;!the grandpa dies before the return to the present timeline!&lt;. So the impact to theme of repentance is so much more stifled compared to the possibilities with Minyeong, dojuns mom, dojuns dad or dojuns brother. But these relationships are so underdeveloped in the story that there is no emotional exploration to the reveal &gt;!that hyunwoo is a perpetrator to people he loves/loved!&lt; Basically, the writers said \"actually the point of the drama all along were relationships we didn't care to develop\".\n\nAnyway, those are my thoughts. It was a good drama. Could have been amazing drama. Just can't get past the question: what was the point of the transmigration? None of the answers seem good, and this drama took itself too seriously for there not to be a good answer. Reborn rich in more ways than one is a story of what could have been.",
            "score": 1,
            "author": "itsunel"
        }
    ]
}