{
    "id": "11rnp0u",
    "score": 22,
    "title": "What Are You Watching? - [2023/03/15]",
    "author": "AutoModerator",
    "date": 1678860014.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/11rnp0u",
    "media_urls": [],
    "other_urls": [],
    "postText": "A weekly thread to talk about all the things that we are watching! You are not limited to Korean things, feel free to talk about other dramas/shows you are watching.\n\nFind all the latest What Are You Watching posts [here](/r/KDRAMA/search?q=title%3A%22what+are+you+watching%22&amp;restrict_sr=on&amp;sort=new&amp;t=week).\n\n[Here](/r/KDRAMA/search?q=flair%3A%22On-Air%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) are the latest On-Air Discussions.\n\nFind a list of our related sub-reddits for more in-depth discussions of non K-drama content [here](/r/KDRAMA/wiki/relatedsubreddits).\n\n**Please  remember to use spoiler tags when discussing major plot points or  anything you think should be redacted.** If you are using Markdown and not  Fancy Pants Editor, the easiest way to create spoiler tags is to use  &gt; ! spoiler content ! &lt; without spaces to get &gt;!spoiler content!&lt;. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=week) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "Late to the party, but I finally finished **Tomorrow**. I was a sobbing mess during most episodes. It was thought-provoking, and I'm taking some time to digest it.",
            "score": 30,
            "author": "Lily-J7",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wrecked me in the best kdrama way! I watched it for Rowoon after watching *The King's Affection* but this was my first glimpse of Lee Soo-Hyuk and that led me to the glory that is *The Scholar Who Walks the Night*.",
                    "score": 5,
                    "author": "ManicPixieOldMaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here; I became interested in *Tomorrow* after watching *The King's Affection.* I think Rowoon is such a natural.\n\nThis was my intro to Lee Soo-Hyuk too! I'll check out *Scholar* if I can!",
                            "score": 2,
                            "author": "Lily-J7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The FL in *Scholar* is probably my least favorite, but LSH's Gwi is the greatest vampire of all media ever, imo, and having Lee Joon-gi as the hero just makes it all better. The other female characters are great, too! Hope you enjoy the camp!",
                                    "score": 1,
                                    "author": "ManicPixieOldMaid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Greatest vampire of all media ever?! AND Lee Joon-gi?!\n\nOk this is now on my must-see list ... Thanks for the recommendation!",
                                            "score": 2,
                                            "author": "Lily-J7"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I still haven't made it through the full episode with Kong, my husband turned it off on me I was crying so hard.",
                    "score": 3,
                    "author": "samptra_writer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh no ... yep, that was a rough one  &lt;3",
                            "score": 2,
                            "author": "Lily-J7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I couldn't get into it at all 🙂 Seemed really samey and I didn't jel with the characters. About 7 episodes in and just quit because it felt like a slog.",
                    "score": 1,
                    "author": "Travels_Belly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, different strokes. I hearya",
                            "score": 3,
                            "author": "Lily-J7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The episode of the old veteran made me cry for an hour XD such a good drama!",
                    "score": 1,
                    "author": "The_Hidden_Spirit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was one of my favorite episodes for sure  \\*sob\\*",
                            "score": 1,
                            "author": "Lily-J7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This one is in my top favs ! It absolutely destroyed me, every ep I was sobbing haha... But it was soooo good !",
                    "score": 1,
                    "author": "grunge-rat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Totally agree! Destroyed in the best way",
                            "score": 2,
                            "author": "Lily-J7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**The Glory: Part 2** (8/8): Part 1 wrapped up 2022 on such a powerful note and Part 2 has not disappointed in finishing the job. It delivered all of the cinematic style, the action, the thrills, the drama, and the dark humor that I expected. There were satisfying resolutions, shocking moments, raw, emotional scenes, enigmatic sequences, and twists and turns which made the episodes fly by in no time at all.\n\n**Divorce Attorney Shin** (2/12): A bit of an odd series, this one. It has a low-key feel for the most part, but tackles some heavy subject matter at the same time. Tonally, it shifts around quite dramatically from scene to scene. But all of this adds up to a net positive, because these elements make it different and intriguing.",
            "score": 17,
            "author": "Telos07",
            "replies": [
                {
                    "level": 1,
                    "comment": "I liked how The Glory ended. Felt right.\n\nI am also really enjoying Shin! It has a weird vibe, but it's mostly feel good with a tinge of the heart tugging.",
                    "score": 8,
                    "author": "attaboy_stampy"
                },
                {
                    "level": 1,
                    "comment": "Divorce attorney shin has become my weekly laughing session.The cast has great chemistry, and the ml is just too adorable.",
                    "score": 3,
                    "author": "Caramel_meg"
                },
                {
                    "level": 1,
                    "comment": "&gt;**The Glory: Part 2** (8/8): Part 1 wrapped up 2022 on such a powerful note and Part 2 has not disappointed in finishing the job. It delivered all of the cinematic style, the action, the thrills, the drama, and the dark humor that I expected. There were satisfying resolutions, shocking moments, raw, emotional scenes, enigmatic sequences, and twists and turns which made the episodes fly by in no time at all.\n\nCouldn't say it better myself, binge-watched both parts in 4 days and it's definitely one of my favorite dramas, even if it's one I wouldn't recommend to someone faint of heart.\n\nKnowing that *any* of these bullying sequences is likely something that has happened to a real child, watching *every* single one of them happened to the same character and being stuck in a living Hell with these psychos was upsetting  ... the show had a lot of scenes that were a bit hard to stomach.\n\nThe revenge arc itself however, a true masterpiece !",
                    "score": 3,
                    "author": "citron9201"
                },
                {
                    "level": 1,
                    "comment": "Spot on with the glory. Enjoyed it immensely.",
                    "score": 2,
                    "author": "the-green-crewmate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "our blues (12/20):\namazing slice of life drama, absolutely love the casts, noh yoonseo and bae hyun sung are so freaking cute, i love how the stories are told and its really meaningful, rlly enjoying it so much\n\nedit: misspelled name",
            "score": 17,
            "author": "caratandcake",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is good. When I recommend a K Drama, I'll ask what kind of genre they like, and if they're 'whatever' or 'anything', this is the one I recommend.",
                    "score": 3,
                    "author": "attaboy_stampy"
                },
                {
                    "level": 1,
                    "comment": "One of my absolute favorites! The acting is fantastic!",
                    "score": 3,
                    "author": "meggktown"
                },
                {
                    "level": 1,
                    "comment": "I’m watching Our Blues too! I’m enjoying it so much. I only have 3 episodes left. I’m trying to slow down to soak it in more. It’s so good.",
                    "score": 2,
                    "author": "TheCraneWife_"
                },
                {
                    "level": 1,
                    "comment": "I loved this drama, really like how it explores all the characters and there individual issues.",
                    "score": 1,
                    "author": "AllMight1"
                },
                {
                    "level": 1,
                    "comment": "Am also watching this now after stopping at the 2nd or 3rd episode last year!\n\nIt started out very slow so could get boring. I started liking the series after episode 5..now at episode 15!",
                    "score": 1,
                    "author": "Left_Guess888"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finally started watching **Crash Course in Romance** because I always wait until the last episode has aired before starting a show. I’m on episode 7, and I’m enjoying it a lot. It’s always a treat watching my favorite actress, Jeon Do-yeon, and I appreciate the classy and high-quality way it’s put together. It’s quite a contrast to my last drama, **Psychopath Diary**, which had no connection to reality whatsoever and which I ended up dropping despite some entertaining humor.\n\nHowever, I wish Su-ah and her mom weren’t such over-the-top despicable villains. Just about every character in the show is either good or bad, with no in-between. The show is so believably realistic in most other respects (except for all the &gt;!serial killings!&lt;).",
            "score": 17,
            "author": "BletchTheWalrus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well I disagree with you quite a bit there. Although I'm enjoying it too. Also on like the 8th/9th episode.\nAnd the drama has some really well done shots but more often than not I do not enjoy the cinematography, often it looks like a college students project and the audio is really bad at times that it takes you out of the drama.\n\nI also don't think that SuAh and her mom are too over-the-top despicable villains. I find them actually to be realistic characters with realistic amounts of selfishness, wanting to be best and doing anything for it. I think both characters level of evil is completely proportionate for the type of character and desires that they've got...\n\nI agree with you on the serial killings. It kinda feels out of place honestly. Since they don't always follow up on that storyline and I forget about it then I get reminded that oh yea, people are dying.",
                    "score": 4,
                    "author": "Leemar02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I appreciate your opinions. When I mentioned quality, I wasn’t just referring to the cinematography and sound (which seem fine to me, but you’re probably more perceptive about those areas), but also the acting, writing, editing, pacing, and overall effect, which to me seems much classier than average. There’s fewer of those cheesy things like sloppy editing that looks like they were rushing to make the air date, excessive flashback scenes to hit you over the head with some obvious point, other filler scenes, and unnecessary stylistic flourishes. Of course, there are some of these things, but much less than most dramas I’ve seen. There’s an overall feeling of economy and letting the story unfold naturally instead of pandering. I’m probably not expressing myself very well.\n\nSu-ah and her mom make my blood boil. I’ve known many competitive, grade-grubbing types, but none who had no redeeming qualities at all like these characters.",
                            "score": 2,
                            "author": "BletchTheWalrus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love that you're loving it! :) I watched the drama as it aired. Maybe I'll meet you in the next thread when you're done watching!",
                                    "score": 2,
                                    "author": "noideaabout",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great, would love to discuss it.",
                                            "score": 2,
                                            "author": "BletchTheWalrus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually.. now on the penultimate episode. SuAhs mother really ramped up the evilness and went from what I thought was reasonable and realistic jealousy and envy to a bit over the top. I agree with you on that point now 🥰\n\nAnd I also agree on the lack of cheesy scenes. I do feel like some of the romance moments are awkward but idk if it's due to the story or if it's some bias I have towards seeing older people act cutesy haha.... \n\nI get your point with letting the story fold naturally though. I think I agree with you on that too.",
                                    "score": 2,
                                    "author": "Leemar02",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re one episode ahead of me, but I hope to finish tonight. I’m disappointed that Su-ah’s mom is continuing with more of her hijinks, after all that’s happened. And there are so many villains and bad people, I’m losing track. But I’m still really enjoying the show, especially the main couple. I hope it ends on a high note.",
                                            "score": 2,
                                            "author": "BletchTheWalrus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just finished watching the first episode of **Bad and Crazy** and I'm really happy that I finally am giving it a shot. It's been on my watchlist for a while now and I really love Lee Dong Wook's works so it's fun to see a character that I haven't really seen him play. The story is keeping me pretty interested and I'm excited to see the different character dynamics!",
            "score": 14,
            "author": "mysterious_kdramas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just 1 ep in?!? Ah, you are in for a treat. The last few minutes of the 2nd ep is maybe the funniest and coolest thing I've seen in a k drama... ever...? Maybe so. I rewound and watched that over and over like a dozen times. It makes me laugh now thinking about it. \n\nLee Dong wook is really good but so is wi Ha-joon. He is too much sometimes.\n\n And the show gets better. It's a fun watch.",
                    "score": 8,
                    "author": "attaboy_stampy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love To Hate You (9/10) - I am enjoying it a lot more than I thought I would. The series is fast paced and breezy. The actress who plays the FL is very charismatic and it's easy to see why in the series people around her take to her. Though I found her hypocritical in the initial episodes. \n\nThe ML is attractive and fits the role of a somewhat older star actor who plays romantic roles onscreen but is a misogynist in real life. I like how they have somehow come together to make a perfect couple. \n\nSpecial mention for the actress playing Ms Choi who I think played Kim Tan's mom in Heirs. The romance of the FL's and ML's friend is unnecessary. \n\nNow unless the last episode is really bad I give it a 8/10.",
            "score": 14,
            "author": "mhfan_india",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let me know how you feel about the last episode",
                    "score": 1,
                    "author": "manwithoutlyf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I liked it in general. But I didn't like how have been in relationships with multiple people was made to look like it was for altruistic reasons ie to teach scums a lesson.",
                            "score": 3,
                            "author": "mhfan_india",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, when the whole premise was based on the expose, i would have expected them to treat it atleast some amount of care",
                                    "score": 1,
                                    "author": "manwithoutlyf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;!I did like the PC where the ML apologizes for lying about breaking up with the FL. But says that to make the rest of the world happy he can't leave the woman he loves. But then proposing and getting the FL promptly breaking up was too dramatic.!&lt;",
                                            "score": 2,
                                            "author": "mhfan_india",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea. Sh**ting stats did better job of handling this",
                                                    "score": 1,
                                                    "author": "manwithoutlyf",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sh**ting Stars I didn't understand what the big deal was about two consenting adults dating. I got it that the FL feared a backlash due to her past experience. But we really don't get to see public reaction in the show. I appreciate that everyone respected her wish not to reveal the relationship.",
                                                            "score": 1,
                                                            "author": "mhfan_india",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Idol culture is super toxic. The star would immediately lose ads once their marketability is down",
                                                                    "score": 1,
                                                                    "author": "manwithoutlyf"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Touch your Heart (8/16) Slowly but surely watching this. Really enjoying this one a lot. Not much to say other than nothing much happens but they are so cute and nice I don't care! \n\nThe Heavenly Idol (2/12) Belatedly started this and it is so funny. Kim Min Gyu is great! He has such good comic timing. This is not a spoiler but as the high priest, he realizes that candy helps replenish his energy. So he thinks that candy is \"tribute.\" He also doesn't know what a camera is. Usually when someone enters another world they try to hide that they don't fit in. Not here, he is basically proudly announcing his ignorance, asking for instance \"what is a camera?\" There are also lots of funny analogies that deliver some good critiques of the industry. Kpop idols and real idolatry meet in this drama. \n\nCompleted:\nCrash Course in Romance: So....the last few episodes were messy, especially the last episode. Why did they &gt;!introduce her bio mom? Super unnecessary. The thriller plot still didn't work for me.!&lt; I enjoyed it and thought it was alright overall. The acting was really fantastic. \n\nNon-kdrama:\nStill deep in Formula 1: Drive to Survive!",
            "score": 12,
            "author": "Sunshine_raes"
        },
        {
            "level": 0,
            "comment": "Weak Hero Class 1: Oh my it's soooooo good.\n\nI struggle with the school issues in kdrama, hate bullying trope (is it even a trope or a scary reality, it's in way too many dramas.... ) BUT this has been unexpectedly well acted in a worm turns sort of way.\n\nThe young ML is a Kpop idol, he is fantastic! As are the other actors, a lot of on point acting and it's subtler on emotions than other kdramas I've seen. (Not all are saeguk ie Penthouse, not sure if that's right?)\n\nThe actor who's the crown prince in Alchemy of Souls is in this too, charismatic as ever. He needs a lead role in a drama.\n\nOh episode five and will continue!",
            "score": 9,
            "author": "Persephone_91",
            "replies": [
                {
                    "level": 1,
                    "comment": "weak hero is a masterpiece",
                    "score": 4,
                    "author": "delphil1966"
                },
                {
                    "level": 1,
                    "comment": "One of the best shows I've ever seen! I watched it a month or so ago and I still can't stop thinking about it. I might watch it again soon.",
                    "score": 2,
                    "author": "nothinggoddess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I highly suggest the webtoon!",
                            "score": 2,
                            "author": "Weekly-Count-9253"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Currently Watching**\n\n**The Heavenly Idol (8/12)**: Still a fun watch although I’m over the devil business\n\n**Call It Love (6/16)**: I’m at home with my rom-melo 🫶🏾 I love it so far, great characters 🥰\n\n**Delivery Man (2/12)**: I’m in the middle of episode 3. It’s cool, interested to know what’s going on with the mystery plot. I find FL kind of annoying with her lack of boundaries, yelling, etc. I also have “mister driver!!” stuck in my head 🫠\n\n**Empress Ki (13/51)**: Watched 4 episodes in the last week!! Really into it, can’t wait to continue watching all the characters stories unfold :) it gets my anxiety up there for sure though 😅\n\nI’m in the middle of **Pandora** episode 1. I might still finish the first two episodes but I’ll probably leave this for the summer if I’m still interested since I have 2 more upcoming March dramas that I want to watch!",
            "score": 7,
            "author": "Snickersnerds",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm also watching Empress Ki and it's so good! \n\nI must confess that I try to avoid historical dramas as much as I can because I get stressed with the multiple intriguing people and plots, and this drama has tons of that... But, Ji Chang Wook... I want to watch anything he's done and I love him here, so adorable! \n\nThe thing that annoys me the most is that there are 51 episodes! I'm on episode 20 and, considering the stress, I'm watching in small dosis, I don't know when I will be able to finish it!",
                    "score": 2,
                    "author": "AccomplishedBerry290",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, Empress Ki is a long one. But it's worth the time. Ji Chang Wook and Ha Ji Won and Ju Jin Mo. Wow. I enjoyed it and still listen to the music.",
                            "score": 1,
                            "author": "sharjoy3"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, historical dramas always have so much going on but I love them lol. And JCW is my fave, I’ll watch anything he’s in 😂\n\nAs for the length, this is my first time watching a long form drama!! I paced it out to watch at least 1 episode a week so it doesn’t feel like toooo much of a commitment but I’m a little ahead schedule which is nice!",
                            "score": 1,
                            "author": "Snickersnerds"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Crash Course in Romance** \\[16/16\\]: I really enjoyed watching the first half of the drama, it had everything that I wanted to watch in a drama after recovering from my slump but then the second half kind of made it bleh for me. I did enjoy the crime mystery aspect they touched in the second half, but apart from that I pretty much skipped on most things. The last two episodes seemed more like fillers to me. Overall it was a nice watch but not something extraordinary for me. I would rate it an 8/10.\n\n**The Crowned Clown** \\[4/16\\]: I've put this on hold for now cuz it isn't catching my attention the way I expected it to. Probably reading all the good reviews on this one made me watch this with high expectations which is why for now I've put this on hold. I'll get back to this when I feel like I can watch it with a fresh mindset. But so far it was an ok drama. Not very attention grabbing yet, but also something I'd continue watching. Definitely did enjoy YJG's acting in this one though!\n\n**Love to Hate You** \\[0/10\\]: I've watched like the first 10 mins of the first episode and it seemed fun. I don't know if I should continue watching this or not though I've only read good reviews on this drama. Maybe I should check out the first two episodes and then decide whether to continue or not.\n\n**Non-Korean**:\n\n**Haunting of the Hill House** \\[2/10\\]: I'm absolutely loving this one. It has that mystery &amp; horror parts done so beautifully. I also like the sudden time shifts, i.e., the timeline skips as the story flows because it makes me watch it with full focus and not feeling boring at a single part. Can't wait to finish this one.",
            "score": 8,
            "author": "Fatooz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought the first episode of Love to Hate You was pretty bad, however, it gets much better in the subsequent episodes.",
                    "score": 5,
                    "author": "Sunshine_raes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's what i've read too. lol i still haven't managed to watch the 1st episode. i'll most likely get to it tomorrow or day after. 😭",
                            "score": 2,
                            "author": "Fatooz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Haunting of the Hill House [2/10]: I'm absolutely loving this one. It has that mystery &amp; horror parts done so beautifully. I also like the sudden time shifts, i.e., the timeline skips as the story flows because it makes me watch it with full focus and not feeling boring at a single part. Can't wait to finish this one.\n\nOoooh *The Haunting of Hill House* was such a ride, I loved it. Everyone was talking about it when it first came out, and with good reason. Very old school horror backdrop and themes, with modern elements. Really cool.",
                    "score": 3,
                    "author": "EmmanuelleEmmanuelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's one of the best shows ever made. It was one that kept me thinking about it for days afterward.",
                            "score": 1,
                            "author": "nothinggoddess"
                        },
                        {
                            "level": 2,
                            "comment": "yes! i've watched 2 episodes and i'm waiting for a friend to catch up so that we both can watch the remaining 8 episodes together! excited to finish the series hehe! &lt;3",
                            "score": 1,
                            "author": "Fatooz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had initially stopped during the first episode, but a few days later I was suddenly wondering if it did get better, so I started watching it again. Now it’s one of my favorite rom com kdramas 🥲once you get to episode 2, I think it really takes off!",
                    "score": 2,
                    "author": "Old_Hold8114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "a lot of the people here have said it gets better from the 2nd episode so i guess i'll have to give it 2 episodes to finally form a judgement on it! hehe thanks! &lt;3",
                            "score": 2,
                            "author": "Fatooz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For Love to Hate You, first episode did not grab me at all.  So I skipped to episode #4, and immediately saw a big improvement.  The series grew progressively better, and I ended up loving it.  Afterwards I went back and tried to \"rewatch\" episodes 1-3 and still didn't like them.  Weird, huh?  So anyone reading this, consider skipping ahead if you're not impressed at first.  I felt I didn't miss anything starting at #4.\nEdit to clarify which show I meant.",
                    "score": 1,
                    "author": "hhiker70s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "interesting, but since i'm using this for a challenge i'll have to watch all the episodes haha. i guess i'll make sure i watch it till the 4th or 5th and then give a judgement. thank you! &lt;3",
                            "score": 1,
                            "author": "Fatooz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Episodes 6-10 reach full stride, and the characters become more complex.  Second FL becomes more important; 3FL also.  I loved the flight attendant SFL.  But the highlight for me is the new-found self-awareness developed by FL. &gt;!  She becomes a more complex, more lovable person as she embraces her growing feelings and becomes vulnerable. This happens late in the series (episode 9, maybe?).  It is a surprising and heartwarming development for this tough cookie.!&lt; Worth hanging on to see imo.",
                                    "score": 1,
                                    "author": "hhiker70s"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Traveled last week so I watch much. \n\n**The Heavenly Idol**\\- It's ok, but not that engaging for me. I'm on episode 5 and not really caring about the characters that much. The devil story is a bit cheesy. I'm sticking with it in hopes that I'll see WA perform and a romance develop, but not sure I will remain with this one. \n\n**Our Blooming Youth** \\- I haven't watched any more of it this week. Still on episode 5. \n\nI watched some of the Oscar movies last night and they were depressing. I wanted to \"clean my palate with a lighter watch kdrama but have not been drawn to a currently  airing one sing Crash Course in Romance. That empty feeling.... So I decided to watch **Fanletter, Please** and it was perfect!!! It's 4 episodes with Sooyoung and Yoon Park and an adorable little girl. I binged 2 episodes before I fell asleep in the wee hours of the morning. I'll watch the last 2 episodes today. \n\nAlso - I want to finish **Pachinko** this week and the second half of **The Glory.** Both are really good. Then I will tackle **Island,** that I've been waiting for since it was announced.",
            "score": 7,
            "author": "sharjoy3",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I watched some of the Oscar movies last night and they were depressing.\n\nWeren't they? I watched them all and Everything Everywhere All At Once was the lightest of the batch.",
                    "score": 1,
                    "author": "samptra_writer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Diary of a Prosecutor** (3/16) I'm loving this one so far, it's really funny and I like the characters. Plus the change from the usual Seoul setting is really refreshing. I love the subtropical vibes while I'm sitting here in a snowstorm haha!\n\nThe only thing is that I started it like, \"No romance? No problem! I love kdramas with no romance!\" And now I'm like, ok but it would be perfect as a rivals to lovers story... I don't think it's going to actually take away from it for me, but it really feels like it should be a romance!",
            "score": 7,
            "author": "KiwiTheKitty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey I just started that one too! I like it. I'm 4 eps in. I like how it is playing around with the prosector/intense drama genre, spoofing some stuff.",
                    "score": 3,
                    "author": "attaboy_stampy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For sure! The humor is hitting really well for me",
                            "score": 3,
                            "author": "KiwiTheKitty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like how the bosses are cast with actors who would normally be either really stern old school fearsome or backstabby types in some dramas are actually slightly goofy or childlike at times. Like how the one boss of the Division 2 has that classic handsomeness where he seems like he'd be unapproachable and feared, yet he's actually almost too warm hearted and accidentally silly. I mean he not only bikes to work but he dresses in decked out full triathlon wildly colorful bike outfits when he walks in.\n\nOr how the main boss, who is played by that actor who always seems to be the sniveling right hand man to some ultra powerful boss is actually plays it like a  Buddha type presence where you can see he has a mischievous side that he doesn't hide very well.",
                                    "score": 3,
                                    "author": "attaboy_stampy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmao yes! He's so funny and I think having the characters be playful is so much more fun and realistic\n\nI work as a civil servant (not an attorney or prosecutor haha) in a similar sized city and it's really funny how true to life it feels even on the other side of the world",
                                            "score": 2,
                                            "author": "KiwiTheKitty"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is such an underrated gem",
                    "score": 3,
                    "author": "Fearless_Cloud_620",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's so good!",
                            "score": 3,
                            "author": "KiwiTheKitty"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Watching this one too! Im on episode 5.",
                    "score": 2,
                    "author": "talkingibberish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hope you're enjoying it too!!",
                            "score": 1,
                            "author": "KiwiTheKitty"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Love that show too. I miss the gang.",
                    "score": 2,
                    "author": "Flipperflopper21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's so cozy!",
                            "score": 1,
                            "author": "KiwiTheKitty"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Summer Strike (12/12):** I appreciate how laid back this drama felt overall, even when there were occasional spikes in drama. While it felt like it was slowly crossing the cliche line towards the end, I didn’t mind too much because the characters’ journeys were satisfying. Overall, the series felt like a warm hug and a tap on the back to those who are trying.\n\n**Our Beloved Summer (16/16):** The premise was so good, but the “documentary” element felt underutilized. It gradually lost its integration to the story, occasionally being reduced to mere plot device. The story was still great though, and the performance of the two lead actors were excellent. Choi Woo-Shik was the perfect choice for his character, and I was blown away by Im Da-Mi during the emotionally heavy moments. In the scene where she confesses to grandma about her feelings, Da-Mi’s acting and facial expressions truly portray a character who’s aware that her source of misery is herself. This series is probably one of my favorites because of how memorable the performances were.\n\n**True Beauty (16/16):** It took me 3 episodes to realize that this series was self-aware (and to an extent satirical), and enduring the cringe was so worth it. The abundance of kdrama easter eggs and trope mockery is reason enough to watch it IMO, but it’s also impressive how the depth in the characters is not lost amidst the humor. I agree with the opinions I’ve read in other threads that say the writing on the characters seem grounded on parent psychology. And finally on the self-aware part: I’m guessing the writers knew kdrama has a reputation for very likeable second male leads, so they wrote Han Seo-jun as &gt;!someone I would root for so much that I just got crippling sadness in the end…!&lt;\n\n**The Interest of Love(12/16):** I rarely watch melodrama. Watching the decisions the leads make often gave me discomfort. But so far I’m enduring it well, because there are real perspectives to explore here—most of the events are contextualized with money, which I think helps to sympathize with the characters. So far I think Gyeong-pil is the most interesting character in that he, despite having a despicable history, has a blunt honesty that is tempered with genuine care for the other characters. I’m hoping for a happy ending at least for the two leads, but it seems the sh*tshow will go for longer…",
            "score": 7,
            "author": "SeekersArmguard"
        },
        {
            "level": 0,
            "comment": "I'm Not A Robot: I recently watched a few heavy dramas so I was looking for something light and had heard lots of good things about I'm Not A Robot... so I thought I'd give it a try. I mean, what could be more light and fluffy than a storyline involving falling in love with a robot right? But oh my gosh... guys, this show is so emotional! Watching the lies and betrayal that the poor, beautiful, sweet ML is going through is killing me. His heartbreak while trying not to fall in love is breaking my own heart! And kudos to the ML actor, that man can deliver emotional scenes and express so much through his eyes. I'm really enjoying it and I'm surprised at how well they've managed to pull off what seems like a ridiculous plot. Its very well done.",
            "score": 6,
            "author": "ysports23",
            "replies": [
                {
                    "level": 1,
                    "comment": "You would think this would be the ultimate silly drama with its premise but there is so much angst. It is well done angst as you mention. It also has one of the best scenes I've ever watched in a drama. It's so so romantic! Just thinking of it makes me swoon!",
                    "score": 5,
                    "author": "Sunshine_raes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh that's so good to hear, I'm excited to keep watching! I'm always down for some swooning!",
                            "score": 3,
                            "author": "ysports23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**The Glory Part 2 (8/8)** - This is how you stick the landing on a season/part 2 of a Kdrama series. Honestly, standing applause to all on this one. Absolutely satisfied with the ending and this is going down as one of my favorite kdramas to date. Also proof that &gt;!hot, sexy chemistry is not required to display a believable romance between two characters. There are different kinds of chemistry going on between our leads and I appreciated it given both leads history but especially the FL’s.!&lt; I hope other Kdrama writers are taking note on how to create a satisfying ending with a large(r) cast of characters and multiple storylines. \n\n**Hyena (8/16)** - I’ve been eating through courtroom kdramas like candy lately and Hyena is my latest entertainment. Dang is this drama GOOD. Love the leads and supporting cast. Storyline is starting to feel predictable though. I think the strength is really in the relationship of the leads on this one.",
            "score": 7,
            "author": "the-green-crewmate"
        },
        {
            "level": 0,
            "comment": "**Divorce attorney shin** (4/12): Divorce cases are quite good, but I am excitedly watching for the quirky trio and the new addition &gt;!June namja!&lt;\n\nInterestingly, the drama only used the divorce cases from the original webtoon, the characters, except shin sung Han and Lee seo Jin, are screen writer's creation. Shin sung Han was originally a cynical, neat character fueled by revenge against &gt;!his mother!&lt; .I am super glad that the drama changed his character and gave us a quirky singing guy full of affection.\n\n**someday or one day (Taiwan)** (1/13): Nothing to add now. The ML is so attractive! He reminded me of Kim woo bin esp when he smiled",
            "score": 5,
            "author": "throwawaymisfortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope you enjoy Someday or One Day!! I love that drama and I completely agree about the ML",
                    "score": 6,
                    "author": "KiwiTheKitty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recently Completed:\n\n**Once Upon a Small Town** (12/12): loved this a lot!! This is what I wanted Hometown Cha Cha Cha to be! I really liked the romance and all the characters, and I liked that the townspeople where nosy and slightly judgy but not mean like in HCCC. I also really liked seeing all the animals, though I definitely cried when &gt;!the bull had to be put down!&lt;. One thing I wasn’t super fond of was &gt;!the SML being in love with the FL. I was really hoping for a strong completely platonic friendship between the two, and then the relationship drama could’ve just been with the ex-girlfriend. However, I did really like how SML was adamant nothing would change, and then him and FL were able to continue to have a strong relationship afterwards!&lt;\n\n**Fanletter, Please** (4/4): this was was cute! I wasn’t sold on the first episode but since it was only 4 episodes I decided to power through and I’m so glad I did! I felt like the remaining three episodes were much stronger and I really loved the character growth of the FL. The ML was adorable and I loved his interactions with his daughter. \n\nCurrently Watching:\n\n**Birthcare Center** (1.5/8): I don’t know about this one. I love shows about pregnancy and babies, and absolutely loved how realistically they portrayed the FL’s pregnancy and then birth in the first episode. They showed all the unglamorous bits and really kind of took an axe to the fairytale pregnancy/birth/parenting that is often portrayed in shows. However, I just can’t get into it. I just can’t wrap my mind around how none of these parents are spending any time with their newborns at all! Like obviously I support these mothers getting all the help and pampering they can possibly get, but none of them are spending any quality time with their babies except to feed them, and the fathers are spending even less time with them! I just cannot understand it (also definitely not a knock on any parent who *can’t* spend time with their baby due to various circumstances, but that’s clearly not the case here) Also, I find the weird and abrupt tonal shifts very jarring. This may have to go on hold.\n\n**Crash Course in Romance** (6/16): no progress\n\n**Flower of Evil** (12/16): no progress",
            "score": 6,
            "author": "generalbrowsing87",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m also stuck in episode 12 of flower of evil. What happened with the strong and bit odd FL? I guess I’ll finish this week",
                    "score": 3,
                    "author": "Maryofthesun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’m struggling with this one a lot! I’ve been stuck since like early February. I just feel like the things that are happening now are just too over the top coincidental that even suspending my disbelief has not been helping much, and I agree completely about FL!",
                            "score": 1,
                            "author": "generalbrowsing87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For Birthcare Center, yes!!!! That was my big issue with this drama. Are the babies just laying in the nursery all day long and only being held when they are being nursed???? Anyway, besides that, I enjoyed it a lot. I think it's really funny and hits on lots of real issues post-partum. She spends a bit more time with her baby towards the end. However, one episode is very very sad. Spoiler &gt;!there is a stillbirth plotline that hasn't been revealed yet.!&lt;",
                    "score": 3,
                    "author": "Sunshine_raes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am so glad I’m not the only one that feels this way! I was just so baffled by it that I think it put me off the whole show for a minute. Though I do agree that there have been some funny parts and I definitely love how they are being so realistic with everything, including postpartum because it’s definitely not talked about enough how mothers can, and often do, struggle to connect right away with baby! \n\nThank you for the warning with your spoiler! When I decide to pick it back up it’ll be good to know to be prepared for that!",
                            "score": 2,
                            "author": "generalbrowsing87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I definitely thought that too. I ended up watching a YouTube video about real birthcare centers in SK just to see if that was really the case! According to the video, they seem to be with the baby for almost the entire day with a few breaks here and there and at night so new parents can sleep. Also, the new parents were together all day, not just randomly!",
                                    "score": 2,
                                    "author": "Sunshine_raes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I never thought about checking out an actual Birthcare center! But I’m very glad to hear the show wasn’t representative of one (I figured it wasn’t but good to know for sure!!).",
                                            "score": 2,
                                            "author": "generalbrowsing87"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I look forward to this thread every week because I always get great ideas about what to watch next. I just finished **The Greatest Love**, which I actually started over two years ago, but the first episode didn't grab me. Someone in this thread (or maybe it was Late to the Party) identified it as their perfect drama, so I thought I'd give it more of a chance. I went back and watched Episode 2 (because sometimes I hate the first episode of some of my favorite dramas - looking at you Witch's Romance and Mad For You) and this time it clicked. I think it's one of the funniest dramas I've ever seen, but also one of the most touching. And the kisses...oh the kisses! Gong Hyo Jin is wonderful! I think this is my favorite performance of anything I have seen her in. Cha Seung Won's character starts out odious, and becomes so lovable. The actor does an amazing job of taking an arrogant and oblivious character and giving him heart. It's from 2011, so the cinematography is dated, but otherwise I think it's very timely. (It should be required watching for anybody who thinks that maybe being famous might be fun.) I just loved it, and I cannot recommend it highly enough.",
            "score": 6,
            "author": "GirlnGold"
        },
        {
            "level": 0,
            "comment": "I’ve somehow ended a number of currently watchings - \n\n1. Call it love - absolutely love the slow slow slow burn vibes with the heart achingly painful scenes. \n\n2. Misaeng - started a little slow but I got into it quite quickly and now am 2 episodes in. \n\n3. My Country - I watched Six flying dragons last year so I’m glad to immediately be able to understand which part of history we’re at. Loving it so far! \n\nOn hold (if anyone can motivate me to continue: \n1. Jewel in the Palace (28/54) - I loved it a lot but I’m sort of done with the first arc which was honestly my favourite part cause I love watching people cook and compete in cooking. Now it seems like it’s veering away from it so I’m lacking motivation. \n\n2. (Non k-drama) The Makanai: Cooking for the Maiko house (4/9) - A lot less cooking than expected and a lot more about the house which I find cute but not enough investment or attachment to continue.",
            "score": 6,
            "author": "lovelifelivelife",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are stopped at the same part of Jewel in the Palace. I lost my momentum somehow, and I can't seem to make any progress.",
                    "score": 1,
                    "author": "mahnahmaanaa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg! Same for me, I’ve been stuck here for 2 months. It took me weeks to even finish Ep 27 actually. I was just rather &gt;!sad that the mother figure passed. I couldn’t believe it, I wished so hard for them both to have a nice reunion and at least an episode’s worth of memories together but the show gave me none. Right after that she was dragged off to jeju and died and I was pissed at the show and then also no more cooking so I just felt a bit like meh!&lt;",
                            "score": 1,
                            "author": "lovelifelivelife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I read somewhere (an old Soompi article?) &gt;!that it was supposed to happen earlier in the show -- I think during the cooking competition when she was kidnapped -- but she was so popular that the writer kept her in.  So I was surprised that it was only for another 10 episodes. I'm also annoyed with soldier dude.!&lt; Maybe the cooking returns soon?",
                                    "score": 1,
                                    "author": "mahnahmaanaa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She becomes a physician in the second half. The character is based on a historical person - the first and probably only female physician to the king. There is a lot in the second half about herbal medicine and acuptuncture.",
                                            "score": 1,
                                            "author": "Hour-Being8404",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah okay no more cooking then :( but that actually sounds interesting too",
                                                    "score": 1,
                                                    "author": "lovelifelivelife",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought it was but I am quite interested in learning about Korean culture so maybe that made it more interesting to me",
                                                            "score": 1,
                                                            "author": "Hour-Being8404"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm kind of in a slump where I'll get about halfway through a show, and then something else catches my attention, so I'm getting through most of these slowly.\n\n**Korean:**\n\n- **The Glory Pt 2 (8/8)** Just finished and it wrapped up nicely. A little sweeter than I would have liked tbh, but that's okay. \n\n- **He is Psychometric (9/16)** Enjoy it, but very slow getting through it.\n\n- **Revenge of Others (7/12)** Also very slow going.\n\n- **Doom at Your Service (8/16)** My first venture into Seo In Guk, and I really like him. The show is a little incoherent at times. The agreement doesn't make sense, and I'm struggling to understand the motivations of one character in particular. I'm enjoying the dynamic between the leads though and that keeps me going.\n\n- **Strangers Again (10/12)** I've been delaying the last two episodes because I've heard the ending is disappointing. \n\n- **Kokdu: Season of Deity (7/16)** Started off good but my interest is waning. I'll keep going for now.\n\n- **Island Pt 2 (2/6)** I have been lukewarm about the show since it started, and I still feel that way. Came across some spoilers for my man Cha Eun Woo though, and now I want to push through. \n\n- **Taxi Driver (12/16)** Love it. Can't wait to find out how this season ends, and then I'll probably jump right into season 2.\n\n**Non-Korean:**\n- **The Long Ballad (22/49)** Really liking this one. The tension between the leads has picked up, so I have been locked in. Saw some disappointing comments about the PDA though, so that's lowered my excitement by quite a bit. \n\n\n- **Have a Crush on You (5/36)** I shouldn't have started this one tbh, but I saw a clip from it that made me want to start it right away. Not loving it so far, so I might put it on hold until I've finished a few of the other shows.",
            "score": 4,
            "author": "nothinggoddess"
        },
        {
            "level": 0,
            "comment": "I’m in a slump. No matter how good a drama is, I just watch a couple of its episodes and then I move on, so I’m thinking about trying a Chinese drama. \n\n**Can y’all recommend me a bingeworthy and super tropey modern-day rom-com? If it’s got some action/ suspense too, so much the better.**\n\n**Ah, there should be no toxic leads and FL shouldn't be weak. It shouldn't be too sad either. I kind of wanted to watch The Forbidden Flower but read a couple of comments that said it’s sad?? 😩**\n\nI’ve only watched Lookism and have also tried Sweetest Secret (I think that's what the name was, but in case I’m misremembering, it’s the one with an older girl and younger boy and the guy's got allergies and stuff and he's a biker or something?? He also tries to prevent the girl from going on dates and stalks her ugh. It only happens in the first few minutes of the drama so it's not a spoiler 😂).",
            "score": 5,
            "author": "potionsofsirentears",
            "replies": [
                {
                    "level": 1,
                    "comment": "fellow slump resident here, i recommend **love to hate you** if you haven’t seen it already! i’ve only watched the first episode but it seems like i’ll breeze through the drama. pros:\n\n• 10 episodes only (and they’re barely an hour long)\n\n• FL is not weak \n\ncan’t list more cus i haven’t completed it but if u plan to watch it pls write ur thoughts in the FFAs! i’d love to read them :)",
                    "score": 22,
                    "author": "hazyjustajoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I second this recommendation!! I’ve been in a terrible slump lately but **Love to Hate You** was recommended to me and I was able to finish it in just a couple days. The first episode was not my favorite but after that it really picked up and I flew through it! I though it was a really fun watch",
                            "score": 13,
                            "author": "generalbrowsing87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I should take a second look at that one. I bailed about 2/3 of the way through Ep 1. Maybe I'll give it a shot for another ep.",
                                    "score": 1,
                                    "author": "attaboy_stampy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Cool. I'll have to stick with it a bit.",
                                                    "score": 1,
                                                    "author": "attaboy_stampy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, definitely give it at least 3 episodes. I started it because of the all hype I saw on here. It took a few episodes before it really grabbed me.",
                                                            "score": 2,
                                                            "author": "ragingpanda85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Coolness",
                                                                    "score": 1,
                                                                    "author": "attaboy_stampy"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ve done another ep, and it’s on my to do now. I think it had me at the end of Ep 1 when &gt;! she tripped him in the hallway. !&lt;",
                                                                    "score": 1,
                                                                    "author": "attaboy_stampy"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh no :( i get u tho, maybe it's time to make a trip to c-dramaland haha",
                                    "score": 2,
                                    "author": "hazyjustajoo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[**Once We Get Married**](https://mydramalist.com/61923-once-we-get-married) -- premise is super tropey chaebol heir trying to expand his business and enters into a contract marriage with a poor aspiring fashion designer. But ML is never actually toxic and only gets better once he falls in love. The romance is sweet, the second leads negligible, and there's a few trope reversals near the end that really dial up the sweetness. Not much in terms of action/suspense though and nothing sad.",
                    "score": 5,
                    "author": "myweithisway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the rec! Contract marriage is one of my favorite tropes, so I’m definitely gonna add that one to my list. Most of the time I’m just in the mood to watch a cute rom-com without a lot of action and suspense tho so i’ll definitely watch it.",
                            "score": 3,
                            "author": "potionsofsirentears"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you recently binged **The Glory** maybe try another thriller? **Reset** is a Cdrama time-loop mystery that's only 15eps at 45min each; it's not a romcom, but there's a bit of romance.",
                    "score": 3,
                    "author": "onceiwaskingofspain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, actually I’d love a thriller. I was just looking at the list of good dramas and Reset was highly rated, iirc.",
                            "score": 1,
                            "author": "potionsofsirentears"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I also think **Love to Hate You** is a cure for the slump, especially after **Crash Course in Romance.** I started **Fanletter, Please** last night and watched 2 episodes. There are only 4 in the drama and it's engaging and, I hope, uplifting.",
                    "score": 3,
                    "author": "sharjoy3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooh, I think I might watch Fanletter, Please! I love that it just has 4 episodes.",
                            "score": 3,
                            "author": "potionsofsirentears"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I recently enjoyed watching a cdrama **My Lethal Man.** It’s very soapy/melodramatic, swoony/romantic, dramatic rescues, fake relationship, chaebol-poor girl, etc. The female lead is naive, but principled, and both leads rescue the other several times over. \n\nI am currently watching **The Forbidden Flower.** It’s cute, but kind of slow and the acting and writing are not nearly as good as MLM.",
                    "score": 2,
                    "author": "naynever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the recs! I've heard many good things about My Lethal Man too. I’ll add it to my list now tho!",
                            "score": 2,
                            "author": "potionsofsirentears"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;trying a Chinese drama.\n\nGet ready for a commitment...those things are LOOOONG. If you are looking for one that is so fluffy and sweet, modern-day try **You Are My Glory.** If you're into e-sport drama the big names are **Go Go Squid**, and **Falling Into Your Smile,** personally, I liked Go Go Squid better. Or if you want modern romance with a little action try **You Are My Hero.**",
                    "score": 2,
                    "author": "samptra_writer"
                },
                {
                    "level": 1,
                    "comment": "Try My Little Happiness. It stars the FL and SML from Put Your Head on Your Shoulder. They play young professionals in a hospital—he a hot shot neurologist, she a law student interning in his hospital. It starts out as “hate to love” but they actually met as kids but the writers subvert it by having the male lead try to win over the female lead before letting her know they met as kids. The met as kids trope actually makes sense too because the female lead is looking for the boy she liked/defended from bullies when they were kids. \n\nIt’s really sweet, romantic and mature.",
                    "score": 2,
                    "author": "metadarkgable3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Delivery Man** (5/12) Enjoying this so much. Despite the ghosts and the serial murder on the loose, the show feels light-hearted without losing emotional impact in important moments. Latest episode had the funniest 'game' of telephone going on thanks to a precocious little boy that had me laughing out loud.\n\n**Cruel Temptation** (118/129) I'm in the final stretch. I still hate FL's birth parents more than any other character in the show and that's *including* the batshit crazy SFL and the serial cheater without a spine ex-husband.\n\n**Pandora: Beneath the Paradise** (2/16) Obviously wasn't going to miss out on this and definitely enjoyed the first two episodes overall. Currently experiencing jewelry/clothing envy.",
            "score": 4,
            "author": "myweithisway"
        },
        {
            "level": 0,
            "comment": "Started **Revenge of Others** yesterday it's been on my list for a while but some tik tok edits made me start it. I'm into it. \n\nAlso **A Shoulder to Cry On** is giving me life, and finally a KBL worth watching.",
            "score": 5,
            "author": "samptra_writer"
        },
        {
            "level": 0,
            "comment": "**Once Upon a Small Town** (8/12): Really enjoying this sweet series! After recently finishing *A Piece of Your Mind*, I need a lighter watch with lots of humour and great chemistry. I love the shorter episodes,  small town vibes, with a great cast, funny animals and children, and solid love story.  \n\n\n**A Piece of Your Mind** (12/12)**:** I thought the premise sounded interesting with an AI theme, but the writers didn't pursue the sci-fi element at all so you need suspension of disbelief to make this series work plot-wise. The cinematography was lovely and the soundscape was great, but the story honestly dragged on for me. I was using the skip function a lot to just get through the last 5 or 6 episodes. The whole series hinged on one person's reticence, which is my least favourite K-Drama trope. The whole problem could have been solved with one adult conversation.   \n\n\n**Goblin** (1.5/10): So far, this one is really intriguing. I'm enjoying the fantasy elements, and the characters are great, especially the FL, who just eats up the screen. But I'm super weirded out by the age difference between the leads. How is it okay to fetishise a high school girl with a 35 year old man? It helps me to know the actors were both of age during filming, but the sight of a young girl in her school uniform with a grown man is triggering af.  \n\n\n**Healer** (20/20): ADORED everything about this show. I can see why it's people's number 1 drama - the chemistry between the actors is off-the-charts. ML is too dreamy, with such a wide range of expressive sides, from funny to angsty to affectionate to badass. And FL was 100% adorable, sassy, tender. The side roles were great too, even the bad guys. But most of all, the plot was fantastic. Every episode had me on the edge of my seat and I was genuinely sad it came to an end.",
            "score": 11,
            "author": "dreamofriversong",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree the age difference is weird at first. I’d encourage you to keep going tho. The more you watch, the more the back stories make it feel okay and the age difference doesn’t even matter bc of certain details that come out later. Goblin is really satisfying once you watch the whole thing.",
                    "score": 8,
                    "author": "Dear-Stuff-6032"
                },
                {
                    "level": 1,
                    "comment": "Healer was also the last drama I finished and loved it to bits. Gave me a serious case of JCW addiction that makes me feel like a swooning teenager. Embarrassing.",
                    "score": 3,
                    "author": "OhMisterBelpit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**The Glory Part 2** (ep 5/8) Idk... It's not bad, but I don't love it either. Most characters in this show are either absolutely awful or completely pure. I think that **The King of Pigs** did a much better job at portraying a bullying revenge story while adding some nuance (&gt;!bully regretting the bullying, bullied friends betraying each other!&lt;) and that without sacrificing the entertanment value.^(It is such a great show. I wish it was more widely known.) But, to be fair, I don't think that The Glory aims to give a nuaced take on bullying. I think that the show aims more at making the viewer so angry at the enemy, that it feels cathartic to see them go down. \n\nUnfortunately, most of the time, these type of stories are not my cup of tea.  Maybe that is why I have so many mixed feelings about this drama. \n\nOne thing I really like about The Glory is that the main character plays her enemies into &gt;!taking out each other!&lt;. I am invested in seeing how it ends, but I still think that the show would've faired better with fewer episodes, as at times it feels overstretched.  Idk, maybe I will change my mind when everything will come together.\n\n\nI really like **The Heavenly Idol** (8/12) though. It it so increadibly silly and adorable. It just throws the most random stuff of the viewer, but after setting my suspension of disbelief to the maximum, I am really enjoying it. While there are some explanations that are given to justify the plot, I am more content to giggle at the silliness of every plot point. I am waiting every week to see what will be the next thing thrown at us and will miss the show when it ends. \n\nRewatch \n\n**Mr. Queen** (16/20) : Yes, yes yes. Watching the 2nd time and enjoying it as much as the first! Such a fun ride. This time around, I am planning to watch the 4 special episodes too.",
            "score": 8,
            "author": "ILoveParrots111",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's hard to really feel like a show with a revenge premise can stick a good landing, but I think The Glory does. I know what you mean though.  Even though I liked how it eventually ended, I'm still like, ok... what am I really liking here. lol",
                    "score": 3,
                    "author": "attaboy_stampy"
                },
                {
                    "level": 1,
                    "comment": "I’ve been hesitant on watching The Glory because I love King of Pigs so much and they seem to have the same base premise. I still don’t know if I’ll ever start The Glory, but it’s interesting to hear someone’s comparison between the two, especially about the capacity of the revenge rampage.",
                    "score": 4,
                    "author": "chelleml",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, The King of Pigs was great. I find that both dramas have the same premise, but a very different approach. As I said, I don't think  that The Glory is a bad show. A lot of people seem to enjoy it and it has many interesting elements, but I don't like it's approach as much.\n\nWhat really gets to me is that so many characters are so unequivocally evil, that they seem cartoonish. And this can work in some instances. For example, **Happiness** has many evil characters, but it serves as a juxtaposition to \"zombies\", who are mostly decent in their human form. Imo, it is a clever commentary on many levels. For example, that people trapped in a dangerous situation can be worse than the danger itself. \n\nHere, so many characters are devoid of humanity for so long, that it turned up my suspension of disbelief a notch. At this point, I stopped connecting with the characters or taking what is happening seriously, but I still enjoy the style and the logic behind the revenge. I just wish it had one or two fewer episodes, so the action was more condensed. But, I wouldn't say that the she show isn't worth a shot.",
                            "score": 2,
                            "author": "ILoveParrots111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re hitting all the dramas I love, in terms of the concept of evil lol. It makes sense what you’re saying. KOP and Happiness does better with giving this concept depth and complexity, in the storytelling AND characters, whereas The Glory has just as a solid storytelling as those two, but lacks character depth all-around (and maybe just depth in general), thus making it not much of a compelling commentary on humanity and evil as it sets out to be",
                                    "score": 3,
                                    "author": "chelleml",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You worded it perfectly",
                                            "score": 1,
                                            "author": "ILoveParrots111"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished rewatching “Last Minute Romance”.  Managed to find it on YouTube (had seen it last when DramaFever was still a thing). It’s only two episodes, basically the length of a movie. Female lead has terminal cancer, so decides she is going to hire a lookalike of her celebrity crush so she can “date” him. It’s a cute show, though I definitely recommend having a couple of tissues nearby. \n\nNow just trying to decide if I want to start a new show or rewatch an old one.",
            "score": 3,
            "author": "MaranwaeAmandil"
        },
        {
            "level": 0,
            "comment": "Bulgasal: Immortal Souls I'm currently on ep 6. I'm supposed to watch any comedy dramas on my kdrama list but I saw a tiktok video saying bulgasal's a good underrated kdrama. So I watched it. 🤷🏻‍♀️ Ruining my \"next to watch kdrama\" list lol but no regrets because so far it's good. Kwon nara's so pretty too. 🥺",
            "score": 3,
            "author": "peachsvnset"
        },
        {
            "level": 0,
            "comment": "**Divorce Attorney Shin**. (4/12) Maybe I will like it more when it gets to the main revenge plot but I'm less than thrilled about this one. The random ML+friends moments are some of the best character building scenes I've seen in a long while... but they're doing some heavy lifting. Still, it takes a lot for me to drop a CSW project and it's lightyears better than Sisyphus so...\n\n**Big Bet S2**. (1/8) Lee Dong Hwi posted some spoilers on his IG and now I'm scared to continue. Jungpal!! \n\nFinished **Island S2**. I think I liked it? More like I liked the concept and world building and character design. The story was pretty standard as far as Save the Girl, Save the World plots go. the chemistry between the ML+FL was nice. overall it felt like a nice wide shallow pool. lots of cool stuff but not too much depth. \n\nnothing else in kdramaland is catching my eye. I took a dip in the jdorama pool - liked Dearest a lot but the first half was better than the second. and was super meh on Full-time Wife Escapist. the both sides hiding their feelings part was good but the overall preachiness was unbearable. at some points it felt like Sesame Street for adults teaching people how to be nice as if they had the learning capacity of 5 year olds.\n\nalso whoever at Netflix is giving feedback about english titles... i know apparently we're opposed to literal translations (why tho). but please. just because words may grammatically fit together, doesn't mean they make good titles....",
            "score": 3,
            "author": "dogdogdogdogdogdoge"
        },
        {
            "level": 0,
            "comment": "**My Country** currently. Just finished **Korean Odyssey** going back for some older titles I missed.",
            "score": 3,
            "author": "NoiseyTurbulence"
        },
        {
            "level": 0,
            "comment": "CURRENTLY WATCHING:\n\n* **Call It Love** (6/16)\r\n* **Delivery Man** (4/12)\r\n* **The Heavenly Idol** (8/12)\n\nCOMPLETED: **Scent of a Woman**",
            "score": 3,
            "author": "katherine197_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh I’m watching call it love haven’t seen the recent episodes yet! But I’m enjoying it, what’s your opinion on Delivery Man",
                    "score": 3,
                    "author": "Different_Task_1385",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah I haven't seen the recent episodes either, but Call It Love is definitely my favorite out of the three. \n\nDelivery Man is good, nothing extraordinary but fun and pretty enjoyable to watch. I like ghosts so I had to watch it lol",
                            "score": 2,
                            "author": "katherine197_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completed:\n\n* **The Glory Part 2 (8/8)** — Hot take, but I did not like this drama, which was unexpected to me cause I wanted to. It also has Lee Do Hyun, one of my favorite actors. I thought I would like it. What mostly got to me was the flat acting of the FL. Main characters are important in getting you hooked to the story, but she did nothing for me. At first, I gave the excuse that the character herself is never smiling because of the circumstances. It's addressed in the drama. But then emotional scenes would come, and her face showed nothing. It pulls me out of the drama and it made her character implactless for me. I did like the villains, though. I did ever since part 1, and I still do. Without them, this drama would be uninteresting. Another thing I disliked was the romance. It sucked. Didn't want it, and no one asked for it. Another thing is the pacing. I was so disappointed when part 2 started cause it felt empty when we were promised revenge in part 1. Then when the revenge came, it didn't feel fitting or right? It didn't satisfy me, and it felt like a loooot of plot points had no payoff. 5/10. That 5 is for the ahjumma and Ha Do Young. I don't personally recommend it, though.\n\nCurrently Watching:\n\n* **Vincenzo (18/20)** — Wow, were the last few episodes thrilling. I say this every once in a while when I watch dramas, but Vincenzo might be one of my favorite kdrama characters. I wanted to say favorite, but that's not true. 18 Again and Weightlifting Fairy leads are some of my favorites. But I looove how exciting this drama is. The leads are killing it. Song Joong Ki, Jeon Yeo Bin, Taecyeon, and Kwak Dong Yeon. Brilliant acting. I'm also watching Young Actors' Retreat, and I can see so much of KDY's personality in this character. I also love the Geumga Plaza people. They're such a great group who are entertaining to watch, especially when they get involved in the main plot. The over-the-top shenanigans they get into with the main characters are the best. And can I mention the OST? I think once I finish the drama, I'll listen to it because it's that good.\n* **Kingdom Season 2 (3/6)** — Things are both getting together and also making me sad. I really like this drama, maybe not a lot, but it's a great zombie drama. I think this is an accurate description that I heard: Kingdom is Game of Thrones done right. The supernatural aspect, anyway.\n* **Kokdu: Season of Deity (13/16)** — Can't believe only an episode came out this week. As if I need an extra week of Kokdu. No, thanks.\n* **Taxi Driver 2 (6/16)** — Cause it's been more than a week since last episode, it feels like the drama is coming out at a snail's pace. However, I liked this episode. The case was handled okay (again, not as great as S1, but I'll settle with okay) and the kids are cute. Also, I think everyone saw the ending of the episode coming. \n* **Our Blooming Youth (11/20)** — I'll watch the 12th today, but my goodness is this drama slooow. It's a chore getting through it. I'll endure for Park Hyung Sik, but man is it hard. It's that type of drama where I don't pay attention and I feel like I missed nothing. It's a shame cause I think PHS fits the crown prince role so well.",
            "score": 12,
            "author": "unlikelystory98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree the FL in The Glory is so flat.  However, she's like that in almost all her performances.  I really don't care for her much.  Not finished yet with this series, but you're also right that the revenge shouldn't have to take this long.\n\nVincenzo one of my favs as well.  Every episode was very entertaining although I do feel there was a bit of James Bond vib going between the evil guy and Vincenzo.  Just kill him already, lol!",
                    "score": 3,
                    "author": "Current_Volume3750"
                },
                {
                    "level": 1,
                    "comment": "I enjoyed The Glory immensely but you are right Song Hye Ko was flat as a board. The only time she emoted was the one time she cried in the penultimate episode. \n\nShe has never been a good actress. She always relies on the male lead to do the emotionally hefty work eg, This Winter The Wind Blows and Encounter. The first kdrama I watched was This Winter The Wind Blows so I always have a soft spot in my heart for her because she was so delicate, fragile and pretty. But facts are facts. She has coasted on her looks her entire career and her costars are always more interesting than her in any show she’s in. The bromance between the male lead and his best friend made Descendants of the Sun, Park Bo Gum and Cuba made Encounter and Rain made Full House worth while. \n\nThe Glory role used her flat, dead-inside affect to its best extent because the character is traumatized to numbness and needs the revenge to become whole. The costars carried the show because even after her revenge was complete she was still lifeless.",
                    "score": 1,
                    "author": "metadarkgable3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone's discovering new dramas and having fun but I'm here watching CLOY for the umpteenth time 😍. \nThat being said I read this thread to get recommendations. \nI finally saw Goblin and I think I'm the only one who isn't in love with it. I liked it well enough, but I couldn't see why it's the most popular ever. \nI seem to have a few favourite ones that I re-watch all the time.",
            "score": 6,
            "author": "jsoftpaws",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, do you really need to watch anything else?! Lol. Love CLOY. It’s the GOAT in my eyes",
                    "score": 3,
                    "author": "TheCraneWife_"
                },
                {
                    "level": 1,
                    "comment": "Same, i didn't enjoy goblin. I couldn't finish it.",
                    "score": -1,
                    "author": "Travels_Belly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "after binging **the glory** part 1 &amp; 2, i kinda want to see kim dami &amp; lee dohyun casted in a drama together. i feel like their acting styles are a lil similar, so they’d match each others energy rlly well. kdrama gods, do ur thing 🙏",
            "score": 2,
            "author": "hazyjustajoo"
        },
        {
            "level": 0,
            "comment": "Somehow 18 featuring Minho &amp; Lee Yoobi\n\nIts a short web series with a total runtime of under 2 hours. Stumbled across it on youtube and man i thoroughly enjoyed every minute of it (wish it was a proper drama series). Oddly enough i watched this right after watching 18 Again, the one with Lee Dohyun in it and found that i prefer the plot for Somehow 18. Deals with some heavy topics and ive always loved the time travel trying to save a loved one trope. I give it a 9/10 (also Minho is perfect in this role)",
            "score": 2,
            "author": "mesa9672010"
        },
        {
            "level": 0,
            "comment": "**Unlock My Boss**, because I always thought Chae Jong-hyeop needed a lead role ever since I saw him act in Sisyphus with Park Shin Hye. His acting skills are underrated, he deserves to play a character that isn't just the nice guy who doesn't get the girl :(",
            "score": 2,
            "author": "debboc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been watching this and really enjoying it, it’s quite heart warming I have 3 episodes left. The cast all have very good chemistry! What episode are you on?",
                    "score": 2,
                    "author": "Different_Task_1385",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have one episode left and I'll be watching it tonight! Indeed, there is very good chemistry between them. If you know where I can watch the full set of behind the scenes please let me know because I can't seem to find much on Youtube.",
                            "score": 1,
                            "author": "debboc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I realized last week that amazon prime has kdrama so i am just going through the ones on there.\n\n**Monthly Magazine Home** Liked the setting about magazine writers trying to buy house/apartments. Hated the interactions between the 2 leads. It has the stupid trope of the ML being mean/cruel to the FL as a show of attraction, like they are children. The ending sucked.\n\n**Oh My Ladylord** Liked this one until the ending. It was a real feel good show even though it had a focus on health issues/end of life care.",
            "score": 2,
            "author": "asimplesim"
        },
        {
            "level": 0,
            "comment": "The doctor.  I've lost this one years ago cause i stopped at some point, it made me cry and think a lot. Then I lost it and couldn't find till now so I'm very happy. It's not so much about love, it's more focused on the journey of the main character that had a tough life.",
            "score": 2,
            "author": "cytPandora"
        },
        {
            "level": 0,
            "comment": "Almost finished The Fiery Priest. The last episode tomorrow. I'll be sad when it's over. So good!! Back to The Glory for part 2 when I'm done with the priest.",
            "score": 2,
            "author": "Travels_Belly"
        },
        {
            "level": 0,
            "comment": "Watching\n1. Call it love ? : enjoying the slow burn romance and the bit of the slice of life thing going on. Liking it till now.\n\nThe leads are doing a good job and even the other cast members. Initially felt irritated by the FL but after a few episodes she got on me.\n\n2. Weightlifting fairy kim bok joo: since I was watching call it love?, thought of revisiting this show for LSK and she always has looked so adorbs. \n\n3. The Future diaries : have watched better reality shows and might skip it.",
            "score": 2,
            "author": "Limp-Ad9853",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you watch season 1 of Future Diary reality/dating show?  If so, you didn't like it?  Would be interested to hear your critique.  Too manipulative in terms of structure?  But you must have liked the couple, yes?  Personally, I gave up on season 2 after 20 minutes (but loved first season).",
                    "score": 1,
                    "author": "hhiker70s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was watching season 2. Season 1 I am yet to start",
                            "score": 1,
                            "author": "Limp-Ad9853",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is so much better.  The couple are non-actors without any aspirations to become stars in the entertainment industry.  A chef in training whose goal is to one day own his own restaurant, and a university communications/fashion student.  He is five years older (24 vs 19) but she is at least as mature as him.  Series was filmed in summer 2021 and shown on Japanese TV later that year.  Netflix then acquired broadcast rights, and I watched it in March 2022.  As of early 2023, couple were still dating per their Instagram posts, having long since returned to their humble lives after their brief fame.  This is impressive since she lives with her family in Okinawa and he is from Hokkaido (1350 miles away), though working temporarily in Tokyo.  It's a great story; both of them are wonderful people whom I bet you will grow to love.  Reddit has it's own subreddit called The Future Diary on Netflix.",
                                    "score": 2,
                                    "author": "hhiker70s",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Shall definitely give it a shot.",
                                            "score": 1,
                                            "author": "Limp-Ad9853"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gave it a shot and it so totally worth my sleep. Those two are so adorable and kawai. Really loved takuto san",
                                            "score": 1,
                                            "author": "Limp-Ad9853",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's great.  Glad you enjoyed it.  I was enthralled with the way Maai's emotions showed so emphatically in her facial expressions.  Plus, she was so adorable in that kimono.  Plus the Mignon sweet shop owned by Takuto's family.  The way they met was so cool too.  I could go on and on.  I keep hoping to hear of an engagement.  God bless them!",
                                                    "score": 2,
                                                    "author": "hhiker70s",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Was so good to see them still together. Tbh they are too young to be engaged since she would only be 20-21 right now. I was more amazed by takuto’s kindness. Really was hoping for them to be together through the end. Even when they had to part ways in the later episode, when they first kissed while saying their goodbyes, literally broke my heart.",
                                                            "score": 1,
                                                            "author": "Limp-Ad9853",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes, Takuto is the sweetest guy with a killer smile!  And I want a daughter-in-law like Maai, haha!  TFD #1 reminds me of all the wonderful people out in the world whom we may never meet, but how gratifying to get a glimpse of the two of them on this show...",
                                                                    "score": 2,
                                                                    "author": "hhiker70s",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Truly … I would really want to have a partner like takuto … he gave off so much warmth on screen to Maai, can only imagine how sweet he would be off screen.",
                                                                            "score": 1,
                                                                            "author": "Limp-Ad9853",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh, I love your last comment!  In the last year I have encouraged many friends to watch TFD, but you are the only one who seems to have been touched by it like I have.  That is gratifying for me, thank you.  Whenever I remember them kissing under the fireworks or among the sunflowers I will then think of you, and I sincerely hope you find a partner like Takuto, as you sound like a very caring person.  God bless you... 🌹",
                                                                                    "score": 2,
                                                                                    "author": "hhiker70s",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm currently about halfway through the Korean movie Blind, from 2011, and it's good so far. But it's about a serial killer, so if you're not into psychological horror, this isn't the movie for you. Side note: Park Bo Gum has a cameo of about 1 minute at the beginning. I didn't know he was in it.\n\nI just watched Son Ye-jin as Princess Doek Hye in a movie from 2016 called The Last Princess. I cried a few times for her, it's a very sad story. Son Ye-jin is a great actress.",
            "score": 2,
            "author": "MmaRamotsweOS"
        },
        {
            "level": 0,
            "comment": "Divorce Attorney Shin. Cho Seung- woo is a brilliant actor but I think he was miscast. Someone like Namgoong Min would be perfect for this role jmho.",
            "score": 2,
            "author": "Flipperflopper21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe this role was offered to him too but he chose one dollar lawyer instead.",
                    "score": 2,
                    "author": "soundtrack19999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Should’ve accepted this one then. One Dollar Lawyer has a very similar vibe to The Good Manager.",
                            "score": 1,
                            "author": "Flipperflopper21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finally finished Coffee Prince after putting it off for so long. I’m impressed with how ahead of its time it is, and seeing Gong Yoo’s more nuanced moments reveals the depth of his abilities even earlier on in his career.",
            "score": 2,
            "author": "Ballys_n_Gazelles"
        },
        {
            "level": 0,
            "comment": "No finished dramas this week, taking it slow and debating a rewatch or two.\n\nIn progress\n\n\\- **Kokdu, Season of Deity (13/16):** not a ton of progress although the breakup is coming. While I like the romance and KJH is hard carrying, plot is a lot of things and nothing well developed, same can be said for the FL, which had 0 growth even if ISH is doing her best and chemistry is there. Watchable, albeit nothing to be amazed by;\n\n\\- **Delivery Man (5/12):** same as the previous one, here with the FL, an active Minah, running the show while the ML offers not much and plot still has no precise direction, with stand-alone cases and a background mystery that has a lot to patch up. Fun moments and a bit of dark comedy, but nothing more than average so far.\n\nWith the sole **Divorce Attorney Shin** to add soon and no new drama I'm longing for, it might be time to shed off backlogs or find whatever hidden gem escaped me.",
            "score": 2,
            "author": "Hach-man"
        },
        {
            "level": 0,
            "comment": "I know that I'm late to the game but I'm watching \"Crash landing in you\". \nJust finished The Glory and I've found it awesome!",
            "score": 2,
            "author": "The_Hidden_Spirit"
        },
        {
            "level": 0,
            "comment": "Currently watching hometown cha cha cha, our blues, true beauty and crash course on romance.\nI didn't have much time to watch hometown cha cha cha  previously when it was out. Totally get the hype! \n\nAll the above are so nice to binge watch! Hoping to finish a few of them soon so I can start on The glory.",
            "score": 2,
            "author": "Left_Guess888"
        },
        {
            "level": 0,
            "comment": "**crash course in romance (15/16):** im finishing up the last episode tonight as a reward :) im admittedly kinda over the thriller plot line and had an inkling as to who the culprit is. the moms are very tiring to watch LOL\n\n**the glory part 2 (8/8):**  being sick yesterday and today, i finally finished **the glory**. it was excellent although i do agree that the romance was misfitting. i feel like the majority of cast members got to shine at some point (i’m going to miss oh ji-yul as ha ye-sol; she’s so cute! 🥹). [this scene](https://twitter.com/hhyoguk/status/1634563128775045123?s=46&amp;t=6Ldgey2U8oI43oXog4Qzsg) will forever be cemented in my head. i probably won’t be able to watch dramas for a while because of my upcoming finals, so this was a great one to end with. \n\ni am still stuck on **the interest of love (15.5/16)** because it has become the drama that i watch on the treadmill 😅\n\ni am also currently in search of some good on-air or upcoming dramas to watch during my spring break; i might start watching **pandora: beneath the paradise** since i’m familiar with the lead actress",
            "score": 4,
            "author": "microwaved7shell"
        },
        {
            "level": 0,
            "comment": "Just finished \n.Unlock my boss\n\nWatching \n. Faith,\n.Diary of a prosecutor \n.Ho Goo s love\n.City hunter",
            "score": 2,
            "author": "Entire-Ebb-927",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is Unlock My Boss good? Netflix has been pushing it on me this week.",
                    "score": 2,
                    "author": "attaboy_stampy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thot it was good,\n\nLight,Easy watch,\n\n I didn't get bored ,\n\neven after episode 5 I still  felt like binge watching, \n\nIt was good enough 8+/10",
                            "score": 3,
                            "author": "Entire-Ebb-927"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished part 2 of **The Glory**! I don't think I liked it quite enough to match the huge hype, but it held my interest enough to keep coming me back for more. \n\n(Maybe I just wasn't vibing with it, but the length or pacing felt a little off to me maybe? Like, by the end of the first episode I was SOOO ready for revenge b/c I wanted to see the bullies suffer ASAP, but then it felt like it kind of took a long time for that kind of stuff to actually start happening? =/) \n\nIt was the 3.5th KES drama I've seen (I didn't finish TK:EM), and it was interesting to observe some of KES's (imho) signature writing decisions in a different genre than the other ones I've seen! \n\nAlso slowly chipping away at **Once Again** (32/100) and watching **School 2013** (7/16) and **Oasis** (2/16) !",
            "score": 2,
            "author": "justhaveacatquestion"
        },
        {
            "level": 0,
            "comment": "**the glory part 2** (3.5/8): feels like never ending set up. just bored and underwhelmed",
            "score": 1,
            "author": "teddygi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, ended up dropping it",
                    "score": 1,
                    "author": "Fearless_Cloud_620"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of you will know what I am watching, don't continue reading if you don't want to see a small spoiler. I don't want to hide the whole discussion behind black. \n\n\n-----\n\n\nAnyways, in this drama too there is the poor girl who is so fabulous, and then it turns out that the poor girl of course actually had rich/high class parents. I dislike this trope, because it does not give rise to true equality between the classes, but reinforces the idea that some people are born deserving. \n\n\n------------\n\nIn other news, I have almost finished **Dr Park's Clinic**, which is surprisingly  heartwarming, but I need a break from the cringe humour of watching them do things I just know will go wrong. Will soon watch the last part. The wife was at first written as a stupid stereotype (greedy and stupid), but has been shown to have more qualities, and actually loves her husband. The stupidity affects the husband too, who &gt;!should tell her how is economy really is!&lt;. Only 12 half hour episodes – which is about what I can take. For the dramatically challenged, it doesn't fulfil many challenges. Just the reverse trope with the umbrella, and probably some of the actor challenges. But they ate tteokkbokki!",
            "score": 1,
            "author": "the-other-otter"
        },
        {
            "level": 0,
            "comment": "**Crash Course in Romance (12/16)**  I'm enjoying this more than I thought I would. Though I wasn't really spoiled, I had seen comments that made me think I might have problems with the plot eventually, but that hasn't happened. I just find it very easy to watch. Often I have issues when a focus is on students, finding them too whiney for my taste, but it doesn't bother me here. This was my first time seeing Jeon Do-Yeon and I'm a fan! Though I like Jung Kyoung-Ho in general, I'm beginning to think he uses the same style to portray all the characters I've seen. I've only seen him in PP, HP, CLOY (don't remember him in CLOY, though) and this one. Not a diss, just wondering to myself if I should watch his other dramas to check this out.\n\nMy previous drama was While You Were Sleeping and I think it's funny how many of those actors appear in CCIR.",
            "score": 1,
            "author": "meggktown",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you want JKH in a different role and don’t mind some older dramas Heartless City/Cruel City is a good start. Life On Mars is also amazing. They’re both heavier/darker/more serious though.",
                    "score": 2,
                    "author": "zaichii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, heavier and more serious isn't a problem.  Adding these to my list!",
                            "score": 1,
                            "author": "meggktown"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m currently watching **When the Camellia Blooms** (7/20) and enjoying Kang Ha Neul in this role. He’s so different from the uptight Jang Baeki from Misaeng! Kim Ji Seok (whom I’m familiar with through Monthly Magazine Home with Jung So Min) is good as the SML too but I don’t understand why &gt;! he even married Jessica and had a baby with her in the first place. It seems implausible that she would want to have a kid, and they seem wildly incompatible—surely he knew how self-centered and immature she was before they got married? Scratching my head over this one. !&lt;\n\nNon-Kdrama: I recently finished **The Summer I Turned Pretty** and enjoyed the moms’ storylines over the teenagers. I truly don’t get why anyone would get romantically involved with **major spoilers** &gt;! two brothers. Wtf, Belly?! And why would Conrad be okay with kissing her after he knows she’s been hooking up with Jeremiah?! !&lt;",
            "score": 1,
            "author": "KimlockHolmes"
        },
        {
            "level": 0,
            "comment": "Finally started on the kdramas I've been eyeing. So I'm starting Taxi Driver S2, pretty good so far. Also started to watch The Heavenly idol which is fun.",
            "score": 1,
            "author": "Salt_Ad7638"
        },
        {
            "level": 0,
            "comment": "I just finished the Glory Pt. 2, watching Call it Love, Divorce Attorney Shin (which as been a great transition from CCIR), Oasis, Delivery Man, The Heavenly Idol, and Our Blooming Youth",
            "score": 1,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "Divorce attorney shin, oasis, taxi driver 2 and currently binge watching Island which I am really enjoying and delivery man",
            "score": 1,
            "author": "Fearless_Cloud_620"
        },
        {
            "level": 0,
            "comment": "Taking a break from kdramas to watch You now that all the episodes came out!",
            "score": 1,
            "author": "iandr1"
        },
        {
            "level": 0,
            "comment": "I am only on episode 4 of **Call it Love**, and it is my top Kdrama of 2023 so far. The cinematography and the contrasting of colors are done so well. I love the chemistry between all the characters. I know it’s still early, but I am having to pace myself with this one, it is so hard to do.",
            "score": 1,
            "author": "kiyatylese"
        }
    ]
}