{
    "id": "121esuk",
    "score": 91,
    "title": "Divorce Attorney Shin [Episodes 7 &amp; 8]",
    "author": "lightupstarlight",
    "date": 1679730724.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/121esuk",
    "media_urls": [],
    "other_urls": [
        "https://asianwiki.com/Divorce_Attorney_Shin)",
        "https://asianwiki.com/Lee_Jae-Hoon_(director))",
        "https://asianwiki.com/Yoo_Young-A_(screenwriter))",
        "https://asianwiki.com/Cho_Seung-Woo)",
        "https://asianwiki.com/Han_Hye-Jin)",
        "https://asianwiki.com/Kim_Sung-Kyun)",
        "https://asianwiki.com/Jung_Moon-Sung)",
        "https://www.reddit.com/r/KDRAMA/comments/11humon/divorce_attorney_shin_episodes_1_2/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "https://www.reddit.com/r/KDRAMA/comments/11ocexd/divorce_attorney_shin_episodes_3_4/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)",
        "https://www.reddit.com/r/KDRAMA/comments/11ugqdu/divorce_attorney_shin_episodes_5_6/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/),",
        "https://www.reddit.com/r/KDRAMA/comments/10auhn5/onairtiquette_discussion_etiquette_for_onair/).",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags)."
    ],
    "postText": "* **Drama**: [Divorce Attorney Shin](https://asianwiki.com/Divorce_Attorney_Shin)\n   * Korean Title: 신성한, 이혼\n* **Network**: JTBC\n* **Premiere Date**: March 4, 2023\n* **Airing Schedule**: Saturday, &amp; Sunday, 22:30 KST\n* **Episodes**: 12\n* **Director**: [Lee Jae Hoon](https://asianwiki.com/Lee_Jae-Hoon_(director)) (Run On, Good Manager)\n* **Writer**: [Yoo Young A](https://asianwiki.com/Yoo_Young-A_(screenwriter)) (Thirty Nine, Encounter)\n* **Cast**: [Cho Seung Woo](https://asianwiki.com/Cho_Seung-Woo) as Shin Sung Han, [Han Hye Jin](https://asianwiki.com/Han_Hye-Jin) as Lee Seo Jin, [Kim Sung Kyun](https://asianwiki.com/Kim_Sung-Kyun) as Jang Hyeong Geun, [Jung Moon Sung](https://asianwiki.com/Jung_Moon-Sung) as Jo Jung Sik\n* **Streaming Source**: Netflix\n* **Plot** **Synopsis**: Driven by a personal tragedy, a pianist-turned-lawyer navigates the complex world of divorce — fighting for his clients to win by any means necessary. (Source: Netflix)\n* **Previous** **Discussions**: [[Episodes 1 &amp; 2]](https://www.reddit.com/r/KDRAMA/comments/11humon/divorce_attorney_shin_episodes_1_2/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) [[Episodes 3 &amp; 4]](https://www.reddit.com/r/KDRAMA/comments/11ocexd/divorce_attorney_shin_episodes_3_4/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1) [[Episodes 5 &amp; 6]](https://www.reddit.com/r/KDRAMA/comments/11ugqdu/divorce_attorney_shin_episodes_5_6/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)\n\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on [/r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct), (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/), and (5) [ON-AIR-TIQUETTE (Discussion Etiquette for On-Air Discussions)](https://www.reddit.com/r/KDRAMA/comments/10auhn5/onairtiquette_discussion_etiquette_for_onair/).\n    * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community.\n    Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n\n* **Spoiler Tag Reminder**:\n\n&gt;Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag by writing &gt; ! this! &lt; without the spaces in between to get &gt;!this!&lt;. For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).",
    "comments": [
        {
            "level": 0,
            "comment": "There is something about this drama that is so… I don’t know how to say it. It’s drawing me in despite being overall very calm and NOT dramatic? I feel like each episode is slow and deliberate, with some “filler” that I don’t really mind because I think it helps provide additional character substance, building and progression. \n\nI think it’s because this drama has a very “slice of Life” feel to it but integrated with some “monster of the week” aspects. The storyline weaving reminds me of Extraordinary Woo, and the pacing of the story reminds me of Run On (which makes sense given the director).\n\nI also like that none of these characters fit neatly into any typical archetype boxes. They feel like real  people, and I applaud the cast, writing and directors for that. The trio bromance is also fantastic so far, and I enjoy the growing sisterhood between the two FL’s. \n\nOverall I’m really enjoying this so far and interested to see how it ends. I love dramas that show and don’t tell, and I feel like the ML of this drama is a perfect example of that (again - he feels like a real person, not an actor playing a role).  \n\nOne thing that stood out to me was the ML &gt;!talking about how he was not that close with his sister. Sibling relationships are like this sometimes. You’re close but not really close. Yet you have every reason to be close but you’re just… not. And now the opportunity will never come, and you wonder if things would’ve been different if you had just bridged that gap. If you had taken the time instead of only focusing on yourself. I just get it. I get his reasoning why he’s doing what he’s doing. He loved his sister, they weren’t close, but she still deserves Justice and he wants to give that to her.!&lt; \n\nIt looks like the end of the series will be a big deal with &gt;!the mother in law getting a divorce.!&lt; I do wonder if the &gt;!stepmom will get her comeuppance at all or if the “good” ending will just be her losing Gi-yeong which honestly would be ideal since she clearly doesn’t care for him.!&lt;",
            "score": 35,
            "author": "the-green-crewmate",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know what you mean- here is my take-I feel that this drama is mentally refreshing. It tackles complex life issues and choices we make that are very realistic. The drama is not “dramatic” yet it is by way of it’s subtlety. The “filler” seems to be backstory that is detailed and often times pertinent in later episodes, and other times it adds charm to the characters. Their typical “tropes” and similar plots are absent here- hence the mental refreshment for me. In general/ K dramas are apolitical and don’t overly focus on sex/ relationships so I have gravitated towards them of late. I guess I prefer character and plot contexts over romance 🤣.",
                    "score": 5,
                    "author": "analog_grl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very well put! I am typically a romance gal but as of late I’ve been very much enjoying what kdrama has to offer outside the romcom realm. So far this is definitely up there for me. It’s a nice break and as you said mentally refreshing from what I’ve been watching as of late.",
                            "score": 2,
                            "author": "the-green-crewmate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bromance in this show is the best, keeps making me laugh. Love how the friends make a fuss as soon as they notice he's all suited up haha.",
            "score": 30,
            "author": "silentxarias",
            "replies": [
                {
                    "level": 1,
                    "comment": "real estate dude is so funny LOL loved him in hospital playlist and im glad he's playing more light hearted supporting roles",
                    "score": 17,
                    "author": "Beemeowmeow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha yeah he was great in hospital playlist!!",
                            "score": 5,
                            "author": "silentxarias"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When Hyung Geun and Jung Shik were texting in episode 7, we could see their profile pics next to their texts. Hyung Geun was using the brooding staring-out-the-window photo from an earlier episode, the one that made him \"look tall.\" Jung Shik's was a headshot with what I think is called a manggeon - that traditional mesh headband - and a topknot. Since there's no reason for him to have been dressed like that in this drama, I'm wondering if it's a sly reference to the actor's leading role in the costume drama Haechi (2019). Or perhaps his role in Six Flying Dragons (2015)?",
            "score": 27,
            "author": "be-k-dramatic",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was so good in Haechi!",
                    "score": 3,
                    "author": "Apprehensive_Egg9676"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm 5 minutes into episode 7 and am thinking to myself, *this is so good*.  Not sure I can explain why I like it.  \n\nIt has, so far, none of the usual tropes.  \n\nAll the characters are interesting so far.  There are no side stories that are boring or seem unimportant to the plot.  The show introduces us to a case every two episodes or so, and as usual for that genre, the cases serve to make a point.\n\nThere is no main romance so far and I don't think there will be one.  Freed from this burden, the drama feels more cohesive, as if it's not trying to pull in different directions.\n\nInstead of a romance, we have an absolutely wonderful and uncomplicated bromance of three childhood friends who deeply care for each other.  They mostly use this relationship to lighten the mood, which otherwise might be a bit grim.\n\nWhat I love about bromances, is that I don't need to worry about the unavoidable breakup somewhere near the end of the series, which all dramas seem to feel compelled to do.\n\nOne of the things that I appreciate is that the show assumes the viewers are intelligent and do not need to be hit over the head about each plot point, or reminded of what happened 15 minutes ago in flashbacks.",
            "score": 72,
            "author": "Martine_V",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe there might also be a friendship turned into romance later between the ramen shop lady and the guy who had sent the stroller. I love your point about it not having the usual tropes and patterns. The refreshingness and moments of light heartedness and humor makes this drama so underrated. I wish more people are watching and commenting on it.",
                    "score": 26,
                    "author": "gwenzhong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I totally agree with you that this show seems underrated.  \n\nI think you are right about the possible romance.  But when I said I wasn't expecting romance, I meant the main character.",
                            "score": 4,
                            "author": "Martine_V"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The most romance I think we'll see if an open ending with the leads maybe going on a first date like when it ends and he's gotten the closure he needs. They gently hinted at it today with her friend asking if he was single and giving her a knowing look, lol. But there's not enough time, and he is focused on something else entirely.",
                    "score": 12,
                    "author": "klmnumbers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If there was to be a romance they would have introduced her to us at this point in the drama, and there would be some hints that there is an attraction.  So far he has shown zero attraction to anyone, save for some kindness for the ex-DJ.  Maybe you are right.  But I don't feel the drama needs it.",
                            "score": 7,
                            "author": "Martine_V"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with essentially everything you wrote- I will say that the originality of the show pulled me in. Also- I feel that some of the cultural contexts- ie. When the other attorney- Choi? asks the paralegal and secretary “are you really curious?” And the response is “like George”, I chuckled at that. It surprises me how often American pop culture or past culture is referenced in these current programs. As an aside- I do gravitate towards plots where the underdog tends to be victorious. So I’m hoping that will be the case here. I also sense a character full of respect of all walks of life- in Attorney Shin. This is something that not all leads tend to demonstrate.",
                    "score": 6,
                    "author": "analog_grl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Talking about underdogs, I'm watching a drama right now which fits the theme.  It's called Lawless Lawyer.  It randomly appeared as a suggestion, I assume because I am watching this drama.  I am really enjoying it so far, and it has displaced other dramas I had been watching.    It's not dissimilar to Attorney Shin in the theme, but very different in the tone.  In Lawless lawyer, the ML is a kick-ass gangster-turned-lawyer.  It's a revenge-type drama.  He seeks to bring down a town filled to the brim with corruption at all levels.  They were responsible for the murder of his mother.  \n\nIt's not smart and subtle, but I'm enjoying it.  I like the ML's unusual looks. He makes me think of an elfin Korean. I believe he was in Flower of Evil.  The FL was in It's Okay not to be Okay.  It's a good pairing.  There are hints that there might be a romance eventually.  The ML seems to care for her already a great deal, due to the usual past connection, which I won't reveal, not to spoil it.  She, on the other hand, does not like him, but I think he is quickly growing on her.",
                            "score": 2,
                            "author": "Martine_V"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I do gravitate towards plots where the underdog tends to be victorious.\n\nYou are right that those plots are very compelling",
                            "score": 1,
                            "author": "Martine_V"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Great summing up",
                    "score": 4,
                    "author": "Silk007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sorry but I laughed loudly at the “naturally ugly” comment 😂",
            "score": 20,
            "author": "MartyCosmos31"
        },
        {
            "level": 0,
            "comment": "Loved today’s episode! \n\n1. Anyone caught the part when the group were discussing how to promote Shin and he tried to nudge SJ but she saw it coming and lifted her hand to avoid it? A very subtle way to show how comfortable and familiar they are with each other now.\n\n2. The noodle shop scene has got to be my fav. First to see the 3 of them together shows how they have welcomed Choi into the group.\n\n3. When Choi was waxing lyrical about Shin’s piano performance, GH slightly leaned back, allowing Shin to shove the pickle inside Choi’s mouth. Small actions like this show how tight their bromance is and that they can anticipate each other’s actions.\n\n4. Love the part when Shin wanted to leave and the noodle show lady asked ‘aren’t you gonna finish this?’ And he straightaway sat back down. Such a smooth and natural action. Also shows how much respect they are giving her as well, given that in the first place they were suspecting if she can cook as well as her mother. \n\n5. And not forgetting when she was trying to bring up the piano piece’s name, GH was the one correcting her. Like he knew exactly when she was trying to say, how well he knew her already. \n\n6. I’m really glad that the MIL looks to be a positive character despite her cold exterior, and is helping Shin and GY spend time together. When YJ called her to inform that she’s picking up GY, I can only guess she’s in the spa and didn’t not pick up the call and YJ only left a voicemail. Can’t imagine MIL allowing YJ to pick up GY!\n\n7. Also interesting to see JS’ reaction to Park. He immediately lent his car and even volunteered and drove to Haenam with GH just to help to crush Park. \n\nReally their bromance is too good to be true! Love it!",
            "score": 20,
            "author": "12amonreddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "For point 7, JS is willing to do anything to crush Park since &gt;!he was the one who introduced him to Shin's sister as a divorce lawyer.!&lt;",
                    "score": 7,
                    "author": "cors8"
                },
                {
                    "level": 1,
                    "comment": "&gt;2.\t⁠The noodle shop scene has got to be my fav. First to see the 3 of them together shows how they have welcomed Choi into the group.\n\nI love that the bromance is being extended to Choi Jun too",
                    "score": 6,
                    "author": "Electronic_Piano9385"
                },
                {
                    "level": 1,
                    "comment": "This show is chock-full of subtleties and excellent acting.  I am having to listen to each scene once to read the subtitles and then listen a second time to observe all the subtle micro-expressions.",
                    "score": 5,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel the same way with all Cho seung woo works! This guy seriously made me regret for not knowing korean. I highly recommend checking out his other drama (stranger is a must watch) and movies and musicals.",
                            "score": 6,
                            "author": "throwawaymisfortune"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1.Also ssh's proud 'see I am cool' look after they watched him playing piano, when lsj looked up at him and then tried to keep a straight face and obviously failing to do so. His detailed, subtle acting is so fantastic and natural.\n\nI feel the same about all your points!",
                    "score": 5,
                    "author": "throwawaymisfortune"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Episode 8**\n\nHaha, I totally cracked up when he described himself as an idol-like stud, and his friend is nodding along, while the girls were trying hard not to roll their eyes.\n\nI think that Attorney Choi might be one of my favourites.  I love his role of completely transparent double-agent. He tells both sides everything.  \n\nHis face when Noodle lady tells Shin about her mother's reaction ...\n\nHis accurate description of the piece that Shan played ... I sensed a deep melancholy from your street performance.  Some deep dark anger, some deep-rooted sorrow ... his lovely and accurate description is interrupted by Shin stuffing his mouth with food.  He has an ear for music, clearly.\n\n*How did Park Yu-seok look?  Like a cotton swab with half the cotton missing*... lol.  \n\nI just loved that whole scene.  The faces of the boys.  The way that Shin tries to escape and abruptly sits back down after a sharp \"Aren't you going to finish that?\"\n\nDo they use the same preacher's voice for all dramas? In that scene where they are in church, the voice sounded a lot like other dramas I saw that had a preacher's voice.    \n\nI can't wait to find out what Attorney Park did that caused Jung Shik to hate him so much and for Attorney Shen to call him a fraudster and con artist.  My theory was that he was bought off by the other side, and acted against his client, but they can't prove it.\n\nLoving the grandmother more and more each episode. &gt;!But I hope she is not rejecting her granddaughter because she hates her mother.  Hopefully, it's just that she couldn't take her along because her plan was to give her grandson some alone time with his uncle. But you could tell that the evil stepmom took it as a snub.!&lt;  If it wasn't for the fact that the kids would be upset, I am wishing for a piano to fall on her head.\n\nLooks like the case won't wrap up this episode.  &gt;!What will the fact that the baby is not his son change?  And how will it help him regain his honour?  Will public opinion turn in his favour? To my western eyes, the fact that he is accused of beating her seems the worse offence.  Although we know that he didn't actually hit her.  So either she is faking the injury or someone else hit her.  But we aren't getting any hints about how this will be resolved in the preview.!&lt;\n\nAnother strong episode.  Can't wait for next weekend.",
            "score": 13,
            "author": "Martine_V",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I can't wait to find out what Attorney Park did that caused Jung Shik to hate him so much\n\nI think it's due to what we see in the flash back scene &gt;!JS tells Park \"Daenam fired all the other attorneys\" Shin's sister tried to hire ... so I'm guessing that Daenam/KeumHwa bought off Attorney Park and therefore ruining her divorcee and then that leads to her accident.!&lt;",
                    "score": 10,
                    "author": "NewtRipley_1986",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I think too.  He kept her as a client but worked against her.",
                            "score": 3,
                            "author": "Martine_V"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would think the first step is to confirm the baby isn’t the guy’s flesh and blood, then build the case why she so adamantly wants to divorce and bring the baby back to Vietnam, so much so that she could be giving false testimony. Remember Saturday’s ep, Shin and his friend felt something amiss regarding her supposedly shielding the blows and hurting her arm?",
                    "score": 4,
                    "author": "12amonreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, it's clear that she wasn't hit by her husband, so I wonder if she is either faking it or someone else hits her.\n\nI was just wondering if \"regaining his honour\" was tied to proving the baby wasn't his.  The preview only gave us those two clues and nothing about proving he wasn't an abuser.  But then, they are only previews, so nothing conclusive can be said about them.  Maybe determining the paternity is just a step in this process of proving he is not the abuser.",
                            "score": 3,
                            "author": "Martine_V"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "do u know the song that played in ending of ep8? cant get it out of my head",
                    "score": 1,
                    "author": "Critical_Excuser69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just came out today, it’s called Tolerance by AnTasWell and VVON.",
                            "score": 3,
                            "author": "lazy-teal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah I finally caught a lost-in-translation, feeling proud lol\n\nWhen hyeong geun and Jung sik were inquiring about his suit, Jung sik wasn't saying rhyming words for shit or sink. He said \"Ji ral\" (you are lying) and when sung Han caught that jjs tried to deflect by saying he will make an acrostic poem out of it. So he sang \"jiggeum ee sungan\" for \"Ji\". Coincidentally, jiggeum ee sungan (this is the moment) song is related to the ML Cho seung woo, he popularized the song and also rejuvenated korean musical with his spectacular performance in jekyll and Hyde and many more.",
            "score": 14,
            "author": "throwawaymisfortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel so sad that so much goes above my head, not speaking Korean.  I am still struggling to learn Hangul so very very far from even basic understanding.",
                    "score": 10,
                    "author": "Martine_V"
                },
                {
                    "level": 1,
                    "comment": "and to get the \"jiggeum ee sungan\" one has to know about Cho seung Woo background and how big he is in musical theatre. His entire family is from musical theatre. I looked at his performances on youtube . so awesome! that is the song he is well known for!",
                    "score": 6,
                    "author": "Zealousideal_Agent_7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should listen to another song **as flowers bloom and fall**, the song soaks in his emotions.",
                            "score": 2,
                            "author": "throwawaymisfortune"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "omg i picked up this drama because i was bored and out of options but im now so invested and absolutely HOOKED! I love the the ML so muchhh he is such a capable lawyer and the rest of the supporting cast is perfection!!! I love how he has so many good people in his corner and they are putting up such a great fight against those keum hwa assholes hehe! \n\nI really dislike Gi Yeong's step mom omg she is such a b\\*tch! The way she sneers at others in that superior manner...ew! I love how grandma is stepping up her game as well to keep the stepmom in check HAHA but i feel so bad for gi yeong cause he cant even enjoy his play time with uncle. I hope goodness prevails!",
            "score": 13,
            "author": "Beemeowmeow"
        },
        {
            "level": 0,
            "comment": "I think that’s why I like it too, none of the usual tropes, and a great bromance.",
            "score": 9,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "Wish the 2 boys (his nephew, her son) could meet and really bond, maybe when camping!",
            "score": 8,
            "author": "Silk007",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's likely to happen as the boy mentioned he wanted to come along.  My prediction is that this will happen in the last part of the last episode after the central issue of the show is resolved.",
                    "score": 5,
                    "author": "Martine_V"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Episode 7 &amp; 8 \n\nDecided to watch them back to back, not sure I'll do that again, it's a lot to take in.\n\nI'm going to say it again but I LOVE the friendship of Shin, Hyeong-Geun and Jeong-Sik - I do feel like they really nailed that. There's affection, caring, teasing, harassing - all the things friends do to each other. \n\nMa Geum-Hee is a force to be reckoned with and I don't think her daughter-in-law understands that. Neither does her husband.&gt;! I liked what she said at the end of episode 8 - deciding to stay because things were getting interesting. !&lt;I would not want to cross this woman. \n\nJin Yeong-Ju &gt;!seems a bit dumb and I really feel like she doesn't know that a shit storm is coming and it's going to dump all over her. At some point in the next 4 episodes and at a critical moment, Shin is going to use the fact that she was the last person to call/speak to Ju-Hwa just before her \"accident\". !&lt;\n\nI knew there was something up with the latest case (I thought maybe there was someone with more money in Vietnam waiting for her to come back) and &gt;!happy that by the end of episode 8 Shin is going to get a paternity test done on the son ... we all know it's not Ma Chun-Seok child. And when that comes to light, I wonder what will happen to Park Yu-Seok.!&lt;\n\nSpeaking of Park Yu-Seok -&gt;! wow Jeong-Sik is really deep in the guilt and it will be interesting to see how this plays out. Also what will happen to Choi Jun if PYS loses this case .. meaning, will KeumHaw Law hire him back??? I doubt he would go, I think he really likes work with Shin and at that office.!&lt;\n\nI don't have a good vibe on the Jo Min-Jeong case - &gt;!clearly her hubby is a bit shady (lying about his niece being his daughter - wtf). I hope it works in her favour and that she can get back on track with treatment. !&lt;\n\nCan't believe there are only 4 more episodes left. &gt;!I kind of sense that at the end Lee Seo-Jin will have her morning show back. !&lt;",
            "score": 5,
            "author": "NewtRipley_1986"
        },
        {
            "level": 0,
            "comment": "Ep 7\n\nI love how the viral video came back into play, and that piece of music served a purpose in the ongoing divorce case.\n\nOh JJS, &gt;!poor guy’s still haunted by his guilt that he was the one who introduced PYS to SSH and his sister.!&lt;",
            "score": 7,
            "author": "Usual-Return1760"
        },
        {
            "level": 0,
            "comment": "oooh looks like Shin will pull another stunt in the next episode.  It should be fun.",
            "score": 5,
            "author": "Martine_V"
        },
        {
            "level": 0,
            "comment": "OMG, these ajhussis are soooo clueless and have no game. It's so tragic and endearing at the same time.",
            "score": 6,
            "author": "SnooGeekgoddess"
        },
        {
            "level": 0,
            "comment": "Did anyone notice the lack of ppl in this drama?",
            "score": 6,
            "author": "throwawaymisfortune"
        },
        {
            "level": 0,
            "comment": "God i am so on edge for the confrontation between Shin and the woman who basically killed his sister 😬😬\n\nEP. 7: that smile on Seo-jin's face when Sunghan walked in all suited up? It could either be that she's just happy for him... Or maybe she liked what she saw 😳😳 (pls let me ship them, ik nothing will happen)\n\nI like how supportive and caring all the characters are. Obviously the sad ahjussis are always on call whenever someone is going through something, but the noodle shop lady is the MVP. I love how she comforts first Honggeun and now Seojin when she's going through a rough patch. Just a really good friend. \n\nAlso *everyone* at the Sunghan's office has a strong but quiet bond. Did anyone else notice how Saebom just slid some orange into Honggeun's mouth? And they're always joking and playing around. It'd a big difference from how cold and sterile the antagonists' firm is.\n\nSpeaking of the antagonists, God, I want Sunghan to wipe that smug smile off evil Stepmom and her henchman's faces so badly. And it's be so cool if the sister's ex-MIL also joined up with Sunghan. Hopefully this Vietnamese immigrant case will achieve both of these...\n\nEP. 8: I feel like a lot of things happened but also nothing did. The previews promised a big confrontation and comeuppance... but nothing of the sort came to pass. It felt like a very half hearted, cursory examination of what happened in the village on the part of the show. And tbh I don't really like the main case, it feels very gross towards immigrants, esp considering how immigrants, women and immigrant women are treated in SK already.\n\nHopefully, next week, we'll see how Sunghan actually take on evil Stepmom and her loyal dog. As usual, evil Stepmom made my blood boil. Fingers crossed, the ex MIL does team up with Sunghan, she seems to have atleast some morals.\n\nIt's cool that Seo-jin's character development do be happening and the case with the schizophrenic lady is progressing. I wish that got more time spent on it, it felt more interesting imo. We honestly barely got more than a brief sketch of what that awful man was going to his wife.\n\nObviously Shunghan was being a bit obnoxious, but why did everyone laugh at the idea of him being a hottie lol? 😭😭 \"You know you're not that hot right?\" 💀💀 Are we talking about the same man??\n\nalso who is noodle shop lady crushing on? sometimes I feel like it's Sunghan, but PV seems to show divorced ahjussi?",
            "score": 16,
            "author": "AlfredusRexSaxonum",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;tbh I don't really like the main case, it feels very gross towards immigrants\n\nIt does feel insensitive that the drama included immigrant plot in a negative way when they could have gone other way and showed them being oppressed. The thing is, nationality comes first and any media would prioritize their own countries and try to show them in a good light. After all, entertainment falls under soft power too. \n\nThe plot isn't uncommon either. A lot of immigrants marry other nationals mainly as an option to escape and make their lives better. \n\nAnyway, the drama could have used the same case without involving immigrants. So I agree with you. \n\n&gt;Are we talking about the same man??\n\nHaha maybe we are talking about Cho seung woo xD",
                    "score": 10,
                    "author": "throwawaymisfortune",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting. I didn’t think about “soft power” or what I refer to as the “censors” as far as nationality and making the victim the SK man. When I watched the episode I felt like the husband and wife were both vulnerable. He fell in love with a younger woman he pitied with regards to her life in Vietnam, and she was suffering also from her life. My lens will be different as not only am I American- I am a native South Floridian- raised in a very culturally diverse environment. So it makes sense I would interpret with my lens- and I also appreciate your comment as it opened my eyes to something I wouldn’t have seen/ considered. I guess I felt that the Wicked step mom attorney led the Vietnamese woman into making false claims, as she planned and wanted the social media backlash- hence  why she gave the husband who wanted to “fix” the marriage Attorney Shin’s card. I now understand, that Immigrants in SK suffer as Immigrants in the US did back in the day.",
                            "score": 4,
                            "author": "analog_grl"
                        },
                        {
                            "level": 2,
                            "comment": "I see that the drama tried to take a different angle because the public tends to victimize immigrants, which is no less problematic because it creates the binary of Koreans being strong and immigrants being weak. Immigrants are quite resilient, smart, and well aware of what they are sacrifying for a better life. Despite the immense difficulties, it would be wrong to assume that they are naturally oppressed. \n\nThat being said, I still wish immigrants are portrayed differently. The actress who played Dinh Thi Hoa is even a certified translator for prosecution service. It's interesting to see her playing a Vietnamese woman who doesn't understand much Korean.",
                            "score": 3,
                            "author": "sentaku0117"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "eee i was soo annoyed by their confrontation in ep 8 outside of his house because she was hella obnoxious, the way she claimed her territory over giyeong!!!! argh i cant wait to see them fight it out",
                    "score": 6,
                    "author": "Beemeowmeow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anybody who watch this, is it good ?",
            "score": 15,
            "author": "Royal_Front2038",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like it. But then again, I like anything Cho Seung Woo is in.",
                    "score": 35,
                    "author": "suchfolly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love him too, but I got bored with the cases. His character is great and the setup is great and he's as wonderful as usual. Maybe I'll try again.",
                            "score": 4,
                            "author": "silverpenelope"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It gets better. The 3 \"losers\" are great friends. The stories of each case are interesting if uneven. So far, it's maintained my interest till now. Not great at first but it grows on you and it's kept my interest so far.",
                    "score": 18,
                    "author": "bellaella"
                },
                {
                    "level": 1,
                    "comment": "I’m hooked for now. The main plot isn’t really well defined yet, so some things are still up in the air. However, I am really enjoying the characters and the cases. The one area that is not working for me is the build up of the villains, that part feels too contrived to me. Still, I will probably watch it to the end just for the growth of the various characters.",
                    "score": 10,
                    "author": "forforf"
                },
                {
                    "level": 1,
                    "comment": "I have, it's really good. It's funny, the soundtrack is one of the best, characters are good. You won't regret it!",
                    "score": 9,
                    "author": "Curious_Eren"
                },
                {
                    "level": 1,
                    "comment": "yes!  it's kind of a feel good drama, with an element of mystery. not as great as the other lawyer/attorney dramas but definitely worth a watch!",
                    "score": 6,
                    "author": "Intelligent-Algae199",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "also it's really funny 😂",
                            "score": 10,
                            "author": "Intelligent-Algae199",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Comedy eh, that the trigger for me Hahahaha",
                                    "score": 2,
                                    "author": "Royal_Front2038"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I watched the first 2 episodes when they came out and thought it was decent but haven't really felt the urge to go back for more. Usually I'm waiting for new episodes of shows I like but with this it's more that it pops up in my lists with new episodes, consider it for a sec then watch something else.\n\nIt wouldn't be the first time I've done that with something that ultimately turned out to be very good though lol.",
                    "score": 3,
                    "author": "Scotsmania",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I tend to be a \"grazer\" of shows too.  But this one made me come back for more",
                            "score": 6,
                            "author": "Martine_V"
                        },
                        {
                            "level": 2,
                            "comment": "I feel you in the first few eps. But slowly the bromance drew me back to the show. I just wanna see what others antics the friends can come up with. A lot of shows these days are about female friendships so this bromance is a breath of fresh air!",
                            "score": 2,
                            "author": "12amonreddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "right! the chemistry of the friends and supporting cast really pulled everything together for me! so good",
                                    "score": 2,
                                    "author": "Beemeowmeow"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "to be fair the first 2 episodes were kinda lukewarm for me too but as we move into the meat of the plot it starts to get interesting as we learn more about the ML's ongoing family problems! The other cases start to get quite good too though they are all civil/family/divorce-related cases (since he is a divorce attorney) so it might not be everyone's cup of tea.",
                            "score": 2,
                            "author": "Beemeowmeow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amazing series. Must watch.",
                    "score": 4,
                    "author": "man2809"
                },
                {
                    "level": 1,
                    "comment": "i've really enjoyed it so far and haven't got bored on any of the cases tbh. The bromance carries the show. It's a nice show to unwind and watch after work on a weekday tbh, funny enough that it airs on the weekend.",
                    "score": 3,
                    "author": "ocean_800"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am watching and like it. But it is currently the only new show that Netflix is offering in the Kdrama content. So I am rewatching Inspector Koo just to have something to watch during the week.",
            "score": 4,
            "author": "Educational-Glass-63"
        },
        {
            "level": 0,
            "comment": "Am I the only one who's struggling to find the meaning of this drama?\n\nEps 1 &amp; 2 started SO strongly with FL's divorce case! Ep 3 &amp; 4 were ok, eps 5 &amp; 6 went down and this ep is just a royal mess??\n\nThere's less of law (hell, Ep 7 has 0 law in it), the bromance is good but is that all there is? It's very unclear what the role of FL is? There's no growth for her here although I like how the noodle shop owner and her are bonding.\n\nWhile the slice of life moments are brilliant, the whole family conflict is SLOW. VERY SLOW. And tedious. The main attorney from their end (who's also EAW dad i think?) is boring AF.\n\nI really, really want to like and root for this drama but I'm finding very less reasons to :(",
            "score": 5,
            "author": "noideaabout",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is not exactly a law drama, I think it falls under literary fiction. The genre is character and theme based, not plot based, and focuses on storytelling style. \n\nSo far the drama is exploring the characters that do not fall under the conventional tropes, they feel close to real people. \n\nThere aren't many court scenes or detailed law scenes either like the usual law genre, the drama is focusing on detailed backstories to indentify root causes of divorce. Procedure or end result isn't the important thing here but the causes and effects are, as a subtle commentary on divorce. \n\nMaybe literary fiction isn't your type or maybe you could try to adjust your expectations.",
                    "score": 13,
                    "author": "throwawaymisfortune",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MDL listed this as \"Law\" and eps 1 &amp; 2 started off strongly with this theme. Those are still my favourite episodes.\n\nI'm just trying to figure out what the genre actually is. If it's just meant to be a slice of life drama where the law bit just happens, it's done well. In this week's eps, it just slid to a lot of drama and it felt very messy to me. Eps 5 &amp; 6 were also good if I think about it again - some amount of law, some amount of story unravelling, good amounts of slice of life!",
                            "score": 1,
                            "author": "noideaabout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually the genre I listed is common with literature. Drama/movies mostly follow genre fiction (plot and trope based; romance, thriller, mystery, etc)\n\nThis drama has a touch of literary fiction and does not exactly fall in either genre. Despite some issues like the ones you mentioned and more, I would say both the writer and esp the actors are doing a very good job here.\n\nI forgot to mention, literary fictions are generally slow and not 'suspenseful' or 'dramatic'.",
                                    "score": 2,
                                    "author": "throwawaymisfortune"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not a courtroom drama, no. This appears to be an improved attempt on Thirty-Nine, another semi slice of life, light hearted melodrama on singlehood. \n\nThirty-nine's lead cast, however, was female, and it had the same kind of strong friendship theme going on for it - except that the true lead was Jeon Mi Do, and not Son Ye Jin. \n\nSo Shin takes on cases that matter to him,  but that's not what his life is all about. He listens to trot, goes glamping with the guys, and loves his nephew, his only remaining family. He's got more than the law.\n\nBased on the back stories I get the sense that maybe they built it up to be maybe more than 12 eps, and then they scaled it back. We have a back story for Kim Sung Kyun (the paralegal), but not Jung Sung Moon (the realtor). We also don't know too much about Shin's piano OR law background. \n\nThe female lead is an enigmatic character. Perhaps she's meant to portray someone who survives past divorce, adultery, and getting canceled. This part of the show was a hard sell for me, but I get the intention.\n\nIt's also dragging its feet on the sister's story, I give you that. I'm waiting to learn more about why Shin changed his entire life's path for her.",
                    "score": 5,
                    "author": "StunningPast2303",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; It's not a courtroom drama, no. This appears to be an improved attempt on Thirty-Nine, another semi slice of life, light hearted melodrama on singlehood.\n\nI just wanted to know if it's this. Because the first 2 eps started out strong and that's the tone the show set for me.\n\nIn that case, yep, they need to build up more on the sister's story and also give FL a bit more screen time and a more concrete ...arc?\n\nThe slice of life scenes are so well done, I love it!",
                            "score": 2,
                            "author": "noideaabout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not meant to be a courtroom drama at all.  In fact all the cases save the first one, did not end up in court, but rather in mediation.  The cases are not the plot but are there to serve the plot.",
                                    "score": 4,
                                    "author": "Martine_V",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's fine, MDL lists it as \"Law\" so I did expect a good bit of law. Eps after 1&amp;2 had very less of it and just more drama. \n\nI just felt misled.",
                                            "score": 2,
                                            "author": "noideaabout",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those ratings are fairly approximate",
                                                    "score": 2,
                                                    "author": "Martine_V"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know the kpop rap ost at the end of episode 8?",
            "score": 2,
            "author": "Impressive_Ad_4112"
        },
        {
            "level": 0,
            "comment": "Anyone know what the ending credits song is on episode 8? I searched Spotify but didn't find it. Google and Siri don't recognize it either. I think I have heard it in previous episodes as well. If there is a resource for OST lists for current dramas, please let me know. Thank you.",
            "score": 2,
            "author": "emberpyro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe they played that at the end of either episode 4 or 5 as well, and I just re-watched the credits to episode 8 and there's an OST listed for VVON 'Tolerance' but it hasn't been released yet (nothing on Shazam, Spotify or Google). Maybe they're releasing it at the end of the series.\n\nVVON only has three songs on Spotify (Canada). I really hope Tolerance is released because I'm loving it.",
                    "score": 6,
                    "author": "NewtRipley_1986",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much! I just started following VVON on IG. I also hope it gets released. I like some of the other songs too in the drama but really liked this one. Very chill. I love the vibe of the song.",
                            "score": 3,
                            "author": "emberpyro"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, episodes 5,7,8.  Came here to find the song name also.",
                            "score": 3,
                            "author": "RMrsR"
                        },
                        {
                            "level": 2,
                            "comment": "You’re right! It finally came out today https://youtu.be/hRJWzkK0ZS0",
                            "score": 2,
                            "author": "Zczarcastic1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yay!!! Thanks for posting the link.",
                                    "score": 2,
                                    "author": "NewtRipley_1986"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have to say these Vietnamese bride sub-plot is the one I have enjoyed the least. Most of these older men marrying young foreigners, rarely are based on good intentions of the men, and the women are most likely to be victims of abuse. Reversing it and making the older Korean man the victim is wrong. \nI think it is more about the anti feminism and looking down of Vietnamese women. The old farmer is not a sympathetic character to me. \n\nI never trust Kdrama depictions of non Koreans. The actresses playing the role is likely Korean.",
            "score": 2,
            "author": "Mysterious_Bill704",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reversing it to show that men are the victims isn’t wrong either. You probably haven’t been through or seen enough in life. These women from third world countries CONSENTED to the marriage/selling themselves for whatever reasons. And then some of them end up dragging their entire villager’s and their problems to the foreign men they marry.",
                    "score": 7,
                    "author": "LaneigeSnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Selling themselves? That is a horrible and prejudiced characterization. \nMost men who go abroad specifically for finding a wife, whether it is Korean men going to Vietnam or American men going to Russia, are going because they are not a “catch” in their own country, could be because of age, class, income, looks or a host of reasons in their own country with local women. \nIn addition, these men want a relationship where they have all the power and can control the women financially, physically and sexually. \nThese men are mostly misogynistic, patriarchal and abusive, they likelyhood of them being victims is low.",
                            "score": 2,
                            "author": "Mysterious_Bill704"
                        },
                        {
                            "level": 2,
                            "comment": "Here is a CNN article highlighting the suffering of Vietnamese wives in Sk\n\nhttps://www.cnn.com/2020/08/02/asia/foreign-wives-south-korea-intl-hnk-dst/index.html\n\n“The statistics paint a grim picture. More than 42% of foreign wives reported having suffered domestic violence -- including physical, verbal, sexual, and financial abuse -- in a 2017 poll by the National Human Rights Commission. By comparison, about 29% of South Korean women surveyed by the country's Ministry of Gender Equality and Family last year said they were victims of domestic violence -- again including a range of forms of abuse.”",
                            "score": 2,
                            "author": "Mysterious_Bill704"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have to admit I started watching this show with controlled enthusiasm; I love Cho Seung Woo I’m a fan, I do believe he’s the best Korean actor and one of the best in the world (and I’m bitter about the fact that I won’t be seeing him as a the Phantom of the Opera now) but his last drama was such a disappointment for me that i decided to take things slow with this new show, even if the plot and the cast were promising.\n\nI felt the first episodes were as bit all over the place though still very funny and interesting but it isn’t until these last two episodes that I can say publicly: I’m liking it a lot. The friendship between the three guys is just fantastic, the middle age-ness is played so superbly! And the three have such different personalities! All the cast give detailed acting and it’s so life-like that I can’t help but rewatch certain parts.particularly the singing bits, I laughed a lot with the impromptu singing session between los tres amigos, the Brother Tes part (some of us have done the dancing and acting the song when working, admit it) and absolutely love SSH singing Heartless Blues…actually for a couple of seconds there I think CSW forgot he was supposed to sing horribly out of tune.\n\nNow, honestly the personal drama of SSH definitely started to looked up when the MIL came into play. Also, I’m just liking the FL a lot, I appreciate that her story wasn’t forgotten as soon as her divorce was finished and that her character is being well developed… I DEFINITELY wouldn’t mind if at the end of this drama the leads would consider to date each other, I think they have potential and chemistry and there has been lingering looks and details between them that I would be surprised if that happened.\n\nI also like that the people SSH ends up representing are usually the ones who, in the eyes of others, would be most at fault for their divorce (the cheating wife, the aggressive daughter in law, the cheating man who needs a transplant, the old man who “buys” an immigrant woman) and isn’t apologetic about their faults but rather offers a different side of things. I’m very interested in the way this last case will be solved. \n\nMy main problem with the show is that it feels that it takes it sweet time to set up the cases and they end up being solved almost in a flash and not exactly by legal strategies. That and the SSH’s ex brother in law and his new wife, they just seem like empty people and I would have liked a bit more development there.\n\nAlso I find it so fascinating that some people think the first two episodes were fantastic while others think there were lukewarm at best. Such different POV’s!\n\nI can’t wait for this weekend episodes! And I want to know the previous Ramyeon House owner!",
            "score": 1,
            "author": "lazy-teal"
        },
        {
            "level": 0,
            "comment": "Can someone tell me the song that's there at the end of episode 8? \n\nThe song starts at this time-stamp: 59:20",
            "score": 1,
            "author": "sabiqsabry48"
        },
        {
            "level": 0,
            "comment": "Someone please tell me the sad song he keeps singing and was playing over the phone with the client. 😅\n\nGoogle, or my use of it, fails me.",
            "score": 1,
            "author": "ISellAwesomePatches",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heartless Blues by Kang Seung-Mo!",
                    "score": 2,
                    "author": "telonelypotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're a star thank you. \n\nJust what I needed after a difficult day. Only wish it was in English so it was easier to wail along to. 🤣",
                            "score": 1,
                            "author": "ISellAwesomePatches",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're welcome! At this point I'm trying to learn the lyrics in Korean so that I can join in :)",
                                    "score": 1,
                                    "author": "telonelypotato"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i need to know the name of the song that played on the end credits of episode 8 it was so good.",
            "score": 1,
            "author": "MasterOfMatts"
        },
        {
            "level": 0,
            "comment": "Behind the scenes from the show, wish this had English translation!\n\nhttps://www.youtube.com/watch?v=SceKtnct0UQ&amp;list=PLay3nM-A3sMGJQ5nU2d7DMOpLl4aWGjC4",
            "score": 1,
            "author": "ivmoak"
        },
        {
            "level": 0,
            "comment": "Can anyone tell me the name of the last song playing in episode 8? I love that jam🤗🔥🙌🏽",
            "score": 1,
            "author": "Kdramafan767"
        }
    ]
}