{
    "id": "125cfei",
    "score": 125,
    "title": "Call It Love [Episodes 11 &amp; 12]",
    "author": "meepmochi_",
    "date": 1680062360.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/125cfei",
    "media_urls": [],
    "other_urls": [
        "https://mydramalist.com/726339-tell-me-it-s-love)",
        "https://mydramalist.com/people/23567-lee-kwang-young)",
        "https://mydramalist.com/people/103523-kim-ga-eun)",
        "https://mydramalist.com/people/113397-kim-ji-yeon)",
        "https://mydramalist.com/people/1944-kim-young-kwang)",
        "https://mydramalist.com/people/7660-lee-sung-kyung)",
        "https://mydramalist.com/people/1137-sung-joon)",
        "https://mydramalist.com/people/16710-hani)",
        "https://mydramalist.com/people/1572-kim-ye-won)",
        "https://hulu.com/),",
        "https://disneyplus.com/)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags).",
        "https://www.reddit.com/r/KDRAMA/comments/118ibxl/call_it_love_episodes_1_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/11exw0t/call_it_love_episodes_3_4/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/11lr44d/call_it_love_episodes_5_6/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/11rqjvr/call_it_love_episodes_7_8/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/11yao5m/call_it_love_episodes_9_10/?utm_source=share&amp;utm_medium=web2x&amp;context=3)"
    ],
    "postText": "* **Drama:** [Call It Love](https://mydramalist.com/726339-tell-me-it-s-love)\n   * Hangul: 사랑이라 말해요\n   * Revised Romanization: Sarangira Malhaeyo\n* **Network:** Disney+\n* **Premiere Date:** February 22, 2023\n* **Airing Schedule:** Wednesdays &amp; Thursdays @ 8:00 PM KST\n   * Airing Dates: February 22, 2023 - April 13, 2023\n* **Episodes:** 16\n* **Director:** [Lee Kwang Young](https://mydramalist.com/people/23567-lee-kwang-young) (The Secret Life of My Secretary, Entertainer)\n* **Writers:** [Kim Ga Eun](https://mydramalist.com/people/103523-kim-ga-eun) and [Kim Ji Yeon](https://mydramalist.com/people/113397-kim-ji-yeon)\n* **Starring:**\n   * [Kim Young Kwang](https://mydramalist.com/people/1944-kim-young-kwang) (Hello, Me!, The Secret Life of My Secretary) as *Han Dong Jin*\n   * [Lee Sung Kyung](https://mydramalist.com/people/7660-lee-sung-kyung) (Sh\\*\\*ting Stars, Weightlifting Fairy Kim Bok Joo) as *Shim Woo Joo*\n   * [Sung Joon](https://mydramalist.com/people/1137-sung-joon) (Island, Hyde, Jekyll, Me) as *Yoon Joon*\n   * [Ahn Hee Yeon (Hani)](https://mydramalist.com/people/16710-hani) (Hit the Spot, Idol: The Coup) as *Kang Min Young*\n   * [Kim Ye Won](https://mydramalist.com/people/1572-kim-ye-won) (You Are My Spring, Suspicious Partner) as *Shim Hye Seong*\n* **Plot Synopisis:**\n\n&gt;A romantic melodrama that depicts the story of a man and a woman who, exhausted from their harsh reality, begin to understand each other with new emotions and find themselves gradually changing.    \n&gt;  \n&gt;Sim Woo Joo's life became miserable because of her father and his mistress. After her father's death, Sim Woo Joo is kicked out of her home by the woman her father dated. She decides to take revenge on that woman. She approaches Han Dong Jin, who is the son of her father’s ex-mistress. Sim Woo Joo gets to know him and realizes that she has fallen in love with him. Han Dong Jin is a workaholic, who has suffered from loneliness for his entire life. His life changes after he meets Sim Woo Joo.\n\n* **Streaming Sources:** [Hulu](https://hulu.com/), [Disney+](https://disneyplus.com/)\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on [/r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct) (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community. Any extreme cases of misconduct (such as racism or hate speech) will result in an immediate permanent ban from our community and a report to Reddit admin. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag in Markdown by writing &gt; ! this spoiler ! &lt; without the spaces in between to get &gt;!this spoiler!&lt;. For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).\n* **Previous Discussions:**\n   * [\\[Episodes 1 &amp; 2\\]](https://www.reddit.com/r/KDRAMA/comments/118ibxl/call_it_love_episodes_1_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 3 &amp; 4\\]](https://www.reddit.com/r/KDRAMA/comments/11exw0t/call_it_love_episodes_3_4/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 5 &amp; 6\\]](https://www.reddit.com/r/KDRAMA/comments/11lr44d/call_it_love_episodes_5_6/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 7 &amp; 8\\]](https://www.reddit.com/r/KDRAMA/comments/11rqjvr/call_it_love_episodes_7_8/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 9 &amp; 10\\]](https://www.reddit.com/r/KDRAMA/comments/11yao5m/call_it_love_episodes_9_10/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
    "comments": [
        {
            "level": 0,
            "comment": "dongjin thanking woojoo for breakfast next to her cubicle in an open concept office was so BOLD",
            "score": 145,
            "author": "gooooosie",
            "replies": [
                {
                    "level": 1,
                    "comment": "WHILE SHE WORE THE SAME CLOTHES FROM YESTERDAY !! 😮‍💨😮‍💨😮‍💨",
                    "score": 76,
                    "author": "doihavetoe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And Woojoo kinda had that panicked look 😊Looks like Dongjin is ready for the everyone to know they are together.",
                    "score": 44,
                    "author": "bunmum2998"
                },
                {
                    "level": 1,
                    "comment": "lol I GASPED. I was like - WHO HEARD???",
                    "score": 31,
                    "author": "klmnumbers"
                },
                {
                    "level": 1,
                    "comment": "I am dying from the main leads’ acting!!! They are so good in this drama!! I’m so proud that their acting has progressed so much- that their small little actions such as them breathing during that kiss scene, conveyed so much emotions.\n\nAlso I felt so sad for DJ.. Throughout episode 12, you could see him trying to reach out to WJ and even goes so far as to announce their morning together with the office. 😂 You see him constantly trying to bring their relationship to the next level but WJ just keeps putting up walls.\n\nReally wondering how the next 4 episodes are going to pan out… 🫣",
                    "score": 17,
                    "author": "happylenaaa"
                },
                {
                    "level": 1,
                    "comment": "I literally couldn't bring myself to watch when this was happening I was so stressed",
                    "score": 16,
                    "author": "saylars"
                },
                {
                    "level": 1,
                    "comment": "He’s ready for the world to know!!",
                    "score": 5,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished episode 12 - is everyone okay?! The mixture of the most beautiful romance and the sense of impending doom is just too much for my poor heart I can't.\n\nSome random thoughts:\n\n* Ngl DJ's &gt;!thumb stroking her neck!&lt; might have been the sexiest thing I've ever seen\n* I really like how this show handles both Min Young and the horrible mom. They are in it enough to move the story along, but they don't have that much screentime.\n* Love how they turned WJ's mom around in these episodes. She seemed really scary in ep 10. Would love to hear some more of her backstory - the earlier episodes made it seem like she was in urgent care somewhere but she seems fine now?\n* Also love Jun but man &gt;!him walking away after Haesung confessed!&lt; was brutal. I still don't quite get him - are there still some lingering feelings for Woojoo? When he &gt;!hovered over her phone number!&lt; I wasn't sure if he was thinking about her romantically or just missing his friend.\n* The strap of Dongjin's backpack is getting worse by the minute. The company is doing better now so someone please get him a new one!\n\nOnly two more weeks with our favourite emo couple! They better not break our hearts...",
            "score": 75,
            "author": "Low_Study_2672",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk, I don't thing Jun has romantic feelings for Woojoo. &gt;!that scene of him eating ramen by himself and sending haesung multiple messages while she is with her bf just goes to show how lonely he is. I think he clings to them so desperately out of that loneliness but is afraid of venturing into uncertain territory, like that of a romantic relationship, where if things go south, he could lose the only three people he has in his life. He is just deeply afraid of loss 🥹. That little speech he made about how he is so afraid of being uncomfortable and how he believes he is just like his dad is a small but significant insight of the way he thinks. I'm starting to understand him more.!&lt; Also I just want one kdrama where they recognise that men and women can just be friends so it'll be nice if they just leave their relationship as platonic.",
                    "score": 86,
                    "author": "finnnelsonn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree that he isn’t interested in Woojoo romantically, he just doesn’t want to risk the possibility of the siblings not being in his life so he establishes clear boundaries with everyone.",
                            "score": 43,
                            "author": "wanderlust22x"
                        },
                        {
                            "level": 2,
                            "comment": "I want Haesung to learn to eat alone like her colleague told her. I think it would be great if she and Jun both ended up just being able to relax with themselves, you can feel how they are wound so painfully tight, it would be nice if they could both just breathe.",
                            "score": 39,
                            "author": "nanadirat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree. Which is why I'm okay with the way things panned out in ep12 with hyesueng &amp; jun both eating by themselves but also coming together to laugh together as friends 💜. I still ship them though but perhaps it is not time for them yet.",
                                    "score": 22,
                                    "author": "finnnelsonn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Also I just want one kdrama where they recognise that men and women can just be friends so it'll be nice if they just leave their relationship as platonic.\n\nThis! I was so happy when they showed them as platonic best friends, maybe I'm just overly sensitive to hints that they're going to ruin that :D I also hope that Jun will come around soon and support Woojoo a little more. He is the only one that knows her secret and she is struggling SO bad.",
                            "score": 12,
                            "author": "Low_Study_2672"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I almost passed out at that thumb stroke.\n\nAnd no, I am NOT okay because I need to wait an entire week for two more episodes 🥲",
                    "score": 28,
                    "author": "eternalhorizon1"
                },
                {
                    "level": 1,
                    "comment": "The thumb stroke got me squealing. It’s so sexy and then the way he pulled/bit at her lips too 😫",
                    "score": 17,
                    "author": "wildshesaid"
                },
                {
                    "level": 1,
                    "comment": "Not just his thumb, but I just kept thinking of how big his hands are compared to her face. \n\nYou know what they say about big hands😉😉\n\nBig feet🤣🤣",
                    "score": 6,
                    "author": "iluvwater40"
                },
                {
                    "level": 1,
                    "comment": "I didn't even see the thumb stroke and had to go watch it again. Man, that was such a sexy detail. I hope they talked about it in planning the kiss, that would have totally thrown me.\n\nHim and his thumbs. The thumb-sucking scene in Somebody is by far sexier than all the fully naked sex scenes in that show.",
                    "score": 16,
                    "author": "WaterLily6984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Editing to add: anyone else notice how Woojo is sort of handling this how one in a torrid love affair would? It’s very parallel to her father’s infidelity - saying she will tell the person she loves the truth, hiding things from everyone that you care about and that might be hurt by this because of your passion. Her saying that she will get to telling ML the truth, begging his friend for more time to reveal the truth herself to the ML. What smart writing. \n\nSo the chemistry is WOW - I replayed that &gt;!kiss and bed scene!&lt; like 29 times, I am not even gonna lieeeee. I’m in love with the ML. So gentle yet…his passion and love for her is so obvious. He’s laying it all out, opening his heart fully to her.\n\nWhen he finds out the truth, I am just going to be heartbroken 💔 I was really frustrated with FL at first and her prolonging the inevitable, but I feel sorry for her now. I had so much anxiety these two episodes that she was going to be found out and was yelling at my tv for her to just come clean! The actress is doing SUCH a good job sharing that anxiety with the viewers lol.\n\nShe really was dealt by life with so many shitty cards due to her father’s infidelity, and I think because of the trauma and environment she was raised in she was never able to fully express her opinion or be open about anything. She can speak about what’s on her mind about other things and people. But you can see her and her siblings struggle with being open and honest with each other - they instead choose to pretend to not notice things. So I can see why this is difficult for her. \n\nAnd she also knows how incredibly hurt but also sorry ML will be - he will no way want to be involved with her after what his mother did to her and her family. I really hope they can find a way to make this work, although the circumstances are very difficult.\n\nI suspect FL’s mom knows who he is. A mother always knows…when she asked FL at the end of episode 12 if she is hiding anything else, after hearing her daughter speak so kindly of the mistress’ gentle son - she confirmed what she suspected the minute she met DJ. Maybe I’m reading too much into this, but if you go back to episode 11 where the mom meets him for the first time the way she looks at him is almost as if she recognizes him. Does anyone know if DJ lived with his mom the years that Woojo’s dad left the family for his mother? I imagine Woojo’s mom would’ve known or had met her friend’s son at some point? The actress playing the mother is doing a great job, so I swear I saw a look of recognition in her eyes when she first set her gaze on him. And like her kids, instead of asking her daughter or telling her she suspects he’s the son, she’s kept it to herself/ignored it? Idk. It does seem like a stretch that she wouldn’t confront her daughter about something that major…\n\nThe second lead couple that’s being created with Jun and Haesung - I like them together. Jun is so afraid of losing the only family he knows, Woojo and her siblings. I totally get why he would hesitate. I do think he has feelings for Haesung but thinks it’s safer to just remain friends and he continues working out of his little box pharmacy. I also understand his fear that she is flaky and has been in her past relationships/has crushes easily. So he’s very afraid of getting hurt and then he loses his family. Him leaving her like that when she &gt;!confessed though!&lt; SENT ME 🤣🤣 I shouldn’t have laughed that hard, but I might be in the minority that I actually think while it’s rude he did that and he should apologize, it’s kind of great Haesung has time to actually sit with these newfound feelings for her sister’s friend and be rejected for once. 🙊\n\nGotta say, I’m still mad this drama was lost in the Disney+ ether…easily the best drama airing right now. I know it’s on Hulu but wish it would’ve been on Netflix or Viki to get more viewers.",
            "score": 68,
            "author": "eternalhorizon1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so confused bc I thought woojoos mom recognized DJ when he bought the cake at the bar. And I thought Jigu knows who he is too bc of the picture he found. But the last episode they seem to not know DJ is heejas son? And they show the scene of DJ apologizing to woo Joo so he knows who she is then?",
                    "score": 6,
                    "author": "neverarguewithafool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No that flashback was her lying to her mom, but also wishing that’s how things played out versus the mess she ended up creating.",
                            "score": 9,
                            "author": "AndaLaPorraa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So so agree with the Disney plus thing, this is one of my favorite dramas ever already and no contest, an amazing ML but I feel like it would’ve done so much better on Netflix. I never would’ve seen this show except I stumbled on to it one day browsing and I love the FL actress so I clicked on it. Haven’t seen any ads or any promotions for it which it deserves. The precaps are also difficult to find.",
                    "score": 6,
                    "author": "theskymaybeblue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So cool of Dongjin and Woo-joo to invent romance and passion.\n\nEP. 11: &gt;! HIS SMILE WHEN HE CONFESSED!! Her lil smile!! The way they held hands... Now imagine what'll happen when/if they actually kiss!! !&lt;\n\nEP. 12: &gt;!I was just hoping they'd kiss... They more than delivered... 🔥🔥!&lt;\n\nThat being said, I'm low-key not looking forward to the next few episodes bc of the sheer trauma our Udong couple is gonna go thru...",
            "score": 136,
            "author": "AlfredusRexSaxonum",
            "replies": [
                {
                    "level": 1,
                    "comment": "NO BUT FR THO",
                    "score": 17,
                    "author": "Straight-Payment-729"
                },
                {
                    "level": 1,
                    "comment": "LMFAOOOOOO NO BAD!!",
                    "score": 13,
                    "author": "Comprehensive_Ad4109"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched both the episodes in one sitting as soon as they came out and now I don’t know what to do with my life anymore till next Wednesday :(",
            "score": 51,
            "author": "slippedaway12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same 😫😫",
                    "score": 8,
                    "author": "Funny_Dependent_5788"
                }
            ]
        },
        {
            "level": 0,
            "comment": "EPISODE 12 OPENING IM YELLING",
            "score": 47,
            "author": "Straight-Payment-729",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s 4am here so I’ll be back but I have to sleep but wow I really needed this drama. I was in a k drama slump and I truly missed smiling like an idiot at my TV. Not to be too #serious but my heart was aching and this romance gives me butterflies and keeps me from remembering that.",
                    "score": 36,
                    "author": "Straight-Payment-729",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was not in a kdrama slump, but surprisingly this kdrama makes me feel super good after watching it. Idk if it is the ensemble with my favorite actors hahaa, but it\\`s too good.",
                            "score": 9,
                            "author": "Ambitious_Chair_1072"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it just me? But I actually felt that Haesung's young boyfriend showed the most insight into her personality. I felt he was actually honest with her. He didn't want her to be fake or suppress what she was feeling. She told him she was having mental health issues and it was no big deal to him. He accepted it. He showed some immaturity and told her she should hold him accountable and not run away. I think he was a good guy.",
            "score": 117,
            "author": "shamcastle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I thought the same. He hurt her, but it wasn't malicious - he was immature. He even acknowledged that and wanted to talk about it. Leaving without a single word and ghosting him was hurtful too and I think he was in the right to ask for a final conversation.\n\nAnd he is right about her approach to relationships - if she always just puts on a happy face and runs away at the first sign of trouble it will never work out. \n\nI wish she had taken him up on his offer to practice arguing with him.",
                    "score": 84,
                    "author": "Low_Study_2672",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd like to see them together. More than her with Jun. IMO the strongest relationship is where people counter balance each other. Haesung and Jun are too similar.",
                            "score": 38,
                            "author": "shamcastle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And tbh even the show doesn't respect Jun's wish to remain single.",
                                    "score": 32,
                                    "author": "N-Crowe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is my biggest complaint of the show. Really want to see Jun single at the end of it and keep things platonic with the sister but I don’t think that going to happen. I really enjoyed the sister’s arc with the boyfriend. He definitely spoke the truth about her and how she hides who she is.",
                                            "score": 6,
                                            "author": "theskymaybeblue"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She didn’t argue with him, but she did then go and argue with Jun, so I think she did take what he said on board.",
                            "score": 21,
                            "author": "Electronic_Piano9385"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn’t hate him at all. He was not a bad guy, just not the best fit for her IMHO because his delivery was a bit immature. He was calling her out, which she needed, but also he can’t change who she is - she needs to. Idk. I think the gap in age was just too much.",
                    "score": 34,
                    "author": "eternalhorizon1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agree. I'm really curious where she will end up.",
                            "score": 5,
                            "author": "shamcastle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I knew I was gonna be hurt by these two episodes and I was not disappointed. Love when a drama delivers exactly what it promises :)\n\nSome thoughts on hyeseong × jun: &gt;!damn, it was hard to watch the scene where he just walks away. It reminded me of that time when woojoo told him about her feelings and he left her at the bar in the exact same way - without a word. It's a pattern and I love that the drama foreshadowed this a long time ago.  I wasn't surprised when he rebuffed her confession - I was hurt yes, but also it made sense, considering he has never shown any romantic interest thus afar. It would be weird if he suddenly confessed too. I also liked how he was introspective, made connections with his dad and apologised in ep12. We love a self aware king.!&lt;\n\nIm not sure what direction their relationship is gonna go now but I'm still hoping they are end game. Though my prediction is that nothing is gonna happen until the absolutely last episode. Also, I'm sensing a time skip which I'm never a fan of. 😭 on another note, I'm glad hyeseong &gt;!broke up with her young bf because I'm team Jun all the way, but damn he was spitting facts!&lt; - she really is afraid of conflict and is always putting on a fake smile, no doubt a defense mechanism she has picked up due to the past trauma from her dad's affair. You can also see the same dynamic play out in the strained relationship she has with her siblings and how they are all so distanced from each other, never really talking about things long enough for them to fight about it.",
            "score": 33,
            "author": "finnnelsonn",
            "replies": [
                {
                    "level": 1,
                    "comment": "The one thing that has me thinking Haesung and Jim are a real possibility is the fact that they do fight with each other so much. Ex BF pointed out her conflict avoidance and she acknowledged it but still didn’t argue back. Then she ran to Jun and argued with him, lol. I also loved the subtle way that Jun asked her to eat jajangmyeon which is what she said she wanted to eat for lunch with her coworkers. It’s like he already knows what she wants so she doesn’t have to pretend with him. He just gets her.",
                    "score": 7,
                    "author": "Rubadubtubgirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ayeee great observations. I didn't put much thought on the jajangmyeon but did notice how she fought him after basically giving up on her ex lol. Ngl, I really liked their fight in the pharmacy even tho Jun was PISSED. Idk, I love every scene they are in, even if they are at each other's throat 🙈",
                            "score": 3,
                            "author": "finnnelsonn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Episode 11 and 12**\n\nOh dear oh dear oh dear…\n\nI know we signed up for pain but it’s still a hard pill to swallow knowing what we know and for the proverbial balloon to burst. \n\nBefore I lay down my myriad emotions (because I love that I can write about it here and get it out of my head), I just want to say that the hidden MVP of this show is really Haesung’s friend from work. She knows her friend so well, gives her sound advice, is the right amount of pushy and also so protective. Haesung is really blessed to be surrounded by good people. Even Suho whilst misguided in so casually revealing something about her to his friend showed immense amount of maturity for his age. The offer to &gt;!practice arguing!&lt; was so sweet because you know he realizes she’s a good person and although not right for him deserves to confront her shortcomings and learn from them on her quest for happiness. I wouldn’t have expected that from someone young and I actually really appreciate that the writers haven’t written him to be unidimensional. It’s often not the case and that too with a minor role character. \n\nDongjin’s subtle changes while so thrilling to see because he really does deserve to happy and excited, can’t help but make you want to also shake him a little and tell him to stop and ask more of Woo Joo. I know that what they love about each other is just that…giving space and comfort to talk when the other feels like but he needs to up the ante next week. I did however love that he was straightforward with &gt;!Minyoung and openly voiced his desire!&lt;. He’s so accommodating that he rarely voices what he wants and I think he’s finding the new found freedom from his shackles of the past to be liberating and filling him with confidence. His conversation with &gt;!her mother in Ep 11 was so heartwarming and real. It really drove home the why point behind their attraction to each other!&lt;, it’s just terribly ironic that despite stating this now he’s going to experience hurt anyway. \n\nHowever, I think for exactly this reason he is not going to be the one that cannot get past their sordid connection. It is definitely going to be Woo Joo. He seems to have reached a place of acceptance and comfort with himself, his life and what he desires out of his relationship and I think that may prove to be his strength through the rough times ahead. \n\nSwitching to Woo Joo…I don’t know what to say. This poor girl has had expectations be thrust on her at such a young age that she is now so sold into being the &gt;!pillar of her family and the universe that holds the comet and planet in orbit!&lt; that she is mentally and physically incapable of putting thought into what she wants out of life. Stealing those moments with Dongjin while may seem selfish, and they are, was also so sad to see. To have to justify to yourself your wish to act upon your feelings because it’s your &gt;!birthday!&lt; and you’d like it to be nice, nearly broke my heart. She’s confused, scared, hurt, in love and she just doesn’t know how to communicate or process. \n\nIt’s frustrating to watch as the audience because you know she’s capable of not beating around the bush, and that is how you know he’s become her “weakness”. It was heartbreaking watching her on the brink of tears almost throughout episode 12 whether it was towards Sun Woo or Dongjin or her mother. I admire her (misguided) resolve to reserve the actual full story and truth for Dongjin but she needs a little push and kick in the bum and I hope she gets that next episode. I would love for once for such types of major plot points to be an actual conversation between the leads where we can then see the fall out thereafter rather than have an inadvertent spillage and the associated rage of not being told directly coupled with the inherent hurt that will follow. \n\nDespite her flaws I love the way Haesung handled Jun. He is an extremely introverted person with commitment issues and is riddled with fear and anxiety over his routine being broken…yet it is for these exact reasons I think the two of them are a great fit. He may say Woo Joo is his best friend but I think he really values all 3 of them equally and unwittingly cares a tad more for Haesung. I hope they find their way eventually. \n\nI really hope to god we don’t eventually get an open ending for the leads because to be honest they’re the kind who would want resolution one way or the other. I also like to believe that subtle things DJ said and did over this week indicate that this time he’ll be willing to fight and wait as needed. Please Woo Joo don’t be harsh on yourself and put yourself first for once…💜\n\nETA: One scene I really enjoyed because it so beautifully displayed the dynamics of the 4 roomies is when they all gather at the playground. There was such warmth even though they all kinda bickered a bit. \n\nI can’t stop thinking over Woo Joo &gt;!breaking down in front of her mother!&lt;. \n\nI think honestly my only wish from the remaining 4 episodes is for Woo Joo to receive the biggest warmest hug from Dong Jin where she has one big cry. At the very least she deserves that.",
            "score": 38,
            "author": "radiokidb"
        },
        {
            "level": 0,
            "comment": "I love how Woojoo takes after her mom. Same burning and quiet intensity. The whole family dynamic is so good and well thought of.\n\nNone of the Shims are dumb, they all pick up clues quickly. Even the happy go lucky Jigu figured out where he saw Dongjin’s mom. \n\nWoojoo’s internal conflict is so well portrayed. \n\nOn the flip side, Dongjin looked so happy to be accepted into the family as Woojoo’s boyfriend. Little does he know what’s coming. \n\n“What do you like about my cold daughter?” Woojoo’s mom has quickly become a favorite like her children.\n\nThe director is showing off with some of the scenes. How beautiful was it to see Dongjin eating breakfast and then seeing Woojoo enter the frame showing her making the breakfast. Same with Minyoung and Heeja. This show needs an award for cinematography.\n\nLastly, big props to Lee Sung Kyung, she has learnt to say a thousand words with the faintest of movements. The very tiny nod in episode 11 spoke volumes. Superb growth as an actor. I hope she wins many awards for this performance.\n\nThe economy of movement and yet speaking volumes is fantastic.\n\nEdited to add: Depending on the way this show ends, I will definitely add the director and writer(s) to my list and follow their careers. The pink filter crew has made an amazing show.",
            "score": 100,
            "author": "subtitlesreader",
            "replies": [
                {
                    "level": 1,
                    "comment": "i was thinking the same thing about lee sungkyung's acting. she's come a long way from cheese in the trap and her other early roles - it's so rewarding as someone who's watched quite a few of her dramas!",
                    "score": 30,
                    "author": "gooooosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y’all this show has me WEAK",
            "score": 31,
            "author": "slippedaway12"
        },
        {
            "level": 0,
            "comment": "I don't think I'll be able to function properly if we don't get a happy ending for these two. \n2521 was enough for the heartbreak I genuinely don't need more",
            "score": 35,
            "author": "pickadamnnameplease",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is astounding to me how that show was a year ago and I legit still flinch at the thought of the end of that show or come across any clips. As if that happened to me personally. Lol. Haven’t even been able to listen to the OST without feeling like trash so I haven’t even though I love the songs.",
                    "score": 15,
                    "author": "radiokidb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not just you! Lol if it's any consolation, I think this whole sub is traumatized.",
                            "score": 12,
                            "author": "pickadamnnameplease",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha it brings immense consolation at our collective trauma but I’m also just so sad for all of us! Will we be able to survive another one? I don’t want to have to find out 😩",
                                    "score": 6,
                                    "author": "radiokidb"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;! I think we might not based on a short summary of Episode 16 on Hulu. I’m just hoping they are wrong though. My heart can’t bear another 25 21 heartbreak either !&lt;",
                    "score": 11,
                    "author": "jademysterioux",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "oh please no. 2521 scarred me last year. if this kdrama does it too, i'm going to have to take a long hiatus",
                    "score": 9,
                    "author": "ilovemymemesboo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Late to the party. After staying up till 2am last night, I had multiple early morning Zooms.\n\nThese last 2 episodes knocked it out of the park bringing the romance from 10 to 100 very quickly. I had high expectations for these two since their previous kissing scenes in other dramas were steamy, but in addition, the writing was so intense! I didn't expect a &gt;!first kiss &gt; sleep together!&lt; combo.\n\nWoojoo in her characteristic impulsive way is jumping all in, but really needs to talk to Dongjin as the walls of her lies are closing in around her very quickly. As she said, if she's the one to explain &gt;!he will be less hurt,!&lt; I don't really know how the long-term viability of the relationship could be resolved, though...I mean, either his mom dies or goes to jail. That woman will not back down. Yet, Woojoo is actually the only person who can help him disentangle himself from her.\n\nI get Jun. He's a nerdy misanthrope who has found a balance with the 3 siblings and dating Hye Song would mess everything up. I get a sense he wants to...but it's way too risky because he's only seen her in a string of shallow messed up relationships.\n\nThe writing and acting for all these characters is just so good!\n\nPS: It took me a while to put 2 and 2 together, but the actor playing Jun is also Gungtan, the main antagonist in Island and now I can't unsee it. I'm amazed at how good he is, because he took me several episodes to figure out it was even the same person.",
            "score": 33,
            "author": "WaterLily6984",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great commentary! I also stayed up until 2 AM even though I had to be up at 5 this morning for work calls in another time zone 😂\n\nSuch a good description of Jun. Captures his essence will.\n\nI agree about the writing - such well-developed characters, even the side characters with little screen time. The actors are delivering. Amazing!",
                    "score": 12,
                    "author": "eternalhorizon1"
                },
                {
                    "level": 1,
                    "comment": "Dude. You just broke my head with Sung Hoon reveal. I’m such a dolt! Haha. How did I not realize it was him 😂 Every time he tucks his hair back I’m like oh yeah I’ve seen that before somewhere but I just put it down being familiar with him. Not my brightest 💡 moment!",
                    "score": 6,
                    "author": "radiokidb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Listen. I was watching Yumi's Cells and started watching Itaewon Class and it took me 6 episodes to figure out Ahn Bo Hyun was in both. There is something that good actors do with hair, makeup, and subtle muscle movements in their faces that makes them turn into a different person. \n\nKYK being one of those...especially in this drama. Very far from The Secret Life of My Secretary, though he is in the same pickle with the FL lying through her teeth to be with him and not being able to come clean.",
                            "score": 14,
                            "author": "WaterLily6984",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahaha that’s so true. I went through it with KYK too. In fact I just fired up Secret life of my Secretary last night to remind myself and I was like you know what cannot blame yourself 😂\n\nThanks for reminding me I’m not alone!",
                                    "score": 5,
                                    "author": "radiokidb"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OMG you have no idea, I started watching this immediately after watching the episode of Island with him &gt;!punching through that lady's chest and then murdering everyone!&lt; The whiplash was unreal. And yet for some strange reason I can't get enough Sung Joon now. I've been going back and watching his older shows that I've avoided so far because, if I'm being honest, a lot of them have very unfortunate pictures of him and I'm shallow.",
                    "score": 5,
                    "author": "nanadirat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sung Joon is awesome in shut up flower boy band!",
                            "score": 3,
                            "author": "Estrella459",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is it.. this show will surely be in my top 5 dramas of the year 2023 (I know there are still more good drama to come since the better part of the year is still left.. we have Gyeongseong Creature and Song Of Bandits left to air..)\n\nThe dangerous stench of an open ending I am getting out of this show is unmissable...",
            "score": 25,
            "author": "Several_Challenge_85"
        },
        {
            "level": 0,
            "comment": "At this point I wonder who was not screwed by  &gt;! Dong-jin's mother !&lt;",
            "score": 25,
            "author": "justdisappointed2023"
        },
        {
            "level": 0,
            "comment": "woojoo's \"I'm texting you in case you get worried.” was so sweet :'((",
            "score": 28,
            "author": "doihavetoe"
        },
        {
            "level": 0,
            "comment": "I think the kiss+ bed scene should be discussed more. \n\nIt was just too much to handle. Damn they both did sucha good job. The moment he turned to her and finally kissed her …. To the moment he held her head while laying her on the bed, just showed how much he cared for her and loved her.",
            "score": 27,
            "author": "Limp-Ad9853",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loved it, the kiss and the bed scene was so them. It was done with absolute care and at the same time the longing for each other was evident… they were both tender and passionate. \n\nWe can’t talk enough about LSK and KYK’s chemistry, whoever brought them together for this drama knew what they were doing.",
                    "score": 22,
                    "author": "imJoyk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In an interview, those two talked about how even tho they are friends irl, they stayed apart during shooting to stay in character.\n\nLSK also talked about how she kept bad posture, slouched, during the months of shooting also to stay in character, and how painful that became.",
                            "score": 18,
                            "author": "Weiramon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also did you guys notice the camera angles ... it was swooning with us :)",
                    "score": 11,
                    "author": "PuluPuluKi"
                },
                {
                    "level": 1,
                    "comment": "I was not expecting a kiss and bed combo for their FIRST KISS! These two can’t help themselves, lol.",
                    "score": 5,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The captions on this post: [instagram](https://www.instagram.com/p/CqWbUZYvPr2/?igshid=YmMyMTA2M2Y=)\n\n&gt; ***“…whether Woo-Joo and Dong-Jin will be able to overcome this situation with the power of love and have a happy ending, or whether they will choose to adapt to reality with only beautiful memories.”***\n\nAs much as I love stories of beautiful memories like in 2521, I desperately need Woo-Dong couple to have a happy ending! They’re so sad for so long in their lives that I just want them to be happy with each other.",
            "score": 69,
            "author": "Shop-girlNY152",
            "replies": [
                {
                    "level": 1,
                    "comment": "What I'm watching right now it's a car crash in slow motion and the romance between them is on passenger seat without a seat belt.",
                    "score": 33,
                    "author": "justdisappointed2023",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah I am really concerned we are getting a bittersweet ending where they don't end up together but had this brief moment of joy and walk away with memories. I really don't want that. I'm going to be devastated even though I think that's where it's going.",
                    "score": 24,
                    "author": "klmnumbers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be honest at the beginning I was so prepared for this ending. But now that we've gotten this far, I really really don't think Dongjin can survive having this peace taken away from him again. It's incredible how, as a watcher, I can tell just how light his heart is now after meeting and finding love for Woojoo and I am not mentally or emotionally prepared to deal with him returning back to the way he was. He truly deserves happiness. Not to mention Woojoo does as well, but it's a bit different because she's known all along how this relationship was going to end (although I'm praying the writers decide that they actually do need to end up together) so it's not as bad as seeing the world come crashing down on Dongjin. God I don't think even *I* can survive a bad ending atp.",
                            "score": 26,
                            "author": "saylars"
                        },
                        {
                            "level": 2,
                            "comment": "Naw I’ll riot if we get that.",
                            "score": 10,
                            "author": "eternalhorizon1"
                        },
                        {
                            "level": 2,
                            "comment": "That blurp on hulu describing ep 16 totally destroyed me. Hope it's misdirection",
                            "score": 8,
                            "author": "Super-Pudding-1357",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In 2521 they had different life goals. Here it's just the weird family connection. She seems to have gotten over it, and he is presented as open-minded, so I don't really see the problem. They are making too much out of it. It makes no sense to split them over it. But we might get a noble idiocy breakup before they get back together, because kdrama.",
                    "score": 13,
                    "author": "gniv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve been thinking about this a lot and I think they will end up together. I think that Dongjin will realize that Woojoo fell in love with him after she knew/hated his mom (tbh to know her is to hate her lol). His ex loved him first and then second guessed the relationship after meeting his mother. I think that maybe he will finally stand up to his mom and force her to apologize to the family. Idk what would happen after that though because I can’t imagine them forgiving her to the point of being able to maintain a relationship. Maybe she will emigrate lol.",
                            "score": 7,
                            "author": "Rubadubtubgirl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They deserve to be happy, together 💔💔💔💔🥲",
                    "score": 7,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So proud of Jigu. I feel one of his older sisters watching him taking care of mum, and proudly singing..so good too. We can let him off the hook and let him follow his dream lol!",
            "score": 22,
            "author": "bunmum2998"
        },
        {
            "level": 0,
            "comment": "I feel like Dongjin should have known something was up when Woojoo said &gt;!\"If I were a good person, I wouldn't be here.\" That's not something someone usually says right before they sleep with you!!&lt;",
            "score": 20,
            "author": "Kagomefog",
            "replies": [
                {
                    "level": 1,
                    "comment": "The double entendre in those words is epic.\n\nReferring both to the immediate present where she should be coming clean about having told Cha that he had been caught red handed/encouraging him to try harder about bankrupting Best Fairs, and the past, months ago, when she embarked on her ill-thought plan of revenge.",
                    "score": 10,
                    "author": "Weiramon"
                },
                {
                    "level": 1,
                    "comment": "The fact that he didn’t ask why she said that really indicated to me he might know.",
                    "score": 4,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone think maybe that &gt;!the mom already met Dongjin when he was a child and perhaps recognized him when he introduced himself? If she was Heejas friend then she probably saw or heard of him a few times….Or am I just wishful thinking that she’s going to tell Woojoo “I know who he is and it’s okay to date him”. !&lt; I’m grasping at straws here and searching for a sign of a happy ending somewhere 😵‍💫😭!!! This looming feeling is intense and I need to feel better creating other happy ending scenarios until next Wednesday….🥲🥲\n\nEdit: Now that I think about. I’m sure the aunt &gt;!must’ve said Dongjins name to them when they were chatting…..She’s given his card to woojoo twice now so by now must know his name by memory? Maybe that’s why at the end the mom asks Woojoo if there is anything else she is hiding!&lt; because she probably knows the truth already.",
            "score": 21,
            "author": "AndaLaPorraa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think the mom would remember how a little boy would look like growing up. However, I do wish she'd tell WJ that it's ok to date him regardless of who his mother is. It's just a horror thing to have your husband's mistress as your in-law. Though I don't usually like the big white truck of doom, I do wish the Heeja can get hit by it so that the problem about her is solved and also a big weight off DJ's shoulder. You know how sometimes parents are too much a burden to their kid's life that it would help the kid so much more to not have the parent around.",
                    "score": 22,
                    "author": "kittin89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes makes complete sense! I’m clearly desperately hoping for that approval lol and omg I forgot about the white truck. You’re so right, that wouldn’t be such a bad incident at all….",
                            "score": 6,
                            "author": "AndaLaPorraa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was just hoping she would die fr.",
                                    "score": 4,
                                    "author": "ggghhhb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She needs to, for the greater good.",
                                            "score": 7,
                                            "author": "AndaLaPorraa"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know it's kind of off the wall but I feel like Dongjin might have &gt;!actually seen Woojoo at the funeral. There was that whole scene where we are shown him hearing her crying outside the funeral home and then we see his mother show up, but this show has cut scenes before and then given us the rest of them later and I can't help feeling like there was more to us being shown that moment!&lt;",
                    "score": 8,
                    "author": "nanadirat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish that were the case. The one thing I found unbelievable about the drama is how he didn’t even bother asking for a name when he went to the realtor so many times. If you’re looking for a person/family then find their names! It feels like plot shield.",
                            "score": 6,
                            "author": "ggghhhb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it could be a privacy thing? woojoo only learned of DJ's identity through her aunt who asked his mum for his business card. but maybe the realtor can't really be giving out the siblings identities just like that?",
                                    "score": 5,
                                    "author": "saylars"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was actually thinking the same! It feels off the wall, but I’m honestly starting to think &gt;!he suspects because why hasn’t he asked her why she was stalking him home that one day? He said it was because she was the spy working with Mr. Shin when he left her at Mr. Shins building, but after that he never questions her on her stalker motive even when he realizes she wasn’t the spy…..also I never understood why he said to heeja “now I’m being punished for it”….like I can’t come up with why else he would say that lol……idk I just feel like there’s so many threads missing and he must at least have suspicions that it’s her….!&lt; I feel like they’re going to show us some scenes later like you said. Or maybe I’m completely overanalyzing these details lol.",
                            "score": 4,
                            "author": "AndaLaPorraa",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "By the way, I was wondering about Woojoo's birth date because there was a birthday celebration in this week's eps. Turns out that she's a Leo born in July. I stumbled upon this detail when I decided to revisit Roy Kim's Flower OST video. There was a scene where Dongjin was going over her resume lol.\n\nI tend to fixate on minor and inconsequential details :')",
            "score": 21,
            "author": "capsaicinpowder",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think were all in here for these details, they are not \"inconsequential\". I love how this community points out information that I may have missed. Thanks.",
                    "score": 11,
                    "author": "imJoyk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My favouraite quote in this week's episode..\n\n◇ *\"I like Shim-Woojo*\n    *I want to be happy with her\"*\n\n◇ *\"I am laying it out open*\n     *because I want it to work this time.....\"*",
            "score": 61,
            "author": "Several_Challenge_85",
            "replies": [
                {
                    "level": 1,
                    "comment": "That second line - OMG he is in it for life 🥲 what a MAN.",
                    "score": 19,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ughh it’s all gonna come crashing down next episode",
            "score": 20,
            "author": "ttam23"
        },
        {
            "level": 0,
            "comment": "Thoughts this week: There's a lot of great instrumental BGM in the 2 episodes. Learned to appreciate Kim Young Kwang's acting even more. I watched him in the movie On Your Wedding Day (highly recommended), where he depicted the ML's transition from an average foolish teenboy to a similarly average and clueless young man.\n\nIn this drama, he's a dependable, depressed, and quiet man. He really embodies the character from the way he walks, or like Woojoo's mom said, the way he holds his chopsticks. I'd say he is very skillful in depicting the average characters in life. You find his characters very relatable (as compared to, say, assassins or superheroes), but each character is so different and believable.",
            "score": 19,
            "author": "capsaicinpowder",
            "replies": [
                {
                    "level": 1,
                    "comment": "His Somebody character is the exception that proves the rule.",
                    "score": 10,
                    "author": "Flappadingo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You'd be surprised he's very diverse. I recommend you watch the secret life of my secretary if you're in the mood for a romcom, he was adorable there and I love FL. In the guardians too his character carried the whole show tbh. He embodies his roles so well that I feel if enybody else took his role as Dongjin the show wouldn't workout as well.",
                    "score": 9,
                    "author": "Tolune_J"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This might be an unpopular opinion but I watched the trailer for episode 13 &amp; I can understand why the family would be upset with WJ. I see why everyone is upset and could not understand why the family would not be okay with DJ, but hear me out. \n\nTruly step into their shoes and imagine your family member getting with your dead fathers mistress’ son. If they marry, you’d be tied with that mistress for the rest of your life since your in-laws. That woman has caused so much chaos since the day she decided to betray her good friend (which is the siblings mother) and get with their father. Think about it. A father who was loving, doting and respectable ( in their eyes) betrayed his wife, his children and his life for a woman he shouldn’t have even dared glanced at. He abandoned his family and the pain and suffering that causes someone is unbearable. \n\nWife traumatized. Children traumatized. Extended family traumatized. It’s a different type of pain, a pain that needs to be taken care of through some therapy imo. \n\nNow I agree, it’s not DJ’s fault. In no way am I blaming him. He’s an innocent man in all of this. But you really have to deeply think about it. How would this make the mother feel? The siblings? They’re still shaken about what happened years ago; they’re just doing their best to move on. \n\nAs a mother, it’d be very difficult to see my daughter date someone who is attached to my ex husbands mistress. Who pushed my children out their home, who most likely stole/hid the will that mentions the kids get the home. It doesn’t matter how great and apologetic of a guy he is. I don’t want to see that woman part of my family tree in no shape or form unless she RIP💀\n\nAt the end of the day, I am rooting for these two though. I don’t want great chemistry like this wasted if they don’t end up together. Maybe I would’ve tolerated it, if the chemistry wasn’t this good, but it’s amazing. I want them to end up together but I do want people to understand that their family being upset is completely normal. Honestly, I would’ve been surprised if they weren’t upset, just a little bit.",
            "score": 18,
            "author": "Comprehensive_Ad4109",
            "replies": [
                {
                    "level": 1,
                    "comment": "However hard I try stepping into the Shims’ shoes and understand how upset they might be WJ settled on the most unlikely suitor, I still have faith WJ and DJ will be able to chart their own course and disentangle themselves from their respective weaknesses and family allegiances. They’re natural transgressors either out of impetuousness (WJ) or quiet and prolonged equanimity (DJ). They’ll ride out the storm as the only two people in the world they wished they were. She’ll hide (for a time) out of shame, he’ll seek her out. Because he’s determined to be happy this time around, because she’s become the pillar of his own universe.",
                    "score": 7,
                    "author": "mishmashBINTI"
                },
                {
                    "level": 1,
                    "comment": "Her mother will come around to it even though initially she will be against it. If not then its selfish, explaining to Wj that she picked the wrong name for her (keeping the earth and stars in orbit) means nothing. That talk she had with Wj meant she wanted to live more freely for herself. \n\nAnd her father repeating the monks words about their middle child being the pillar 100 times.They have emotionally guilted her and she bears unreasonable responsibility",
                    "score": 7,
                    "author": "Imaginary_Talk_6977"
                },
                {
                    "level": 1,
                    "comment": "I can understanding being upset, I don't understand the slap, it's just not justified. If HS is the one who sacrificed everything for the family, then yes, she can hit her ungrateful sister. But no? It's the other way around! She never said one word of gratitude to WJ, or tried to ask WJ to live for herself or anything. And now when she finally does something selfish for herself, this is what she gets? What upsets me the most is WJ is going to take it because she thinks she deserves being treated like that.",
                    "score": 6,
                    "author": "st-berry"
                },
                {
                    "level": 1,
                    "comment": "That’s why, as some commented here, it would be nice to have DJ’s mom get killed or something. 😆",
                    "score": 4,
                    "author": "Shop-girlNY152",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "First thing I really want to mention is how much I really like the entire Shim family. The siblings are adorable and the mother is a pretty nice person, now that we finally get a chance to know her. They are good people. It makes you even sadder that their father, who seemed to have a good relationship with them before, cheated on his wife and abandoned his family.\n\nAnd it continues to emphasize what a blazing trainwreck Dong-jin's mother Hee-ja is.\n\nIt was pretty devastating when Hye-seong was honest about feeling things for Joon, and he basically ran away. They even showed him silently walking away from her from a overhead shot, emphasizing the starkness. But as sad as that moment was, it wasn't hard to figure out why he did that. Joon loves all the Shim siblings, and dating Hye-seong risks losing them all. (So I guess he's just going to have to marry her, in that case. Haha.)\n\nAnd that's how it is for Dong-jin as well. Woo-joo is a package deal, and her cute siblings will be along for the ride.\n\nI know a lot of you have 2521 trauma - I DO TOO!!!! That show seriously gave K-drama fans serious trust issues. So if this show pulls a 2521 I will cry. But I have faith that this drama will not do that to us. Because? K-netz call this drama \"My CEO,\" alluding to \"My Mister\" for a reason. Not to give too much away for those who haven't watched \"My Mister\" yet - but that story was about embracing \\*everything\\* about the person that you love. Including all the \"bad\" things they might have done. Two damaged people, reaching out to each other, then becoming everything to each other. Unconditional love, folks. That show made you believe in it, and this one will, too.\n\nIn previous weeks, I was afraid for Woo-joo. How she will be hurt when the whole truth comes out. But I don't worry about her as much anymore. She's going through all the pain right now. The forthcoming pain will be Dong-jin's - the pain he will feel because he is sorry. Once he finds out the extent of his mother's misdeeds and how much she hurt the Shim family, he will feel like he's not good enough for them and retreat back into his shell.\n\nBut it's okay. Woo-joo will embrace all of him. Because she is the cosmos.\n\n==\n\nETA: a few more thoughts:\n\nFirst is about Suho. I was a bit taken aback by how upset he was when Hye-seong broke up with him. I thought his immature attitude reflected how little he was invested in this relationship. But at least by his standards, he was actually quite invested. He's still not really the right guy for her, but that was kind of surprising.\n\nMy next thought is about Woo-joo's conversations with her mom.\n\n1. How sadly she wept while telling her mom about going to her father's funeral to create a ruckus, and how painful that entire experience was for her. Goodness, imagine when Mom finds out the whole truth later.\n2. Woo-joo lying that she met Hee-ja's son who sincerely apologized to her. It's something that would make her mom feel better about this horrible situation, but also a way to make herself feel better as well. And while this was techinically a lie, she knows that is what Dong-jin would have said.",
            "score": 17,
            "author": "anjou_00"
        },
        {
            "level": 0,
            "comment": "I'm not very happy with Seon-woo acting so mad at Woo-Joo for briefly helping Chief Cha with his spying. Although she can't explain her personal reasons yet, the fact that CEO Shin bashed a rock into her head should be more than enough to make up for whatever she did in the past.\n\n&gt;!I personally predict a happy ending. Hee-ja has no legal claim to their house, since we found out this week that she is hiding Mr. Shim's will, which probably leaves the house to his kids. My guess is that Dong-jin will find it and help the Shim family recover their house.!&lt;\n\n&gt;!I feel like the truth will get exposed soon because Hee-ja moved in with Dong-jin. Perhaps Woo-joo comes by Dong-jin's place to finally fetch Ji-gu's things and runs into Hee-ja.!&lt;\n\n&gt;!And in the end, Woo-joo will get her revenge after all. She will take from Hee-ja the one good thing that is most precious to her - Dong-jin, just like how she stole their father from them. I feel like if given the choice between Woo-joo and his mom, Dong-jin will choose Woo-joo.!&lt;\n\n&gt;!Caveat: My brain is in trashy makjang mode. And I recently watched \"The Glory\" which has infected my brain, too. I feel like these writers will probably come up with something more interesting than what my predictions are.!&lt;",
            "score": 17,
            "author": "anjou_00",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah I forgot about her being bashed by CEO Shin. That should be proof of where her loyalty lies\n\nBut I understand where Seon Woo is coming from though. His friend has been hurt &amp; betrayed by the people close to him (Minyoung, the mom, Mr. Cha), almost like a punching bag. Knowing how much Dongjin fancies Woojoo, Seon Woo just wanted to make sure he doesn’t get betrayed again after all he’s been through.",
                    "score": 17,
                    "author": "bubblyeva",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I *am* proud of Sun Woo today for finally putting more hours in office than Dong Jin, for once",
                            "score": 22,
                            "author": "charmaine54321"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my God. I'm not sure how much longer I can put up with DJ's mom. I truly hope he boots her from his life. There should not be any forgiveness for her—from any party.",
            "score": 17,
            "author": "PricklyGillyweed"
        },
        {
            "level": 0,
            "comment": "Watched the ep13 preview. Not sure why the Shim family is overreacting to Woojoo dating their enemy's son especially when he's apologetic about his mom's behavior. How could Hyesung slap Woojoo omg. She forgot how Woojoo had supported the entire family, including standing up for her when she was accused to be a homewrecker.",
            "score": 15,
            "author": "capsaicinpowder",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw it too and so disappointed. I feel like the anger is justified but the slap is just so out of character. Like HS has never acted like an older sister to WJ so for her to act like that is so frustrating. Even sadder because WJ was brought up to believe that she has to bear the weight of being the pillar of their family, taking care of them to the point of having to work odd jobs to make sure she’s saved enough for her brother’s future. Instead of for once being someone that WJ can rely on, HS acts out selfishly and even have the gall to tell their mom first without WJ there.",
                    "score": 10,
                    "author": "wildshesaid"
                },
                {
                    "level": 1,
                    "comment": "Hyesung wasnt there to listen to her story about \"meeting the son\" so she may not know the full context. The mom can be understanding since she listened to her story. But then she may or may not believe it.",
                    "score": 3,
                    "author": "Thi_Tran"
                },
                {
                    "level": 1,
                    "comment": "I think it’s justifiable to be upset and shocked if they don’t know all the details. Still wrong to physically attack your sibling for it though.\n\nAnd also, in a way this is an outlet for all of the pent up anger they had about their father and the affair. So wrong of them but I see it as that. They’re doing to her what they wished they could’ve done to their dad/husband.",
                    "score": 4,
                    "author": "eternalhorizon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So happy to see them together but gosh, there’s also this underlying feeling of sadness cos she’s still holding back and we know what’s coming. Preparing myself to cry next week when everything is unraveled. Sometimes I don’t mind if couples don’t end up together if it makes sense but please, please, PLEASE let our Woojoo-Dongjin be the endgame cause they deserved to be happy, after everything they’ve been thru!\n\nAnyway, Jigu did recognise Dongjin’s mom but I guess he didn’t know that she’s the mistress. Only was told that the moms weren’t in good terms cos of “money issue”. If he did know, he shouldn’t be THAT oblivious about the whole house, Heeja and the son situation.",
            "score": 14,
            "author": "bubblyeva"
        },
        {
            "level": 0,
            "comment": "Question about ep 12 karaoke scene thing - &gt;!Are they revealing to us that they DID meet on that day? And he knows exactly who she is already? I will admit that I watched these episodes at like 2:00 am and was out of it. But I genuinely couldn't tell if that was a reveal to us that he at least knows that part of the story (but maybe not the sabotage), or if that was her imagining it - how it would have gone if she hadn't already approached him.!&lt;",
            "score": 13,
            "author": "klmnumbers",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a lie, a wishful retelling as she’d imagined it could have been if the hole that she’s dug now didn’t exist. She wouldn’t be in this much agony now asking for more time if she’d met DJ that day in front of the house.",
                    "score": 10,
                    "author": "EveryMeeting4934"
                },
                {
                    "level": 1,
                    "comment": "Woojoo is lying. We see her go to the travel agent and ask her to tell Dongjin that there is no need to look for them to apologize, that the siblings have moved on to a happier place, and we see the travel agent phone Dongjin and do that.\n\nThe weird color of that scene shows that it is a wishful fantasy of Woojoo to back up her lie.\n\nAt least, that's how I see it.",
                    "score": 28,
                    "author": "Weiramon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I totally forgot about the whole travel agent thing. I knew she was lying/being vague with what she told them - but the actual shot of it happening like a memory threw me lol",
                            "score": 5,
                            "author": "klmnumbers"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm re-watching from the beginning looking for clues that I may have missed. Here are my thoughts.\n\n*Do we really think that Donjin is clueless of Woojoo's connection to him?*\n\nIn episode 2 he admitted that he knew that WJ was following him before he went inside the convenience store, then he saw her watch him eat and then (on his walk home) from the parked car's side mirror. He took the elevator without seeing WJ enter his building but had the foresight to get off the 9th floor, take the stairs down with the hopes of catching her. He knew and yet he kept quiet and didn't do anything until he caught her going through the mailbox.\n\nThese lines from WJ to DJ may be foreshadowing what's to come in the next episodes, ***\"...are you normally this petty? You knew all along but wanted to see how far I'd go. Pretending not to know, to let it go. Then coming at me when I had no way out... Why did you even pretend? When you were never going to let it slide\".***\n\nThen flashback to DJ pretending not to know that his ex-girlfriend was cheating on him, for a year (!), and again he didn't confront her.\n\nThese are the facts that the drama have given us so far. Again I ask, *do we really think that Donjin doesn't know Woojoo's connection to him?*\n\n&amp;#x200B;\n\nedit: grammar",
            "score": 14,
            "author": "imJoyk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if he doesn't know all the facts, he won't be caught off guard because as you laid out, it has been established that he knows she targeted him from the beginning \n\nHe also will recall their conversations where she asked him if he wanted to know the truth and his strong NO! She should remind him. She tried to tell him several times before the turning point/s in their relationship",
                    "score": 8,
                    "author": "DonnaMossLyman"
                },
                {
                    "level": 1,
                    "comment": "I agree with you. I think he knows and is waiting for her to tell him? \n\nI even think there might be a chance their paths crossed when they were kids, when their parents affair started/was ongoing. We shall see.",
                    "score": 4,
                    "author": "eternalhorizon1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "- \"*I know I will regret this..*\"\n\n\n\n\n\n\n\n\n\n\n\n\nI truly hope that in some miraculous way😂 Dong Jin **is aware** of how intertwined their fates are.🙏🏼 That bein' the kind person that he is, he decides to love Woo Joo to heal the hurt his wayward mom has inflicted upon her family..\n\n\n\n\n\n\n\n\n\n\n\n\n\nJi Gu saved Woo Joo as \"*Nutjob Number 2*\" on his phone.🤣 Still lovin' the Shim siblings dynamic with Jun. I am happy that Hae Sung is taking steps to be more comfortable bein' alone &amp; lovin' herself. I appreciated that her colleague at the bank allowed her to dine alone and let her figure out for herself.. 'cause normally people would be concerned and not leave them alone etc. Which can be more harmful than helpful.",
            "score": 13,
            "author": "LovE385",
            "replies": [
                {
                    "level": 1,
                    "comment": "He tends to hold onto and remember minor things about her and what she’s said so my hope with her saying this and reinforcing it with the next line is that he will remember and hold onto it as he works things out for himself once he learns the truth.",
                    "score": 6,
                    "author": "radiokidb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow you have no idea how much I wish they released the whole series at once 😂 Am I the only one feeling like we’re watching a car crash happen and the closer to the accident, the slower it is? Obviously in a very good way, frustrating but good.\n\nOkay so my thoughts about WJ telling DJ about the company spy thing - she literally told him she would not spy for him and that she could turn on him, said ONE sentence to the other dude - that DJ knows of the other guys betrayal and that he needs to work harder if he wants the company to fail. And then came around and helped DJ’s company, turned down the proposal to work for the other guys and everything turned out fine. Even Sun Woo noticed that she came around but should have come clean sooner. I would be surprised it that was the bombshell to break DJ and WJ up, I am way more concerned about their familial connection. \n\nI have a feeling DJ has no clue who WJ is. I used to think he definitely put the two and two together but now I don’t think so - being the person that he is, he would have addressed it with her mom. The mom seems to have found out that HeeJa moved into their house after her initial meeting with DJ so the couldn’t have apologised to her at the karaoke place when they first met - I also don’t think she would have taken it this lightly. \n\nHeeJa is not going anywhere, she would absolutely never accept her ex’s child who wanted to embarrass her publicly as her only son’s gf. He would never want to put WJ through the hell of fighting with his mom. Her family seems to be a little more understanding but still, it would have been a shock. I am not concerned about them being ex step siblings, WJ was 19 when she jumped in front of her dads car and DJ is even older, they never crossed paths and we’re not brought up together. Idk if we have any info on his relationship with her dad (if there even was one, he seems to have been avoiding the mom a lot).\n\nI laughed when WJ called HyeSeong to tell her she is going to regret it so much but she wants to be there etc and HS brushed her off like girl, you’re just staying the night, don’t make it sound like you’re about to die lol’. It captured the difference between them two, to WJ it was a matter of such importance because she isn’t jumping in blindly into a relationship with DJ - to HS, who dated a lot without much consideration just to not be alone, it is completely natural. \n\nRight now I feel like this drama could go either way - they clearly love each other but it would be so hard being together. I hope with all my heart that they get a true happy ending but my gut is telling me we might not get to see it.",
            "score": 12,
            "author": "FrienderBender88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I swear if &gt;!jun and haesung don't end up together !&lt;i will cry myself a river...\n\nI'm really looking forward to this couple.",
            "score": 12,
            "author": "FormalPhysical9211",
            "replies": []
        },
        {
            "level": 0,
            "comment": "• “I really like you… to the point where I wish everyone else in the world would disappear and there’d be just two of us left” \n\n🥲 … \n\n… *I’m feeling lonely*\n*Oh I wish I’d find a lover that could hold me* \n*Now I’m crying in my room* 🎶\n\n• Dong Jin taking the picture of breakfast made by Woo Joo was SO CUTE I couldn’t stop smiling. He’s so whipped \n\n• Also I strongly believe Dong Jin’s mother is raising my blood pressure",
            "score": 39,
            "author": "BubblyConsideration_"
        },
        {
            "level": 0,
            "comment": "I can think of only one word: sublime.",
            "score": 11,
            "author": "antecedentapothecary"
        },
        {
            "level": 0,
            "comment": "OMG! I didn't expect ep 12 to be so hot! Omo, who would have thought that WJ would be so fast? Lol.",
            "score": 11,
            "author": "kittin89"
        },
        {
            "level": 0,
            "comment": "Oh my god I was holding my breath for the reveal. It’s gonna be messy af I hope it happens next week already.",
            "score": 10,
            "author": "WholePersonality5323"
        },
        {
            "level": 0,
            "comment": "Another good week but my patience is wearing thin with Woo Joo. When will she spill the beans to Do Jin at least 😭 the next episode summary says the &gt;!family learns DJ’s secret so I’m assuming it’s then!&lt; but it’s just getting more and more tangled &gt;!(she kissed and slept with the man!!!)!&lt; And if she was my sister we would have to fight because no way 😵‍💫 but since this is fiction I would like to see the 2 leads end up together 🫣even if it’s a time skip ending of them reuniting \n\nAs for Haesung and Yoon Joon, I don’t want them to officially end up together at the end of the show because both of them need to grow. Both struggle with being alone but it manifests in different ways. I don’t mind them getting together at some point though, even if it’s beyond what we see. \n\nThis drama is very slow but I appreciate the development! You also get used to it when watching Melos lol",
            "score": 10,
            "author": "Snickersnerds"
        },
        {
            "level": 0,
            "comment": "Just finished ep 12 and I'm not sure if my heart can take next week's episode. WJ has dug her lie way too deep, I'm honestly not sure how she's going to explain her way out of this... but I am dying from anxiety waiting for it to finally happen. When do the previews come out?!",
            "score": 10,
            "author": "seynee",
            "replies": [
                {
                    "level": 1,
                    "comment": "She actually has an easy explanation. Once DJ finds out who she is, he will easily understand why she did what she did before. The only problem is, he will feel too guilty to continue a relationship with her.",
                    "score": 15,
                    "author": "Shop-girlNY152",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then again, previously his problem with relationships was that he was scared to show his mom (maybe because he was worried of how his girlfriend will react). Now his girlfriend has known his mom for a very long time and she’s not held that against him. She knew his mom before they got together !",
                            "score": 9,
                            "author": "ggghhhb"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;!Dongjin and Woojoo sliding into each other's hands right after the bike incident!&lt;\n\n***Me: \\*punching pillows\\****",
            "score": 10,
            "author": "ardent_avocado"
        },
        {
            "level": 0,
            "comment": "The level of chemistry KYK and LSK showing is simply unparallel! The way &gt;!she confesses!&lt; at the start of episode 12, man! That just melted my heart 🫶🫶",
            "score": 29,
            "author": "Altruistic_Sir",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s actually insane how good this show is. I wasn’t expecting it to be this good. I’m truly in love.",
            "score": 29,
            "author": "Comprehensive_Ad4109"
        },
        {
            "level": 0,
            "comment": "First base in kdramas is definitely hand holding! Frogging butterflies and it’s not even my hand🤦🏽‍♀️\n\nWoojoo and Dongjin🥰🥰😍 aside, can we pls talk about Hyesung? I’m so totally loving her character arc. Idk why her eating alone made me cry but all I can think about is that [Rupaul quote](https://youtube.com/shorts/kyarSnDGHuE?feature=share).\n\nP.S. Jigu is really the cutest! “Those who trust me the least but cherish me the most”.",
            "score": 31,
            "author": "iluvwater40",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;First base in kdramas is definitely hand holding! Frogging butterflies and it’s not even my hand\n\nAnd then they covered all the bases in next episode 😂\n\nAs i said before this kdrama is a roller coaster of emotion every episode. Every scene nearly!",
                    "score": 8,
                    "author": "bunmum2998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With how much of a slow burn this show is, it literally went so fast!! I needed them to slow down. Like extend that first 10mins of epi 12 for the next hour🤭🤤",
                            "score": 6,
                            "author": "iluvwater40"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omggggggg is all I’ll say. Ugh my heart. I NEED them to have a happy ending 🥲.\n\nEdit: Every episode it kills me when Woo-joo keeps saying &gt;!give me time, let me sort it out!&lt;. To jun and now to sunwhoo…I’ve been trying to understand what is she planning or more so how is she planning to confess…..ahh back to wishing for next Wednesday, but also dreading it. I’m scared this won’t end like I want…",
            "score": 23,
            "author": "AndaLaPorraa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Woo Joo is a patron saint of procrastination at this point",
                    "score": 7,
                    "author": "charmaine54321",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": " Just finished ep 11 and idk how I will survive ep 12. Was screeching literally the entire time. Their chemistry is truly unmatched. This might be my fav work of LSK so far like her range?? &gt;!the scene with her mom made me cry!&lt; \n\nNo drama since 2521 made me this giddy istg. Gonna savor this ep for now and save ep 12 for tomorrow 😩\n\nEdit: \n\nAND HERE I THOUGHT EP 11 WAS PEAK ROMANCE OMFG. The confession?? &gt;!the kissing &gt; bed scene???? The way his thumb stroked her neck and the way he bit her lips? I died !&lt; this is by far my fav romance drama from this year. It’s so freaking good when it ends I’m gonna be devastated. I love the romance with the underlying layer of melancholy. It’s so gut wrenching and beautiful at the same time. I want WJ to come clean soon but when she &gt;!lied to her family about meeting the son, I groaned out loud!&lt; her internal conflict is so realistic but frustrating. This might be LSK’s best role so far. The way she portrayed complex emotions without saying much was really a master class in acting. Not just the leads but the supporting characters are all so well done. WJ’s mom was a surprisingly nice addition. I love how intense and blunt she is, WJ really resemble her mom in this sense. I hope she surprise us all in the next couple eps bc I really can’t stand seeing her turn against DJ who she’s already so fond of 🥲 it’ll really break me. \n\nSigh, gotta wait another week now.",
            "score": 24,
            "author": "wildshesaid"
        },
        {
            "level": 0,
            "comment": "I literally stopped breathing at the beginning of ep 12 and then almost hit my face on my screen\n\nI was *into* it …\n\nBut like it is so strange the swerves the story takes. I thought it would all come crashing down 5 mins later\n\nBut it didn’t? Wtf?",
            "score": 24,
            "author": "Flappadingo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a perfect mix of tenderness and passion…we don’t get that enough in any media 😩",
                    "score": 25,
                    "author": "Straight-Payment-729"
                },
                {
                    "level": 1,
                    "comment": "I think we were all into it😭😭 it was too good",
                    "score": 10,
                    "author": "Comprehensive_Ad4109"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I just say I am a huge fan of this couple. I can easily draw out similarities between myself and WJ, with an intimidating first impression (or so my friends tell me) and seeing her with such a gentle man like Donjin makes me so happy. Ep. 12 had me giggling and stressed out for WJ and DJ!",
            "score": 9,
            "author": "Wisegal007"
        },
        {
            "level": 0,
            "comment": "It genuinely made me sad when Jun dismissed Haesung’s feelings. She came on strong only for him to do her like that 🥹 When they were going at it in the pharmacy, Haesung looked so fed up. I feel like they’re both similar in the sense that they’re extremely lonely in the inside and always feel the need to be around others. Hope that Jun will get over his fear of commitment and give Haesung a chance, I really like their camaraderie.",
            "score": 21,
            "author": "wanderlust22x"
        },
        {
            "level": 0,
            "comment": "My brain has been stuck on Woojoo’s “memory” of meeting Dongjin in front of the house. \n\nThe only way I can accept their relationship is if it is real and Dongjin already knows what’s going on, and the drama is just playing with our feelings. \n\nI don’t want to watch Dongjin get betrayed again by his ‘savior’. Watching it happen once was bad enough. \n\nPlease be good and end well, drama!!",
            "score": 8,
            "author": "ggghhhb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I usually wait a day or 2 (or longer) to watch the new episodes because doing so shortens the time I have to wait for next week’s drop. But because of the newly released poster and the still cuts I waited all of 15 minutes before I started episode 11 - the struggle is real.   \n\nI’m in awe of the chemistry between Lee SungKyung and Kim YoungKwang. Here’s hoping that they are end game - we will know in a couple of weeks.",
            "score": 19,
            "author": "imJoyk"
        },
        {
            "level": 0,
            "comment": "My heart just skipped a beat when they &gt;!held hands!&lt;",
            "score": 18,
            "author": "jayjay654321",
            "replies": [
                {
                    "level": 1,
                    "comment": "us kdrama fans really appreciate the bare minimum 🤣 &gt;!same!&lt;",
                    "score": 7,
                    "author": "iwillforgetthissmh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me throughout Ep 11 &amp; 12: WOOJOO GIRL &gt;!TELL THE TRUTH!&lt; JEBAL!!!\n\nI'm so scared about the ending atp. I don't think I will be able to handle a sad ending especially for this drama.\n\nIs Jun &gt;!unknowingly dating Haesung?!&lt;  Whether they date or not, they are healthy towards each other.\n\nI badly wanted to see the Sim siblings,Jun and Dongjin together. &gt;!That happened this ep but with Woojoo' lie hanging over them.!&lt;🥲",
            "score": 6,
            "author": "mekshimus"
        },
        {
            "level": 0,
            "comment": "One thing I love the most about these episodes is the symbolism of the siblings' names. \n\nI have learnt Korean, but it was like 2 years ago, so the meanings always escape me and find me later on. And when their mom started talking about it, it hit me so hard.\n\nIt really showcases the family dynamic - Woo Joo is the center, and she fights to hold everyone together (which should in no way be on her, btw).\n\nBut it's also kind of about the whole series - like Woo Joo is the FL, the plot starts with her and is centered around her life. And the gravitational pull that her \"universe\" has, you can really \"call it love.\"",
            "score": 6,
            "author": "LauraEats"
        },
        {
            "level": 0,
            "comment": "woojoo ah woojoo, the more you delay the worse it will be\n\njust tell dongjin the whole truth already",
            "score": 15,
            "author": "arcturuz78",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;! Wait so she never did and that part we saw in karaoke is just an embellishment? ahhhh !&lt;",
                    "score": 6,
                    "author": "jademysterioux",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like I might be apart of the minority in this thread who really is not vibing with haeseong. I really really tried to like her despite me generally not being a fan of people with her type of personality irl (I can't stand people who lie about what they like/think/feel in accordance to what you like/think/feel. I'm on security guard's side on that particular point). But I don't know, I can't help but feel like she's too self-centred. I haven't really seen her show any appreciation for any of the things Woojoo has done for the family which puts me off a bit.  I was expecting a scene somewhere along the way where she sat woojoo down and told her that she can live her own life and stop revolving it around the family. Instead she complains about how Woojoo treats her like she's less capable, which I understand can be demotivating as the older sister but how have we not seen haeseong do a single thing for the family as a whole??? Am I missing something????? And onto the topic of her and Jun.... why couldn't she handle the situation with a little more care? It feels so selfish of her to have confessed to him while still living under his roof.  Jun is way too kind-hearted to even consider kicking her or any of them out which Haeseong definitely should know....so in a way she trapped him? Or did she not consider how potentially uncomfortable he could have felt living with her while being aware of her feelings for him? It's not even about whether or not his feelings are mutual !! I truly believe that if she had a respect for his comfort (not to mention his close friendship with Woojoo), she should've waited until they moved out to confess. (I say this all having been in the exact position Jun is in rn except I did not at all reciprocate the feelings lol). ugh anyways, if anyone can defend her regarding these points please go ahead and do so. I don't like hating characters that weren't written to be hated.",
            "score": 15,
            "author": "saylars",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like kdramas with flawed characters. I don't like Hyesung as well. She is immature and acts on her emotions. I don't mind her not taking on the older sister role. No one's obliged to take responsibility for their adult siblings. I agree with HS that Woojoo should let go of their brother and let him make mistakes. HS's carefree attitude should have extended to WJ's relationship with Dongjin as well, but she clearly lost it in the episode preview and acts like a jerk imho.\n\nShe also needs to reflect on how she approaches relationships and her inability to be alone. Those are the reasons that her past relationships didn't work out. Instead of reflecting, she decided to find the next partner to repeat the same mistakes. Her ex-bf definitely did something wrong, but at least he was willing to admit to it, while she didn't want to discuss it at all and called it quits.\n\nI am ambivalent about her confession to Jun. She didn't force him to answer, so that's fine. She pays rent so she doesn't owe Jun anything. If Jun feels uncomfortable, he can be an adult and tell her, which he did...",
                    "score": 6,
                    "author": "capsaicinpowder",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Regarding Haesung’s confession: Telling someone about your feelings is not always okay. Yes it’s your feelings, but by sharing it you are burdening the other person as well. You have to think about it before saying it. Perhaps it’s her way to rush things and say it lightly and she thinks it’s okay. \n\nI felt bad for Jun. I wanted it to work out (as side couples do in your average kdrama), but his genuine reaction changed my mind.",
                    "score": 10,
                    "author": "ggghhhb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really didn’t think I’d like this drama but here I am anticipating each new episode 😭😭",
            "score": 23,
            "author": "CrowPrior"
        },
        {
            "level": 0,
            "comment": "Teaser for next ep is out! I hope somebody translates soon. \n\nhttps://youtu.be/SnrwK1RjshE",
            "score": 6,
            "author": "kittin89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hye-seong: Is there some problem with Han Dong-jin? How serious is it?\n\nHee-ja: What does this woman do? Did you really buy this to eat? Obviously someone made it for you.\n\n\\*\\*: Your home finally sold.\n\nHee-ja: Please deposit it here.\n\nHye-seong: Shim Woo-joo is a crazy bitch, and you're a crazy jerk. Does this make any sense? Are you filming a movie?\n\nWoo-joo: Unni, give me just two days.\n\nHye-seong: You do whatever you want. I will do whatever I want.\n\nDong-jin: Hyeong, has something happened with Shim Woo-joo? Just tell me. Once you tell me, I will take responsibility.\n\nWoo-joo: A part-timer quitting a job is nothing. So please don't be concerned anymore.\n\nHye-seong: Mom, what do we do about our Woo-joo? Han Dong-jin is that ahjumma's son.",
                    "score": 8,
                    "author": "anjou_00"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just watched the preview from Ep 13-14 (no English sub) looks like everone finds out everything \nDonjin about Wojoo (not her identity maybe but about her helping Mr.Cha early on from 2nd CEO) \nWoojo's family finds out obviously...Haesung coaxs the truth out of Jun then she informs mama Shim.\nAll hell is about to break loose. 😱\n\nHere's the link- https://youtu.be/SnrwK1RjshE",
            "score": 5,
            "author": "Several_Challenge_85",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hope dongjin knows who woojoo is.... like he knew that she was following him in ep 2",
            "score": 5,
            "author": "Buffygirl88",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think he knows, I believe that he's smarter than what we think of him.",
                    "score": 9,
                    "author": "imJoyk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watching episode 11 and the fact that she still hasn't told him is giving me sooo much anxiety 😃.  The sense of impending doom is so strong...",
            "score": 6,
            "author": "Funkybutmonkey"
        },
        {
            "level": 0,
            "comment": "I want to have sympathy for the FL at this point but am running out of sympathy just because it's dragging the plot. More and more this feels like a 2521 kind of an ending coming upon us and I hate it. I can't see how we have the revelation and then them reconciling in the next 4 episodes. I really wish he had known at the end of the 11th episode and there is time spent on her healing.\n\nBecause it just feels like this whole series was about ML healing thanks to FL. So she is a pillar for her family + the ML. Come on. I want to see her getting that listening space and someone springing to her defense and protection. She deserves it",
            "score": 12,
            "author": "AHappy_Cranberry_17"
        },
        {
            "level": 0,
            "comment": "I can only imagine how quiet their dates are..",
            "score": 13,
            "author": "12amonreddit"
        },
        {
            "level": 0,
            "comment": "can they just do something already...... anything..... please....",
            "score": 12,
            "author": "meepmochi_",
            "replies": [
                {
                    "level": 1,
                    "comment": "did you see today's still cuts? If you haven't then don't cause it'll be a nice surpriseee",
                    "score": 8,
                    "author": "Individual_Train_606"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\r  \nNot really EP11/12 related, but will put this here since it is the current post on this show. About the attention to detail in this show. Here is one that I just caught.\n\n\r  \nOne of the big themes of the show is revenge, and how harmful it is, possibly the most to the one seeking it – Woojoo appears to be in for a world of hurt for her misguided plan of revenge, Dongjin’s plan to live a happy life to get revenge on Minyoung (rather than live a happy life for himself) only made him “bored and lonely”. And Shin Sulman . . . well, we see how his revenge on Best Fairs ruins him, and it drives so much of the plot for the first 10 episodes, from nearly driving Dongjin’s company out of business, to corporate espionage entangling Cha, Dongjin, and Woojoo, to the drinking and violence that resulted in Woojoo getting hurt – and her and Dongjin putting aside their petty insecurities and begin being positive and open with each other.\n\n\r  \nAnd in EP6 we find out why he is so driven to revenge – not so much that Dongjin left and many employees left with him, but because while on his knees begging for Dongjin to stay, he missed a call from his wife, who passed away, and he blames Dongjin for not picking up, not calling emergency services sooner.\n\n\r  \nIf we go back to EP1, we get our first introduction to this revenge, when Ms Baek enters Dongjin’s office and tells him that Best Fairs has lost the Singapore bid, that Shinwoo Fairs has outbid them, and that Shin is clearly targeting them. As Ms Baek leaves, Dongjin gets a call from his mother asking him to come to the funeral.\n\n\r  \nThe time of the call is 9:11.\n\n\r  \nSo, at some point I will have to post about why I think the show writers have Dongjin living in 2701, why Minyoung is in 2702, why they live at building 103, why the house that was taken from the siblings is on 27th Road, and is house number 34. Why Dongjin got off the elevator on the 9th floor of his building and descended the stairs to catch Woojoo going through the mailboxes. Why there is a scene with Minyoung where – after receiving porridge from Sunwoo, waits as the elevator descends from the 7th floor to the the 3rd floor. And of course I will have to write further on the significance of the number 5, the number of stitches Woojoo receives, the number of booths at Haesung’s bank, and the number that the crosswalk counts down to as Jun is left alone, his blind date leaving him while calling him a crazy bastard. I don’t think any of these numbers are random choices by the showwriters.\r  \n\n\nAt least, that’s how I see it.",
            "score": 12,
            "author": "Weiramon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting. will be awaiting your analysis.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guys… this is the Call It Love comment section, not the 2521 comment section.\n\nCall It Love has been telegraphing a happy ending since before it started airing, with the ‘healing’ label, the peaceful and cheery teasers, the low-drama posters, etc. There have been hints throughout the 12 episodes we’ve seen too, but it’s 2 AM for me right now and I’m not gonna bother listing them.\n\nConversely, 2521 literally telegraphed its sad ending since day one, which is why I dropped it after the first week. THE SHOW LITERALLY TOLD YOU THEY WEREN’T GOING TO END UP TOGETHER. The fact people were too invested in the cast and the hype for a ~nostalgic school romance with Nam Joohyuk to drop it on the spot and kept watching while doing all sorts of mental contortions to convince themselves the drama was lying to them about the sad ending doesn’t mean THEY WEREN’T WARNED. This doesn’t mean every other romantic melodrama ever is going to keep the main couple apart.\n\nIn fact by every convention of the romantic genre the main couple in Call It Love is going to experience a moment of crisis between episodes 14-16 and figure things out in the final episode. The nature of the inevitable crisis has been clear since episode one, the plot beats are familiar to anyone who’s watched more than 10 kdramas in their life and there’s not a single indication that the ending will be unexpected or unsatisfactory, so why the fuck do we have to discuss baseless comparisons to The Interest of Love (a drama based on a novel with a sad ending), 2521 (a drama that announced its sad ending from the beginning), Nevertheless (one of the trashiest dramas of all time) or whatever instead of savouring the delicious angst this drama is serving us? Haven’t you people seen anything *good*? Ever? One Spring Night, Just Between Lovers, Come and Hug Me, that sort of thing?\n\nIf I see another comment about 2521, my brain is gonna melt at this point.",
            "score": 31,
            "author": "tractata",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Most of the audience of 2521 ignored the warning signs of what was to come for the main leads. \n\nI also don't get why some choose 2521 to parallel for what's to come for Call It Love? There are so many other K-dramas that gave us good endings, Our Beloved Summer, Run On, Hometown Cha Cha Cha, Something In The Rain, etc...",
                    "score": 13,
                    "author": "imJoyk"
                },
                {
                    "level": 1,
                    "comment": "Hahahah thank you so much for this reality check. I think people are just traumatised and think preparing themselves beforehand for a possibly sad ending might soften the blow but as you are pointing out, there is no need to do that. I think. I'm also scarred I guess 😂",
                    "score": 10,
                    "author": "finnnelsonn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also I'm a huge hyeseong × jun shipper as well and there's a possibility that we might have an open ending with them if not the leads so I don't think my fears are unfounded 😂🤡",
                            "score": 5,
                            "author": "finnnelsonn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That I agree with. I think there’s a real chance the drama is gonna give them a My Liberation Notes kind of sendoff, with HS off to find herself or learn who she is on her own when she’s not dating anyone or whatever and Joon kind of waiting for her or something. But I hope they’ll get a real ending and at the pace of their relationship development in the last four episodes I think the drama could cover enough ground to leave them in a good spot at the end.",
                                    "score": 10,
                                    "author": "tractata"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for the reality check I needed 😂😂. I think I’m just scarred, but that does make a lot of sense. Granted I also dropped 2521.",
                    "score": 8,
                    "author": "AndaLaPorraa"
                },
                {
                    "level": 1,
                    "comment": "Agreed wholeheartedly. I was one of those people who ignored the signs in 2521 ngl but by the homestretch I knew it wasn’t going to be a happy ending. This drama on the other hand, hasn’t really shown any inclination of an open/sad ending. I feel like it has done such a good job at subverting all of our expectations and I’m confident that it’ll be a happy ending. I think the past 12 eps have shown us enough of our leads’ personalities/motivations for me to be sure that DJ will not give up on their relationship. WJ will probably be selfless and try to leave but idk, it would be so damn sad for our girl if the writers choose to give her such an unsatisfactory and depressing ending. I have faith that they won’t do her dirty like that. Every time I watch a melodrama this sub always get like this and 90% of the time it’s a happy ending.",
                    "score": 8,
                    "author": "wildshesaid"
                },
                {
                    "level": 1,
                    "comment": "Bravo and exactly! I don’t know why everyone is so pressed? We’re in the homestretch now, we had 10 depressive episodes let us enjoy the ‘love’ portion of show. Yes they have a tiny obstacle remaining and based on his personality so far he will processes it positively",
                    "score": 6,
                    "author": "axado4"
                },
                {
                    "level": 1,
                    "comment": "I also don't anticipate a sad ending, but I'm curious to know what are some of the hints you've seen throughout the 12 episodes, if you don't mind sharing when you have the time",
                    "score": 6,
                    "author": "asddsalkjjkl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[New poster](https://twitter.com/sungkyungsays/status/1640866846596554753?s=20)\n\n[Still cuts for ep 11-12](https://twitter.com/sungkyungsays/status/1640864771497967617?s=20)",
            "score": 10,
            "author": "CtrlAltDelete4"
        },
        {
            "level": 0,
            "comment": "Why couldn’t MinYoung tell DongJin about his mother harassing her for money during their time together? They make her out to be such a villain from the past but it looks like she’s been bullied? Maybe I missed something.",
            "score": 12,
            "author": "meraxes",
            "replies": [
                {
                    "level": 1,
                    "comment": "While Minyoung and Dongjin were together, if Dongjin finds out Minyoung is doing stuff with his mother he will take it badly - both because of his strained relationship with his mother, and because he feels it is pressuring him to marry Minyoung.\n\nAnd yes, Minyoung was bullied by Heeja, and was still being bullied recently, when Heeja asked her for 10m. It was only in EP12 we finally see Minyoung stand up to the bullying. It is a heartbreaking shot with the wall between apartments 2701 and 2702 removed, seeing the juxtaposition of Minyoung in the foreground and Heeja in the background.\n\nI really sympathize with Minyoung's character. Very believable, very nuanced.",
                    "score": 12,
                    "author": "Weiramon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. I did feel sorry for her. I still think how she went about ending things was particularly cruel if she went to the lengths of keeping the mother’s incessant money fishing from him and I’ve been in a vaguely similar situation and considered not telling the person, but that hesitation lasted maybe a day before I did because they deserved to know the truth. But trust me it’s not an easy conversation to have and I think the show is really trying to highlight that everyone is flawed and not perfect so in that sense I get it. They’re trying to show us not to villainize characters we ordinarily would or otherwise known as noble idiocy. Lol 😂",
                            "score": 8,
                            "author": "radiokidb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of the reasons I  sympathize with Minyoung is she may have been fine when she first began dating Dongjin, but between his mommy issues and his mom's bullying, Minyoung is now broken. Those two were really bad for her. Still are. \n\nI would want for her to heal, and then perhaps find someone like Sunwoo.",
                                    "score": 8,
                                    "author": "Weiramon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very true! Actually one of the biggest underlying themes of the show to me is how parents and our relationship with them and their relationships with each other deeply affect us even when we actively try not to be like them.",
                                            "score": 9,
                                            "author": "radiokidb"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To be honest she could've simply blocked the mother since they're no longer related and solve it. What made me sympathize with her was her drinking habits that were very concerning. It's good she's trying to get sober",
                                    "score": 4,
                                    "author": "Tolune_J"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please explain the black and white scene - ep 12 / “explanation” in karaoke room",
            "score": 3,
            "author": "Flappadingo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The descriptions were out on HULU for last episode included. I got so depressed when I read it. Then I remembered that still of Dongjin in the grey turtleneck surrounded by the crowd. Ugh I just have this bad feeling they will go there separate ways and that picture might be him seeing her after a few years again! Ugh I'm so nervous now they won't be end game and have a happily ever after. And if they do it could be years later Ugh!. Take me off the ledge lol",
            "score": 5,
            "author": "Glittering_Throat577"
        },
        {
            "level": 0,
            "comment": "How are you folks enjoying this drama so far? Should I jump on the train?",
            "score": 4,
            "author": "kirtinemani",
            "replies": [
                {
                    "level": 1,
                    "comment": "This thread is the only thing making the week long wait for the next episodes to drop bearable! You have to watch",
                    "score": 14,
                    "author": "Imaginary_Talk_6977"
                },
                {
                    "level": 1,
                    "comment": "Obsessed to say the least. Didn’t expect to enjoy it this much.",
                    "score": 10,
                    "author": "AndaLaPorraa"
                },
                {
                    "level": 1,
                    "comment": "Watch!! It’s so good, it’s a slow burn but man the chemistry!! If you liked My Mister and My Liberation Notes then you might like this",
                    "score": 7,
                    "author": "Comprehensive_Ad4109"
                },
                {
                    "level": 1,
                    "comment": "The weekly episodes threads are some of the busiest in this sub. That says something.",
                    "score": 7,
                    "author": "subtitlesreader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially given it’s only shown on Hulu/Disney Plus",
                            "score": 5,
                            "author": "charmaine54321",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Woah, that's quite the reaction from everyone here! Now, I'm excited. Will start watching today, so glad it's Friday and I can binge over the weekend, yay!!",
                    "score": 4,
                    "author": "kirtinemani",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t binge, watch 2 episodes, read the Reddit thread for those episodes. Wait a bit, watch the next two. \n\nDon’t watch more than two at a time. Even if you see all of them over the weekend.",
                            "score": 6,
                            "author": "subtitlesreader",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched the beginning of EP12 in a commuting train. What a huge mistake!!!!! I should have done it at home so that I could scream",
            "score": 4,
            "author": "idontlikeyoga",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This kind of writing kills me hopefully it gets sorted quickly in next episodes and we move on to future! Giving me slightly Interest of Love ptsd which I definitely not enjoyed lmao",
            "score": 11,
            "author": "munkhjay"
        },
        {
            "level": 0,
            "comment": "Am I the only one who found it a bit disturbing that WooJoo &gt;!slept!&lt; with DongJin without telling him the truth first? Don’t get me wrong, their scene was very hot but I just felt it’s wrong to &gt;!sleep with someone!&lt; under false pretenses. Had DJ known who she was, I don’t think he would have &gt;!slept with her so fast!&lt;. Like he would need some time to forgive his mother about how she treated WJ’s family before he can actually get himself to &gt;!sleep with her!&lt;.",
            "score": 9,
            "author": "Shop-girlNY152",
            "replies": [
                {
                    "level": 1,
                    "comment": "After the last two episodes, I realized I'm okay if the drama doesn't have a happy ending. The entire time while I was watching episodes 11 and 12, I kept saying in my head, \"WJ, just tell him already.\" I'm still really enjoying everything but this one particular thing feels dragged out just because the writer needs it to drag out to cover 16 episodes.",
                    "score": 6,
                    "author": "MirrorMask88"
                },
                {
                    "level": 1,
                    "comment": "Made an account just to comment on this lmao\n\nThis was so frustrating that I felt robbed. While I do understand that it’s hard for her to just come clean to everyone about it, I can’t help but feel a bit done with her at this point. \n\nThe leads slow burn relationship was so good and sweet that when they did finally confess/kiss/whatever I wanted to feel that the wait paid off, but because of this mess of lies (to the ML and her family) I couldn’t even enjoy it fully 😩\n\nI’m still pretty positive it will be a happy ending and all, but goddamnit! I really wish that after all that build up I could have enjoyed more them -finally - getting together rather than just being plain annoyed at how that came to be.",
                    "score": 5,
                    "author": "Pawprin"
                },
                {
                    "level": 1,
                    "comment": "I don’t like her for it and that’s the beauty of these characters to me - they make choices that you really hate.",
                    "score": 3,
                    "author": "eternalhorizon1"
                },
                {
                    "level": 1,
                    "comment": "Honestly he’s so attractive that I can understand her getting swept away in the moment and ignoring all her logic screaming at her in her mind. Like she said her body wouldn’t move and I can’t blame the woman 🤣…",
                    "score": 5,
                    "author": "AndaLaPorraa"
                }
            ]
        }
    ]
}