{
    "id": "12chvdw",
    "score": 48,
    "title": "The Eighth Sense [Episode 3 -4]",
    "author": "samptra_writer",
    "date": 1680695755.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/12chvdw",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/12chvdw/the_eighth_sense_episode_3_4/"
    ],
    "other_urls": [
        "https://mydramalist.com/721085-the-eighth-sense)",
        "https://mydramalist.com/740123-individual-circumstances)Yeodeolbbeonjjae",
        "https://mydramalist.com/people/67021-lim-ji-sub)",
        "https://mydramalist.com/people/115491-oh-jun-taek)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439)\\]",
        "https://www.reddit.com/r/KDRAMA/wiki/rules/",
        "https://www.reddit.com/r/KDRAMA/wiki/policies/)\\],",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/)\\].",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags)",
        "https://www.reddit.com/r/KDRAMA/comments/125rwgw/the_eighth_sense_episodes_1_2/)"
    ],
    "postText": "* **Drama:**[The Eighth Sense](https://mydramalist.com/721085-the-eighth-sense)\n   * **Korean title Title: 여덟 번째 감각**\n   * **Also Known As:**[ ](https://mydramalist.com/740123-individual-circumstances)Yeodeolbbeonjjae Gamgak ,여덟번째감각 , 여덟번째 감각\n* **Network:** Megabox\n* **Premiere Date:** March 29, 2023\n* **Airing Schedule:** Wednesday\n* **Episodes:** 10 @ 30min\n* **Streaming Sources:** Viki,\n* **Director**: Baek Inu and Werner Du Plessis\n* **Starring:**\n   * [Im Ji Sub](https://mydramalist.com/people/67021-lim-ji-sub) (Sisyphus: The Myth)\n   * [Oh Jun Taek ](https://mydramalist.com/people/115491-oh-jun-taek)\n* **Plot Synopsis:** Ji Hyun is a freshman at a university in Seoul. He comes from a small rural town and is used to living in the quiet countryside. He struggles to form meaningful relationships, and moving to the busy South Korean capital has left him feeling disorientated and confused. The older Jae Won, meanwhile, is now returning to Seoul – and the same university – after completing his mandatory military service. The duo starts to develop a mutual curiosity about one another. But things begin to escalate when Ji Hyun joins the same surfing club that Jae Won attends. Their bond begins to deepen as Ji Hyun discovers a love of surfing and the sea. When the surfing club embarks on a journey, the duo finds themselves together alone – and share a kiss. Later, though, Jae Won begins to act as if nothing happened between them. Is this just a fleeting attraction...or the love of a lifetime? (Source: Viki)\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on[ /r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) \\[[Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\\] (2) our \\[[Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules/#wiki_1._conduct)\\] (3) our \\[[Policies](https://www.reddit.com/r/KDRAMA/wiki/policies/)\\], and (4) the \\[[When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/)\\].\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behaviour will lead to increasing exclusions from our community. Any extreme cases of misconduct (such as racism or hate speech) will result in an immediate permanent ban from our community and a report to Reddit admin. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag by writing &gt; ! this ! &lt; without the spaces in between to get this &gt;!spoiler.!&lt; For more information about when and how to use spoiler tags see our[ Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags)\n* **Previous Discussions:**\n   * [\\[Episode 1 &amp; 2\\]](https://www.reddit.com/r/KDRAMA/comments/125rwgw/the_eighth_sense_episodes_1_2/)",
    "comments": [
        {
            "level": 0,
            "comment": "someone please grant me the gift of patience. the wait for these next two episodes has been painful, and i don’t know how i’m going to do it again and again and again over the next 3 weeks. \n\ni watch currently airing dramas all the time but i’ve never felt quite this way before! \n\nwhat makes a drama this enthralling? in part, it’s the cruelty of its first few moments, which leaves the audience with a desperate need to find out whether these two characters survive until the end. then there’s the beauty of the whole production; the moments of contended quietness, the sounds of the waves, the movement of the camera (never quite still), the framing of its characters, the beautifully lit darkness. and thirdly, the dynamic between the central pairing, which is suffused with such chemistry as to make the whole drama impossible to look away from. \n\nand yet, we are forced to look away while we wait for the remaining episodes.\n\ni reiterate, someone please grant me the gift of patience. \n\n(in short, i cannot wait to be done with work so i can watch these two episodes)",
            "score": 33,
            "author": "freyfreyaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I might or might not have been refreshing Viki every 15 min since 7am today",
                    "score": 10,
                    "author": "Maryofthesun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Saaaaame, for hours! Am I imagining it or did they drop way earlier last week?",
                            "score": 5,
                            "author": "Low_Study_2672",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you're right, I was hurrying to throw the thread up because they'd already dropped.",
                                    "score": 5,
                                    "author": "samptra_writer"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ackkdkdksisuwhnwkalsk djduchcbmsowoskd \n\nthe CHEMISTRY\n\nAksjdhduwkwnsbdycyt sysjwkwn jsiwowowudydb \n\nhalp.",
            "score": 20,
            "author": "Flappadingo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beautifully explained.",
                    "score": 8,
                    "author": "duermevela"
                },
                {
                    "level": 1,
                    "comment": "You said it perfectly. Couldn’t have done better. \n\nOff to rewatch til next week *flails*",
                    "score": 7,
                    "author": "wfhcat"
                },
                {
                    "level": 1,
                    "comment": "Same. Same. I feel hungover these many hours later. Wow. CRAZY CHEMISTRY AND TENSION OMGGGG.",
                    "score": 7,
                    "author": "ThoughtsAllDay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as episode 4 finished and the piano music started playing, i began to cry. this drama is so beautiful and moving in ways that are hard to put into words. nevertheless, i shall attempt to do so…\n\nwhat particularly struck me about episode 4 was the focus on mental health and depression. jae won says the following to his therapist, something that struck a real chord: “i want to free myself from human relationships. i’m getting sick of myself wearing a mask when i’m dealing with others.” this relates to his conversation with yoon won in episode 3, where he shares that he’s often pretending to be friendly, to like that which he does not truly like. outwardly, he’s the charismatic leader, free from burdens and envied by all. but the mask he wears is a heavy one, the struggle to pretend everything is fine more than exhausting. \n\nwhat jae won will likely come to learn over the course of this drama, a message of great value to those who experience these same feelings, is that “you don’t have to be loved by everyone”. \n\nand whatever point in life you’re at, it’s “not too late to start a new thing,” a much needed reminder for anyone who feels that they are too old to pursue something that’s of interest to them or create a new dream. \n\nif jae won’s predicament is that he’s been “avoiding reality,” it’s clear that the time he’s spending with ji hyun is providing him with the courage, freedom and space to slowly remove the mask and begin to face the things he’s been running from. \n\nfor ji hyun, his relationship with jae won, as well as the friendships he’s formed since moving to the city (be it with his manager &gt;!or the girl it turns out is *not* interested in him romantically!&lt;), sees a change in his confidence levels. compared to the first two episodes, he’s more self assured and less deferential; a relatable character in the sense that his personality shines most when he feels comfortable. &gt;!though the country mouse is becoming more city mouse, he remains polite and acquiescent when required (the self restraint he showed when being harassed by eun ji was something to behold, though i’d love for him to learn that he should never have to accept that kind of treatment).!&lt; i also really appreciate that he’s an introvert who doesn’t feel a pressure to become outgoing amongst those he doesn’t know or trust.\n\nin episode 4, we see the central pairing become more relaxed in each other’s presence, and a little more themselves. the tension remains, but they’re also more free to tease each other; compared to the first two episodes, they’re on more equal footing. &gt;!the library scene was one of my favourites, in particular the moment at which ji hyun enthusiastically waves at jae won from across the room and holds up his drawing. the smile this brings to jae won’s face and the happiness on ji hyun’s own had me tearing up. i hope ji hyun never destroys that sketch, and wonder whether the thing jae won dreams of learning really will make him famous.!&lt;\n\noverall, these two episodes very much lived up to my expectations, offering emotional depth in ways i wasn’t quite expecting. &gt;!episode 3 was harder to watch as i felt so much empathy for ji hyun, but i’m very glad the “jae won pretends the kiss didn’t happen” only lasted the one episode. both characters have some way to go before they’re wholly open with each other, all masks removed, but i’m so loving the story that’s unfolding.!&lt;\n\nfinal note: &gt;!the hand holding (in particular, end of episode 4 and earlier on when ji hyun teaches jae won how to draw) is so romantic it makes my heart skip a beat.!&lt;\n\nedit: spoiler tags added",
            "score": 17,
            "author": "freyfreyaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beautifully put! After reading the Viki synopsis, I was also scared that the denial after the kiss would last much longer and be a way bigger plot point. So glad to see how they handled that!\n\nAnd they are really knocking it out of the park with the skinship. The subtle touches that last just a second longer than a regular friendship moment would, leaning into each other when talking, brushing shoulders, THE HAND HOLDING,... It feels so real and gives me insane butterflies.\n\nI guess another rewatch is in order now lol.",
                    "score": 6,
                    "author": "Low_Study_2672",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah thank you, that’s kind! and yes i too was very relieved that it wasn’t the big plot point the synopsis indicated it would be! \n\nit does feel like there’s an authenticity to this story for sure; the acting is so convincing, and the way it’s filmed and edited very much feels like we’re being given a glimpse into these characters’ lives as they live them. \n\ni’ll definitely be joining you (and many others!) in that rewatch. whether it makes the wait for the next episodes harder or easier i’m not sure ahaha, but it’s definitely one of those dramas that has immense rewatch value.",
                            "score": 3,
                            "author": "freyfreyaaa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had to mute my notifications I kept seeing all the responses and my fomo was kicking in. \n\nMy god this is beautifully shot, the framing, the colours, the use of negative space. Love this aesthetic, and the soundtrack, they know exactly what they are doing. \n\nThat ex was so petty, if I was her friend I would have slapped her in the face. \n\nThis series is going to absolutely destroy us emotionally. I'm going to try and brace myself for the inevitable.",
            "score": 10,
            "author": "samptra_writer"
        },
        {
            "level": 0,
            "comment": "this has dethroned to my star as my favorite korean bl. idc that it isnt over. its nearly perfection. actually scratch that IT IS perfection.",
            "score": 9,
            "author": "thomasshclby"
        },
        {
            "level": 0,
            "comment": "First of all: I'm trying not to babble here, so if I don't make sense or this is full of typos, pretend everything is fine. I've gone from F5'ing Viki to see if they had updated to wait another week for the next episode.\n\nThe hold this show has on me! The way they look at each other could burn a forest. &gt;!The glances in the shower? Them looking at each other in the taxi? On the rooftop? Not to mention that the start of ep 3 caught me completely off-guard and I had to check I hadn't missed anything!&lt;.\n\nJi Hyun asking &gt;!Jae Won to go for ramen or to have a beer at the dorm, and Jae Won understanding that Ji Hyun is too innocent to realise what he was saying.!&lt;I wish he had explained so he doesn't make the same mistake with someone else.\n\nI hate &gt;!the ex and Jae Won's friend (nothing new here). I've got the feeling there's a story there we don't know yet, but she definitely knows Jae Won has never been straight!&lt;. The bar owner, &gt;!on the other hand, is lovely and I was cheering for her when she was telling the ex to apologise!&lt;. &gt;!Ji Hyun's friend is nice but he doesn't know when to shut up or when not to show up. He stole that kiss from us!!&lt;",
            "score": 8,
            "author": "duermevela",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I hate &gt;!the ex and Jae Won's friend (nothing new here). I've got the feeling there's a story there we don't know yet, but she definitely knows Jae Won has never been straight.!&lt;\n\nI suspect &gt;!we are going to find out that in all the time they were dating they were never intimate or something along those lines and he got with her to please his family since it sounds like he is under a lot of pressure and suffering depression.!&lt;",
                    "score": 6,
                    "author": "WingedGrasshopper"
                },
                {
                    "level": 1,
                    "comment": "&gt;to go for ramen\n\nI almost spat when he said that as I didn't see that coming. 😂",
                    "score": 2,
                    "author": "dramafan1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only watched the first 30 seconds so far DANG WHAT A START",
            "score": 6,
            "author": "Low_Study_2672"
        },
        {
            "level": 0,
            "comment": "I can’t with this show. I watched the first two episodes like 4 times? I have no idea how I am going to get through the next 3 weeks!! I can not stop thinking about this show! It’s so beautiful, the characters are amazing, the story is simple but being pulled off incredibly well, the tension is so thick I don’t think even a knife would do it. In short…wow. \n\nThe ex-girlfriend knows something about Jae Won &gt;!and his sexuality and that he is -assumed- bisexual. There is no other way around her annoying bar scene without that. I wanted to kick her out too after that tantrum she had so having the boss say everything I wanted was awesome.!&lt; I also want to head slap the annoying roommate. Dude is utterly clueless and just stomping all over everything! We did indeed have a &gt;!kiss stolen from us because of him!!&lt; ARGH. \n\nI want to applaud the mental health nods and scenes though! I am a huge proponent of mental health positivity, and am very open about my own issues and that I see a psychologist regularly, so seeing these scenes is so welcome. Whoever wrote this scene (or directed or both) has done therapy, it was super obvious to anyone who has done therapy, as it was so well done. I am so glad this was included and we don’t even have the full story yet. More positive mental health scenes please!!",
            "score": 6,
            "author": "tangledbysnow"
        },
        {
            "level": 0,
            "comment": "JW ignoring JH after the sudden kiss made me both angry and relieved. I was sad for the confused little boy but also happy that JW didn't take advantage of JH's obvious crush on him (something I disliked in Love In The Air and Between Us). I'm glad he tried to keep his distance, and I'm glad he failed. \n\nSo JH set out for a date with AeRi and ran into JW on the train, so he stood her up? 🤨😄  Whenever these two are together, there is an ease in their interactions that comes when two people genuinely like each other as individuals (not just potential lovers). There is also mutual respect there - JW is playful with JH but doesn't patronize him. Being an introvert myself, I get what heady stuff this would be for JH. Add the intense attraction bubbling beneath the surface all the time........whew!! 🥵  They both know they are going to end up in bed and soon. I want them to take their time, the anticipation is the real fun!\n\nAs for the bitchy ex, she showed today that she is too stupid to do any real harm. She is just the kind to out them without their permission, but she won't be able to affect their relationship.",
            "score": 7,
            "author": "KDramaTipsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m wondering was JH &gt;!planning to do the dinner with Ae Ri and running into Jae Won was an accident?!&lt;\n\ndid JW plan it as he maybe was watching JH? &gt;!Like he did later after witchy ex was a witchy?!&lt;",
                    "score": 3,
                    "author": "Flappadingo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was planning to meet her because the next day she said he stood her up and she also said she called and he didn't answer. She was probably the one that called him when he looked at his phone and chose not to answer and put the phone back in his pocket.",
                            "score": 6,
                            "author": "ThoughtsAllDay"
                        },
                        {
                            "level": 2,
                            "comment": "I think the meeting in the train was a coincidence. JH was indeed going to have dinner with AeRi coz she complained the next day about being stood up. Don't think JW planned it either, I guess he was returning from his appointment with the psychiatrist coz JH mentioned later to AeRi that he went with JW since he looked disturbed.",
                            "score": 3,
                            "author": "KDramaTipsy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right! And Aeri said they should have dinner in Gangnam, so it makes sense Jihyun was heading in that direction on the train and ended up at Banpo Hangang park again. \n\nSweet. I needed this thread to put all this together. This part did confuse me. But now it makes sense!",
                                    "score": 6,
                                    "author": "misaeng-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are many things that are confusing but are explained later, sometimes in another episode.",
                                            "score": 2,
                                            "author": "KDramaTipsy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed. And I think whatever he told his Psychiatrist helped him decide to smile when he saw him.",
                                    "score": 3,
                                    "author": "ThoughtsAllDay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, agree. JH hadn't noticed him on the platform but he stood and looked at JH before getting on the train. The decision to sit in front of him was well thought out.",
                                            "score": 3,
                                            "author": "KDramaTipsy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn’t link the doc visit with the timing of him going to dinner.",
                                    "score": 3,
                                    "author": "Flappadingo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obsessed with how badly edited this show is like the chemistry is really holding it together.  The micro expression and subtle flirting between them saves this show from its weaker characters.\n\nThe random &gt;!American running the pizza joint!&lt; every good BL has a couple scenes that literally make no sense and this was one of them for me. \n\nI enjoyed these episodes but they were a lot choppy and difficult to piece together then the first two. Sometimes I want a little bit more context especially when we’re working w BLs that always are under an hour. \n\nEnjoyed an early redemption arc for &gt;!Ae Ri #ally!&lt; \n\nSomehow &gt;!Jae Won not even being remotely out w a very active harmful ex will be to the detriment of this show I fear!&lt;\n\nCan’t believe we gotta wait another 7 days 😭😭",
            "score": 5,
            "author": "adramallamaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "the pizza joint scene made me laugh out loud. Running a restaurant in Seoul without taking orders in Korean seems like bad business sense lol. But on the other hand, showing off the main character's English weirdly is a plot point in most dramas, so I guess that's where they were going with that.\n\nI actually like the choppy editing though. It's kinda frustrating when important pieces are missing (like one or two seconds between episode 2 and 3), but it also makes you pay attention to small details. Normally I would be annoyed by this kind of \"artsy\" style, but for college dramas I like it - it somehow adds to the vibes.",
                    "score": 9,
                    "author": "Low_Study_2672"
                },
                {
                    "level": 1,
                    "comment": "I thought the editing was deliberate and I really like it. Makes the viewers have to piece things together and pay attention to details, plus I think the greatest strength of this show is how the viewer is left in the dark as to many things the characters could also be in the dark about, leaving us to feel the same kind of tension and uncertainty about what's really happening that the characters do.  \n\n\nI don't normally watch BLs so idk how the editing normally is but one thing that kdramas tend to do (which is occasionally a strength, but often a weakness of kdrama) is excessive tell-not-show exposition with flashbacks, monologues, characters talking out loud to themselves like the local homeless guy off his meds, etc. which leads the audience to know WAY more about the characters' backgrounds, feelings, thoughts, inner monologues and motivations than you normally do in western shows. This can be really interesting and cool in character-driven dramas but it can also lead to a situation where it's hard to emotionally connect with characters or empathize with them since you know WAY more than they know about the situations they're in and can't 'feel' those situations the way they can.  \n\n\nThis show is doing a really good job of withholding enough from viewers that you can experience the tension, uncertainty about mixed messages, anxiety etc. in the same way they do  because you aren't given full timelines or info about who was calling on the phone when, why his crush broke up with his gf, what he was doing before &gt;!they coincidentally ran into each other on the train!&lt;, what the motivation for certain actions like &gt;!the kiss!&lt; was etc. I think this is the reason for the choppy editing and it's one of the show's biggest strengths imo (the others being the sound editing/soundtrack and the acting). Having the kind of omniscience about events and character motivations/thoughts viewers usually do in typical kdramas makes you a lot less stressed and a lot more certain what will happen, and also can cause you as a viewer to judge characters as stupid, but here since you are in much the same position as the characters are you feel their struggles along with them.",
                    "score": 9,
                    "author": "OrneryStruggle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely agree! I think what was weird for me with these two episodes was editing wise, it felt choppier then the first two episodes but also again to your point might be intentional. \n\nI watch quite a few BLs when I’m in between dramas and I think hopefully this one does pushes the envelope a bit. It’s also longer in running time then many BLs which I like to see at 30 min a episode instead of the usual 8-10 minutes. \n\nI think either way the set up of this show is really intriguing and has enough going on where I will look forward to it weekly.",
                            "score": 2,
                            "author": "adramallamaaa"
                        },
                        {
                            "level": 2,
                            "comment": "Very true!! It’s sort of a rarity in kdramas for you to not have the character’s whole life story. Like going back to their youth/childhood in flashbacks, or giving screen time to their parents, siblings, or other family,,, so their emotional baggage is spelled out for you. But that isn’t the case for this drama, which I appreciate very much. It’s refreshing.",
                            "score": 1,
                            "author": "misaeng-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not just their whole life story, but in this show we literally don't even get full context for events happening on the show or shortly before the show started, which I think has caused a little confusion for some viewers in some cases (train scene) but then also creates brilliant 'ah' realization scenes like the second time he gets a wetsuit. I actually wish kdramas used this storytelling style more, it's really riveting.",
                                    "score": 2,
                                    "author": "OrneryStruggle"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am wondering if american pizza guy maybe was just filling in? otherwise it made no sense but was still funny. :)",
                    "score": 3,
                    "author": "featherzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I laughed way harder then I thought I would, I was like this is oddly amusing",
                            "score": 1,
                            "author": "adramallamaaa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "AHHH THE CHEMISTRY. THE GLANCES, THE HAND TOUCHES, I CANT DEAL WITH THIS. I AM GOING TO COMBUST",
            "score": 7,
            "author": "120613"
        },
        {
            "level": 0,
            "comment": "I am having the SAME issues and am obsessed with this drama.  The absolute CRUELTY to make us wait!",
            "score": 6,
            "author": "Acceptable_Purple_64"
        },
        {
            "level": 0,
            "comment": "Bruh I wish Our Dating Sim at least had this run-time. That show was so good too albeit in a different way. This show is so nice because I think it isn't being made as a BL but just a good production. \n\nYou can tell every detail was thought out and was made in a more thoughtful and realistic light.",
            "score": 5,
            "author": "lMonsieurPanda"
        },
        {
            "level": 0,
            "comment": "\nRANDOM THOUGHTS DURING MY 10th REWATCH\n\nGuys he called Jae Won Hyung before the beach scene. ep 1 at lunch when Jae won sat down and asked Ji Hyun why he didn’t call him - Ji Hyun says “Hyung I don’t have your number “ … Hyung isn’t translated into the subs tho \n\nAlso the stairs scene at the end of ep 4 is in the first ep too with Ji Hyun alone returned after work \n\nAnd did anyone else notice the voices that lead into title sequence also plays when they Kidd at beg ep 3?",
            "score": 3,
            "author": "Flappadingo"
        },
        {
            "level": 0,
            "comment": "Uff... I can't wait for the nest episode!! 😭😭 I still feel salty about the kiss scene being stolen from us🤧😭😭 the chemi between the two main leads is top notch and it is giving me butterflies😭😭😭😭",
            "score": 2,
            "author": "raiza_boba"
        },
        {
            "level": 0,
            "comment": "Aaah just finished Episode 4... Idk if Seo Jae Won playing with Kim Ji Hyun or he's actually showing interest on him. I feel like he doesn't want a relationship and he's just giving our country-mouse the false feeling.",
            "score": 2,
            "author": "joshlify"
        },
        {
            "level": 0,
            "comment": "So glad the restaurant lady stood up for Ji Hyun as that was such a toxic scene.",
            "score": 1,
            "author": "dramafan1"
        }
    ]
}