{
    "id": "12jc0gv",
    "score": 27,
    "title": "What Are You Watching? - [2023/04/12]",
    "author": "AutoModerator",
    "date": 1681279213.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/12jc0gv",
    "media_urls": [],
    "other_urls": [],
    "postText": "A weekly thread to talk about all the things that we are watching! You are not limited to Korean things, feel free to talk about other dramas/shows you are watching.\n\nFind all the latest What Are You Watching posts [here](/r/KDRAMA/search?q=title%3A%22what+are+you+watching%22&amp;restrict_sr=on&amp;sort=new&amp;t=week).\n\n[Here](/r/KDRAMA/search?q=flair%3A%22On-Air%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) are the latest On-Air Discussions.\n\nFind a list of our related sub-reddits for more in-depth discussions of non K-drama content [here](/r/KDRAMA/wiki/relatedsubreddits).\n\n**Please  remember to use spoiler tags when discussing major plot points or  anything you think should be redacted.** If you are using Markdown and not  Fancy Pants Editor, the easiest way to create spoiler tags is to use  &gt; ! spoiler content ! &lt; without spaces to get &gt;!spoiler content!&lt;. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=week) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "**Announcement**\n\n**The r/KDRAMA 2023 Mod Recruitment Applications Now Open** -- if you are interested in becoming part of the mod team as a content moderator, head to the [recruitment post](https://www.reddit.com/r/KDRAMA/comments/12h5h0b/rkdrama_2023_mod_recruitment_applications_now_open/) for details and link to the application form.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KDRAMA) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Almost finished with Crash Course in Romance. I think from now on I'll only watch a romance drama if its between two middle aged people. And especially if its done in a way that mixes other genres like this show has done.",
            "score": 38,
            "author": "Romoreau",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you seen Love to Hate You?",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's just so fantastic - I couldn't stop watching :D  Been a while since that happened!",
                            "score": 5,
                            "author": "Teleriferchnyhfain"
                        },
                        {
                            "level": 2,
                            "comment": "I tried the first episode and wasn't too sure about it. I might give it another go.",
                            "score": 3,
                            "author": "Romoreau",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it’s definitely boring and wanted to cop out bc it wasn’t interesting. but around ep 2, the characters found their dept and it actually became very fun around ep 4 onwards!!",
                                    "score": 5,
                                    "author": "taylorsanatomy13_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Give it 2-3 episodes, it will be worth every minute spent",
                                    "score": 4,
                                    "author": "vixi07"
                                },
                                {
                                    "level": 3,
                                    "comment": "Like others said, definitely give it 3 episodes, the first two are bumpy. It's so worth it!!",
                                    "score": 3,
                                    "author": "OhMisterBelpit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Netflix says it’s 98% match for me 🙃 will give it a try!",
                            "score": 2,
                            "author": "missussss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was such a pleasant surprise out of nowhere.  Enjoy!",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Watched it 2xs",
                            "score": 2,
                            "author": "Grizby99"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm currently watching the go-back couple, I guess this fits what you're looking for? it's about a recently divorced couple who get pulled back in time to their college days. neither know that the other has been pulled back in time. both are determined to not know each other to avoid their shambles of a marriage. of course, this IS a k-drama, after all...",
                    "score": 3,
                    "author": "waterfallen_empire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve tried this some time ago but I can’t remember why I decided to drop it 😅\nHave you watched it until the end?\nI’ll consider picking it up again for Jang Na Ra",
                            "score": 1,
                            "author": "missussss",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The reason I like this drama is the relationship between the FL and her mom. &gt;! I recently lost my dad and it's cathartic. !&lt;",
                            "score": 1,
                            "author": "pessimistic_koala"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yass I’ve just finished this last night and I looved it 🥰\nI like how they mixed a little crime genre there. I am not very picky about the age of main characters, this drama is just lovely..\n\nCurrently looking for another kdrama on Netflix. So I’m gonna hang around here.",
                    "score": 1,
                    "author": "missussss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Our Blues** (14/20): This drama’s nomination for Best Drama for this year’s Baeksang awards was the push I needed to get back to it. It’s slice-of-life, but the ensemble cast makes it feel both intimate and expansive at the same time. The storylines just keep getting better and better. The scene where Young-ok &gt;!introduced Young-hui to the other haenyeos!&lt; was a wonderful affirmation of humanity. I also love how the landscape of Jeju becomes a character in the drama itself.",
            "score": 22,
            "author": "Telos07",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loved Our Blues! Did you finish it? I want to comment on the last story.",
                    "score": 6,
                    "author": "hopper_25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What did you like about it? I’m on the fence about it since it gives me hometown chachacha vibes, which isn’t a good thing in my case (it felt so slow and nothing really happened. I love my cliffhangers apparently.)",
                            "score": 2,
                            "author": "Puzzled_Kiwi_8583",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like Cha Cha, it is about people living in a small community on Jeju. But every two episodes it changes and focuses on the relationship of 2 other people. Sometimes romantic, sometimes not. So it doesn’t get boring. Characters and stories overlap bad they all know each other. Unfortunately I think the first 2 episodes were the weakest. It picks up after that. \nThe writing is excellent. But it is about relationships so there’s definitely drama but its strong point is that it is so thoughtful. So it may not be exciting enough for you. ? I liked Cha Cha but I personally think Our Blues is in another league.",
                                    "score": 7,
                                    "author": "hopper_25",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the review. I don’t regret watching HCCC, it’s just that I’d never want to watch it again or rec it to anyone. If our blues is in another level though, I’m curious enough to check it out.",
                                            "score": 2,
                                            "author": "Puzzled_Kiwi_8583",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i loved HCCC and just finished rewatching it bc i needed a break from so much drama and fantasy and revenge kdramas. our blues is similar except the stories are more solid and aren’t just, ‘living’ like HCCC but there’s more characters so they’re explored more. even the supporting characters aren’t just supporting. they’re making each story as their own. some stories in the eps give you more perspective over how others live. one has been an underdog her whole life, the other is the son of a mistress who has built resentment on women around him, one has a disabled sister and how life has been for her, teenage pregnancy, single parents, and more.",
                                                    "score": 2,
                                                    "author": "taylorsanatomy13_"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, I still have six episodes to go. I would be interested to hear your thoughts on the last storyline after I finish it!",
                            "score": 2,
                            "author": "Telos07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure! Lucky you! You have some great stories ahead of you!",
                                    "score": 3,
                                    "author": "hopper_25"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I adored Our Blues! Such a fantastic group of actors!",
                    "score": 4,
                    "author": "mustardkitty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Currently Watching:**\n\n**Her Private Life (1/16):** I’ve been mainly watching shorter dramas recently as I found that they are easier for me to finish right now, but I feel like I’ve heard so many good things about this one that I wanted to give it a go!! Who knows maybe it’ll be the one to get me back into 16 1 hour+ episodes again! The first episode was cute, not too overly attached yet but I can definitely see liking it as it goes on! Though as someone who is somewhat into kpop the FL is definitely someone I would avoid online and in real life lol Also, I’m sure it’s been pointed out but the scene where the artist is describing the ML’s process of judging paintings is definitely heavily inspired by a scene in the (best) movie, **The Devil Wears Prada,** where someone was talking about Miranda Priestly judging clothes, which gave me a good laugh!\n\n**Recently Completed:**\n\n**Mad for Each Other** - I liked this one more than I originally thought I would!! I didn’t think the leads had any chemistry at first and felt like I would’ve rather them just be friends, but as the show went on I ended up liking their relationship! The ML’s anger was really jarring (I really struggle with extreme anger especially male anger) but I liked that it showed him really trying to work on it with yoga and such, which made me feel better as obviously he also wasn’t okay with his extreme anger. I loved how readily and easily the ML accepted Unit 705 and how he pushed others into accepting as well! I was worried that was going to be an upsetting storyline but it ended up being so wholesome! Also, I loved loved loved how the Women’s Association quickly owned up to their mistreatment of FL and apologized and went to bat for her, that made me so happy!",
            "score": 19,
            "author": "generalbrowsing87",
            "replies": [
                {
                    "level": 1,
                    "comment": "I finished Her Private Life yesterday- you’re in for a treat! It’s fantastic and binge worthy. This will get you back to longer dramas, I promise!",
                    "score": 5,
                    "author": "Jaffa_Cake_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m loving it so far! Just finished the third episode so I think I’ll easily be able to finish it!",
                            "score": 2,
                            "author": "generalbrowsing87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I liked Mad for each other also.",
                    "score": 5,
                    "author": "attaboy_stampy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Loved that as well.",
                            "score": 3,
                            "author": "Martine_V"
                        },
                        {
                            "level": 2,
                            "comment": "It was so good!! I’m very glad I gave it a try!",
                            "score": 2,
                            "author": "generalbrowsing87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Absolutely loved Her Private Life.  You are in for a treat.",
                    "score": 3,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s so good!!",
                            "score": 2,
                            "author": "generalbrowsing87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hope MFEO gets another season.",
                    "score": 2,
                    "author": "Winter_Corner7254"
                }
            ]
        },
        {
            "level": 0,
            "comment": "late but prison playbook. ugh so good!",
            "score": 15,
            "author": "SDMAJESTY",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to finish that .",
                    "score": 2,
                    "author": "Grizby99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just finished marathoning Taxi Driver 1&amp;2, and waiting for the finale. At first I was wondering who's Wang Tao zi and Madam Lim? Why people raving about them? 😂 Now I understand, who won't fell for Wang Tao Zi lol. And, it's the first time I watch Lee Je Hoon, and maybe because in Taxi Driver he has to do disguises, I can see a lot of his expression, and instantly fell in love. I really like when he smiles, and he smiles a lot!\nAnd because of LJH, while waiting for last 2 eps of TD2, I tried to watch Tomorrow With You. Because I like Shin Min Ah too. And boy, their chemistry there is awesome. Altough the story has plotholes, ( &gt;!seriously, if you will die that day from traffic accident, just stay at home doing nothing!&lt; ) I can watch till the end because their chemistry seems so natural and the writer gave a lot of skinship lol.\nNow I want to watch Signal, but seeing the amount my chores, I'll wait untill I finish them.\nEdited:some typos",
            "score": 14,
            "author": "Incinerated_Sequoia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Add move to heaven to your list too. He shows up shirtless at one point. \n\nExtra note: I was watching the variety show where they reveal the star’s refrigerators and eat out if it. On the episode with Lee je hoon, the people commented on how his mom makes really good food (he lives with his mom) and that it’d be hard for his future wife to cook up to that standard. LJH looks straight into the camera and says, “my mom could teach you.” I died. It was hilarious.",
                    "score": 12,
                    "author": "Puzzled_Kiwi_8583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, my sister said Move to Heaven is good, and I have add to my watchlist. But I think I will watch Signal first.\nI saw that show several days ago, his fridge is full with a lot of food, pretty organized too.",
                            "score": 3,
                            "author": "Incinerated_Sequoia"
                        },
                        {
                            "level": 2,
                            "comment": "What’s that variety show?",
                            "score": 1,
                            "author": "Round_Masterpiece287",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was posted by kcon voyage. Not sure what the show’s called but the title is “Let’s see how our exemplary taxi driver’s refrigerator looks like.”\n\nEdit: I quoted it wrong, but it was the gist of it. \n\nHere’s a link in case it works: https://m.youtube.com/watch?v=bBKHepB6Y_s",
                                    "score": 6,
                                    "author": "Puzzled_Kiwi_8583"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's called Please Take Care of my Refrigerator also known as Chef &amp; My Fridge.",
                                    "score": 3,
                                    "author": "chelleml"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ljh also did a travel show to Cuba with Ryu Jun Yeol, it was hilarious. It's called Traveler. Signal is amazing but kind of dark sometimes, it's still worth the watch but I had to space it out.",
                    "score": 3,
                    "author": "dzaffah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completed:\n\n* **Kingdom 2 (6/6)** — Loved this drama as a whole because every episode either gave us more to worry about or more resolution. I was going to rate it higher than season 1 because it packed a lot and also managed to not feel overwhelming. However, they did the Netflix thing - an open-ended finale that didn't need to be there cause they're hoping for more money. 8.5/10. Would recommend if you like zombie shows or thrillers.\n* **Our Blooming Youth (20/20)** — What a drag this was. Glad it's over. Started it for Park Hyung Shik, but ended up being disappointed by the pacing and romance. It started off with a promising plot, but dragged for a bigger-than-justified chunk, then rushed towards the end. How does one manage to screw up the pacing this much? I could ramble about all that I disliked, but in summary, it was boring. Now, onto the good. Park Hyung Shik really suit his role. Plus, the second couple was entertaining and cute. it was a treat seeing them on screen. That said, 2/10. Would not recommend. I sacrificed my time to warn you guys.\n\nCurrently Watching:\n\n* **Mystic Pop-Up Bar (10/12)** — I knew this was going to be more interesting. The angst! So good. I won't say this will be one of my top dramas, but it's good enough. The second couple don't interest me. I just care for the two older leads. They're so cool and interesting. They make you love them more and more each episode. The dynamic between the main characters (the trio, really) is great, too. Can't wait to finish it and rank it.\n* **Taxi Driver 2 (14/16)** — I started watching this sped up, and I don't regret it. One more week and it's over.\n* **Hometown Cha-Cha-Cha (5/16)** — It's so fun having a watch partner for this. Yes, the pace we're going at is slow because we have to work around each other's schedules, but it's great! The characters are super intriguing, and I love how each one of them plays a role in the story. Also, the further I go along, the more I see why my watch partner is in love with Kim Seon Ho. What a great actor. His eyes are so expressive. I can see this easily being a 10/10 for me.\n* **Joseon Attorney: A Morality (4/16)** — I was worried for a second since episode 3 was very all over the place, and it had barely any focus on its heart and soul - Kang Han Su. Thankfully, episode 4 was filled with him, and it was a great one. I love KHS's antics, and the chemistry between the leads!! If you finished episode 4, you know what I'm talking about. I'm dead. Honestly, this drama deserves more attention. Its over-the-top comedy, plus a little bit of revenge, I can see how it could turn out average, but Woo Do Hwan's charisma really pulls this show together. Watch it! This is one of the lighter sageuks I've seen, second to Mr. Queen. This is your sign. Watch it.",
            "score": 14,
            "author": "unlikelystory98",
            "replies": [
                {
                    "level": 1,
                    "comment": "I already gave up waiting for Kingdom 3",
                    "score": 3,
                    "author": "Incinerated_Sequoia"
                },
                {
                    "level": 1,
                    "comment": "I gave up OBY after 4 episodes. I cant believe they just ruined such promising story.",
                    "score": 5,
                    "author": "YoshidaKyo"
                },
                {
                    "level": 1,
                    "comment": "I’ve been wanting to watch OBY but waiting until it finished… so your review saddens me a bit. I will look for my PHS fix elsewhere.\n\nHowever, thanks for your little preview of Joseon Attorney.  I think I’ll watch that next as soon as I’m finished with My Country, wherein Woo Do Hwan’s character is 90% likely to have a tragic ending. He is such an amazing actor!",
                    "score": 3,
                    "author": "peainsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I looove WDH in My Country. It's my favorite performance of his as of yet. Joseon Attorney is like a complete 180 from his character in My Country. He's angsty on the inside, but that's where the similarities end. I hope you enjoy it if you get to watching it!",
                            "score": 1,
                            "author": "unlikelystory98"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I adore Mystic Pop Up Bar. I think it may have been my first K-Drama.",
                    "score": 2,
                    "author": "FeralAF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Glory (2/16) I just started today. It has already sucked me in! It's about getting revenge on past bullies. I'm all for a good revenge plot. It's on Netflix.\n\nI've had quite a long break from K-dramas (over a year) due to guilt about slacking on my Korean learning. But I decided that I can enjoy dramas without feeling bad about not studying Korean.",
            "score": 10,
            "author": "TheSleepyPanther",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can relate to feeling guilty about watching Kdramas while taking a break from learning Korean.  I agree, there's no reason to not enjoy Kdramas just because we're not studying as much as we would like to.  If anything, watching Kdramas should at least help us retain some familiarity with vocabulary and listening comprehension.  \n\nI hope you continue to enjoy The Glory.  I found it to be very compelling.",
                    "score": 6,
                    "author": "Moonrisedream42"
                },
                {
                    "level": 1,
                    "comment": "I enjoyed The Glory more than I thought I would.\nTo be honest, it was hard watching episode 1 because of the &gt;! intense bullying scenes !&lt; , I just found it very disturbing.\nThough, I am glad that I continued watching the series until the end.\n\nIt was nice to finally watch Song Hye Kyo again in a drama that I truly enjoy.\nI’ve been her fan since my first kdrama: Full House, which was gold in its time, the early 2000s.\n&gt;! Please don’t shoot me but I don’t like “Decendants of the Sun”——an overrated &amp; overhyped one in my opinion. !&lt;",
                    "score": 1,
                    "author": "missussss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished: Her Private Life- brilliant! Really enjoyed the romance and ensemble cast. Can see why it is so popular. \n\nRecently watched: \nCoffee Prince. Loved it, it joined the higher ranks of my all time list with ease. I can see why it is a classic. \nAlso lately watched I Am Not A Robot and the film Love and Leashes. Netflix is keeping me happy with their offerings- I’ve really enjoyed all of the recent dramas I’ve watched.",
            "score": 9,
            "author": "Jaffa_Cake_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try to track down Crazy Love.  He was brilliant in it.",
                    "score": 4,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will add it to my list, thank you.",
                            "score": 1,
                            "author": "Jaffa_Cake_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ahaha, I finished Coffee Prince like two weeks ago and have two episodes left for Her Private Life, I enjoyed both! I added I Am Not A Robot to my Netflix list earlier today, I take it you liked it?\nI'm also 2/3 through Lovestruck in the City and really appreciate its rather unique style of storytelling, beautiful visuals and short and snappy episodes. I can't always relate to the behaviour of the two lead characters but it's still loads of fun to watch.",
                    "score": 5,
                    "author": "OhMisterBelpit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d delayed watching I Am Not A Robot for a while as something in the synopsis had put me off but I loved it. Great character development and supporting cast, only a few episodes in and I was fully invested. \n\nI really enjoyed Lovestruck In The City. I liked the mix of stories and binged through it quickly. \n\nI am now watching the often recommended Something in The Rain (6/16) and it is also excellent. I’m having a romantic spring!",
                            "score": 3,
                            "author": "Jaffa_Cake_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awesome, thanks, I Am Not A Robot goes to the top of my list then.\nI really enjoyed Something In The Rain at first (apart from the repetitive music) but stopped watching around where you are due to the FL's mother. I just couldn't stand her any longer. Not sure I'll continue, I might go for One Spring Night instead. Though the chemistry of the SITR FL/ML was one of the best I've seen, they are sooo cute together!",
                                    "score": 2,
                                    "author": "OhMisterBelpit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So cute!\nI’m still loving it but I think each episode could be 10m shorter - some of the lingering shots linger for too long.",
                                            "score": 2,
                                            "author": "Jaffa_Cake_"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Coffee Prince is one of my fav KDramas - I own it &amp; have watched it twice :D",
                    "score": 3,
                    "author": "Teleriferchnyhfain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Current:\n\nHealer (5/20) — I am working through my list of old dramas and this one I have been meaning to start for awhile. You can definitely tell it’s an older one but wow! I can see why people say what they do about it! Ji Chang Wook is a god. I already knew that (this is maybe like my 6th drama with him? I’m not sure but it’s many) and he is very very good in this one. \n\nThe Eighth Sense (4/10) — BL — It will be 6 once they update with today’s releases because I am obsessed with this show! It’s beautiful, the story is so well done, the tension is out of this world. I have watched each episode more times than I care to admit. This show is beyond amazing regardless of BL or not.\n\nThe Real Has Come (6/50) - typical makjang weekend family drama about a contract marriage. I don’t usually watch these as they are too long - and this one is a current on air one so I guess I have my weekends set until October! - but I’m liking this one a lot. To the point I am actually watching it without subs and then rewatching with subs (after Viki adds them). So much drama but it’s different from everything else that I am watching, I love contract marriages, and the pacing is great.\n\nUnconventional Love Story (8/10) — BL — I loved the manhwa! I am not excited by the leads chemistry but not disappointed like many others are. It fits the characters well. There just isn’t that intense chemistry like in other dramas. I was super worried about pacing but they corrected that and frankly it’s still pretty good. \n\nCompleted:\n\nCall it Love — This slow melodrama was awesome. It ended so well and I loved everything about it. I have a lot more thoughts but going to stick them in the on air discussion.\n\nMe, my Husband, and my Husband’s Boyfriend — Japan — I watched the first 5, read the manga, then watched the last 5. I dunno. This is definitely LGBTQ+ and not BL. And it is a super deep and incredibly complicated drama. The subject matter here seems easy at first, but it’s not. I have a lot of thoughts about this one but am still wool gathering. It’s very good just very very complicated. And I think that you might have to be LGBTQ+ to really fully appreciate it (I am bi that’s part of why I said that). \n\nNon-Korean:\n\nA Boss and a Babe (6/12) — Thailand BL — they are adorable! The characters and storytelling are awesome. This one is totally worth the time.\n\nBed Friend (8/10) — Thailand BL — NetJames are so freaking good. I don’t even have words for how much I love them. And they are so pretty. Especially James, which was obvious on this last episode. This show is amazing. \n\nOur Dining Table (1/10) — Japanese BL — I watched the first episode then went and read the manga to see what I was in for. It’s cute! Little kids and dogs make the best wingmen so this is perfect for that. This is going to be a fluffy, heart felt, cute little drama with little to no angst. The leads are two amazing actors who definitely will propel the storyline forward meaningfully. This is going to be a good one.",
            "score": 9,
            "author": "tangledbysnow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bit jealous you have 15 un-watched episodes of Healer left, enjoy!",
                    "score": 9,
                    "author": "OhMisterBelpit"
                },
                {
                    "level": 1,
                    "comment": "&gt;This show is beyond amazing\n\nThe episodes that aired today, from the Eighth Sense, exceeded all my expectations (EP05 and EP06). This KBL is truly one of a kind 👌.\n\nIt seems I'm watching all the same shows as you 😅 I finished Healer last week and loved it!!\n\nI'm still planning to watch \"Me, My Husband and my husband's boyfriend\". Can I assume correctly that it has similar vibes as \"More Than Words\"?",
                    "score": 4,
                    "author": "Ambiguous-00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Episodes 5 and 6 exceeded my expectations as well! The Eighth Sense is truly special and I don’t mean that lightly. \n\nYes, similar vibes between MMHandMHB and More Than Words.",
                            "score": 3,
                            "author": "tangledbysnow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Picked up Eighth Sense this morning pretty much based on this comment chain - it’s so sweet!",
                                    "score": 2,
                                    "author": "Altruistic_Reveal_51",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've seen Healer 9 times - rewatch every December.  JCW is absolutely a god LOL  I own this drama in fact LOL",
                    "score": 4,
                    "author": "Teleriferchnyhfain"
                },
                {
                    "level": 1,
                    "comment": "Haha adding 8th sense to my list immediately 🤣\n\nThankfully, it's available in my region. With Viki, you can never be sure. \n[Viki link](https://www.viki.com/tv/39344c-the-eighth-sense?utm_campaign=container_share&amp;utm_source=unified&amp;utm_medium=share_button_android&amp;utm_term=39344c&amp;utm_content=social-post)",
                    "score": 3,
                    "author": "vixi07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m absolutely loving ‘Young Lady and Gentleman’ on Netflix U.K. It’s so charming and sweet with a ‘dollop’ of melodrama. I’m not a teenager ( far from it!) and normally go for more ‘realistic’ fare. But I was/am swept along by the sheer forceful charm of this. Reached the point where Dan Dan’s real mother is about to return to the States. I find with the amount of episodes one gets into the characters more than say an 8-10 episode stack.",
            "score": 8,
            "author": "steveroxy3",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; It’s so charming and sweet with a ‘dollop’ of melodrama.\n\nAs a survivor of that drama, I look forward to your comments on it later on!",
                    "score": 9,
                    "author": "myweithisway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Survivor, lol!",
                            "score": 5,
                            "author": "Current_Volume3750"
                        },
                        {
                            "level": 2,
                            "comment": "And you shall have them, by Jove!",
                            "score": 3,
                            "author": "steveroxy3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m watching Joseon Attorney which is so good and gorgeous to look at, Tried watching The Real Has Come today. It has some potential but I can’t handle the flat lighting. They obviously didn’t have much of a budget. I’m also watching Fiery Priest because I was so taken with Kim Nam Gil after watching Island. Fiery Priest is one of a kind. Like a live action webtoon. But it gets funnier as it goes along. Laugh out loud funnier. You have to get into the mode of the drama. In the beginning I thought, What the…?  Lol.  I WAS watching Divorce Attorney Shin which ended 😩  watching Our Blooming Years, Spies Who Loved  Me and I may go back to Secret Romantic Guesthouse",
            "score": 7,
            "author": "hopper_25"
        },
        {
            "level": 0,
            "comment": "**Watching**\n\n**Call It Love** (14/16) - I am so grateful to this show for &gt;!not creating any misunderstanding between DongJin and WooJoo. The reveal actually made them love each other more!  Also, I am disliking HyeSeong more and more. I didn't like how she dumped SuHo unceremoniously without giving him any kind of closure. And then she went and revealed WooJoo's secret to their mother. It's not like WooJoo is some irresponsible child who has to be taken to task! Who is she to decide that WooJoo needs to move miles away not only from the man she loves but also her best friend who is her only emotional support?!&lt; I really hope Jun doesn't end up with her. He deserves better.\n\n**The Eighth Sense** (4/10) - So raw and immersive! The intense attraction at first sight is so well done, and so is the gradual falling in love. There's a melancholy vibe that hints at a sad ending but I'm keeping my fingers crossed for a happy one.\n\n**Once Again** (33/50) - This one is as good as My Father Is Strange which is my all time favorite long drama. Had started it a few months ago and then put it on hold after 30 episodes (coz life!). By the time I got back to dramas there were so many exciting ones to watch that this one stayed on hold. Picked it up again this past week and am feeling good about returning to this crazy and warm family, and their equally crazy friends and lovers.\n \n(Thailand) **Bed Friend** (8/10) - The latest episode saw &gt;!the bad guys getting their due, plus Uea and King finally moving on from being friends with benefits to lovers. It was wonderful to see Uea's boss getting him an appointment with a psychiatrist after knowing he was sexually harassed at work.!&lt; Good to see another drama (after The Eight Sense) acknowledging that mental health issues are real and can't be solved even by the most thoughtful lover.\n\n(Thailand) **A Boss And A Babe** (6/12) - The sleazy title is misleading. This one is a cute and funny romcom between two sweet guys who are helping each other heal from their past hurts and falling in love in the process. It's become my weekly happy pill that I watch with a silly grin on my face!\n\n(China) **Love Between Fairy and Devil** (26/36) - I can see why it is so loved, but it seems Chinese drama style isn't for me coz I keep dropping every Chinese show I begin. Will finish this coz I want to finish at least one Chinese drama.\n\n**Dropped**\n\n**Unintentional Love Story** (7/10) - The least I expect a romance to give me is chemistry between the leads. The show isn't doing anything wrong but the leads look so uncomfortable with each other that it's difficult to sit through. Dropped at 7 episodes.\n\n(Taiwan) **Triad Princess** - Started this for Jasper Liu who I liked a lot in Before We Are Married (a weak show with an irritating FL but he had carried the show on his personal charm). I expected something similar here too but in the 4 (out of total 6) episodes I watched, his screentime was about 15%. Random side characters get more screentime and character growth than him. The show is centered around the FL and the people in her life, of which the ML is a small part. This shouldn't have been marketed as a romance if it wasn't one. Dropped at 4 episodes.",
            "score": 7,
            "author": "KDramaTipsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The Eighth Sense\n\nI haven't started this one yet cause I'm waiting to see how it turns out. I've seen some spoilers that hint of a happy ending, but I'm waiting to see before I go through the angst.\n\n&gt; Unintentional Love Story\n\nI'm still watching, although I agree that at least the main couple fall into the classic Korean BL \"bromance\" trap. I like the story overall though.\n\n&gt;Triad Princess\n\nI watched this forever ago and you're right to drop it. It wasn't bad overall, but it ends on a cliffhanger with no obvious solution and no plan for a season 2 that I could find.",
                    "score": 4,
                    "author": "adelaide797",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I suggest you start watching The Eighth Sense. The weekly wait is indeed torturous but it's a show where it is better to wait between episodes than to binge. There are too many nuances that are best savored slowly and discussed with others week on week for all of it to make sense.\n\nAbout Triad Princess, thanks for letting me know it ends on a cliffhanger. I found the whole thing quite pointless TBH.",
                            "score": 6,
                            "author": "KDramaTipsy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unintentional Love Story\n\nSo I read the director, a traditional Kdrama type, was trying to keep it under a general audience rating to appeal to a general audience better. And I guess episode 7 almost went over that rating, even with nothing but that 1 kiss. Behind the scenes the actors had a whole lot more chemistry and were happy to go farther. Frankly, I say F that personally. It’s just like here in the States, LGBTQ+ content of any type automatically gets it a higher rating, even when everything else is the same to something not LGBTQ+. It’s all BS. For that I will voice displeasure but I won’t stop watching. \n\nAnd I am obsessed with the Eighth Sense. This is so beautiful and wonderful that I hope I am not disappointed.",
                    "score": 3,
                    "author": "tangledbysnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The funny thing is BLs in Korea are not even aired on TV. They are all web dramas. And yet a camera angle kiss is all they feel they can show.",
                            "score": 1,
                            "author": "KDramaTipsy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know, that’s why it’s all very weird. But I read that in several places. I wish they had been bolder with the story. This is one of, if not my top, favorite manhwas. I wasn’t expecting smolder, given the characters, but something more would have been nice.",
                                    "score": 2,
                                    "author": "tangledbysnow"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Unintentional Love Story  \n&gt;  \n&gt;(7/10)\n\nTapping out Tipsy? I'm find it a tad draggy myself tbh\n\nFor LBFD I assume the hype is just because of Dylan....he is serving FACE in that series. I just picked up Starry Love (cdrama) because tik tok edits so have to see, I've been let down before lol.",
                    "score": 2,
                    "author": "samptra_writer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TBH I wanted to tap out earlier but stuck around for the second couple. They have better chemistry but get 2-3 minutes per episode. I will be better off watching their own cut somewhere on YouTube later.",
                            "score": 1,
                            "author": "KDramaTipsy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, I finished LBFAD mostly because of Charles Lin as Shan Que. He just is too adorable for words, plus he's a dragon. I watched him in **Use for My Talent** after that and he's an adorable bodyguard in that! The 2nd pairing is wonderful in UFMT, imo.\n\ncdramas can be exhausting, though. I hit episode 48 or so and I'm like \"I did not train hard enough for this.\"",
                                    "score": 2,
                                    "author": "ManicPixieOldMaid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have decided to give up on Cdramas after this finishes. Not my thing 😕",
                                            "score": 2,
                                            "author": "KDramaTipsy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished **Misaeng: Incomplete Life**. I liked it a lot up until about ep 12 when I thought it started to lose focus or something. I will always be thankful to this drama for introducing me to Lee Sung-Min.\n\nJust started **Divorce Attorney Shin (3/12).**  I'd been looking forward to watching Cho Seung-Woo in this but I feel like his character hasn't been flushed out yet. Hoping it comes together more. Not loving the FL.",
            "score": 6,
            "author": "meggktown",
            "replies": [
                {
                    "level": 1,
                    "comment": "You need to watch Lee Sungmin in Reborn Rich!",
                    "score": 5,
                    "author": "soundtrack19999"
                },
                {
                    "level": 1,
                    "comment": "Misaeng was really good until they lost the Go plot. And then the final episode where some of the characterization was ruined.",
                    "score": 1,
                    "author": "FeralAF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, the GO plot never occurred to me. And I saw no reason for them to go to Jordan.",
                            "score": 1,
                            "author": "meggktown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Jordan part made little sense. And then &gt;! to have him attack that man? it ruined the character for me. he was always a good decent guy and they made him the same as all the other people who got power and then became bullies. !&lt;",
                                    "score": 1,
                                    "author": "FeralAF"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently watching:\n\n**Hometown Cha Cha Cha** (11/16) - slowly making my way through this. I like most of the characters, but I'm still not a huge fan of the ML and wish the SML was the lead. I'm actually considering seeking outore of Lee Sang-yi's shows in the hopes of seeing him happy.\n\n**Strong Woman Bo Dong Soon** (12/16) - also slowly making my way through this, but it's my Saturday night show with my husband, so that makes sense. Really love the chemistry between the leads and actually like the weird gangster side plot. Nig really a fan of the serial kidnapper side plot, although it looks like will hopefully wrap up soon.\n\n**Peak Time** (4/11) - got sucked into this one when Viki recommended it and I didn't feel like watching anything else. It's actually really good and I love how overall positive it is. Plus some of the performances are ridiculous!\n\n**Unintentional Love Story** \\- slow burn and last week was all the drama, but I generally like this one.\n\nOn Hold:\n\n**Love To Hate You** \\- we got 3 episodes in and then got distracted by other things. Will come back to it eventually.\n\nCompleted:\n\n**Twogether** \\- overall a fun variety show. Easy to watch and Lee Seung-i and Jasper were fun together.\n\n**Our Dating Sim** \\- incredibly well done and instantly went on my rewatch list.\n\n**A Shoulder to Cry On** \\- great up through episode 6. I honestly think it should have ended there. Episode 7 really didn't add anything and seemed to just be tacked on to give fluff.\n\n**Jack O'Frost** \\- overall good, but the last episode felt rushed compared to the rest of the show.\n\n**From Me To You (Kimi Ni Todoke)** live-action adaptation - I actually liked this better than the anime, although I really enjoyed the anime. The writing felt tighter in the live-action version and I liked that it extended past the anime.\n\nOther Stuff I'm Watching:\n\n**Bed Friend** (Thai) - all the mess, but kind of good?\n\n**A Boss and a Babe** (Thai) - fluffy goodness with surprising depth. It's my palate cleanser after **Unintentional Love Story**'s drama.\n\n**Our Dining Table** (Japanese) - has a kind of **Old Fashion Cupcake** vibe in that it seems as much about finding yourself/found family as any romance that might happen. Really enjoyed the first episode.",
            "score": 7,
            "author": "adelaide797",
            "replies": [
                {
                    "level": 1,
                    "comment": "LSY is happy by the end of HTCCC too!",
                    "score": 2,
                    "author": "soundtrack19999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yay!",
                            "score": 1,
                            "author": "adelaide797"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kimi no todoke, is it better than the last live action?",
                    "score": 2,
                    "author": "YoshidaKyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've only seen the live action series from 2023, so I can't say. But the casting for the 2023 version is spot on.",
                            "score": 1,
                            "author": "adelaide797",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? I saw the trailer but the ML with his baby face isnt really convincing as Kazehaya but thanks, imma check it out though",
                                    "score": 2,
                                    "author": "YoshidaKyo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unlock My Boss (4/12) It's fun, very silly but well made so far. Gotta love a redemption arc for a loan shark!\n\nCompleted:\nTouch Your Heart: what a sweet heartwarming romance. I could have used even more romance. So light and soft and enjoyable. \n\nOur Dating Sim: Such a sweet and easy watch. Definitely need more web dramas like this one. \n\nUp Next:\nHallelujah! Bora Deborah is apparently on Amazon Prime in the US under that title True to Love. Many thanks to the redditor who noted this. Really looking forward to watching. \n\nI'm also looking for a very soft romance drama. I need something that requires very little attention, has little to no plot, and everyone is just nice.",
            "score": 6,
            "author": "Sunshine_raes",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! I should give this a shot because people keep recommending it to me!",
                            "score": 1,
                            "author": "Sunshine_raes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Weekly Drama’s**\n\nCompleted Glory I &amp; II -  Enough positives have been written about this one so I’ll just add the same. Best Song Hye Kyo scene – baiting her mom into a flame-out. Tremendous supporting cast. No surprise if Song gets the Daesang award this year.\n\n[Taxi Driver II](https://mydramalist.com/705589-taxi-driver-2)– First few episodes reminded me of US eighties drama’s, A Team comes to mind which is:  simple plots and pacing, end with a hammer drop feel-good resolution. But it adds the special Kdrama coloring that I love. Pure escapism, no thinking allowed.\n\n[Oasis](https://mydramalist.com/694757-oasis)– Surprise! Intrigued because of the retro-70’s-80’ student uprising tie-in.  Had my doubts they could pull it off for 16 episodes; but damn, the cast and story grabbed me right away and its staying consistant so far (fingers crossed). The fact the characters have a strong vibe of the classic ‘95 Drama “SandGlass”  is a nice touch.\n\n**Variety**\n\n[Jinny’s Kitchen](https://mydramalist.com/746907-seo-jin-s)  Follow up to Yoon’s Kitchen with Kdrama’s AListers opening a Korean restaurant in Mexico. Funny, entertaining, makes me hungry when I watch it.\n\n[Knowing Brothers](https://mydramalist.com/25568-knowing-bros)– Format change added a needed refresh. Still full of snappy banter when they get the right mix of guests and can be hilarious.  Completed 377 episodes with this one.\n\n***Don’t make ‘em like they used too*** –  (Rewatches)\n\n[Goblin](https://mydramalist.com/18452-goblin)(2) Still moving for me. Old shows seem to get a hard knock sometimes and, yes, this one can be a little dated in a few places, but the overall tone and genuine cast vibes is still there to see.  Like Hotel De Luna, this one will survive several watches for me.\n\n[Night Light](https://mydramalist.com/20294-night-light) (3+) – Netflix.  Pure nostalgia. Kdrama 101 school in ’15-’16.  20 episodes with a 3-month production shooting schedule - insane. Learned the basic chaebol/revenge storyline from this one.  Few sets, sparse scene staging, but Lee Yo Won and Uee sport the current fashion.   Advertised as a “Womance” and it is.  Also, it has an acting-baby Jung Hae In (DP,Snowdrop) in his first action role.",
            "score": 7,
            "author": "stumpy1949"
        },
        {
            "level": 0,
            "comment": "**Bulgasal: Immortal Souls**: the intensity of this one is SOMETHING ELSE.  \n\n**Because This Is My First Life**: I started this because I saw it recommended as “as show that gives you butterflies all the way through”; once I got invested I searched it up on here only to see a bunch of “WTF on that ending‽” post titles and now I’m scared about where it’s going to go 😄. \n\nFinished **The King’s Affection**, which I really enjoyed despite the modern music and finding many of the the comedic/fluff elements a bit too broad for my taste. Reading the episode threads on that on also introduced me to the phrase “Secondary Lead Syndrome”, which explains my feelings for Lee Hyun as well as for Kang Shin-Jae and Jo Yeong in **The King: Eternal Monarch**.",
            "score": 7,
            "author": "darcysreddit"
        },
        {
            "level": 0,
            "comment": "I finished **A Witches' Romance**. I loved the noona romance part of it. The leads did an excellent job portraying the connections they made as well as the complications caused by their age gap -- I think they really nailed it. I did not like the &gt;!love triangle. It's incomprehensible to me why two 40 year olds would think that you could just jump back into a relationship that ended with (mutually felt) abandonment 6 years before. If the FL and SML were in their 20s, I might believe they were inexperienced enough to think this would work. Though to be fair, I think the FL was mostly just overwhelmed and confused.!&lt; \n\nIt's a busy time for me, but I feel a little lost without a drama going. So I've been looking for short non-binge dramas that I can sneak in at lunch or just before bed. I watched **Old Fashion Cupcake**, which was really beautiful. A simple story and well told. I'm currently watching **Midnight Diner**, which is an intriguing little slice-of-life.  If anyone can recommend some Korean titles, I'd be grateful!",
            "score": 5,
            "author": "mahnahmaanaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also go through periods of wanting short and sweet shows. I'm a fan of romance, so these will lean toward that genre. I also included Japanese shows and BLs I've really liked.\n\n**Korean**\n\nGrowing Season (Korean) - college coming of age\n\nScripting Your Destiny (Korean) - fantasy romance\n\nCafe Midnight (Korean) - fantasy with multiple separate plots\n\nPop Out Boy (Korean) - comic book ML come to life\n\nTwenty Twenty (Korean) - coming of age college romance\n\nGaduri Restaurant (Korean) - romantic comedy\n\nAdult Trainee (Korean) - three separate (but somewhat connected) high school coming of age stories\n\nHit the Spot (Korean) - explicit romantic drama with finding yourself sub plot\n\n**Japanese**\n\nRinko-san Wants To Try (Japanese) - mature romantic comedy\n\nRokuhoudou Colorful Days (Japanese) - slice of life in a cafe\n\nSweat and Soap (Japanese) - workplace romantic comedy\n\nIn House Marriage Honey (Japanese) - contract marriage\n\nCaptivated By You (Japanese) - quirky interconnected stories in H.S.\n\nNoble Boys (Japanese) - sort of Boys Over Flowers-esque romantic comedy\n\nMy Cuteness is About to Expire (Japanese) - romance with ML learning to accept himself\n\n**BL**\n\nOur Dating Sim (Korean) - estranged friends to lovers\n\nMy Loveix Up (Japanese) - mistaken affection in H.S.\n\nMinato Shouji Coin Laundry (Japanese) - age gap, but really well done\n\nBlueming (Korean) - beautiful college romance\n\nRoommates of Poongduck 304 (Korean) - enemies to lovers with forced cohabitation\n\nThe New Employee (Korean) - workplace romance",
                    "score": 7,
                    "author": "adelaide797",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks so much, Adelaide-shi! I credit you and your excellent recommendations for getting me into j dramas in the first place, so I will add these to my list. I haven't even heard of many of your Korean suggestions, either! I'm looking forward to these!",
                            "score": 2,
                            "author": "mahnahmaanaa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aww, thanks! 🥰 I hope you like them!",
                                    "score": 1,
                                    "author": "adelaide797"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the vein of Midnight Diner, try **Would You Like a Cup of Coffee** and the Jdrama **Maiko-san Chi no Makanai-san (The Makanai: Cooking for the Maiko House)**.",
                    "score": 3,
                    "author": "immerdasmeer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! These both look like they'll be right up my alley.",
                            "score": 3,
                            "author": "mahnahmaanaa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Hospital Playlist. Hospital Playlist. Hospital Playlist 2. Hospital Playlist 2**. I finished HP2 and immediately started from the beginning to rewatch the entire thing. I'm only on ep 7 of HP right now, but I'm noticing so much that I didn't see before. Also, I've been listening to the OST so now I can recognize the songs and hear when they are playing in the background. I'm not ready to let go of this one, yet, so I can't bring myself to watch Dr. Romantic, even though I know I'd like it. Ahn Hyo Seop as a doctor? I'm sure he's wonderful. But I'm not ready to leave this wonderful group of 5 friends who play music and perform surgical miracles every day. This drama (esp Part 2) has shot up to my top 10 of all time. I can't wait to share it with my long-distance drama-watching friend! \n\nAnd with that friend we are watching **Gu Family Book,** one of my all-time favorites. It's so good and Lee Seung Gi + Suzy are a wonderful team. It's a rewatch for me, and I'm really enjoying it! \n\nTrying to bring myself to finish Pt 2 of **The Glory.**  In contrast to HP, in which we see the very best of human beings, this one shows the very worst of human beings and is not at all an enjoyable thing to watch. I don't know why I'm subjecting myself to it (uh - it's Lee Do Hyun) and once again, I get frustrated with Netflix and general media for continually portraying the worst of human beings. Why, oh why, do human beings like to see this kind of thing? (Squid Game????)  If this exposure brings about greater awareness and change, then ok, I'm ok with it. But if it's merely voyeurism of human violence then I give the responsibility to the greedy media creators who feed us this. Rant over.",
            "score": 6,
            "author": "sharjoy3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Hospital Playlist, and I agree about noticing other things on rewatches. When I rewatched S1 while waiting for S2 I paid more attention to the residents and nurses. I also listened out for all the times Confession is not Flashy was used",
                    "score": 2,
                    "author": "Electronic_Piano9385"
                },
                {
                    "level": 1,
                    "comment": "I have to rewatch HP soon while it's still on Netflix!",
                    "score": 1,
                    "author": "meggktown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it leaving?",
                            "score": 1,
                            "author": "sharjoy3",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recently binged Mr. Queen with the recent release on Netflix, and coz I wanted more of Shin Hye-Sun also just finished Still 17. She’s a phenominal actress!",
            "score": 4,
            "author": "Miss-LH"
        },
        {
            "level": 0,
            "comment": "I am currently just rewatching THE HEIRS because as it's gonna be 10yrs to it since it first aired in 2013, this info is making me so nostalgic even tho i just watched it last year for the first time...",
            "score": 6,
            "author": "Tsukuyomi_02"
        },
        {
            "level": 0,
            "comment": "Having drama hangover from my rewatch of **Lie After Lie** so the only kdrama I've been watching is keeping up with the daily drama **The Witch's Game**, which had started off strong and is now limping towards what will likely be an unsatisfactory end. They built up the villains too much in forced ways so that whatever retribution they are receiving in these final 10 episodes or so just don't feel enough.\n\nI've been catching up on variety shows and HaHaBus is adorable (but I like HaHa and Byul already so I'm probably biased). Their kids are funny, especially their daughter Song.\n\nMeanwhile on the cdrama side, I think I'm about to give up on **Warm on a Cold Night** (6/36) because pacing is too draggy and there doesn't seem to be any chemistry between the leads. FL's acting rubs me the wrong way because her cuteness seems too forced and unnatural. Need to hunt for a different cdrama to watch on Viki...",
            "score": 5,
            "author": "myweithisway"
        },
        {
            "level": 0,
            "comment": "I just watched **Wellmania**, a new Australian show, and I had a thought... Watching almost exclusively kdramas in the last few months has made me realise how different english (western?) media is... I was cringing at a lot of scenes in the early episodes and the amount of focus on sex is off-putting. I already felt like there's too much \"adult content\" in media but after watching so much sweet/cute/awkward/protective flirting and love interests it's definitely a very obvious contrast to me. Of course it's possible that's the case with kdrama as well and I just haven't come across those kinds of shows yet, but this is what I noticed. \n\nBefore that I watched **Legal High.** I didn't think much of the story but still enjoyed it. I really like over-the-top eccentric characters so I liked Mr Go despite him also being a greedy money grabber ! :P \n\nNow I'm watching **Summer Strike.**",
            "score": 4,
            "author": "grunge-rat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished Wellmania as well and i always wonder while watching western shows if drugs is really that easily to find and use.",
                    "score": 2,
                    "author": "Round_Masterpiece287",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems very easy where I'm from based on my experiences",
                            "score": 2,
                            "author": "grunge-rat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "- she would never know. I watched purely for rowoon. I liked it well enough, but I’m very forgiving with romances that give me what I want. I think his character is in the top 5 for me (following PSJ in a witch’s romance and KTO in extraordinary attorney woo). \n\n- call it love. This is my favorite show atm. I can’t wait to finish up this drama. I hope they end up together. This show has introduced me to the ml. He is just too precious. I’ve been watching him on variety shows and he’s so cute! I really enjoyed watching him bust out his cooking gadgets. \n\n- taxi driver 2. A bit behind but I’m hoping to catch up soon. LJH is one of my favorite actors. \n\n- welcome to Waikiki 2. This show really delivers with the comedy. Definitely still over the top, but at least it’s expected now. I remember being shocked for awhile while watching s1. \n\n- be melodramatic. Just completed episode 1 and I like it a lot so far. My kid was watching it with me and the whole suicide attempt showed up and I had to put it on hold. I was really upset for that girl that had the baby and the whole situation she was stuck in.",
            "score": 4,
            "author": "Puzzled_Kiwi_8583",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; This show has introduced me to the ml. He is just too precious. I’ve been watching him on variety shows and he’s so cute! I really enjoyed watching him bust out his cooking gadgets. \n\nI know right?  I was introduced to him in The Secret Life of my Secretary.  Then I watched Hello, Me, in which he plays the romantic lead, but the romance is really toned-down.",
                    "score": 2,
                    "author": "Martine_V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would you rec both of those dramas? I need more",
                            "score": 1,
                            "author": "Puzzled_Kiwi_8583",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were okay.  Not my top 10 but I enjoyed both.  Secret Life was a bit frustrating, as I became impatient for the central secret/misunderstanding to be dealt with since it was standing in the way of the relationship. And the show dragged it on.  A bit like I am not a Robot, if you have seen that.  Still, it was a sweet romance with the usual tropes and happily ever after ending.\n\nHello, Me is completely different.  It's a healing drama.  If you like that type of drama, you'll be sure to like this one.  There is a romance but it's very toned down, and is not central to the plot.",
                                    "score": 1,
                                    "author": "Martine_V"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I started **She Would Never Know** for the exact same reason as you, but it didn't catch me quick enough. I will have to go back to it for sure. I'm waiting to finish TD2 until it's fully released, because I am lazy.",
                    "score": 2,
                    "author": "ManicPixieOldMaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should start TR2 now. I think 14 episodes are out so you’ll be able to binge.",
                            "score": 3,
                            "author": "Puzzled_Kiwi_8583"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kim Young Kwang is the cutest anxious person on variety shows lol. I would also recommend [the episode of Gym Jong Kook where KYK is featured](https://youtu.be/EJrRZczyuXE).",
                    "score": 1,
                    "author": "chelleml",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow. I only watched like 2 mins so far, but dude is ripped. I never would have guessed since he’s usually wearing looser clothing. Wow.",
                            "score": 1,
                            "author": "Puzzled_Kiwi_8583"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Vincenzo** (8/20): Fun show, I'm enjoying it.  I like the leads (especially the FL, she's a hoot) and the antagonists.  I can understand why I've seen a lot of memes/gifs of this show online, since each episode has these jaw dropping set pieces.  You could easily chop 10-15 minutes out of each episode though, the tenants of the building get too much screen time.\n\n**Meow the Secret Boy** (4/24): It's cute so far, which is what I was looking for.\n\n**Partner** (4/16):  The last stop on my tour through the Lee Dong Wook back catalogue.  As a legal procedural I find it mediocre so far but he's really good in it and that's enough to make it watchable.  \n\n**Pandora: Beneath the Paradise** (10/16): I enjoy the plot and pace of this show a lot, and I think the villains are fun, the characters we're supposed to sympathize with are very dumb lol.",
            "score": 4,
            "author": "theromanamputee"
        },
        {
            "level": 0,
            "comment": "Just started **One Dollar Lawyer**.  Loving his quirky character and his sidekick.  Only just finished up the 2nd episode but I like where it's going.  Nothing too intense yet but some feelgood moments so far.\n\nStopped watching **Under the Queen's Umbrella** just to get away from evil people.  I will get back to it of course, but just wanted a break. \n\nAlso going back and forth on **Locke &amp; Key**.  Pretty good murder/mystery.",
            "score": 4,
            "author": "Current_Volume3750"
        },
        {
            "level": 0,
            "comment": "Tried to start **BEEF** and I just have to switch. Black comedy makes me too sad.",
            "score": 5,
            "author": "ManicPixieOldMaid"
        },
        {
            "level": 0,
            "comment": "Finally start watching the Fiery Priest. Kim Namgil totally deserve the Daesang!",
            "score": 4,
            "author": "YoshidaKyo"
        },
        {
            "level": 0,
            "comment": "**Completed**: What's Wrong With Secretary Kim. A funny and entertaining show with great chemistry between the leads. And let's not forget about those steamy kisses ☝️\n\n**Planning to watch next:** The K2, True Beauty and Call It Love",
            "score": 10,
            "author": "Ambiguous-00",
            "replies": [
                {
                    "level": 1,
                    "comment": "Recently rewatched True Beauty and it’s definitely a comfort watch. I think if you liked WWWSK you’ll like this one! It’s very funny",
                    "score": 3,
                    "author": "_fewdaysofwonderful"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm watching **Moon Lovers: Scarlet Heart Ryeo** (yeah, I know, I'm super late to this party). And it's GOOD - if we forget about men constantly ignoring the concept of consent. It's so facepalm worthy sometimes. Can I hug you? - No. - proceeds to hug her - she fights - keeps hugging her. OH MY GOD please stop. Ugh. \n\nOther than that, it's good. Like really good. I understand all the hype and I'm glad my mum talked me into watching it. I'm just trying really hard to ignore *those* parts.",
            "score": 7,
            "author": "sentimental_snail",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some Trivia for you 'cause this one is one of my mostest favorites ... IU received tons of negative flak for being in it because by that time she was well-established as \"Korea's Little Sister\" from her idol career ... Complaints generally ran around the idea she was out of her league by taking on the role even though she had appeared in several series prior. \n\nWell ... Time tells the truth about her talent, now don't it. I had no idea she was such a popular singer when I watched ... quickly realized that generally Korean \"netizens\" are insane. Thought she was a little raw but excellent ...",
                    "score": 3,
                    "author": "stumpy1949",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn. It's such a stupid reason to get mad about. Out of her league? Who are they to decide? And you're right, time has shown them: this drama really is a classic now.\n\nI was blown away by her acting in My Mister, she's so talented. So starting this I had no doubts she would be great, and she is.",
                            "score": 2,
                            "author": "sentimental_snail"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I watched the first two episodes of this last week. Decided to put on hold because it was between this and Goblin, and was thinking I’d appreciate more (jury is still out on that one—7 episodes in and not loving it). But idk, I didn’t really feel like Moon Lovers was THAT good either. Does it get better? Again, only watched two episodes. I watched it specifically for IU though because I loved her on Hotel del Luna",
                    "score": 1,
                    "author": "eizeral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's great! It's much lighter in the beginning, and then the further it goes, the darker it gets, with all the fighting for the throne between the princes. I liked it from the start, but I think it gradually gets more, um, substance? The intrigues and betrayals go deadlier, and it's starkly different in mood from the first few episodes that were \"aww all the princes are charmed by her, so cute\".",
                            "score": 1,
                            "author": "sentimental_snail",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s definitely good to know! I will be sure to give it another try once I finish goblin",
                                    "score": 1,
                                    "author": "eizeral"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My Father is Strange 21/52\n\nOasis 10/16\n\nGaduri Restaurant 2/12",
            "score": 3,
            "author": "MajesticConfidence36"
        },
        {
            "level": 0,
            "comment": "Im watching Remarriage and Desires. I was watching it in passing and miss key parts",
            "score": 3,
            "author": "Hen_I_see718"
        },
        {
            "level": 0,
            "comment": "*Completed*\n\n**The King of the Desert**: Very enjoyable absurdist take on work and how it effects life, as well as an dark comedic exploration of what people would do (or not do) for money. \n\n**Nirvana in Fire** (Cdrama): Fantastic. Brilliant. Amazing. I was addicted. The story is really good and the characters are great. Even the very minor characters are fantastic and bring a lot to the show (I can't even decide whose my favourite. Actually no, that's a lie. It is Jingyan.) The acting was really good, and the production itself as well. I can only heap praise on basically every aspect of it.\n\n*In-Progress*\n\n**Queen Seon Deok (3/62)**: Thanks NiF for resurrecting my love for long historical dramas. I have great expectations for this one. Female protagonist and female villain. Kim Namgils star-making role. So far so good.\n\n**MIU 404 (4/11)** (Jdrama): Very fun and cute detective show with heart. The main duo bromance is fantastic but the whole group is fun.\n\n**Payback: Money and Power (2/12)**: I actually had this on hold, as I took a longer break from kdrama. Now I can finally finish it.",
            "score": 3,
            "author": "MilkyWayOfLife",
            "replies": [
                {
                    "level": 1,
                    "comment": "So glad you loved NIF (I mean 99% who finish it seem to)",
                    "score": 5,
                    "author": "zaichii"
                },
                {
                    "level": 1,
                    "comment": "Nirvana in Fire!!!! My fave cdrama. I only started to realise how hot Jingyan is towards the ending eps 😂\n\nHave you watched Love Like The Galaxy where Fei Liu (the actor) grew up and became mega hot?",
                    "score": 3,
                    "author": "storebelly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nYumis cells 1&amp;2 ,just finished brilliant  brilliant show,\n\nForest  ep 14\n\nTaxi driver 2=upto date\n\nTracer=the subtitles/ translations are bad but looks like a good show,",
            "score": 3,
            "author": "Entire-Ebb-927"
        },
        {
            "level": 0,
            "comment": "I just finished watching Summer Strike, which made me feel all giddy inside. The thriller plotline felt a little rushed and random to me though. I also liked the father of Jun, who ended up being a huge softie and generally just funny.\n\nI am currently watching Call it love, I just need to watch the last two episodes and I am really hoping for an happy ending. The ML just really deserves some happiness in his life.",
            "score": 3,
            "author": "koelekikker3000"
        },
        {
            "level": 0,
            "comment": "Watching **100 days my prince** and am binging it straight through, which is always a good sign for me.  I love the leads and the story. The slow-burn romance.  Not super excited about the political machinations which are typical of the genre, but I'm watching it anyway.  The show does a good job of building up the tension.  We can all predict what is going to happen and feel like we are watching a train wreck that is just about to happen.\n\nBig spoilers ahead :\n\n&gt;!I am at the episode where he is exposed as the crown prince and has to go back to the palace.  My heart is simply breaking for him.  He had always been a sad and lonely figure before but now the pathos is unbearable.  After experiencing happiness for the first time since his coronation as Crown Prince, he lost it all.  He is more isolated than ever, as his entire entourage was killed.  His enemies are pretending to be his friends and he can't tell because he lost his memory.  I had some hope that Doh Kyung Soo at least could be an ally.  I felt like it was yet another nail in the coffin when he tentatively asked Kyung Soo for his friendship and was flatly told no.  The show emphasized his isolation when he replies, no we can't be friends.  Drama gods, why so mean??!&lt;",
            "score": 3,
            "author": "Martine_V"
        },
        {
            "level": 0,
            "comment": "**Apple of My Eye** (11/120) - I really like both the main characters and I like the plot too. My least favourite are Joo Hyuk and Ho Rang; and my favourites are Chan Ran and Gyu Cheol (sue me but I ship them)\n\n**Call It Love** (14/16) - so sad that it's ending this week :((\n\n**Killer And Healer** (22/37) - glad i have started this, i really like the cp (they both so gorgeous) and their cat\n\n**Word Of Honor** (8/36) - in lieu of real life being horrendous i have started my rewatch earlier than i planned, but i'm enjoying every second\n\n**Nagatan to Aoto: Ichika no Ryourijou** (2/10) - I like it, but the airing schedule for jdramas will kill me\n\n&amp;#x200B;\n\nCOMPLETED:\n\n* **Jack o'Frost** \\- god this was awesome, I should have watched it sooner\n* **All the Liquors** \\- this was pretty fun, tho the bl aspect was a little underwhelming (maybe because i watched it right after Jack o'Frost?)\n\n&amp;#x200B;\n\n**Till the End of the Moon** (1.5/40) - i'm mostly mentioning it to see if anyone else is also watching and what they think, but in the middle of ep 2 i got so so put off by &gt;!fl whipping the poor ml who at that point did nothing to deserve it!&lt; that i don't actually know if i can continue, I need to be able to root for the main characters. Tho I did see some gifs with Liu Min's appearance (as ml's mom) and if anything will make me keep watching it's her or Wang Xichao, but so far he was only in ep 1 :(( (also if you remember one of the several previous times of me complaining about a character's moral decision that can't agree with and struggling with continuing a drama, welcome, my adhd is officially ruining my drama watching)",
            "score": 3,
            "author": "katherine197_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m watching this - up to episode 18. It gets better - ML and FL are very cute right now.",
                    "score": 2,
                    "author": "Altruistic_Reveal_51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you! i think i'll try to give it another chance",
                            "score": 1,
                            "author": "katherine197_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Realising that I can watch dramas on Viki for free with ads, so I’ve started there.\n\nWhile You Were Sleeping (8/10) - really enjoying this so far. I’ve not long seen W Two Worlds, and really enjoyed that supernatural show and this one, too. The ML is great in both shows, too. It’s weird I saw him in Romance is a Bonus Book first - as much as I like that one, the other two are stronger shows for him. \n\nWhat’s Wrong with Secretary Kim (1/10) - as I loved Business Proposal, I thought I’d enjoy this one, too. It’s okay so far, but I’m not as charmed. It’s only the first episode, though, so I’ll give it time. Especially as I liked both the leads in other shows. And a lot of the supporting cast too.",
            "score": 3,
            "author": "AzureBlueSea"
        },
        {
            "level": 0,
            "comment": "Festivities and all, not much time to spare.\n\nFinished\n\n\\- **Delivery Man:** not much potential from the get go, some fun moments and ghosts do work but romance is mid, thriller plotlines and bad guys more of the usual, the ML kinda flat too. Minah as FL a bright spot, but this is your standard 6.5, passable but not must watch.\n\nIn progress\n\n\\- **Father is Strange (24/52):** getting better thanks to leads only, a lot of secondary storylines and characters quite infuriating but so is the nature of such dramas. Not bad by any means;\n\n\\- **Joseon Attorney (4/16):** amusing though pace is slow and I'm not totally sold on the FL's Mother Theresa act. ML is better with his shades of grey, chemistry is there but the plot needs to push the throttle more. Fun albeit nothing new.\n\nThat's more than enough for now, still searching for a bit of JP/CN flavour to add to the schedule.",
            "score": 3,
            "author": "Hach-man"
        },
        {
            "level": 0,
            "comment": "So moments ago, I finished binging **Love in the Moonlight** (2016), an 18-episode sageuk starring Park Bo-gum, Kim Yoo-jung, and Jung Jin-young, among others.\n\nIt was an epic emotional rollercoaster and I enjoyed almost all of it. PBG has such unique facial expressions he's always fascinating to watch. Am I the only person who thinks KYJ looks a little like a young Drew Barrymore? I think it's the mouth.\n\nAnyway, tragic childhoods, secrets, rebels, Crown Princes, hot bodyguards, there's nothing unique about the plot but that's what makes it comforting. You can just settle in and weep 'til your throat hurts.\n\nA couple small notes: After seeing Kwak Dong-yeon in several dramas, I'm almost ready to dub him the Korean Sean Bean, just because (mass spoiler alert: &gt;!his characters tend to die a lot!&lt;). I have wept many tears over KDY.\n\nThe melee scenes are so perfect, imo! Balletic, well shot and edited, really affecting and exciting! Don't draw those swords unless you mean it (although in the closeups you can totally see how blunt the swords are).\n\nJJY as the 2ML is super adorable and fights like a demon; he's great at making that face that says, \"I just realized I'm the 2ML in a love triangle.\" The face of goshdarnit.\n\nThe fat suit on the Princess is a thing. It's terrible, and I just kinda sighed and let it go.\n\nHaving every loose plot thread tied up in under a minute in the last episode was really satisfying!\n\nOh man, the kissing is not good. It's a lot of face-mashing while they look like they just swallowed bitter medicine. Can't have everything, I guess!",
            "score": 3,
            "author": "ManicPixieOldMaid"
        },
        {
            "level": 0,
            "comment": "*Kokdu: Season of Deity* \\- 2 episodes to go. Right now, it's at the heartbreaking stage, and I'm hoping for a happy resolution, but not sure I'm going to get it.\n\n*Our Blooming Youth* (13/20): Park Hyung Shik is sooo good in this. I just watch him the whole time! Episode 13 was great stuff - the chase! The fight! The danger! Love realised and felt! 👌✊\n\n*Cang Lan Jue* (35/36): My re-watch is almost finished 😢. Episode 35 is so good. So good. They're all grown up, mature and wise and ready to sacrifice.\n\n*Deivery Man* (11/12): I've liked this more than I thought I might. Yes, it's clichéd, no it's not perfect. But it's cute, and heartwarming, and funny. I love the dorkiness and the heartfelt-ness, and how everything is so loaded with necessity/danger/things that have to be done, and the bravery and excitement that brings out.\n\n*The Great Doctor* (17/24): Finally, finally, she's woken up to how fantastic and selflessly protective of her and everyone in the world the general is!! Oh my gosh; it only took her months and his certain death many times 🙄. But it's still annoying. I'm watching still mostly for Lee Min Ho/Chai Yong.\n\n*The Secret Guesthouse*: It's okay. I just know things are going to go a different way than I want them to. But it's intriguing, and we're getting clues, but then more twistiness, so it keeps your interest just enough. They've given the heroine too much makeup, though, and this is distracting for me. The men are all good actors.\n\n*Nothing But You* (12/38): I tried this Chinese modern series out, based on some positive comments, not expecting a lot, and really liked it! Have binged a little, and now waiting for increased translation, since the last couple of episodes were getting pretty hard to understand and enjoy for that reason. Some elements I really like in this.",
            "score": 3,
            "author": "idealistatlarge",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I'm watching still mostly for Lee Min Ho/Chai Yong.\n\nChoi Young is love.",
                    "score": 2,
                    "author": "mhfan_india"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just started the Eternal Monarch on the 6th episode. It's getting good. I was not getting the parallel worlds but it's making somewhat sense. In all case the love story will soon develop.\n\nI also just finished \"A Man and a Woman\" 2016 with Gong Yoo...it was a nice intense movie, very short but packed a punch about adultery and how men end up getting away with things. I thoroughly enjoyed it except for the ending. \n\nI am still watching \"Boys over Flowers\", the girl's character is killing me....not the type of acting/or clumsy character you wanna see paired up with Lee Min Ho....😅, \nAnyhoo, I just started my K2 journey and I love it.",
            "score": 3,
            "author": "athenat007"
        },
        {
            "level": 0,
            "comment": "A FYI to everybody. Bora Deborah episode one in on Amazon Prime",
            "score": 5,
            "author": "Chaneythornhill"
        },
        {
            "level": 0,
            "comment": "**Call it Love** (7/16) Gosh, this is good. Melancholy, quirkily funny, very pretty to look at, in the vein of My Mister/MLN. This and Somebody quickly making me a fan of Kim Young Kwan.\n\n**Divorce Attorney Shin** (5/12) Still loving the friendship between Shin and his buddies and intrigued by Shin's back story. I am not loving the FL(?) rn, nothing to do with her story but her vibe.\n\n**The Heirs** (13/20) I had my doubts. But I am now a believer. Kim Woo Bin is the standout (I keep contrasting Young Do with his dreamy bf role in Our Blues, RANGE, baby!), but have to admit I am seeing the charms of Kim Tan. The handgrabs and forced kisses aside, the way these guys so gruffly and rudely express their affection for Eun Sang is funny and annoying and also realistic for the age they're portraying. Also shoutout to Bo Na, she is the best.\n\n**Korea No. 1** (5/8) Not drama, but an entertaining, lighthearted look at various aspects of traditional Korean cultural heritage (Intangible Cultural Heritage), things like catching anchovies and making jang (sauce). I love this kind of show.",
            "score": 4,
            "author": "immerdasmeer",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Also shoutout to Bo Na, she is the best.\n\nI wasn't sure about her at first but by the midway point I absolutely saw why Chan-young was with her. Myung-soo isy other favorite. The way he's not in any way intimidated by the two guys and just messes with Young-do was the best. Secretly the most supportive character.\n\nThe whole drama was so ridiculously over the top and fabulous.",
                    "score": 5,
                    "author": "adelaide797",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, &gt;! she and Chan-young are fighting rn, he is understandably disappointed in her, but my first thought was \"Chan-young you have to forgive her, she's so devoted to you!\" lol !&lt; And yes, Myung-soo is  so funny and great. Also poor Hyo shin, who &gt;! I'm worried about after this ep, especially. !&lt;",
                            "score": 2,
                            "author": "immerdasmeer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hyo-shin madey heart ache, but he seems to be in a better place by the end.\n\nMyung-soo becomes the best friend to everyone by the end and I love him so much. He's so unabashedly himself.",
                                    "score": 1,
                                    "author": "adelaide797"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On the kdrama front; \n\n**Our Blooming Spring** \\- Finished! I personally really liked it, slow burn for sure, so if you're looking for a lot of romance would not recommend it. It does however have&gt;! a happy ending.!&lt; \n\n**Taxi Driver 2** \\- Another one set to end this week, I need more Je Hoon in my life just saying. I'm hoping we get some serious action in the finale here. \n\n**Faith** \\- Oh Lee Min Ho....he plays the same character every time...\n\n**Monster** \\- watching from my long-form challenge it's certainly somthing. I've stalled out a little on it, need to be in the mood for a makjang. \n\n**One Dollar Lawyer** \\- finished this one as well, it had a lot going for it, but super rushed and once I heard why I get it. If you are looking for a series for a ppl on your challenge list, without a lie this series has ALL the ppl. It's aggressive. \n\n**The Secret Romantic Guesthouse** \\- came for Kang Hoon but Ryeoun! I'm invested. \n\n**The Eighth Sense** \\- If you're not watching this DO IT\n\n**Unintentional Love Story** \\- I'm still holding on, but it is getting a tad draggy. \n\n**Decoy pt. 2** \\- Not going to lie, I've sort of forgot what happened in the first part. I'm not a fan of this spliting the season. \n\nOn the Thai front; \n\n**Boss and Babe** \\- it's ok, I dunno not feeling it. \n\n**Bed Friend**  \\- Chemistry is on point, but the plot isn't super engaging. \n\n**Chains of Heart** \\- this is utter chaos and I'm living for it.\n\n**Destiny Seeker** \\- I'm actually really liking this, super adorable, it's killing me to wait on subs.  \n\n**Future** \\- it's low-budget but short and sweet. \n\n**Love Syndrome III** \\- no idea why I'm still watching...I don't recommend it. \n\n**Past-senger** \\- pretty cute, good chemistry and I do like a time travel plot. \n\n**Tin Tem Jai** \\- holding on for Day at this point. \n\nJapanese; \n\n**Our Dining Table** \\- we stan our JBL king Inukai Atsuhiro! I was half-way through episode 1 when I realized I've read the manga. \n\n**Dangerous Buddies** \\- finished! It's not a BL but the series was more BL then the manga lol",
            "score": 4,
            "author": "samptra_writer"
        },
        {
            "level": 0,
            "comment": "yonder",
            "score": 2,
            "author": "FlatlineNine"
        },
        {
            "level": 0,
            "comment": "**Our Secret** c drama (16/24)\n\n**Oasis** (5/16)\n\nI started reading a new book last night and I keep thinking this could easily become a K drama. Never mind the book is set in Mexico and full of Mayan folklore, it still has the raw materials for a good fantasy k drama.",
            "score": 2,
            "author": "333serendipity"
        },
        {
            "level": 0,
            "comment": "I started LBFD but not liking it as much. I’ve struggled to watch till episode 8. Still thinking if I should continue watching it since everyone is raving about it. Then I started “Run On” on the side that also is just okay so far.",
            "score": 2,
            "author": "AK2125"
        },
        {
            "level": 0,
            "comment": "Just finished \"Reborn-Rich\" as my first Kdrama (at least for a few years) enjoyed the journey but not the finale with that one. \n\nLooking for something new to watch so I will a few random episodes of shows to see what hits the interest, \"Business Proposal\" and \"Goblin\" are what I'm watching.",
            "score": 2,
            "author": "spicy_VR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love, love Goblin....it's a tie between Goblin and Alchemy of Souls.",
                    "score": 1,
                    "author": "athenat007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Divorce Attorney Shin**  Finished watching this.  It was really good, and I gave it a solid 10.\n\nBinged **100 days my prince**.  It was quite good, I enjoyed it enough to binge it straight through.  It made me cry in several spots, which is unusual for me.  &gt;!The part where the prince recovers his memory of the FL made me cry.  And I was very sad about the FL's brother dying in the end.  It was all but unevitable but still, I had hoped.  I wished he had managed to run away with his love.  I guess it was karma for their wrongdoings.  The crown princess lost her love, and he lost his life.  But still, they were both victims of the main villain!&lt;\n\nWatching both shows is making me reconsider my propensity for rom-com.  With romcoms, I always tend to focus on the OTP and will get impatient with the story.  I'll get frustrated because the relationship is not going fast enough, that we are not getting enough cute moments with the OTP and of course, I'm always pissed at the unavoidable noble idiocy/penultimate episode breakup.\n\nIn 100 days my prince, I had hoped to avoid this trope.  &gt;!Of course, their separation when he had to return to as the Crown Prince was unavoidable, but the later part, where she decides she will not marry him for his own good was a clear example of the Noble Idiocy trope.!&lt; \n\nAnyway, comparing the two makes me realize that without a romance in the mix, I can focus on the story instead of being frustrated.\n\nDoes anyone feel the same way?",
            "score": 2,
            "author": "Martine_V"
        },
        {
            "level": 0,
            "comment": "I'm trying to finish shows I started watching over the past couple of months, working on Vincenzo, The King's Affection, Little Women, and Mr Queen.",
            "score": 2,
            "author": "shopandfly00",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vincenzo and Mr Queen are in my all time top few dramas, I think they are well worth finishing; enjoy!",
                    "score": 3,
                    "author": "Jaffa_Cake_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished Crash Landing on You . It was so good . I cried and laughed a lot .",
            "score": 2,
            "author": "Grizby99"
        },
        {
            "level": 0,
            "comment": "Healer (11/20) - Why does everyone rave about this show? It is pretty boring that I gave it a break. &gt;!It is a rehash of City Hunter. The romance between the FL and Healer is dumb. I mean how can she like some guy just based on rumours and even date him? This despite the detective's warning that he might be a killer. I rather prefer if the romance would have been between the FL and the alter ego Park Bong Su. She even goes on a date with Healer without seeing or speaking to him. I don't see any chemistry between the actors either. The whole plot with the five friends is also boring.!&lt;\n\nThe Fiery Priest (4/20) - After a bad first 30 minutes this show has improved and is quite interesting now.",
            "score": 6,
            "author": "mhfan_india",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am also someone who doesn't quite get the hype for Healer, though I didn't dislike it as much as you. I found the political backstory intriguing, and Ji Chang Wook is totally charming, but I thought it was a bit slow and didn't fully &gt;! buy into the romance. !&lt;",
                    "score": 7,
                    "author": "immerdasmeer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How can you NOT buy into the romance????  I swear, I just will never understand this kind of statement.  Best non-angsty romance in KDrama frankly.",
                            "score": 0,
                            "author": "Teleriferchnyhfain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just didn't! Everyone is different. It's ok!",
                                    "score": 4,
                                    "author": "immerdasmeer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good question why Healer totally worked for me. Maybe it's because I didn't put myself in the FL's shoes, really, and just &gt;!adored the ML with all the insights the viewer is given. Also, preferring a bad boy-vibes guy over a shy clumsy guy might not be a great choice in real life but I couldn't help digging it.!&lt;\nAs with other kdramas of this format, it might have benefitted from a shorter run time, it's hard to keep the pacing consistent over 20 episodes.",
                    "score": 3,
                    "author": "OhMisterBelpit"
                },
                {
                    "level": 1,
                    "comment": "I really enjoyed Healer, one of my top shows and didn’t find it boring at all. Why does everyone rave about? Different people find different things entertaining. No one’s right or wrong here.",
                    "score": 6,
                    "author": "AzureBlueSea"
                },
                {
                    "level": 1,
                    "comment": "also couldn't get into healer",
                    "score": 5,
                    "author": "Scholarwriter"
                },
                {
                    "level": 1,
                    "comment": "Good to see I'm not the only one who doesn't get the hype for healer.",
                    "score": 4,
                    "author": "KDramaTipsy"
                },
                {
                    "level": 1,
                    "comment": "**City Hunter** itself is basically a rehash of **Time Between Dog and Wolf**; undercover action/revenge thrillers have a long history and standard format in Kdrama.\n\nThe political plot and insight into journalism were interesting for me, but you're spot on about the romance in **Healer**. After so many people raving about the slow burn it was disappointing how little basis and build-up there was for their relationship.",
                    "score": 2,
                    "author": "onceiwaskingofspain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not unfounded, just a difference in opinion. And not a minority one: **Healer** was unpopular in South Korea both critically and in viewership ratings when it aired and it didn't reach cult favorite status with international fans until later.\n\nPersonally, it was too much of an archetypal superhero set-up - FL never really gets to know ML as himself before they're suddenly in a relationship - which there's enough of in Western media that it didn't feel compelling compared to other more character driven Kdrama romances.",
                                    "score": 2,
                                    "author": "onceiwaskingofspain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Not unfounded, just a difference in opinion. And not a minority one: Healer was unpopular in South Korea both critically and in viewership ratings when it aired and it didn't reach cult favorite status with international fans until later.\n\nBingo. It isn't as popular as it is made out to be by a very vocal set of fans.",
                                            "score": 1,
                                            "author": "mhfan_india"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Your post/comment has been removed based on personal conduct and behavior. Harassment, threats, bullying, personal attacks, racism, hate speech, and other similar negative behaviors are unwelcome in this subreddit. Repeated negative or problematic behavior may result in a ban and/or your actions being escalated to Reddit admins. Please review our full conduct [Rules](https://www.reddit.com/r/KDRAMA/wiki/rules/#wiki_1._conduct), [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies/#wiki_conduct_related_policies), and [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439) before participating in our subreddit.\n\n*Important Notice*\n\nIf after reading the relevant rules and policies you have any questions regarding your post/comment removal, you may contact the moderation team via [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FKDRAMA). Please include a direct link to the removed post in your mod mail. \n\n**Do not respond to the post as it will not be monitored.**\n\n**Do not send PMs to u/KDRAMA-ModTeam as we are not currently able to access this inbox. SEND A MODMAIL INSTEAD**.",
                                    "score": 1,
                                    "author": "KDRAMA-ModTeam"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OMG\n\nIt's better than City Hunter.  City Hunter happens to be a prequel, ergo the ambiguous ending.  I happen to have read the manga, seen Jackie Chan's film, so know what happens later.  I'm SOOOO glad I saw it before I saw Healer!  \nMin Young is always good, but she excelled in Healer.  That romance is just the most angst-free in KDrama history, frankly, and totally sweet.  She BTW doesn't know EITHER of these guys when she crushes on them - &amp; the person she actually falls for, you know, IS Bong Soo.  People who think it's boring just can't follow the plot very well - it does have a lot of flashbacks.  Important ones.  The whole story of the 5 friends is the ENTIRE point of this drama in fact.  As for chemistry - pffft.  They got best couple for 2015, you realize.  Your insistence on no chemistry is simply a very very minority one.  I've watched Healer 9 times now, rewatch it every December.  It never gets old - I keep finding new things I hadn't noticed.  It's KDrama crack, just a basic how-to in writing a thriller with a romance interwoven.",
                    "score": 1,
                    "author": "Teleriferchnyhfain"
                },
                {
                    "level": 1,
                    "comment": "I loved Healer, but I didn’t realize it was a romance until about halfway through the show.",
                    "score": 1,
                    "author": "Altruistic_Reveal_51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok. Maybe I should watch a few more episodes. I have already watched half and the romance is unconvincing.",
                            "score": 1,
                            "author": "mhfan_india"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i got tired of boring romance drama. Finished taxi driver for now.",
            "score": 1,
            "author": "clanlord",
            "replies": [
                {
                    "level": 1,
                    "comment": "S1 or s2?",
                    "score": 1,
                    "author": "Puzzled_Kiwi_8583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "S1",
                            "score": 1,
                            "author": "clanlord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "S1 was so good. S2 doesn’t feel as intense, but still solid. \n\nBlind is pretty good with no romance if you’re looking for a drama. It’ll leave you guessing for a long while.",
                                    "score": 2,
                                    "author": "Puzzled_Kiwi_8583"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m a sucker for romance and rom com but there just isn’t anything good from kdrama in these genres right now.",
                    "score": 1,
                    "author": "storebelly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have dropped every single drama except Taxi Driver and Pandora. All are just the same old stuff. Nothing different. But the coming weeks surely looks very exciting w.r.t. kdramas.",
            "score": 1,
            "author": "NavdeepNSG"
        },
        {
            "level": 0,
            "comment": "I really tried to get into Remarriage and Desires but gave up after the two female protagonists bumped into each other for like the tenth time.  In Seoul. A city of 10 million people.",
            "score": 1,
            "author": "DonRicardo1958"
        },
        {
            "level": 0,
            "comment": "I’m watching Call it love and I wanted to discuss with you guys if you had seen it cause I feel it’s way too similar to other dramas, still it’s entertaining and does its own thing. To express my opinion I will use the spoiler tags &gt;!I feel it’s way too similar to My Mister in plot and vibe though acting and mood were better in MM and it’s also similar to My Liberation Notes, with the whole family dynamic thing!&lt;",
            "score": 1,
            "author": "AilatanMyopic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Call it Love and My Mister do share the same vibe. I think it's closer to My Mister than My Liberation Notes. If you remotely like My Mister - you will love Call it Love. It's worth watching 100%. As for being similar to other dramas - other than the two mentioned - I can't think of anything else it's similar to.",
                    "score": 1,
                    "author": "Confusedbanana_xx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im watching Yoo In Na's new show &amp; the Secret Romantic Guesthouse. Im thoroughly enjoying both.",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "With **Our Blooming Youth** and **Divorce Attorney Shin** over (I'll miss attorney Shin and his merry band of noodle lovers) the load has lightened a bit keeping up with new episodes but still have a few on the go. \n\nFor Kdrama I'm watching **Secret Romantic Guesthouse**, **Joseon Attorney: A Morality** and part 2 of **Decoy** started last week. I enjoy them all well enough but I think Joseon Attorney has the potential to stand out.\n\nFor Cdrama I just have **Till The End of the Moon** I'm keeping up with but so far it's a really good show of it's type.\n\nTonight I also started a binge of **Godfather of Harlem** for gaps in newly airing shows, I was browsing for something to watch and the premise sounded similar to **Tulsa King** which I recently enjoyed. Also who doesn't like a bit of Forest Whitaker",
            "score": 1,
            "author": "Scotsmania",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Finally managed to catch the weekly post :) ! \n\nGosh my list is full with drama’s ive dropped and am currently watching! I need some tips for some of them though. \n\nCompleted\nHot stove league-16/16(COMPLETE)- the premise as a whole makes no sense cause why would the president waste everyones time if he wanted to disband the team asap? :/ but i do like watching a sports k-drama, I’ve never seen one before and never have seen a show about baseball. Woww it was soo good and satisfying. Watching namkoong min in both gong shim and hot stove league felt like whiplash as changing between the goofy dan tae in gong shim and sexy/mysterious mr baek in HSL was soo confusing but fun! \n\n Current\n\nBeautiful gong shim-11/20(current)\n\nI am not a robot-8/16(current)\n\nFind yourself - 10/41(current)\n\nTaxi driver S1 - 11/16(current)\n\nRookie historian- 0/16(hiatus/current)- i might drop but this is the most K dramary of K dramas ive ever seen; if you asked me to outline a historical k drama this is the blueprint but idk if ill continue this due to that feeling. \n\nMemories of the alhambra- 0/16(just started)\n\nDropped dramas\n\nWitch at court; 3/16(DROPPED)- I hate Ma I-Deum with a passion but the general show was only hanging on with Yoon hyun min and the legal plot lines. Otherwise it was chaotic, confusing and frustrating. \n\nLove 020-0/30 (exchanged for the movie- reading the comments on r/cdrama put me off and its quicker to watch the movie)\n\nMy golden life-0/52(DROPPED- the cast and storyline felt wayyy to familiar/similar to once again soo nope. \n\nI need romance-2/16(DROPPED- as much as it’s entertaining, ep 2 was just EMBARRASSING. Like is she not ashamed?! )\n\nGirl from nowhere-0/13(DROPPED- wayy to heavy in \nthe subject matter for a drama personally :( \n\nDoes anyone else have a phase where they will finish a k drama and then drop like 5 or 6 after to find another good drama? Like my finishing:dropping ratio is insane.",
            "score": 1,
            "author": "headinthexlouds20",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you enjoying *I Am Not a Robot* and *Beautiful Gong Shim*?",
                    "score": 2,
                    "author": "idealistatlarge",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "18 again",
            "score": 1,
            "author": "ysIrose"
        }
    ]
}