{
    "id": "12lm4rg",
    "score": 12,
    "title": "The Weekend Wrap-Up - [04/14/23 to 04/16/23]",
    "author": "AutoModerator",
    "date": 1681452014.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/12lm4rg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Another Friday, another weekend -- welcome to *the Weekend Wrap-Up*! This is a free-for-all (FFA) discussion post in which *almost* anything goes, just remember to be kind to each other and don't break any of our core rules. Talk about your week, talk about your weekend, talk about your pet (remember the  pet tax!). Of course, you can also talk about the dramas and shows you have been watching.\n\nThis is also the space to share content that would otherwise not qualify as self-posts under our rules -- like rumored casting news and discussions about non-kdramas.\n\n**Please remember to use spoiler tags when discussing major plot points or anything you think should be redacted.** If you are using Markdown and not Fancy Pants Editor, the easiest way to create spoiler tags is to use &gt; ! spoiler content ! &lt; without spaces to get &gt;!spoiler content!&lt;. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=week) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "**Announcement**\n\n**The r/KDRAMA 2023 Mod Recruitment Applications Now Open** -- if you are interested in becoming part of the mod team as a content moderator, head to the [recruitment post](https://www.reddit.com/r/KDRAMA/comments/12h5h0b/rkdrama_2023_mod_recruitment_applications_now_open/) for details and link to the application form.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KDRAMA) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I just read Netflix is working on a remake of **Squid Game** which for me is a no… But I feel that most American tv e about remake or prequel or sequel and it loses quality. I think they should come up with more original stuff … anyway here is the [link](https://twitter.com/discussingfilm/status/1646668069912170498?s=46&amp;t=iQ2RJZ5e1wDJGreH2oIQlQ)\n\nAlso for those who like **Park Seo Joon** the new Marvel movie is on and he looks good!!! Here’s the [link](https://youtu.be/iuk77TjvfmE), he kinda look like the bad guy but I don’t know, maybe I’ll watch just cause of him",
            "score": 16,
            "author": "J-Midori",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remaking **Squid Game** is such a stupid idea.  It’s an obvious cash grab but even compared to other soulless reboots/remakes/sequels made solely for a quick buck I don’t see the need for it in the marketplace.  \n\nIt’s not an old show so it’s not like you’re redoing it for a new generation.  Also, the original was a huge hit in America, so it’s not like you’re remaking an obscure foreign show that American audiences won’t be familiar with.",
                    "score": 13,
                    "author": "theromanamputee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you but there will be people who will pay for the remake to be made and people who will sponsor it and those who will pay to watch it. \n\nOh actually, if I pay Netflix subscription, I am the one paying for this remake … since Netflix is the one who will produce…oh damn",
                            "score": 3,
                            "author": "J-Midori"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Finally a converging of two things I love...Park Seo Joon is not a bad guy. He's the love interest for Captain Marvel actually and an alien prince. If anyone wants to know a short summary [this one](https://www.looper.com/1256489/yan-d-aladna-facts-prepare-marvel-fans-for-marvels/) is pretty good.\n\nYes, I am stupidly excited about this movie. I love Captain Marvel as well as many of the others involved including PSJ.",
                    "score": 8,
                    "author": "tangledbysnow"
                },
                {
                    "level": 1,
                    "comment": "Wow, that was a blink and you missed it moment for PSJ in the Marvel trailer. It was about 1:36 in for those that wanted to see him.",
                    "score": 7,
                    "author": "Sunshine_raes"
                },
                {
                    "level": 1,
                    "comment": "But his hair, I'm not sure I can get past it...",
                    "score": 5,
                    "author": "pc2207",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know!!! Well his hair is not that bad… maybe they wanted a different look from the actor",
                            "score": 1,
                            "author": "J-Midori",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess we’ll have to see the movie to see if they had a reasonable reason…",
                                    "score": 1,
                                    "author": "pc2207"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Call it Love** reminded me so much of My Liberation Notes - a slow paced romantic melodrama where the two leads are wounded and guarded but manage to break through the other’s defenses to find love and connection, and the FL has two siblings with lighter storylines that balance the heaviness. Of course Lee Sung Kyung and Kim Young Kwang were really lovely together - the ending was perfect. My favorite was actually big sister’s character - I have a soft spot for Kim Ye Won (Haesung) from her MC days on Transit Love (dating show) - loved her growth (so proud of her for her eating lunch by herself!) and how she handled her relationship with the security guard, happy with her ending too!",
            "score": 11,
            "author": "PrizeReputation7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been waiting—painfully waiting—to start Call it Love because I couldn’t afford to have my mind on it week after week if I had watched it while it aired. I cannot wait to start it after work later!!!! Even more so now that you’ve mentioned it reminds you of My Liberation Notes",
                    "score": 4,
                    "author": "chelleml"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Cobweb** and **Hopeless** (Hwaran) are the two Korean films to be shown at the 2023 Cannes Intl Film Festival! Major props to them, and yet another **Vincenzo** reunion lol",
            "score": 8,
            "author": "mackereu"
        },
        {
            "level": 0,
            "comment": "I got tricked by a friend :(\n\nThe last few shows that I watched all had sad endings, so I asked for nice lighthearted romance with a sweet ending.\n\nHe recommended &gt;!20th Century Girl!&lt;. Now I'm broken.",
            "score": 8,
            "author": "Noelleleexy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg that cast is stacked but my heart couldn't handle it right now. Thanks for the warning!",
                    "score": 2,
                    "author": "ManicPixieOldMaid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happened to ***OCN*** network? Aren't they showing dramas anymore ?",
            "score": 8,
            "author": "Vsandaru",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems that as part of the rebranding/reorganization, OCN is going back to its original roots (movies + foreign (*aka* non-Korean) shows).\n\nDramas that pass broadcasting regulations are on tvN, dramas that won't pass broadcasting regulations just end up being TVING originals (web dramas *therefore* uncensored).",
                    "score": 5,
                    "author": "myweithisway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guys... I just binged Beef on Netflix and it was absolutely amazing - would highly recommend! The main actors are absolutely amazing, I have a soft spot for Steven Yeun because while I haven't actually watched anything else he's been in, I love his appearance on The Return of Superman (the korean variety show with kids) from like five years ago lol. Usually my top shows of the year are just k-dramas but this is definitely my favourite show so far.",
            "score": 7,
            "author": "neomukkyu",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went through it last weekend -- it had a lot of K-drama themes, like &gt;!the bad guy just trying to build his parents a house.!&lt;",
                    "score": 3,
                    "author": "KWillets"
                },
                {
                    "level": 1,
                    "comment": "This is an interesting *very spoilery* [analysis](https://www.thedailybeast.com/obsessed/beef-ending-explained-why-the-netflix-hit-show-needs-a-season-2) of Beef’s rom-com elements.",
                    "score": 2,
                    "author": "dcinmb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was funny -- wondering where a Korean would get a body-swap plot.",
                            "score": 1,
                            "author": "KWillets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last time I had kopiko candies, I was a kid and though I didn't enjoy the coffee taste much (preferred chocolate/fruity candies) I would still have them because they were closest to coffees. I had a ban on tea/coffee until I was in high school Tmi anyway I bought a packet today and isn't much thrilled. It's a bit too sugary and has a faint coffee flavor, my silly childhood memory says it was other way around. So those who had the candies earlier and now, do you find the taste same?",
            "score": 7,
            "author": "throwawaymisfortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "The cappuccino ones are better then the regular. But also sweet.",
                    "score": 4,
                    "author": "peregrina2005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Funny you should mention this!  I just picked up a pack of the cappuccino candies at my local H-Mart, and I quite like them.  I didn't realize there were two kinds.  I'll pass on the plain old coffee ones!",
                            "score": 2,
                            "author": "pc2207"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is at least one gene for bitter taste that changes during puberty, so that the child is more aware of the bitter taste than the adult. You might have a gene like that.",
                    "score": 3,
                    "author": "the-other-otter"
                },
                {
                    "level": 1,
                    "comment": "My grandparents got me hooked on them like 12 years ago for a bit when I was a kid because they always had them when I visited. Haven’t had it for years until it those PPL and tried it again out of nostalgia. Definitely more sugary and so little coffee taste than I remembered, but then again, I do have a caffeine addiction and only drink black coffee lolol",
                    "score": 3,
                    "author": "chelleml"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone else delay watching the final episode(s) of a show they're enjoying?\n\nI have a couple eps left of **Would You Like a Cup of Coffee?** but I don't want to watch them and end the drama. It's such a sweet, peaceful show but I'm invested and have been watching it to destress.\n\n\nLoving **Navillera** but am 100% certain it's going to make me cry and I am not a super emotional person. I'm halfway through and this drama is so fantastically done.",
            "score": 5,
            "author": "Helpful-Standard9107",
            "replies": [
                {
                    "level": 1,
                    "comment": "Navillera was so sweet and inspiring. I shed lots of happy and sad tears while watching. Pretty underrated drama tbh!",
                    "score": 4,
                    "author": "shibaal21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really beautiful and underrated! Found out about it from a suggestion on somebody else's recommendation request, forever grateful.",
                            "score": 2,
                            "author": "Helpful-Standard9107"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I did that this weekend with **Zombie Detective** because I thought I knew how it would end but I was wrong. I was up til 3 but saved the last episode for the next day.",
                    "score": 2,
                    "author": "eeladnohr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did you like Zombie Detective?\nI finally watched the last two episodes of WYLACOC? and loved them, it will be a comfort rewatch drama for me.",
                            "score": 2,
                            "author": "Helpful-Standard9107",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loved ZD, and will try to do a rewatch with a friend, after I make it through more of [my list](https://mydramalist.com/dramalist/Adnohr/plan_to_watch).",
                                    "score": 1,
                                    "author": "eeladnohr"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m on episode 15 of **My Country** and what an amazing show! I’m fully preparing to get my heart trampled on but also excited for the ending.\n\n• Interesting characters + stellar acting by Woo Do Hwan, Yang Se Jong and Jang Hyuk.  This is my first time encountering these actors and I’m totally blown away. Especially by Woo Do Hwan. I’ll be watching **Joseon Attorney** next to see more of him in period costume.  And can I say - the bromance between the two MLs is extreme and their chemistry is on fire… they are the real OTP of this show.\n\n• Engaging pace. Unlike most other sageuks I’ve tried, this one has a packed storyline and doesn’t feel draggy at all. While there’s a lot of politics going on (this is about the establishment of the Joseon dynasty, after all) there’s not too many scenes with ministers gathered around the king or ministers conniving against each other. \n\n• Beautiful visuals. I’m not just talking about Woo Do Hwan. The costumes are so pretty and the fight scenes are extremely well choreographed.\n\nThe show does have flaws - people in this universe get stabbed every which way and survive (unless plot wants them dead) and the FL’s character feels unnecessary.  But neither of these two things detract from how enjoyable this show has been.\n\nI don’t know what I was expecting when I started watching this for the Kdrama challenge (drama referenced in another drama), but this is going straight to my top list.",
            "score": 5,
            "author": "peainsea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for this review. I've been interested in this one for a while. Not sure I'm ready for the heart-trampling, though. \n\n&gt;people in this universe get stabbed every which way and survive (unless plot wants them dead)\n\nAbout a decade ago, I attended a presentation by two physicians for fantasy and science-fiction authors on realistic injuries in fiction. What I remember from the talk was that head injuries that are bad enough to knock you out aren't that easy to bounce back from. Every time someone gets knocked out in a drama and then regains consciousness and wins the fight or saves the second lead or whatever, I think of that talk. I'm looking at you, **Hello Monster**.",
                    "score": 4,
                    "author": "mahnahmaanaa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is an excellent show if you are able to suspend your disbelief regarding bodily injuries!",
                            "score": 2,
                            "author": "peainsea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been watching **Goblin** for a second time, with hubby, and two things:  1) I get a lot more of the pop culture references (see Train to Busan reference), and 2) again, it's so interesting watching these shows with a man.  Not really better or worse, just different.  (It's worse for shows where serious fangirling is required!)\n\nAlso, I got to go to Seoul for 5 days for work in February, and now every time I see a vehicle to roaring off somewhere with no traffic I laugh and laugh and laugh...  Traffic in Korea was no joke, especially at rush hour.  Even outside the city, it took a long time to get to open roads (like more than an hour).",
            "score": 6,
            "author": "pc2207"
        },
        {
            "level": 0,
            "comment": "Finally getting all the promotional material for Dream is getting me so excited. Can't wait for this movie.",
            "score": 4,
            "author": "TotoroTheGreat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m really looking forward to it too, the previews have been great! I’m just worried I won’t be able to find it here. IU’s movie Broker came to an art house theater near me, but I don’t know if they will pick up a comedy.",
                    "score": 2,
                    "author": "Otherwise-Bird3682"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Call it Love**, ending: &gt;!Did they just breakup?!&lt; I have half an hour left. I don't get why this is happening. Had partly spoiled myself, so it is not a big surprise, but still: idiocy. Must rewatch that scene and might understand why.\n\nAlso, there is no contradiction between &gt;!living a good life and getting punished. The person who gets punished might feel relief, or in this particular circumstances: start to understand what was wrong!&lt;. \n\nIn general: So  much   staring. Such dull people. She seemed so fun at first.",
            "score": 3,
            "author": "the-other-otter"
        },
        {
            "level": 0,
            "comment": "Is there no Dr. Cha thread yet? I really enjoy itttt",
            "score": 3,
            "author": "red-polkadots",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was wondering about that too. Can’t wait for episode 2!",
                    "score": 2,
                    "author": "Old_Hold8114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The male lead is finally a male lead!!!  I remember his past roles of being a funny secretary XD",
                            "score": 2,
                            "author": "red-polkadots",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you’re talking about Woo Minhyuk, the only role I  sort of remember him in was in Love with Flaw 🤔 and even that is very vague.",
                                    "score": 1,
                                    "author": "Old_Hold8114"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "girls are too strong\r  \nDiscussion\r  \n\r  \nWatching kdrama where the 1 unarmed female is beating up multiple male thugs that have weapons as if they are nothing.",
            "score": 0,
            "author": "D-youtubegamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also think it is a stupid trope, unless magic is involved. I loved Mudeok in **Alchemy of Souls** for showing how to be strong without a strong body.",
                    "score": 4,
                    "author": "the-other-otter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched \"my name\"",
                            "score": 2,
                            "author": "D-youtubegamer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Actually yeah I agree",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched the first two episodes of Attorney shin and tbh I thought it was boring",
            "score": 0,
            "author": "kemar7856"
        }
    ]
}