{
    "id": "12ms1qz",
    "score": 17,
    "title": "Things I Spotted This Week - [2023/04/15]",
    "author": "AutoModerator",
    "date": 1681538431.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/12ms1qz",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/12ms1qz/things_i_spotted_this_week_20230415/"
    ],
    "other_urls": [
        "https://i.redd.it/dxmzb2nl19z61.gif)",
        "https://i.redd.it/996g9dj6ihuz.jpg),",
        "https://i.redd.it/zdiv0i1g9hg31.gif),",
        "https://i.redd.it/a8heqqwwvpk51.png),",
        "https://i.redd.it/xrbrggzelco31.gif)",
        "https://i.redd.it/9ihlgspa9ep31.gif)",
        "https://i.redd.it/mrf90wpk0bg31.gif)",
        "https://i.redd.it/6tf1x7i9h0e41.gif)",
        "https://i.redd.it/xlxl8mfcbfg31.gif)",
        "https://i.redd.it/epuuubb9tag31.gif)",
        "https://i.redd.it/ofcyol8nd6r31.gif)"
    ],
    "postText": "[Gather around](https://i.redd.it/dxmzb2nl19z61.gif) everyone and let's talk about the things you spotted this week while watching dramas! This is the place to share if you spotted any of the following:\n\n* Truck of Doom^TM and other tropes you love/hate\n\n* Easter eggs and notable references to other dramas, artwork, poems, books, etc.\n\n* Fun or interesting background details in a scene (e.g. in the set, props, clothing, background music, location, etc.)\n\n* Ramyeon, soju, fried chicken, and other foods/drinks\n\n* Puns, idioms, and other interesting tidbits about culture\n\n* [Subway](https://i.redd.it/996g9dj6ihuz.jpg), [Samsung](https://i.redd.it/zdiv0i1g9hg31.gif), [Swarovski](https://i.redd.it/a8heqqwwvpk51.png), and [other PPL](https://i.redd.it/xrbrggzelco31.gif) \n\n* A [Kim Tan Worthy Sweater^(TM)](https://i.redd.it/9ihlgspa9ep31.gif) and *more*!\n\nShare your [love](https://i.redd.it/mrf90wpk0bg31.gif) or [frustration](https://i.redd.it/6tf1x7i9h0e41.gif) or [rage](https://i.redd.it/xlxl8mfcbfg31.gif) or [annoyance](https://i.redd.it/epuuubb9tag31.gif) or [amusement](https://i.redd.it/ofcyol8nd6r31.gif) at seeing these things. You are not limited currently airing Kdramas or even Kdramas at all but please be mindful of spoilers.\n\n**Please remember to use spoiler tags when discussing major plot points or anything you think should be redacted.** If you are using Markdown and not Fancy Pants Editor, the easiest way to create spoiler tags is to use &gt; ! spoiler content ! &lt; without spaces to get &gt;!spoiler content!&lt;. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n---\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=month) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "**Announcement**\n\n**The r/KDRAMA 2023 Mod Recruitment Applications Now Open** -- if you are interested in becoming part of the mod team as a content moderator, head to the [recruitment post](https://www.reddit.com/r/KDRAMA/comments/12h5h0b/rkdrama_2023_mod_recruitment_applications_now_open/) for details and link to the application form.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KDRAMA) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Watching Goblin, after they see the horror movie, Kim Shin has a throwaway line along the lines of \"those zombies were scary. The future of Korean cinema is bright.\"  I didn't get the joke the first time I watched it (like 3 years ago), but I laughed this time, and had to go check.  Sure enough, Train to Busan came out a few months before Goblin.  Very well played...",
            "score": 21,
            "author": "pc2207",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished Goblin. They made a reference to Coffee Prince when Sunny is asking Ji Eun-Tak about her boyfriend.",
                    "score": 2,
                    "author": "TossedWordSalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Umbrellas! There are so many dramas featuring scenes where the ML shows up for an unprepared FL with an umbrella on a rainy day. It is like the ultimate romantic gesture: a metaphor for the ML’s sheltering and thoughtful presence. Another variation is when a ML grabs shelter under a FL’s umbrella without permission; an act of bold flirtation.",
            "score": 17,
            "author": "dreamofriversong",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is one of the (admittedly many) reasons the umbrella scene in **I Hear Your Voice** is one of my favorites; it's a trope reversal where FL dramatically comes to ML's rescue with her umbrella.",
                    "score": 8,
                    "author": "onceiwaskingofspain"
                },
                {
                    "level": 1,
                    "comment": "Umbrellas played a big part of the romance in Something In the Rain. :)",
                    "score": 8,
                    "author": "Master-Training-3477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also in My Queens umbrella. The title already siggests there is an umbrella involved. It's a methaphor of shielding a loved one",
                            "score": 2,
                            "author": "Just-Flamingo-410"
                        },
                        {
                            "level": 2,
                            "comment": "Umbrellas are also featured in I am Not a Robot.",
                            "score": 1,
                            "author": "WINTERSONG1111"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just finished Goblin and there were a lot of references to weather and a few significant umbrella scenes.",
                    "score": 3,
                    "author": "TossedWordSalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The male lead shielding the female lead from falling objects trope:\n\n- Sometimes, the threat posed by the objects is genuine, like when &gt;!Hyeon-su shielded Ji-won from falling garage tools!&lt; in **Flower of Evil**.\n\n- Sometimes, the threat is mid-level, like when &gt;!Jae-hyun shielded Ji-soo from falling books!&lt; in **When My Love Blooms**.\n\n- And sometimes the “threat” is non-existent, like when &gt;!Ji-yul shielded Ja-young from (of all things) falling peaches that seemed to rain down for an eternity!&lt; in **Once Upon a Small Town**.",
            "score": 12,
            "author": "Telos07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Adding to your point three, the &gt;!little basket of beans or beads that Lee Yul shields Hong Shim from!&lt; in **100 Days my Prince**.",
                    "score": 6,
                    "author": "mahnahmaanaa"
                },
                {
                    "level": 1,
                    "comment": "**The King's Affection** has two wonderful ones:  when Rowoon shields the King from falling pottery (he executes the move so perfectly he must've gotten an \"A+\" in kdrama school), and when the bodyguard executes a sweet martial arts move just to block a soccer ball from kids playing nearby. That last one was very humorous.",
                    "score": 7,
                    "author": "ManicPixieOldMaid"
                },
                {
                    "level": 1,
                    "comment": "ML shields his coworker from falling rocks during a rescue in **Forest.**",
                    "score": 3,
                    "author": "UnbridledOptimism"
                },
                {
                    "level": 1,
                    "comment": "Love this \"threats\" list 😂\n\nOne more is when the FL is shielded from the rain by ML's hand/shirt/coat-jacket/bag, e.g. **Moment at Eighteen**, **What's Wrong with Secretary Kim**, and **School 2017** respectively",
                    "score": 2,
                    "author": "vanished_cabinet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Going to sneak a brief review in here. Just finished **Bulgasal: Immortal Souls**. It had been on my \"continue watching\" list for a while but I'd never been in the mood to make it past the first episode. Glad I did, because once you realize what's going on, it's a fun ride with a great ending.\n\nB:IS is 16 episodes that aired in 2021 starring Kwon Nara, Lee Jin-wook, Gong Seung-yeon, and Lee Joon. The supporting cast is full of great actors like the silver fox, Jeong Jin-yeong (silver fox is a compliment in America; if it's not a compliment in Korea, amend it to however you compliment a good-looking older man), Kim Woo-seok, and Park Myung-shin.\n\nI had to look up \"bulgasal\" because I wanted to make sure that I wasn't stating something obvious because B:IS is essentially a really good vampire story. The sources I found said that while a bulgasal is a mythological monster in Korean folklore, it doesn't look anything like Lee Jin-wook, so I'm suggesting that viewing B:IS as a vampire story adds to the experience.\n\nLJW is Dan Hwal, a Bulgasal who 600 years ago, was human until Kwon Nara's Kim Hwa-yeon murders his blind son and his wife and steals his soul, making *him* the Bulgasal and her destined to be continually reborn but with his soul. Hwal has spent 600 years tracking her descendant down to get his revenge by jamming her in a deep well. Yes, the Bulgasals \\[Bulgasi? Bulgasalae?\\] drink blood, and of course the ones who drink human blood are stronger than the ones who hamstring themselves with morals and ethics and crap and just drink animal blood from the butcher.\n\nThis sets up essentially a loooong enemies-to-lovers (although not physically) saga, with the other characters being reborn and drawn into Hwal's bad karma, as well as a love triangle with Lee Joon's Ok Eul-tae.\n\nWhile the ensemble is full of the common tropes (plucky orphan \\[Wooshin\\], strong sister with psychic powers \\[Gong Seung-yeon\\], hard-drinking retired detective \\[Jeong Jin-yeong\\], mystic older woman \\[Park Myung-shin\\], etc.), they're so well-acted and executed that it's comforting to half-way guess most plot twists because they make sense rather than just being there for the sake of laziness.\n\nLee Joon's Ok Eul-tae is a gloriously chaotic villain but with so much empathy built up you really wish for everyone to have an HEA but they probably won't. I loved Lee Jin-wook in **Sweet Home** and he brings that same subtle touch to the stoic lead, Hwal. In Kwon Nara's hands, Hwa-yeon just *radiates* goodness. Like not the innocent naivete that passes for a \"good\" character, but just the kind of air of sanctification I associate with saints. She's just out there loving everybody and trying to make them all get along!\n\nNot going to add any spoilers just to say it was a great fantasy, with brutal and bloody fights, and well-earned tears. If you like things like **Island**, this is similar but more grounded, like **Island** if you took away the Priest's light saber and had a plot viewers could comprehend.\n\n**Tropes Spotted:**  So many. I really wanted to screen capture two scenes where Hwal carries Hwa-yeon:  in the first, he flings her over his shoulder like a sack of grain, and in the second, he gives a proper piggyback ride just like LJW must have learned in kdrama school. I wanted to put the screen captures side-by-side with a circle and a slash through the first one and a green checkmark on the second one.",
            "score": 5,
            "author": "ManicPixieOldMaid"
        },
        {
            "level": 0,
            "comment": "ML and FL finding each other’s phone in both **The Real** and **Bo Ra** to further the plot.",
            "score": 4,
            "author": "peregrina2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "In **Bo Ra**, the ML could've simply called his own number, &gt;!instead of following her on a taxi!&lt; though.",
                    "score": 1,
                    "author": "ILoveParrots111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but, then we wouldn’t get a story. He can see what she sees now.",
                            "score": 1,
                            "author": "peregrina2005",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yap, that is absolutely the case. However, when he hoped on a taxi, the first thing that popped up in my head was \"Just call your own number, why waste perfectly good taxi money\". \n\nI have to admit that I didn't expect &gt;!Bo-ra's boyfriend cheating on her. For some reason, I didn't see him in that light. Ok, I was certain that they would break up to advance the story, but I thought that he just didn't see her as someone he'd want to marry and that would've come out when she proposed.!&lt;\n\nIn my opinion, if it would've happened in that way, that would provide an interesting mirror to Soo-Hyuk's situation. &gt;!SH loved and wanted to be with hid gf even if he was dismissive, when Bo-Ra's boyfriend would've appeared caring, when in reality, he didn't see a future with her.!&lt;",
                                    "score": 2,
                                    "author": "ILoveParrots111"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eavesdropping! Watched Dr.Romantic and every episode had at least 3 scenes of someone hiding behind and listening to a conversation. If I had a drinking game where we take a shot every time a scene pans out and reveals someone standing behind the people we'd all be dead of alcohol poisoning. How did the writer not see the redundancy lol?",
            "score": 2,
            "author": "humandisaster13",
            "replies": [
                {
                    "level": 1,
                    "comment": "i did not notice this lol now it will bother me but i dont have time for a rewatch need to start season 2 so i can watch s3 while its on air 😂",
                    "score": 1,
                    "author": "Roushal"
                },
                {
                    "level": 1,
                    "comment": "There are no secrets in Doldam.",
                    "score": 1,
                    "author": "False_Advisor1693"
                }
            ]
        }
    ]
}