{
    "id": "12tjvg0",
    "score": 16,
    "title": "Bait (Season 2) Episodes 11&amp;12",
    "author": "CCCri",
    "date": 1682035431.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/12tjvg0",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/12tjvg0/bait_season_2_episodes_1112/"
    ],
    "other_urls": [
        "https://mydramalist.com/731579-chronicles-of-crime))",
        "https://mydramalist.com/731579-chronicles-of-crime)",
        "https://www.reddit.com/r/KDRAMA/comments/10n6a5k/bait_season_1_episodes_1_2/)",
        "https://www.reddit.com/r/KDRAMA/comments/10reat6/bait_season_1_episodes_34/)",
        "https://www.reddit.com/r/KDRAMA/comments/12la83k/bait_season_2_episodes_910/)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).",
        "https://mydramalist.com/people/16298-kim-hong-seon)"
    ],
    "postText": " \n\n* **Drama**: ([Bait Season 2](https://mydramalist.com/731579-chronicles-of-crime)) also known as Decoy Season 2 and Chronicles of Crime [미끼 시즌1](https://mydramalist.com/731579-chronicles-of-crime)\n* **Network**: Coupang Play\n* **Premiere Date:** April 7, 2023\n* **Airing Schedule**: 2 episodes on Fridays\n* **Episodes**: 6\n* **Streaming Sources**: Viki, Prime\n* **Previous Discussions:** [Episodes 1&amp;2](https://www.reddit.com/r/KDRAMA/comments/10n6a5k/bait_season_1_episodes_1_2/) [Episodes 3&amp;4](https://www.reddit.com/r/KDRAMA/comments/10reat6/bait_season_1_episodes_34/)   \\[Episodes 7&amp;8\\]  [Episodes 9&amp;10](https://www.reddit.com/r/KDRAMA/comments/12la83k/bait_season_2_episodes_910/)\n* **Conduct Reminder**: We encourage our users to read the following before participating in any discussions on [/r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [\\[Reddiquette\\]](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [\\[Conduct Rules\\]](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct) (3) our [\\[Policies\\]](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [\\[When Discussions Get Personal Post\\]](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/). Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behaviour will lead to increasing exclusions from our community. Any extreme cases of misconduct (such as racism or hate speech) will result in an immediate permanent ban from our community and a report to Reddit admin. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder**: Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag by writing &gt; ! this ! &lt; without spaces in between to get &gt;!this!&lt;\n* **Director**: [Kim Hong Seon](https://mydramalist.com/people/16298-kim-hong-seon)\n* **Writer**: Kim Jin Wook \n* **Cast:** Jang Keun Suk, Heo Sung Tae, Lee Elijah\n* **Plot Synopsis:** Ku Do-Han (Jang Keun-Suk) is a former lawyer who used to bring justice to wrongly accused people and truth to the law for those who abuse it. Due to specific encounters, he became a detective and took a more active role in investigating crimes as he dug further into unresolved cases that link current events to past incidents. During the investigation, he comes across the decade's largest fraud case, a five trillion won swindle that defrauded tens of thousands of people eight years ago. Unfortunately, at the time of the fraud, the scammer, Noh Sang Cheon (Ho Sung Tae), who carried out his scheme by forming Bigs Network, died in a car accident while fleeing to China.",
    "comments": [
        {
            "level": 0,
            "comment": "Well we are heading into the final episodes.   I don’t know how others feel but I found the gap between the two seasons caused the drama to really lose momentum.   I’ve noticed the same thing with other dramas eg Big Bet.    Hopefully these last two episodes will pull me back in.",
            "score": 7,
            "author": "CCCri",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Director did an excellent job with the opening episodes of Season 2 to recover the momentum. I usually forget a lot between Seasons but those episodes were perfect.\n\nGoing forward, the lead has to do more of these roles. Not many lead Korean actors convince me as Detectives but he absolutely does.",
                    "score": 6,
                    "author": "Steupz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is so interesting: I have watched KDramas for so long, yet this is my first drama with Jang Geun Suk (besides his host appearance in Produce 101, which was a drama in itself). He was great in this role as detective. It was a great drama with great lead actors. However sometimes I felt there were too many flashbacks \n\nHowever they should stop the practice of splitting dramas in 2 parts. I can somehow accept a one month break max, but not longer, because otherwise I tend to forget the details.",
            "score": 3,
            "author": "ExtensionDependent",
            "replies": [
                {
                    "level": 1,
                    "comment": "In contrast I have seen pretty much everything Jang Keun Suk has done.  Ku Do Han is a huge change for him that he has wanted for a long time.   He wanted to break away from his rom-com persona and boy did he achieve that in Bait.   He pretty much disappeared into the character even going so far as to use facial hair to try and downplay his looks (didn’t work lol).   Now that he has proved his acting chops I would love to see him in a serious role that also allows him to showcase his charm and humour.",
                    "score": 2,
                    "author": "CCCri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wasi the only one disappointed by the last episode? Not sure what I was expecting but it felt unfinished. Also &gt;! What happened to the card with the money that NSC hard? Like didn't they find it in his pocket? !&lt;",
            "score": 2,
            "author": "Educational_One2790",
            "replies": [
                {
                    "level": 1,
                    "comment": "I doubt that. But I thought it was epic... the Director threw everything at it. I saw shades of Luther, Caesar, Memoir of a Murderer, US cartoons... everything.",
                    "score": 2,
                    "author": "Steupz"
                },
                {
                    "level": 1,
                    "comment": "I was wondering about that card also.   I had two problems with the last episode: one, I am so sick of the victims’ outrageous behavior and must admit I agree with the villain that their greed made them invest to begin with and to keep trying to find him to get their money back.   Second, I never believed the villain &gt;!was as old and frail as he pretended!&lt; and it didn’t make sense that such a well planned and complicated plot would be destroyed by the need &gt;!for an overly complicated revenge on the victims!&lt;.    However, these quibbles aside it was certainly an action packed finish.",
                    "score": 1,
                    "author": "CCCri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished it but not satisfied with the ending, good that it is only 12 eps.",
            "score": 2,
            "author": "hapwatching2023"
        }
    ]
}