{
    "id": "134g6iv",
    "score": 12,
    "title": "Make A Wish - May, 2023",
    "author": "AutoModerator",
    "date": 1682928058.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/134g6iv",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/134g6iv/make_a_wish_may_2023/"
    ],
    "other_urls": [
        "https://i.redd.it/uz9aiimq57z41.gif)"
    ],
    "postText": "Welcome to **Make A Wish**, our monthly post to share one's aspiration about dream or alternate casting, remakes, adaptations, and creative writing. \n\nThis is your chance to share who you want to see on screen and for what. \n\nAnd also a great chance to exercise one's imagination sharing script ideas or your alteration of a kdrama. (You can [cook up](https://i.redd.it/uz9aiimq57z41.gif) whatever you want, but please keep things PG!)\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&amp;sort=new&amp;restrict_sr=on&amp;t=month) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
    "comments": [
        {
            "level": 0,
            "comment": "**Announcement**\n\n**The r/KDRAMA 2023 Mod Recruitment Applications Now Open** -- if you are interested in becoming part of the mod team as a content moderator, head to the [recruitment post](https://www.reddit.com/r/KDRAMA/comments/12h5h0b/rkdrama_2023_mod_recruitment_applications_now_open/) for details and link to the application form.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KDRAMA) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I want a high budget K-drama about Vampires with intense chemistry between the main leads 🔥",
            "score": 29,
            "author": "tired_of_smiling",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lee Soo-hyuk is the best vampire of all time. I am very biased.",
                    "score": 14,
                    "author": "ManicPixieOldMaid"
                },
                {
                    "level": 1,
                    "comment": "Lee Dong Wook first in line to play the vampire 😂",
                    "score": 9,
                    "author": "misanthropic_human"
                },
                {
                    "level": 1,
                    "comment": "This! Its long overdue.",
                    "score": 3,
                    "author": "Romoreau"
                },
                {
                    "level": 1,
                    "comment": "Lee Soo Hyuk, Lee Joon, Lee Dong Wook, Kim Bum let’s go.",
                    "score": 2,
                    "author": "zaichii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "- **Chicken Nugget**\n&gt;It tells the strange story of how a beautiful young girl, Choi Min Ah, turns into fried chicken because she happens to enter a mysterious machine. It follows Choi Sun Man, her father, and Go Baek Jung, an intern, who join efforts to turn her back to human and discover deep dark secrets in the process.\n\n- **Hi Cookie**\n&gt;“Hi Cookie” is about an elite high school that gets swallowed up by dangerous handmade cookies that make people’s dreams come true. The drama tells the story of a woman who has to go into the swamp herself to rescue her drowning sister.\n\n- **Sparkling Watermelon**\n&gt;\"Sparkling Watermelon\" will tell the story of a boy living a double life between a model student and a band member who gets to time slip and meets his 18-year-old father. The two will build friendships there. \n\nMy wish is for the industry to keep rolling out these weird, food-related titled dramas!",
            "score": 18,
            "author": "Telos07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now you got me craving chicken nuggets",
                    "score": 2,
                    "author": "zaichii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wish is simple. More light hearted fun and ridiculous romcoms like wfkbj, swdbs, lotbs, mlfts, jealousy incarnate and such.\n\nScreenwriters of pre-netflix era, hope you guys pick up those tropey, fun styles again! \n\nAlso hope to see my queen Jun ji hyun in a drama (preferably romcom) soon. I miss her crazy acting.\n\nIk it won't happen but I still wish for Cho seung woo and bae doona to at least cameo in stranger spinoff. Also, will we ever get a s3?!\n\nTalking abt csw, I also wish he and his musical partner jeon Mido do a drama together. God it would be spectacular if the entire cast is from musicals.\n\nNot related to drama, I hope they do some musical-films like Johnny Depp's Sweeny Todd and give us, unfortunate international fans, a taste of Korean musicals.",
            "score": 17,
            "author": "throwawaymisfortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao so I asked chatgpt to write me a kdrama plot with csw and jm as leads and it gave me the most basic Melo (?) ever\n\n&gt;Title: Echoes of Love\n\nSynopsis:\n\nPark Hae-sung (Cho Seung-woo) is a talented composer and pianist who lost his hearing in a tragic accident. Despite this setback, he continues to pursue his passion for music and creates beautiful pieces by feeling the vibrations of the piano.\n\nOne day, Hae-sung meets a young woman named Kim Soo-ah (Jeon Mi-do), who has a unique ability to see sound as colors. Soo-ah is an aspiring painter who struggles to find inspiration for her art, but when she hears Hae-sung's music, she sees a kaleidoscope of colors and is captivated by his talent.\n\nAs Hae-sung and Soo-ah spend more time together, they begin to fall in love. However, their relationship is complicated by the fact that Hae-sung is deaf and Soo-ah sees the world differently from most people. They struggle to communicate with each other and face opposition from those around them who don't understand their connection.\n\nDespite the obstacles they face, Hae-sung and Soo-ah find solace in their shared love of music and art. With Hae-sung's guidance, Soo-ah learns to channel her unique perspective into her paintings and finds success as an artist. Meanwhile, Hae-sung's music reaches new heights as he draws inspiration from Soo-ah's vibrant world of colors.\n\nHowever, their happiness is short-lived when Hae-sung's hearing suddenly starts to return, leaving him confused and overwhelmed by the new sensations. As Hae-sung struggles to adapt to his changing world, he fears that he will lose the special bond he shares with Soo-ah.\n\nIn the end, Hae-sung and Soo-ah must navigate their way through their different perspectives and find a way to make their love work, despite the challenges they face. As they work together to create a masterpiece that combines their talents, they realize that their love is the most beautiful thing of all, and that it transcends the boundaries of sound and color.",
                    "score": 8,
                    "author": "throwawaymisfortune",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I totally buy it 😂",
                            "score": 6,
                            "author": "Maryofthesun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha let's find sponsors",
                                    "score": 3,
                                    "author": "throwawaymisfortune"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The fact that it sounds completely unsurprising as a K-drama makes you wonder how a lot of writers write their scripts...  😏🤭😉... or maybe that's just because it is from a bot, and it's taken its cues from actual dramas 😎.",
                            "score": 1,
                            "author": "idealistatlarge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ah, I really did another jealousy incarnate! my wish is for another drama where the drama simultaneously falls in love/is confused about 2 main leads! that was such a fun watch I’ve probably watched it like 6 times",
                    "score": 5,
                    "author": "some-mad-shit"
                },
                {
                    "level": 1,
                    "comment": "&gt;My wish is simple. More light hearted fun and ridiculous romcoms like wfkbj, swdbs, lotbs, mlfts, jealousy incarnate and such.\n\n&gt;Screenwriters of pre-netflix era, hope you guys pick up those tropey, fun styles again! \n\nThis.",
                    "score": 3,
                    "author": "mhfan_india"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At this moment my wish is for **Lee Min Ho** to decide on his next drama or movie and start shooting for it this year itself. \n\nAlso can we get casting confirmation from **Gong Yoo** and him starting him shooting? \n\nWhy do I stan such picky and private oppas 🤷",
            "score": 15,
            "author": "mhfan_india",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got my first wish already with LMH's next project more or less confirmed and shoot starting this year. Now I wish I should have wished for my two oppas in one project together. But then I wouldn't be able to handle it. So it's fine.",
                    "score": 3,
                    "author": "mhfan_india",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If LMH accepts the role of Yoo Joong Hyuk in Omniscient Reader's Viewpoint, then it's gonna be INSANE !! Let's hope he accepts it !! It's such an interesting story and it's something new !! Also Lee Min-ho in action is 1000/10 🔥🙌",
                            "score": 2,
                            "author": "Tsukuyomi_02",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bingo. I read the character description and it's like the writer has described LMH. My Twitter TL is on fire with all fans excited for this project already. I really wanted him to do an action movie or series and I am really happy he is doing action.",
                                    "score": 2,
                                    "author": "mhfan_india"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So this came up in the couple bracket discussion and I genuinely want to watch it.\n\nA drama following the life of Rosa and Jong Su from **Hospital Playlist**.\nShort episodes, feel good vibes about their retired lives cooking, gardening and travelling together. Romance and cameos from the rest of the cast aren't necessary but a nice bonus.",
            "score": 14,
            "author": "Helpful-Standard9107"
        },
        {
            "level": 0,
            "comment": "My wish is to see Lee Do Hyun as a villain in a drama! He’s impressed me with his acting in The Glory and now I’m loving his grey character in The Good Bad Mother. I NEED to watch a drama where he's the villain.",
            "score": 9,
            "author": "potionsofsirentears",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's a little morally grey in **Sweet Home** and I hadn't watched a lot of kdramas before watching SH and instantly loved his character so much! I'd be totally down for him as a villain!",
                    "score": 4,
                    "author": "ManicPixieOldMaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yesss I loved him in that one too even though I didn't like the drama as much! He needs to play the villain in his next one now 😂",
                            "score": 2,
                            "author": "potionsofsirentears"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMG this is my favorite thread topic.\n\n* **Scholar Who Walks the Night.** &gt;!Delete the FL's part entirely. Yup. She's top of my most annoying FL list. Instead, make the two kickass other female characters the romantic lead(s). Have Kim Sung Yeol (Lee Joon Gi) end up with his reborn wife, both roles played by Kim So Eun, and have Gwi (Lee Soo Hyuk) survive at the end and end up with the kisaeng madame (Jang Hee Jin) as end game and they just travel around the world in lots of sequels. I could honestly rewrite this entire script and it would be a joy to me.!&lt;\n* **Island**. &gt;!Make it more clear wtf is going on with the lore, and then make a sequel with the FL (Lee Da-hee) and Priest Johan (Cha Eun-woo) fighting demons around the globe.!&lt;\n* **Taxi Driver 2.** &gt;!take more care with the On Ha-jun (Shin Jae-ha) plot. Having the Bishop die rather than face any consequences for his actions other than death was just empty. Ha-jun deserved a better revenge.!&lt;\n* **Big Mouth.** &gt;!Change almost everything after the release from prison. The go-into-politics plot was terrible, as we've seen in countless other dramas that politics in dramaland ROK is just as dependent on who you know and how much money you have as anywhere else, and Park Chang-ho (Lee Jong-suk) had none of those things. They should have made him a broadcast journalist instead, imo.!&lt;\n* **The King: Eternal Monarch.** &gt;!Make the finale more clear! I like the ending and the setup for how their HEA will work, but the idea of Lee Gon (Lee Min-ho) waiting to find his version of Jeong Tae-eul (Kim Go-eun) could've been done soooo much better.!&lt;\n* **Alchemy of Souls.** &gt;!Delete the firebird plot entirely. The show is at its best when it's focused on the characters and their emotions and interactions; there was no reason to give it a big \"Game of Thrones\" type CGI finale because that was just dumb. They'd established that s2 ice stone Jang Uk (Lee Jae-wook) was pretty much invulnerable, so there were no stakes in the physical game. Keep the evil ice stone that Naksu (Go Yoon Jung/Jung So-min) has to retrieve, and make the plot more about who's evil and who isn't, and lean harder into different tropes.!&lt;\n* &gt;!I also demand that Seo Yul (Hwang Min-hyun) get a spinoff where he goes home to the life lantern North and gets to be the ML this time. Yul deserves it.!&lt;\n* **Flower Crew: Joseon Marriage Agency.** &gt;!Somebody give Ko Young-soo (Park Ji-hoon) all the hugs. His backstory and trauma deserved a lot more attention paid by his friends and he deserved some closure for his storyline. !&lt;\n\nI'll stop now.",
            "score": 8,
            "author": "ManicPixieOldMaid"
        },
        {
            "level": 0,
            "comment": "lee do hyun to do one drama where he doesn’t experience life-altering trauma",
            "score": 9,
            "author": "vega711"
        },
        {
            "level": 0,
            "comment": "Jun Ji Hyun and Kim Hye Soo in a drama together.",
            "score": 8,
            "author": "NavdeepNSG"
        },
        {
            "level": 0,
            "comment": "Yoo Ah In (healthy and in recovery), Uhm Tae Goo, and Jeon Do Yeon in a cop drama - one is a serial killer, two are cops - and it needs to be a weird and unexpected plot. No love story in this, just some acting and writing genius. \n\nI also want to see Woo Do Hwan in more challenging roles; he is a fine actor, and I really want to see him stretch himself. I'm talking about roles that would typically be offered to Yoo Ah In. Woo Do Hwan is a great character actor, so I would love to see him in more character roles in the future, but right now I'm craving something deep and ugly from him.",
            "score": 7,
            "author": "silvaslips",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want that first drama, too.\n\nI am in the middle of watching the Home Alone/I Live Alone with Woo Do Hwan. I've never seen a drama with him, but he has a beautiful speaking voice, I'm intrigued.",
                    "score": 3,
                    "author": "immerdasmeer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Woo Do Hwan is a truly versatile actor who is both talented and skilled. I appreciate his skill at utilizing all of the tools in an actor's toolbox (unique interpretation of the script, physical and vocal range, comedic timing, etc.). You should definitely give him a watch!",
                            "score": 3,
                            "author": "silvaslips"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Move to Heaven Season 2 would be nice, never going to happen though :(",
            "score": 7,
            "author": "imareddituserhi"
        },
        {
            "level": 0,
            "comment": "A time machine so I can erase the ending of Duty After School from my memory.",
            "score": 4,
            "author": "caninedesign"
        },
        {
            "level": 0,
            "comment": "I’m begging, can Lee Do Hyun PLEASE do a light hearted rom com??",
            "score": 6,
            "author": "otakuishly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes more comedy for him; he’s so funny and had great comedic chops in 18 Again",
                    "score": 1,
                    "author": "zaichii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’ve been wanting this pairing to happen since last year but watching lee jun-ho &amp; kim tae-ri together again this year has made me want to see them in the same drama all the more now! c’mon kdrama gods, do your magic! the talent &amp; visuals will be crazy!🥹",
            "score": 12,
            "author": "Fatooz"
        },
        {
            "level": 0,
            "comment": "Just had to come here and say the cover photo for this post killed me 🤣🤣🤣",
            "score": 3,
            "author": "strawberryicicles"
        },
        {
            "level": 0,
            "comment": "I must lack imagination--all I want is for Vagabond to have a decent ending or a second season to wrap things up properly. Although I wouldn't say no to a second season of Divorce Attorney Shin as a substitute...",
            "score": 5,
            "author": "TheChurroProject",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll die mad about that Vagabond ending.",
                    "score": 2,
                    "author": "AnemoneGoldman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a very original thought, but I would love to see a drama that pairs up Song Hye Kyo and Jung Sung Il and see if their chemistry during The Glory was just a fluke or not.",
            "score": 10,
            "author": "misanthropic_human"
        },
        {
            "level": 0,
            "comment": "As you can tell by my flair, one of my favorite kdrama characters ever is Gu Dong-Mae from **Mr. Sunshine**. I was so devastated by the ending of that show that I was forced to turn to fanfiction for therapy. My goal was to investigate what Dong-Mae’s lost years in Japan might have looked like - how did an orphan butcher from Korea end up not only trained as a samurai but leading a gang? I also wanted to further explore his obsession with Ae-shin. I ran out of steam before finishing but who knows, maybe I’ll get back to it.... [click here to read](https://archiveofourown.org/works/17029677).",
            "score": 6,
            "author": "setlib"
        },
        {
            "level": 0,
            "comment": "I want a good passionate romantic kdrama where the female lead who is from seoul  is healing from heartbreak and relationship truama (she finds out her best friend took her fiance). And the male lead  who is from jeju island is a nice wholesome man who never been in a relationship.\n\nAs they start dating in episode 6, she assumes he is a f boy but really he isnt and he is just smitten with her and he doesent truly realized it yet. Episode 12 is when things get complicated in a scene she yells about how much the new man is better and and uses him to brag to her ex best friend and her ex fiancee. The new man realizes this lashes out and basically Express how he is in love with her but she dont see it. At the end of episode 12 she realizes it and cries thinking she lost him...then in the last 5 minutes of the show when it's raining she get a suprise when her new man protects her from the rain.\n\nEpisode 13-15 she realizes her wrongs and fixes them not only does she help herself but she creates a healthy relationship with the new man and sees that he is an awesome guy ( and he really is) \n\nEpisode 16, her ex realizes her ex best friend is bad and now wants to come back.....realizing this she ignores his calls and lives happily ever after with the new man.",
            "score": 3,
            "author": "jimmmy2345",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would totally watch this. Now that you've got your script, have you started casting? :)",
                    "score": 1,
                    "author": "TheChurroProject",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok ja-yeon would be the female lead\nKim min kyu would be the male lead\n\nJung Sung-il as her ex fiance\nKwon nah would be her evil close friend who stole her man",
                            "score": 2,
                            "author": "jimmmy2345"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there was an adaptation of Succession or Hannibal I'd just about die.\n\nI really want more mixed genre shows too. Like a medical drama where a lead surgeon struggles with making time for his family,has a rival surgeon who's fighting for his position all while being concerned that the morgue/blood bank might be ran by a vampire.\n\nOr an enemy to lovers drama about two teachers who discover a hidden/horrible secret about the private school they work at. \n\nPolice officers in a small town where nothing ever happens deal with their first murder case. One thinks its the creepy old gardener while the other thinks an alien did it.\n\nI also want to see more big,manly dudes doing cute things and a college drama that won't bore me to tears.",
            "score": 3,
            "author": "Romoreau"
        },
        {
            "level": 0,
            "comment": "I wish Lee Min Ho would accept the role of Yoo Joong Hyuk that he has been offered for the movie Omniscient Reader's Viewpoint !!",
            "score": 2,
            "author": "Tsukuyomi_02"
        },
        {
            "level": 0,
            "comment": "I want a **Treasure Island** adaptation!",
            "score": 2,
            "author": "MilkyWayOfLife"
        },
        {
            "level": 0,
            "comment": "All I want is Lee Sang- in the lead in a period drama with Bae Suzy, that will be something !!",
            "score": 1,
            "author": "kusangyeshe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oops! That should be ..Lee Sang Yeob",
                    "score": 2,
                    "author": "kusangyeshe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One more Reply series. Reply 2005. I WANT TO SEE MY EARLY 2000s TEENAGE YEARS IN KDRAMA STYLE - is that too much to ask?! Ideally with a lovely ensemble cast - and Hwang In Youp and Kim Da Mi as one of the pairs. Please, kdrama gods, make it happen!",
            "score": 1,
            "author": "thelitgrad"
        }
    ]
}