{
    "id": "13blzs6",
    "score": 34,
    "title": "The Secret Romantic Guesthouse [Episodes 15 &amp; 16]",
    "author": "Fatooz",
    "date": 1683544671.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13blzs6",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/13blzs6/the_secret_romantic_guesthouse_episodes_15_16/"
    ],
    "other_urls": [
        "https://mydramalist.com/731175-flower-scholars-love-story)",
        "https://mydramalist.com/people/22888-kim-jung-min)",
        "https://mydramalist.com/people/70725-kwon-eum-mi)",
        "https://www.viki.com/tv/39209c-the-love-story-of-flower-scholars),",
        "https://www.viu.com/ott/id/en/all/playlist-the_secret_romantic_guesthouse-playlist-26273862)",
        "https://mydramalist.com/people/19700-shin-ye-eun)",
        "https://mydramalist.com/people/23633-ryeo-woon)",
        "https://mydramalist.com/people/18814-kang-hoon)",
        "https://mydramalist.com/people/18517-jung-gun-joo)",
        "https://www.reddit.com/r/KDRAMA/comments/11wnw0p/the_secret_romantic_guesthouse_episodes_1_2/)",
        "https://www.reddit.com/r/KDRAMA/comments/123jn7a/the_secret_romantic_guesthouse_episodes_3_4/)",
        "https://www.reddit.com/r/KDRAMA/comments/12agpsm/the_secret_romantic_guesthouse_episodes_5_6/)",
        "https://www.reddit.com/r/KDRAMA/comments/12h9aj5/the_secret_romantic_guesthouse_episodes_7_8/)",
        "https://www.reddit.com/r/KDRAMA/comments/12pbxrg/the_secret_romantic_guesthouse_episodes_9_10/)",
        "https://www.reddit.com/r/KDRAMA/comments/12xcuvn/the_secret_romantic_guesthouse_episodes_11_12/)",
        "https://www.reddit.com/r/KDRAMA/comments/134gljc/the_secret_romantic_guesthouse_episodes_13_14/)",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags)."
    ],
    "postText": "* **Drama:** [The Secret Romantic Guesthouse](https://mydramalist.com/731175-flower-scholars-love-story)\n  * **Hangul:** 꽃선비 열애사\n  * **Also known as:** The Love Story of Flower Scholars, Flower Scholars' Love Story, Kkotseonbi Yeolaesa, Kkochseonbiyeolaesa, 꽃선비열애사, Romantic Guest House\n* **Director:** [Kim Jung-Min](https://mydramalist.com/people/22888-kim-jung-min) (Gunman in Joseon, The Princess' Man)\n* **Writer:** [Kwon Eum-Mi](https://mydramalist.com/people/70725-kwon-eum-mi) (Woman With a Suitcase, Gap Dong)\n* **Network:** SBS\n* **Episodes:** 18\n  * **Duration:** 1 hr. 10 mins.\n* **Air Date:** Mondays &amp; Tuesdays @ 22:00 KST\n  * **Airing:** Mar 20, 2023 - May 16, 2023\n* **Streaming Source(s):** [Viki](https://www.viki.com/tv/39209c-the-love-story-of-flower-scholars), [Viu TV](https://www.viu.com/ott/id/en/all/playlist-the_secret_romantic_guesthouse-playlist-26273862)\n* **Starring:** \n  * [Shin Ye-Eun](https://mydramalist.com/people/19700-shin-ye-eun) (Revenge of Others, He Is Psychometric) as *Yoon Dan-Oh*  \n  * [Ryeoun](https://mydramalist.com/people/23633-ryeo-woon) (Through the Darkness, 18 Again) as *Kang San\n  * [Kang Hoon](https://mydramalist.com/people/18814-kang-hoon) (Little Women, The Red Sleeve) as *Kim Shi-Yeol*\n  * [Jung Gun-Joo](https://mydramalist.com/people/18517-jung-gun-joo) (Oh My Baby, Extraordinary You) as *Jung Yoo-Ha*\n* **Plot Synopsis:** Yoon Dan-Oh had enjoyed a comfortable life as the beloved youngest daughter of a well-off family, but no longer. Now the family breadwinner, she runs the Ihwawon Inn. Current guests are scholars taking the civil service entrance exam in the hopes of becoming high-ranking officials. Among them are Kang San, Kim Si-Yeol, and Jeong Yoo Ha, who all have deep secrets. They and Yoon Dan Oh will share information and cooperate to find Lee Seol, who disappeared 13 years ago.\n* **Genre:** Historical, Mystery, Romance, Drama\n* **Previous Discussions:**\n  * [[Episodes 1 &amp; 2]](https://www.reddit.com/r/KDRAMA/comments/11wnw0p/the_secret_romantic_guesthouse_episodes_1_2/)\n  * [[Episodes 3 &amp; 4]](https://www.reddit.com/r/KDRAMA/comments/123jn7a/the_secret_romantic_guesthouse_episodes_3_4/)\n  * [[Episodes 5 &amp; 6]](https://www.reddit.com/r/KDRAMA/comments/12agpsm/the_secret_romantic_guesthouse_episodes_5_6/)\n  * [[Episodes 7 &amp; 8]](https://www.reddit.com/r/KDRAMA/comments/12h9aj5/the_secret_romantic_guesthouse_episodes_7_8/)\n  * [[Episodes 9 &amp; 10]](https://www.reddit.com/r/KDRAMA/comments/12pbxrg/the_secret_romantic_guesthouse_episodes_9_10/)\n  * [[Episodes 11 &amp; 12]](https://www.reddit.com/r/KDRAMA/comments/12xcuvn/the_secret_romantic_guesthouse_episodes_11_12/)\n  * [[Episodes 13 &amp; 14]](https://www.reddit.com/r/KDRAMA/comments/134gljc/the_secret_romantic_guesthouse_episodes_13_14/)\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on r/KDRAMA: (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct) (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/). Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behaviour will lead to increasing exclusions from our community. Any extreme cases of misconduct (such as racism or hate speech) will result in an immediate permanent ban from our community and a report to Reddit admin. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag by writing &gt; ! this spoiler ! &lt; without the spaces in between to get &gt;!this spoiler!&lt;. For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).",
    "comments": [
        {
            "level": 0,
            "comment": "I just wanna say Kang Hoon is doing such a great job as Si Yeol, his character was also written very 3D. I love San but despite &gt;! being the protagonist,  !&lt; I wish he &gt;! had more layers to his personality other than wanting to take the throne/ wanting to be together with Dan Oh. Like he didn’t even show why he deserves to be king - is it because he cares about the people? I don’t remember seeing any scenes of him showing himself as a good potential king. Or maybe I missed them? In fact I think Yu Ha was closer to a potential king than San from his Mokinhoe leadership (sorry if I spelt it wrong, I’m very sleepy haha) !&lt;\n\nAlso wanna thank Master Jang for always spicing the drama up with &gt;! all his murder schemes. !&lt; everytime I see this actor as the antagonist in shows I know he’s gonna be good. CLOY, Youth of May etc haha",
            "score": 21,
            "author": "gingerpoodles",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really hate Jang so the actor is doing a great job",
                    "score": 9,
                    "author": "Electronic_Piano9385"
                },
                {
                    "level": 1,
                    "comment": "You're not wrong but San is aware that he was just so focused and busy surviving that he wasn't able to think about how to govern. But the queen mother could act as regent anyway to help him rule. It was more urgent to depose the current king. I guess this is also why he spared Yu Ha and recognized he's more ready to rule than he is. Plus, I think he's smart enough to learn quickly or else he wouldn't have easily topped the state exam. And I think it's a smart tactic to actually have 2 potential heirs instead of just him. I'm quite surprised he thought of this too.",
                    "score": 5,
                    "author": "SnooGeekgoddess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree! The preview gave me a bad feeling &gt;! about Yu Ha’s fate !&lt; though, hoping everyone has a happy ending",
                            "score": 3,
                            "author": "gingerpoodles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Also wanna thank Master Jang for always spicing the drama up with &gt;! all his murder schemes. !&lt; everytime I see this actor as the antagonist in shows I know he’s gonna be good. CLOY, Youth of May etc haha\n\nI'm pretty much watching the show for his scenes now. Don't get me wrong, the rest of the cast is great but Oh Man Seok is on a different level.",
                    "score": 2,
                    "author": "Orongorongorongo"
                },
                {
                    "level": 1,
                    "comment": "I didn't know he was the villain from CLOY.",
                    "score": 1,
                    "author": "iamhopeestheim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Episode 16**:\n\nWhy is everyone so freaking stupid? Sure. It's a great time to talk while enemies are coming. They could have also asked Minister Shin Won-Ho for help. They have allies in the military. They could have surrounded the enemies to rescue the girls. Why do they act first before coming up with a sound plan?\n\n&gt;!Why didn't they just kill Master Jang?!&lt; He says so himself. He is a strategist. They could have at least caused some damage to the King. It takes only a second to slash someone &gt;!and they could have all escaped!&lt;. \n\nThe King was shot with an arrow to the heart and he recovered while &gt;!Hwa-Ryung just got slashed and died right after!&lt;. The plot armor is really thick. I guess someone has to die for drama.\n\nI totally called it. &gt;!Hwa-Ryung died while protecting Yoo-Ha!&lt;. I knew that the secret would raise red flags.\n\nI really hate that the Queen Dowager is so powerless. I've had my fair share of K-Dramas and in almost all of them, the Queen Dowager is more powerful than the King himself or at least have some power to strategize and do stuff. \n\nPlease give Yoo-Ha a happy ending. He deserve so much better. &gt;!I don't think he would be killed though!&lt;.",
            "score": 11,
            "author": "iamhopeestheim",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am so mad watching the final scenes of ep 16. They could just kill that man and all flee together. What's the point keeping him alive to cause more damage? And the king...I don't even want to start. Why didn't he just die already? Or at least people around him should have wanted him dead dead cuz he is a trashy ruler.",
                    "score": 8,
                    "author": "maomaook",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IKR. It literally takes one second to slash him. They could have all escaped together. Why does &gt;!Yoo-Ha!&lt; have to be taken as a hostage?\n\nI totally agree. The King should have died. No one who takes an arrow to the heart could have survived. The plot armor is really thick.",
                            "score": 3,
                            "author": "iamhopeestheim"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly! I couldn't stand that in such a time of crisis, they were all acting in slow motion. The direction of this drama leaves a lot to be desired.",
                    "score": 1,
                    "author": "nshank01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really Kang San - who &gt;!goes on an assassination mission without knowing your exit startegy?!&lt; Very much an in the moment person, King San - Yu Haa is a forward planner, ergo better king?\n\nLooks like &gt;!Hongshi is heading for an unhappy ending!&lt; but I really hope not - still 3 episodes to go - ANYTHING could happen!",
            "score": 8,
            "author": "ScowlingGoddess"
        },
        {
            "level": 0,
            "comment": "This show seems to have been airing for a looooong time!",
            "score": 7,
            "author": "DonnaMossLyman"
        },
        {
            "level": 0,
            "comment": "Aaargh! I swear, I want to root for the Garden of Flower people but their naivete (or stupidity) is sooooo frustrating! Hello, it's a trap! At least have a contingency plan.",
            "score": 9,
            "author": "SnooGeekgoddess"
        },
        {
            "level": 0,
            "comment": "Sadly, I spent most of ep 16 feeling irritated that they seemed to have no sense of urgency whilst the danger is mounting. &gt;!The scene in the deserted house with the Six Swords and the Chief Administrator was clumsy IMO!&lt;. I hope things improve for the last 2 episodes.",
            "score": 9,
            "author": "ScowlingGoddess",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally agree. Why do they have to talk about their feelings right then and there? It's so stupid.",
                    "score": 5,
                    "author": "iamhopeestheim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Why do they have to talk about their feelings right then and there?\n\nAt least it beats taking time for a passionate embrace with a nuclear device ticking down...",
                            "score": 2,
                            "author": "jsb1685"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was unexcited to watch ep 15 but ended up enjoying it. So I was excited to watch ep 16, but it totally fell flat. &gt;!I was so frustrated when they were in a to the death sword fight and they suddenly just stopped to pan over a little to watch Yoo Ha's mother die. What kind of pacing is that?!&lt;\n\nKang San is still my boy, though!",
                    "score": 3,
                    "author": "lizzie763"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Episode 15:**\n\n* All hail Kang Hoon aka Si Yeol aka The Watchman. I like the fact that even though Hong Ju and his love were doomed since his past but boy my man delivered beautifully. It was an absolute delight to see him so torn and sacrificing his love to save her the heartbreak. But we all know that won't last obvio. Rooting for my HongShi babies.\n* On the other side, I don't believe for one second &gt;!Si Yeol!&lt; would ever shirk his duties and let Ok-Jin be in danger knowingly.\n* I feel like Kang San and Dan O's story seems to have gotten mellow. However, the jade rings were love and the &gt;!kiss!&lt; was definitely much better than their first. There's a huge possibility that moving forward someone from the two will eventually be in grave danger or on the brink of death to up the stakes so let's see how that goes.\n* The scene with the &gt;!Queen Dowager reuniting with Ok-Jin!&lt; was pretty heartfelt. The way she expressed that he was not at fault is something he probably wanted to hear his whole life. So yeah that was well done.\n* Super glad the animosity between Yu Ha and Kang San is over. I adore their bromance. Also, that scene where &gt;!Si Yeol threatens Yu Ha!&lt; was SO HOT!\n* Really don't care about the bad guys at this point. But of course, the brat &gt;!King!&lt; won't die so easily.",
            "score": 7,
            "author": "UptoNoGood46"
        },
        {
            "level": 0,
            "comment": "**Episode 15:**\n\nI'm so happy that San and Yoo-Ha are getting along really well. I would have hated it if they became enemies because of the throne. I think Yoo-Ha is a better fit to be the King. \n\nI'm also happy that Dan-O and Ban-Ya didn't fight over one man. I love the genuineness of their friendship. I hate it whenever two friends fight over one man. I was scared that Ban-Ya would betray Dan-O.\n\n&gt;!How the hell did the King survive the arrow to the heart? He should have been dead if it weren't for the plot armor.!&lt; It makes my blood boil whenever he's on the screen. \n\nI can't help but compare this to The King's Affection. I have a hunch that just like in The King's Affection, the SML would take the throne so that the protagonists can be together. Besides, Yoo-Ha deserves to be the King. \n\nSan is like Daenerys. He's claiming the throne because it's his birthright. But he hasn't done anything yet to prove that he's capable of being the King.",
            "score": 7,
            "author": "iamhopeestheim"
        },
        {
            "level": 0,
            "comment": "Why? Why didn’t &gt;!they kill evil father in law? Why?!&lt; And why did the hostess &gt;!die so fast while the king hung in?!&lt;\n\nKang Hoon continues to act circles around everyone, I must say.\n\nAlso, Dan Oh is &gt;!just annoying at this point. But San is finally growing on me, and Yoo Ha definitely deserves to be the king.!&lt;",
            "score": 7,
            "author": "akapiratequeen",
            "replies": [
                {
                    "level": 1,
                    "comment": "ikr they just gonna be dragging the plot\n\nthey had so many chances to kill Master Jang but no, just let him continue kidnapping and threatening their safety",
                    "score": 2,
                    "author": "xkaizoku62"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So who is end game? Our OG couple, or the second couple (who have much better chemistry, by the way?",
            "score": 6,
            "author": "SnooGeekgoddess",
            "replies": [
                {
                    "level": 1,
                    "comment": "The second couple seem to have entered the noble idiocy phase. They have 3 episodes to recover. \n\nMain couple now have &gt;!white jade couple rings!&lt; but I’m not sure how they can stay together if Lee Seol becomes king. They should run off to the seaside together and leave fake Lee Seol in charge",
                    "score": 5,
                    "author": "Electronic_Piano9385",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If the watchman is killed then Dan O will struggle to leave her sister to become the queen so that may be the only barrier for the OG couple. I don’t think the palace will stop them from being together as she is off noble birth. \n\nI think someone is going to die though. Whether it’s both the watchman and the sister or one of them who knows",
                            "score": 4,
                            "author": "Tangoalphasierr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe that all of the Ihwawon family will survive.  The only possible question is whether Shi-yeol and Hong Joo have their happy ending but I'm more convinced than ever that they will - their story is epic - lonely people who find love; shadow and ghost (I'm plagiarizing from commenter Monimss (sp?) here on Reddit); twisted fate,   In other words - they have earned it.  \n\nI don't know if the web novel clearly identified Dan-oh and Kang San as the \"couple to be loved above all others\", and it appears that the drama also tries to convey that message, but perhaps casting unintentionally changed the dynamic.",
                                    "score": 3,
                                    "author": "Kathryn_51"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We should call Ep. 15 \"Episode Shi-yeol\" (or, Kang Hoon Slays Once Again)\n\nRepeating what I said on MDL yesterday (before today's show):  As far as I'm concerned, Shi-yeol is THE Main protagonist in this drama. His character is complex, multi-layered, full of tragedy, racked by guilt and above all - heroic. Other characters are just window-dressing.\n\nEp. 15 did not disappoint. &gt;!I usually hate the \"noble sacrifice\" trope common to romantic k- dramas, but this one was fore-ordained from the beginning if, like me, you believed that Shi-yeol was the original Watchman.  He HAD to walk away from her once he realized he had killed her fiance.  Moreover, he knows that he has put her in danger.  Finally, I don't believe the Ep. 16 preview about the Watchman resigning - it's all for show.!&lt;  Shi-yeol is a hero.",
            "score": 12,
            "author": "Kathryn_51"
        },
        {
            "level": 0,
            "comment": "If the watchman is killed then Dan O will struggle to leave her sister to become the queen so that may be the only barrier for the main couple. I don’t think the palace will stop them from being together as she is off noble birth. \n\nI think someone is going to die though. Whether it’s both the watchman and the sister or one of them who knows?",
            "score": 3,
            "author": "Tangoalphasierr"
        },
        {
            "level": 0,
            "comment": "Someone explain how this man gets stabbed in the heart and is magically up and running few days later. Whereas,  this woman dies spitting out blood from her organs destroyed within half-hour of a cut to the back. \nIs this king half English cause God really is saving the king?!\n\nI feel bad for Yoo ha: a life of being rejecting by his former family, rejected from the girl he’s in love with, mum dies and now he’s getting tortured for a throne he isn’t even after. Love is usually worth living for but how could he even have a proper happy ending when the girl he loves will be with his half brother. \n\nCurious to see how the ending is going to go down, one must have to die? whether it’s Yoo ha for a bitter sweet ending, who knows?",
            "score": 3,
            "author": "Tangoalphasierr"
        },
        {
            "level": 0,
            "comment": "Parts of this are so good, but then it drags...Kang Hoon out here chewing scenery, the Watchman plot is the only reason I'm holding on, thoroughly invested in it. The action is good would have liked more. 18 episodes seem like a lot, not sure how we're going to end it but I've come this far.",
            "score": 3,
            "author": "samptra_writer"
        },
        {
            "level": 0,
            "comment": "I will be very sad if the body guard is killed. I wish they had written the deposed princes' son a little smarter.it is highly unlikely that he would have been so unpolitical. I don't even think the actor fits the role. I wish they had written the brothers' meeting a little sooner. I wish the female lead was less bland. I wouldn't risk a throne for her. But we will see. Korean dramas sometimes spoil themselves with blandness and idol time wasting dialogue.",
            "score": 5,
            "author": "mbee111314"
        },
        {
            "level": 0,
            "comment": "I was very disappointed by these two episodes the story slowed in the wrong places making the plot a bit stupid and unbelievable.",
            "score": 2,
            "author": "sinjoorke"
        },
        {
            "level": 0,
            "comment": "I have finished the drama and I say meh.... I think the ML FL had no chemistry. They wasted a lot of time on long lingering looks and the M L looks like he has indigestion for most of it. Why are some dramas so bland.",
            "score": 2,
            "author": "mbee111314"
        }
    ]
}