{
    "id": "13hb8dt",
    "score": 54,
    "title": "Premiere Week: \"Oh! Youngsim\" &amp; \"Star Struck\"",
    "author": "masbond84",
    "date": 1684068116.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13hb8dt",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/13hb8dt/premiere_week_oh_youngsim_star_struck/"
    ],
    "other_urls": [
        "https://mydramalist.com/736643-oh-youngsimi)",
        "https://www.youtube.com/watch?v=b5a86YIEf6M&amp;pp=ygUPb2ggeW91bmdzaW0gdml1)",
        "https://mydramalist.com/706227-star-struck)",
        "https://www.youtube.com/watch?v=Qrk8ycq9jKo&amp;ab_channel=%ED%97%A4%EB%B8%90%EB%A6%ACHeavenly)"
    ],
    "postText": "[ENA' Oh! Youngsim](https://mydramalist.com/736643-oh-youngsimi)\n\nPremieres **May 15 (Monday)**\n\n* Cast: Song Ha-yoon (*Fight For My Way*), Lee Dong-hae (*God's Quiz Season 4*), Lee Min-jae (*Crash Course in Romance*), Jung Woo-yeon (*School 2013*)\n* Synopsis: Oh Young Sim is single and in her 30’s. She has worked as a TV variety show PD for 8 years. She wants to make people laugh with her TV shows, but they were always cancelled due to low popularity ratings. Her career is now in a crisis. She has a chance to produce a love entertainment show as a pilot program. For the show, Oh Young Sim casts famous start-up founder Mark Wang as a guest. She is surprised that Mark Wang is Wang Kyung Tae. When they were little, Wang Kyung Tae had a crush on Oh Young Sim and he always let her know how he felt about her. Oh Young Sim did not feel the same way towards Wang Kyung Tae at the time. He then suddenly moved to the United States with his family. They lost contact with each other afterwards.  Now, 20 years after they were last together, Wang Kyung Tae appears in front of her as CEO Mark Wang. Meanwhile, PD Lee Chae Dong works with PD Oh Young Sim in the same variety show department. He is always on her side. Also around Oh Young Sim is her friend Goo Wol Sook. She runs popular YouTube video channel “Ku’s Date.” \n* Director: Oh Hwan-min, Kim Eun-kyung (*movie \"Show Me The Ghost\"*)\n* Screenwriter: Jeon Seon-young (*A DeadbEAT's Meal*)\n* Teaser/Trailer: [Trailer](https://www.youtube.com/watch?v=b5a86YIEf6M&amp;pp=ygUPb2ggeW91bmdzaW0gdml1)\n* Streaming: Viu &amp; Viki\n\n[Heavenly' Star Struck](https://mydramalist.com/706227-star-struck)\n\nPremieres **May 17 (Wednesday)**\n\n* Cast: SF9' Zuho (*Heartbeat BroadcastingAccident*), Kim In-sung, Park Tae-in (*Doom at Your Service*)\n* Synopsis:  When love is kept for a long time...will that feeling blossom?  Seo Han Joon has been in love with his childhood friend, Jo Yoo Jae, for a long time. He knew his feelings wouldn’t be reciprocated, and it didn’t matter because he never even dreamed of confessing to him. But this time, he wanted to express his love... \n* Director: Park Sun-jae (*Midnight Thriller*), Kim Hoon-gwang\n* Screenwriter: Jung Hyun-woo\n* Teaser/Trailer: [Trailer](https://www.youtube.com/watch?v=Qrk8ycq9jKo&amp;ab_channel=%ED%97%A4%EB%B8%90%EB%A6%ACHeavenly)\n* Streaming: iQiyi\n\nAll info are compiled based from MDL, Google searches and respective streaming pages. If there's any incorrect or missing info, do inform me. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "OYS seems a carbon copy of Love is for Suckers and that was just a meh drama even though I like both leads. Hoping this one is better?",
            "score": 14,
            "author": "Linwechan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also initially thought of Love is for Suckers when I read the synopsis. It wasn’t the best drama but I got by with it. I miss the theme song though lol Me being a musician I really liked how that chord progression sounded",
                    "score": 2,
                    "author": "kdramajames"
                },
                {
                    "level": 1,
                    "comment": "Love is for suckers was good",
                    "score": 5,
                    "author": "giratina143"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kdramas have been churning out mostly revenge or family or angsty dramas lately. For some reason romcoms seem to have disappeared, even though they were the ones that attracted majority of the international audience to Kdramas in the first place. So I am glad to see another romcom coming up now that Bo Ra! Deborah is about to wrap up. Star Struck looks good too. Will be checking out both.",
            "score": 31,
            "author": "KDramaTipsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah even modern rom coms have changed. Theres different shades in the spectrum of rom coms but the era of vibes like the humor and romance found in stuff like my love from the star or legend of the blue sea is like a lost art now. \n\nWe have rom coms but that genre now turns out to be similar to stuff that’s found in Dr Cha, where it’s an added pallet to the overall story. They’ll mix it in with some kind of angst, revenge etc, and when they do slip in the rom com vibes it’s not written with the same “ba da boom tisk” landing. I feel it’s just a different era now where comedy and romance is different. \n\nBut yea lol it also feels like they go into a rotation phase with genres. Last year it felt like there were a lot of doctor and legal shows. Now we have Interest of Love",
                    "score": 10,
                    "author": "kdramajames",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. It's like Kdramas are afraid of being silly and tropey now, and just want to be a Korean version of western romcoms. I hope Lee Jun-Ho's upcoming tropey romcom does well and Kdrama producers understand that this is what the audience wants.",
                            "score": 3,
                            "author": "KDramaTipsy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holding out hope Star Struck us decent, The Eighth Sense has ruined us all 🥹",
                    "score": 6,
                    "author": "samptra_writer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has indeed 🥹  We need an opportunity to move on!",
                            "score": 2,
                            "author": "KDramaTipsy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "honestly, this is why I've mostly stopped watching kdramas.  They stopped making the shows that got me to start watching in the first place.",
                    "score": 6,
                    "author": "thebluick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got into Kdramas for the romance, and the only serious one we have got this year is Call It Love. And Bo Ra Deborah for a romcom. No wonder people have been getting more into Chinese dramas and BLs to get their dose of romance.",
                            "score": 11,
                            "author": "KDramaTipsy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "some of the recent BL stories looked interesting.  But unfortunately I just don't enjoy them.",
                                    "score": 5,
                                    "author": "thebluick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Have you checked out The Eighth Sense?",
                                            "score": 2,
                                            "author": "KDramaTipsy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That plot sounds interesting. but I just don't enjoy gay romance as the main story.  I don't mind it as the B plot, but I don't feel the same things that I want from a romance when I can't \"self-insert\".",
                                                    "score": 9,
                                                    "author": "thebluick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah, okay.",
                                                            "score": 3,
                                                            "author": "KDramaTipsy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "BLs just feel like porn to me :S",
                                    "score": 1,
                                    "author": "Upstairs-Progress-97"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man I love revenge dramas normally, but none of the current ones have really fit the bill for me XD. They need far more melodrama and craziness than the current batch gave me. \n\nLooking forward to Oh Young Sim, it sounds cute.",
                    "score": 3,
                    "author": "sophie-ursinus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't want Kdramas to lose their Kdramaness. I hope they get back to being raw and cute.",
                            "score": 5,
                            "author": "KDramaTipsy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looking forward to youngsim! I crave something light-hearted.",
            "score": 8,
            "author": "Upstairs-Progress-97"
        },
        {
            "level": 0,
            "comment": "The first episode of Oh! Youngsim felt very bargain-bin. Everything about this drama feels very cheap and lazily done… honestly, it’s not feeling like it’ll fulfill the cup of those of us who are desperate for a good romcom (at least in my view).",
            "score": 8,
            "author": "girlwithlove95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same.  I dropped it faster than you can say annyeong.",
                    "score": 5,
                    "author": "One_Scholar_4096"
                },
                {
                    "level": 1,
                    "comment": "Agree, I felt disappointed despite having no expectations.",
                    "score": 2,
                    "author": "Ashamed_Motor_6619"
                },
                {
                    "level": 1,
                    "comment": "It felt more like a sitcom/slapstick to me... the FL is very over the top. But i loooove lee minjae so I might stick with it for a few eps.",
                    "score": 2,
                    "author": "xiaopow"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the heads-up! I was about to start streaming",
                    "score": 1,
                    "author": "nautankiruna",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a good watch! I would say try it. I’m really enjoying it. The second episode was great",
                            "score": 1,
                            "author": "Ok_Wash4997"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh Young Sim looks cute!",
            "score": 3,
            "author": "sophie-ursinus"
        },
        {
            "level": 0,
            "comment": "I’m so sat for StarStruck. I just need it to be ODS not ATL.",
            "score": 2,
            "author": "Flappadingo"
        },
        {
            "level": 0,
            "comment": "Is there no sub for the show? I wanted to read others options cause i can’t even get through the first 10 minutes without cringing",
            "score": 1,
            "author": "Ellotheremate000",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are subs on viki",
                    "score": 1,
                    "author": "Ok_Wash4997"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ep 2 was hilarious !!! Really enjoying this show at the moment.\n\nEdit - it seems everyone else hates the show but I’m loving it.",
            "score": 1,
            "author": "Ok_Wash4997"
        }
    ]
}