{
    "id": "13hwkdd",
    "score": 60,
    "title": "Noh Jung Ui, Lee Chae Min, And More Confirmed To Star In New School Drama “Hierarchy”",
    "author": "neocitywayv",
    "date": 1684122149.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13hwkdd",
    "media_urls": [
        "https://www.soompi.com/article/1587255wpp/noh-jung-ui-lee-chae-min-and-more-confirmed-to-star-in-new-school-drama-hierarchy"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Lee Chae-min did such a great job as Seon-jae in **Crash Course in Romance**, so it’s good to see him getting a lead role.\n\nAs far as the plot is concerned, any education-related drama is mandatory viewing for me personally.",
            "score": 21,
            "author": "Telos07"
        },
        {
            "level": 0,
            "comment": "I appreciate that there are no poor FLs who gets bullied by a richer than Croesus ML ,who falls violently in love with her but can't express his feelings.  I'll be watching this one .\n\n\nOh the ML is a scholarship student so I hope we get some role reversal  .",
            "score": 12,
            "author": "AdMore2091"
        },
        {
            "level": 0,
            "comment": "Music show mc!",
            "score": 6,
            "author": "YoshidaKyo"
        },
        {
            "level": 0,
            "comment": "Seems like \"Gossip girls\" or \"the heirs\". Wish Netflix would come up with an original story.",
            "score": 1,
            "author": "Ruhi0202"
        },
        {
            "level": 0,
            "comment": "There are some controversies about how this drama will contain sex &amp; nudity like that of an American drama which Knetz dislikes.",
            "score": -1,
            "author": "AceTrigger94",
            "replies": [
                {
                    "level": 1,
                    "comment": "There has no where mentioned it will be R rated just knetz assuming things that it would be like Spanish series Elite",
                    "score": 6,
                    "author": "Rajaffs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh I’d dig that just cause it’s super different. A Kdrama like Elite is just something you’d never seen before. Would be interesting",
                            "score": 2,
                            "author": "Medical-Character655",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please they made an Indian remake and it was ridiculously unbelievable.  Like even after allowing for creative license, extreme exaggeration and stuff it was so odd that it took me out .",
                                    "score": 1,
                                    "author": "AdMore2091",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah a korean version would most likely definitely go quite extreme especially when you look at how explicit Kmovies can get. Their movies get more explicit than hollywood. It’s actually odd just seeing a 5 second bed scene in a kdrama so I’m just down for something completely different atp",
                                            "score": 3,
                                            "author": "Medical-Character655"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}