{
    "id": "13p9bzo",
    "score": 12,
    "title": "SPOTLIGHT ON Baeksang Winners/Nominees - May, 2023",
    "author": "AutoModerator",
    "date": 1684803620.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13p9bzo",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/13p9bzo/spotlight_on_baeksang_winnersnominees_may_2023/"
    ],
    "other_urls": [
        "https://en.wikipedia.org/wiki/Baeksang_Arts_Awards)"
    ],
    "postText": "Welcome to our **Spotlight On** post series where you can share your picks of dramas that deserve the spotlight! Each **Spotlight On** post is focused on a genre or theme, as you can see in the post title. Based on this genre/theme, you are welcome to share your views about dramas you have watched that fit the topic of this post, which is:\n\n**Baeksang Winners/Nominees**\n\nDramas that have been nominated for or won a prize at the [Baeksang Arts Awards](https://en.wikipedia.org/wiki/Baeksang_Arts_Awards)\n\nYou are invited to share short (or long) reviews of dramas you have watched that fit the topic of this post and an explanation of why you think the drama deserves the spotlight, including whether you would recommend the drama or not.\n\nOur suggested format/structure for comments is:\n\n**Drama Name**\n\n* **Good Things**: about the drama, \n\n* **Bad Things**: about the drama\n\n* **Interesting Things**: about the drama\n\n* **Spotlight On Because**: explain why you think the drama deserves the spotlight, including whether you would recommend the drama or not.\n\nWe strongly encourage you to share your MDL profile so that others can compare their tastes with yours to get a better understanding of preferences and dislikes, which will help in understanding if the feedback provided is applicable for them.\n\nPlease remember that every individual watching goes in with their own life experiences and biases so not everyone will see the drama in the same light or enjoy it in the same way.\n\n**Just because someone did not enjoy a drama that you loved is not a slight against you as a person.**\n\nWhen participating in this discussion please remember that whilst dramas do not have feelings, human beings do. ***Be kind to one another.***\n\n**Please remember to use spoiler tags when discussing major plot points or anything you think should be redacted.** If you are using Markdown and not Fancy Pants Editor, the easiest way to create spoiler tags is to use &gt; ! spoiler content ! &lt; without spaces to get &gt;!spoiler content!&lt;. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).",
    "comments": [
        {
            "level": 0,
            "comment": "Dramas (post 2010) winning daesang is fewer than I expected.\n\n2012- deep rooted tree\n\n2016- descendants of the sun\n\n*2017- goblin (screenwriter won)\n\n2018- stranger\n\n2020- when the camellia blooms\n\n2022- squid game\n\nAmong the ones I have watched, (dots, goblin and stranger) **stranger** is the most perfect one. I bet it will still be a satisfying quality watch if it is watched ten years later. \n\nBtw, genuinely curious, is there anyone who thinks otherwise?",
            "score": 7,
            "author": "throwawaymisfortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve watched four of these and wouldn’t say a single one was the best drama of their given years, let alone better than every other nominee across every category",
                    "score": 3,
                    "author": "mikapple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I mean it was a fun ride, but Descendants of the Sun is an entire mess when it comes to plotting. I kind of think of it as the K-drama version of Top Gun, but with fewer planes.  \n\n\nGoblin I get--I have the same issue that a lot of people have with the main couple, but the thing works as a whole, anyway.  \n\n\nSquid Game isn't my kind of thing, but it's good.   \n\n\nThe rest I haven't seen, but I think I'll try When the Camellia Blooms.",
                            "score": 6,
                            "author": "MapInternational5289",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw the last four.  Goblin has great cinematography that it makes me want to go to Montreal stat..  I think  Squid Game and Stranger will stand the test of time.  WtCB, morality seems to be imbedded - single motherhood, female running a bar, orphanhood, etc.  It's not everyone's cup of tea, esp. if non-Korean, because a lot of the funny parts got lost in translation (Kang Ha-neul's regional accent and mannerisms, etc.)\n\nAnd am gutted for Baeksang 2023 best drama which went to The Glory, which IMO, the least deserving.  Our Blues and My Liberation Notes should have won.  Even Little Women was more deserving because of the artsy setting and the twisty story line.  And of course almost everyone love Atty. Woo.",
                                    "score": 3,
                                    "author": "aliasamandawho"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which four?\n\nIdk the criteria for daesang (will be great if someone explains it) but considering it is the grand prize, I think the work must be great as a whole, impactful and popular.\n\nSignal (best drama) was definitely better in terms of plot but dots as a whole was more entertaining for me. Not really worthy of daesang btw xD\n\nIgnoring the romance part of goblin, the concept was interesting. I haven't watched most other nominated drama (only Dr romantic) so can't say if it was a deserving win or not. Btw I am watching a similar Taiwanese drama **rainless love in a godless land** and enjoying it more than goblin. The concept is original, refreshing and wonderfully executed.\n\nStranger 100% deserves the daesang. Like it can compete in every year and still win it. There are obviously better drama in terms of plot, but as a whole, stranger is almost perfect. None of the elements of a drama (plot, cast-main/supports/extra, acting, editing, pacing, directing style, bgm, whatever else is there) overpowered anything or anyone rather created a harmonious balance maintaining a consistent strong quality, which is extremely rare in a kdrama. Well, I haven't found any, so stranger remains the unparalleled top kdrama for me.",
                            "score": 3,
                            "author": "throwawaymisfortune"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My Liberation Notes was a Baeksang nominee but did not win this past year.\n\nHowever, it was a worthy follow-up to My Mister since both were written by the same writer, Park Hae-young, whose name carries as much weight in the kdrama world as Christopher Nolan’s does in western cinema. \n\nMy Mister was a superior story but MLN was very poetic and the dialogue was on a different level to any kdramas out there. A lot was stated about quiet desperation and it’s a topic that Koreans both relate to but also loathe to discuss. The writer illustrated it beautifully in each character and setting. Cannot wait to see her next project.",
            "score": 4,
            "author": "Necessary_Rooster_85"
        }
    ]
}