{
    "id": "13vr7df",
    "score": 12,
    "title": "Fav. K-Drama OST Song of 2020/2021/2022 Elimination Round Group E",
    "author": "masbond84",
    "date": 1685455362.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13vr7df",
    "media_urls": [],
    "other_urls": [
        "https://animebracket.com/favourite-kdrama-ost-song-of-2020-2021-2022/vote)"
    ],
    "postText": "It's time to vote for the songs in the final group, Group E!\n\nFor each group, you can vote for as many songs that you like. I have included the YouTube/Spotify link for each song so do take a listen before you submit your votes. I have found some songs that I like the previous time we held it for the 2010s songs. So don't just go for the songs you know and you might discover some gems.\n\nEach group will be up for about 2 days. Your votes will determine the final seeds. Only the Top 128 will move on the proper bracket.\n\nHead [here](https://animebracket.com/favourite-kdrama-ost-song-of-2020-2021-2022/vote) to view the group and submit your votes!\n\nDo feel free to give your comments about the songs in the group as well as predictions for what might take up the high seeds.",
    "comments": [
        {
            "level": 0,
            "comment": "It will absolutely not make it to the bracket round, but this group has my favorite song of everything I nominated: [\"Trace\" by KLANG, from \"On The Verge Of Insanity.\"](https://www.youtube.com/watch?v=hqbP8lheozo&amp;list=PLpO87y6feflbJoZmbMlGj9nMbxbXbYtx4&amp;index=14) An incredible song that's a perfect fit for an incredible drama that only me and 5 other people in this sub watched.\n\n(Also, with the Group E songs added, the playlist is complete! Link: [https://www.youtube.com/playlist?list=PLpO87y6feflamGVnariD7pkfzlPvX6EMO](https://www.youtube.com/playlist?list=PLpO87y6feflamGVnariD7pkfzlPvX6EMO))",
            "score": 8,
            "author": "pondthebrave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely appreciate this playlist because there is a lot of dramas these songs are from that I haven't seen yet. Made some new discoveries and added more to my watchlist. Thank you!",
                    "score": 4,
                    "author": "Tauur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! I'm glad it's been useful!",
                            "score": 2,
                            "author": "pondthebrave"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whether it makes the bracket round or not, thank you for nominating \"Trace.\"  It's so beautiful, and I probably never would have found it otherwise.  I feel your pain, I have also nominated a few songs I feel very tender towards that I do not expect to make it to the brackets.",
                    "score": 2,
                    "author": "Moonrisedream42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awww, this comment really made my day! I'm glad you like the song!",
                            "score": 2,
                            "author": "pondthebrave"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I swear Love,Maybe by Melomance deserves the title",
            "score": 6,
            "author": "YoshidaKyo"
        },
        {
            "level": 0,
            "comment": "I'm disappointed some of my favorite songs didn't make to any of the rounds. Like these:\n\nIn Time - O3ohn (Season Of Blossom)\n\nLet Me Be Your Knight - Luna (Let Me Be Your Knight)\n\nLove One Day - Luna (Let Me Be Your Knight)\n\nI Believe - An Da Eun (The King's Affection)\n\nHide and Seek - VROMANCE (The King's Affection)\n\nYour Sign - Shax (Imitation)\n\nAt the End of My Day - Kim Sa Wol (Secret Royal Inspector &amp; Joy)\n\nSummer Rain - Sam Kim (Our Beloved Summer)",
            "score": -4,
            "author": "abtr92",
            "replies": [
                {
                    "level": 1,
                    "comment": "All songs are nominated by the redditors. If not on the list means nobody nominated them during the nomination round",
                    "score": 11,
                    "author": "masbond84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can confirm that most if not all of my nominations are in. And I nominated a lot of songs.",
                            "score": 3,
                            "author": "jollibhe"
                        },
                        {
                            "level": 2,
                            "comment": "I'm also confirming that my two nominations were put in the elimination round. It was super easy to nominate, just copy paste the needed info.",
                            "score": 2,
                            "author": "etayn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So curious to see which songs make it past the elimination round. Meanwhile I’m enjoying the playlist, thank you again!",
            "score": 1,
            "author": "Soli970613"
        },
        {
            "level": 0,
            "comment": "*Saviour -* the song and video - from *Good Job* brought back fun memories.\n\nTo the 'best songs' list from these years, I would add:\n\n*Love Song*, by Jung In, from *Bossam: Steal the Fate*\n\n*Angular Stones*, by Jeong Hongil, from *Bossam: Steal the Fate*\n\n*I'll Be There,* by An Da Eun, and *Time*, by Paul Kyte/paulkyte, from *From Now On, Showtime!*\n\n*Moonchild Ballad*, by Lyn, from *Tale of the Nine-Tailed*",
            "score": 1,
            "author": "idealistatlarge"
        }
    ]
}