{
    "id": "13xi6rl",
    "score": 33,
    "title": "Fav. K-Drama OST Song of 2020/2021/2022 Bracket Round 1 Group A",
    "author": "masbond84",
    "date": 1685627574.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/13xi6rl",
    "media_urls": [],
    "other_urls": [
        "https://animebracket.com/favourite-kdrama-ost-song-of-2020-2021-2022/vote)"
    ],
    "postText": "We have now reached the bracket phase.\n\nBefore that, just to recap who were the top seeds for the 2010s OST Songs.\n\n1) \"Beautiful\" by Crush, Guardian: The Lonely and Great God 2) \"Stay With Me\" by Chanyeol &amp; Punch, Guardian: The Lonely and Great God 3) \"I Will Go to You Like the First Snow\" by Ailee, Guardian: The Lonely and Great God 4) \"Round and Round\" by Heize feat Han Soo Ji, Guardian: The Lonely and Great God 5) \"You Are My Everything\" by Gummy, Descendants of the Sun 6) \"Flower\" by Yoon Mi Rae, Crash Landing on You 7) \"Everytime\" by Chen, Descendants of the Sun 8) \"You Are So Beautiful\" by Eddy Kim, Guardian: The Lonely and Great God 9) \"This Love\" by Davichi, Descendants of the Sun 10) \"I Miss You\" by Soyou, Guardian: The Lonely and Great God\n\nOverall winner was \"Stay With Me\" by Chanyeol &amp; Punch, Guardian: The Lonely and Great God. Runner-up was \"Beautiful\" by Crush, Guardian: The Lonely and Great God. Making the semis were \"I Will Go to You Like the First Snow\" by Ailee, Guardian: The Lonely and Great God &amp; \"Round and Round\" by Heize feat Han Soo Ji, Guardian: The Lonely and Great God. Making the quarters were \"You Are My Everything\" by Gummy, Descendants of the Sun, \"Flower\" by Yoon Mi Rae, Crash Landing on You,  \"Everytime\" by Chen, Descendants of the Sun &amp; \"This Love\" by Davichi, Descendants of the Sun\n\nThe Top 128 will be seeded and divided into 4 groups, based on their seeds.\n\nFor each matchup, you will vote for your favourite to move on to the next round.\n\nYou can choose to not vote for any of the matchups if you wish so.\n\nThe one with more votes will move on. In terms of a tie, the higher seed will move on too.\n\nHead [here](https://animebracket.com/favourite-kdrama-ost-song-of-2020-2021-2022/vote) to vote!\n\nYou have about 48 hours to vote!\n\nFeel free to discuss whoever make into or miss out Top 128 and Group A's matchups as well!",
    "comments": [
        {
            "level": 0,
            "comment": "Your Existence by Wonstein from Twenty Five Twenty One has to be my all time favorite OST song.",
            "score": 13,
            "author": "rosagotlost",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I was only viewing the brackets and not logging in to vote until I saw this one. Had to figure out how to log on just to vote for it!!",
                    "score": 3,
                    "author": "Agitated_Tea8742"
                },
                {
                    "level": 1,
                    "comment": "Also…. How can a song bring such feelings of nostalgia?!  This song….  Combined with the overall bittersweet of 25-21….  Stabs my heart every time",
                    "score": 3,
                    "author": "Agitated_Tea8742"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad to see Melomance, and Mido and Falasol there!\n\nQuestion for everyone - do you have a kdrama ost that remained a favorite for so many years, even if you have not rewatched the kdrama recently or it not aging well?  Mine is “Perhaps Love” from Goong. \n\nhttps://open.spotify.com/track/73lwJ5P3ehRiqimOgWiwOE?si=rJT6ABMvT2ujqtYo4QyyMQ&amp;context=spotify%3Aplaylist%3A7f5y7dlfJi13pkTJ74zcA1\n\nI first watched Goong in 2007. 16 years later and I still love it. It was always at the top of my favorite OST songs until Hospital Playlist OST came along.",
            "score": 8,
            "author": "jollibhe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Perhaps Love is a gem indeed, it’s still in my Ost playlist. My favourite would be “I think I love you” from Full House. \n\nAs for this competition, I’m rooting for “Love, Maybe” by Melomance",
                    "score": 3,
                    "author": "YoshidaKyo"
                },
                {
                    "level": 1,
                    "comment": "Perhaps Love is still my absolute favourite too, after all these years! \n\nMy mum’s favourite is You’ve Fallen For Me from Heartstrings (2011). I swear I hear her sing that to herself at least once a week.",
                    "score": 2,
                    "author": "springmango"
                },
                {
                    "level": 1,
                    "comment": "I still listen to Boys Over Flower OST by Jisun (What Should I Do). This song is my favorite  from BOF, and I haven't even watched BOF since back in 2009 or 2010 (don't think it aged well and the acting sucks). \n\nStill loved OST from Autumn in My Heart, Winter Sonata, and Full House too, even though I don't listen to them very often but they are very nostalgic for me since these were my very first K-dramas (oh boy, did I just reveal what an old lady I am? 🤣 )",
                    "score": 2,
                    "author": "cuplik",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Almost Paradise!!! Omg i hate that song with a passion, because it just gets stuck in your head 😂😂😂. My BOF favorite is the one by SS501. I forgot the english translation of the title. It’s this one:\n\nhttps://open.spotify.com/track/7k1zf9Ch2n8dgNQ0UxbxJ9?si=b-YVPhf0S16sY6IeNNA2iQ&amp;context=spotify%3Aalbum%3A4jMu4ZrYUtiQNHIZvS42oR\n\nBOF was such a phenomenon then. We know it’s far from the best but it’s so addictive you can’t stay away.  \n\nAnd NO, we are not old. We’re just seasoned kdrama fans. Kids, don’t call me ahjumma. It’s unnie or noona, okay?? 😅😅😅",
                            "score": 2,
                            "author": "jollibhe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Apart from HP (yes this is THE OST for me hahahaha) my favorite kdrama song from years ago was Only You by Siwon from She Was Pretty.",
                    "score": 2,
                    "author": "Bridgerton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I made a [Bracket Rounds playlist](https://www.youtube.com/playlist?list=PLpO87y6feflaKdnRb--NJd6V6AXZ1PIxd) to make it easier for me to choose between songs, if anyone else wants to use it (though it only has the Group A match-ups right now). \n\nLooks like I was right about &gt;!Trace!&lt; not making it, but on the bright side a surprising amount of my other nominations made it in!",
            "score": 7,
            "author": "pondthebrave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!  I’ve now listened to all the songs and voted.",
                    "score": 1,
                    "author": "Agitated_Tea8742"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Quite a few things about this first round. Ik lullaby by nerd  connection aint gonna win against love, maybe, so i voted for it to show it some love, maybe... lol. \n\nI'd be upset if On Rainy Days, Future, The Night or Feel You lose this early",
            "score": 2,
            "author": "No-Clue-9155"
        },
        {
            "level": 0,
            "comment": "Feel You by Shin Yong Jae (Flower of Evil OST) has been on my playlist all year. His voice is really something special.",
            "score": 2,
            "author": "MeechiJ"
        },
        {
            "level": 0,
            "comment": "LOVE IS THE MOMENT",
            "score": 1,
            "author": "throwawayheyway"
        },
        {
            "level": 0,
            "comment": "I’m surprised there’s songs in it from DOTS considering that came out in 2016??",
            "score": 1,
            "author": "No-Clue-9155",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those were the songs that were in the 2010s bracket. They are not in this bracket",
                    "score": 1,
                    "author": "masbond84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I see, thanks",
                            "score": 1,
                            "author": "No-Clue-9155"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm going to have to check this list out this weekend. I have a YouTube playlist of my favorites and I only have two of these songs.",
            "score": 1,
            "author": "shopandfly00"
        },
        {
            "level": 0,
            "comment": "One Spring Night Ost",
            "score": 1,
            "author": "Truthoftarot"
        },
        {
            "level": 0,
            "comment": "I came late to this party I’m afraid. Didn’t anyone nominate Rain or Shine by Elaine from the drama A Piece of Your Mind? A beautiful song. I can’t get that Animebracket site to work correctly on my phone.",
            "score": 1,
            "author": "RamahP",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can try copying the link and open on Chrome maybe? Or whatever browser u using. Instead of just clicking.",
                    "score": 1,
                    "author": "masbond84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t believe &gt;!Chu Chu Love which is an original Hospital Playlist track!&lt; made it to the brackets!!!!!\n\nETA: so glad to see many Hospital Playlist songs because… let’s be real, their OST from the two seasons is just so well-curated.   I will be surprised if the final rounds won’t see a matchup between HP/Mido and Falasol songs.  Being the same age as the 99s, I immediately connected to these songs even if I’ve never heard of them before (except for It’s My Life which of course I knew since I was a fan of Bon Jovi back in high school).\n\nI was also pleasantly surprised we have the Drama version of &gt;!Butterfly!&lt; in the brackets which any HP fan knew is a wink from Shin PD.\n\nETA2: I didn’t have the time to nominate a few other songs, mainly for Park Eunbin dramas, which make me sad:\n\n-\tfrom **Do You Like Brahms?**: opening theme, traumerai, Close To Me (Punch) and Kiss Me (Taeyeon)\n-\tfrom **The King’s Affection**: I Believe (An da eun), If I (Baek ji young), King’s Love Waltz\n-\tfrom **EAW**: Better than Birthday 😭",
            "score": 1,
            "author": "Bridgerton"
        },
        {
            "level": 0,
            "comment": "Beyond My Dreams (Sunwoojunga) from *Extraordinary Attorney Woo*",
            "score": 1,
            "author": "Electrical-Sea7108"
        }
    ]
}