{
    "id": "147heoa",
    "score": 59,
    "title": "My Perfect Stranger [Episodes 13 &amp; 14]",
    "author": "meepmochi_",
    "date": 1686553268.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/147heoa",
    "media_urls": [
        "https://www.reddit.com/r/KDRAMA/comments/147heoa/my_perfect_stranger_episodes_13_14/"
    ],
    "other_urls": [
        "https://mydramalist.com/719347-bumped-into-you)",
        "https://mydramalist.com/people/35953-kang-soo-yeon)",
        "https://mydramalist.com/people/80067-lee-woong-hee)",
        "https://mydramalist.com/people/19842-baek-so-yeon)",
        "https://mydramalist.com/people/1465-kim-dong-wook)",
        "https://mydramalist.com/people/10520-jin-ki-joo)",
        "https://viki.com/),",
        "https://viu.com/),",
        "https://kocowa.com/)",
        "https://www.reddit.com/r/KDRAMA):",
        "https://www.reddithelp.com/hc/en-us/articles/205926439),",
        "https://www.reddit.com/r/KDRAMA/wiki/rules",
        "https://www.reddit.com/r/KDRAMA/wiki/policies),",
        "https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).",
        "https://www.reddit.com/r/KDRAMA/wiki/spoilertags).",
        "https://www.reddit.com/r/KDRAMA/comments/134f8hd/my_perfect_stranger_episodes_1_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/13bjb6m/my_perfect_stranger_episodes_3_4/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/13i570p/my_perfect_stranger_episodes_5_6/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/13olgop/my_perfect_stranger_episodes_7_8/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/13umyfi/my_perfect_stranger_episodes_9_10/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "https://www.reddit.com/r/KDRAMA/comments/141axjq/my_perfect_stranger_episodes_11_12/?utm_source=share&amp;utm_medium=web2x&amp;context=3)"
    ],
    "postText": "* **Drama:** [My Perfect Stranger](https://mydramalist.com/719347-bumped-into-you)\n   * Hangul: 어쩌다 마주친, 그대\n   * Revised Romanization: Eojjeoda Majuchin, Geudae\n* **Network:** KBS\n* **Premiere Date:** May 1, 2023\n* **Airing Schedule:** Mondays &amp; Tuesdays @ 9:50 PM KST\n   * Airing Dates: May 1, 2023 - June 20, 2023\n* **Episodes:** 16\n* **Directors:** [Kang Soo Yeon](https://mydramalist.com/people/35953-kang-soo-yeon) (The Tale of Nokdu), [Lee Woong Hee](https://mydramalist.com/people/80067-lee-woong-hee)\n* **Writer:** [Baek So Yeon](https://mydramalist.com/people/19842-baek-so-yeon) (The Tale of Nokdu)\n* **Starring:**\n   * [Kim Dong Wook](https://mydramalist.com/people/1465-kim-dong-wook) (You Are My Spring, Find Me in Your Memory) as *Yoon Hae Joon*\n   * [Jin Ki Joo](https://mydramalist.com/people/10520-jin-ki-joo) (From Now On, Showtime!, The Secret Life of My Secretary) as *Baek Yoon Young*\n* **Plot Synopsis:**\n\n&gt;Yoon Hae Joon is the youngest anchor to ever work at his broadcasting station. He is calm and straightforward as a journalist and kind in his personal life. On the other hand, Baek Yoon Young dreamed of becoming a writer but wound up working at a publishing company.  \n&gt;  \n&gt;The two somehow travel back in time to the year 1987. There, Yoon Hae Joon tries to find the truth behind a serial murder case while Baek Yoon Young attempts to prevent her parents from marrying. They soon realize that their objectives are connected.\n\n* **Streaming Sources:** [Viki](https://viki.com/), [Viu](https://viu.com/), [Kocowa](https://kocowa.com/)\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on [/r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct) (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community. Any extreme cases of misconduct (such as racism or hate speech) will result in an immediate permanent ban from our community and a report to Reddit admin. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag in Markdown by writing &gt; ! this spoiler ! &lt; without the spaces in between to get &gt;!this spoiler!&lt;. For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).\n* **Previous Discussions:**\n   * [\\[Episodes 1 &amp; 2\\]](https://www.reddit.com/r/KDRAMA/comments/134f8hd/my_perfect_stranger_episodes_1_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 3 &amp; 4\\]](https://www.reddit.com/r/KDRAMA/comments/13bjb6m/my_perfect_stranger_episodes_3_4/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 5 &amp; 6\\]](https://www.reddit.com/r/KDRAMA/comments/13i570p/my_perfect_stranger_episodes_5_6/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 7 &amp; 8\\]](https://www.reddit.com/r/KDRAMA/comments/13olgop/my_perfect_stranger_episodes_7_8/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 9 &amp; 10\\]](https://www.reddit.com/r/KDRAMA/comments/13umyfi/my_perfect_stranger_episodes_9_10/?utm_source=share&amp;utm_medium=web2x&amp;context=3) / [\\[Episodes 11 &amp; 12\\]](https://www.reddit.com/r/KDRAMA/comments/141axjq/my_perfect_stranger_episodes_11_12/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
    "comments": [
        {
            "level": 0,
            "comment": "Am the only one cracking up at them missing the flat screen monitor and computer in his room? he detective went right to picking up the papers on the desk but not a piece of technology he would have never seen before?\n\nWas waiting for a character to mention it but none did.",
            "score": 60,
            "author": "stan-nas",
            "replies": [
                {
                    "level": 1,
                    "comment": "EXACTLY! That had me rolling! And that uncle is so cute asking if yy knows him from the future.",
                    "score": 15,
                    "author": "dailyul"
                },
                {
                    "level": 1,
                    "comment": "I was like “there’s the flat screen monitor as the proof”!! Even after the sumo game on tv where the detective went into that room again, he still didn’t question the monitor. How??\n\nAnd I thought even just the print outs paper has to look very different from the future vs 1987 print outs (modern day printer vs 1987 printer). I know because I’ve seen old reports from 1980s at work.",
                    "score": 8,
                    "author": "cuplik"
                },
                {
                    "level": 1,
                    "comment": "Yes!!  I was like how come that guy is cool with new technology in the room and not noticing it at all :-)",
                    "score": 3,
                    "author": "nshank01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I believe any theory at this point LOL\n\nI don't care if a new character (killer) is introduced at ep.15 or 16... I don't even care who the killer is anymore.\n\nAs long as everything sort of makes sense in the end, I'm good.\n\nYeah, ep.13 did feel like a filler to me too...",
            "score": 28,
            "author": "Ayalynn123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think ep 13 was the calm before the storm.",
                    "score": 13,
                    "author": "Any-Competition8494",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I know, but it's already at Ep.13... \nI feel like the-calm-before-the-storm type episode would make more sense if it was around Ep. 8-9.\n\nHope from Ep.14, it will change gears and start unpacking...",
                            "score": 7,
                            "author": "Ayalynn123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe more the calm waters before a big wave.  I used to live in Santa Monica next to the ocean, which I loved to swim in...and it can be very eerie how quickly an enormous tide can crash down on you.  A lot can happen in a very short time, with developments beneath the surface for which we are unaware.\n\nAlso perhaps like a Rubik's cube, where the solution doesn't look like a solution until it is almost done.\n\nAnd...\n\nOf course we've seen this as a frequent plaint with many kdramas, not enough time to wrap things up...but then, oft enough, they do.\n\nWe shall see...",
                                    "score": 5,
                                    "author": "jsb1685"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aside from trying to figure out who the actual killer is let’s consider **the car**.\n\n\nWhy did the car suddenly appear in the present with an open door? Was it being used by someone, who is already traveling between the present and the past? Is that person now stuck in the present while the car is being fixed in the past?\n\n\nDid someone sent the car for ML? \n\nOr does the car have a mind of it’s own and decided to travel in time? \n\nWho built the car and in which time frame?",
            "score": 29,
            "author": "peregrina2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had the same thought, who is stuck in the future now, if the killer is a time traveller then how is he killing now in the past\n\nIf the killer is not the time traveller, then how could his physic be young in both past and future timeline🤔",
                    "score": 12,
                    "author": "AdPsychological4649"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Had a chuckle when Dong Shik and Haraboji.see ML's clearly advanced computer (compared to what they had in 1988) and that doesn't even register.\n\n\nAnd the things that really convinced Dong Shik were ML's knowledge of news and sports event winners. (Did he download all the old newspapers from 1987?)",
            "score": 22,
            "author": "LcLou02"
        },
        {
            "level": 0,
            "comment": "After ep 14, I wonder if the ending is another red herring? It still bothers me that &gt;!the FL's mother's reaction in 2021 doesn't make a whole lot of sense for the killer to be ML's father, unless he becomes well-known and recognizable for something after 1987? It makes much more sense if it was Yuseob faking his mental state or something in the original timeline. Also, ML's mom is basing her conclusion on the matchbox and yarn, the former of which is accessible to any customers, and the latter seems like a common enough item? !&lt;\n\nI'm ready to be completely wrong though. Can't wait for next week!",
            "score": 18,
            "author": "saha_hw",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking the same. I don't think it's the ml's father. His mom is confusing easy coincidences with evidence; and the reason the car wasn't in the garage is probably because his dad finished fixing it and took it for a ride to see if it works well, then noticed the weird time travel equipment. He probably ran away thinking it was the killer who made that noise. \n\nI was thinking the killer could be on the police force. Go mi sook said that the killer will definitely not get caught...this made me think that he must be someone with power or access to to make things go his way. And with the missing note in the matchbox, I'm even more convinced that it's a cop. \n\nNow for future's soon eh's reaction to the killer, and with the little tease of the fl's uncle \"I'm angry\" ....idk, I don't think it's him. My mind is also going to future go mi sook and her brother when he was let out of prison. Her pants were covered in mud or blood (can't remember) but it was on the same day that future soon eh died (I think). \n\nWe must've already seen the killer in the show. But literally nothing is making any sense 😅😅 if I want to just look at the evidence they're getting of the killer now (in the past), then everything is telling me it's a cop. He had connections to all the victims so far. The teacher (ex-con, cops were after her), the sister (always out drinking in clubs, must've come across the cops on patrol for underage drinking. and the fraud incident, probably went to give a statement, and right before she died, she was in contact with the teacher.)\n\nAnd as mentioned before, a cop would have access to all the evidence brought in and power to make the investigation come to a dead end.\n\nBut who the heck could that cop be to elicit a reaction from future soon eh? Unless the person who killed soon eh, is someone else, a copy cat.",
                    "score": 3,
                    "author": "monao2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooh after reading your comment, the culprit being &gt;!a cop would make sense I think! Yuseob did have an alibi, being in Seoul for the first two murders and was bleeding pretty severely. As much as the police may be incompetent, ML's dad being able to sift through Dong Shik's desk to grab the note is less plausible than a fellow cop doing so.!&lt;\n\nOh I was just thinking, what if the Soon Ae's reaction before she was killed &gt;!was not for the killer, but for Mi Sook? Like you said, Mi Sook's pants were muddy, so she was probably there.!&lt; I went back to watch the epilogue in episode 5, and Soon Ae's line was &gt;!\"How could you deceive everyone after doing such a thing\", which could be referring to Misook lying about her brother being the culprit, and not about the killing itself. Perhaps Soon Ae figured out that Misook's brother was framed after reading the books? The scene didn't actually show her falling into water after her backing towards it, so there could have been some time between that scene and her death? !&lt;",
                            "score": 2,
                            "author": "saha_hw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes!! And so does the ML's dad, wasn't he out of the country when the teacher died? I really don't think he did it.\n\nThanks for going bk to watch ep 5, what you said makes so much sense. And if you think about time (past and future) being parallel, then what happened in ep 5 in the future was before the ML and FL intervened and before mi sook's plan to frame her brother failed. And when future soon ae died, wasn't it after the ML went bk in time and stopped the brother from committing suicide in jail?\n\n So let's assume future soon ae's death happened after the past was altered. Go mi sook now has her abusive brother out of jail for a murder he didn't commit, and that she framed him for. Shes scared and needs to have some control over her brother, what better way to control him than to kill someone and frame him again, this time it would be easier to convince people he did it since he went away for the crime. Based on the interview she did in ep 1, I remember she was asked \"why is the killer a woman?\" And she replied \"I want to show the world that women are also capable of doing something like this.\" \n\nAt first I thought the real killer was actually a woman, up until ep 12. But now thinking about it, mi sook probably grew up to be a lot more gutsy and now has a lot of money and knows how the world works more. Future go mi sook would probably have no problem killing to get what she wants. Future soon ae was just in the wrong place at the wrong time. Go mi sook was already frustrated with her since ppl still ask her about the book she stole. So soon ae was just her perfect victim and met all the criteria that the real killer looks for. What future go mi sook didn't account for was soon ae's death being closed as a suicide.\n\n I think that if the FL went bk to the future now, her mom would be alive. Because if the real killer was actually a cop, then during all the years that went by, he climbed the social ladder and can't afford mistakes anymore, so he never killed again. So the timing of soon ae's death is weird, it would make more sense if it was mi sook. And what soon ae was saying before her death, mi sook probably was telling her all about the framing. Like a psychopath explaining to the victim why they're about to kill them.\n\nEdit: and the person who kills the ML in the future would probably be the real killer. The most plausible explanation would be that in the real timeline, he figured out who the real killer was and since the real killer is now a powerful individual (assuming cop who climbed the social ladder) he kills him to protect himself. That seems to be the case with this killer killing males.",
                                    "score": 2,
                                    "author": "monao2"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am also leaning more to &gt;!Yu seob - tearing up FL's books in the future, the dad commenting to mom that she didn't need the latest book that FL worked on since she can't read it anyway - probably caused lots of commotion from Yu Seob. (Or maybe just too painful to read that author's books knowing she stole from her.) Need to know more about Yu Seob's ideas about what happened at the protests re. Ms. Lee - why would he kill her? Assumed that they would be comrades.!&lt;",
                    "score": 2,
                    "author": "LcLou02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was mentioning the &gt;!girls' homeroom teacher!&lt; at the end a misdirect or a real clue? Nothing is adding up for me. It doesn't seem like Soon Ae knows &gt;!Hae Joon's dad!&lt;, so her comment to the killer about 'deceiving everyone all these years' makes no sense. But then &gt;!homeroom teacher!&lt; would be far too old in 2021 to kill Hae Joon.\n\nVery very small chance that it's &gt;!Soon Ae's brother!&lt;? That's someone she'd know and someone who could possibly kill the ML under the correct circumstances. I really hope it's not him, but he also had the opportunity to &gt;!leave the matchbox!&lt; in the hospital room, too. &gt;!Hae Joon's dad!&lt; had no reason to visit, after all.\n\nBut LOL at ML's granddad's and FL's great uncle's reactions to the pair hugging. And so typical that both wanted to know &gt;!who his future daughter/niece in law is!&lt;. Soon Ae's dad's reaction to Hee Seop as well!\n\nEdit: I don't know if it's 9 months before ML has been born yet, but what was he really asking his dad the day after his parents' date? I did get concerned for a second that &gt;!his mum was skipping town before he could be conceived, but maybe that was her original plan before she got pregnant that night!&lt;.",
            "score": 16,
            "author": "QueenKordeilia",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mom told him she drank the tea and she was nauseous- something like that. That made me think she was pregnant already.",
                    "score": 12,
                    "author": "113avocado"
                }
            ]
        },
        {
            "level": 0,
            "comment": "the scene with the teahouse lady is so heartbreaking. her acting is so good. and haejoon holding himself bcs he's still angry bcs all he knew is that her mom left him. we finally know the culprit but it's still too many questions to be answered bcs it doesn't make sense how the murderer kills the future soonae and haejoon.\n\nbaek yuseob is still suspicious until we get full picture of how and why the culprit did all his crime",
            "score": 15,
            "author": "jumpinghigh88"
        },
        {
            "level": 0,
            "comment": "Hmmm.  After seeing ep 14, now am stumped.  So &gt;!if Hae Joon's Dad is the killer, why do I find this hard to believe?  :(  So eventually, his father will kill him in the future?!&lt;  That does not seem right-- but maybe not impossible at this stage of the drama.  We are technically 2 episodes away from finale... &gt;!I can barely remember references that Hae Joon and his grandfather has said about his father:!&lt;  \n\n\n* &gt;!that he barely seen him when he was growing up-- he was raised by grandfather, and there were mentions of his father being distant and has been in staying mostly in the US.!&lt;\n* &gt;!grandfather in the early episodes in the future seem \"sad\"-- maybe he knew something?!&lt;\n* &gt;!Soon Ae in the future recognized her killer.  Although the town appears small, there were no direct interaction of Soon Ae and Hae Joon's father.!&lt;\n* &gt;!Hae Joon's father may have created the time machine to escape?!&lt;\n\nI wonder how ep 15 and 16 is going to roll out next week...",
            "score": 14,
            "author": "lifediscourse",
            "replies": [
                {
                    "level": 1,
                    "comment": "But why was the fl's uncle getting nervous when they were airing the news on television?",
                    "score": 9,
                    "author": "Key_Meeting_3421"
                },
                {
                    "level": 1,
                    "comment": "Soon Ae and Hae Joon's dad didn't interact but he is the son of the Chief! Obviously she'll know him!",
                    "score": 5,
                    "author": "VictoriousRJ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But is it a close enough acquaintanceship for him to &gt;!visit her in hospital and thus leave her the note and matchbox?!&lt;",
                            "score": 10,
                            "author": "QueenKordeilia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good point tho!",
                                    "score": 1,
                                    "author": "VictoriousRJ"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have the same doubt how soon ae knew him",
                    "score": 1,
                    "author": "AdPsychological4649"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the killer will be male lead's father . I also think he killed his mother the teahouse lady",
            "score": 14,
            "author": "Primary-Purpose8462",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think so too. I think the dad confronted the ML with the matchbox because he didn't understand how the ML could possibly have a non existent object (from a future crime scene) and that scared him. I don't think the public is aware of the match boxes being the killer's MO yet, so why would his dad be scared that ML has a matchbox with a random note in his house unless he's the killer?\n\nI'm really hoping it's the dad because it would be the coolest twist. I think he also killed ML's mom in the original time line. I'm hoping if it does turn out to be the dad, that his mother is already pregnant when his dad gets arrested. This way the ML doesn't disappear in the future, It's the best ending I can think of.",
                    "score": 20,
                    "author": "Akica17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But i realised in ep 13 , since he kept his dad busy with the car, he had very low chances of meeting his mother, so i guess if there could be a variability in this that could be ML being not born",
                            "score": 2,
                            "author": "AdPsychological4649"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Given FL's mom's last words about the person deceiving people the whole time, I don't think it would be ML's Dad.",
                    "score": 14,
                    "author": "LcLou02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, I was thinking that too. Given her reaction at the beach, it must have been someone she was fairly acquainted with. At this point, ML's dad and Soon Ae haven't interacted.",
                            "score": 7,
                            "author": "saha_hw"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn't the first murder happens before ml's father reach the town? And Ml's father built the time machine in the future. So it can be the future him who did it not the present.",
                    "score": 8,
                    "author": "Easy_Adeptness6855"
                }
            ]
        },
        {
            "level": 0,
            "comment": "cant they wrap everything up on ep 15 and let the ep 16 about FL n ML going back to their place in future. I want a happy ending",
            "score": 13,
            "author": "jumpinghigh88"
        },
        {
            "level": 0,
            "comment": "\nEp 13 flew by so fast it felt like 10 mins 😭 Im glad Haejoon was able to tell the truth and get out of jail really quick. I didn’t want that storyline to continue for long because we only have 3 eps left. \n\nEven though there weren’t definite clues as to who the killer is, we did get more info about &gt;!Haejoon’s mom!&lt;. Looks like &gt;! she was planning to leave the village even before Haejoon was born, so even though she did technically abandon him, her reason for leaving was’t mainly Haejoon.!&lt; Something definitely happened that night went Haejoon’s parents were on a date for her to ultimately change her mind. I thought Haejoon asking questions about their date to his dad was odd considering he already knows how it gonna end. Either Haejoon’s dad was lying about having a perfect date or Haejoon’s mom hid her plans so well for him to notice that anything was wrong. \n\nIm reaching but my theory is that Haejoon’s mom is already pregnant in the current time line and she’s planning to leave the village because she wants to protect her baby. I mean who wouldn’t want to move when there’s a serial killer going around? Haejoon’s dad might have some how convinced her to stay and she eventually went missing/died bc she was a victim herself. Either nobody knew what really happened to her or Haejoon’s grandpa was able to cover up her missing person’s case as a runaway who abandon her child. Idk I just dont see his mom as someone who would abandon her kid. You can tell that even though Haejoon acts very cold to his mom, she still feel some sort of a connection to him. If his grandpa could feel it, then imagine how familiar his mom would’ve felt towards him? I cant say for sure that &gt;!Haejoon’s dad !&lt; is the killer but whoever it is, they definitely seem to be connected to haejoon’s mom. After all, he frequents the teahouse a lot and he even uses the teahouse merch? 💀 as a signature in his killings. \n\nIm also still suspicious about &gt;!misook !&lt; because well she’s literally insane? I dont trust a word that comes out of her mouth because at the end of the day, she only cares about herself. Does anyone remember &gt;! the necklace future Misook kept touching during her press interview? !&lt; I have a feeling its somehow connected to the killer because they made it very obvious in Episode 1  when the topic was about the first book that took place in 1987.\n\n\nI don’t even care who the killer is atp, I just want to know what happens. This is giving me war flashbacks to Beyond Evil bc I really cant tell what’s going to happen next. Also can we talk about how perfect the casting is for this drama is. The characters from 1987 really make you feel like they’re really from the past. Soonae and Haejoon’s mom especially does a great job convincing us because why does MY heart hurt whenever I see them on the screen? 😭",
            "score": 13,
            "author": "2chinzup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Funny you mention Beyond Evil - For the first few episodes, I really couldn't trust Heeseop because of the actor who played the adult version of him!",
                    "score": 8,
                    "author": "saha_hw"
                },
                {
                    "level": 1,
                    "comment": "Yes, I too think that Haejoon‘s mom is already pregnant and that she left to protect her family. I think she is suspicious of who the culprit might be. A lot of match boxes disappear from her tea shop. My second thought was also that she could have been murdered.",
                    "score": 5,
                    "author": "peregrina2005"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;!ML's mum is already far along enough to know her child's gender?!!&lt; She doesn't look it. Or maybe she's guessing? As long as the killer does not harm her, ML will still be born. I hope.\n\nThere's still no indication that Soon Ae and &gt;!ML's dad!&lt; know each other. What possible excuse did he have to &gt;!visit her in hospital and leave the matchbox in her room?!&lt; 'You've been deceiving everyone all these years' makes no sense between these two characters, even if &gt;!ML's dad tagged along on a visit Principal Yoon paid Soon Ae.!&lt; He'd still be a stranger to her in 2021.\n\nThe last scene doesn't really prove anything. &gt;!ML's dad could've simply stolen the car because he figured out its true purpose and wanted it for himself.!&lt; Anyone could've taken rope and matchboxes from ML's mum's teahouse, anyway.\n\nThe fact that Yu Seop didn't go crazy in this timeline and the fact that Soon Ae and her ex (I forgot his name) were not attacked in the original timeline makes sense if he is the killer. Hae Joon inadvertently saved the killer, allowing the killer to continue serial killing. Why was Mi Sook so confident Yu Seop wouldn't be caught, though?",
            "score": 13,
            "author": "QueenKordeilia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just watched the preview for ep 15 and &gt;!the white glove guy seems like Baek Yu Seop to me.!&lt; I wonder if he blamed female protesters for &gt;!his brother's and parents' deaths all those years ago? Pretty hypocritical given that his MALE sibling was a protester himself and the parents got killed because they went to search for him.!&lt; So then he believes all women who read will become dangerous protesters? He killed the student teacher for her protesting and Soon Ae's sister for witnessing it?\n\nIs the guy &gt;!burning documents in the preview!&lt; ML's granddad or older version of his dad?",
                    "score": 9,
                    "author": "QueenKordeilia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "it might sound dumb but what if the person (Haejoon’s father) driving the car and the one we who walked into the house are not the same person? Cause when Haejoon went into the garage the car was already missing?!?!? \n*i know it doesn’t really makes sense 😭😭*\nAlso i still think that Yu Sub is super sus, i really don’t believe anything that he said in the last episode when he was talking to Haejoon at the cafe… \nThere could be more than one killer, at this point anything is possible",
            "score": 13,
            "author": "Dreamer-127UW",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's the future version of the father I think",
                    "score": 2,
                    "author": "Easy_Adeptness6855"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like &gt;!Hae Joon’s dad as a culprit makes the most sense. Or else why would his mom left him and his grandpa doesn’t care about his existence in the future whereas in the past they are both nice and loving people? They can’t be just indifferent towards baby Hae Joon if they’re not 100% sure that Hae Joon’s dad is a murderer. As for how Soon Ae recognized Hae Joon's dad in the future - I think cause of the town is small and everybody know each other, of course she will know the chief’s son. He even attended Bum Ryeong funeral.  !&lt;",
            "score": 12,
            "author": "lotism",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wouldn't ML's dad be too old in the future/present?  It will only make sense if ML's dad uses the time machine as well. But still-- ML is already using the time machine when Soonae died in the future/presentWAAAAAAAAAAAAAAahhH i dont know anymore",
                    "score": 3,
                    "author": "dailyul"
                },
                {
                    "level": 1,
                    "comment": "Ml's father is actually dead in 2021. So, the only option he is used car to kill Soon Ae. But it still seems off with this time traveling thing.",
                    "score": 2,
                    "author": "CheesecakeThat153"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still think &gt;!dad figured out the cars use and decided to use it himself. Killer angle is a misdirection and Yu Sub could be the actual killer. Hee Sub had matchboxes and Yu Sub had access to those and he must have stolen the rope from the cafe if it was lying around!&lt;",
            "score": 11,
            "author": "ms_channandler_bong",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was injured in the attic when murders were happening.",
                    "score": 7,
                    "author": "CheesecakeThat153"
                },
                {
                    "level": 1,
                    "comment": "Copium",
                    "score": 1,
                    "author": "HikkiSummers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My guesses were right about Haejoon’s mom already being &gt;! pregnant!&lt;. But i feel like revealing that &gt;! his dad !&lt; is the killer is too soon? If the match boxes could be stolen by anyone then same could be for the red yarn ,so its hard to say its definitely him. It was odd that he walked into Haejoon’s house when the car was already out of the garage. If he figured out what the car was really for, he could’ve just drove off? there was no need to go to Haejoon’s house. At this point, if its not &gt;!haejoon’s dad!&lt; then its has to be &gt;!Yu Sub!&lt;. He was basically MIA for the past episodes and now he’s suddenly back watching the news? 🤔",
            "score": 11,
            "author": "2chinzup"
        },
        {
            "level": 0,
            "comment": "EP14 cliffhanger wrecked me and we didn’t even get preview. 😭😭😭😭",
            "score": 9,
            "author": "siparipari",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is preview but not subbed\nThere is a scene where the gloves guy writes the note, and is my eyes weak he seems to be baek yoo seob👀",
                    "score": 8,
                    "author": "AdPsychological4649",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks because VIU version didn’t have the preview. Just watched it on Youtube and the gloves guy is &gt;! Yeon Woo aka Hae Joon’s dad without glasses.!&lt;",
                            "score": 7,
                            "author": "siparipari",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So my eyes are indeed blind",
                                    "score": 1,
                                    "author": "AdPsychological4649"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In ep 15 preview &gt;!Haejoon is in the hospital, Dad is being interrogated but is wearing glasses. Dad is being shown to have in the abandoned house writing a matchbox note (no glasses). Grandpa is burning some documents and is approached by HJ as it’s happening.!&lt; Hoping for a good ending to the show.",
            "score": 8,
            "author": "ms_channandler_bong",
            "replies": [
                {
                    "level": 1,
                    "comment": "They showing dad without glasses maybe implying that he be from the future or sth. By the time hae joon arrived his house the car was already gone but when dong sik (detective) was chasing the dad, he was running without a car. But suddenly his dad came out of the car without glasses in front of the ml. Could it mean that there is 2 version of his dad. One from the future who might be the killer. Yu-sub commenting ‘he’s mad’regarding the ml revealing the killer was kinda sus. What does he mean by that?? I hope we dun get anymore plot twist and juz goes with the ml dad being the killer.",
                    "score": 4,
                    "author": "Sadia06",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they used actual actors in &gt;! EP 12 when Hae-joon was chasing the killer, then it’s Yu-sub, There’s a screen grab of killer running away that looks like Yu-sub. [Video](https://youtu.be/8FDMv40yo7A?t=46s) !&lt;",
                            "score": 4,
                            "author": "ms_channandler_bong"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so stressed right now after ep 14 wtf. Hoping they release a preview. I don’t know anymore, but I’m still hoping for a nice ending for our leads. The overall tone of the drama is still “light” for me despite the murders so I’m still holding on to that.",
            "score": 7,
            "author": "BusinessStress5056"
        },
        {
            "level": 0,
            "comment": "So my wild theories; \n\nI think the ML's father built the time machine for him so that he could save himself. \n\nThinking along thoses lines I thought the grandfather was the killer but that proved false after the end of episode 12. \n\nSo now after scrutinizing the first 2 episodes again, I'm convinced that it's the FL's uncle. He's sus in my book.\n\n I think it has to be someone mi sook thinks she can manipulate",
            "score": 6,
            "author": "moktailhrs",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if he is &gt;!Mi Sook’s husband in the future!&lt;?",
                    "score": 3,
                    "author": "ms_channandler_bong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think mi sook would keep the killer close but not that close. He is a murderer after all",
                            "score": 5,
                            "author": "moktailhrs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your first theory sounds very plausible, what with the watchmaking et. al.",
                    "score": 2,
                    "author": "jsb1685"
                },
                {
                    "level": 1,
                    "comment": "The MLs father doesnt need to build a time machine: he was handed one by his time traveler son.\n\nSo far they have avoided many scifi tropes by keeping it grounded but I wonder of they will set it up as a paradox of some sort.",
                    "score": 1,
                    "author": "NaheemSays"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I could the only one but I don't feel anything for main pair. today their moment felt like a filler. I skipped those scene. I like both the character individually but they don't make me feel anything as couple. they feel force. It's not like I hate romance in thriller drama  I mean I crave for Soon-ae and Hee-seop little moment but main pair just not doing it for me.",
            "score": 6,
            "author": "Vegetable-Ad7621",
            "replies": [
                {
                    "level": 1,
                    "comment": "same here i really thought they were going to have a father-daughter  relationship lol or just friends",
                    "score": 3,
                    "author": "Dreamer-127UW",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not father daughter lol but yes friends.",
                            "score": 1,
                            "author": "Vegetable-Ad7621"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My heart breaks every time I see mother and the son in same frame.",
            "score": 17,
            "author": "RayInRed"
        },
        {
            "level": 0,
            "comment": "There is so much yet to unpack and we only have 4 episodes remaining. I hope we will at least get to know who the killer is this week.",
            "score": 4,
            "author": "_HellohWorld",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dream on!",
                    "score": 4,
                    "author": "peregrina2005"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't want ML's dad being the culprit😭 but everything is leading to that conclusion😭...",
            "score": 4,
            "author": "denissefrvh"
        },
        {
            "level": 0,
            "comment": "Also the real culprit knows that Haejoon is lying, cause just as the cafe owner said *there’s no way you wouldn’t recognize him* \nidk i feel like the real culprit wouldn’t even bother going to Haejoon’s house 🤔",
            "score": 3,
            "author": "Dreamer-127UW"
        },
        {
            "level": 0,
            "comment": "no but imagine if all of this is a dream, in the first episode ML was driving, weather was insane and his phone was broken (why was it even broken) and then lights flashed him and he almost gets into an accident… it’s giving Alice in Borderland",
            "score": 4,
            "author": "Dreamer-127UW"
        },
        {
            "level": 0,
            "comment": "Questions I can’t wait to be answered by next week’s episode:\n\n- Why did Heeseob’s brother reacted that way when ML claimed he saw the culprit?\n- What happened to Misook after her talk with FL?\n- What’s the culprits motive from all the killing he did?\n- Who built the time machine??\n- What’s gonna happen when they return to the present? Like are they going to lose their memories something?",
            "score": 4,
            "author": "OrchidBoring1363"
        },
        {
            "level": 0,
            "comment": "EP13: I was ready to not be a fan of the false imprisonment trope but &gt;!was not expecting him to get out of it by revealing the future. Think they will almost certainly be returning to a completely different future where I'm afraid ML will not be present. My strongest feeling is that his father is the culprit and that the events leading to his birth no longer happen. Poor Yoon-young has to endure one tragedy after another!&lt;\n\nEP14: And all the dots start to connect. &gt;!Like others, my hunch that it was Hae-jun's father looks like it was correct. He really was giving the typical narcissistic serial killer vibes. But someone gotta help Hae-jun on his solo hero act because that man has thrown himself in front of danger too often. His dad having the car throws and interesting dynamic into this tho.!&lt;\n\nThis show does really well with the slow moments too. Hae-jun especially has these moments where he doesn't say a word yet the way his expression is captivating. Respect to Yoon-young's ability to say things as they are, really told Ko Mi-sook the type of person she is right to her face",
            "score": 8,
            "author": "ANINETEEN",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be one hell of an ending and one I'm absolutely down for.",
                    "score": 7,
                    "author": "blueish55"
                },
                {
                    "level": 1,
                    "comment": "Noooo i want happy ending!! Pleaseeeee!!",
                    "score": 3,
                    "author": "Key_Meeting_3421"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit!! I think it really is the ML’s father!! I watched the ep 12 again and was play pausing the video during the fight and chase scene, and the culprit was wearing glasses and looked like the side and back profile of ML’s father 🤯\n\nAnd then him knowing that ML was mistaken as a criminal, I don’t think anyone else knew about it except the detectives and the chairman. Not unless the chairman told him?",
            "score": 8,
            "author": "OrchidBoring1363",
            "replies": [
                {
                    "level": 1,
                    "comment": "My guess for the next episode is that FL will tell ML everyone who visited Soon Ae and ML’s father will be one of them, which contradicts his father being at garage the whole time",
                    "score": 8,
                    "author": "OrchidBoring1363"
                },
                {
                    "level": 1,
                    "comment": "The father doesn’t wear white shoes.",
                    "score": 1,
                    "author": "peregrina2005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In public no, because his white shoes is most probably full of blood already from all the murder he did.",
                            "score": 2,
                            "author": "OrchidBoring1363"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Strongly believe &gt;!MLs father!&lt; being the killer is a &gt;!misdirection!&lt;",
            "score": 7,
            "author": "ms_channandler_bong",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can’t understand how it could be the MLs father. If he is the killer then he killed his own son in the future. How could an old man kill a grown healthy man and for what reason? \n\nWhy would the same old man kill the FLs mother. They have no connection with them being different ages",
                    "score": 4,
                    "author": "Tangoalphasierr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have only heard about what happened in the future, not seen it.\n\nUntil thos episode I didnt think it was the MLs father but I am leaning towards that possibility.\n\nThe mother didnt leave but died. The grandfather is conflicted about his son, hence estranged with his grandson.\n\nAnd FLs mother did mention before dying that the murderer hid behind his kindness (which didnt fit with the description of the fls uncle as he was shown to be mean).",
                            "score": 2,
                            "author": "NaheemSays",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's the other homeroom teacher, I'm sure. And I'm still not sure about ko mi sook. And why fl's uncle started acting like a child in future?",
                                    "score": 2,
                                    "author": "Key_Meeting_3421",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think for the latter its suggested that the torture (which they didnt experience as much this time) broke him and her father to the extent they became shadows.\n\nHowever this being the past, it could be an event still to happen.\n\nOn it being the home room teacher, he hadnt crossed my mind. Will be interesting to see where they go.",
                                            "score": 2,
                                            "author": "NaheemSays"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The killer would have to be 'old' unless he/she is a time traveller. If not a time traveller, the killer was obviously old enough to murder adults in 1987 and thus would be 34 years older in 2021. Even an 18 year old in 1987 would be 52 in 2021.",
                            "score": 1,
                            "author": "QueenKordeilia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I meant in the way, the ML is pretty strong enough to take on someone who’s his dads age",
                                    "score": 1,
                                    "author": "Tangoalphasierr"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;!I don't think it's his father(I don't understand why people seem to think it's him). The killer is very robust and agile: ML's father doesn't seem like that at all (if he went to study in the US, he probably hasn't even attended mandatory military training either). I think it could be the friend they met after the cinema (the one that wanted to hit both Hae Joon and his mother). !&lt;",
                    "score": 8,
                    "author": "AQuietlyThinkingOwl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think the killer is agile. We only saw the killer once. And the killer was running. Running doesn’t mean agile. As for the killer fight with Bum, the killer was instantly thrown by bum like a rag doll. Only fault of bum is that he turned his back, thus killed. The killer is min sook from the future.",
                            "score": 2,
                            "author": "denniszen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just finished watching episode 14 and I just can't wrap my head around it.",
                                    "score": 1,
                                    "author": "AQuietlyThinkingOwl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We still don’t have episode 14 in the States.",
                                            "score": 1,
                                            "author": "denniszen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;!Well, fcuk!&lt;.\n\n&gt;!Waiting for ep 15. To know whether this is still a misdirection.!&lt;",
                    "score": 3,
                    "author": "RayInRed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it is... just like every other clue we've been given so far!",
                            "score": 2,
                            "author": "AQuietlyThinkingOwl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Part of me wishes that it's misdirection.  I mean, &gt;!how could Hae Joon and Yoon Young be together now?  !&lt;",
                    "score": 2,
                    "author": "lifediscourse"
                },
                {
                    "level": 1,
                    "comment": "Copium",
                    "score": 0,
                    "author": "HikkiSummers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 episodes left! Hopefully there won’t be any plot holes 🙌🏻",
            "score": 3,
            "author": "OrchidBoring1363"
        },
        {
            "level": 0,
            "comment": "All I can say was, \"Wae??!\"",
            "score": 3,
            "author": "Educational_Host8807"
        },
        {
            "level": 0,
            "comment": "\"Women who read are dangerous\"\n\nML's dad aka culprit will probably have a backstory where we will know about his mom and how her experiences with her made him into a killer.",
            "score": 3,
            "author": "HikkiSummers"
        },
        {
            "level": 0,
            "comment": "Can't really explain how, but I think it's &gt;!the FL's uncle!&lt;",
            "score": 3,
            "author": "4N00J",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;!Are you talking about the brother on her dad’s side? Cause there was a few seconds when they were watching the evening news where he was trying to contain his anger that made me think he is possibly the suspect. I can see that possibility!&lt;",
                    "score": 3,
                    "author": "kdramajames",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;!Yes, FL's dad's brother! Cause it would make sense with what the mom said before she died - about having deceived them all this time or something. And the fact that he had a close connection with both the first and second victims. It would've been easy to get them in one night cause they both trust him. Plus his reaction to the news was definitely sus. That's all I'm able to kinda explain LOL only thing tho is how he would be able to overpower ML enough to kill him in the future. I wish the finale is already here so we can stop playing the guessing game and get some answers 😅!&lt;",
                            "score": 3,
                            "author": "4N00J"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;!I think Hae-joon's dad is the murderer. I think the line about visiting his gf was actually about Soon-ae!&lt;",
            "score": 3,
            "author": "vienibenmio",
            "replies": [
                {
                    "level": 1,
                    "comment": "you don’t think episode 14 is a misdirection as to the killers identity?",
                    "score": 1,
                    "author": "AffectionateCold7823",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watch on Viki so I haven't seen 14 yet",
                            "score": 1,
                            "author": "vienibenmio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh so sorry !",
                                    "score": 1,
                                    "author": "AffectionateCold7823"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In ep 14 , when the main lead talks with the reporters , [around 24:20-24:26] there in the shadow or background you can see a man's figure which resembles his father overhearing their convo , does this indicate something ? Maybe the dad is the culprit?",
            "score": 3,
            "author": "Choice-Rice4404"
        },
        {
            "level": 0,
            "comment": "Why couldn’t Hae Joon recognize &gt;!his fathers writing!&lt; ? This “reveal” not making sense to me.",
            "score": 3,
            "author": "Uncanny-Counter31",
            "replies": [
                {
                    "level": 1,
                    "comment": "His dad only visits him once a year 🤪",
                    "score": 4,
                    "author": "HikkiSummers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When is Episode 14 showing on Viki? It's supposed to be today.",
            "score": 3,
            "author": "denniszen"
        },
        {
            "level": 0,
            "comment": "After Ep 14 - I don't trust the cliffhanger, even if we are this close to the end. &gt;!I still don't believe that it is ML's Dad. Anyone could buy red wool and all the high school boys were using those matchboxes for secret letters. Unless Mom saw a big change in his behavior, I don't take her theory seriously. And I think Dad just wanted to take the car out for a test drive with the car to see what it would do. Not sure why he doesn't have his glasses on while driving a car, though.!&lt;\n\nHad another chuckle seeing the baby cap she knitted for a newborn in the winter - Huge heavy pompom on top with really thick wool. Probably cover his whole head. Poor kid.\n\nMy hope for the future - FL grows up in a happy home, her grandparents are alive and father's brother also doing well (if he is not the killer).  ML grows up with both parents after mom realises Dad is not a killer and Haraboji changes to be the loving grandad that he always imagined. Not sure what I want for Mi Sook - surely not a bestselling author in the future (always has to find an editor who will write the story for her) Can't really see her ending up as mom's assistant, either. Although I would want her to be protected from her brother.",
            "score": 3,
            "author": "LcLou02",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also don't think Hae Joon's father is the killer, but the dude decided to run from a detective while going to the victim's house using the victim's stolen car... it can look a tiny bit suspicious.",
                    "score": 2,
                    "author": "AQuietlyThinkingOwl"
                },
                {
                    "level": 1,
                    "comment": "Me too specially when after every episode we have new suspect only to proven innocent lol. And he was not in the village when first murder happened unless he was using time machine, it seems impossible plus I don't think soon as was that close to him to give that reaction when she saw her killer. I think maybe the reason ML mother leave them cause she got suspicious toward father like this in real lifetime or she got killed by real killer. But why grandfather was so cold to ML I still not able to understand",
                    "score": 2,
                    "author": "Vegetable-Ad7621"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is my theory cause the reveal not making any sense to me lol. Theres gotta be two different killers. FL’s mothers killer could be &gt;!Mi Sook. I think it was end of EP.4, it showed Mi Sook meeting up with her brother after he was released and says something along the lines of Min Su falling into multiple traps. Also, in this same scene, the camera zooms into her white pants and heels being very dirty. I think Soon Ae recognized Mi sook and told her she deceived everyone for stealing her novel. Maybe Mi Sook killed Soon Ae and sets up her brother again? !&lt;",
            "score": 3,
            "author": "Uncanny-Counter31"
        },
        {
            "level": 0,
            "comment": "I feel kinda anxious about what will happen in tomorrow's ep. no preview and today feels like the built up of everything that will be unveiled. dongsik is suddenly one of the most likeable character now lol. now I'm leaning on theory that &gt;!yoonyoung's homeroom teacher!&lt; is the killer.",
            "score": 6,
            "author": "jumpinghigh88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Today's episode felt like a filler 😪",
                    "score": 5,
                    "author": "HikkiSummers"
                },
                {
                    "level": 1,
                    "comment": "Preview is there but no sub",
                    "score": 3,
                    "author": "AdPsychological4649"
                },
                {
                    "level": 1,
                    "comment": "There actually is a preview - if you google it you will find one on youtube.",
                    "score": 2,
                    "author": "Old_Broke"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*guys i have another crazy theory… i know it might sound stupid but hear me out*\nWhat if ML’s father is not his actual father? if you think about it, ML’s mother never really said the name of her boyfriend, and even ML whenever he was talking about him he never really said his name out loud. What the ML  is walking around with his grandpa and the grandpa asks who is the mother ML tells him that it’s the owner of the coffee. I found grandpa’s reaction so strange because first thing first why are you asking me that if you know that my son is currently dating someone?? It would have made sense if the grandpa asked if the current girlfriend/fiancé of his son was ML’s future mom. Instead when he heard the truth he literally only said only said *so it’s the owner of the coffee not even her name*. If you remember the episode, when ML goes to the movie theater, there was more than one person wearing the pink headband. \nGotta rewatch that scene but when the father puts his hands around coffe owners shoulder her reaction was too strange. 1. she’s actually dating him and already suspecting him to be the culprit 2. they’re just acquaintance and him putting his arm around her shoulder was just a way to hide the fact that he was there with someone else (like min sook who was still a minor?!?!) \n\nAlso, it’s pretty obvious that the owner of the café was already pregnant but her “boyfriend” was in the US, the whole freaking time and literally just got back, but she already knew the gender of her baby and I don’t think that’s something you can tell after a week of being pregnant. \nAnd if I am right, oh my god, this will also kind of explain why FL’s uncle alibi was fake, he killed both the teacher and FL’s aunt. He was literally the only person that met the two of them. He first killed the teacher, and then when the FL’s aunt came by to drop the book etc, that’s when he killed her. He was literally the only person who knew where she was going to go that night. He told ML is own story and we all agreed that he was innocent. \n\nThe last thing that me think that this theory might be right is the fact that till the end of the episode we never got to see the results of the DNA test. It doesn’t really make sense that they would take a whole episode just to give us the results… It would’ve been so easy for them to just show  the grandpa and the policeman the result so they would have believed that ML is the grandson.\n*CONCLUSION*\nIt doesn’t really explain why ML ends up, leaving with the grandfather tho but at the same time it make sense why they don’t have that greatest relationship, and the father is never there with him. \n*But yeah, this is just a theory. It’s fun, and might not even be close to what’s actually gonna happen in the next two episodes lol*",
            "score": 5,
            "author": "Dreamer-127UW",
            "replies": [
                {
                    "level": 1,
                    "comment": "there's a scene where the grandpa's son and teahouse lady discussing about the name they're gonna give to their future kid tho.",
                    "score": 5,
                    "author": "jumpinghigh88"
                },
                {
                    "level": 1,
                    "comment": "Nah, I'm sure Hae Jun is their son. What I think she might be wrong about is who exactly has access to the matchboxes and the rope - I mean, she can't be the only one right? She must have gotten them somewhere, so I don't see why the killer wouldn't do the same. Also, it's not like the killer used thousands of them, literally just a few ones. But it's her fears are justified, I feel really sorry for her. I don't think the father is the killer. Also, if you remember, Hae Jun and the Chief did a blood test which showed they were related.",
                    "score": 3,
                    "author": "AQuietlyThinkingOwl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wait the showed the test results?",
                            "score": 2,
                            "author": "Dreamer-127UW",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, they confirmed that the Chief and Hae Joon are related. Not surprised to be honest - he shares many personality traits with his grandfather, father and mother.",
                                    "score": 1,
                                    "author": "AQuietlyThinkingOwl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They haven’t confirmed yet.",
                                            "score": 1,
                                            "author": "ms_channandler_bong"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ok i'm sorry but it kinda annoys me so much how the uncle's so dumb and always suspects the wrong person, it even makes me anxious fr. i think the killer is the ML's father from the future, i think he time travels to the past to commit the murders",
            "score": 2,
            "author": "zimbalabimm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm, following this premise-- &gt;!then what's the connection with the quote \"women who reads are dangerous?\" and why use Bong Bong Tea House match boxes and the red yarn owned by the owner and possibly Hae Joon's mother?!&lt;  \n\n\nHonestly, ep 13-14 has shaken me.",
                    "score": 4,
                    "author": "lifediscourse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there romance in this at all?",
            "score": 2,
            "author": "purpledreign",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes but romance isn’t the main focus so theres only subtle hints here and there in the beginning . Romance  storyline only picks up after Ep 11",
                    "score": 8,
                    "author": "2chinzup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooh okay thanks!",
                            "score": 1,
                            "author": "purpledreign"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This week’s episodes were off the charts 🔥",
            "score": 2,
            "author": "kdramajames"
        },
        {
            "level": 0,
            "comment": "We are probably left with a red herring. ML’s fathers like his mother may have come to the house to make sure he was okay. He is wearing glasses in the house scene and not the car scene. Something is off. Twins doesn’t seem likely.\nOr father has finally fixed the car, test drove it to the future and came back to help. \nBut, no doubt, in the past, the mother thought the father was guilty and therefore left the baby behind. ML will change this story. \nThey have given us so many murder suspect cliffhangers, why not another one?\n\nI‘m still thinking that we are dealing with two killers.\n\nWhat is the significance of the necklace? Was it someone else‘s? Someone she killed? What does FL know about that?",
            "score": 2,
            "author": "peregrina2005"
        },
        {
            "level": 0,
            "comment": "As I keep saying, it's Min Sook.\n\nThe way they keep saying it's a man is just a way to deflect us from the fact that it's Min Sook from the future. I already listed a couple of things on Episode 12. With FL saying that many from her school visited, one of the visitors would then be Min Sook.\n\nIf not her, the series would not make sense.",
            "score": 3,
            "author": "denniszen",
            "replies": [
                {
                    "level": 1,
                    "comment": "On ep 1, she said on the interview’s response that a woman can murder too.",
                    "score": 5,
                    "author": "whitepearl31",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think she plans to murder someone or maybe she really did murder all of them . Or maybe she feels guilty about blaming it all on his brother when it was someone else all along, which makes her the \"real killer\" of justice.",
                            "score": 2,
                            "author": "Key_Meeting_3421"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That struggle with Bum Ryeong looked very vicious and I was wondering if Min Sook could over power him in a fight considering the physical difference.",
                    "score": 5,
                    "author": "AffectionateCold7823",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rewatch that fight with bum. It was easy for bum to push the killer away. The only reason she won the fight was because bum turned his back to look after soon ae. That was his mistake because the killer had a brick on her hand to easily hit him on his head.",
                            "score": 3,
                            "author": "denniszen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you rewatch it, you’ll see that the killers physique is clearly of a man. And the hair, it’s short like ML’s father",
                                    "score": 6,
                                    "author": "OrchidBoring1363",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the jacket makes her look like a man. And the short hair is min sook from the future who has short hair.",
                                            "score": 1,
                                            "author": "denniszen"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "On my way to go rewatch!",
                                    "score": 2,
                                    "author": "AffectionateCold7823"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We may end up with more than one killer. Min Sook may be working with or directing someone.",
                            "score": 2,
                            "author": "peregrina2005",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You may just be right. For it to make sense, she has to be involved somewhat. She also doesn’t seem concerned about the killer coming after her.",
                                    "score": 1,
                                    "author": "AffectionateCold7823",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And she was surprised that a male was killed.",
                                            "score": 2,
                                            "author": "peregrina2005"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Copium",
                    "score": -3,
                    "author": "HikkiSummers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So we were all correct with our final theory. ML's father... clearly he went to the future to kill his son, but idk if he already knows ML is his?? So he also probably killed ML's mother when he found out she knew he is the culprit.",
            "score": 1,
            "author": "denissefrvh"
        }
    ]
}