{
    "id": "gv25qm",
    "score": 1331,
    "title": "80% of my recommendation attempts end in failures, but its worth it for the 20% attempts where someone enjoys a show",
    "author": "lzyan",
    "date": 1591079889.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/gv25qm",
    "media_urls": [
        "https://i.redd.it/im2dvapvzf251.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Especially as a male Kdrama viewer, its harder to introduce stuff to your friends (Different taste and etc) But for Hospital Playlist, it has been pretty successful. Just like the plot within the show,  Jo-Jung-suk is a big matchmaker to make my friends love this show.\n\nAnd yes, its a good show for male viewers cause there's organic/un-cringey lovelines with humorous friendship anecdotes, kinda like watching Scrubs or Brooklyn Nine-Nine.",
            "score": 111,
            "author": "lzyan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm also a male kdrama viewer! Just started in April but I've been consuming content ravenously lol. To my surprise there's a lot of great shows that feel more geared towards male audience (rugal, vagabond that I've watched) and even hospital playlist is a super solid show everyone would like. \n\nI also heavily recommend prison playbook as my #1 to anyone and everyone!",
                    "score": 23,
                    "author": "Davidwzr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would highly recommend Extracurricular on Netflix! It really goes against a lot of what you'd expect from a kdrama, also tackling social issues.",
                            "score": 16,
                            "author": "NoComplacency",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am a guy as well extracurricular is what got me into kdramas, it was definitely eye opening.",
                                    "score": 10,
                                    "author": "axvx1212"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm watching *Prison Playbook* right now! Just started ep2... hard to see where it's going, but recommendations have been solid.",
                                    "score": 9,
                                    "author": "SpicyMustFlow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Trust me it's gonna be a journey worth embarking on",
                                            "score": 8,
                                            "author": "Davidwzr"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I watched it, it was pretty good but way too short. Short in a way it felt like character development was stunted :(",
                                    "score": 4,
                                    "author": "Davidwzr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Always nice to see fellow male Kdrama viewers! My first Kdrama was Age of Youth/Hello My Twenties, watched it out of boredom, and honestly I thought it'd be sort of campy, especially if looking at the poster, but, boy, was I wrong. It turned out to be full of surprises and kind of thrilling in a way, but still got that Kdrama charm to it (well, duh). Pretty great ensemble as well — I immediately fell in love with Park Hye-su since the first episode! Lol. I'd really recommend it if y'all haven't watched this gem!",
                            "score": 2,
                            "author": "asfriansyah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jo Jungsuk is a treasure. He made me believe he was a struggling singer in What's Up.  When he is capable of doing lead roles in a musical. Since then I've watched anything he's done. \n\nEven if the rest of the drama isn't fabulous his parts are always great.",
                    "score": 12,
                    "author": "vereelimee"
                },
                {
                    "level": 1,
                    "comment": "That's actually a crazy funny coincidence! I've loved Scrubs ever since the first episode I watched when I was young. The first episode of Hospital Playlist that my boyfriend watched with me, he immediately said, \"Oh that's why you like it so much. It's like the Korean version of Scrubs.\" I didn't even notice! I just enjoyed the show so much. I can't wait for Season 2.",
                    "score": 6,
                    "author": "tabemaster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exactly. I usually end up feeling pretty smug when a friend likes a drama I recommended.",
            "score": 36,
            "author": "_Nikhedonia",
            "replies": [
                {
                    "level": 1,
                    "comment": "That feeling of \"yes! I converted another one to the dark side!\" 🤣",
                    "score": 36,
                    "author": "Chocokat1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched the first episode last night and SO MUCH HAS HAPPENED",
            "score": 26,
            "author": "spark1118",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol the real plot is that this girl is Jeongwon's sister (only introduced in later eps) and they finally reunited after many years. That's why Rosa is so happy.  She's not who you think she is :)",
                    "score": 18,
                    "author": "lzyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You better add a spoiler tag! ;)",
                            "score": 16,
                            "author": "wishdreamscometrue",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😄",
                                    "score": 3,
                                    "author": "ednamode101"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dad started watching a kdrama all on his own. I was so surprised cuz I didn't think he'd be interested in that. He loved it too. When I was watching 'Because This Is My First Life' my mom just started watching with me. After that, whatever I looked at, she would join me. Then both of them watched CLOY with me and they loved it. They even recommended it to my aunt and now she's hooked in kdramas.",
            "score": 23,
            "author": "XpertSavage",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish my family was that interested in kdramas",
                    "score": 6,
                    "author": "Milkyweed"
                },
                {
                    "level": 1,
                    "comment": "My father started watching variety shows first, for the comedy. While I’m watching, he would recognize familiar faces so he started watching the dramas with me. Of course, he would skip some of the cheesy romance shows but slice-of-life is both our preference. His faves, all of ShinPD shows.",
                    "score": 3,
                    "author": "wuzzie01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My friend and I decided to watch CLOY Together at the start of quarantine and we both became addicted to kdramas. Our tastes diverged from there, so it’s always nice finding something we both like so we can discuss the plot/romance lol.",
            "score": 10,
            "author": "dsatellite15"
        },
        {
            "level": 0,
            "comment": "I hate it when friend trying to prove me how kdramas are waste of time and he doesnt like all this \"Brazilian series\", and then ends up enjoying kdramas quietly like he wasnt the guy telling so much shit about it. So much of prejudice crap, people no different than thousands years ago. But anyway, atleast some of us learn from thus. I hate it because I was the same, but atleast I admit that I was a fool xD",
            "score": 9,
            "author": "DafuqBoom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also I feel like people judge kdramas too harshly simply because it’s not English and they’ll nitpick on scenes that aren’t usually in mainstream movies/shows. Yet, if you watch the average English romcom or sitcom the plot and script are nowhere near the quality of top kdramas.",
                    "score": 13,
                    "author": "ednamode101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "it’s hard for me to recommend anything to my friends because of my different taste in kdrama XD so far i’ve only convinced two of my friends to watch The Guest and Kill It respectively. totally worth though, since we could fangirl over the drama together :p",
            "score": 8,
            "author": "galaxycarat",
            "replies": [
                {
                    "level": 1,
                    "comment": "ooo Kill It is so amazing",
                    "score": 1,
                    "author": "XpertSavage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I literally just watched this scene 10 seconds ago. Daebak!!",
            "score": 7,
            "author": "MFlash08",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same!! Ugh. I just love this show so much.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know exactly how you feel hahaha it’s been almost 3 years since I recommend dramas to my friends and some of them finally started taking it seriously and watching it. I couldn’t be happier when they send me messages saying they love it ^^",
            "score": 6,
            "author": "samsampaio"
        },
        {
            "level": 0,
            "comment": "I love this!!! I stopped coz I saw Yoo Yeon-seok, then chuckled seeing the content. Still chuckling.",
            "score": 9,
            "author": "kanafehlove"
        },
        {
            "level": 0,
            "comment": "Me telling my sister to watch Strong Woman Do Bong Soon.",
            "score": 4,
            "author": "whatuhdrag"
        },
        {
            "level": 0,
            "comment": "I’m a proud kdrama fan since 2009 :D",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My friend in 2017 after convincing me to watch Strong Woman Do Bong Soon\n\nAnd again that same friend after convincing me to watch CLOY as a favour to her",
            "score": 5,
            "author": "foxxi_paradoxxi"
        },
        {
            "level": 0,
            "comment": "I've never been successful with having friends or family giving a Kdrama a chance. I did have a coworker borrow one of my DVDs of My girlfriend is a gumiho and give it a chance, but she didn't find it enjoyable.",
            "score": 4,
            "author": "mccuish"
        },
        {
            "level": 0,
            "comment": "Every person u want to get into kdramas, you have to find the right one for them! Its so hard 😭😭",
            "score": 3,
            "author": "kr33ch3r"
        },
        {
            "level": 0,
            "comment": "The trick is to pick something short - i always go with the ever interesting and wonderful - 2 ep drama - splash splash love - it gives them a taster. Gets them on the kdrama train. Other ways is to watch a climax episode with the person",
            "score": 3,
            "author": "akillerdinner"
        },
        {
            "level": 0,
            "comment": "Liked it. Can't wait for season 2 ( if there is one )",
            "score": 2,
            "author": "kaiv10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes there is a season 2 for this show, thankfully! Hospital Playlist is a rare kdrama unicorn that was slated to do more than 1 season.",
                    "score": 3,
                    "author": "momobananamama"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the picture from Dr. Romantic 1?",
            "score": 1,
            "author": "complex42",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, its from Hospital Playlist. Its a really good show too! One of the fine works by Shin Pd, the producer of the Reply series and Prison Playbook",
                    "score": 13,
                    "author": "lzyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooh! I’ll give it a watch after my exams!",
                            "score": 3,
                            "author": "complex42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So far I only convinced one friend to watch kdramas. Everyone else rolled their eyes. Admittedly they don’t watch any dramas so they say.",
            "score": 1,
            "author": "Tubacim"
        },
        {
            "level": 0,
            "comment": "I've told so many people to watch Save Me and all they say is \"I'll add it to my watch list\" and then the following weeks they tell me how they're watching Itaewon Class and CLOY smh. But I was surprised this week when a friend I recommended it to a couple months ago told me they started watching Save Me and I was so happy, but they were scared af which I completely understand.",
            "score": 1,
            "author": "Hunterknowsbest"
        },
        {
            "level": 0,
            "comment": "Yeah no one watches my shows :,)",
            "score": 1,
            "author": "msy202"
        },
        {
            "level": 0,
            "comment": "LOL, well, I guess I'd better be well-prepped because I will be wearing a Goblin T-shirt for our Friday video chat meeting for my team at work. Fortunately since most of them are geeky types I can recommend the drama depicted on the shirt, but since the guys are also into a lot of really dark shows I'd better get together some other recommendations as well.",
            "score": 1,
            "author": "trinity58"
        }
    ]
}