{
    "id": "jel2y9",
    "score": 2259,
    "title": "Me to Kdrama during the lockdown.",
    "author": "-usernamesarestupid-",
    "date": 1603180702.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/jel2y9",
    "media_urls": [
        "https://i.redd.it/azserh5th7u51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "SRC: crash landing on you \n\nI started watching kdramas last year December thanks to CLOY. While it ended in February I was left with wanting for more. So I started watching other kdramas and the pandemic and wfh situation has given me so much time that I watched so many kdramas. \n\nThey have been my gateway to escape the reality and calm me down honestly! I also think we got lucky SK handled the pandemic well because we didn’t really halt on the incoming new dramas!",
            "score": 108,
            "author": "-usernamesarestupid-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg this is exactly me!!!! I haven’t watched a western show since lol!!",
                    "score": 22,
                    "author": "chunkymonkey595",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I haven’t watched a western show since lol!!\n\nAre you, me?",
                            "score": 8,
                            "author": "Recklesshavoc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too! OMG, hive mind is so real!",
                                    "score": 2,
                                    "author": "ResponsibleCold8"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Omg you just described me!!",
                    "score": 14,
                    "author": "GAC900"
                },
                {
                    "level": 1,
                    "comment": "Same same same!! I started CLOY when I was home during Christmas break and it evolved into watching Something In The Rain between episodes and I haven't stopped since! \n\nWhen lockdown started it really helped me have something to focus on that wasn't the virus, and now it's evolved in to my favorite way to relax and decompress after a long day/work week.",
                    "score": 12,
                    "author": "thegirlandthegalaxy"
                },
                {
                    "level": 1,
                    "comment": "Same here! It's been a great escape from the dumpster fire that is 2020",
                    "score": 7,
                    "author": "cdubs16"
                },
                {
                    "level": 1,
                    "comment": "Can u recommended some new kdrama? I think im out of kdrama",
                    "score": 6,
                    "author": "butternaan_nine2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you seen Flower of evil? Stranger and stranger 2? Hospital playlist? It’s okay to not be okay?",
                            "score": 19,
                            "author": "-usernamesarestupid-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ooh Hospital Playlist was so good! I definitely recommend it! Same with It's Okay To Not Be Okay",
                                    "score": 10,
                                    "author": "euforia_"
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah its okay not to be okay was soo good, seo yeji did a really awesome job with her character. Thanks for the other recommendations, i'll check it out",
                                    "score": 3,
                                    "author": "butternaan_nine2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you watched all the well known ones already , I recommend Mystic Pop up bar or Because this is my first life.",
                            "score": 8,
                            "author": "McFister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohhh because this is my first life was so good. Might watch that again. ❤️🐈고양이 🐈❤️",
                                    "score": 5,
                                    "author": "happybana"
                                },
                                {
                                    "level": 3,
                                    "comment": "Haha i finished those too",
                                    "score": 2,
                                    "author": "butternaan_nine2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m watching Tunnel right now (ep 1 lmfao). It’s similar to Signal with detectives and wacky time travel.",
                                            "score": 4,
                                            "author": "McFister",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "TFW you binged so hard that you're on the questionable kdramas now lol.",
                                                    "score": 6,
                                                    "author": "Athelize"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "not OP but i'm watching Tale of the Nine Tailed and i'm pleasantly surprised by how good it is , at least so far .",
                            "score": 6,
                            "author": "empireofdirt010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "will check out Tale of the Nine Tailed. Thanks!!!",
                                    "score": 3,
                                    "author": "butternaan_nine2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are you familiary with Yoon Shi Yoon?  His newest drama, Train, is really good.  It's a Sci-Fi Action Crime Drama.  It's great to see him in an action role because he's never done one and he does a great job.  If you're not familiar with who he is, check him out.  He's a really good actor and he's adorbs.  I'm currently watching his drama, Psychopath's Diary, and it's really funny.  His drama, The Best Hit, is a comedy and I loved it.  He also did a mellow drama called Your Honor that's about the relationship between a Judge and a Prosecutor.  But if you really want to start at the start with Yoon Shi Yoon, watch, Baker King Kim Tak Goo (also called Bread, Love, and Dreams).  It also stars Joo Won and it's a classic K Drama story.  It was his first drama and he kills it.",
                            "score": 2,
                            "author": "Wentkat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omg same! My friends and I will be forever grateful to the Park holy trinity  (Park Seo Joon, Park Bo Gum and Park Hyung Sik) for making lockdown bearable. \n\nAnd a special shout out to Hyun Bin for being our first love...haha. CLOY will always be the one that started it all &lt;3",
            "score": 43,
            "author": "Rowenasdiadem9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Upvoted bc you mentioned HB - who is our collective love and it is a love that doesn't know jealousy😂 as in we love it if others love HB as well!",
                    "score": 7,
                    "author": "333serendipity"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Found out about Kdramas in mid April. Have now completed 55 dramas. I would most definitely agree with this sentiment",
            "score": 89,
            "author": "KosherSyntax",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been watching dramas since 2014 and I don’t even think I’ve seen 15. Quarantine made you an expert 😳",
                    "score": 47,
                    "author": "whatitdewwbabyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been watching since 2010. Before Viki even existed lmao.",
                            "score": 13,
                            "author": "euforia_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2006. Watched Goong and My Coffee Prince on dvds I borrowed from friends lmao",
                                    "score": 7,
                                    "author": "weeeenr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You win lol",
                                            "score": 5,
                                            "author": "euforia_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No one won with the subtitles we had back then. The people who complain about Viki subs would’ve never survived back in those days.",
                                                    "score": 5,
                                                    "author": "weeeenr",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Omg yes! I agree. They don't know how good they have it lol",
                                                            "score": 4,
                                                            "author": "euforia_"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Me in 2007/8. Our national TV channels would buy old movies from Korea and broadcast",
                                    "score": 2,
                                    "author": "zninjamonkey"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whoaaaaa",
                    "score": 14,
                    "author": "333serendipity"
                },
                {
                    "level": 1,
                    "comment": "Woah woah! You have utilised it to the most!",
                    "score": 6,
                    "author": "-usernamesarestupid-"
                },
                {
                    "level": 1,
                    "comment": "Same boat. Started off the year with maybe 30-40 watched total. Now sitting at 90 and quickly approaching 100. I am not going crazy at all. Not even a little bit. I'm totally fine. Fine....fine.....fine.",
                    "score": 5,
                    "author": "Athelize"
                },
                {
                    "level": 1,
                    "comment": "How is this even possible? It sounds like you went through a new drama every \\~4 days. Regardless, this is amazing. I started this year but have only gone through 10 dramas.",
                    "score": 4,
                    "author": "Altruistic_Astronaut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Normally when I binge a drama, I finish it in 2 days and starting a new one on the second day. So I could technically do 2 dramas over 3-4 days.\n\nBecause of COVID I transitioned to fully working from home for a while. It let me watch many dramas during work hours while still getting my work done",
                            "score": 6,
                            "author": "KosherSyntax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh nice! I haven't been working from home but have been going out a lot less due to COVID-19. I think the fastest I went through was Itaewon Class in 5 days.",
                                    "score": 2,
                                    "author": "Altruistic_Astronaut"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What are your top 5?",
                    "score": 2,
                    "author": "mosesv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Top 3 is the easy one:\n\n* My Mister\n* One Spring Night\n* Goblin\n\nI find that these 3 all perfected what they set out to do. The other two are a bit harder to choose but it's probably:\n\n* The K2\n* Hotel Del Luna",
                            "score": 4,
                            "author": "KosherSyntax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can’t get over Goblin, I tear up listening to the soundtrack😩",
                                    "score": 2,
                                    "author": "SnooPandas5685"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "same here  dude i watched around 20 dramas and i agree with this sentiment",
                    "score": 2,
                    "author": "naruto_500"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kdrama saved me from loneliness. 😁",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Saved me from depression. Watching Kdrama actually help uplift my mood.",
                    "score": 23,
                    "author": "informationfreak123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously, kdramas uplift my mood in a way that western shows have never been able to. Don’t know what it is about kdramas 😅",
                            "score": 3,
                            "author": "Halime_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I watch it on Viki because of the comments so I feel like i'm watching together with lots of people lmao",
                    "score": 7,
                    "author": "empireofdirt010",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too! I feel so lonely when I watch on Netflix",
                            "score": 1,
                            "author": "SnooPandas5685"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% agreed - CLOY was the first Kdrama I watched in March when lockdown began and have had the same experience! Kdramas really are some much needed escapism at the moment, thanks for sharing!",
            "score": 51,
            "author": "soy-mustang",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! The day I started watching CLOY was the day it was announced that there'll be nationwide lockdown and we'll be working from home. Kdrama saved me from this Covid reality. We definitely needed the escape that time. \n\nAnd now 7 months later, I have become a kdrama geek. No regrets.",
                    "score": 17,
                    "author": "youtwoo"
                },
                {
                    "level": 1,
                    "comment": "Oh my gosh same 😭 I began CLOY around that time and it was only because of quarantine. It was my first step into kdramas and I never looked back 😍",
                    "score": 13,
                    "author": "Halime_"
                },
                {
                    "level": 1,
                    "comment": "Yeah, lots of people here resonate the same!",
                    "score": 5,
                    "author": "-usernamesarestupid-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Accuracy is 💯. That is what happened to me!",
            "score": 14,
            "author": "333serendipity"
        },
        {
            "level": 0,
            "comment": "Seriously, they are a blessing. I can't imagine life without them now. For some, quarantine was a pain. For me, it was sheer happiness only because of kdramas.",
            "score": 11,
            "author": "whimsicallyours"
        },
        {
            "level": 0,
            "comment": "100% me!! Watched my first k drama in quarantine and I got swept away by the tsunami that is the Korean wave. Can’t believe I had been missing out on Korean entertainment and music for so long! Truly a gift!",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It is this way for me too. Now I'm learning Korean and hope to live there for a small portion of my life.",
            "score": 9,
            "author": "Grezwal"
        },
        {
            "level": 0,
            "comment": "Me too. I love the world I’ve discovered in Kdramas. I’ve watched something like 10 more but I still think Cloy is the best one.",
            "score": 7,
            "author": "camuelwood"
        },
        {
            "level": 0,
            "comment": "So true. \n\nKdrama has been such a wonderful escape from everyday reality, so many great shows and the fact that they’re 16-20 episodes long, you lose yourself in that fantasy world for a while. \n\nFunny part is I would have never considered kdramas, ever, had it not been for the lockdown.",
            "score": 7,
            "author": "SandyOhSandy"
        },
        {
            "level": 0,
            "comment": "I started with My Holo Love in Juli this year and have only watched Love Alarm, Goblin and My First First Love since. \nI might start It‘s Okay Not To Be Okay soon i heard it‘s amazing",
            "score": 5,
            "author": "upsideDown14",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s okay to not be okay, \nCrash landing on you, \nStranger and stranger 2,\nHospital playlist, \nFlower of evil. \n\nThese are the most loved ones in recent times... sooo I’m jealous of you since you got so many to watch!",
                    "score": 5,
                    "author": "-usernamesarestupid-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! I‘ll check them out!",
                            "score": 2,
                            "author": "upsideDown14"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Started last year in December. Was a movie, Tune in for Love. Got it recommended by netflix. Then when i finished i saw something in the rain as a recommendation and loved it and will always be a special drama for me. Seeing the movie and this serie was the best decision i ever made cause i felt reborn again. Since then i'm taking life on a much more positive note!",
            "score": 7,
            "author": "MegaAbsolites"
        },
        {
            "level": 0,
            "comment": "Aw seeing all the people who found kdrama and got happiness from it during this shit year makes me smile.",
            "score": 6,
            "author": "zaichii"
        },
        {
            "level": 0,
            "comment": "My depression started in 2015. That was the first time I saw Heartstrings and A Gentleman's Dignity and Pinnochio. \n\nThis is me screaming to the kdrama gods. \n\n#You came to my life like a blessing and I hope you never leave me again.",
            "score": 6,
            "author": "mrobviousreasons"
        },
        {
            "level": 0,
            "comment": "Haha same here. I have watched a bazillion since lockdown started :) Even got a subscription to VIKI once I ran out of kdrama on Netflix :)",
            "score": 5,
            "author": "hunkichunki",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol, that was what happened to me exactly",
                    "score": 2,
                    "author": "mmk270"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha I watched more Kdrama in quarantine than I did in my entire life prior, by a **significant** factor so this is incredibly relatable",
            "score": 5,
            "author": "MutekiGamer"
        },
        {
            "level": 0,
            "comment": "True story: before kdramas I used to watch rachet shows like love after lockdown, 90 day fiance, and etc. I made a promise to my self I would stop watching these shows. The Kdramas came and save my lockdown, they have opened me up to a new world that I can escape to. Thank you kdramas for doing this.",
            "score": 5,
            "author": "jimmmy2345",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes fellow Love after lockup and 90 day fiance watcher! After CLOY as my first KDRAMA, there's no in between- either that or absolute trash shows for me lol",
                    "score": 2,
                    "author": "jw398"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This drama made me feel so many things. I would watch it again.",
            "score": 5,
            "author": "foulestphoenix",
            "replies": [
                {
                    "level": 1,
                    "comment": "the butterflies in the stomach, the ugly crying, all the feels!!! CLOY made me so giddy.",
                    "score": 4,
                    "author": "MrsIronbad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sums it up alright",
            "score": 4,
            "author": "izzetiii"
        },
        {
            "level": 0,
            "comment": "I had only watched a few k dramas here and there over the years but I ran out of stuff to watch when we first went into quarantine and watched Busted, which led me to watch WWWSK, which led to Itaewon...then CLOY. Now, like 50 dramas later, I'm hopelessly addicted and still going strong lol.",
            "score": 4,
            "author": "MisterGrimes"
        },
        {
            "level": 0,
            "comment": "OP, are you pleasantly surprised with 1k upvotes for this ppst or did you expect it?",
            "score": 3,
            "author": "333serendipity",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have posted a lot of memes (edit: not a lot actually about 5-6 lol) on this sub, all my own content and mostly CLOY related because rewatching helped me find those memes! Those touched 1.5k so I’m not surprised 😅",
                    "score": 8,
                    "author": "-usernamesarestupid-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a little jealous of all y'all just getting started-- it's so much fun to watch all of the older shows for the first time and figure out the genre(s) what you like/don't like, etc. I've definitely been grateful for my KDrama habit during all of this! It's probably saved my brain from 2020.",
            "score": 5,
            "author": "minathens"
        },
        {
            "level": 0,
            "comment": "Hahaha...so true for me and almost everyone commenting here!  Have never watched a kdrama until CLOY in April during lockdown...and now searching for the next to watch.  CLOY set such an impossibly high benchmark, that every drama pales in comparison.  \n\nOf those you have watched, what are your top 3 favs?",
            "score": 5,
            "author": "wond3rouswand3rer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Top 3: Crash landing on you, Stranger, Hospital playlist! \n\nAdding because this is my first life and fight for my way for top 5.",
                    "score": 1,
                    "author": "-usernamesarestupid-"
                },
                {
                    "level": 1,
                    "comment": "I loved Mystic Pop up bar, Hi Bye, Mama, Memories of the Alahambra, and I just finished Mr. Sunshine!! So good. I could not get into It's Okay to not be okay. The female protagonist in that is unappealing, to me.   Loved everyone in Mr. Sunshine. Looking for a new one now.",
                    "score": 1,
                    "author": "Elegirl2020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This year has been shit and now I’m addicted to Viki and not even sorry! My birthday was Friday and my husband (who tolerates my love of K-Dramas) got me a K-Drama gift pack with a whole bunch of TKEM gear ❤️",
            "score": 3,
            "author": "phoenix38133",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy birthday ~! Enjoy your kdrama🥳",
                    "score": 1,
                    "author": "anyothersuggestions"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so vey true!",
            "score": 3,
            "author": "ngiamsw"
        },
        {
            "level": 0,
            "comment": "Infact 2020 is giving us best K-Dramas one by one.",
            "score": 3,
            "author": "The_Mask_Girl",
            "replies": [
                {
                    "level": 1,
                    "comment": "So true! Every alternate month I have been like this goes into my top 10! \nCloy, \nHospital playlist,\nIt’s okay to not be okay,\nFlower of evil, \nand Stranger 2! Were my recent favourites!",
                    "score": 4,
                    "author": "-usernamesarestupid-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "so so true to a point that after watching several kdramas, I ended up learning how to read Hangul just so I can read what characters are texting to each other lol 😁",
            "score": 3,
            "author": "fynkar"
        },
        {
            "level": 0,
            "comment": "Yup. Kdramas are my “me time”. Just finished CLOY, starting My Mister thanks to people’s reviews of it on here.",
            "score": 3,
            "author": "fridayfridayjones"
        },
        {
            "level": 0,
            "comment": "Gettin my money's worth on my viki account!!!!",
            "score": 3,
            "author": "Hoshikuzu-"
        },
        {
            "level": 0,
            "comment": "Clarifying my previous post to list the series -- I forgot the commas. \n\nThe shows include Shopaholic Louis, I'm Not a Robot, Thirty But Seventeen, Because This Is My First Life, Search:WWW, Healer, Love in the Moonlight.\n\nStart-up on Netflix is pretty amazing four episodes in. Probably some of the freshest writing and tight plotting I've seen so far.\n\nWhat's super refreshing in Kdramas is the restraint and decorum. The portray relationshops that don't conflate attraction or love with immediate physical intimacy. Maybe Korean dating and relationships IRL are way different but for me as a viewer, I prefer their cinematic moral code to that of North American or European shows where protagonists have sex as casually ordering a venti lattte.",
            "score": 3,
            "author": "Lolobadgerino"
        },
        {
            "level": 0,
            "comment": "Ahaha why can we only give one upvote\n\nI loved that line. Makes u want to appreciate the people who really came into ur life like a gift.",
            "score": 5,
            "author": "MALLY10FE"
        },
        {
            "level": 0,
            "comment": "I totally agree with that",
            "score": 2,
            "author": "alexa_tanaka"
        },
        {
            "level": 0,
            "comment": "I started winter 2019 and they just started releasing so many on Netflix that I couldn't resist.",
            "score": 2,
            "author": "Sweet_N_Vicious"
        },
        {
            "level": 0,
            "comment": "Sxaawaxz🤗🤗😊🤗🤗🤗🤗😊🤗🌻🤗Zw",
            "score": 2,
            "author": "BabyFan1"
        },
        {
            "level": 0,
            "comment": "I owe CLOY, It's okay not to be okay and Hotel Del Luna for making this year bearable\nit was easier to feel relaxed because I could seek my solace from these amazinggggggg kdramas",
            "score": 2,
            "author": "Narrow-Actuary"
        },
        {
            "level": 0,
            "comment": "I just finished that drama. I loved it so much!",
            "score": 2,
            "author": "SheetMasksAndCats"
        },
        {
            "level": 0,
            "comment": "I officially got into kdramas during quarentine",
            "score": 2,
            "author": "MajesticWorld19"
        },
        {
            "level": 0,
            "comment": "CLOY was my gateway drug to Kdramas and I'm going on 5 months now.  I've re-watched it too many times to count.  Love the OST so I'm listening to kdrama music (I'm surprised at how many songs I like even if I don't understand the words!) if I'm not watching it!  I've watched about a dozen other dramas but I still come back to CLOY.  How can I still laugh and cry at scenes I've watched over and over????   This could have a longer lasting effect than the Corona pandemic itself!\n\nOther dramas I recommend:  Legend of the Blue Sea (same writer as CLOY), Alone In Love (also with the amazing Son Ye Jin), Personal Taste (Lee Min Ho AND Son Ye Jin - somewhat dated but fun) and Secret Garden (mostly for Hyun Bin playing the female role).",
            "score": 2,
            "author": "janinelc"
        },
        {
            "level": 0,
            "comment": "Same I started watching them in February and my first KDrama was ‘Fated to love you’ and I watch like 3 dramas a week. It’s like another job.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I kneel with folded hands to thank dramas for saving me from going crazy during lockdown, and avoiding the possibility of burying my husband in the backyard. We are both alive and mentally healthy because I have this outstanding escape mechanism.",
            "score": 2,
            "author": "ResponsibleCold8"
        },
        {
            "level": 0,
            "comment": "Man i still need to watch crash landing on you 😭",
            "score": 2,
            "author": "bartu_neg"
        },
        {
            "level": 0,
            "comment": "100% agreed",
            "score": 2,
            "author": "potterwhomerswiftie"
        },
        {
            "level": 0,
            "comment": "EXACTLY",
            "score": 1,
            "author": "YunMinju1114"
        },
        {
            "level": 0,
            "comment": "I am going to rematch this. I’ve missed Captain Ri and his comrades.",
            "score": 1,
            "author": "pjsdayforlife"
        },
        {
            "level": 0,
            "comment": "Legit seen nothing but kdramas since June 😍💀\nTruly keeping me going in this lockdown 🦉❤️",
            "score": 1,
            "author": "desire9me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here!",
                    "score": 1,
                    "author": "Wentkat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your post/comment has been removed for linking or promoting an illegal source. A ban has been placed. Duration of your ban is determined by the number of times you have violated this rule. First offense: 24 hr ban; second offense: 7 day ban; third offense: 30 day ban; and fourth offense: permanent ban.\n\nWe strictly prohibit promotion or linking of any illegal sources, including but not limited to, non-licensed streaming sites, videos hosted on video streaming services without proper rights, torrents, download links, etc.. Promotion includes soliciting users to PM for links to illegal sources. If you repeatedly violate this rule, we will ban you. If we find that you are using multiple/alternate accounts to violate this rule, we may escalate this matter to Reddit admins. For our full rules on streaming sources, see &lt;Section 4.3 Streaming Sources&gt; in our [Rules](/r/KDRAMA/wiki/rules).\n\nWe take this issue seriously because upholding copyright, licensing, distribution, and other intellectual property laws protects the efforts of everyone involved in making our beloved kdramas. By using legal streaming sources, we demonstrate that we value these kdramas and support production of future kdramas. Please check out our [Where to Watch Kdramas](/r/KDRAMA/wiki/wheretowatchkdramas) for a list of known legal streaming sources.",
                    "score": 3,
                    "author": "AlohaAlex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, the wonderful magical world of Korean dramas.. I want to step through their screen and down a glass's of soju while munching my lettuce wrapped grilled pork belly with raucous friends who talk with their mouths full and clout each other affectionately. Sigh. Where's a Holodeck when you need one.\n\nHave absolutely LOVED the plethora of heartwarming, uplifting Kdrama series on Viki and Netflix. The following are guaranteed to fill your viewing hours with nuthin' but sweet vibes:\n\nThirty But Seventeen\nI'm Not a Robot\nShopaholic Louis\nBecause This Is My First Life\nSearch: WWW",
            "score": 1,
            "author": "Lolobadgerino"
        }
    ]
}