{
    "id": "ls5cwi",
    "score": 1607,
    "title": "Netflix to Spend $500 Million on Korean Content this Year",
    "author": "setlib",
    "date": 1614255646.0,
    "url": "https://www.reddit.com/r/KDRAMA/comments/ls5cwi",
    "media_urls": [
        "https://variety.com/2021/streaming/asia/netflix-korean-content-spending-1234914743/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Does anyone else feel like the subtitles on Netflix aren't as good? I noticed this watching Strong Woman Do Bong Soon on Netflix vs. on Viki. I think Netflix subs tend to \"localize\" certain words that are specific to Korean culture/language, while fansubbers opt not to translate certain words and instead add translators notes explaining them the first time they appear. I think Netflix's method is more accessible for non-Kdrama fans, but I much prefer the Viki/fansubber method.",
            "score": 124,
            "author": "CivicTera",
            "replies": [
                {
                    "level": 1,
                    "comment": "Once kdrama becomes as mainstream as anime has become, then maybe we can have our \"oppa\"s and \"sunbae\"s in the subs. ☺",
                    "score": 45,
                    "author": "TheSpace_withYOO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldn't bet on it, anime has a much larger fan base and a longer history in the west but it's still very common to not include any loan words and translate honorifics as names, etc. I forget when I last watched anime subs from netflix if they do it this way but I'm pretty sure they do.",
                            "score": 7,
                            "author": "glocks4interns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They add in -kun and -chan in the subs though. I don't know about on Netflix, but other professional subs have them sometimes.",
                                    "score": 2,
                                    "author": "TheSpace_withYOO"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like viki subtitles much better than netflix.  They even translate the songs.\n\nWhat was worse when Netflix dubbed Space Sweepers in english.  The english and the closed caption was so off ... how can you mess that up.  I switched it to Korean with english subtitles because I know how Kim Tae-ri sounds like and the dubbed version was annoying me lol.",
                    "score": 18,
                    "author": "dj_alpha2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The subs were even wrong for the foreign actors. Like the very first scenes one of the characters is supposedly speaking german but is obviously using english. Netflix dubs are also notoriously bad with productions from my country when I tried to switch to english just for fun.",
                            "score": 4,
                            "author": "Kirazin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The subs on Viki are generally better. Sometimes they include explanation text too, which I find pretty helpful.\n\nBut I'm not sure it's fair to compare... Netflix actually pays their translators and doesn't release a production without subs. Viki is just a team of volunteers AFAIK, and the subtitles often aren't 100% when the show becomes available, even for premium content.",
                    "score": 51,
                    "author": "DuneBug",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like that makes it even more fair as a comparison though, our free volunteer subbers are doing a better job than paid subbers. This isn’t a good point for Viki, just a nod to our hard working volunteer subbers who put their blood sweat and tears into giving us beautiful free subs.",
                            "score": 10,
                            "author": "miscreation00"
                        },
                        {
                            "level": 2,
                            "comment": "If Netflix pays their translator then they should have the better subs.",
                            "score": 26,
                            "author": "IIM_Clutch"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I'm both happy people aren't being exploited for their work/are actually getting paid for their services, but also sad because that level of understanding that comes from when fans sub a show they care about is lost.",
                            "score": 13,
                            "author": "CivicTera"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it's just a different approach. Viki are mainly fan subs and they try to make the translations as accurately as possible (even including notes so people can understand as much as possible), where Netflix wants the translations to be more localized and mainstream, if that means losing some of the nuance or local/cultural attachments to the original source material",
                    "score": 5,
                    "author": "jgfmondewc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. I watched Reply 1988 on Netflix first and later on Viki. The Viki subs have such awesome notes which provide context. Netflix subs seem bland in comparison.",
                            "score": 2,
                            "author": "BlindlyNobody"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My friend who worked with Netflix on some projects told me that their subs cater to the American market, so those who do not understand the culture and terms of addressing people in Korea will not get confused.",
                    "score": 5,
                    "author": "mynthe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I understand the reasoning, Netflix is a far broader platform than Viki which specializes in East Asian dramas. Still feels like something is being lost between the show and the captions, and I find myself having to explain some things to a friend who's watching with me because the translation left out some details (e.g. a character calling another \"unnie\" but not literally meaning sister, and thats why they're doing XYZ...)",
                            "score": 4,
                            "author": "CivicTera"
                        },
                        {
                            "level": 2,
                            "comment": "What about translations to other languages, which are awful too? Makes me think they don’t translate Korean to destination language, they translate the English translation which is terrible so the end result is pretty bad. My language has honorifics and there’s no trace of them in the translation, which shows that they were “lost” in the English translation.",
                            "score": 4,
                            "author": "faramaobscena",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe that it's Korean -&gt; English -&gt; everything else too.",
                                    "score": 1,
                                    "author": "mynthe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I realized that when I understood what was being said and the subtitles interpreted it a bit differently than I expected. I'm currently watching Run On.",
                    "score": 4,
                    "author": "marshamd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same! I'm far from fluent in Korean, but sometimes I understand a sentence or two and its completey different from what I'd expect the English translation to be. I've noticed this with the subtitles of a few French movies I've watched on Netflix too (I'm a lot better at French), its a bit jarring. Sometimes, they'll put the transcript of the English dub rather than the English translation of the original audio, so that causes differences too.",
                            "score": 5,
                            "author": "CivicTera"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can tell it’s bad when they don’t even use honorifics in the translation.",
                    "score": 3,
                    "author": "faramaobscena",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't like to watch Asian dramas on Netflix if I can help it, but there have been a few cdramas that aren't available elsewhere. Some are okay, but there are way too many that translate terms like meimei and didi (younger sis/bro) as *full names*.",
                            "score": 1,
                            "author": "anathemas"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yesss like i can understand some phrases in korean that they say and the sub will say something not entirely accurate and im like wtf that's not what they really said also they are always like so simple and short? they try to make what they said as simple as possible im like nahhhh even with c-drama i feel like, watching the untamed on viki verses netflix the subs on viki were very good and longer",
                    "score": 1,
                    "author": "Ok-Broccoli-5668"
                },
                {
                    "level": 1,
                    "comment": "They have been subpar to terrible for a good decade now.",
                    "score": 1,
                    "author": "Shower_caps"
                },
                {
                    "level": 1,
                    "comment": "No. They're not. I noticed it too. 2 option for Eng subs and both sucked.",
                    "score": 1,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I can't even get subtitles on Netflix to show up without having to rewind or pause what I'm watching.",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP note: Originally posted by /u/rikayla on /r/asiandrama\n\nPay attention to the list of upcoming Netflix drama titles in this article! If history is any guide, based on previous Netflix productions like **Kingdom** and **Extracurricular**, these will be far more unique - and contain more mature content - than the regular kdramas that air on Korean television first.",
            "score": 110,
            "author": "setlib",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're definitely more graphic and intense I would say. Kingdom for example is very gory compared to other kdramas because they can get away with it, having it on Netflix. Same with Sweet Home. I highly suggest both of those if you find kdramas to be too fluffy, because those ones are very much horrors.",
                            "score": 24,
                            "author": "laventelli"
                        },
                        {
                            "level": 2,
                            "comment": "If you’re new to kdramas, the first thing to keep in mind is that they’re available in a wide range of genres. So if you don’t normally enjoy romantic comedies, you probably *still* won’t like Korean romantic comedies. But if you head over to /r/kdramarecommends and list some of the specific movies and tv shows you normally like to watch, you can get a list of kdrama titles that are similar. That way, you’re more likely to find something you’ll actually enjoy.\n\nAs for Netflix, they’re a fairly new player in the kdrama world and have only originally produced a handful of dramas so far. You can read [this interview by the screenwriter of Kingdom](https://www.philstar.com/entertainment/2020/03/17/2001367/kingdom-creator-wants-zombie-series-run-10-seasons) where she talks about how much she enjoyed working with Netflix because it freed her from the content restrictions of Korean television (for example, she got to show full decapitations of the zombies! Yay!) and from pressures for ratings, product placement (advertising), etc. \n\nThe vast majority of kdramas you’ll currently find on Netflix have absolutely nothing to do with Netflix at all. They were produced by other companies for Korean tv and Netflix just licensed them for streaming. The original kdramas tend to fall in two categories - the ones that are produced for **television** channels like SBS tend to not be as dark in content and include a lot more product placement (mmm... this chicken is delicious! Anyone want a Subway sandwich?). Kdramas produced for **cable** channels like OCN (the Korean version of HBO) will often be more mature but they’ll still have content restrictions that look odd to Western viewers, like blurring out knives. Again, none of this has anything to do with Netflix. That’s why this article is so exciting - Netflix underwriting more original Korean content could be a game-changer in terms of content.\n\nEDIT: Fixed typo",
                            "score": 50,
                            "author": "setlib",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love kdrama product placement, they're brainstorming how to take down the evil corporation, they're brain lagged and so then whip out a box of ginseng tubes or whatever.",
                                    "score": 24,
                                    "author": "buttcheeksontoast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All whilst in Subway",
                                            "score": 12,
                                            "author": "ChairMao"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m actually quite pleasantly surprised about the new “generation” of kdramas coming out. Up until 2015, it was practically impossible to find korean dramas that didn’t have an added romance story in them. Nowadays, you can pretty much have a straight up action or thriller or horror movie.",
                                    "score": 3,
                                    "author": "ICOMMANDYOUTOSTOP"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am a big Korean Movie watcher myself but you can't compare dramas with movies as tv stations have more regulations as censoring like some people mentioned Netflix Kdramas tend to be more mature and bold. Some good dramas to try out:\n\nExtracurricular ( one of my favorite, fresh and mature compared to regular Kdramas)\n\nSave Me\n\nMy Mister\n\nStrangers from Hell\n\nLie after Lie",
                            "score": 2,
                            "author": "LaughingGor108"
                        },
                        {
                            "level": 2,
                            "comment": "I feel like a lot of shows even with limited one season run feel really padded out with filler and these episodes are close to twice as long as US drama episodes.  Some people enjoy that but it’s pretty rare that I don’t feel like there is a lot of filler or they run out of great story before the finale.  There’s nothing in tv land like the thrill of Memories of Murder, parasite, the host, the handmaiden, good, the bad, the weird, save the green planet, oasis, Oldboy, mother. I did enjoy most of crash landing on you, my mister. Signal, Stranger, and While You Were Sleeping. some other shows were decent but made me think of daytime American soap operas except with year long plots squeezed into one season by comparison or even Scandal (soapy American drama) a bit. Also Hospital playlist reminded me of Call the Midwife a lot so There s a wide range of types of shows.",
                            "score": 2,
                            "author": "yetanotherwoo"
                        },
                        {
                            "level": 2,
                            "comment": "They have all genres of dramas. From cute loco to gory hardcore thrillers.",
                            "score": 1,
                            "author": "pynzrz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Season 2 of extracurricular pls. I beg.",
                    "score": 17,
                    "author": "Yojimbo4133"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, Netflix is stepping up their game. The show descriptions in the article sound intriguing. I need another season of Kingdom though lol but stoked for the standalone episode!",
            "score": 67,
            "author": "cdubs16",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  I need another season of Kingdom\n\nFFS\n\nDownvote me all you want but THIS is what worries ME. God damn seasons instead of what I love most about K Drama - one season closure. But god damn this new trend.",
                    "score": 28,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm worried about what's happening with Kingdom. No news so far about the next season...",
                            "score": 5,
                            "author": "wordgenius"
                        },
                        {
                            "level": 2,
                            "comment": "That's a fair point. \nFor the most part, I'm mostly satisfied &amp; like the closure K-dramas have. With Kingdom in particular, it seemed to me as if they were planning another season based on the ending and comments made by the screenwriter. If it's just the standalone episode, that's cool too.",
                            "score": 2,
                            "author": "cdubs16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "gotcha.\n\nEdit: and now I know to stay away from *Kingdom* till they release the *closure season or episdode*. I have enough to watch anyways.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agree completely. Not to mention the very possible future of Netflix dumping money into Korean media to get exclusives taking away from better providers like Viki.",
                            "score": 1,
                            "author": "Ciacciooosss"
                        },
                        {
                            "level": 2,
                            "comment": "Kingdom has only had 12 episodes so far. That's not even a full kdrama season run.",
                            "score": 5,
                            "author": "funnyunfunny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They’ll fund lots of bigger budget sets! No more using the same police headquarters for cop dramas!!!",
                    "score": 4,
                    "author": "badnewsco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "while i trust netflix as the best platform to release dark thriller dramas, it just doesn't sit with me how kdramas are slowly becoming serial. 16 eps or less are enough for a standard drama. sure, the first and second season might be good, but if they keep on releasing another season for the same damn drama, it gets redundant and goes far from the main plot. \n\n\nwhat i particularly dislike about netflix dramas is that the ending of the last ep is ALWAYS ALWAYS a cliffhanger, leaving enough space for a potential 2nd season. tho in the case of kingdom, it's quite understandable to give 2nd season AND a prequel. i hope they'll stop at the 3rd. \n\n\njust my two cents.",
            "score": 381,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How many Netflix-original dramas are actually multi-season? \n\nMy First First Love technically has 2 seasons but it’s 16 episodes total. \n\nThen there’s Love Alarm which will have 14 episodes total across 2 seasons, still under 16 total. \n\nKingdom has 12 over 2 seasons, plus the special episode this year. \n\nBusted, the faux variety/comedy show, has 28 episodes over 3 seasons I guess?\n\nAm I missing any other shows? I don’t know if it’s really a trend they’re responsible for creating - definitely not with shows doing 16 episodes year after year.",
                    "score": 115,
                    "author": "ParanoidAndroids",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you completely! Most of the dramas getting 2nd seasons are just exclusively streamed on Netflix but not actually produced by them. And some dramas are getting 2nd seasons while having nothing to do with Netflix lol",
                            "score": 50,
                            "author": "DarkKnight2001135",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly lol, people are acting like Netflix had a season 2 for all of the Dramas and they didn’t even create them, they are just streamed by them.",
                                    "score": 23,
                                    "author": "mrizzle1991"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "personally, i hate the “technically two seasons” format just as much. i believe my first first love was filmed all at once, but with love alarm (&amp; the taiwanese one triad princess) it is incredibly obvious that they are literally halfway into the show for the first season but they sit &amp; wait to see the views before filming the second. when love alarm was released &amp; i saw the 8 eps, i knew after my first first love that i didn’t WANT to watch it bc i have zero interest as a binge watcher in watching half the show &amp; then waiting years for the conclusion. unfortunately, it happened anyway because i watched the first half when i thought the second was coming out in august 2020 lol.",
                            "score": 22,
                            "author": "seoul-ful",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it's probably better for production schedules. We never see the actual rigorous production schedule these actors have to go through, but I imagine they can get quite grueling, 24 hours filming at some times for when they try to put it all in long episodes for 1 season instead of 2 seasons.",
                                    "score": 7,
                                    "author": "mayisir",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i understand your point, but i actually feel the opposite for a couple reasons. since the majority of dramas at this point are not produced this way, it means the actors have to somehow work a second season production in between their more traditional schedules. i wish kdramas would move to entirely pre-produced formats instead of filming while airing, because it certainly feels like the schedule could be less grueling if they weren’t trying to film/edit a week or two before the episode is released. \n\ni believe the original netflix ones are all pre-produced, so i feel that splitting a 16 episode drama into two seasons filmed months/years apart is a detriment to the actors since it messes with the character immersion &amp; possible commitments to other projects. \n\ni may be wrong, it would certainly be interesting to hear how the actors themselves feel about it :)",
                                            "score": 5,
                                            "author": "seoul-ful"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Vagabond is a SBS production.\n\nUncanny Counter is an OCN production (and the story wrapped up completely - a second season was ordered by OCN due to the overwhelming success of the show). \n\nArthdal Chronicles is a tvN production. \n\nNetflix is the international distributor for these shows, but these are not wholly [Netflix-produced shows](https://en.m.wikipedia.org/wiki/Category:Korean-language_Netflix_original_programming) (like Kingdom).",
                                    "score": 34,
                                    "author": "ParanoidAndroids",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm getting so tired of the people saying Netflix funds or produces these shows when they're just a distributor.",
                                            "score": 12,
                                            "author": "funnyunfunny"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is there any *actual* evidence of them catering specifically to an American audience? \n\nA distribution deal is far less expensive investment for Netflix (and therefore less lucrative for the production company) than footing the bill of the show, and these Korean companies are not committing to multi-year shows just because they have a new international distributor or think international fans will like it more because it has multiple seasons. Viki is another distributor and has a lot of high profile shows - but they aren't footing the bill for the actual production of the program - just paying for the distribution deal in most cases.\n\nThink about what you're suggesting: a Korean company will setup multiple seasons of a show because they think *American audiences are used to the multi-season format*? Netflix is an international service and these distribution deals cover the rest of the world, not just America. These shows are relatively expensive and need to have success domestically first for more seasons to be feasible. A multi-season Netflix distribution deal isn't going to cover the cost of a program if they aren't pulling in numbers at home. \n\nPeople don't just pick up a show *because* it has multiple seasons, either. In fact, the last few years have shown an increase in mini-series and limited series in the West with shows on premium networks. \n\nJust because a show blew the ending doesn't mean it's Netflix's fault lol.",
                                                    "score": 21,
                                                    "author": "ParanoidAndroids",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a terrible assumption to make that American audiences prefer multi-season shows,  as well. I actually don't understand the reference to the ending for CLOY because it resolutely ended the show in a manner that was bittersweet,  but then their whole relationship was bittersweet as well.  Memories of Alhambra definitely left it open for an additional season,  but I can't think of a way that second season would be as gripping as the first.  I just thought those endings were purposeful for some other reasoning I didn't understand.  \n\nAs an American, I enjoy the 16-episode shows because it's enough to tell the story without getting stale and overly repetitive (usually).  If the show has enough original,  unique material to warrant a second season,  then I'm good with additional seasons. Most of the kdramas I've seen have been able to tell the story and wrap the plot in one season, so it feels right to end it there, even if I'm not 100% happy with the ending (I'm looking at you,  CLOY).",
                                                            "score": 7,
                                                            "author": "dorthyinwonder"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;\t the shows air on Netflix, means that production companies are more inclined to cater to the American standard.\n\nThe world doesn't revolve around America. \n\nAmerica does have a monopoly on a lot of things, Korean kdrama production is not one of them. \n\nAnd if you didn't know, the Netflix catalog of korean films and dramas is huge compared to the catalog in most countries. Having seasons and becoming serialized isn't \"Americanization,\" rather, almost every single country I know that have massive local audiences have shows with more than one season.",
                                                    "score": 2,
                                                    "author": "funnyunfunny"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let's Eat has 3 seasons. I'm hoping for a fourth season at some point!",
                            "score": 2,
                            "author": "d0nkeyrider"
                        },
                        {
                            "level": 2,
                            "comment": "Extracurricular ended in a cliffhanger. Even though it's just 8 episodes, it's not good that they make you suffer a non satisfactory ending, or wait a year or two for a second season of similar short length.",
                            "score": 3,
                            "author": "mehrabrym"
                        },
                        {
                            "level": 2,
                            "comment": "i mean, obviously not YET in kdramas. other netflix shows are mostly multi season. that's what im not excited for. but as ive said in another comment, as long as story for the succeeding seasons will still be related to the main plot, im fine with it. im just not really a fan of multi seasoned shows",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sure in the future they’ll have something more than 16 hours, but Korean networks are the ones doubling down on multiple seasons first. Dr. Romantic, Stranger, Hospital Playlist, Uncanny Counter, etc.",
                                    "score": 16,
                                    "author": "ParanoidAndroids"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Stranger and age of youth are prime example of totally unnecessary 2nd seasons. stranger got full 16 eps 2 season though both seasons are really great but 2nd was totally unnecessary. Age of youth got 2 extra episodes for a really mediocre 2nd season. Point is that its going in that direction and at a fast pace.",
                            "score": -5,
                            "author": "stark37",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stranger was a tvN production (and awesome IMO).\n\nAge of Youth was a JTBC production. \n\nNetflix was not involved in those decisions.",
                                    "score": 27,
                                    "author": "ParanoidAndroids",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes it was. Netflix is listed as original network alongside tvn and the episode were weekly based rather then whole show dump which is netflix standard model.",
                                            "score": -17,
                                            "author": "stark37",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My understanding is Netflix is the international distributor for Stranger and they had the deal to air on Netflix simultaneously (as most kdramas have now) - but it was not a Netflix produced original.\n\nEvery show that releases weekly on Netflix isn’t a Netflix produced original, either. For example, Sisyphus is airing weekly on Netflix but they didn’t produce it.",
                                                    "score": 22,
                                                    "author": "ParanoidAndroids"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Netflix is a *distributor.* Please, a single google search will explain the difference. Episodes came out weekly because they had a *direct* live distribution— coming out as soon as it aired on live Korean television.\n\n[Netflix has produced only a handful of dramas.](https://asianwiki.com/Category:Netflix_Drama_Series)",
                                                    "score": 15,
                                                    "author": "funnyunfunny"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Age of youth was very good.\n\nIt is a slice of life type. The stories can continue. There is no ending or story conclusion there",
                                    "score": 3,
                                    "author": "zninjamonkey"
                                },
                                {
                                    "level": 3,
                                    "comment": "Signal season 2",
                                    "score": 1,
                                    "author": "Yojimbo4133"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like there are some dramas (for example Signal or Memories of the Alahambra) that deserve a second season. But I don't want kdramas to end up like shows like Grey's Anatomy, which has like a million useless seasons. So they just have to be smart with how they do it.",
                    "score": 157,
                    "author": "PotionRuby101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "for real! as long as the story of the succeeding seasons are still intact with the first season and main plot, im okay with it. serial shows are kind of the downside of netflix imo.",
                            "score": 22,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Totally agree with this.\n\nAlso \\*cough\\* Vagabond \\*cough\\*",
                            "score": 16,
                            "author": "The_Real_TK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bruh we need a season 2. Wtf was that cliffhanger",
                                    "score": 3,
                                    "author": "Yojimbo4133"
                                },
                                {
                                    "level": 3,
                                    "comment": "omg just finished this today and asksfjdsfjshglksdjlgks",
                                    "score": 3,
                                    "author": "shirokuroneko"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly, I found the 10 episode format of Extracurricular very nice. \n\nI mean, it itself was great so I may be biased.",
                    "score": 7,
                    "author": "HG1998"
                },
                {
                    "level": 1,
                    "comment": "THANK YOU. \n\nI strongly hate American shows BECAUSE of how they drag on the story and milk the shows out. I hate seasons. I like that actors and actresses can spend a few months on one character and then MOVE ON. Their image is not tied down to one character. \n\nTell the story in 20-24 hours. Make it work. Write the story well (or like dog poop - idc). But wrap it up. If you can’t do that in 20 or so episodes, then there’s way too much information or conflict that are going no where and the show is losing its direction. \n\nObviously exceptions are the sitcoms or family dramas. But honestly, I don’t need 3 seasons of the same characters.",
                    "score": 31,
                    "author": "Tinysnowdrops"
                },
                {
                    "level": 1,
                    "comment": "I wouldn't say they all end on a cliffhanger. Uncanny Counter announced a second season before season one finished. The ending was open enough that there's still a lot more room to explore in Season 2 but it wasn't like \"omg if she going to die...?!\" dramatics. \n\nI do agree though that ending the season with a cliffhanger sucks and there's no need for it. I used to watch more anime and it was never much of an issue. (At least from my memory anyway.)",
                    "score": 3,
                    "author": "khkz0149"
                },
                {
                    "level": 1,
                    "comment": "As I've said before in another thread, Netflix has stated that they will cancel most of their shows after 2 seasons, hence I don't think we'd have to worry about a kdrama morphing into something like Grey's Anatomy. \n\nIt makes sense that they like Korean-style productions - it brings in an audience who don't want multiple seasons AND is good for revenue. Best of both worlds\n\n&gt;Netflix has learned that the first two seasons of a show are key to bringing in subscribers—but the third and later seasons don’t do much to retain or win new subscribers … Ending a show after the second season saves money, because showrunners who oversee production tend to negotiate a boost in pay after two years.\n\nSource: [https://www.theinformation.com/articles/netflix-plays-new-role-budget-conscious](https://www.theinformation.com/articles/netflix-plays-new-role-budget-conscious)",
                    "score": 3,
                    "author": "nonfloweringplant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am still really angry they cancel The OA",
                            "score": 2,
                            "author": "attrox_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I didn't watch The OA but I'm unhappy they cancelled so many other shows that deserve more than 2 seasons. \n\nImagine a world where Game of Thrones was limited to 2 seasons \\*shudders\\*",
                                    "score": 2,
                                    "author": "nonfloweringplant"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Single seasons is one of the biggest reasons for me watching Kdramas. Hell I'll take 10 or 12 episode shows like Hospital Playlist and Extracurricular to avoid the cursed 14/15 episode.",
                    "score": 18,
                    "author": "ichigox55",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "but... Hospital Playlist is going to have at least one more season",
                            "score": 9,
                            "author": "syncategorematiq"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This right here.\n\nI don't want god damn seasons instead of what I love most about K Drama - one season closure. But god damn this new trend.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Have to say, though I'm still fairly new to KDrama, I'm not fond of the Western options for content. I enjoy KDrama for two main reasons, the variety in the romance selection and the length of most series. Most of the ones I've seen have wrapped up mostly cleanly (looking at you Cheese in the Trap) in about 16-25 episodes. They follow a relatively similar formula for when you can expect things to happen and on those fronts I absolutely love them. I don't think I'd have the same level of interest if many of the new releases started being serialised as I like to know that there's a clean ending to what I'm watching before going in.",
                    "score": 2,
                    "author": "Chantasuta"
                },
                {
                    "level": 1,
                    "comment": "I’m torn on this. I’ve always disliked the serialized nature of western shows (few have the quality to last the number of seasons they do) but there have been dramas where I absolutely would’ve liked to see continuation on the characters lives.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Wait, there’s a third season coming up for Kingdom?!",
                    "score": 6,
                    "author": "MinakoChan_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i mean, the prequel itself lmao. i consider it as their 3rd season haha 😅",
                            "score": 7,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I strongly feel this way about Signal, which was brilliant until the ending because it left as a cliffhanger. That storyline deserved a proper closing with loose ends tied up imho.",
                    "score": 1,
                    "author": "Anfini"
                },
                {
                    "level": 1,
                    "comment": "What Netflix dramas do you think are too long? Some have more than one season but the seasons are shorter than 16 episodes. And say what you will about netflix productions but few can be criticized for having too many seasons or episodes, Netflix likes 10-12 episodes and 1-3 seasons.",
                    "score": 2,
                    "author": "glocks4interns"
                },
                {
                    "level": 1,
                    "comment": "Yea the kingdom story has been wrapped up, if there's a third season it just won't be up to par with the others. \n\nSure it ended with a cliffhanger but it everything goes to shit again, didn't we already watch that?",
                    "score": 1,
                    "author": "ohSnap374"
                },
                {
                    "level": 1,
                    "comment": "Netflix has gotten really bad with this.  Warrior nun they didn't answer half the questions . Theres a fine line between answering nothing and a cliffhanger",
                    "score": -3,
                    "author": "heycanwediscuss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Def going to check them out in 2023 when their last seasons are released. Looking forward to the 2022 lineup in 2026.",
            "score": 42,
            "author": "jorsaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "😭😭",
                    "score": 4,
                    "author": "akoishida"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i'm excited. these kinda dramas are right up my alley",
            "score": 15,
            "author": "teddygi"
        },
        {
            "level": 0,
            "comment": "I don't want k-dramas to turn into multi-season shows tbh. It ruins the originality and what makes it stand out, but I do like dark dramas too. They should add un-subtitled daily dramas and Penthouse on there too.",
            "score": 101,
            "author": "chococarmela",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why would you want un-subtitled anything?",
                    "score": 23,
                    "author": "1ts-have-n0t-0f",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are many great daily k-dramas that are not subtitled. What I meant was that I don’t want k-dramas to have multiple seasons, but I DO want subtitled daily dramas on Netflix",
                            "score": 5,
                            "author": "chococarmela"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its cheaper to do multiseason so sadly it will continue",
                    "score": 4,
                    "author": "foodnpuppies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully they can put some money aside for investigation couple season 3 and vagabond season 2.",
            "score": 7,
            "author": "PDizzle124"
        },
        {
            "level": 0,
            "comment": "It all feels very dark, serious and violent, which is obviously a trend in Western television, but I can't say I like it. The endless barrage of dystopian thrillers and \"who can make a more shocking plot\" gets old, fast.\n\nI'm perfectly fine with watching dramas that have heavier plots, but I like to have a break in between - usually a romcom or a slice of life drama - and it doesn't seem like Netflix plans to offer any. It'll come down to terrestrial channels being the only ones to produce romcoms.",
            "score": 146,
            "author": "AlohaAlex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah give us more Run On goodness.",
                    "score": 81,
                    "author": "FireFlyz351",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please! Sign up the writer to write like 5 more dramas. I'll take what I can get, but Run On was just so fresh.",
                            "score": 29,
                            "author": "Whyterain"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree, one of the reasons I enjoy Kdramas and have shifted to mostly watching kdramas is because American shows seem to all have gotten dark and tiring. The good thing is Netflix still has deals with the Korean networks that make those romcoms and slice of life dramas, even if they aren't Netflix originals.",
                    "score": 65,
                    "author": "hicantics"
                },
                {
                    "level": 1,
                    "comment": "The Netflix infusion is good for adding production value through budget increases, so I’m not surprised it’s mostly serious thrillers. In the grand scheme of things, big budget dark thrillers are a small fraction of the kdrama market compared to all the romance, slice of life, etc. that Korea pumps out on their own. \n\nThink from a business perspective: how much change would big Netflix money have provided a show like Weightlifting Fairy Kim Bok Joo? Not only does a show like that not need a huge budget (relatively speaking), but it’s unlikely to have the same crossover appeal as something like Kingdom. It just makes sense that they invest heavily in projects with big concepts/budgets.\n\nAnd thankfully they still host a variety of kdramas with a streaming deal even if they don’t fully invest in it.",
                    "score": 29,
                    "author": "ParanoidAndroids",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, exactly. Not only do thrillers and horror usually need much higher budgets, but they also are more likely to be restricted by Korean broadcasting laws. Some of these shows might only have the chance to be produced by Netflix because of that. All the regular broadcasters will continue to make romance and lighter things and I highly doubt that's going to change because of Netflix. \n\nI also highly doubt that Netflix is what's driving Korean writers to write dark stories. Like... Korean movies are almost always dark across the board. It's not like that's a Western thing.",
                            "score": 39,
                            "author": "KiwiTheKitty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah their film industry definitely does not pull their punches when it comes to what they show. I understand people not watching Sympathy for Mr. Vengeance to relax after a long day, but incredibly dark and violent is not some new trend for Korean cinema. \n\nHaving that balance is good for the industry, and the overwhelming majority of kdrama being made *isn’t* close to being that dark.",
                                    "score": 19,
                                    "author": "ParanoidAndroids",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah honestly I'm a big fan of lighter stuff too sometimes, but I'm glad writers who want to write stuff outside of the norm for dramas can get the chance to actually have their stuff made.",
                                            "score": 9,
                                            "author": "KiwiTheKitty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed. I love many of the lighter dramas, too. They’re great to watch in between the heavier dramas as well - almost like a palette cleanser.",
                                                    "score": 9,
                                                    "author": "ParanoidAndroids"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I definitely agree, having some variety to mainstream shows is very refreshing. While I do like romcoms, many get repetitive and by-the-book. Whereas shows that require a lot of budget and formula-breaking writing are less frequent. Like you said, I doubt Kdrama market will reduce production of light hearted shows, they are just diversifying their international portfolio.",
                            "score": 7,
                            "author": "lalapachou"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  In the grand scheme of things, big budget dark thrillers are a small fraction of the kdrama market compared to all the romance, slice of life, etc. that Korea pumps out on their own.\n\ni think that's actually a misconception; if you take a look at regular (around 16 hours, so no webdramas) kdramas which were produced starting in 2019 and ending at the end of 2020 there were:\n\n* 22 romcoms\n* 12 romance dramas (melodramas)\n* 33 thriller/crime/suspense dramas\n* 12 dramas which were both romance and thriller/crime/mystery\n* 12 dramas which didn't fit any of those categories (life, business, drama)\n\nSo, if you add it up there were 34 dramas with romance plots and 33 with thriller/crime/suspense plots. Yes, I removed those which were both, because with dramas like Cheat On Me If You Can and Tale of the Nine-Tailed it's a bit hard to determine what the main genre is.\n\n&gt; how much change would big Netflix money have provided a show like Weightlifting Fairy Kim Bok Joo?\n\nDramas like DotS, Goblin and MLFTS all needed quite large budgets to be made and I'd also say MLFTS could've used a bigger budget, as well as many other romcoms. \n\nActually, I'd say more romcoms were made in the past because romcoms can easily be adapted to be filmed with a smaller budget, and not that there's no use giving romcoms larger budgets.\n\n&gt;  have the same crossover appeal as something like Kingdom\n\nI'm not entirely sure I know what this means in this context. Romcoms can't be extended with additional seasons? Or they're not as appealing to the lowest common denominator when looking at US audiences - who like multi-season crossover dramas?",
                            "score": 7,
                            "author": "AlohaAlex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven't seen MLFTS or DotS but Goblin is hardly the typical romance show. It's probably considered a Fantasy show first, right? The first episode with the huge fight scene alone was probably more expensive than anything else they did in the show. \n\nI'm talking about those slice of life romance/romcoms that are grounded in reality. Netflix coming through with a full budget won't make a difference to those, as the investment is much cheaper (and there are typically less SFX/stunts/etc.). \n\nCrossover appeal refers to something appealing to two different audiences. In this case, it refers to a show appealing to the domestic Korean audience that watches  kdramas and the international audience that might not be interested in kdramas. Kingdom and other zombie properties (like Train to Busan) have crossover appeal because the zombie genre is universal. The action scenes + zombie theme open more doors than say, a romance show about an older woman who is ostracized for her relationship with a younger man and deals with sexism in the workplace (Something in the Rain is a show that also needs some understanding of Korean work and social culture to fully *get*).",
                                    "score": 7,
                                    "author": "ParanoidAndroids",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Goblin is hardly the typical romance show\n\nAccording to most sources, it's a romance/comedy/fantasy/melodrama? Yes, the first few episodes were the most expensive, but I think the rest shows nicely that you don't necessarily have to spend huge amounts to make a believable fantasy drama. It is a bit of a shame you haven't seen DotS, which was a really high budget drama for when it was filmed, as it had no fantasy elements and managed to be a great action romcom. \n\nMaking the budget larger does really help romcoms and not only with filming in better locations with actors that command large paychecks and expansive OSTs. A lot of it has to do with how much budget they have to properly research the plot and how much time and people they have to make the drama more coherent. PPL is a great way to tell how many assistant writers the budget allowed because with more manpower and time (which both require money) the PPL will fit into the drama better and won't feel as forced. Filming a by-the-numbers romcom is relatively cheap, but increasing its quality costs a lot of money. It's similar to thrillers, as they also greatly benefit from additional investment. \n\nI'm not trying to say action dramas don't need a larger budget for stunts, but that saying \"a full budget won't make a difference to\" romcoms is, in my opinion, wrong. Likewise, some of the best suspense/thriller kdramas I watched didn't have crazy stunts - Life, for example, was gripping and amazing. The majority of budget in Life obviously went to picking a good cast and really researching the plot and it showed. Both romcoms and thrillers can greatly benefit from more money for action and stunts, but I wouldn't say that one requires it and the other doesn't. I'd say there are romcoms which are cheap to film and thrillers which are cheap to film, but that there are also romcoms which are expensive to film and thrillers which are expensive to film.\n\n&gt; Crossover appeal refers to something appealing to two different audiences.\n\nAh, your sentence makes so much more sense now! Sorry that I needed to ask you to explain in order to understand; the second I read \"crossover\" my brain went straight for the Marvel universe. Yes, when looking for universal appeal, the drama has to be based on characters that are easy to relate to and plots which are, well, universal. Any drama that greatly depends on the social or work culture is bound to have a hard time with first-time drama watchers. But I'd say love is about as universal as hatred of zombies? Weightlifting Fairy, Oh My Venus and Terius are all romcoms that don't hinge on the viewer to understand the culture to be appealing, unlike Something in the Rain. I do, however, understand that (a massive generalisation I'm making here, please don't get angry) men would be more inclined to watch an action-packed drama than a romcom when browsing Netflix, and that makes it easier for couples to watch a thriller together than to experiment with romcoms. Asian filming is most famous worldwide for its horror movies and thrillers do seem like a natural next step. I'm under no illusion that most Western audiences are familiar with kdramas when kpop has only recently started becoming mainstream.",
                                            "score": 3,
                                            "author": "AlohaAlex",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's no doubt it's a romance but the fantasy genre is definitely part of its DNA. The reason for bringing up genre in the first place is that fantasy shows tend to have a need for more production cost (whether it's CG work, set design, etc.). Besides the big fight scenes, Goblin also filmed internationally (probably with some help of a Canadian film tax break) and had a number of stunts. \n\nOf course a show like CLOY can also command a bigger budget due to the star power and filming locations without needing to venture into sci-fi or fantasy, but the biggest budget shows in kdrama history almost all have an action component to them. \n\nYou're right, making the budgets larger for any project will certainly help ANY program be made - but that's not really my point. Romance/slice of life shows are much cheaper to make because they don't have to accommodate CG, intricate sets, stunts, etc. - and the networks know that. No network is going to greenlight a slice of life romance with the budget of a big action show. For every CLOY, there are probably 10+ romance shows made for a fraction of the budget.",
                                                    "score": 3,
                                                    "author": "ParanoidAndroids"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I do, however, understand that (a massive generalisation I'm making here, please don't get angry) men would be more inclined to watch an action-packed drama than a romcom when browsing Netflix,\n\nHi u/AloaAlex - No I'm not angry :) True statement. I'm working my way thru my 4th go around with DOTs now. (Excuse is to refresh my Joong Ki memory for Vincenzo but really its for Hye Kyo)  \n\nDidn't have time to read this full post but your analysis of production values is \"spot on\". However to be contrary to the rule, I did enjoy Something in the Rain - one my favorites.  \n\nFYI:  Here is a link to the same story in [Korean Herald](http://www.koreaherald.com/view.php?ud=20210225000805). Less info but more localized. Interesting mention at the bottom about Disney also showing interest.",
                                                    "score": 2,
                                                    "author": "stumpy1949"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agree with you here - the other hope would be that Netflix, as a streaming platform, allows more creative freedom than a network. Since Netflix drops all the episodes at once, creators/writers/editors can be more free with how they want the story to flow (think Stranger Things and how the episodes are all different lengths and aren't forced into a specific time slot, so it flows like one very long movie). I'm sure Netflix has the data to back up their decision for leaning into their niche of sci/fi/fantasy/horror (Sweet Home, Space Sweepers, Kingdom, The School Nurse Files). Characters can curse a lot more and product endorsements don't need to be fit in. If anything, I think it will be healthy for Korean media to have a disruptor like Netflix - maybe the stalwart networks will think a little more on what to produce, with the end goal being that we, the consumer, all benefit from (hopefully) better and better kdrama production!",
                            "score": 3,
                            "author": "keystone_lite"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I hope they stick to their own style and don't feel the need to please a \"western audience\" by making more risqué plots with gross imagery or more \"sex sells\" appeal to it. I actually sought out something new and found Korean media (movies/tv/music) cuz I was so exhausted by it over here. I'm already seeing some of their pop music lean more heavily into western appeal but I hope they don't feel the need to cater stuff to our style cuz they need to realize we're sick of it...and if I see one more damn super hero movie or tv show lol (Uncanny Counter was a good spin on it tho)\n\nAnd it's not all I want but it's just nice to have happy shows that put me in a good mood, it's like Hallmark movies but way better acting, plot lines, and production value:) I do same as you said, I switch hit between a nice happy drama and then a darker movie or show like Extracurricular/The Kingdom/etc.",
                    "score": 23,
                    "author": "JohrDinh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is so true. I was just thinking about how almost every western Netflix original show is rated R21 and has so many sex scenes and nudity that add nothing to the show. I can’t even watch it in the living room because I’m afraid that a random sex scene would pop out of nowhere when my dad happens to walk by. I just want to watch a good show without being bombarded by sex scenes all the time...",
                            "score": 2,
                            "author": "babybun97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember I was watching Korean stuff for a few months and was like “oh i’ll try this western show to change it up” and the show was Flight Attendant on HBO and she has sex like 4 times in the first 5 mins and immediately turned it off lol",
                                    "score": 4,
                                    "author": "JohrDinh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you actually read the synopsis before you watched? Because the entire premise is about a woman who is an alcoholic that makes poor decisions, the first being sexual in nature.",
                                            "score": 1,
                                            "author": "SuspiciousAudience6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I understand the premise and most flight attendant related things usually visit that plot point eventually, but my point was more that it immediately spammed and reminded me of one of the exact things I find old and tired about em. I do enjoy Westworld tho:)",
                                                    "score": 2,
                                                    "author": "JohrDinh"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very true. US dramas are either of these categories :\n\nPolitical (with features of one individual figure)\nMedical drama\nCrime drama (police, detective, emt, firefighter) \nSoap opera (telenovelas) with never ending twist and turns making it no light at the end of the tunnel\n\nAnd the last one is, make a drama With 30 min episode of comedy.\n\nKdramas are far far story heavy addressing more real life content with drama. I am not sure whether I like this shift to all these dark side.",
                    "score": 15,
                    "author": "eyeofthemess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For all the complaints about American shows being too long, repetitive, multiple seasons, etc, you should check out American miniseries. There has been a renaissance of them in recent years—outstanding limited series like “Watchmen”, “Chernobyl”, “Mrs. America”, “Little Fires Everywhere”, “The Queen’s Gambit”, etc. All of these are 10 episodes or shorter and have complete story arcs. One could even make the argument that the best form of American TV right now is miniseries, not dramas or comedies, and attract A-list actors, writers and directors.",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s almost like they looked at the basic structure of kdramas and decided to copy it...",
                    "score": -3,
                    "author": "setlib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not true. The US has been airing mini-series since at least the 1970s with huge hits like \"Roots\". They lost popularity for a while but came back strong on HBO, FX and now on various streaming platforms. Plus, some U.S. miniseries are as short as two episodes.\n\nhttps://www.cnbc.com/2019/07/24/miniseries-may-be-the-competitive-edge-streamers-are-looking-for.html",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh sure. I grew up loving those Sunday evening mini-series like Shogun and Thorn Birds. But there were never very many of them, and they disappeared off of the public television channels long ago and still haven’t come back to the major channels. Recently cable networks have started producing things that are similar in structure but I think it’s more reasonable to think they were influenced by the more recent white-hot kdrama market than a handful of ancient American tv mini-series.",
                                    "score": -3,
                                    "author": "setlib",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It seems like the American miniseries boom was sparked by Ryan Murphy's FX anthology series \"American Horror Story\" in 2012 and later \"The People vs. O.J. Simpson: American Crime Story\". Since the former won a bunch of Emmys, FX had incentive to develop more miniseries such as \"Fargo\". In 2012, K-dramas weren't nearly as popular in the US as they are now, so I don't think it played a factor.\n\nhttps://www.theverge.com/2016/9/18/12947460/emmys-awards-2016-limited-series-miniseries-history\n\nhttps://www.hollywoodreporter.com/fien-print/emmys-how-limited-series-went-deathbed-marquee-category-1306549",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To add to this, in US media the mini-series format are treated as high-budget, long-endeavor projects. The industry considers them as long movies essentially. That is why until recently mini-series are either premium TV or seasonal specials (see all of the \"A Christmas Carol\" renditions over the years).\n\nThe mini-series format has largely been pushed out of broadcast TV because the networks found better profit margins with serial TV. By the 90s, this caused the mini-series format to find a home in premium TV like HBO. It was not until the 2010s when more film talent began to work on TV shows that the mini-series format has found its way back into broadcast TV.\n\nK-dramas are fantastic, but their influence on the Hollywood industry is still very minor. Netflix themselves have always been interested in the mini-serial format. Streaming services don't have the infrastructure to create TV on the scale of broadcast networks. They are happy to just buy completed productions or green-light ones that no network has picked up. This new demand has really out the productions that are somewhere between blockbusters/HBO and indie projects.",
                                                    "score": 4,
                                                    "author": "koreaboo__waterloo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't wait for them to make more movies like master, the witch and the king.  I love the fun fantasy like mystic pop up and uncanny counter but more of The guest and Posessed would be nice.  Also Svaha and Divine fury. Lastly keep the actors that hot.",
            "score": 4,
            "author": "heycanwediscuss"
        },
        {
            "level": 0,
            "comment": "The one good thing about Netflix kdrama is that you don't see product placements",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not here for serialisation, westernisation and constant dark cliff hanger crap Netflix does. Especially as they can and will cancel whenever they feel like it and leave everyone hanging.",
            "score": 20,
            "author": "real_highlight_reel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not to mention their comically terrible subtitles.",
                    "score": 12,
                    "author": "fellawoot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In some cases when Netflix gains Viki loses and that is bad news for everyone who prefers the viki platform. An example of this is their licensing of all JTBC shows, which to me means I’ll never get to watch them with quality subs. If you’ve had an opportunity to compare, you begin to really feel the loss of nuanced subtitles. Korean is jam-packed with puns and I literally had no idea what I was missing til I got off Netflix. I feel tragic about this aspect.",
            "score": 7,
            "author": "Fritzie_cakes"
        },
        {
            "level": 0,
            "comment": "Still waiting for Vagabond season 2",
            "score": 3,
            "author": "DreamBIG66266"
        },
        {
            "level": 0,
            "comment": "Omg, I didn't even know about any of the series that were going to come out this year. They all sound great and not like the typical Kdramas! I think Netflix making more Korean content is great, As they have more creative freedom with their content and can tell more mature stories.",
            "score": 3,
            "author": "Huffpuff0531",
            "replies": [
                {
                    "level": 1,
                    "comment": "I must disagree with this. Mature stories abound in Korean dramas pre-Netflix. And far more mature and nuanced than anything I’ve seen in the US. Your view is actually pretty disturbing to me. Historically Americans don’t really have a history of improving other cultures. We are basically bulldozers and I’ll keep standing against that.",
                    "score": 2,
                    "author": "Fritzie_cakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you completely misinterpreted what Huffpuff0531 was trying to get at... They were using the word \"mature\" as in how games are often rated M for \"mature\" due to the content (violence, cursing, etc) not being suited for a younger age group. It has nothing to do with intelligence or emotion or how good the writing is. \n\nAlso, they weren't wrong in saying that Netflix guarantees writers \"more creative freedom.\" Writers who work with Netflix have more control over the direction of their work because they aren't bound by a set episode length standard and don't have to abide by censorship laws that Korean TV networks set. For example, lots of Korean channels require things like knives, cigarettes, bloody body parts, and sex scenes (aka \"mature content\") to be blurred out, toned down, or completely admitted, so if you wanted to create a dark type of story for older audiences that featured any of that stuff, having to blurr it out or remove it could effect the creative vision of the writer and the story.",
                            "score": 2,
                            "author": "eleece88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We can disagree on the second point but on the first I’ll stand by it. I mean mature in the same way. There is plenty of sexual content in k-dramas. Maybe not exactly the same but I don’t need to see some lady romping around with her partner all top off, bra on American style to understand that they are getting it on. I mean that it is both mature in content and the handling of it. And some of that stuff is sexier than anything I’ve seen before. Though in fairness I think I started finding American sex scenes hilarious instead of hot a long time ago and would hate to see K-dramas go down that path.",
                                    "score": 2,
                                    "author": "Fritzie_cakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was saying exactly what u/eleece88 explained. I'm not sure what is \"disturbing\" about my view. That I want something creative and a mature storyline? None of the K-drama's that Netflix has produced are alike in any way. They all tell a unique \"out of the box\" story.  I wasn't referring to \"mature\" as in sexual content explicitly. I'm talking about more developed relationships. I'm tired of the whiny, teen (sometimes even adult) relationships that take 15 episodes to even start. I want real adult relationships and stories to be told without censorship and only Netflix has shown capable of that up until now. I love Non-Netflix Kdrama's but I also love what Netflix is able to do with them. Again, I'm not sure why that \"disturbs\" you.",
                                            "score": 2,
                                            "author": "Huffpuff0531",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’ll just have to politely disagree. There are so so many stories that have been created and executed as you described. I was disturbed by the idea that putting our American stamp can improve something so drastically. Something that isn’t broke.  If you truly believe only Netflix is capable of creating what you’re looking for, your sample size is small or your understanding of what Netflix has actually produced isn’t correct. Sure there are plenty of stories as you describe. The whiny relationships which take 15 episodes to start. To me there are infinitely more which do not fit that description. (And as an aside I’m also curious to know at what moment you consider a relationship to ‘start’, as that is somewhat subjective). I am curious to know which k-dramas Netflix has produced fit the description you are looking for, as I do think it’s possible we just aren’t on the same page here. As far as I know, though Netflix calls many programs ‘originals’, currently most shows are only licensed by Netflix, not produced. I know Kingdom and Extracurricular were for sure, and I’m sure there are some others. But the majority are actually licensed shows produced and created by Korean networks. This will change in the coming year as they have moved heavily into actual production. My concern and my feeling of being disturbed is this: the idea that Americans will go into an industry that is already thriving and improve it. This is American imperialism and I’m against it for largely ethical reasons, but also selfish ones: I am simply in awe of Korean shows and find American television to be insipid and derivative as a whole. I don’t want Korean shows to become Korean/American shows. Suggesting we can go in with fat wallets and improve something that is already magnificent is disturbing to me. That’s my pitch.",
                                                    "score": 1,
                                                    "author": "Fritzie_cakes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I never said Netflix will make \"better\" dramas or I can ONLY enjoy dramas on Netflix. I love korean television as it is, I also love Netflix produced shows and enjoy the Idea that they might make more and be free to let loose a little bit. We all have different opinions, I respect yours. I like a little spice and it seems you like mellow. It's all personal preference.",
                                                            "score": 1,
                                                            "author": "Huffpuff0531",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m increasingly curious to know which Netflix produced shows you are referencing.",
                                                                    "score": 1,
                                                                    "author": "Fritzie_cakes",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I am not just talking about dramas. I am talking about \"content\" for example: Busted, Twogether, Sweet Home, Persona, Kingdom, Extracurricular, The School Nurse Files, My First Holo Love and the upcoming Silent Sea and All of us are dead. They might not have a huge library but I've liked all of them and am excited for their upcoming ones.",
                                                                            "score": 1,
                                                                            "author": "Huffpuff0531",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I suppose you’re a fan of things which didn’t grab me, and that’s ok. I couldn’t watch kingdom and sweet home as I have a low tolerance for scary stuff. My concern continues to be any thoughts of an American hijacking of Korean content. With their renting of so many sound stages this is only increasing. While I know this is a complex issue, and not entirely new (a lot of this has happened because of China pulling out), I don’t care for an homogenized world. I really *really* hope I’m wrong about Americanization, I’m just worried. I’ll just add that I truly don’t have a preference of of tame content. I just think actual relationship development is exactly what sets kdrama romance apart from American shows. If creative control remains in Korean hands, much of my concern diminishes. And if Netflix can fix their subtitle problems I will also soften on this topic.",
                                                                                    "score": 1,
                                                                                    "author": "Fritzie_cakes",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally, I am not a fan of Netflix and I watch my K-Dramas on other platforms. I like the current trend where K-dramas are 16 episodes or less, instead of stretching for multiple seasons. The content in Netflix also quite Westernised - majority are either made in the West or made to appeal to a Western audience. Korean dramas are instead made to appeal to a domestic/Asian audience in general, which makes it more relatable for me. The current system of multiple Korean companies competing amongst themselves to creates dramas, actually works quite well and produces good content. Netflix obviously wants to ride on this trend, but I hope they don't end up spoiling the K-drama market altogether.",
            "score": 7,
            "author": "SherbetLimau",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't say I agree. So far, the exclusive Netflix Korean shows have been extremely delightful. I don't mind multiple seasons of a show as long as they are of good quality. Maybe you can expand on what part of the Netflix Korean dramas were \"unrelatable\" for you, because I don't quite understand how it is any different.",
                    "score": 3,
                    "author": "mynthe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The current \"Netflix exclusive\" K-dramas we see were still created using the existing system, where Korean companies create it and Netflix buys the overseas rights. The dramas were intended to be first shown to a domestic audience; Netflix just got the exclusive license to broadcast overseas. I am talking about the Netflix original series (all Western of course) which I find quite unrelatable.\n\nThe humour and interactions in many Western shows is a bit of the \"in your face\" kind. There is not a lot of focus on the emotional aspects, instead reliance is more on catchy dialogues and special effects. There are also certain things in K-dramas (like the stomach growling sound or the way they show family relationships) which makes it a lot relatable to me. (Of course, this is generalising a bit, but companies usually make decisions based on general characteristics)\n\nPersonally, I always prefer content to be produced and funded by the local companies of that region, as it helps to retain a degree of authenticity.\n\nThe scenario I am afraid of is where Netflix starts creating \"original\" series which are meant for Netflix only (skipping over the domestic TV channels). This gives Netflix more influence over the storyline and other creative aspects. The downside is, they might just tweak it to appeal to a Western audience.",
                            "score": 7,
                            "author": "SherbetLimau",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Netflix has already done this to great acclaim with Kingdom and Extracurricular.\n\nKorean dramas are very popular in SEA and OCE regions than the west. The continued investment into Korean studios is to build their presence in these regions. The aim is less to bring Kdramas to the West but to solidify Netflix's presence in the East.",
                                    "score": 7,
                                    "author": "koreaboo__waterloo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly depends, personally. Serial shows like Psych is something enjoy a *lot* and was actually sad that there wasn’t more than 8 seasons of it, but that’s because I find the show was written well and its brand humour was maintained throughout the entire thing.\n\nBut yes, so, so little shows can do that well and should be left as a single season. Or a few seasons, if the plot really needs it.",
            "score": 2,
            "author": "Nevvie"
        },
        {
            "level": 0,
            "comment": "Heell yees\n\nWhat got me into korean cinematography in the first place was korean suspense thrillers. They are a vibe. A tale of two sisters, the ghost, the host, the suspect, train to busan, parasite etc. And i love cute k dramas. I love most of what netflix has produced for tv dramas",
            "score": 4,
            "author": "Cstpa1"
        },
        {
            "level": 0,
            "comment": "If someone told me 2 years ago that I'd become a kdrama fan, I'd have snorted in derision yet now it's probably about 80pc of what I watch on Netflix right now.\n\nHappy to hear about this investment that's for sure :)",
            "score": 3,
            "author": "antantantant80"
        },
        {
            "level": 0,
            "comment": "Usually when there's a new good Kdrama, the top 10 in my country usually have at least 1 K-Drama in there. On really good seasons, at least half of the top 10 are K-Drams. Good move to invest in K Content for sure.",
            "score": 4,
            "author": "giedonas"
        },
        {
            "level": 0,
            "comment": "I'm really worried that Netflix is going to mess this up, and that it will have lasting, negative effects on KDramas overall. I'm probably overreacting, but I have misgivings.\n\nThings that already annoy me/contribute to my cause for concern:\n\n1) Their subtitles are not great. I don't feel like this needs elaboration.\n\n2) They've gotten into creating dramas that are set up to add another season. I'm worried that we're going to end up with another drama like Vagabond, which clearly set up for a second season that is not going to happen. (I believe Vagabond was a Netflix production, but could be wrong).\n\n3) I think my biggest worry is that they'll try to Westernize the genre. \n\nOn a brighter note: They've had some really stellar content and I'm hoping that will continue. Busted is so amazing, and I hope they will be able to continue to make it. I think there's a bigger budget for some of these dramas which should improve the production value. There's also been a lot more variety available, which seems like a positive.",
            "score": 4,
            "author": "iccebberg2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I shared many of the same worries originally but after reading more about Netflix, I don’t think all of them apply:\n\n1. You’re right. No argument there. The main thing Netflix offers is subtitles in a wider variety of languages than Viki, and occasionally dubbing for people who really need that to engage with the content.\n\n2. Vagabond was produced by SBS and aired on Korean tv first, then merely distributed later by Netflix, but not in any way written by them. Similar thing for many of the other disappointing series lacking a second season like Arthdal Chronicles — although Love Alarm is actually getting their season 2, so yay! Originally I thought the trend toward second seasons was Netflix’s fault because the timing of it seemed to overlap with their increasing influence in the kdrama market but after some research I think it was simply coincidence.\n\n3. Read [this compilation of interviews with the creators of **Kingdom**](https://www.reddit.com/r/KDRAMA/comments/ls5cwi/netflix_to_spend_500_million_on_korean_content/gouib71/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3), one of the few dramas so far to be completely funded by Netflix, and see if that makes you feel better. From the interviews I’ve read so far, Netflix has not tried to interfere creatively with the dramas they’ve funded at all, and in fact they’ve opened up a lot of opportunities to escape censorship that writers and directors have chafed against. Hopefully - and history would indicate - Netflix recognizes that they shouldn’t mess with a good thing!",
                    "score": 2,
                    "author": "setlib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2) I didn't realize the second season thing was directly from some of the Korean production companies. I'm really worried that it's an attempt to play to a global audience, to make dramas more like shows in the West. It also makes me think of all the anime fans that get stuck waiting for second seasons that never come. I have serious trust issues about this second season thing. It probably stems from the trauma inflicted by Vagabond. \n\n3) I forgot that Netflix produced Kingdom. It's an amazing drama and if more of the dramas that they produce are as well done as Kingdom, then I'll be happy.",
                            "score": 2,
                            "author": "iccebberg2"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I forgot to respond to your mention of **Busted** - I fell in love with that show too! I had never watched any Korean variety shows before and I thought it was clever and hilarious. So I looked up two of the leads, Yoo Jae-seok (the goofy leader always wearing the dorky detective hat) and Lee Kwang-soo (the tall “giraffe” with the weird camera backpack) and realized the two of them have actually been co-starring in a variety show that has come out with weekly episodes for a decade called **Running Man**. You can watch many of the episodes right on [Kocowa’s website](https://www.kocowa.com/en_us/channel/542928/Running-Man) but they’re also on Viki if you have the Pass. I can’t recommend Running Man strongly enough! It is hysterically funny and packed with many games, races, and challenges similar to Busted, just without any of the strange forced-acting parts because it’s all genuinely unscripted. Many episodes have guest stars so you can check Wikipedia to find one with your favorite actors or idols as a starting point. But the real unique strength of Running Man is its longevity, the fact that the main six core members have remained the same for ten years and their genuine love and friendship shows in every episode - along with their clear annoyance and teasing with each other as well, just like a real family. A lot of the dynamics and games in Busted make a lot more sense after seeing Running Man, so please give it a try! Just keep in mind that the most recent (past six months) episodes are really different due to Covid restrictions because they can’t go out in public as much as they normally would. But the earlier episodes especially would have them filming across entire buildings and small towns in their various scavenger hunts and elimination races which are both hilarious and thrilling!\n\nEdit: typo",
                    "score": 1,
                    "author": "setlib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're right, I do enjoy Running Man. I'm a huge Running Man fan, which is why I enjoy Busted. I actually really enjoy the storyline and scripted parts, but I think a lot of it is still improv.\nBusted is done by the same production company that originally did Running Man up until 2016. After 2016, Running Man changed quite a bit. It's still really good, but I prefer the original producers.\nIn Busted, I really enjoy the storyline format, the characters they created and the challenges. I see elements of some of my favorite things from RM in Busted.\n1) Calling Lee Kwang Soo Giraffe originates in RM. \n2) There's this guitar sound bite they use that is directly from RM. They used it whenever unfortunate events happened to LKS, and they use it in same manner in Busted.\n3) The mission cards they received in the first season and the detective symbol in the first season are used very similarly to how these were used in RM\n4) This is a really nerdy observation, but the episode in season one that starts out in hotel room also reminds me of RM. They used to have hilarious challenges whenever they were on location and had to stay in a hotel. They would have the cast wake each other up. It was hilarious.\n5) How the producers treat LKS in season two and three is also similar to the on air persona that he had in RM. \n\nI know I've noticed other things like a weird conspiracy theorist. But in addition to the fact that Busted is just super awesome, I love that it brings me nostalgia for the earlier RM seasons.",
                            "score": 3,
                            "author": "iccebberg2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yay another Running Man fan! I keep waiting for Kim Jong-kook to make an appearance as a villain in Busted, that would truly make my life complete. Check out this [alignment chart](https://www.reddit.com/r/runningman/comments/lry5y1/running_man_dd_alignment_chart_do_you_agree_with/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) comparing the cast members to the Dungeons &amp; Dragons system of characterizations, I think you’ll enjoy it!",
                                    "score": 2,
                                    "author": "setlib",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I would absolutely love it! D&amp;D and RM! My nerdy passions have collided and my mind is blown!!!\n\nKim Jong Kook in Busted would be so awesome!!!!!! He was in the first season of Sound of Your Heart, and it was the best!!",
                                            "score": 2,
                                            "author": "iccebberg2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with you 100 fold.",
                    "score": 2,
                    "author": "Fritzie_cakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is everyone getting mad about multi season shows? Everything on this list is a new show monus the special episode for Kingdom but its just 1 episode not a season 3. I understand that Kdramas are typically 1 season but everything on this list is a new show so why are people getting mad?",
            "score": 13,
            "author": "Hexus_Dragonz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it's weird especially since even the people who watches kingdom wants those new season.",
                    "score": 6,
                    "author": "salcedoge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw someone complain and then say they wanted Signal to get a season 2 lmao",
                            "score": 6,
                            "author": "Hexus_Dragonz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly! Make it make sense! Plus shows like Extracurricular are standalone and don't need a second season. They can make both the traditional 12/16 episode drama or keep licensing them (run on, vincenzo, it's okay not to be okay) and do the serialized stuff on the side (kingdom/sweet home). The issue with Signal is bc the writers/directors/production are based in korea (tvn i think) not Netflix. Vagabond is SBS, so the same issue there. I don't know what power netflix would have besides funding the production. But otherwise I'm not complaining, as long as netflix keeps providing the korean network produced stuff alongside the original content, this is great news.\n\nAlso the budget that netflix provides allows for way more ambitious genres like sci-fi with space sweepers and the silent sea. I like the crazy big budget survival/darker shows too so i'm hyped for squid game.",
                    "score": 3,
                    "author": "secretlygreatly143",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I havent seen Signal yet so idk but I know people want another season of Its Okay to Not be Okay. It is the one of the most popular things if you google the show but now that I finished it like an hour ago a second season woumd ruin the show. I also havent seen Kingdom or Sweet home but I feel like both shows maybe would have been fine if they did 1 season instead of 2. I feel like Nerflix knows that serial Kdramas cant have more than 1 season because people wont watch because they dont want it to turn into a multi season show so they wont do serial shows like that",
                            "score": 1,
                            "author": "Hexus_Dragonz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it definitely depends on the popularity of the show. Like right now Penthouse is the hottest show in Korea so it's starting a second season, also the same reason why Voice and Stranger (Secret Forest) got one too. Sweet Home ended on an ambigious ending that definitely sets up a season 2, and Kingdom is very popular so it warrants more content.",
                                    "score": 1,
                                    "author": "secretlygreatly143"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I also hope that they will start spin-off series for some of our favourite second leads.",
                            "score": 1,
                            "author": "mynthe"
                        },
                        {
                            "level": 2,
                            "comment": "What's the issue with Signal? The Kdrama from a few years ago?",
                            "score": 1,
                            "author": "koreaboo__waterloo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "None of the listed show concepts really speak to me but I am happy for all lovers of Korean media out there. Hope they stick to single season formats and don't drag things too much.",
            "score": 3,
            "author": "FuriousKale"
        },
        {
            "level": 0,
            "comment": "Standalone Kingdom episode 😮",
            "score": 1,
            "author": "chromelogan"
        },
        {
            "level": 0,
            "comment": "Super excited about this.\n\nBut also, where is my Vagabond Season 2 Netflix? I'm still salty over how it ended.",
            "score": 1,
            "author": "The_Real_TK"
        },
        {
            "level": 0,
            "comment": "Yeah they are dropping a ton of k drama stuff",
            "score": 1,
            "author": "oppaxo"
        },
        {
            "level": 0,
            "comment": "Good!",
            "score": 1,
            "author": "Sweetdeerie"
        },
        {
            "level": 0,
            "comment": "LOVE THAT",
            "score": 1,
            "author": "jjiyulee"
        },
        {
            "level": 0,
            "comment": "As they should!\nWho's excited for Love Alarm season 2 in march!!!!????",
            "score": 1,
            "author": "pip3layo_"
        },
        {
            "level": 0,
            "comment": "Apologies for my ignorance, how don't know how the system works but let me get this off my chest. Netflix needs to hurry up and upload Season 3 of VOICE!!!",
            "score": 1,
            "author": "PeregrineSmalls"
        },
        {
            "level": 0,
            "comment": "I'm so glad for an alternative to terrible American sitcoms and \"dramas.\"\n\nForeign content is the primary reason we subscribe to Netflix. Finally, someone is realizing that their is an audience for this.\n\nAmerican primetime television hurts my brain.",
            "score": 7,
            "author": "Hyperion1144"
        },
        {
            "level": 0,
            "comment": "I just hope they reduced the number of running scenes. It's exhausting to watch as a viewer.",
            "score": 3,
            "author": "ShockernonShaken"
        },
        {
            "level": 0,
            "comment": "Honestly I'm more than unimpressed with Netflix's kdramas. I'm just really glad Netflix is making them more popular and available to a bigger audience",
            "score": 4,
            "author": "WWhandsome"
        },
        {
            "level": 0,
            "comment": "Great news, but my big question to Netflix is :\n\nAny chance of them providing an English audio dubbed option? \n\nMy mum is unable to follow subtitles when watching TV but she is happy to watch a dubbed programme. I think this would be a great way of making K drama more inclusive, along with the usual subtitled options.",
            "score": 2,
            "author": "WittyMasterpiece",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have some kdramas with dubs but unfortunately not all..My sister has really poor eyesight so I always check out if it's dubbed whenever a new kdrama comes out",
                    "score": 2,
                    "author": "salcedoge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's great to know. Do you have any examples of dubbed K-dramas on Netflix?",
                            "score": 1,
                            "author": "WittyMasterpiece"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We'll see how this affects the whole industry. \n\nI hope they step up their subs, Viki's are so much better. I always skip Netflix when the same drama is in both platforms.",
            "score": 2,
            "author": "Twarenotw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, can they please invest some of this money in getting better subs! I just started ep 1 of *Vincenzo*, and it's obvious that a lot of money was spent on making an impressive opening sequence, but the effect was diminished by subpar subs. (Ex: they said \"the car will explode before you *get off*\" instead of \"... *get out*\".)\n\nAn even more egregious error was the incorrect translation during a key scene in a recent drama in which the FL had said \"because I love you\", and Netflix translated it as \"because you love me\". The error arose because of the way pronouns are frequently omitted in Korean, but a good subber would've gotten it right because of the context. (So ironic given that the character was a translator herself!)\n\nThey should at least have someone who's highly proficient in both languages proofreading the subs.",
                    "score": 2,
                    "author": "jin-jja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tit's obvious that a lot of money was spent on making an impressive opening sequence, but the effect was diminished by subpar subs.\n\nNot sure how TVN spending money on the opening sequence has any relation to Netflix's poor translators? Netflix didn't create Vincenzo.",
                            "score": 3,
                            "author": "funnyunfunny",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. There seems to be a lot of folks who don’t understand this. Just because it says Netflix originals it doesn’t mean they had anything to do with it. It mostly means you can’t watch it on other platforms.",
                                    "score": 2,
                                    "author": "Fritzie_cakes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, I know that Netflix is just distributing *Vincenzo*, not producing it, which is why I didn't say \"they spent a lot of money...\". But I can see how my wording was confusing. What I meant was that Netflix's subpar subs diminished (at least for me) the watching experience. I was eating up the gorgeous cinematography, then I started noticing how the subs could've been better, which was distracting. tvN spent a lot of money to create a blockbuster opening, and it's a shame that people like me stopped being immersed in it (even momentarily) because of a poor translation.",
                            "score": 1,
                            "author": "jin-jja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Got it! Yeah, your wording didnt specify you meant tvN, I totally get you.",
                                    "score": 1,
                                    "author": "funnyunfunny"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Viki has no 4K which is a huge problem for me, but Netflix's 4K is so low quality as well :( depressing.",
                    "score": 1,
                    "author": "Charuru"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I slept on this topic and woke up feeling disturbed by it. This is going a little deep but: Americans have a grotesque history of colonialism. Even as we have (mostly) stopped taking physical colonies we have maintained it culturally via money. To me this is a startling example of that behavior. Many comments here suggest that Netflix can only improve Korean content. I think that is a dark and scary view. Americans aren’t the end all of culture. And we aren’t all here because we appreciate American tv so much. Korean dramas work beautifully and are an international standard of quality. Seeing them diluted to Netflix standards, whether via low quality or even misleading subs, or a different style of focus on relationships is not something I support. I have been (very slowly) learning Korean and feel I need to step it up because the more I learn the more I know how much I miss when I’m watching Korean shows on Netflix. I think it is a deep ethical problem to consider that this broad American stamp is actually improving the content of something Koreans are masters of.",
            "score": 3,
            "author": "Fritzie_cakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you've raised an excellent point, and it's always good to be skeptical. I was originally alarmed as well when Netflix started dabbling in kdramas, but over the last year I've changed my mind for two reasons:\n\nFirstly, Netflix has a greater global reach than streaming services like Viki/Kocowa which are only familiar to people who are *already* fans of Asian drama. Once Netflix started picking up more kdramas I was finally able to start recommending them to coworkers, family, etc. who were only willing to give them a try because they were already used to watching things on Netflix. Many of the new members of this sub are only here because they randomly stumbled on a kdrama on Netflix and got hooked. Which is a good thing!\n\nThe second reason I'm growing more comfortable with Netflix is that I haven't seen any evidence of them interfering with the creative content of the dramas they've financed. Remember, so far they've only actually produced a handful of titles like **Kingdom** and **Extracurricular**, all the other titles on their platform are traditionally produced kdramas by Korean tv or cable channels and have no creative relationship to Netflix.\n\nI've read several interviews with the writers of **Kingdom** and **Extracurricular** and I haven't seen any complaints about Netflix interfering in any way with their creative vision. To the contrary, they say they've been able to take creative risks that were forbidden by the Korean network regulations. Take a look at some of these interviews and see if they make you feel better?\n\n[Writer finds a home for her zombie fantasy: Kim Eun-hee says Netflix was the right place for ‘Kingdom’](https://koreajoongangdaily.joins.com/2019/02/07/movies/Writer-finds-a-home-for-her-zombie-fantasy-Kim-Eunhee-says-Netflix-was-the-right-place-for-Kingdom/3059132.html)\n\n&gt;Kim believes Netflix was the perfect platform for her zombie world. **“Netflix did not interfere with anything. No matter how I wrote the story, or how many I killed, they just left me to make the decision.”** Kim added, “In that sense, I think Netflix was the most appropriate platform to be showing [‘Kingdom’.]” **Netflix also didn’t limit any elements of Kim’s storytelling, which had previously been the case at local television networks.** For example, Korean broadcast networks blur knives when they are on screen. “If knives are blurred in a story revolving around zombies, I don’t think it would seem probable.” “I’m not saying that Netflix is [better,] but it was a perfect platform for the content of this kind of genre.” The streaming platform also provided Kim the chance to write her story without having to worry about advertisers. “I didn’t have to care about product placement. In 2011, when I started working on the cartoon for this story, I thought it would be impossible to put it on air, which is why I opted for cartoons.” Kim added, “After ‘Signal,’ I was contacted by Netflix and was offered [to make the cartoon into a drama] and I accepted it.”\n\n\n[“Kingdom” Screenwriter Gives Details On The Upcoming Special Episode](https://www.koreaboo.com/stories/kingdom-upcoming-special-episode-details-screenwriter/)\n\n&gt;\"I was worried that Kingdom would be foreign to others, but I actually think there was more synergy abroad. Netflix has become a supporter and ally that is fearless, disruptive, and unbiased when it comes to new attempts.\" —Kim Sung Hoon\n\n\n[Writer, Director of South Korean Zombie Drama 'Kingdom' on Global Response and Coronavirus Parallels](https://www.hollywoodreporter.com/live-feed/netflixs-kingdom-creators-talk-releasing-zombie-drama-coronavirus-1290604)\n\n&gt;*What did Netflix tell you about the response to the first season worldwide? What surprised you?*\n&gt;**Kim:** Through social media and online comments, I felt extremely grateful to see even the smallest of roles getting so much love. What was interesting with season one was how global fans reacted and related to the Korean elements in the show, such as Confucian values, hanbok (traditional Korean attire), hanok (traditional Korean houses) or the palace. I also really enjoyed watching the series dubbed in other languages.\n&gt;*Kim, I saw another interview you did where you said you had pitched the idea for Kingdom but no one in the local industry was really into the idea of a zombie show, and Train to Busan was what made the idea more appealing. Can you expand on that?*\n&gt;**Kim:** Before Train to Busan, even in the film industry, the dominant notion was that the zombie genre was a niche genre that appealed to only a small group of fans. This was even more so for drama series. In Korea, TV dramas are usually aired on the so-called public broadcasting stations, and these channels are usually watched by families, meaning that shows are usually rated lower for a wider audience and are evaluated with stricter rules. Smoking, curse words are all not allowed, and while swords are OK, knives have to be blurred out. Needless to say, gory scenes that show harming of dead bodies were taboo. Under such circumstances, it was nearly impossible for a zombie show in which zombies can only be stopped by decapitation to be made into a drama series!\n\n\n[Netflix attributes popularity of ‘Kingdom’ to technological innovation](http://www.koreaherald.com/view.php?ud=20190206000121)\n&gt;\"Another factor that helped the series to flow naturally was a team dedicated to translating Korean into different languages and dubbing with accents that represent each character’s class and role. Apart from English, “Kingdom” has been **dubbed** into 12 languages including Chinese, Japanese, Spanish, French, German, Portuguese and Turkish.\"\n\n[‘Kingdom’ Artists Make Medieval Zombie Tale Seem Real in South Korean Netflix Series](https://variety.com/2019/artisans/production/netflix-south-korea-zombie-series-kingdom-1203123242/) - Talks about accuracy in costumes and settings.\n\n[Kingdom creator wants zombie series to run for 10 seasons](https://www.philstar.com/entertainment/2020/03/17/2001367/kingdom-creator-wants-zombie-series-run-10-seasons)\n&gt;Writer Kim Eun-hee said, “I truly didn’t expect the kind of response we had for the previous season. I tried very hard to bring out the most Korean elements in the series, which I think audiences found interesting and liked.”\n&gt;When asked about the difference between working on Netflix series and a South Korean drama, Kim Eun-hee said, “First of all when it comes to working with Korean terrestrial broadcasters, we are never free from the pressure of ratings. And there’s also the factor of having instant and very immediate feedback from the viewers, which sometimes results in having to make revisions to the script and whatnot.”\n&gt;She continued, “There’s, of course, the freedom of expression. So, things like decapitation, for example, that will never be able to be something that will be shown on TV. In Korea, you know now, nowadays only, you also have to work, even if you were just holding a knife, that has to be blurred. So that was a big difference.”\n&gt;The first season was released in 190 countries with subtitles in 27 languages. It was also dubbed in English in some countries. Director Kim Seong-hun admitted to being initially very worried about dubbing. He said, “I had some reservations thinking, this isn’t a contemporary story, and seeing actors wearing Korean traditional costumes speaking in a very different language can be very jarring for the viewers. But in the end, I was surprised to see how natural the dubbed versions sounded.\n&gt;“I realized that language is ultimately only a method of delivering the essence, which is the work itself. A great artist you may know (Oscar-winning Parasite director Bong Joon-ho) recently spoke of a one-inch-tall barrier of subtitles, and we reduced the barrier to one centimeter with the subtitle and dubbing service. It’s tailored to an individual customer’s needs, so you can choose to watch the series in a dubbed version if you feel burdened by subtitles or enjoy the original version if you’d rather listen to the actors’ voices. I hope audiences enjoy the flexibility of having both options.”\n&gt;So, the question now is: Will there be a Season 3? Writer Kim Eun-hee teased, “As you all know, production of Season 3 is dependent on the success of Season 2. If you support and love Season 2, I’m sure we’ll be able to bring you Season 3 with a greater world. I personally hope that the series continues all the way to Season 10.”",
                    "score": 2,
                    "author": "setlib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately I can’t handle the content of Kingdom (I have a very low tolerance for scary things). But I did read through your points. It sounds like a good example of a best case scenario and if things continue along a good path in that way I don’t have a problem with it. In general my replies are directed towards the ‘we are actually making things better’ crowd who have stated that in their replies to this news item.  \n\nI’m aware that in general shows are licensed as opposed to produced, and that aspect both relieves and troubles me. When a show lands on Netflix we as viewers often lose the ability to watch it with subtitles that are actually correct. So much is lost in the Netflix translations. I know that the viki system is imperfect (a whole other worthy topic of address) but it is in general much more correct, much more respectful of the culture, and maintains the comedy of language that is so pervasive in Korea. Netflix, with rare examples to the contrary, has practically *done away* with hierarchical language. It is something so important to the relationship culture and many viewers lose out on understanding. I believe I liked it better when Netflix was a gateway to K-drama, as opposed to a full on platform. It happened for me like that, with an accidental viewing of Reply 1994. I ripped through what Netflix had to offer and found Viki. I’ve already been through Viki loss of content via Netflix and I’m still bummed that I can’t watch Reply 94 with better subtitles. Having watched 88 on both Netflix and Viki it is obvious that it is a richer and more cultural experience on the latter. I’m currently watching the wonderful Chief Kim (Good Manager) on Viki and it is easy to see what would be lost in translation. I’m convinced it would be much less compelling on Netflix. The explanation of dialectal comedy, the extensive exploration of hierarchy, the many many puns. These would just be lost and it’s like half the show’s magic. \n\nThis being said: if, and this is a long shot, Netflix changed their tune with regard to highly Americanized subtitles, and translated the music, my opinion would soften considerably. Let’s talk in two years and see where things have landed. I am skeptical.",
                            "score": 2,
                            "author": "Fritzie_cakes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck off Netflix. Stop making multi season kdrama. They are lossing originality and too much western influenced these days.",
            "score": -2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Makes sense. They basically already own the entire Asian (minus China) streaming market at this point so no reason not to take advantage of the region's Kdrama obsession.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Minus india too. They are not doing very well here. There is much more content on amazon prime than Netflix.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn't know that. Interesting.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "netflix can go fuck itself lmao",
            "score": -4,
            "author": "moomoomilky1"
        },
        {
            "level": 0,
            "comment": "I hope they stick to one season per show",
            "score": 1,
            "author": "Impossible_Ice_3113"
        },
        {
            "level": 0,
            "comment": "Signals was great but Sisyphus was a mess.",
            "score": 1,
            "author": "wholemonkey0591"
        }
    ]
}