{
    "id": "13p7llu",
    "score": 257,
    "title": "I love butchering! There is something so wholesome about knowing exactly where what you eat comes from and how it is processed.",
    "author": "UpNorthPaige",
    "date": 1684799298.0,
    "url": "https://www.reddit.com/r/homestead/comments/13p7llu",
    "media_urls": [
        "https://i.redd.it/jn3n5vabhi1b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "That cut looks thoroughly dry-aged.",
            "score": 30,
            "author": "Bonuscup98"
        },
        {
            "level": 0,
            "comment": "One of the guys I hunt with used to be a butcher and watching the difference in how he breaks down a carcass vs how I break down a carcass was enlightening and a little embarrassing.  Mine looks like roadkill that got run over by a DOT mowing crew, his looks like a Food Network promo picture.  I ain't even going to talk about how fast he is.",
            "score": 44,
            "author": "Archaic_1"
        },
        {
            "level": 0,
            "comment": "I never wanted to learn how to hunt as a kid, but i had no problem helping butcher all the deer and birds etc. It's almost the same as gardening or foraging in that something you worked for and saw start to finish just tastes better lol.",
            "score": 33,
            "author": "Zisyphus0"
        },
        {
            "level": 0,
            "comment": "Where can one learn this power?",
            "score": 5,
            "author": "Eifand",
            "replies": [
                {
                    "level": 1,
                    "comment": "Butchering?",
                    "score": 3,
                    "author": "UpNorthPaige",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup. I’m a city dweller. Only meat I’ve ever handled is already butchered.",
                            "score": 7,
                            "author": "Eifand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can get a pretty good idea of how to do it on YouTube. Bearded Butchers have some of the best tutorials I've seen on the subject. As with most things though the best way to learn is to do it.",
                                    "score": 13,
                                    "author": "illbeinthewoods"
                                },
                                {
                                    "level": 3,
                                    "comment": "You could start with something like a whole chicken. Should be able to find them in pretty much any grocery store. They're pretty easy to break down and would be good option to just get comfortable with handling and cutting meat, finding joints, etc.",
                                    "score": 4,
                                    "author": "EarthSlapper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Whole ducks are another great way to start. Butchering poultry is my favorite.",
                                            "score": 3,
                                            "author": "UpNorthPaige"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You want to take as thin of a outer layer as possible and I find it’s easier with a small sharp blade. Different blades have different jobs.",
                    "score": 9,
                    "author": "UpNorthPaige",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There were quite a few people there all working together. When you have a few people working on one quarter we use shorter blades so we don’t cut each other and it’s easier to move around each other.",
                                    "score": 6,
                                    "author": "UpNorthPaige",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The knife I’m holding is a six inch blade.",
                                                    "score": 3,
                                                    "author": "UpNorthPaige"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's normal for some of us",
            "score": 3,
            "author": "DescriptionOk683"
        },
        {
            "level": 0,
            "comment": "Yes!! As we were raising our kids I wanted to be able to give them the best food i could- where i controlled when how what etc.  I do not regret it.",
            "score": 8,
            "author": "cadred68"
        },
        {
            "level": 0,
            "comment": "I’m impressed!  I have never but I love beef so I’m game although I do recall bleeding a deer in my youth!",
            "score": 6,
            "author": "BuildItBaby"
        },
        {
            "level": 0,
            "comment": "How did you age that?",
            "score": 2,
            "author": "flanker_lock",
            "replies": [
                {
                    "level": 1,
                    "comment": "They hung it in the cooler for a little over a month. We are setting up a large dry aging room in one of our restaurants. I can’t wait to start aging my ribeyes for 200 days and playing around with different curing recipes. Do you have much experience with aging meat?",
                    "score": 1,
                    "author": "UpNorthPaige"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this woman’s energy in this pic!",
            "score": 7,
            "author": "christianmoral"
        },
        {
            "level": 0,
            "comment": "Looks like you asked to hold a knife for a photo shoot. What are you doing?\n\nDownvote me some more you illiterate hillbillies.",
            "score": -30,
            "author": "YupGotThatDone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Judging from her post history, she is a fisher and butcher and YTer.",
                    "score": 13,
                    "author": "Sidequest_TTM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was referring only to this photo. No cutting board, no mess, clean hands, no bin for trim or cuts, weirdly holding a tiny corner.",
                            "score": -17,
                            "author": "YupGotThatDone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trimming the outer layer of a dry aged brisket is pretty much done like this. There is very little mess, a smaller knife helps to not cut too much off at a time, as you only want to remove the dried \"skin\" on the outside.",
                                    "score": 13,
                                    "author": "HidaKureku",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know how much mess comes with cutting beef thanks.",
                                            "score": -32,
                                            "author": "YupGotThatDone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Then why are you asking why there's no mess when trimming a dry aged cut?",
                                                    "score": 15,
                                                    "author": "HidaKureku",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you trying to tell me there's zero moisture left in a dry aged cut? Are you also saying it's standard to cut without a cutting board? I run a butcher shop but I'm sure you know more about the trade than I do.",
                                                            "score": -7,
                                                            "author": "YupGotThatDone",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Butcher block counter tops are a thing, my dude. Hell, as long as the surface is non porous and properly sanitized beforehand then you can cut on whatever surface you like in your own home. And if you actually run a butcher shop then you know there is very little runny mess with properly dry aged cuts when just trimming off the outer layer.",
                                                                    "score": 10,
                                                                    "author": "HidaKureku",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Are we looking at the same picture? Lmao youre a clown. Those are cheap ass countertops you'd go right through with a knife. There's mess when cutting anything, and there's zero mess in this picture. You'd know that if you did anything except talk out your ass on reddit.",
                                                                            "score": -2,
                                                                            "author": "YupGotThatDone",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Buddy, that looks like maple to me.\n\nAnd you clearly just wanted to be a pretentious ass in this thread. You're wrong, bud. Stop doubling down and showing your ass.",
                                                                                    "score": 10,
                                                                                    "author": "HidaKureku",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There is no mess when meat is dry aged at this stage of the process. The outer layers are dry. :-) this cow had been hanging a long time. I was skinning off the outside layer of hard meat from dry aging before we packaged up the roasts. This is a butcher table, the entire top is a cutting board.",
                                    "score": 5,
                                    "author": "UpNorthPaige"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": ":-) I’m a butcher, here’s a video of me breaking down a carcass just for you my friend. https://youtu.be/jNoS7LSLXVA my hands are extra bloody but I’m also just using an entire table and not a cutting board so you might still call it fake ha ha.",
                    "score": 6,
                    "author": "UpNorthPaige",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao you people are something else.",
                            "score": -6,
                            "author": "YupGotThatDone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s honestly so ridiculous, why would the meat be on the table obviously in the middle of processing with freezer paper packaging behind me? What would we have been doing? ha ha I really don’t get your point. Haters got to hate and reddit is their favorite place to do it. Honestly though, people like you make sharing good memories with strangers a little less rewarding. Do better.",
                                    "score": 6,
                                    "author": "UpNorthPaige",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. You're a master butcher and we're all lucky to be in your presence. Thanks for your service.",
                                            "score": -3,
                                            "author": "YupGotThatDone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well thank you good sir, now head off to the next hissy fit your going to have with strangers lol. You’re cute when you get all puffy.",
                                                    "score": 11,
                                                    "author": "UpNorthPaige"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You’re a dick dude, chill out, take a deep breath, go for a walk",
                                                    "score": 5,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}