{
    "id": "13spc02",
    "score": 1,
    "title": "Nolo Bait",
    "author": "weaverlorelei",
    "date": 1685137276.0,
    "url": "https://www.reddit.com/r/homestead/comments/13spc02",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone heard what happened to the manufacture of Nolo Bait?  Called local stores and no one has it, went online and found their site, saying due to unforeseen circumstances..... Just curious.  I am starting to see grasshopper nymphs and it will soon be to late to treat.\n\nSide question, what does everyone else use for grasshoppers?",
    "comments": [
        {
            "level": 0,
            "comment": "Last year a kid at IFA said there was an explosion/fire at a plant. Great though, sounds like it’s gonna be out this year too. I’ve heard ducks are good grasshoppers though, I got some chickens hopefully they’ll help.",
            "score": 2,
            "author": "thegrimmestofall",
            "replies": [
                {
                    "level": 1,
                    "comment": "We used to have birds- chickens, ducks, guineas and geese.  Now we have GSP, a bird dog.  Not a good mix.\nHad grasshopper so bad a decade ago, they ate the fiberglass screens on the windows.  So hopefully I have enough nosema in the environment that some will still be active",
                    "score": 1,
                    "author": "weaverlorelei"
                },
                {
                    "level": 1,
                    "comment": "Best I can tell, that fire was in 2018.  Got to be additional issues over this amount of time.\nI find it comical that if you search for an alternative to Nolo Bait, one of the suggestions is called EcoBran grasshopper bait.  Active ingredient is carbaryl.  I guess since it is bound to bran flakes it might not hurt my bees, but that ain't gonna happen",
                    "score": 1,
                    "author": "weaverlorelei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah gotta be careful with whatever ‘stock’ you have around the homestead, I got chickens and cats and a dog…not sure what we’ll do this year….but they’ll be all over our strawberries soon (unless our super cold king winter killed them off)",
                            "score": 1,
                            "author": "thegrimmestofall"
                        }
                    ]
                }
            ]
        }
    ]
}