{
    "id": "13u6pvq",
    "score": 28,
    "title": "Just need some paint an my rabbit tractor will be completed. Any ideas or suggestions?",
    "author": "Wiggledezzz",
    "date": 1685296594.0,
    "url": "https://www.reddit.com/r/homestead/comments/13u6pvq",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I thought the point of a livestock tractor was to provide them fresh ground regularly?  If they cant access the ground its just a cage on wheels?",
            "score": 15,
            "author": "rearwindowpup"
        },
        {
            "level": 0,
            "comment": "Wrong material… Gonna be nasty in short order. All wood absorbs rabbit piss and that  material is glued Nasty and toxic. Your rabbits chew on that and some may die. But it for sure will smell like piss, swell and then the ammonia from their own piss will burn their lungs and kill them. \nIt doesn’t matter that the bottom is a screen they will get piss all over the sides too in short time. \n\n\nUse a metal cage.",
            "score": 18,
            "author": "One-Willingnes"
        },
        {
            "level": 0,
            "comment": "Two things from a former rabbit breeder.\n\n1. Depending on where you are located im worried about heat/lack of airflow. On hot days I would go give my rabbits chilled 1' square tiles to lay on as well as ice in large terra cotta saucers. Heat is a bunny's enemy. In the wild they would burrow and spent the hot part of the day underground. The boxes that you've built for them have no extra ventilation do they?\n\n2. Chicken wire will not keep them in if they decide to leave, nor will it keep other critters out. Change it to welded wire as soon as you can.  \n\n\n\n3. Just kidding one more thing, gravity fed water supply line to 3 water nipples will make your life so much easier. As well as putting j-feeders through the wire... \n\n\nAnd last #4. Get some aluminum flashing like someone else recommended and cover up that exposed wood touching the bottom wire, it will get nasty quick with urine, poop, and fur.",
            "score": 3,
            "author": "Ozemba"
        },
        {
            "level": 0,
            "comment": "Some of this is probably repeated in other comments, but the point of a tractor is that you move it onto grass. This is a hutch on wheels.\n\nThat looks like poultry wire. Poultry wire only keeps out poultry. Since this hutch is so low to the ground, it would be very easy for a predator to rip that off or make a hole and eat your rabbits. You need hardware cloth on the front to protect them.\n\nThe rabbits will like the separate little nest box rooms. We have those in some of our rabbit hutches but be sure to put in some hay or shavings to soak up the poop bc they are a pain to clean.",
            "score": 3,
            "author": "Frequent_Jellyfish69"
        },
        {
            "level": 0,
            "comment": "Rabbits need a **lot** more space than that, they need to be able to hop around. They also do better with water bowls rather than those bottles. \n\nWhat type of wood did you use? If it is cedar, pine, or treated wood, it’s toxic to rabbits. There are other wood types that are also toxic to rabbits, but those are the most common toxic woods for lumber.\n\nAnd, that wire mesh on the bottom will give them sore hocks (painful sores on their feet).",
            "score": 8,
            "author": "JDolittle",
            "replies": [
                {
                    "level": 1,
                    "comment": "In addition to the information above, rabbits must have access to both water and hay at all times.  Those two things are non-negotiable.  \n\nIsolating them is a special kind of unkindness.  They're very sociable herd animals.  Isolation is torture.",
                    "score": 9,
                    "author": "247GT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes to all of this. I can’t believe I forgot to comment on the isolation. Bunnies must have a friend(s). Solo rabbits can be ok as long as they have enough human companionship and/or friends of other species, but they can’t be alone like this and be ok.",
                            "score": 4,
                            "author": "JDolittle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Go to r/meatrabbitry. A 30*30\" cage is perfectly fine. They will live a happy life. The cage wire on the bottom is encouraged as it prevents urine/feces from building up in the cage. \n\nThe wood is a bad idea. It's far easier to build a hanging rabbit hutch that doesn't move or a normal tractor that touches grass. Don't try to compromise. | They will need a plate to sit on which can be ordered cheap on Amazon.",
                    "score": 0,
                    "author": "Whoiseyrfire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You needed to clad that board with metal or some polymer. Straight composite will not last long.",
            "score": 2,
            "author": "spoonsandstuff"
        },
        {
            "level": 0,
            "comment": "i don't agree that isolating the rabbits is torture, all of mine are in separate cages (but can see each other) and do just fine\n\n&amp;#x200B;\n\nhowever, all the other comments are correct. plus, why did you bother making a mobile tractor with wheels on it like this but not allow them access to the ground? if it's for the poo then you really wasted a lot of time, energy, effort, and money. why not just dump the turds where you want them to be? \n\nthe whole point of a rabbit or chicken or whatever tractor is to let them munch on and eat whatever greenery is under them at the time. i don't agree with doing this with rabbits as it is a huge vector for disease but if you're doing a tractor that's the only point of it",
            "score": 3,
            "author": "mogto"
        },
        {
            "level": 0,
            "comment": "combine the water and feeders into one gravity fed system so you only have to fill one thing",
            "score": 0,
            "author": "they_have_no_bullets"
        }
    ]
}