{
    "id": "13ugnu7",
    "score": 400,
    "title": "I hate holiday weekends.",
    "author": "quietlifeintheforest",
    "date": 1685322357.0,
    "url": "https://www.reddit.com/r/homestead/comments/13ugnu7",
    "media_urls": [],
    "other_urls": [],
    "postText": "At the risk of sounding crotchety, I detest holiday weekends. \n\nAll the weekenders come down, shoot their guns and fireworks into the night, drink and carry on like it's the last day having fun is going to be legal.  \n\nI'm all for practicing and training with fire arms and all for having fun, but neither myself nor any of the other locals carry on like that and no one I know appreciates the shenanigans. \n\nIf you've got a cottage in the woods somewhere, please remember there are people who actually live here with kids and dogs and livestock. \n\n/rant.",
    "comments": [
        {
            "level": 0,
            "comment": "I live in the TX Hill Country and our town is really popular for motorcyclists during the weekends. I live about 4 miles off the highway as the crow flies, and I can hear the Harleys and crotch rockets. \n\nWith that said, our town would suffer greatly without tourism. I try to avoid it as much as possible over the weekends, but recognize it's best for the area.",
            "score": 173,
            "author": "tequilaneat4me",
            "replies": [
                {
                    "level": 1,
                    "comment": "We live where it just starts rolling hills and some long stretches of country roads. The motorcycles on the weekends aren't horrible, but it's the accidents that frustrate me. I know they like to take the curves fast but not all of them know how and it's sad.",
                    "score": 41,
                    "author": "irishihadab33r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Backwoods New England checking in, when it's wet people on scooters and vehicles almost never slow down and always end up in our yard! Once at night we had an suv flipped on it's side out in front of our house on the road, on the steep curve and my husband jumped on the side to help the guy out, and while we were on the phone with 911 another vehicle didn't care about the lack of visibility due to the mf nor'easter and plowed right into that first vehicle, and then we had TWO vehicles on its side. Ended up having a tow truck come and help the other tow truck, which got stuck. Had it all on video, including the cop car having to be pulled out of my driveway because the driveway is also a pretty big steep hill.\n\n  Steep road at the top of the road, drastically declining around an almost entire v-shaped curve right before my house and into my driveway, meaning when they land IN our yard, they have fallen about 15 feet down from the road. Happens so often we have flashlights near the door, specifically so one of us can go to one end and another to the other side so we can flag people down before they get closer to the accident. \n\nAnd man, don't even get me started about all the KIDS, including definitely not even 10 year olds, who fly around on their dirt bikes ALONE WITH NO PARENTS. Yes, I've never seen one without a helmet but lots of dump trucks and vehicles pass this way as we live 2 streets away from a place where folks pull off the road, onto the dirt side and go fishing or hunting or canoing or hang out by the bridge. I absolutely hate seeing the kids and bikers go as fast as they do. Super dangerous on roads like ours that are also filled with skid marks from hundreds of people having to slam on brakes due to wild animals walking across the road.",
                            "score": 17,
                            "author": "red_fox_zen"
                        },
                        {
                            "level": 2,
                            "comment": "I understand, and we have 2 big rallies a year. EMS is always busy those weekends.",
                            "score": 16,
                            "author": "tequilaneat4me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most places bring in extra ems for those rallies. I went to Sturgis the week before\"prep week\" for the rally and they had spots for like 10 extra ems set up. Used to live in Stevenville, Texas, and they have a week drunk/drug \"Music Festival\" and Texas HiPo and a few dozen extra cars there as well.",
                                    "score": 8,
                                    "author": "MissHeatherMarie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The great LJT",
                                            "score": 0,
                                            "author": "Hobbyfarmtexas"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s totally a conundrum. The tourists bring money that keeps our town alive and well, but… tourists… my brother ( lives in a small ski town in Colorado) has a bumper sticker that sums it up : “if it’s tourist season, why can’t we shoot them?”",
                    "score": 8,
                    "author": "Blueridgetexels",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "👍",
                            "score": 1,
                            "author": "tequilaneat4me"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sounds like Bandera",
                    "score": 9,
                    "author": "SkynetLurking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Give this man a cigar.",
                            "score": 5,
                            "author": "tequilaneat4me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Having a cocktail at Mr. Blue's is on my bucket list.  I'm a long-time REK fan, saw him at ACL a few months back on his farewell tour.  I guess that makes me a tourist, but I try to leave a small footprint.",
                                    "score": 1,
                                    "author": "Phriday"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The ROT (Republic of Texas) Rally has been part of Austin culture since the mid-90s.  Don't get me wrong, it's been annoying as hell since it started.  But at the same time it's become such an iconic part of our culture.  I can't remember what time of year it used to be held (it didn't used to be summer).  I remember it signifying changing of the seasons.",
                    "score": 3,
                    "author": "_Brigit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was in Austin once when it was happening. Never again, which isn't much of a problem, since I try to avoid Austin.",
                            "score": 3,
                            "author": "tequilaneat4me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed.  Austin is a shell of what made it so popular.  Sad.",
                                    "score": 2,
                                    "author": "_Brigit"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If the motorcycles had the correct silencers on them, you wouldn't even know that they were there.",
                    "score": 4,
                    "author": "FergusonTEA1950",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "loud pipes save lives",
                            "score": -9,
                            "author": "sporeyourowngood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only in slow traffic and around town, not at the speeds guys with loud pipes like to ride. I've been out on my bike and been passed by another rider going so fast I literally didn't hear him until I was behind his exhaust. A bullhorn doesn't help you speak to people at the other side of a field if you are facing away from them, an exhaust is no different. I'd rather hear things around me than listen to endless noise on my 100 mile a day riding commute. Lights, hi-viz and better horns go a lot farther in grabbing attention.",
                                    "score": 7,
                                    "author": "Curiousfur"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, they let others know you are in front of them.",
                                    "score": 5,
                                    "author": "finnbee2"
                                },
                                {
                                    "level": 3,
                                    "comment": "I see it's safe to say this group does not like loud pipes",
                                    "score": 3,
                                    "author": "sporeyourowngood"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "LOL!  I bet I live in the same town.  I live off the highway about 4 miles out of town, in my childhood home.  It used to be so quiet out there.",
                    "score": 1,
                    "author": "OldDog1982",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live NE of Bandera, as the crow flies.",
                            "score": 1,
                            "author": "tequilaneat4me"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nothing better than Texas hill country. I have family with property around leakey. Love going up there mon thru Fri weekends not so much unless it's outside of the tourist season",
                    "score": 1,
                    "author": "Rare-Work-3919",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some good Mexican food at Mama Chole's.",
                            "score": 1,
                            "author": "tequilaneat4me"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We don't really camp in national/state parks on big holidays anymore either. We had a horrible experience where we thought we stumbled on a prime dispersed camping spot, had a nice night cooking out, and then a bunch of souped up trucks showed up at midnight and started revving their engines at the entrance of our path and screaming about their spot (which was totally empty when we got there...it was a dispersed camping area, not a campground). We didn't get out...weren't going to have any conversation unless they forced it on us because they were clearly out of their minds.\n\nThey took over the next spot down the forest road and started partying and shooting (?!) all night. Wonderful holiday weekend.",
            "score": 34,
            "author": "bettrsweater",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit, I'm now extra thankful that is not allowed here. I can't even IMAGINE living in a place with such lax gun laws, even though we barely have any as is, but that.. oh no, that shit would NOT be tolerated, and they'd be most likely arrested and their guns taken away. ([CT, USA)](https://portal.ct.gov/DEEP/State-Parks/Camping/General-Camping-Information---CT-State-Parks-and-Forests) you can't even have archery equipment.",
                    "score": 3,
                    "author": "red_fox_zen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Laws don’t really apply when you’re miles from civilization with no cell signal and you’re a Washington redneck. Drunk driving through mountain forests and shooting by the light of your rooftop light bars, what could go wrong. I had a whole new appreciation for what the forest rangers must deal with after that.",
                            "score": 13,
                            "author": "bettrsweater"
                        },
                        {
                            "level": 2,
                            "comment": "lol",
                            "score": 0,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We are a quart mile off the road in the woods next to a camping resort. The smallest pond is in front of our property down a hill. Owners redid the campsites around this pond last year. Usually only a few would camp there before. We have had ppl tee off golf balls, shoot fireworks,  drunk walks up to our property after midnight,  ppl at my chicken coops. Usually most we explain that they are on private property and need to leave. Kids watching my chickens doesn't worry me much, but if caught, they are monitored,  spoken to kindly, and walked to the hill. The worst one was a few years ago. Some lady let her dogs off leash, and the mutts came to my yard and had my Bloodhound pup circled while he was on his cable. I went into Drill Sgt. Mode. Asked her to get her dogs before they attacked my pup.  Told her if they did ,we would use force to stop them, 20 gauge  bird shot.She escalated very quickly,  threatening to call the sheriff. Um, they are on my property, and if they attack my dog, me, my guests, or my chickens, I am in my right to do what I need to. I was called a psycho b*tch a few times. Thanks for the compliments! I was by my pup during this keeping mutts back. Hubby came out and shot up in the air, and they ran off. She yelled and screamed more. Hello, there are leash laws for a reason. My son said Damn Mom, i haven't heard that tone in years.  People have also walked up to tell  us to stop shooting clay birds. Ummm, no, we aren't shooting towards you, and you are trespassing.  So go back down the hill. Some ppl are just twats.",
            "score": 34,
            "author": "AffectionateDraw4416",
            "replies": [
                {
                    "level": 1,
                    "comment": "all bets are off when they walk all the way down the lane\n\nfuck even I don't wanna be alone with me in the woods when the lightning creeps in",
                    "score": 4,
                    "author": "BlazeUpRaiseUp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't usually come down the lane ,just walk up the hill inti my yard.",
                            "score": 1,
                            "author": "AffectionateDraw4416"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We live in Pickett County TN and adjacent Dale Hollow Lake is a big tourist draw, especially on holiday weekends. This year memorial weekend has been par for the course. Plenty of drunken dipshits, fireworks and boating accidents. It is what it is I suppose, but I try to take solace in the fact that it’s about 85% peaceful tranquility around here with only brief stints of chaos. \n\nI also try not to let the rare dumb fucks make me jaded towards the regular folks who show up here looking to have a good time and enjoy themselves in a respectful manner. As the stellar reviews of our big resorts and attractions attest to, we pride ourselves in our hospitality to visitors, just please behave yourself and pick up after yourself is all we ask",
            "score": 34,
            "author": "ChiTownDerp",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am so grateful that boats are not allowed at the water behind our woods (about 100 acres) because we already have a bunch of dipshits shooting in the middle of the night, fire works the whole nine. Canoes are allowed and are frequent, but basically, they just quietly canoe and enjoy the absolutely beautiful scenery that is CT.",
                    "score": 5,
                    "author": "red_fox_zen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our lake is both very deep and very large, which tends to attract particularly large vessels and lots of Olympic level alcohol consumption on holiday weekends. \n\nThe TWRA is responsible for enforcement on the water, but they are chronically understaffed and overwhelmed. \n\nI really don’t want to become that guy who hates all tourists, but sometimes it’s challenging trying to stay neutral",
                            "score": 5,
                            "author": "ChiTownDerp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Old Hickory and Priest have gotten so crowded they got pushed to Center Hill and then overflowed to DH.  Beautiful lake!",
                                    "score": 2,
                                    "author": "Nagadavida",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The sheer volume of alcohol sold in Byrdstown over the course of weekends like this one, 4th of July, Labor Day, etc. is staggering. I stopped by 111 the other day to pick up a 12 pack and the owner behind the register (who I know quite well) told me he had rang almost 2K In booze and he had only been open a half hour at that point. It seems like we have more and more people coming every summer since we moved here. Im not sure how I feel about this. On the one hand the money in the form of tax receipts helps the county no question, but with these larger influxes also comes problems that small rural communities like ours are simply not equipped to deal with.",
                                            "score": 3,
                                            "author": "ChiTownDerp"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We had two life flights from our lake yesterday. Alcohol and boating = wee ooo wagons all day long",
            "score": 9,
            "author": "ohyoudodoyou"
        },
        {
            "level": 0,
            "comment": "Look at the bright side… these people aren’t around most of the year.  So for a handful of annoying weekends, you get to live in a great place with peace and quiet!",
            "score": 74,
            "author": "BigMax",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the local businesses get a boost to their bottom lines. Don't be the old guy yelling at kids to get off his lawn. People like to have fun. It's older than civilization itself.",
                    "score": 38,
                    "author": "fingerscrossedcoup"
                },
                {
                    "level": 1,
                    "comment": "Live and let live",
                    "score": 13,
                    "author": "ComplaintNo6835"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have a house near the coast and basically avoid the nearby town on holiday weekends. \n\nThe yahoos come out in force. I'm all for having fun but try not to be an idiot.",
            "score": 59,
            "author": "Illustrious-Gas-9766"
        },
        {
            "level": 0,
            "comment": "Actually, having fun while maintaining the appearance of having fun is illegal in the burbs.",
            "score": 32,
            "author": "gazorp23"
        },
        {
            "level": 0,
            "comment": "We're not homesteaders, just live wayyyy in the woods. Pretty self sufficient, just haven't made the transaction yet.  Only 2 permanent homes on our dirt road, the rest are rich people coming in from the city exactly as you describe.\n\nGenuinely, we're SO willing to be friendly with them. OH no, they're not having any backwoods hicks speaking to *them*. So frack 'em.\n\nBetween guns going off ( and I mean semis ), the family with FIVE dogs allowing those things to run free ( \" My husband just won't hear of having them leashed \" from a woman who lives in a gated community where you *know* that's not permitted ), 4 wheelers and golf carts tearing up the lane, rich people acting all surprised that no, we'd really rather not have their 10 kids playing in *our* pond and that family has their own pond ( snakes n snapping turtles, not a good idea ) and tramping all heck all over our portion of the woods it's a nightmare.\n\nOh and how dare our dogs bark at theirs.  Because that's what dogs do when 5 strange dogs arrive on our porch. We tried to point out there are copious porcupine here- one of our dogs was quilled on leash for God's sake. Nope. Those poor dogs *are* going to get a snootfull of quills. Thankfully they seem like nice dogs although that is no defense against porcupine, skunks, coyote..... .\n\nSorry. Also ranting.",
            "score": 7,
            "author": "Mor_Tearach",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you put up no trespassing signs",
                    "score": 0,
                    "author": "Halcyon-OS851",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For awhile. Also a \" Please slow down \" sign, same people tend to treat the little dirt lane like an interstate. \n\nTrespassing signs ended up with bullet holes in them. The \" Please slow \" sign has so far escaped damage, possibly because to those cars it's just a blur",
                            "score": 1,
                            "author": "Mor_Tearach"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On one hand… I get it now theses days being the “local”.\n\nIn the other hand, I also remember when I WASNT the local and holiday weekends were the only chance I had to get away from the city, \n\nSo, I get it both ways",
            "score": 25,
            "author": "tmahfan117",
            "replies": [
                {
                    "level": 1,
                    "comment": "PHRASING",
                    "score": 1,
                    "author": "BlazeUpRaiseUp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fireworks are what I dread. Especially since our area has been pretty dry the past few weeks.",
            "score": 30,
            "author": "twirlybird11",
            "replies": [
                {
                    "level": 1,
                    "comment": "I shot off a single firework last year as a little celebration of finally being fully moved in after years of work. It just echoed down through the entire valley and then I could hear dogs barking 10 miles down the road for the next hour. I felt so bad.",
                    "score": 14,
                    "author": "Theamachos"
                },
                {
                    "level": 1,
                    "comment": "Yeah. I'm also a combat vet. Every so often if I'm not expecting it, it gets me in a bad head space.",
                    "score": 18,
                    "author": "quietlifeintheforest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My husband is a combat vet, too. The neighbors’ gunshots don’t bother him, but fireworks are tough.",
                            "score": 5,
                            "author": "emthewiser"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My family has had land for 80ish years by a lake. It was a full time residence, have added a house and some camping areas, and every year now, people come into the cove and shine their lights up onto the shore all night long. Gets the dogs going nuts, everyone camping is up, and it’s like every two hours. \n\nThe first time it happened we went out and realized they were cleaning off our trot lines. Now they come back every year. We have since given up even setting lines, but they still come check.",
            "score": 15,
            "author": "Chicken_Chicken_Duck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Around here stealing another guy’s trotline would definitely get your ass kicked and possibly much worse.",
                    "score": 8,
                    "author": "mryetimode"
                },
                {
                    "level": 1,
                    "comment": "Around here, picking up someone else's trot lines is a reeeally good way to get shot.  Good on ya for your patience.",
                    "score": 11,
                    "author": "Phriday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You live around sociopaths.",
                            "score": -10,
                            "author": "BugsCheeseStarWars",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I know stealing someone else’s food is sociopathic behavior",
                                    "score": 13,
                                    "author": "DonkeyDeal12"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is everywhere.  I have an acre the suburbs and people race down the roads like maniacs. Fireworks, guns etc. \n\nThey took a nice older home on about 10 acres and jammed 20 ugly houses on it.",
            "score": 19,
            "author": "Pitiful_Amount8559"
        },
        {
            "level": 0,
            "comment": "I am not fond of all the people coming up with all their 4 wheelers and side by sides. People love to throw trash out on the side of the road. Not to mention the god awful lights that some people have on their side by sides.",
            "score": 17,
            "author": "gpete87"
        },
        {
            "level": 0,
            "comment": "That's life man",
            "score": 3,
            "author": "LiltonPie"
        },
        {
            "level": 0,
            "comment": "Part of me wants comment on how your focus of how others celebrate a day for our fallen brothers and sisters overshadows what today is about. The other part of me is also (an up and coming) crotchety old man.",
            "score": 3,
            "author": "TekWarren"
        },
        {
            "level": 0,
            "comment": "Some serious duality of man shit going on in here...\n\nOn the one hand, you just have to deal with other people existing and choosing to live their life differently than you.\n\nOn the other, there's a difference between \"blowing off steam\" and being a disrespectful prick. Shooting guns and fireworks late into the night is on that list.",
            "score": 3,
            "author": "SkilletTrooper"
        },
        {
            "level": 0,
            "comment": "Old man shakes fist that the clouds.",
            "score": 43,
            "author": "_B_Little_me"
        },
        {
            "level": 0,
            "comment": "As a millennial who will likely never be able to afford my own farm (I travel over an hour *every* weekend to my parent's 70 acre farm to experience, albeit just a sliver, of what I yearn for), this is me sometimes. I like to reload my own ammo (fewer wasted resources), hunt, fish, and practice bushcrafting. My generation is largely barred from pursuing these things on our own. I earn a great salary (over 3 times the state per capita), but my student loans to get this job is more than my monthly rent while buying a new car (have a 2005 Corolla I fix up myself) is far out of reach. Homes near me are $400k. Some of us simply want to enjoy what we can with our limited time otherwise spent wasting away in a city just to survive.",
            "score": 16,
            "author": "DucksOnQuakk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can your olds cut you off a sliver, or work out a way for you to keep part of their farm?\n\nWe sold up in Melbourne to live offgrid in the Aussie bush. To get away from all the noise &amp; to have more options for when the 14yo daughter needs a (tiny)house one day. I honestly can't see up ever leaving here, &amp; hopefully the kid will stay on",
                    "score": 6,
                    "author": "pygmy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I, along with two brothers (the eldest is mentally disabled and needs daily, expensive in-home care), are heirs to the farm. So me and my capable brother's incomes and health insurance are 100% tied up in our jobs 1+ hours away. And I fear the youngest brother will want to sell the farm to provide for him and his wife's future, which forces me to buy his share or diminish my dream and solely pay the property taxes, while being far from where I live and unless I buy a reliable vehicle at an exorbitant price. I can't switch jobs because it pays well in relation to other options, and I personally have an expensive-to-manage disease. It's virtually impossible for me to pursue my dream given my situation even though it seems I should be able to on paper. All I can do is enjoy what little I can before things likely evaporate on all fronts. My generation is simply fucked unless they draw the genetic and heir-apparent lotteries simultaneously lol. At present, I'm considering cashing in my retirement accounts and trading retirement for daily happiness. At an expected lifespan of 70 years, why slave away unhappily until 65 before retirement to *begin* my life? Might as well just suffer 5 years instead of 65.",
                            "score": 3,
                            "author": "DucksOnQuakk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ugh.. I forget you have so many healthcare issues that simply aren't a thing in Australia. When I slipped on my motorbike &amp; broke my shoulder, I didn't have to pay a thing, and actually received 80% of my wage until I was better. I have NO insurance btw, that's just how it is here.\n\nI know a Canadian girl who built a little house in rural Thailand for like 10k, cheap living &amp; pops over to China/Singapore to teach when she needs some more cash. Would you do that?\n\nAlternatively, I know a few yanks who married Aussie mates here. One loved birthing her 3 kids here for $0 dollars",
                                    "score": 2,
                                    "author": "pygmy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I envy you! For an \"excellent\" health care plan in the US, I spend $3000 before benefits really kick in. It's gross here. Profit over people is our creed.\n\nI can't think of myself as an individual with true choices in life. I have to care for my oldest brother. I refuse to put him in a \"care home\" where abuse or negligence of care is a commonality here. And even if I relocate abroad, the US is one of a handful of countries globally who tax you based on citizenship regardless of where you are unless you renounce your citizenship. So, if I relocate abroad and want to maintain ties to family in the US, I'll be taxed in the relocated country *and* the US simultaneously. The US is a slave nation lol. They make it impossible to live here or abroad without making major familial/financial decisions that can ruin you. I surf this sub mainly to live vicariously through others and dream of what I could/would do if my life were different/mine.",
                                            "score": 5,
                                            "author": "DucksOnQuakk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; So, if I relocate abroad and want to maintain ties to family in the US, I'll be taxed in the relocated country and the US simultaneously.\n\nFor what it's worth, due to the \"Foreign Earned Income Exclusion\" you do not have to pay the US taxes on the first $120,000 you earn abroad each year.\n\nhttps://www.irs.gov/individuals/international-taxpayers/foreign-earned-income-exclusion",
                                                    "score": 6,
                                                    "author": "Sam_Sanders_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "For what it's worth, our economic imperialism only kicks in for upper middle class people.",
                                                            "score": -5,
                                                            "author": "BugsCheeseStarWars"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "was going to post this! can confirm - have many years of zero taxes paid from when i was making \\~40-60K overseas.",
                                                            "score": 1,
                                                            "author": "MediocrePay6952"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That doesn't necessarily mean *both* of us will be granted entrance into a foreign nation. One look at him, and he's viewed as mooching off exquisite European health care. I've traveled abroad a lot, and 80% of the time, I'm pulled aside and being questioned when I'll leave. Ireland, in particular, said they were questioning me for medical tourism. My brother would be viewed as a leech, and I'd be defending my own output in a new country. It isn't an easy process, let alone trying to maintain financing and ties to the US.",
                                                            "score": 1,
                                                            "author": "DucksOnQuakk"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Get your brother on Medicaid....",
                                                    "score": 1,
                                                    "author": "TheTofuPlot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He is on Medicaid. Doesn't help in today's world. Social benefits are a joke in the US. It's a disgrace.",
                                                            "score": 1,
                                                            "author": "DucksOnQuakk"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am not a homesteader, but I was a bartender years back. I still hate rookie drinker nights.",
            "score": 8,
            "author": "bajajoaquin"
        },
        {
            "level": 0,
            "comment": "I doubt your town would survive without those people. You gotta take the good with the bad, they bring money that you guys need (although if you don’t have a shop in that town, you might not realize it). \n\nI’m not advocating for irresponsible behavior, but a few random weekends a year would be worth it for me to have my town survive. I would say it’s up to the town to elect people into law-enforcement, who will enforce safety rules during those times. I have done a lot of service jobs for rich people, and small towns live and die by them.",
            "score": 9,
            "author": "fartzilla_bread",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol my town is 300 people with no downtown. The board members have roads named after their family farm. We would do fine.",
                    "score": 2,
                    "author": "quietlifeintheforest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well this comment definitely makes your username check out. Damn. 300?",
                            "score": 3,
                            "author": "red_fox_zen"
                        },
                        {
                            "level": 2,
                            "comment": "Then outlaw fireworks in your towns area and task the cops with ticketing everyone for more money...super simple to do with only 300 potential voters",
                            "score": 2,
                            "author": "TheTofuPlot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am also a crotchety old man who goes out to catch my spooked horses shaking my fist at the skies 😂\n\nAt least, like, tell me you’re going to do that so I can go out and hold them. Last time I ended up with a $1200 vet bill bc my horse thought going through a barbed wire fence was a better option than staying in the paddock when fireworks were happening. \n\nAt least I have one deaf horse who can’t hear them lmao",
            "score": 5,
            "author": "lambslavender",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or you can assume it's going to happen every memorial Day 4th of July and Labor Day? 🤷‍♂️\n\nAt least act like you understand that in 2023 most people don't have horses and rarely even consider the fact that others might. The entitlement in this post is wild.",
                    "score": -4,
                    "author": "BugsCheeseStarWars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure why fireworks would go off on the 4th of July in Australia? \n\nThis is a very American take 😂\n\nAlso I just want to add that I don’t live near any holiday houses. I have approximately 4 neighbours who could light fireworks and it would impact me (we’ve all lit fireworks in the last 12 months and each of us let the others know beforehand because manners - something a lot of Americans don’t seem to understand). The problem is tourists (illegally) going into a national park by my property and setting off fireworks - especially in summertime when its EXTREMELY illegal and could actually burn my house down. But, yeah, enjoy your 4th of July or whatever the hell that is lol",
                            "score": 6,
                            "author": "lambslavender"
                        },
                        {
                            "level": 2,
                            "comment": "Not sure where you live but I used to live in a rural town where the rednecks and trailer trash lit fireworks all summer long. It’s not just a day or two. The entire two week stretch around July 4th is incredibly difficult if you have pets who are sensitive to it. I can’t even imagine how veterans handle it. I enjoy the “pretty” fireworks you shoot off at dusk as much as the next person, but the amount of money wasted on just wanting to hear an explosion in the middle of the day is insane.",
                            "score": 3,
                            "author": "babbzug"
                        },
                        {
                            "level": 2,
                            "comment": "The entitlement of people who come into other's neighborhood with fireworks, booze, atvs, guns, and no consideration for those who live there year round is wild.",
                            "score": 7,
                            "author": "quietlifeintheforest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You mean the residents who explicitly have approved of all the zoning ordaninces that allow all that behavior?  The same group benefiting econonically?",
                                    "score": 0,
                                    "author": "TheTofuPlot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You go out into the country and more people have horses. What a ridiculous comment and then to talk about entitlement. Like everyone around you doesn’t have horses so people must not have horses. And it’s not just horses that get spooked by fireworks so there wasn’t even a point to deride them like they are not with times or something. Why even bring up what year it is?",
                            "score": 2,
                            "author": "Theamachos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sounds like transplant superiority",
            "score": 7,
            "author": "wtd12"
        },
        {
            "level": 0,
            "comment": "Our area has a big 3 day festival over a holiday weekend during summer. We usually make arrangements to be away during that time, LOL.",
            "score": 2,
            "author": "pro_ajumma"
        },
        {
            "level": 0,
            "comment": "Make money of their dumb asses\n\nThey won't ever stop\nSo find some things to push, products and whatnot and just jack the prices up\n\nThey'll pay it at a stand",
            "score": 2,
            "author": "NashT33"
        },
        {
            "level": 0,
            "comment": "Funny, I feel very similar...this afternoon I was out walking the paved road, with dogs, and up comes some side by sides,  two of them and VERY loud.  Next thing I hear is automatic weapons fire, in the National Forest, outside of hunting season.  No respect.\n\nFully automatic weapons need special licenses, side by side are prohibited in the Wilderness Area, and they accessed the area with unlicensed motor vehicles.  Next time I am at the ranger station, I will stop in and chat about this.",
            "score": 2,
            "author": "unicoitn"
        },
        {
            "level": 0,
            "comment": "Is this the well regulated militia the 2nd amendment is referring to?  I wonder how many drunk morons are behind the reason why we can't protect our children by fixing the joke that is our current system to determine who is gun worthy and who isn't.",
            "score": 2,
            "author": "realifejoker"
        },
        {
            "level": 0,
            "comment": "The annual memorial day motorcycle rally that happens the next mountain town over had a shoot out yesterday with at least 3 casualties..... God bless us one and all.",
            "score": 5,
            "author": "hroju3395"
        },
        {
            "level": 0,
            "comment": "Deer season is simultaneously the best and worst time of year.",
            "score": 6,
            "author": "DocAvidd",
            "replies": [
                {
                    "level": 1,
                    "comment": "We've been really lucky with both hunters and fishermen. First day is always, well, interesting, that's just one day. I don't know what it is about our area of PA ( north Dauphin ), both hunters and anyone coming in to fish tend to be quiet, really know what they're doing and most stop to talk if we're outside when one is around.\n\nWe've started letting some park here- that's how chill they've been. Come back year after year. Like I said maybe it's just where we are? Whatever the case it's *really* nice to have them around.",
                    "score": 2,
                    "author": "Mor_Tearach"
                },
                {
                    "level": 1,
                    "comment": "I've taken to not hunting on weekends, myself. I'll wait for Monday and be sure not to get shot by some city-iot with a shotgun.",
                    "score": 1,
                    "author": "quietlifeintheforest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;city-iot\n\nBahahahaha! Super duper country area here, and I'm stealing this!",
                            "score": 1,
                            "author": "red_fox_zen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my god, the fucking ATVs.  On the roads, blocking the bridges, no helmets, with a baby in your lap, and for god's sake WHY DO YOU NEED TO PLAY YOUR LOUSY MUSIC WHILE YOU RIDE YOUR ATV?  You've got an open vehicle that makes a ton of noise and then you have to drown it out by blasting Bon Jovi or something loud enough that you can hear it (and so can every single person within a couple of miles).  Ugh.",
            "score": 4,
            "author": "rshining"
        },
        {
            "level": 0,
            "comment": "I agree! I live on a rural property that is also on a scenic route. Nice weekends like the past couple of weekends bring out every damned open-piped Harley Davidson for 100 miles to ride down the road. They don't think that we sit here and hear every one of them go by, not thinking that we can't hear the birds singing, ourselves speaking or the TV/radio.",
            "score": 3,
            "author": "FergusonTEA1950"
        },
        {
            "level": 0,
            "comment": "Combat vet here. I agree. Where I used to live someone in my neighborhood would start fireworks the last weekend of March and go every weekend until labor day. It was brutal. And the actual holiday weekends were the worst.",
            "score": 3,
            "author": "youngster_joey69420"
        },
        {
            "level": 0,
            "comment": "Yes. I get this. We live in a “Private lake community” where many people only own vacation homes. \n\nThey forget that some of us reside here all the time and fireworks at 2am on a random Wednesday, or racing down a 25mph road or having a raging kegger and concert soo loud it shakes the walls of my house for hours on end is really unnecessary. Like…. Some of us here AREN’T on vacation. If all goes well, we’re out of here in two months and it’s NOT soon enough!!!",
            "score": 8,
            "author": "recklessiamnot",
            "replies": [
                {
                    "level": 1,
                    "comment": "So you didn't read the rules of your HOA or HCA, and didn't research the location you purchased and it's the other people's fault?  Presumably many of those other people owned homes there before you ever even bought to top it.",
                    "score": -4,
                    "author": "TheTofuPlot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Actually, contrary to all your ASSUMPTIONS, I grew up here, and many rules/common courtesy have changed over the years. My grandparents lived here since I was very small, and we moved out here when I was 11. I have been in this area for well over 25 years and it has changed drastically. These last ten years ESPECIALLY. It used to be a quaint little area of retirees and young families, very quiet and friendly. Now, it has become more developed and more of a “party” area where no one smiles, waves, or considers their neighbors much. I’m very fortunate my immediate neighbors are WONDERFUL people! However, most of the homes on the lake are not owned by full timers, and sounds really carry across water. \n\nSooo ACTUALLY I knew the ORIGINAL rules quite well. Many have been amended or are often blatantly disregarded, such as noise ordinances or illegal fireworks. However, with a small private police force, and incidents happening at all hours, it is extremely hard for them to enforce the rules.",
                            "score": 2,
                            "author": "recklessiamnot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe you could move away?",
                                    "score": 2,
                                    "author": "Halcyon-OS851",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you read my original comment, we are in that process 😊 hopefully out by beginning of august!",
                                            "score": 2,
                                            "author": "recklessiamnot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just let them have their fun. The ATVs can get annoying but it’s only a few weekends a year. We maintain good relationships with the folks who come up from the city. No sense in being enemies with neighbors. We get invited to their parties and it makes for a good time. \n\nIf it bothers you that much, go away for the weekend. \n\nA few weekends a year is a small price to pay for nearly year round peace and quiet.",
            "score": 8,
            "author": "Woodrow_F_Call_0106"
        },
        {
            "level": 0,
            "comment": "Moves to ‘weekend party country’ and then gets mad when people show up to party on the weekend. queue the “curb your enthusiasm” theme.",
            "score": 5,
            "author": "BenHammer_",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not weekend party country. It's primarily a rural area with people trying to live quiet lives. \n\nParty people are the very loud minority.",
                    "score": 3,
                    "author": "quietlifeintheforest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you tried putting up no trespassing signs?",
                            "score": 2,
                            "author": "Halcyon-OS851"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh. Well, I like holiday weekends.",
            "score": 4,
            "author": "Halcyon-OS851"
        },
        {
            "level": 0,
            "comment": "Maybe form an HOA and you can all police each other's business? You could set it up so you get approval before they paint their house and the whole town can check the colors.",
            "score": 2,
            "author": "delphiking",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd rather have my fingernails removed with rusty pliers than willingly join an HOA.",
                    "score": 4,
                    "author": "BugsCheeseStarWars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's my point. Everyone here lives by a leave me alone mentality, but then they post garbage like this where they are concerned about what their neighbors are doing.",
                            "score": 4,
                            "author": "delphiking"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You definitely sound crotchety and prefacing your arguments doesn’t give you validation. \n\nGot off my lawn you gawd damn delinquents…",
            "score": 2,
            "author": "amw_yo"
        },
        {
            "level": 0,
            "comment": "It's never too late to move to the suburbs. Everyone is in bed by 10pm and the HOA fines the nar-do-wells.",
            "score": 2,
            "author": "Bodacious_Inc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in the burbs and they're still out there right now at nearly 2am. Funny thing, we often stop and ask \"gunfire or fireworks?\". Only one is illegal here and it's not the one you'd think! Lol. Funny/not funny. Blarg. (I'm a disabled combat vet so fireworks are so much harder for me.)",
                    "score": 8,
                    "author": "brandicox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m with you. My quiet dirt road sounds like an expressway this weekend. It doesn’t go anywhere - it just ends out in the woods. Where’s everyone going?",
            "score": 2,
            "author": "frntwe"
        },
        {
            "level": 0,
            "comment": "Stop caring. They can do whatever they want just like you can. \n\nThat elitist mindset is toxic.",
            "score": -10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is it elitist to not want your hard work damaged? Weird take",
                    "score": 3,
                    "author": "lambslavender",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How are they damaging his hard work?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When people illegally set off fireworks in the national park near my house and my horses run into my fences costing me big $$$ in vet bills and fencing, it is damaging my hard work. \n\nI am Australian and fireworks are illegal full stop but I don’t mind if people let them off (I’ve done the same) if they’ve got any manners they will let the neighbours know when it’s going to happen (and no one ever does it in summer because yknow bushfires). My problem is negligent tourists who set off fireworks in the middle of summer and spook my stock and risk burning my whole house down :)\n\nBut obviously you don’t care about the livelihood of farmers and their stock so what am I even typing this for ahha",
                                    "score": 2,
                                    "author": "lambslavender",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahhh see, you live in Australia. There are lots of good details now. Did you call the cops? I care about farmers and livestock. I just ALSO care about other people's freedoms, too. I hope your animals are ok and I am sorry shit cunt people live near you. Your typing this bc you care. You are ahead of the curve with your life sustainability, and you care. That is why you are commenting. Have you ever tried to talk to them? The weekend is almost over.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for being understanding. I am sorry for being so aggressive. It’s just very annoying for me and my neighbours. Like, I don’t even care if people want to light off fireworks but just let those around you know it’s going to happen. (There are no holidays here like 4th of July where fireworks are common so we can’t predict when it’s going to happen). \n\nThe people that let off fireworks/light illegal fires don’t own property here. They are mainly passing through in caravans/campers. So there’s no chance of speaking to them and they don’t care what happens to our property anyway. \n\nAdditionally, it’s hard for police to locate them as they usually scatter afterwards since fireworks are so illegal.",
                                                    "score": 1,
                                                    "author": "lambslavender",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As much as I love fireworks...if there is a ban and they are illegal bc of massive wildland fires  that can affect life and property, im with you 100%. I hope nothing bad happens from their stupidity.",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You need to take better care of your horses and stop looking for excuses",
                                            "score": -2,
                                            "author": "TheTofuPlot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What do you suggest? Keep my horses tied to a post every night? \n\nYou sound like a great animal owner!",
                                                    "score": 2,
                                                    "author": "lambslavender"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You are being downvoted for saying the morally correct take here.\n\nSome of us only get a few days off a year and the idea of being quiet and going to bed early on a three-day weekend so this stupid mother fucker can rest in his beautiful country manor is laughable.",
                    "score": 5,
                    "author": "BugsCheeseStarWars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can care less about downvotes 🤣. That human worked for that lifestyle just like you work for yours. You CHOSE this lifestyle. What if those people are veterans and they people in their lives who gave it all so YOU can have your homestead peacefully. Downvote me all you want. Caring about others on their square of dirt is insane.",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That veteran had a job and lifetime benefits, they aren't owed anything extra",
                                    "score": 2,
                                    "author": "TheTofuPlot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "congratulations on the dumbest comment I've seen on Reddit today - and that is really saying something - it is not elitist to not want others to be inconsiderate assholes.",
                    "score": -2,
                    "author": "JiuJitsuBoy2001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk, i think it is even dumber you care what people do on their property.",
                            "score": -7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How? I considered the neighbors' right to party? You all sound like you have superiority/NPD disorders. I spent 32 months deployed and lost some people. So ya, I am going up to bat and going to say you have NO CLUE what has happened in those people lives. This is the weekend to celebrate the people who gave all for us. I hope they partied all night long. Without their sacrifice, your homestead lives wouldn't be possible.",
                                            "score": -1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Username checks out.",
                    "score": -2,
                    "author": "darkmatterchef"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"like it's the last day having fun is going to be legal.\"\n\nSome of us get literally 2 days off all summer (Memorial Day and Labor Day) and many of us don't even have that guaranteed. \n\nI fully support your neighbors, and I fully support you getting some fucking ear plugs and learning to mind your own business you grumpy old bastard.",
            "score": 1,
            "author": "BugsCheeseStarWars"
        },
        {
            "level": 0,
            "comment": "Citidiots",
            "score": -2,
            "author": "Loud-Confusion7641"
        },
        {
            "level": 0,
            "comment": "Yup. Because you've never been loud before.  \n\n\nLord have mercy and while thats going on let them blast off their guns and shoot fireworks for a weekend.   \n\n\nIts their life too.",
            "score": 1,
            "author": "Professional-Let9150"
        },
        {
            "level": 0,
            "comment": "Honestly, everybody that stays up late making lots of noise, or does it in daylight, kinda sucks. Only pass is given to people with mental health disorders.",
            "score": 1,
            "author": "BeanyBrainy"
        },
        {
            "level": 0,
            "comment": "sounds like you need more land and more of your own shit to worry about",
            "score": 1,
            "author": "BlazeUpRaiseUp"
        },
        {
            "level": 0,
            "comment": "Yeah this was one of the reasons i actually ended up moving. Hated every holiday because of it, couldn’t enjoy it because of inconsiderate loud people.",
            "score": 1,
            "author": "-God-Bear-",
            "replies": [
                {
                    "level": 1,
                    "comment": "You moved because the 10 federal holidays a year were too much to overcome?",
                    "score": 1,
                    "author": "Chuck_Roast1993"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My neighbor has live pheasants that they shoot, they are incredibly tame. Him and his rich friends don’t have the best aim, so we have a feral pheasant population of some of the dumbest/tamest pheasants that are pretty much just fox/coyote chow. It’s ridiculous. So when we hear the guns going during the day, we know the yipping and yowling will be going on at night. \n\nAnd we are just wondering why they don’t shoot clay discs because they need to work on their aim? They’re insanely rich. So yeah.",
            "score": 1,
            "author": "nemerosanike"
        },
        {
            "level": 0,
            "comment": "I have several Lyle guns.  They are lifesaving cannons which were designed to shoot a 17 lb. projectile 1/2 mile to pull a line over a grounded ship.  175 lbs. so easy to transport. Loud?  On a calm night they can be heard 25 miles away!  Not fireworks, so legal to shoot in many places, just no projectile.  I just call the local Sherriff's Department to make sure they are OK, let them know when I will be shooting, and FIRE AWAY!  They do get a few calls, these cannons are LOUD, but I am within the law and LE appreciates the heads up.",
            "score": 1,
            "author": "PoppaT1"
        },
        {
            "level": 0,
            "comment": "Preach it, sucks for the livestock as well as dogs.",
            "score": 1,
            "author": "Maximums_kparse14"
        },
        {
            "level": 0,
            "comment": "Yup",
            "score": 1,
            "author": "yamsbear"
        },
        {
            "level": 0,
            "comment": "so you live full time in a place where people only go to vacation and youre upset people are vacationing there??? you sound terrible to hang out with lol. those weekenders are the only reason your poor town has any money at all.",
            "score": 0,
            "author": "gardenlemont"
        },
        {
            "level": 0,
            "comment": "Same. Especially since Memorial Day kicks off our tourist season. It's obnoxious at the very least and downright disasterous at worst. Californians and Texans are the major culprits.",
            "score": -3,
            "author": "ERR404gaming"
        },
        {
            "level": 0,
            "comment": "We've found out last night that our new dog is afraid of fireworks. It's upsetting to know how stressed out she'll be during these holidays.",
            "score": 1,
            "author": "gorgonopsidkid"
        },
        {
            "level": 0,
            "comment": "I always remind myself, at one time in the past I too was a weekender.  I also know many of the amenities in this small town wouldn’t exist if they didn’t come leave money all summer \n\nLife should always be about respect, I was upset when the grocery store had the store full and all three lanes were full this weekend",
            "score": 1,
            "author": "Tater72"
        },
        {
            "level": 0,
            "comment": "I found myself a nice little National Forest spot on the one day and just hid. The crowds are bad but so many normal working families get extremely limited vacation days so this is what they have.   \n\n\nDidn't mean I didn't about want to strangle some of the people on the road when I had to drive to a prearranged spot for the rest of the weekend. Holiday weekends seem to bring out all the bad drivers. Some jerk in front of me gave their kid a wet wipe to toss out the window and the little jerk junior tried to get it on my van. Leaned out the window and aimed.",
            "score": 1,
            "author": "Ok-Opportunity-574"
        },
        {
            "level": 0,
            "comment": "You aren't alone. I'm 43 and feel this way. Never could stand to be around people that feel being obnoxious is the same thing as fun and the holiday weekends seems to make it unavoidable.",
            "score": 1,
            "author": "alreadytakenname3"
        },
        {
            "level": 0,
            "comment": "I shot a group of pigs next to about 50 head of cattle. I don’t know what party city you apparently live in for a holiday weekend to become that but that just a way of life out on the ranch. Guns work and fun.",
            "score": 1,
            "author": "yesterdayCPA"
        },
        {
            "level": 0,
            "comment": "Shouldn’t say you hate",
            "score": 0,
            "author": "Royal_Gur_2651"
        },
        {
            "level": 0,
            "comment": "So other people living their lives and having fun upsets you because ?? They aren’t local? I dont remember your appreciation or anyone else’s being a necessity. And fire arms don’t have to be just for practice and self defense. They can absolutely be for fun in a safe manner as well. You are free to complain and rant all you want, and they are free to ignore it.\nMind your business, enjoy your freedom while we still have it, our great grand kids won’t live In the same America we do.",
            "score": 0,
            "author": "Gnarlybirch"
        }
    ]
}