{
    "id": "13vblhg",
    "score": 1,
    "title": "How to gather up hay with no baler or rake",
    "author": "Due-Soft",
    "date": 1685407212.0,
    "url": "https://www.reddit.com/r/homestead/comments/13vblhg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Every time I brush hog my pasture I try and figure out how to gather it up and package it. It's over an acre. I also just have an 8n. I thought about getting a pine straw rake or landscape rake to help gather it up but I can't get one cheap enough. I only spend maybe 100 a year on hay so it doesn't make sense to spend very much",
    "comments": [
        {
            "level": 0,
            "comment": "I've never done this, but it looks like it works really well: https://www.youtube.com/watch?v=fIVAlV8YVF0&amp;ab_channel=kaivido",
            "score": 3,
            "author": "theyareallgone"
        },
        {
            "level": 0,
            "comment": "I found this about removing on side panel of the brush hog to let the cut grass come out in windrows. This will save you one step. Discussion says it makes good hay. Then just make piles like the next video. Just takes time. We used to do loose hay on one side of our barn. [https://www.yesterdaystractors.com/cgi-bin/viewit.cgi?bd=implment&amp;th=92250](https://www.yesterdaystractors.com/cgi-bin/viewit.cgi?bd=implment&amp;th=92250) and this [https://www.yesterdaystractors.com/cgi-bin/viewit.cgi?bd=implment&amp;th=20804](https://www.yesterdaystractors.com/cgi-bin/viewit.cgi?bd=implment&amp;th=20804)",
            "score": 1,
            "author": "Yum_MrStallone",
            "replies": [
                {
                    "level": 1,
                    "comment": "For some reason my brush hog doesn't spread it out very well and kind of leaves windrows even with all the sides intact. But it's not spinning any faster than it absolutely can with my little 8n. I can barely keep it at pto speed",
                    "score": 1,
                    "author": "Due-Soft",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The suggestion is to remove one of the sides that keeps the grass in the space. Then the grass can blow out one side creating a better windrow.  Can you lift or remove a panel on your mower?  But Maybe the option to use a bagger on a riding lawn mower and *'Bob's Your Uncle'* as they say.",
                            "score": 1,
                            "author": "Yum_MrStallone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought about using my lawn sweeper lol",
                                    "score": 2,
                                    "author": "Due-Soft"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}