{
    "id": "13w3ka1",
    "score": 12,
    "title": "So I’m getting sheep",
    "author": "CowbellBlues",
    "date": 1685484134.0,
    "url": "https://www.reddit.com/r/homestead/comments/13w3ka1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve decided to do away with my kiko goats as my weeders. They’re friendly and entertaining but ultimately goats being goats make them annoying at times for the areas I put them from time to time, such as climbing my duck coop. \nI’m planning on adding sheep now to take their place, I’m looking at 3 breeds, St. Croix, for which Ik a great breeder, American Black belly, aesthetic af, and katahdin, larger carcass and more available in my area. I’ve found breeders for each, didn’t know if y’all thought I should go with carcass size &gt; the hardiness of the other two breeds. I will also be using them to train border collies if that matters, so the ABB may be too wily.",
    "comments": [
        {
            "level": 0,
            "comment": "I mean I love my Katahdin but can say you need to spring for good genetics because there are absolutely rubbish Katahdins out there. Also all the colors of the sheep rainbow 🧡. Also they are docile and EXCELLENT breeders. I had one of my three year olds drop quads and momma like a pro. St. Croix can be good but decent carcass sized ones are hard to find, also a genetic thing that not that many breeders go for. I also rarely worm my Katahdin and they have great parasite resistance 👌. The traits you want are all what good Katahdin breeders select for, I can’t speak to the others because I decided on Kats and have loved them and never looked back. I’d also add feet and legs into the mix because trimming is a pain. Best of luck and update with pics when you get your flock!",
            "score": 6,
            "author": "jesslangridge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah thankfully all the breeders is pike with don’t have to trim hooves, I’ve seen their feet and they are all in good shape.\nI live in MS so wet/warm is the parasite haven. I like the color variety of the kats a lot + the carcass, the guy I’m talking to about St. Croix has registered stock &amp; actually knows Joel Salatin so Ik his line is top shelf",
                    "score": 2,
                    "author": "CowbellBlues",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’d be a good one then. Honestly you can’t go wrong with someone who has solid stock and whose management is similar to how you want to run yours. Also you can get a colored Katahdin ram and put him to some nice St. Croix and you should get some great and colorful babies 🤷🏻‍♀️",
                            "score": 3,
                            "author": "jesslangridge"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope you have better luck with sheep.  I had goats years ago and got a call at 2am from a neighbor asking if I still had them. Yes I said, well they are all standing on her new Lincoln Town Car and would I come get them.\nGot over there and shined a light and was relieved to find that on her car were not goats at all, but our other neighbor's sheep. But the goats were a pain besides.",
            "score": 3,
            "author": "NormanClegg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol, that’s brutal.\nMy family raised wagyu so we like to keep a few goats around for brush control.\nYears ago we had our 3 goats gets loose after a storm.\n2 weeks later we have a neighbor telling us that he heard clonks and stomps on his porch one morning, opened the door, and 3 goats rushed in, stampeded around the house, jumped in the bed with his wife, and later ran back out the front door.\nCut to me and my dad cleaning goat shit off their couch. Never got the goats back either, they wear collars and someone 2 counties over found them &amp; we just let him keep them since it was 8 months after they escaped.",
                    "score": 3,
                    "author": "CowbellBlues"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not very experienced, but my ABB are VERY flighty. Not friendly or curious of us at all, constantly wary. So maybe tough to train the collie in the beginning.",
            "score": 2,
            "author": "Cazarstan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I appreciate the feed back",
                    "score": 1,
                    "author": "CowbellBlues"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely do a soil test and plant identification within your pasture areas they are pickier and more sensitive than goats",
            "score": 2,
            "author": "kinni_grrl"
        },
        {
            "level": 0,
            "comment": "Out of curiosity, did you look at Gulf Coast Sheep? They’ve been a topic of conversation in my family but I haven’t talked to anyone whose had experience with them.  I figured I’d take a chance since you said you were in MS.",
            "score": 1,
            "author": "Cephalopodium",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did, I’ve spoken to a couple people who pride themselves on conserving rare breeds like cracker horses, cotton patch geese, piney wood cattle, and yea, gulfcoast sheep.\nI’d love to get one but they unfortunately are not hair sheep",
                    "score": 2,
                    "author": "CowbellBlues",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, that makes sense.  I can’t say anything about the rare breed thing as once I retire and move back home, I’d love to get a couple American mammoth Jack stock donkeys. 🤓",
                            "score": 2,
                            "author": "Cephalopodium",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same, after I move though, I only plan to be in this property a couple years",
                                    "score": 2,
                                    "author": "CowbellBlues"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If American Black Belly are anything like Barbados Black Belly, you may as well have kept the goats as get them.\n\nKatahdin are really, really tasty and pretty easy to handle.",
            "score": 1,
            "author": "Gingerbread-Cake"
        },
        {
            "level": 0,
            "comment": "Sheep have their own issues. I find them five times more annoying than goats. The stupidity coupled with built in insulation from electric wires makes them a headache.",
            "score": 1,
            "author": "SnoodlyFuzzle"
        }
    ]
}