{
    "id": "13w6437",
    "score": 2,
    "title": "Half practical, half emotional, land thoughts abound",
    "author": "rolandofeld19",
    "date": 1685490450.0,
    "url": "https://www.reddit.com/r/homestead/comments/13w6437",
    "media_urls": [],
    "other_urls": [],
    "postText": "I tend towards the verbose so TL;DR right here:\n\nI'm set to inherit ~120 rural acres in the US South. It has some good/bad points. It is quite far from where life has led me to put down roots.  I don't know what I don't know and I wonder if y'all have faced similar situations in your life. \n\nGeography: NW Alabama but tending towards Birmingham. The footiest of the foothills of the Appalachians.  Not flat, not mountains. Property is bordered by a non-seasonal, 20 foot wide, creek on two sides and has a county blacktop road cutting it into basically 60 acres and 40 acre plots. The bordering river is navigable by small boat/personal watercraft but sees only incidental fisherman, no docks or ramps for a while up or downstream.  It flows slowly, sometimes backwards when far downstream locks/dams stop flow.  Zero flood risk. \n\nLand Ecology: The property is about 70 percent woodland, unmanaged, and 30 percent hay field, casually managed by leasee that cuts it. \n Some older hardwoods but much of it is scrubby pine. Healthy deer, turkey, possum, rabbit populations.  \n\nHistory:  The pasture was once the row crop field of my paternal grandfather and great grandfather, perhaps even further back.  A ruined wall is where washing was done in the past.   Long disused fish capture/raising ponds recount my great grandfather's side business selling bait for long gone fishing camps. A (now inactive, more on this below) is where my father and his siblings bathed growing up.  The 40 acres across the street has been leased for mountain top strip mining 3 times in living memory, about 20 years apart, most recently 10 years ago. Reclaiming efforts that are mandated by law were performed haphazardly and amount to some grading of the land and some pine saplings strewn about.  The spring is long dead.  The river, once clear to the bottom when my father was young, is a permanent zero visibility clay orange from the mining operations of decades ago. \n\nEconomy:  The land is a few miles outside of a town that has been dying for decades. They just closed the local school not too many years ago so even that vestige of strength is gone.  The mines are slowly folding as well.  The feneral population is best described as elderly or addicted. Sad/fading churches, potholes, and kudzu are the icons that I note from afar.  The rest of folks, those who could, have left.   Drug abuse and crime, petty and otherwise are not at all uncommon.\n\nFiscal burdens: There are no liens or other intangible issues with the property, I'm an only child and the property is mine by birthright if I want if.   Yearly taxes are small due to no improvements on the property, though this may go up if inheriting it triggers an accessor visit.  I think my parents are paying $1200 or so a year in taxes, but it could be half of that. \n\nPersonal thoughts/questions, aka the meat and potatoes of this post that I'd love to talk about:\n\nI hate to see the family land that, including my kids, albeit briefly, have played on, at least 6 or 7 generations have owned simply be sold.  But I am realistic and the complications, the ones I've considered listed below, are tough.\n\nI don't live near there anymore, I'm 12 hours away by car and I've seen friends attempt to manage two homes, or a home and a cabin, and it's a heck of a job. Keeping up two places, even if one is rustic, is a stressor to even think about. Roads/trails need maintenance. This is further complicated by the fact that, due to the economic issues above, any improvements are subject to abuse or theft.   Garbage will be dumped, unattended RVs would be noticed and vandalized/stolen/squatted in, cabins would see break-ins and even AC coils or well pumps or electric wires stolen for scrap metal sale.\n\nThere's a small interest from a group of my goodest friends in creating a group owned cabin there. That would help with the issue of not having a presence there by spreading responsibility across more people but, honestly, they don't know the local taboos and idiosyncrasies that this would entail dealing with. Plus 'good walls make good neighbors' or something like that and I'm not sure I want to rism complicating a friendship with the worlds smallest commune, offgrid, cabin homestead.\n\n But, I have always wanted to build an off grid retreat of sorts... It's not impossible insofar as my wife's and my careers are doing well enough to keep it on the back burner, nor do we need the money that would come from a sale of the property.\n\nAnyway... Thanks for your thoughts.  Until the time comes, at least 10 or 15+ years for my kids to finish school, I continue to dream.",
    "comments": [
        {
            "level": 0,
            "comment": "If you don’t need the money from the sale of the property I’d consider the fact that once it’s sold you likely can never get it back.",
            "score": 10,
            "author": "threefrogsonalog",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is true.",
                    "score": 3,
                    "author": "rolandofeld19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At the bare minimum, I would keep it until your kids are grown.  Give them a chance to take it or leave it before you make that choice for them.  For what the taxes and upkeep on vacant land will cost you, I'd at least do that.  I can understand the concerns about putting anything on it.  That really sucks.  But if you just sit on it for another decade or two, it'll probably increase in value so if you still want to sell, it'll be worth a good chunk of change.  And if one of the kids wants it, it'll be there for them to take on.\n\nFor what it takes to maintain bare land, I think it could be worth hanging on to it.\n\nBut I'm not the one paying taxes and having to insure a vacant lot and all that.  But also keep in mind that 120 acres is an expensive thing to buy.  You should hang on to it as long as possible before letting it go just to be sure something/someone doesn't come to mind for it.  Because once it's gone, it's gone.\n\nAlso, as someone who owns 86 acres but lives in a city while building the forever home.... Silence is something I can never seem to find in a city when I need it.  SOMETIMES a city is quiet.  But it's rarely when \\*I\\* want it to be quite.  Or as long as i need it to remain that way.  The peace of mind, stillness, grounding, etc that comes from \"getting away\" to a remote spot is incredibly restorative and shouldn't be discounted.  It's one thing to go camping at a park or something.  You have to worry about strangers wanting to share your spot or accidentally breaking some park rule that gets you a late night knock from a ranger or thieves in the night if you don't lock everything up, etc.  But when it's your land and you own so much of it that if anyone can even hear you, they're trespassing... there's just a layer of stress that melts away.  You don't have to worry about any etiquette or societal norms or anything.  You can just exist and do as you please and not worry about neighbors or other guests or whatever.\n\nI would at least take the kids out a few times to camp and see if anyone seems particularly drawn to it.  You have the rest of your life and theirs to sell it off.  But once you sell it, you're unlikely to ever get it back.  So just be SURE you want to let it go.\n\nAnd if you don't need the money right now, consider sitting on it for a while.  We paid $300/acre in 2015.  But now most property in the area is going for $1000/acre.  That's a $60k profit if we sold at current market rate.  $60k for doing nothing for 8 years.\n\nI also have a property in Cincinnati Ohio I bought for $1k.  It's landlocked.  The township has no plans to extend the road it's \"on\" so that it would be marketable.  Some land in the area just sold for a good price so I asked a realtor to look into it for me.  Land I've never even set foot on.  I've got an offer for $25k.  So just sitting on it until one of the kids needs the money or wants the land may be a good investment.  You never know.",
            "score": 5,
            "author": "BunnyButtAcres",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;having to insure a vacant lot\n\nInsure what?  I'm not sure I understand you.  Do people insure land with no improvements on it? Against what loss?  The taxes are low, that's true.  Again, unless the accessor (is that a commonly done thing when property is inherited/changes hands in AL?) increases the value and things change I suppose.\n\n&amp;#x200B;\n\nI hear you about getting away and not worrying about neighbors. It is good for that.   The only thing that's caused attention to that property was when my aunt's fiancé caused several black ATF SUVs to arrive unannounced due to reports of 'machine gun fire'.  The reports were accurate actually and it was my uncle firing his fully auto weapons at the time.  However, he was a legitimate Class III license holder and had his papers in order and the land is, as you say, large enough that casual firing of weapons isn't a hazard nor unusual for that part of the USA, so it was a bit of a funny scenario actually.",
                    "score": 2,
                    "author": "rolandofeld19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it seems you have concerns about random locals wandering onto the property.  Enough you don't trust leaving things unattended.  That would make me concerned with liability.  I don't know that it'd be considered an \"attractive nuisance\" but if you're concerned with idiot teens or drug addicts or squatters, some kind of liability insurance may not be the worst idea.  Basically it covers your ass from any trespassers or squatters who may injure themselves on the property.  So if some idiot hits a tree root and flies off his ATV.  Or if a drug addict stumbles over a rock and busts his head open.  Your insurance would protect you from any lawsuits they might try to bring.\n\nIt's not something that's necessary everywhere.  Most lots would never need it but you seem really concerned with random traffic.  We got construction insurance to cover our building materials in case of theft but in 8 years of ownership, we've never had any evidence of trespassers.  Mostly because we're not on the way to or from anything or near anything worth going to.  lol.  But it's been something we've kind of been ready to pull the trigger on if it seemed necessary.",
                            "score": 1,
                            "author": "BunnyButtAcres",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm honestly not that concerned with random traffic right now. The whole county is littered with hunting camps, trails, roads, gates, etc that could attract (and also water down) that type of behavior. The property in question is no exception but is one of many but, aside from one tree stand/shooting house, has nothing to gain them besides privacy or the worlds dumbest standing timber theft I suppose.  And behavior like that leading to litigation would absolutely be laughed out of court in that part of the world.  And the folks doing it don't have the money to finance said efforts anyway so it'd have to be a pro-bono case.\n\n&amp;#x200B;\n\nI would be concerned, very much so, with random (or not so random) traffic once improvements were made and there wasn't anyone living there or at the very least checking in every week or two.    Again, poverty and drugs are common and that leads to odd things.  Example from the property in question, and this was 10+ years ago but 100% true, my grandfather kept a full, nice kennel of hunting beagles my entire life.  One day he sees them loose in his backyard, hell, maybe he left a gate open, unlikely but still, he goes outside to put them back away and someone, the individual who had opened the gates to let them out and draw him outside on a random Sunday afternoon, jumps out of the nearby woodline, hits him in the head, takes his wallet, maybe a hundred bucks in it, and vacates the scene.  Drugs man, they make people do odd and evil shit but I also don't want to deal with broken windows and stolen AC coils in a place that would, at best, be called a getaway once any effort is placed into it.",
                                    "score": 1,
                                    "author": "rolandofeld19",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well in that case, you'd have very little upkeep.  Not even insurance payments to worry about.  I'd hang on to it.  Land is pretty much always a good long term investment.  Pay the taxes and at least hang on to it until the kids are older.\n\nHell, you could keep a tally of whatever you've had to pay into it and when one of the kids wants it you can tell them \"Well it's cost me $12k in taxes and upkeep since I took it on.  If you pay me that much, it's all yours.  That way it's not just a hand out, you've technically lost nothing, and your kid gets some land without having to tell people \"my dad gave it to me when I turned 18.\" Sounding like some spoiled rich kid.  lol.\n\n120 acres of usable land isn't exactly an affordable thing these days and it's only going to become less and less likely as time goes on.  So having that option for your kids down the road could be life changing.  Especially for what it's going to cost you annually to just hang on to it.  And if you ever do need the money, it'll always be there to sell later.  But like I said before, once you sell it, it's just gone.  And it'll be hella hard to find another 120 acres worth buying for a price you can afford to pay.  So only sell it when you're SURE you have no interest or use for it.",
                                            "score": 1,
                                            "author": "BunnyButtAcres"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe I missed this in your post, but is there a habitable house on the property? If so, would it be possible to rent it very cheaply to someone who in exchange for cheap rent would take on a caretaker role until it is more feasible for you to move there?",
            "score": 4,
            "author": "Alternative-Bag-9452",
            "replies": [
                {
                    "level": 1,
                    "comment": "No. My dad's portion of the family land did not include his parents home and barn. That went to his sister, my aunt, and has fallen into disrepair.",
                    "score": 3,
                    "author": "rolandofeld19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It may still be possible if you can find someone who wants to be off grid and has their own tiny home/rv setup. Might be hard to find someone you can trust though.",
                            "score": 1,
                            "author": "Alternative-Bag-9452"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As much as I dislike the region, it could make for a nice rustic winter retreat someday. Off grid life there in the summer would be a pain though, if you enjoy ac.\n\nSounds like a headache overall.  Holding onto it could very well pay off one way or another though.",
            "score": 2,
            "author": "LargeMonty",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just don't know how to safeguard the place because anything nicer than a pup tent or a home Depot utility shed is game for theft or mischief if left unoccupied.",
                    "score": 2,
                    "author": "rolandofeld19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking like a camping trip, bring your gear in and take it out. you can fit a lot of supplies in even a relatively small trailer.  And you can get some nice, large heavy duty tents for fairly cheap.\n\nTowing a medium to large camper can get expensive and stressful, just depends what you like to do. \n\n12 hours is a long ways to move stuff too. And that highly depends on what type of vehicle you have.",
                            "score": 1,
                            "author": "LargeMonty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, I understand. I think at that point I'd rather just travel and base camp new places, but yes, good thought.",
                                    "score": 1,
                                    "author": "rolandofeld19"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Inheritance big or small is a blessing. My take? Religious or not, god only put some many acres on this earth. If you have this slice keep it. Your history is there and traditionally speaking the land was meant to be passed down.\n\nSomething like “I’d rather have it and not need it, than need to rely on it and not have it” comes to mind.",
            "score": 2,
            "author": "Antique-Public4876",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said. I inherited some property a few years ago that initially I did not live on. I do now but there’s a ton of work to do. Cool thing, I found an old deed in a mason jar from the 1880’s from when my great great grandfather purchased it. I plan on having it framed eventually.",
                    "score": 3,
                    "author": "Alternative-Bag-9452"
                },
                {
                    "level": 1,
                    "comment": "This is fair.  Worst case, terrible climate scenarios will impact our current locale more than others since we are costal.  So having that land as a fall back isn't an awful idea.  Still, I shudder to even think of the social/geopolitical upheaval that would lead us or my kids to necissitate such a shift.  At that point the rules are changing and all bets are off or so my mind tells me.",
                    "score": 2,
                    "author": "rolandofeld19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The strip mining is what kills this for me, especially since it's affected the water table.  \n\nIt otherwise sounds very nice, even profitable to own. If you don't need to decide what to do with it for a long time, my advice is inherit, keep current leasee on for the hay field/income, and then decide when it's closer to your time of decision-making. I.E.; own it and sit on it.",
            "score": 2,
            "author": "Still-End7791",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes.  The family farmhouse has long since been rendered nearly uninsurable due to blasting settlement paperwork signed by my ancestors that puts the mine owners responsibility for any future house damage (due to settling or sinkholes) into the realm of impossibility.  Again, that's not my problem since my aunt has inherited it and let it fall into disrepair, which is a shame since it was very well built by a builder, my grandfather, his brothers, and my father to boot, from reclaimed timbers in the 1940s from an even older hotel from the local city that they demolished.  Shiplap timbers and heartwood pine throughout, not a sheet of plywood so the house never had any damage anyway.\n\nSitting on it is the null solution. I just want to do it as intelligently as possible if I go that route while also remaining, by choice, remote.",
                    "score": 1,
                    "author": "rolandofeld19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are quite a few red flags in your description of the property. \n\n&gt;The rest of folks, those who could, have left.\n\nThere’s your answer. I would absolutely not hesitate to sell this property if I were in your position.",
            "score": 1,
            "author": "endfossilfuel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, I mean, It's better (to me anyway) than a plot of land without road access or in the middle of the Utah desert but there are many negatives to consider.",
                    "score": 1,
                    "author": "rolandofeld19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think your intuition is right to not sell. \n\nYou mention a lessee -- IMO the first avenue to look into is just keep leasing to them. The land has been fine without you for decades -- can this equilibrium continue if you just don't change anything yet? Are you happy with how they've been caretaking the land so far?\n\nIf your friends want to build something on part of the land, consider how it'd impact the lessee. Also consider the worst case of how the group could fall apart, and plan for ways to dissolve it that wouldn't give your people a claim to try to take your land. Talk to a lawyer about how to structure things so that the agreements you make when everyone is on good terms will be enforceable if that changes. But with a robust agreement, having friends build stuff there could potentially be great. Just make sure you're respectful of the neighbors in what and how you build.",
            "score": 1,
            "author": "SherrifOfNothingtown",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;can this equilibrium continue if you just don't change anything yet? Are you happy with how they've been caretaking the land so far?\n\nThey literally just cut the hay, bale it, and move it out.  I doubt they even fertilize as my grandfather/great-uncle did when they cut it for hay late in their lives but I could be wrong there.  There's no caretaking and no oversight. Even local family in the area is unreliable/distant to the point that I'd have to pay them to do anything beyond tell me if the timber burnt to the ground or had an active squatters camp of half a dozen or more there. \n\n&amp;#x200B;\n\nThe problem with the friends aspect is that they are remote as well.  So honestly whatever we create will only see use, max, a few weeks a year.  Not enough in my opinion to keep it secure and relatively reliable in the interim.\n\n&amp;#x200B;\n\nThe neighbors are family, mostly distant family now, and the property large enough and the local mindset lassie faire/mind your own business enough that, short of actually making meth long term or creating multiple house sized bonfires on repeat occasions, any pissing off of them is pretty hard to imagine.",
                    "score": 1,
                    "author": "rolandofeld19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep it and look into whether or not it’s viable for cutting timber on. You could also lease the land for hunting purposes. That much land with the water access on it would likely be prime for a hunter to pay to lease and hunt on. My brother is a real estate agent in Birmingham. He works for a developer now but previously specialized in large tracts of land. With it being generational land at least consider keeping it to pass on to future generations. There has been development in Alabama and if it’s commutable to Birmingham then there’s a possibility the area could eventually turn around and your children could opt to use the land. Once it’s gone though it’ll never be yours again and land like this is becoming rare and expensive to find.",
            "score": 1,
            "author": "Littlelady0410"
        }
    ]
}