{
    "id": "13wxt0v",
    "score": 2,
    "title": "In search for a large stand-up freezer that can run on solar and propane, does this exist?",
    "author": "fairyprincest",
    "date": 1685566612.0,
    "url": "https://www.reddit.com/r/homestead/comments/13wxt0v",
    "media_urls": [],
    "other_urls": [],
    "postText": "My husband and I are wanting a large stand-up freezer to store meat that we harvest from our homestead. I'm wanting to find something that's dual fuel for both solar and propane. We have a large solar setup and all the sun in the world but I feel like it's always better to have a back up incase our system goes down, gets damaged or we have a long period of no sun but I'm having no luck finding anything that isn't a tiny little chest freezer.  So I'm wondering if we need to just go straight propane or solar or if there is anything out there that I'm not finding, any advice is appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "I would highly suggest you just go electric.  There are several models that run on both propane and electricity, but they use an ammonia refrigeration system that is finicky at best, and uses a ton of electricity as the electricity methodology is to heat up the ammonia using a resistive circuit.  Very inefficient.  I use to have one of these and it was not very reliable and used up a lot of propane.\n\nI switched to a unique appliances fridge/freezer, and stand up deep freezer a couple of years ago and have never looked back.  They can run on 12/24v and are very efficient.  Also very reliable and use way less electricity than a standard model, and run DC so I don't have to fire the inverter.  They use a danfoss compressor which is tried and true, and work much like a regular fridge.\n\nThe propane one was stinky, varied in temp a lot, and was heavy and took up a lot of space.\n\nSo in my opinion, I would say just stick with a DC powered fridge that is high efficiency, and work on a backup generator to charge the batteries on autostart if you are concerned about the amount of sun.",
            "score": 3,
            "author": "clifwlkr"
        },
        {
            "level": 0,
            "comment": "Not an upright but a chest model.\n\nhttps://www.amazon.com/SMETA-Electric-Freezer-Lockable-Absorption/dp/B0714KT12J",
            "score": 2,
            "author": "bkwSoft"
        },
        {
            "level": 0,
            "comment": "I have seen solar specific freezers, and I have seen gas specific freezers, but never one that is capable of both.",
            "score": 1,
            "author": "kabula_lampur"
        },
        {
            "level": 0,
            "comment": "Why not get a propane generator? Propane and electric refrigeration work very differently, but a backup for your solar, to make sure those electrons keep flowing, may be the ticket",
            "score": 1,
            "author": "Gingerbread-Cake",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have a dual fuel propane/gas generator I was just looking for an alternative from having to run a noisy generator, but am realizing that this may not be the case. Thank you for the reply!",
                    "score": 1,
                    "author": "fairyprincest"
                }
            ]
        }
    ]
}