{
    "id": "13yj3hz",
    "score": 23,
    "title": "How to kill a chicken?",
    "author": "xxxxbbbb",
    "date": 1685727222.0,
    "url": "https://www.reddit.com/r/homestead/comments/13yj3hz",
    "media_urls": [],
    "other_urls": [],
    "postText": "My dad sadly and suddenly passed away this week and we have live chicken to process. We have a funnel he used to make it easier for him and for the chicken. I remember he used a knife, not an axe. He would leave the neck partially and only removed the head. I watched him do it my whole life but I usually helped my mom take care of the insides. Videos on youtube are not clear if there's a certain angle to cut the head and where exactly to cut. I need concrete advice and soon cuz chicks are ready for processing and it would be best for us to do it over this weekend. Thank you in advance.\n\nEdit: thanks guys, we ended up using an axe cuz I guess you need to be strong enough to get knife trough the neck like butter after all. I messed up the first one and felt rly bad but i guess i know better now for the future. Chicks were also too fat to put them trough the funnel and the whole \"holding them downside and covering their head to calm them\" rly worked. Again, thank all of you, I'll probably ask for more advice in the future (maybe not considering chickens).",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry for your loss.",
            "score": 22,
            "author": "Karmic-Vision",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks 💙",
                    "score": 4,
                    "author": "xxxxbbbb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the part of processing everyone hates. I hate it but it has to be done. Kill cone is ok. Grab the bird by the feet with one hand. Hold it upside down for a few seconds, it should relax. Slide it down in the cone, keep its feet firmly held while you do, may have to use the other hand to gently guide its head through the bottom of the cone.   Let the bird relax. Use a VERY sharp knife or a new razor knife.  Grab the head between two fingers, firmly and stretch the neck so you get good contact with the knife blade, ( you are committed at this point, do not hesitate or back off, this is the point where you  have control over whether or not the bird suffers) - slice the neck, down towards the base of the head, deep and fast, at least 3/4 the way through, back away a foot or two, try not to let the dying process get to you, the bird can no longer feel at this point. This will stop in a few seconds.   It’s scalder, plucker and dressing out from here.",
            "score": 54,
            "author": "airwolf_x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you 💙",
                    "score": 11,
                    "author": "xxxxbbbb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is an excellent answer. The things I'd add are: \n\n* Covering the bird's face with my hand seems to help it stay calm through the process -- I think because having the face in darkness triggers a \"chill out, it's night time\" reflex\n\n* New razor blade in a box cutter with replaceable blades is my go-to. You want the ones that take single trapezoidal blades, not the ones whose blades you break off as you use them. \n\n* You can feel the pulse in the bird's throat if you palpate right before cutting. That pulse is what you're aiming to sever. \n\n* If your first cut doesn't yield a gush of blood, cut again deep and fast. The bird is dying already and your job is to make it as quick and painless as you can. \n\n* If you hold the head in your hand while slitting the throat, blood may drip down your arm depending on where your arm is. I just roll up my sleeves, but if you're squeamish, you may want to adjust the angle of your arm appropriately. \n\n* It's helpful to have someone hold the bird's feet in the cone. That or secure them with something soft (I put my coat over the top of the cone when I have to process birds solo). During death, the body will spasm, because that's what bodies do. It doesn't mean the bird's alive. \n\n* After the blood is out and the body has done its kicks, I like to immediately remove the head with poultry shears. Then swish the body in a large pot of scalding-hot water that you prepared before starting to butcher, pull the feathers off (body feathers come off in handfulls, whereas wing and tail feathers are best yanked one by one along the direction of the feather shaft), and take the guts out. \n\n* I leave the feet on to hold the carcass with while plucking it, the remove them before or while taking the guts out. Feet are easily removed by cutting the skin and tendons at the knee joint.\n\n* When removing the guts, if you compress the lungs and you cut the neck above the larynx, you may push air through the larynx and the body may make a noise. This does not mean that the bird is alive. This just means that you shoved air though a body part that makes noises when air gets shoved through it. \n\n* In rooster entrails you will find an almost rock-hard, golf-ball-sized lump. This is not an ovary, it's the gizzard. First time I gutted a rooster I found it and had a moment of terror that I'd messed up and killed a hen... You can dissect the gizzard and see that it's almost-solid muscle.\n\n* Depending on your spirituality, you might talk to the animal as you're processing it, perhaps even telling it about people who've passed on that it might meet if it turns out that dead things go somewhere afterwards. It can feel good to thank the animal for doing so well at fulfilling its purpose, and it can feel good to ask it to carry a message to someone if it happens to encounter them.",
                            "score": 24,
                            "author": "SherrifOfNothingtown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Amazing",
                                    "score": 2,
                                    "author": "germanbeergirl"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you for the last part of your comment, such a good idea!",
                                    "score": 1,
                                    "author": "meleday"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "These are great instructions. I would like to add that I continue to hold on to the neck while the blood drains out. After the bird has died some sort of reaction happens with their nerves and it will flop around a good bit: by continuing to hold on to its head for a bit after it passes prevents them from flopping themselves right out of the cone.\n\nAlso, make sure your knife blade is super sharp. I test this by slicing a piece of paper. If it easily cuts the paper, it’s sharp.",
                            "score": 6,
                            "author": "Syomm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The flopping is caused if part of the cerebellum is left in place during the process. I.e. the phrase running around like a chicken with its head cut off. There was actually a bird that lived for a very long time after he was beheaded. Gave him water with a dropper iirc",
                                    "score": 5,
                                    "author": "RyzenDead",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mike the Headless Chicken, was a Wyandotte.",
                                            "score": 3,
                                            "author": "RyzenDead"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks for this explanation. I saw the story of this chicken! I’m terrified of something like this every time I process birds!",
                                            "score": 3,
                                            "author": "Syomm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well remember this, the more you panic the more they suffer, if you screw up the first time. Make sure it’s dead quickly on the second shot. It may suck, but the point is to end the suffering quickly. Panicking and freaking out only delays it, bite your lip, and remember cowgirls don’t cry. \n\n(I’m assuming you’re female not because of the subject but because of the heart emoji in another response, my bad if I’m wrong either way you got this)",
                                                    "score": 3,
                                                    "author": "RyzenDead"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m so sorry I thought you were OP",
                                                    "score": 3,
                                                    "author": "RyzenDead"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is the funnel really worth it? My girlfriend and me always use an axe. Personally i just feel better Ehen the head comes of in one nice Swing.\n\nBut i guess the cone makes it easier to avoid all the blood, when it starts flapping. Somehow i as the axe-swinger stay relatively clean, but my girlfriend offen times gets bloody while holding it down.\n\n(We always wrap the chicken in a towel, place it on a wooden board on the ground and decapitate it there, while one person presses it down gently)\n\nIs there something you should check, while processing the carcas? Like check organs for parasites or something like they do when slaughtering pigs?",
                    "score": 2,
                    "author": "NoDisplay4012",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So, op is obviously a beginner at this and the cone does make it feel a little tamer I suppose.  Easier and less brutal feeling. I have been doing this for a long time and at this point and have my own way that I feel is more humane and painless than all of the showmanship involved with trying to calm and kill, I use a log and a small sharp hatchet for on farm processing.  (20 or so birds at a time) The process is about 3 seconds from catching the bird to done and it took practice and there is a method to it. I feel this instant kill is much more humane than drawing it out into a long process. \n\nGenerally you will know if the chicken is healthy. I only eat healthy looking birds that I kill and prep.  If they die on their own or are killed by another animal, no dice.",
                            "score": 3,
                            "author": "airwolf_x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, OK.\n\nAt first we where not sure if we should hit the chicken with a stick before we decapitate it. I think officially that is what is sugested by the state where we live, but i dont see a reason to make two hits with two different items, when one will do. I trust myself to hit it once with an axe, instead of bashing it with a stick first and slaughtering it after that.\n\nPigs and cows are also slaughtered in one quick shot with the air-pressure-bolter thing as far as i know from the things my grandpa told me. But i dont really trust hin to give me advice regarding small animals. People in the past where mit really regarding the humane slaughter of small animals because they wont do any damage, when things go wrong.\n\nIs there any positive to defeather the chicken instead of skinning it?",
                                    "score": 2,
                                    "author": "NoDisplay4012",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Chicken skin is tasty, and cooking with the skin on makes the meat juicier.",
                                            "score": 4,
                                            "author": "treeborg-"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't get nervous and  cut yourself-  make sure your hand is not in the path of the blade- make sure every time",
            "score": 8,
            "author": "Mountainlivin78"
        },
        {
            "level": 0,
            "comment": "Previously I did the cone method.  I’ve also tried the axe method but my favorite is the broomstick method\n\nCone method explained very well already. Solid advice given.  \n\nAxe is messy.  A bloody mess… just no thanks. \n\nThe broomstick method is used for rabbits the most.  I tried it with geese and it was perfect.  I plan to do it again on my bachelor flock of roosters. \n\nWith the broomstick you take a bar (we use rebar) and lay it across the back of the head (just behind the skull).  And in one motion stead on the bar and pull its feet up.   It pops the head off the spine.  The kill is instant.  It will death flap (the spasms) but that means it’s done.  The broomstick got them there quickest.  Quail process similarly but you can just use your hands.  \n\nImmediately after the death flap/spasms are over I remove the head and hang upside down to drain.  This way I feel is fast and clean.\n\nEdit to add - when you do the broomstick method put the bird in a feed bag so they can’t flap.  Cut a corner off the bottom and put the chicken in head first so you can pull it out the corner you cut out.  Tighten the bag so it wraps around hugging the bird to hold its wings down.",
            "score": 5,
            "author": "epilp123"
        },
        {
            "level": 0,
            "comment": "Broomstick. There are some compassionate videos on YouTube showing how. Sorry you are going through this.",
            "score": 2,
            "author": "CaptainBeneficial932"
        },
        {
            "level": 0,
            "comment": "My grandma’s method was 2 nails in a stump about an inch apart, and a sharp hatchet. Do the deed, and let it run around and bleed out.",
            "score": 2,
            "author": "Sea_Ganache620"
        },
        {
            "level": 0,
            "comment": "If you can get a cut resistant glove, I'd recommend it for the hand holding the head, both for safety and to give you the confidence to do a quick, deep cut with the knife.\n\nI usually hold their head back/up after cutting the throat - it's easier to know they're already dead when gravity is holding their eyes shut rather than open. \n\nThey'll be still and peaceful for a few seconds after they die, and then the post mortem reflexes kick in - wait until those have passed before taking them out of the cone. If you take them out too quickly and then the kicking starts, it gets messy.",
            "score": 2,
            "author": "reddit_username_yo"
        },
        {
            "level": 0,
            "comment": "Just grab it by the neck and twist it really fast like a windmill",
            "score": -1,
            "author": "Popeye_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "…so, you’re basically telling OP to choke their chicken?",
                    "score": 8,
                    "author": "Slow_Stable5239"
                }
            ]
        },
        {
            "level": 0,
            "comment": " In essence",
            "score": -1,
            "author": "Popeye_01"
        }
    ]
}