{
    "id": "13zisix",
    "score": 115,
    "title": "Finally finished my garden",
    "author": "ZachyChan013",
    "date": 1685811723.0,
    "url": "https://www.reddit.com/r/homestead/comments/13zisix",
    "media_urls": [],
    "other_urls": [],
    "postText": "Took a good bit of doing but it’s finally done. Needed an 8’ fence to keep my chickens out. And raised beds because of our huge gopher population, not to mention making me feel a bit better about snakes \n\nEverything but the fencing and the 6 8’ fence posts were scavenged or recycled. Built it with only a bit of help from my 3 yo, who was a trooper through the 95+ week I was getting the boxes done",
    "comments": [
        {
            "level": 0,
            "comment": "I love it. I really wish I knew how to build a fence and gate that nice.",
            "score": 8,
            "author": "NoShip7475",
            "replies": [
                {
                    "level": 1,
                    "comment": "All you can do is try! This was my second time pulling fence, and first time doing a double decker. Let alone doing the posts and bracing like this. And the first time time I built a gate like that. Well I had built smaller 4’ ones similar, but they were just boxes, didn’t have the middle bits of wood \n\nIt was a lot of work, but if you’re handy it’s not overly complicated. And if you’re not there’s always YouTube! Or advice from people on Reddit!",
                    "score": 5,
                    "author": "ZachyChan013"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks nice",
            "score": 3,
            "author": "tequila-sin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 3,
                    "author": "ZachyChan013"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lookin good. Congrats.",
            "score": 3,
            "author": "tacticalwhale530"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No real resources on them as I had seen them before and just went off memory. Though I’m sure YouTube has videos on them \n\nBut I took 2x4s and cut them to the hight of my tin. Then a 2x4 for the top and bottom the length of the tin. Screwed them together and that was my frame work. With the 2x4 length being the inside board \n\nFrom there I split it in to 2-4 part and did more full length 2x4s for those. So you end up with 2x4s the full hight of your tin on the outside of your planter box. (On my 14’ box’s my outside boards were 4x4)\n\nThen I cut shorter 2x4s to go on the inside of the full hight uprights. This brought the the outside frame against the tin. Ten I screw the tin on. And boom you’ve got a side. \n\nOn the ends I didn’t do the double layered 2x4s as it’s not getting as much pressure. I toenailed the 2x4s together and then screw the short ends of the planter boxes into the long sides. \n\nTopped them off with a pice of 1x4 that I 45d and it adds a lot of strength. Also on my longer boxes I took some 3’ metal steaks and drive them in aft them middle of the box (on the inside) screwed them to the planter boxes and wrapped tie wire in a loop. Until I had about 5 wraps, then spun it like a cable to keep my boxes from bowing out. \n\nAs for soil, I took big rotting wood and filled the boots. Then some rough compost. Then 8-10 inches of soil that I bought. Sorry I can’t give more help on detailed soil improvements as I just bought soil ready to go \n\n\nI tried to explain as best I could. But I know words don’t do much justice. Please feel free to ask any questions you’ve got or for clarification. I’ll also put in a few more pictures, maybe they’ll help \n\nhttps://imgur.com/a/kYhO4v8",
                    "score": 3,
                    "author": "ZachyChan013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One thing I would add to this, every 4-8 feet one of your vertical 2x4’s needs to go down into the ground by a couple feet. Roughly 3 years later, even with extra bracing, our raised beds without those stakes driven down into the ground started bowing out from the continued pressure of the dirt inside.",
                                    "score": 2,
                                    "author": "argetlamzn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can \"finish\" a garden?!",
            "score": 3,
            "author": "probablygonnabooyah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well the fence and planter boxes are finished l. The weeding and planting and everything else is always going to be going",
                    "score": 3,
                    "author": "ZachyChan013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'll add more. We always add more! Hey look! A place to put some cuttings! Oh, I can squeeze in a couple more plants in this corner. I thought I was done too. Done is a dream i didn't know existed.",
                            "score": 2,
                            "author": "probablygonnabooyah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sweet fence design! Splits a whimsical and professional trade off nicely. Those look like SoCal eucalyptus trees to me, I lived in that neck of the woods for a while. Also good use of rotting wood in the beds- I’m reading the holistic orchard rn and dead wood (lignin) seems to be key to root/fungus interaction. Happy growing!",
            "score": 3,
            "author": "HowardDopamine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! The struts were a latter addition after my home made brackets had to much wiggle room. I actually think I like it more with the struts, gives it some depth\n\nEdit, and close on the location. I’m actually in norcal",
                    "score": 2,
                    "author": "ZachyChan013"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heya, question.. shouldn't the diagonal struts on your gate/door run in the other direction?",
            "score": 2,
            "author": "tuatantra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really not sure. I had the same question. I googled doors and the few images I found had the struts going from the hinges to the latch",
                    "score": 3,
                    "author": "ZachyChan013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmm. I think if you open the door and hang off it, it will support more weight because that corner will distribute the force down to the hinge side. It will last longer that way too as the door won't be as likely to sag. Looks great either way though, good job.",
                            "score": 2,
                            "author": "tuatantra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Makes sense. Oh well I’m not planning on hanging off of it haha. I can always turn it around if it starts to sag. It’s just hog wire sandwiches between some 1x4s",
                                    "score": 3,
                                    "author": "ZachyChan013"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a garden of my dreams! Looks great, good job.",
            "score": 1,
            "author": "-CloudHopper-"
        },
        {
            "level": 0,
            "comment": "just curious of your location-- are those long leaf eucalyptus?&gt;",
            "score": 1,
            "author": "foreskinfive",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m in norther California . Couldn’t tell you what kind of euc they are though",
                    "score": 1,
                    "author": "ZachyChan013"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is a lot of shade for a garden.",
            "score": 1,
            "author": "kiamori",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s in direct sun for a solid 6+ hours a day. And it is often 110+ in the summer. I think some shade will be good for it",
                    "score": 1,
                    "author": "ZachyChan013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can keep your 110º, a hot day up here is 90º\n\nBut I can send some mosquito's down your way? They love to help you garden up here.",
                            "score": 1,
                            "author": "kiamori",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "110 is pretty normal haha. A real hot day is in the low 120s. \n\nI’ve got plenty of my own mosquitos thanks. You can keep yours haha",
                                    "score": 1,
                                    "author": "ZachyChan013",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure how you can stand that kind of heat, we were jumping in the lake before the ice was melted all the way off this year when we went from -20º to high 70's in about a week. Best time of year, early spring before the mosquitoes are out in droves.",
                                            "score": 1,
                                            "author": "kiamori",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All you can do is grin and bear it really. It’s not the best. Specially since we just got back from 5 years in Scotland. Where a 75 day is fucking hot",
                                                    "score": 1,
                                                    "author": "ZachyChan013"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, engineers? And awesome!!!",
            "score": 1,
            "author": "Due-Confidence-140",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, engineers? Not sure what you’re talking about there haha",
                    "score": 1,
                    "author": "ZachyChan013"
                }
            ]
        }
    ]
}