{
    "id": "142985i",
    "score": 5,
    "title": "How to keep groundhogs out of my garden",
    "author": "deepsqu1rts",
    "date": 1686041185.0,
    "url": "https://www.reddit.com/r/homestead/comments/142985i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking for suggestions to keep those little bastards out of my garden.\n\nFencing is an option but expensive.\nI've tried a scarecrow and pissing around the area.\nI've heard they make great BBQ but this would be a last resort.",
    "comments": [
        {
            "level": 0,
            "comment": "A .22 rifle works best.",
            "score": 6,
            "author": "tinman7889",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I actually keep a Ruger MKII pistol topped off with subsonic ammo for deterring garden pests, mostly ground squrriels, but also rabbits. I am considering an air rifle \n\nI also use heavy duty rat traps baited with my radish or beet tops or peanuts. I might set 7 or 8 of them a day when they are really pushing into the garden hard, as they will as the summer drags on.\n\nIt also helps to make it an unfriendly environment. I have been removing or burning brush piles that give the rodents cover from hawks and owls etc. It's an ongoing project.",
                    "score": 1,
                    "author": "EasyAcresPaul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not great for BBQ, but they are a good stew meat.  .22lr will get it done.",
            "score": 2,
            "author": "Chak-Ek"
        },
        {
            "level": 0,
            "comment": "People call them \"whistle pigs\" around here. They are so fat that they whistle in the frying pan.",
            "score": 2,
            "author": "AmeliaCameleon"
        },
        {
            "level": 0,
            "comment": "Take an old mower engine, hook a metal pipe to the exhaust,  stick it in the burrow hole, run a tank of fuel. They go to sleep, don't wake up. Works on all burrowing varmints.",
            "score": 2,
            "author": "furrylittleotter",
            "replies": [
                {
                    "level": 1,
                    "comment": "This does work. I haven't personally done it, but I have seen it in action.",
                    "score": 1,
                    "author": "esleydobemos"
                },
                {
                    "level": 1,
                    "comment": "Plus, free fertilizer!",
                    "score": 1,
                    "author": "SHOWTIME316"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have a farm dog? We haven't lost a single chicken to a predator since we got our dog 2 years ago. Bye bye raccoons!",
            "score": 1,
            "author": "AmeliaCameleon"
        },
        {
            "level": 0,
            "comment": "220 conibear trap",
            "score": 1,
            "author": "SieveAndTheSand",
            "replies": [
                {
                    "level": 1,
                    "comment": ".220 Swift works, too!",
                    "score": 1,
                    "author": "mf4263"
                },
                {
                    "level": 1,
                    "comment": "I was gonna say 160,but yeah...",
                    "score": 1,
                    "author": "TrapperJon"
                }
            ]
        },
        {
            "level": 0,
            "comment": ".22 magnum.  Coyotes take care of the rest usually within a day.",
            "score": 1,
            "author": "46tcraft"
        },
        {
            "level": 0,
            "comment": "I live in a town and can't use a firearm within town limits for this. My dog has killed a few but they keep coming back. What else can I try? I've not had a successful garden since I moved in between the groundhogs and raccoons. It's worse here than in rural area I lived in before. Even the rabbit population has exploded.",
            "score": 1,
            "author": "stlhaunted",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you have a hardware cloth fence around your garden that extends below grade?",
                    "score": 1,
                    "author": "they_have_no_bullets"
                }
            ]
        }
    ]
}