{
    "id": "143u5hd",
    "score": 2,
    "title": "Electric fence not shocking",
    "author": "sirch05",
    "date": 1686184430.0,
    "url": "https://www.reddit.com/r/homestead/comments/143u5hd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m new to the electric fencing. I bought a meter and my charger shows a meter as well. It shows it’s hitting 6k volts but when I touch the fence it’s hardly noticeable. In fact my pigs are rubbing against it and not even bothered. What can my issue be?",
    "comments": [
        {
            "level": 0,
            "comment": "Is the ground wet enough? Do you have a deep ground rod? Do you have 2 grounding rods?\n\nI’d start there but I’m no expert",
            "score": 6,
            "author": "lbizfoshizz",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is our problem in the summer.  Have to soak the ground for awhile to make the shock strong enough. Also, a single line vs netting, weed growth shorting out the lines, and yeah, grounding rods.",
                    "score": 2,
                    "author": "mrsducky9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make sure nothing is touching the wire that shouldn't be like small tree limbs",
            "score": 3,
            "author": "thedevilsgame"
        },
        {
            "level": 0,
            "comment": "Usually it’s improper earthing or else something touching the electric wire and shorting it out. \n\nDid you instal the fence? If so, check you’ve followed the instructions about earth rods correctly.\n\nIf the earth is good, check the wires. If your fence tester has amps as well as volts you can find faults by working along the fence testing as you go - the amps reading will be high before the fault then drop to zero past it. If you don’t have that, walk along the fence looking for places where the hot wire is touching anything it shouldn’t, like long grass or uninsulated wires.",
            "score": 2,
            "author": "mynameisneddy"
        },
        {
            "level": 0,
            "comment": "1) is the circuit open or did you close it on itself?  One end if the fence should *not* touch the other.\n\n2) is it grounded well?  A good copper ground rod should be driven deep.\n\n3) is there a lot of weed growth along the fence?  Anything else that could be ahorting it out?\n\n4)  is the charger large enough for the amount of fence you have hooked up?",
            "score": 2,
            "author": "TrapperJon"
        }
    ]
}