{
    "id": "144bhik",
    "score": 2,
    "title": "Homestead first time question.",
    "author": "flanneldingo",
    "date": 1686236178.0,
    "url": "https://www.reddit.com/r/homestead/comments/144bhik",
    "media_urls": [],
    "other_urls": [],
    "postText": "I apologize if this has been asked before, however with home prices being what they are, I've been looking at buying land and just building my own homestead. I've seen land selling for about 25k a acre in south Georgia. I've also found a used mobile home I can purchase for about 50k. I'm guessing well and septic should cost about 15k combined. Is there any other large sticker items I should consider before making the leap or any sagely advice? Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "yes, the mobile home will require a concrete slab as well. starting from just land, you need to find out how deep water will be in that area. \n\nNo matter how you go, double your estimate to cover this things that happen along the way",
            "score": 13,
            "author": "Indecks9999",
            "replies": [
                {
                    "level": 1,
                    "comment": "?? I've never seen a mobile home on a slab. I've seen blocks and pillars. These things may change greatly in different regions though.",
                    "score": 3,
                    "author": "Hinter-Lander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Slab or pier type, will still need site prep th put one in.\n\nDepending on where, some will require alot of work to meet code",
                            "score": 2,
                            "author": "Indecks9999"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Call well drillers and get an estimate.  Our well was $14k.  Someone in Cali with the same depth was quoted $28k.\n\nTalk to planning and zoning.  Can you live in a mobile home on private land?  Is there a limit on how long?  Is there anything you need to do to make sure you're within regulations?\n\nLocation is everything.  $25k an acre is a good price in some markets and insanely high in others.  At that price, you'll be limited on how many acres you can buy so I would also research AUs (animal units (per acre)) for that area.  You may come to find out that you can't afford the acreage to meet the minimum requirements for the number of animals you want of a given species.  Stuff like that is just so county specific nobody can really tell you what the laws will be where you're looking except those who have already done it in that location or the local authorities.  When in doubt, ask planning and zoning.  Before buying, before breaking ground, before building....if you care about staying on the right side of the law, anyhow.",
            "score": 7,
            "author": "BunnyButtAcres"
        },
        {
            "level": 0,
            "comment": "Depends on how much of the work you can do yourself. \n\nI paid $5k for my septic. The materials and plans  cost me $4000 and I paid someone $1k to just dig for me. I did the rest of the work myself. \n\nFor my well, I paid a well driller $2k to just drill and case the well. I installed the pump and pipe and paid someone $500 to dig and backfill the trench to the house. Did all the rest myself. \n\nThen there’s the cost to run electric. I’m 100yds off the road so I had to pay someone $500 to dig and backfill the trench for my underground wire. I did the rest myself. \n\nWe first bought a mobile home and moved it to our property while we built a house. The mobile home movers wanted $5k to takedown and assemble the mobile home. I worked a deal where I got it all ready to move and they just hooked up to it and towed it to my property and I set it all back up. I think 50k is a little steep for a used mobile home. I paid $1500 for mine. I didn’t care that it was crappy. It was a temporary place for my family. \n\nEverything was inspected before operation and I saved a bunch.",
            "score": 5,
            "author": "Woodrow_F_Call_0106"
        },
        {
            "level": 0,
            "comment": "In the area you're considering buying, figure out what well and septic companies offer their services. Figure out what power companies you could get a grid hookup from. Contact those companies and get an estimate of the price you'd be looking at.",
            "score": 2,
            "author": "SherrifOfNothingtown"
        },
        {
            "level": 0,
            "comment": "Just from my experience, find out what your impact fees are for building on the land. On ours, it was 13k 😢",
            "score": 2,
            "author": "when-will-it_end"
        },
        {
            "level": 0,
            "comment": "Current update I've called the county zoning office and left voicemails like 6 times. I really appreciate everyone's help and advice. I'll try calling some well and septic companies as well.",
            "score": 2,
            "author": "flanneldingo"
        },
        {
            "level": 0,
            "comment": "I am not American and I don't know your rules and laws, but are you required to have a septic tank?\n\nI am Swedish and here you can get a permission from the municipality to have toilet compost, and dish and cleaning water can be flushed out on grass if you don't use chemicals. \n\nIf this is possible and you are tight with money, this might be something to consider. I have done this on our mini-farm and it is very efficient when you can collect urin for fertilizer, faeces for soil improvement (after thorough treatment) and an extremely low tech system that requires no electricity, almost no tech and costs you nothing in maintenance.\n\nWe live at an old place with a dug well which we scoop water from with a bucket, but a drilled well connected to an electric or hand pump does of course work well too.",
            "score": 1,
            "author": "birgor"
        }
    ]
}