{
    "id": "145lc68",
    "score": 10,
    "title": "Testing soil for prion ?",
    "author": "Both_Canary1508",
    "date": 1686356110.0,
    "url": "https://www.reddit.com/r/homestead/comments/145lc68",
    "media_urls": [],
    "other_urls": [],
    "postText": "I live in an area with alot of backwoods and hunting. All the wild game butchers here test each animal for prion disease and it is standard practice. There has been an uptick of prion recorded in a region in my province, (not alot, just a couple % increase) its in the only area with cheaper land that isnt too far north to farm. However its relatively remote with high concentrations of elk and deer, and i know that animals can get prion from a number of sources including soil, and im wondering if its standard practice to test soil for prion for small homesteads, what the process is, and if anybody has experienced a prion outbreak on their homestead and what the experience was like? Thanks for any info, was not able to find much so it may be a stupid question.",
    "comments": [
        {
            "level": 0,
            "comment": "Do you know how they're testing?\n\nHere in Ohio, USA, we're just starting to see evidence of Chronic Wasting Disease in the deer but everyone is saying there's no test for it.",
            "score": 2,
            "author": "williaty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not OP, but the only way I've ever seen CWD tested for is in post-mortem samples. https://www.aphis.usda.gov/aphis/ourfocus/animalhealth/nvap/NVAP-Reference-Guide/Control-and-Eradication/Chronic-Wasting-Disease#:~:text=Testing,the%20medial%20retropharyngeal%20lymph%20nodes.\n\nI've never heard of any labs that do the work commercially or in sufficient volume that it would be feasible for it to be a regular thing for harvested wild game, but the USDA site does specifically say \"Several approved laboratories exist with sufficient capacity to provide fee-for-service testing for samples collected by individual hunters. \" So clearly there's some bulk testing going somewhere.",
                    "score": 1,
                    "author": "FireITGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you identified any company that does this testing? I'm reasonably familiar with prion diseases and I've never heard of soil testing outside of research/academia. Just one-off projects and studies. Definitely not as something you'd be able to hire a company to do.",
            "score": 1,
            "author": "FireITGuy"
        }
    ]
}