{
    "id": "146486n",
    "score": 2,
    "title": "Any Advice",
    "author": "Haystxck",
    "date": 1686413743.0,
    "url": "https://www.reddit.com/r/homestead/comments/146486n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone. I’m saving up money so I can buy a house and some land to start my own homestead. \n\nAny advice for a girl raised in a city environment who dreams of being more self sufficient?",
    "comments": [
        {
            "level": 0,
            "comment": "Start small and learn what you can in the space you have. A backyard or balcony garden, small scale composting, canning and other food preservation, etc. are all things that will serve you well in the future that you can start learning how to do now.",
            "score": 10,
            "author": "iamabarnacle"
        },
        {
            "level": 0,
            "comment": "Start gardening where you are. If that means a tomato in a five gallon bucket on a balcony, do it.",
            "score": 6,
            "author": "Fun_Buy"
        },
        {
            "level": 0,
            "comment": "Go WWOOFing! Either one near you, or it's a great excuse to travel (fairly cheaply) - you can go for as little as a week or as much as several months depending on your work situation at the moment.\n\nThat will get you some general experience, you'll get to meet and talk with other like minded folks, and you'll get a sense for what aspects of homesteading appeal to you (do you want animals, if so what kind, what sort of climate, annuals or perennials, what scale, would you want to be open to the public for u-pick/WWOOFing/agri-tourism, etc).\n\nIt's easy to forget how much background knowledge you pick up being in the country for a while, until you have city friends visit. Turns out 'wear close-toed shoes, there's a lot of poop' is not nearly specific enough (they showed up in all-stars and capris). Dealing with bugs, sun, heat, poison ivy, poop, dirt, walking around fields, etc is all stuff I take for granted, but it's stuff you'll need to learn to deal with if you leave the city (there are many approaches, figure out if you're a hat or sunscreen, bug spray or lightweight long sleeve, tuck-pants-into-socks or soak-pants-in-permethrin type person).",
            "score": 5,
            "author": "reddit_username_yo"
        },
        {
            "level": 0,
            "comment": "Start practicing living without some of the conveniences you won't have any more after moving.",
            "score": 2,
            "author": "SheDrinksScotch"
        },
        {
            "level": 0,
            "comment": "Try vacation for a month at a time and do several seasons see if you think you’re up for it",
            "score": 2,
            "author": "tkeRe1337"
        },
        {
            "level": 0,
            "comment": "YouTube is amazing for learning information and new skills.",
            "score": 2,
            "author": "Trust_Fall_Failure"
        },
        {
            "level": 0,
            "comment": "Start small and manageable, now.  Don't wait for everything to be perfect before you begin- you can grow a few plants in any space, you can help out at local farms or gardens, you can learn from books or classes or lectures or old farts who live nearby.  Get used to eating more in-season and cooking with what grows in your climate.",
            "score": 2,
            "author": "rshining"
        },
        {
            "level": 0,
            "comment": "Wondrium has a couple courses on homesteading and gardening and the science behind it all. Watch-crawl-walk-run.",
            "score": 2,
            "author": "Illustrious-Soup-985"
        }
    ]
}