{
    "id": "146604o",
    "score": 1,
    "title": "Garden Fence vs. Critters",
    "author": "QualityGig",
    "date": 1686418193.0,
    "url": "https://www.reddit.com/r/homestead/comments/146604o",
    "media_urls": [],
    "other_urls": [],
    "postText": "**FENCING**. I know this is a subject all its own (surprised there's no Reddit on this, at least as far as I can tell).  This year’s goal is to build a more aesthetic and functional fence.  We're in Year #3 of the garden, and problem pests have been (in order of headache): rabbits and groundhogs, chipmunks (sucked all the tomatoes last year in the heat/drought), mice (in supply bin), possum (occasional), raccoons (not in garden), and deer (also not in garden).  We have coyotes and fisher cats in the area and lots of green space so, I guess, it feels like there’s not a \\*lot\\* of determined infiltration.\n\nThe design to date is 4' u-posts with standard coated welded wire fencing along with 2' of chicken wire at the bottom (1' comes up the face of the fence and 1' flares out into the yard and grows down into the grass).  Deer don't seem interested in jumping the fence, but chipmunks and anything small have free reign.  Most of the rest of the pest issues have to do with a poor door, but I have a good plan on that.\n\nWhere I really want to 'nail it' is a new perimeter fence.  Thinking of sinking 4x4 posts to 4’ high with cattle panels in between.  Then, add a finer mesh lower down and below ground.  I'm thinking of also facing the post bottoms with 1x6 boards to create a growing opportunity along the fence itself (as well as another barrier).  I'd reuse the chicken wire and splay it out into the yard to prevent digging at the fence itself.\n\nCross-sectional view from inside out: 1x6 board &gt;&gt; spacer &gt;&gt; 4x4 post &gt;&gt; cattle panel &gt;&gt; finer mesh &gt;&gt; chicken wire (mostly flared out into yard but anchored by post and 1x6) &gt;&gt; outside 1x6 board.\n\nMain question is \"**How well will this work?**\"  More detailed questions are \"**For the finer mesh at the very bottom and below grade, what material (hardware cloth?), what size mesh, how tall above ground, and how deep below ground?**\"\n\nI get pests are a common, evolving situation.  Like everyone, want to keep everything out.  We're not growing food for them -- We're growing for us.\n\n**Also, I’ve considered whether to make panels and even posts removable to make for a cleaner space/view during the winter. Has anyone done anything like that, even if just to remove a panel for start/end-of-year activities?**",
    "comments": [
        {
            "level": 0,
            "comment": "They make fencing for gardens.   It's sold at farm stores.   Mine is 6' tall and has 4X4 squares from the top at 6' down to 4'.   From 4' down the wires are very very close.   It's designed to keep out deer and rabbits.   The only way to keep out voles, gophers and groundhogs is to use raised beds with metal screen or hardware cloth in the bottom.   To keep out squirrels and chipmunks you'd need to wrap it 180 degrees with screen.   Or. . . .  shoot the little thieves!    My dogs kill 3 to 10 squirrels and chipmunks a week.   We don't have a problem with them.   I put the game camera on the garden just in case.   A year ago we did get a super ninja chipmunk but the pellet gun solved that problem.  Good luck.",
            "score": 2,
            "author": "Ok_Employee_5147"
        }
    ]
}