{
    "id": "146venm",
    "score": 1,
    "title": "Best knives for butchering?",
    "author": "Blackberrypiesnout",
    "date": 1686493890.0,
    "url": "https://www.reddit.com/r/homestead/comments/146venm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! We have started to gather supplies to process some meat birds come this fall. We have everything we need… except knives for the actual butchering! Do you have a favorite brand / set? \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I’m a fan of victorinox, a good boning knife was work horse when I worked for a butcher in college. Birds are easy to process, I’ve used pocket knives for birds but most I would get for them is a good boning knife and maybe a poultry boning knife if you wanted something smaller for removing breast &amp; tenders if you go that far. \nJust make sure you have a good sharpener to pair with your knife set you’re building &amp; remember butchery is an art so methods vary, what matters is are you happy with what you get.",
            "score": 6,
            "author": "CowbellBlues",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work in slaughter/butchery and will second Victorinox. Don't spend the money on anything nicer, they will do the job. Get a whetstone and honing steel, learn to use them both and you will be set.",
                    "score": 3,
                    "author": "Due_Twist4814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the recommendation- I’m going to check them out right now",
                            "score": 4,
                            "author": "Blackberrypiesnout"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Edit, I was breaking down goats yesterday, my standard set is a boning knife, cleaver (mine is dexter and I hate it), and a hacksaw. You can do pretty much anything with these 3 imo but anything larger than deer i would want a bandsaw for",
                    "score": 3,
                    "author": "CowbellBlues",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks so much for these tips! We’re starting with poultry but eventually would hope to work up to sheep!",
                            "score": 6,
                            "author": "Blackberrypiesnout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s awesome \nKeep us updated on how it goes",
                                    "score": 3,
                                    "author": "CowbellBlues"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I hear goat bones are much denser than most, how bad are they to cut?",
                            "score": 1,
                            "author": "Embarrassed_Abalone2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were a breeze, I noticed they were more dense than expected but short work for a hacksaw and they are much more fine boned than something like a pig. Ofc the goats I kill are usually a year and not as mature. If you enjoy deer you’ll enjoy goat, very similar taste. \nI really only cut the pelvis in half &amp; cut the ribs from the loin chops. Everything else I could go through joints with the knife, even removed the pelvis sections through the ball/socket joint from the hind quarters after I had it in two pieces",
                                    "score": 2,
                                    "author": "CowbellBlues",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cool thanks.",
                                            "score": 1,
                                            "author": "Embarrassed_Abalone2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For deer season we sharpen about 5 knives total per deer.",
                    "score": 1,
                    "author": "Embarrassed_Abalone2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Especially if the birds are for personal consumption I would say spend your money on sharpening equipment .  small kitchen knives that you already have and like using are just fine as long as they are wickedly sharp.  If you are breaking them down unto breasts, legs etc. you may want something like a boning knife and possibly a cleaver but most people seem to do whole birds, which don't require that much fancy cutting",
            "score": 6,
            "author": "Gerefa"
        },
        {
            "level": 0,
            "comment": "I make mine.   My current favorite is 5160 steel forged quite thin.   \nI’ve found Buck knives don’t hold their edge as well as I’d like though I’ve had several.",
            "score": 2,
            "author": "Lorindel_wallis",
            "replies": [
                {
                    "level": 1,
                    "comment": "You make them?! That’s super cool. Future goals haha",
                    "score": 2,
                    "author": "Blackberrypiesnout"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We really like short fillet knives, the relatively easy to sharpen and you know the blade being flexible, really advantageous and a lot of things",
            "score": 2,
            "author": "Embarrassed_Abalone2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve added fillet knives to my list of what to get! Thanks!",
                    "score": 1,
                    "author": "Blackberrypiesnout"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I use old carbon steel knives I find at estate sales for everything to do with slaughtering and butchering.\n\nThey can rust, but they sharpen up razor sharp, and just need to be honed a bit to stay that way.",
            "score": 2,
            "author": "Gingerbread-Cake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh this is a great idea! We live near the “country’s longest yard sale” in august so lots of booths to explore and keep an eye out for some!",
                    "score": 1,
                    "author": "Blackberrypiesnout"
                }
            ]
        }
    ]
}