{
    "id": "14718ey",
    "score": 8,
    "title": "Longterm Advice Needed",
    "author": "pyreonfire",
    "date": 1686507957.0,
    "url": "https://www.reddit.com/r/homestead/comments/14718ey",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all,\n\nThis is either going to be a very niche experience or a very common one, but I don't have the perspective to know. Pertains to finances, career, and most importantly the old American dream of owning some productive land. Despite all the extra context I'm going to include, I think my overarching question is simple -- is what I want possible? All feedback is welcome, positive or negative.\n\n\\--------\n\nMy partner and I are both soon-to-be entry level engineers, with enough experience that getting 'first jobs' won't be too hard. She will be graduating without debt, and I'll have somewhere in the ballpark of $20k to pay off, but that shouldn't be too hard to clear up within a year or so.\n\nWe both know that early on, (3-5 years) we need to focus on careers. That will probably mean apartment living during that whole time, and working to a base level of liquidity. Exact numbers probably won't be useful given that huge number of variables at play, but let's say that at the end of that five years, we could either afford to buy a house, or some land.\n\nPartner's parents are high-income (\\~500k /year), and getting close on their retirement age. Whenever they pass (sorry if you're reading this) a good inheritance could be expected to be passed on to my partner.\n\nIn terms of land, we've both thought for a long time that PNW was the way to go -- perfect sort of high-green, ferny and wet environment we both love. Mountains, streams, everything.\n\n\\--------\n\nSo I'm torn between a few options here;\n\n1. After 5ish years of saving up, buy a small plot of land that we can get some experience with and continue working our jobs while living out of tents or something (doesn't sound super feasible, but we could make it work).\n2. Keep doing the apartment thing for longer, and eventually have a large enough asset pool that we could buy a few dozen acres, quit our jobs, and do the homestead deal full-time.\n3. Drop the dreams of owning land, live in a city or suburbia, and go full tilt on the professional side. Do nature stuff on the weekends and want to die the rest of the time.\n\n\\--------\n\nSo yeah, I dunno. I'm probably missing a few key points here but I'm hoping you folks may be able to help point those out. In terms of land, I'd love something I can build a large pond (or small lake) on, and would obviously need to be accessible for house construction. So not the middle of the Canadian alpines, but not next to an interstate either.\n\nWe're both very outdoorsy and fit people, so while I expect there to be a million and one problems we run into, general discomfort isn't a dealbreaker. Biology is my passion and I've grown a variety of food and non-food plants before, but I'm not a farmer and don't intend to be. I'm also not a carpenter. While I love the idea of chopping down trees and roughing out some boards to build a house, that's just not a realistic possibility. The environment, then, is most important as setting, and not as a resource I suppose.\n\nWe're also open to places outside of the PNW region. While we've mostly looked at OR and WA, ID (still inside, I know) has come up as a cheaper option. NH and the northeast is also possible, though perhaps a bit cold for my liking (Indiana here).\n\n\\--------\n\nThat all said -- and I know it's a lot said -- I welcome any advice anyone here could offer. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "I recommend you look into permaculture. There's too much to explain briefly, but it teaches you how to work with the land and manage water on it. The most extreme example would be \"greening the desert\" which you can find on youtube, where an expert went to the country of Jordan which gets 4 inches of rainfall every year on average. He put in a forest. Granted, it's not a lush PNW forest, but it's standing trees growing on their own. After 3 years, funding ran out, and efforts to develop it (including watering it) stopped. Ten years later he went back and filmed again, it's still growing, several acres of trees in the middle of a desert town.\n\nSo, if you get a crappy piece of property, maybe too dry, maybe too wet, maybe just badly managed...you could turn that around by working on it on weekends and evenings as your schedule permits. Then, in a few years, sell it for a good deal more than you bought it for. Now it's a valuable property where someone would like to live. This would set you up for a place to live short term, paying a mortgage on it with probably shitty terms but better than throwing away money with rent, and set you up long term as you'd be improving the place and be able to get more out than what you put in, maybe a lot more. So after your 3-5 years of focus on careers, you'd have the option of moving with a nice nest egg.\n\nIt would take work. A lot, at least at key points throughout the year. But at your age, you have the vitality to be able to do a lot more than you'll be able to when you get older and still be able to manage.",
            "score": 3,
            "author": "Pristine-Dirt729",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the input. I’ll take a look at it, would certainly expand the possibilities in terms of initial properties and startup costs.",
                    "score": 2,
                    "author": "pyreonfire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely throw out the soul crushing number 3! I vote for number 1. There is so much to learn! Live in a natural place and experiment while you’re young. There’s plenty of relatively inexpensive land if you just keep watching for it. There’s no reason that you can’t live as cheaply on a couple acres in rural areas if you have the energy to put in elbow grease. Particularly if you start a small subsidizing revenue stream or 2. If you live a half hour from a city, trust me, everyone in the office will buy your eggs. Elon has made working from home in remote places feasible too. We got a beautiful piece of property in northern ca. a few miles from the coast for 350k. It has 2 small but nice unpermitted dwellings, a giant barn, and several outbuildings. 24 acres with a pond too! My goal would be to look for a job in a place that pleases you (re; not in Arizona if you don’t care for desert and heat) and check out Zillow within a 45 minute radius. Move to an apartment, save, and watch real estate for that opportunity that I promise will come! I’ve heard predictions that the housing prices will continue to drop until 2025. Live as frugally as you can, keep your ears and eyes open for opportunity! Good luck!",
            "score": 3,
            "author": "Unevenviolet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the insight. I think getting a job in the ‘ideal area’ and waiting for some opportunities is a great idea.",
                    "score": 1,
                    "author": "pyreonfire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Option 2, probably\n\nIf you want to homestead full time of course make sure you get the land and house in cash, mortgage would be the biggest expense and getting rid of that means your homestead won't have to generate nearly as much money to be profitable. Which brings me to, if you don't want to to farm, do you have a plan to generate income? \n\nHave you lived out in the boonies before? I love it, but I was also raised here. You don't want to spend all that time and money for something you think you'll love and then end up not loving, you know?",
            "score": 2,
            "author": "transparentmayonaise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah certainly having enough cash to buy everything we want would be great haha. Income at the actual point of owning land is either to continue working jobs (wfh) or have enough assets invested that we can live off dividends. And yeah I get what you mean in terms of the boonies, everything is an order of magnitude more difficult to get done. Ideally the lane would be in a sweet spot where we aren’t too far from civilization, but that’s just another factor to consider.",
                    "score": 1,
                    "author": "pyreonfire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you find land by a small to medium size town that has engineering jobs?  That way you can live in comfort at a cheap apartment while being close enough to work on your land after work.\n\nI'm also an engineer and doing what I proposed while building a small house on our land.  I say forget about your \"career\", focus on your homestead.  I've had high status \"interesting\" jobs, I've had boring jobs, nothing compares to working on my homestead.  15 years of experience.",
            "score": 2,
            "author": "MOCKxTHExCROSS"
        },
        {
            "level": 0,
            "comment": "#1- build a yurt, tiny home or live off grid. \n\nGet to know the land, native plants, plant fruiting trees early (bc they take a few years), and work your monthly demands down. As you do, you can also ensure that you both LOVE the lifestyle before jumping out of your safety raft (secure careers). \n\nYou’re smart to seek advice bc this world is intentionally convoluted, confusing and cumbersome. I hope you successful in building your dreams!",
            "score": 1,
            "author": "Intelligent_Invite30"
        },
        {
            "level": 0,
            "comment": "Why not look for ~5-10 acres near a city big enough to have jobs for the two of you but small enough to be able to find land?\n\nMy wife and I were in a similar situation (both nurses with minimal debt). We lived way below our means (lived on one income, the second went entirely to savings). If you're able to put away $60k a year like that, you'll have a super nice down payment in 3 years. A 30 minute commute is often enough to find very reasonably priced land outside a city.\n\nAs far as living off the land goes, I know others have said it, but it's incredibly hard to make enough to support a family off of a new homestead. There's a ton of expenses up front, and unless you've got a lot of folks around you willing to pay 3x what they'd usually pay for chicken or beef from the store, you'll have a hard time coming close to making ends meet. At least for us, it's been way more enjoyable to have the farm as a hobby/provide healthy meat and veggies for us and the kids. There's minimal stress because we're not depending on a good crop to pay the mortgage, insurance, etc.",
            "score": 1,
            "author": "gunc0rn"
        },
        {
            "level": 0,
            "comment": "Homesteading isn't a job - you can get small scale agriculture to pay for itself, but if you want it to pay for you as well, you're looking at farm scale. That's possible, but it's extremely capital and labor intensive and doesn't look like a cute homestead at all (you'd focus on one specific product/product line, not a little bit of everything).\n\nSo unless that asset pool for option #2 is large enough that you can retire (which it might be, not sure what your time horizon/salaries/inheritance numbers are), it's not a feasible option.\n\nI'm going to argue for option 4: Save up and build up seniority at a company. Buy a small property where you can live and homestead while working partly or fully remotely (leveraging the seniority here).\n\nI'd also recommend WWOOFing for a week or two for your next vacation, to get some experience - homesteading can take millions of different forms, and it's good to figure out if you're a meat/dairy/fiber/annuals/perennials/tree crops/u-pick/agro-tourism sort of person before investing a bunch of money into one of them.",
            "score": 1,
            "author": "reddit_username_yo"
        },
        {
            "level": 0,
            "comment": "I love that you’re building your partners parents death into your long term financial goals. Hopefully they leave their wealth to charity.",
            "score": -1,
            "author": "spizzle_",
            "replies": [
                {
                    "level": 1,
                    "comment": "If they talked to a financial planner, the planner would ask about any large expenses, inheritance and income. Don’t get your panties in a twist.",
                    "score": 2,
                    "author": "Intelligent_Invite30",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This whole post just felt like someone ego stroking.",
                            "score": 1,
                            "author": "spizzle_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Didn’t intend it to be. I’ve just found that it’s a big time and money sink to try to start something as complex as this without some input from experienced folks.",
                                    "score": 1,
                                    "author": "pyreonfire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I bet you made an edit and then really thought it was cake! Does your partner know that you’re excited for the death of her parents?",
                                            "score": 1,
                                            "author": "spizzle_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Here’s some advice: If your life is truly so awful that you feel the need to denigrate others on the internet, it’s probably a good idea to reevaluate your priorities, and the choices that lead you to this point. Move forward with grace, envy is weaker than empathy friend.",
                                                    "score": 1,
                                                    "author": "pyreonfire",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Why would I be envious of someone dreaming of the fiscal ramifications of their in-laws terminus? You’ve got this one all backwards. I’d rather my successful father never die. I really hope your in laws donate their cash so your creepy greedy fingers can’t touch it. It’s disgusting.",
                                                            "score": 1,
                                                            "author": "spizzle_"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I bet it felt good when you hit post and reread it a few times though.",
                                            "score": 0,
                                            "author": "spizzle_"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}