{
    "id": "147w3n1",
    "score": 3274,
    "title": "Not to brag but this egg cost me $1000 dollars.",
    "author": "odd_variety6768",
    "date": 1686599960.0,
    "url": "https://www.reddit.com/r/homestead/comments/147w3n1",
    "media_urls": [
        "https://i.redd.it/1aj2ravl7n5b1.jpg"
    ],
    "other_urls": [],
    "postText": "I'm so proud of Wanda!",
    "comments": [
        {
            "level": 0,
            "comment": "Lol, The first one is always the most expensive! Congrats though!",
            "score": 530,
            "author": "airwolf_x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, my husband said the next one will only be worth $500 though lol",
                    "score": 427,
                    "author": "odd_variety6768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's free if you have already written that one off as 1000.  Congrats on your golden egg!",
                            "score": 212,
                            "author": "cats_are_the_devil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But is it a buy one get one free special or a buy two for half price special? 🤔",
                                    "score": 34,
                                    "author": "etherealsmog"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lmfao, eggs depreciate faster than cars. 50% in under 50 hours",
                            "score": 29,
                            "author": "Deathwatch72",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is why I lease my eggs",
                                    "score": 25,
                                    "author": "OneOfTheOnlies"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Egg flation?",
                            "score": 18,
                            "author": "DirtyTimmy510"
                        },
                        {
                            "level": 2,
                            "comment": "Please tell me that when you use it you’re going to setup a little tripod for yourself camera set it up like a cooking show and you Salt Bae-ing the hell out of that egg recipe just so he can walk into the scene.",
                            "score": 19,
                            "author": "ilovechairs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha I used to be a chef/baker so I probably should've done that. I just fried it and ate it on some toast while giving Wanda a thumbs up.",
                                    "score": 40,
                                    "author": "odd_variety6768",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s always next time and you can talk about opening a restaurant because it’s now a steady source of eggs.",
                                            "score": 11,
                                            "author": "ilovechairs"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "LOL poor sweet Wanda, delicious!",
                                            "score": 2,
                                            "author": "Bubbly_Ad5822"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And how was it",
                                            "score": 1,
                                            "author": "MysticBowman"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Next ones free",
                            "score": 3,
                            "author": "Lights_in__the_Sky"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah man I really over paid for mine…",
            "score": 80,
            "author": "Grumpy_HoneyBear",
            "replies": [
                {
                    "level": 1,
                    "comment": " \nSell shares of the egg to people.",
                    "score": 19,
                    "author": "LilaWood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea I ate it about 5 years ago.",
                            "score": 15,
                            "author": "Grumpy_HoneyBear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like it when people say Oh it must be nice having free eggs. Yeah it's great! A few years later and we've almost recouped our initial investment not to mention the countless hours of general upkeep lol. Unless you are running a large operation it tends to end up that you get an extra few dozen of eggs a week after paying for all the feed and everything else. Same deal with having a well. \"Free\" water is great until your pump burns out or you need to drill another.",
            "score": 200,
            "author": "mailmann006",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just thinking about it. Yeah my free eggs cost a lot in feed and time. But I love my chickens! And their eggs are worth so much more than the price tag could say",
                    "score": 70,
                    "author": "LesnikovaPotica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also get a bag of free fertilizer every month, makes the free compost pile really cook. They are pretty good waste disposal units and clean out garden beds beautifully if you can keep them and the soil within the plot.",
                            "score": 32,
                            "author": "veginout58",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They go out and tear up the compost every day. I rake it back in. Never had a lot of luck until the chickens now I have the best compost. I let them in the main garden at the end of the year and there is nothing left",
                                    "score": 16,
                                    "author": "mailmann006"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; clean out garden beds beautifully \n\nNewbie question, this means to eat all the harmful bugs, right?",
                                    "score": 6,
                                    "author": "CroationChipmunk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They do eat worms (not just bad bugs, but them too) and dig the soil to a fluffy, friable consistency (if you put up boards to stop it flying out everywhere).",
                                            "score": 2,
                                            "author": "veginout58"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They will eat pretty much everything they have access to",
                                            "score": 6,
                                            "author": "mailmann006"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They really clean up bugs, slugs, ticks etc. as well as decomposing and rotting vegetation, dead mice, and buried cat crap.  All this helps to give the yolks that nasty orange tinge.",
                                            "score": -20,
                                            "author": "PoppaT1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This person was in another thread hating on free range chickens. Not sure why they’re here in all honestly.",
                                                    "score": 17,
                                                    "author": "tttriston",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Found one of the factory farm admins reddits lmao",
                                                            "score": 6,
                                                            "author": "E4_Mapia_RS"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Light yellow yokes are a sign that your chicken isn’t getting a good well rounded diet.\n\nI agree that what they eat is key to yolk color.  With a carefully controlled diet you will get the nice yellow coloration, with a diet of whatever they catch or scratch up the yolk gets the gross orangy color.  \n\nMany homesteaders claim the yucky orange color is better, it is almost gospel on this sub, but one must be careful what your chickens eat.  Older farms and homesteads often have long forgotten disposal areas which can contain chemicals that you don't want in your food.  Slugs, ticks, dead mice, old cat litter etc. are just nasty, not something I want in my eggs.  An orange yolk is a warning sign, best stay away.",
                                                            "score": -5,
                                                            "author": "PoppaT1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Actually, orange yolk isn’t a sign of anything other than beta carotene in the diet. Don’t know where you’re getting all this nonsense you’re spewing.",
                                                                    "score": 1,
                                                                    "author": "rentedvelveteensofa",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They are really neat and the kids love them. They're a great learning experience. My girlfriend sells them at the doctor's office for a good price to people looking to eat healthier. That said, nothing is free. I used to give everyone salsa and sauce every year but I stopped. I specifically have a little note on the jars saying please return the jar and ring if you would like another and nobody ever does it. Sounds petty but if I spend $100+ on jars and rings to give something away for free that I spent an entire summer on it would be nice to recycle them.",
                            "score": 61,
                            "author": "mailmann006"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "you've just explained why humans tended toward specialization in the first place. Automation, skill, experience, it all all made doing one thing very very well cheaper, which meant more profit per hour of effort, fewer mistakes, fewer injuries, more leisure time, etc. a group of people produces more in general if you have a specialized farmer, teacher, woodcutter, builder, etc, than that same group will produce if everyone has to split their time among those tasks.\n\nCommunities with specialization survived harder times when the jack-of-all trade communities did not.\n\nThus social evolution favored specialization and more and more communities did better and better by adopting it.",
                    "score": 9,
                    "author": "ruat_caelum"
                },
                {
                    "level": 1,
                    "comment": "I don’t have hens, but the way I rationalized the expenses for my orchard and vegetable crops was that the fruits and vegetables are free bonus stuff, I’m throwing all that cash not at them but at “recreational and learning facilities“, because picking and eating your own organic fruits and veggies is a joy for my little kid.\n\nI could be paying to have her enjoy it in someone’s farm from time to time, but with all I’ve invested, she can have that joy right at home every day. lol\n\nSimilar to paying for building and upkeep of a nice pool.",
                    "score": 5,
                    "author": "obscuredreference",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. Getting everything set up is a huge task especially if you are working a day job. We've got our cherry, apple, peach, and pear tree semi dwarfs in now for two years so hopefully we will bear fruit in the next few years. Lots of berry bushes and other things that will continue to produce every year with minimal work. The chickens are just a small part of the deal. My girlfriend is a chicken freak and has all these special birds that lay various colored eggs and this one breeds with that one to make one of these... Speaking a foreign language to me but I do enjoy all the chicken poop and compost. If I had a little more space I would probably have a dairy cow but we only have about 3 acres and it would be a little tight with all the other structures and activities we have going on. Overall I enjoy it a hell of a lot more than my 12 x 12 garden plot in the city :)",
                            "score": 3,
                            "author": "mailmann006",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’d love to have the space for a cow too!",
                                    "score": 1,
                                    "author": "obscuredreference"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s lovely. Happy for your family. Growing up in the inner city, I made a promise to any future kids that they’d have better than I did. Grateful for my parents’ and grandparents’ sacrifices that I have a chance to live in a forest and return to familial roots. Mind-blowing to think of everything between now and ancestors. People in 1860s forced out of Cherokee territory or 1910s out of what’s now Deutschland, but we survived and have fertile land again. \n\nWhich is just to enforce how important it is for kids to have nature. Without a place to call home, there’s so much distress. Creating a safe place where you have shelter, water, food—it’s brilliant. A priceless kind of security. People used to skirmish over white oak trees or brooks/creeks, and for good reason.",
                            "score": 2,
                            "author": "lakeghost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely! And aside from the mental well-being that nature does, it’s especially important nowadays with all the pesticides in the food in supermarkets.",
                                    "score": 2,
                                    "author": "obscuredreference"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why would you need a new well just for that?\n\nPull the pump! (Unless it breaks on the way out, in which case- you will be needing that new well drilled)",
                    "score": 2,
                    "author": "Malfanese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depending on your area wells can eventually run dry. Some will last indefinitely. But if you need a new one drilled it's quite costly. The pump was just an example of something that could pop up and cost you a few grand so the water is never \"free\"",
                            "score": 2,
                            "author": "mailmann006",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah, we just put a well in and had them gently bore another 200ft past the water line so hopefully that won’t be a concern for a long time",
                                    "score": 1,
                                    "author": "Malfanese"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This line of thinking is what led America to where it is now, not saying you think this way, but that constant “yeah I could do this, but it’s so much easier to outsource to someone else so I don’t have to deal with repairs and other costs”  is what created this consumer society that’s burning itself down around us",
                    "score": 8,
                    "author": "RyzenDead",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure where you are coming from. I was just stating that personally, our chickens have just about paid themselves off and we get some extra eggs. I wasn't trying to make a snarky comment simply an observation of what I have experienced",
                            "score": 16,
                            "author": "mailmann006",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I certainly wasn’t trying to be rude. I’m just stating that we outsourced so much in an effort to increase the ease in which we live our lives that now the majority of us are little more than slaves who get to “pick” their master",
                                    "score": 6,
                                    "author": "RyzenDead",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think this is true in some areas, but remember you always have the freedom to take up a lot of stuff on your own if your “masters” are overbearing.  That’s why I love homestead lifestyle — it starts giving us alternative options to the often increasingly poor choices in food and lifestyle out there.\n\nEggs are a good example of how economies of scale save money and lead to a cheaper end product, but when you consider rising egg costs and very low quality of yolk/nutrients in most large brand eggs now, (not to mention awful quality of life for the animals) the home coop becomes an option again, even if you’re paying a bit more per egg in the long run.",
                                            "score": 5,
                                            "author": "--Ben-Shapiro--"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, I understand and my mistake. I misread and thought you took it as me saying don't do this. I'm all for it I was just trying to say that it's a labor of love. Nobody gets rich on a flock of chickens at least monetarily.",
                                            "score": 3,
                                            "author": "mailmann006"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Medieval serfs would homestead and do pretty much everything themselves and they also had masters, much worse ones.\n\nEconomic systems of ownership and oppression are not caused by specialization. You can have specialization without this consumer culture unsustainable capitalism.",
                                            "score": 1,
                                            "author": "Necessary-Meringue-1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s why it’s called a hobby farm and not a homestead",
                    "score": -8,
                    "author": "spizzle_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess so. I mean I could quit my job tomorrow and pay the bills with what we make does that make it a homestead or a hobby farm? I'm just curious what puts you in either rank. Please enlighten me.\n\nEdit: show me this government land where I can go \"stake my plot\". This isn't the wild west...",
                            "score": 13,
                            "author": "mailmann006",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Claiming government land and staking your plot.",
                                    "score": -23,
                                    "author": "spizzle_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol okay it's been real. Thanks for dropping in and helping me become a bit less intelligent",
                                            "score": 19,
                                            "author": "mailmann006",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For sure. Enjoy your hobby farm #homesteadlife",
                                                    "score": -23,
                                                    "author": "spizzle_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I will! Have a good one bud",
                                                            "score": 12,
                                                            "author": "mailmann006"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This is the strangest dick measuring contest I've ever seen lmfao",
                                                            "score": 2,
                                                            "author": "Galolio",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol there is always a \"troll\". Using that term loosely. Guys probably logged into kiwi farms right now touching himself thinking what a great job he did. \"I showed those losers in the agriculture sub, nya ha ha\"",
                                                                    "score": 2,
                                                                    "author": "mailmann006"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol, pump went out. Cheaper to just get county water, than replace. Still have water when the power goes out now. Win win.",
                    "score": 1,
                    "author": "newjbentley88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I lived in a town, water was $100-115 a month.  That's 12k-14k in 10 years.  A well should last at least twice that long and not cost as much.  My situation may be a bit different though. The town piped in water from a nearby city and built a new water tower, so they taxed people out the ass to pay for it. Still though, I'm so much happier not paying those rates.",
                            "score": 2,
                            "author": "yourweirdoneighbor"
                        },
                        {
                            "level": 2,
                            "comment": "Can't argue with that.",
                            "score": 1,
                            "author": "mailmann006"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To combat feed costs you have to do a lot of other work (for the winter) and have a lot of land to free range the chickens/ grow grains and seeds.",
                    "score": 1,
                    "author": "shmiddleedee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, I only have a few acres and a lot of it is used for other things. I do free range them all year until May then I put up a small fence to keep them out of the garden. When the season is over they are back to having the run of the place",
                            "score": 1,
                            "author": "mailmann006"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What are you people doing that you are paying so much to keep chickens....sure the coop costs upfront may be expensive, but you shouldn’t have to feed a lot during the warmer months",
                    "score": 1,
                    "author": "deep_inhalation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The food isn't really expensive especially because ours free range 9 months of the year but eggs are only $2 a dozen here so you're not making much with 20 hens. They pay for themselves and we get a few dozen extra eggs to eat every week. Like you said the coop normally is the biggest line item.",
                            "score": 1,
                            "author": "mailmann006"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "the look on my face when my daughter dropped the first egg we ever got out of the coop. my wife asked what happened and i just said, \"she dropped that first 1500 dollar egg!\"",
            "score": 48,
            "author": "Morgansmisfit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait, are you guys for real? No way a life chicken is 1500 where you live?!?!",
                    "score": -4,
                    "author": "Tyrain3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it’s the cost of setting up the coop etc.",
                            "score": 9,
                            "author": "devilsonlyadvocate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha well, Im not sure id factor that into the cost of the eggs, but I get where youre coming from :D",
                                    "score": -5,
                                    "author": "Tyrain3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that’s the joke. Nobody thinks one egg is worth $1k. It’s just it’s the first egg after the initial costs of getting/housing chickens.",
                                            "score": 6,
                                            "author": "devilsonlyadvocate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yess! However Id place it at ~30$ for the cost of the Chicken :)\nShows how economical having chickens can be aswell! :D (If you have the space, time, and find enjoyment in it of course! :))",
                                                    "score": -3,
                                                    "author": "Tyrain3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And how much did the coop cost to build? \nThat’s the joke about the first egg costing $1k.",
                                                            "score": 2,
                                                            "author": "devilsonlyadvocate",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "by the time i found a coop got a run set up. Set up a brooder feed lights time security   .... im probably underselling it",
                            "score": 1,
                            "author": "Morgansmisfit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My chickens are so low maintenance. They love their plastic barrel and they all 4 lay eggs in it.  They sleep up on the porch at night. A bag of feed, a flock block, and some water is all they need.",
            "score": 26,
            "author": "shivermemembers",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was a kid my chickens slept on the porch every night.  Every day my parents hosed off the porch.\n\nI came home one day and the chickens were in a box.  Dad said find a new home for those shitting chickens or I will. \n\nI dropped them off at a horse farm.",
                    "score": 14,
                    "author": "TraditionScary8716",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My chickens have a perfectly good coop and all 13 of them sit on my washer and dryer on the covered back porch every night. If by 8pm I haven’t carried them each, one by one, across the yard to the coop (if all of them consent to being carried rather than being chased around the yard with a broomstick guiding them to their coop) then my washer and dryer get pooped on. If I don’t promptly clean said poo promptly it stains my appliances and is really tough to get off. \n\nI built a roost bar on the porch but only 2 of the girls sit on that :| the rest prefer the washer. It’s really irritating but it’s still better than buying shitty store eggs.",
                            "score": 11,
                            "author": "yallthewrongthings",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I have 3 perfectly good coops, and 2 chickens roost on top of one and the rest of the chickens like to roost in various bushes and trees. At the 2 chickens roosting *on* the coop is under an overhang. The rest are out in the elements.\n\nI bought a car port tent thing to put in their chicken run and I'm going to build roosts in there, hoping to get those dumbasses out of the trees.\n\n(I'm fostering a old blind beagle that can't be adopted out, and he is most comfortable outside at night. The bonus, though is that he protects the chickens so I haven't had any losses from the dummies up in the trees.)",
                                    "score": 6,
                                    "author": "HarpersGhost"
                                },
                                {
                                    "level": 3,
                                    "comment": "You can try turning a light on in the coop at night, It might take a while but it should draw them in.",
                                    "score": 5,
                                    "author": "SurvivalGamingClub"
                                },
                                {
                                    "level": 3,
                                    "comment": "Silly birds! The staining sounds annoying. Would putting a layer of something like Glad Press &amp; Seal plastic wrap over the top of the appliances be sturdy enough to protect them from stains? Easily removable, protects the surfaces, and gives you a longer grace period to clean off the poo in case you don’t get to it in time.",
                                    "score": 1,
                                    "author": "NapTimeLass",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The washer is top load and the dryer vent needs regular maintenance 🙃 I’ve thought about putting something up there but nothing has worked so far. Also one in particular likes to scratch the hell out of the dryer and lay eggs on it. I’m fixing to make a nest box to put behind/above the dryer.",
                                            "score": 1,
                                            "author": "yallthewrongthings"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your story just made me snort ginger ale through my nose! I can just see my dad doing the same thing. “Shitting chickens” bahahaaaa!",
                            "score": 2,
                            "author": "SporadicWink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha!  My dad put up with me bringing home all sorts of strays but he drew the line with the porch shitting chickens.  🤣",
                                    "score": 2,
                                    "author": "TraditionScary8716"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And in most cases, they'll eat table scraps and bugs, and the feed cost is minimal. IDK what these people are spending $1000 on. I built all my coops weatherproof with scrap pallets and plastic sheeting. Heat lamps in the winter. Chickens are so easy to maintain, and as long as you let them loose frequently, the bugs they eat make their feathers shine and they're fat and happy and laying lots of eggs.",
                    "score": 7,
                    "author": "keeper_of_the_donkey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At least Wanda will give you more eggs, now! I ended up with a $400 tomato a few years back—those damned raccoons, man. I suppose I should be grateful they left me one...",
            "score": 68,
            "author": "Cats_Ruin_Everything",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you, last year we had a cold snap in late May that killed almost all my crops including my wild berries. The deer finished the job and left me with 1 zucchini.",
                    "score": 29,
                    "author": "odd_variety6768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh how considerate of him! He must have been raised right not eating everything a host has offered him",
                            "score": 11,
                            "author": "LesnikovaPotica"
                        },
                        {
                            "level": 2,
                            "comment": "We had warm weather in February and freezing in March this year. I lost all my peaches and most of my blueberries. The deer have been after my tomatoes, but I like venison.",
                            "score": 3,
                            "author": "Jondiesel78"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s fairly competitive with egg prices from 6 months ago",
            "score": 11,
            "author": "AncientPublic6329"
        },
        {
            "level": 0,
            "comment": "Ooooooh, that would go lovely with my $20 tomatoes, $10 head of lettuce, my $50 asparagus… lol.",
            "score": 28,
            "author": "Sky-of-Blue"
        },
        {
            "level": 0,
            "comment": "Do a raised bed next, then you can have a cucumber equal in worth",
            "score": 8,
            "author": "Even_Application2717"
        },
        {
            "level": 0,
            "comment": "How much do chickens cost where you are? I get mine for under $10 a pop and while they do get some grain, they mostly act as our kitchen waste disposal. That’s actually the reason we got them, the eggs are more of a fringe benefit. I just couldn’t deal with wasting so much food once our eldest was on solids.",
            "score": 7,
            "author": "Siege1187",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chickens weren't expensive, the expense came from the coop and run. Then I got a chicken that was sexed wrong and ended up with two roosters, so we started a second flock. The second rooster is a bantam so the new run and coop were smaller and cheaper (still cost a bunch though) and we also bought him three bantam ladies which were kind of expensive especially being sexed.",
                    "score": 6,
                    "author": "odd_variety6768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, that does sound expensive. I know I’m a terrible person, but I would have probably just eaten one of the roosters.",
                            "score": 7,
                            "author": "Siege1187",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If my husband wasn't so soft I'd do it, the regular sized rooster is obnoxious but he does love and take care of his ladies.",
                                    "score": 6,
                                    "author": "odd_variety6768"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sell shares of the egg to people!",
            "score": 6,
            "author": "Busy-Town-6348"
        },
        {
            "level": 0,
            "comment": "That’s right up there with my $1000 blueberries. \n\nBut it’s good, right?",
            "score": 4,
            "author": "cropguru357"
        },
        {
            "level": 0,
            "comment": "Shh. You keep showing it off like that, everybody is going to want one!",
            "score": 4,
            "author": "Pristine-Dirt729"
        },
        {
            "level": 0,
            "comment": "I’m building a custom coop at the moment. When I told my husband that I wanted to do it, he was enthusiastic until I told him it will run $1200. He knows the cheap ones we bought won’t hold up, so he agreed. It’s half done now but we have a rainy patch right now.\n\nHe used to say eggs cost us $50/doz last year, but he’s guessing we’re loosing somewhere around $65/doz now.",
            "score": 4,
            "author": "Battleaxe1959"
        },
        {
            "level": 0,
            "comment": "That’s funny! That’s how I feel about my cannabis plants. Very expensive hobby😳",
            "score": 6,
            "author": "Interesting-Tax7188",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same; I’m on my fourth grow and I’ve still continued to buy cannabis throughout the whole process because I end up flopping some where deep in flower or during dry/cure. Luckily I enjoy the process, and always feel like it’ll get better next grow.",
                    "score": 3,
                    "author": "seeking_more"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hahahaha! Yes!!!",
            "score": 5,
            "author": "ladyeatslife"
        },
        {
            "level": 0,
            "comment": "That one egg cost like 40 eggs?",
            "score": 5,
            "author": "souporthallid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not paying the bill, that's fucking crazy. This is too much, I'm not paying it.",
                    "score": 2,
                    "author": "trethompson"
                },
                {
                    "level": 1,
                    "comment": "So glad I scrolled for this reference",
                    "score": 2,
                    "author": "little_lady_rat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ah yes, the inexpensive way of raising your own eggs, Spent far too much on a coup but I think the eggs are dropping into the hundreds of dollars each now",
            "score": 3,
            "author": "Zetor22"
        },
        {
            "level": 0,
            "comment": "I have so many of these lol. Faberge ain’t got nothing on me!",
            "score": 3,
            "author": "johnitorial_supplies"
        },
        {
            "level": 0,
            "comment": "Good to see prices coming down",
            "score": 4,
            "author": "mrsbuttstuff"
        },
        {
            "level": 0,
            "comment": "Lol nice; I was just telling my wife I want to do a cost analysis on our goat milk ice cream. My rough guess is that it is costing us about $500 for a half gallon, not counting labor",
            "score": 4,
            "author": "Drew_Hannah"
        },
        {
            "level": 0,
            "comment": "Your next egg will retroactively cut the cost of this egg in half though.",
            "score": 4,
            "author": "java_boy_2000"
        },
        {
            "level": 0,
            "comment": "You must use a needle to make holes on either side and blow out the egg, then save the empty shell. Maybe paint a chicken face on it. Save it forever, will it to your grandkids.",
            "score": 4,
            "author": "Petraretrograde"
        },
        {
            "level": 0,
            "comment": "The first gallon of water out of our well was around $7k for us. Lol. Helped grow our $300 each squash.",
            "score": 4,
            "author": "Vollen595"
        },
        {
            "level": 0,
            "comment": "Next one will be only $500.00!",
            "score": 3,
            "author": "Baked_potato123"
        },
        {
            "level": 0,
            "comment": "If you are negative from chickens you are doing it wrong. But I’ve been wrong before 🤷🏼‍♂️",
            "score": 3,
            "author": "HtownLoneRanger8290"
        },
        {
            "level": 0,
            "comment": "So every egg after this is free right?",
            "score": 3,
            "author": "carbogan"
        },
        {
            "level": 0,
            "comment": "Dollar cost averaging down for every one after though.👍",
            "score": 3,
            "author": "Matcin2531"
        },
        {
            "level": 0,
            "comment": "How do you all spend so much on chickens? I ask because I'm about to build a coop out of free scrap wood I got from a porch rebuild I just did. Is it mainly the coop cost for those buying fancy coops or building custom ones with expensive materials? Surely, if you build your own coop using free / cheap materials, it will only take a few months to break even...\n\nI guess I may be in for a big surprise. Please educate me.",
            "score": 3,
            "author": "Midwestkiwi"
        },
        {
            "level": 0,
            "comment": "♥️ BEST EGG EVER ♥️",
            "score": 3,
            "author": "Tara_69",
            "replies": [
                {
                    "level": 1,
                    "comment": "IT IS!!!!",
                    "score": 3,
                    "author": "odd_variety6768"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol! I’ve had chickens for about 15 years. I’m hoping to hit a break even point soon!",
            "score": 3,
            "author": "auhnold"
        },
        {
            "level": 0,
            "comment": "My wife just got chickens. I told her, \"Yeah, those eggs are gonna be cheap at 100 dollars a dozen.\"",
            "score": 3,
            "author": "retiredguy2021"
        },
        {
            "level": 0,
            "comment": "Reminds me of my $500 tomatoes that the squirrels keep stealing.",
            "score": 3,
            "author": "LolaBijou"
        },
        {
            "level": 0,
            "comment": "Only $1,000? Got off easy! Congrats!",
            "score": 6,
            "author": "3RaccoonsInAManSuit"
        },
        {
            "level": 0,
            "comment": " Backyard chickens, the most expensive eggs you’ll ever eat…I’d laugh, but I’m crying instead…",
            "score": 4,
            "author": "thegrimmestofall"
        },
        {
            "level": 0,
            "comment": "Pfft… who’s your egg guy? Paying too much for eggs. I can get you that same egg for $250",
            "score": 2,
            "author": "SwampCrittr"
        },
        {
            "level": 0,
            "comment": "It is a nice egg",
            "score": 2,
            "author": "breathingthrumybutt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was very impressed for a first timer.",
                    "score": 2,
                    "author": "odd_variety6768"
                }
            ]
        },
        {
            "level": 0,
            "comment": "best egg ever. way to go, wanda! 🥚⭐️",
            "score": 2,
            "author": "saudade_sleep_repeat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so proud, she even used the nesting box correctly 🥲",
                    "score": 2,
                    "author": "odd_variety6768"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What came first, the chicken or the egg? Neither, the financeer.",
            "score": 2,
            "author": "baminblack"
        },
        {
            "level": 0,
            "comment": "“Free eggs”. Yeah, if you factor in all the food, electricity, etc they are about $8/dozen. Now factor in the time I spend taking care of them, they are about $30/dozen.",
            "score": 2,
            "author": "gittenlucky"
        },
        {
            "level": 0,
            "comment": "That is the most vanilla Fabergé egg I've ever seen.",
            "score": 2,
            "author": "Pope_Cerebus"
        },
        {
            "level": 0,
            "comment": "I remember my first egg! Best of luck",
            "score": 2,
            "author": "DE4DHE4D81"
        },
        {
            "level": 0,
            "comment": "That one egg was like 40 eggs.",
            "score": 2,
            "author": "b7uc3"
        },
        {
            "level": 0,
            "comment": "Our eggs probably cost 10 times what they do in the store but we still love it",
            "score": 2,
            "author": "el_smurfo"
        },
        {
            "level": 0,
            "comment": "The year is 2045",
            "score": 2,
            "author": "channeldrifter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice",
                    "score": 1,
                    "author": "yepppers7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cracks it in to pan…. Breaks yolk",
            "score": 2,
            "author": "darealJimTom"
        },
        {
            "level": 0,
            "comment": "Top quality egg right there!",
            "score": 2,
            "author": "Pineapples_29"
        },
        {
            "level": 0,
            "comment": "I have some really expensive boring hot sauce you can put on it.",
            "score": 2,
            "author": "Macmang29"
        },
        {
            "level": 0,
            "comment": "That’s egg-stravagant!",
            "score": 2,
            "author": "Quick-Artichoke-8229"
        },
        {
            "level": 0,
            "comment": "I’ll trade you that egg for a couple potatoes I grew from starts.",
            "score": 2,
            "author": "Feisty_Factor_2694"
        },
        {
            "level": 0,
            "comment": "Congrats! Still less than a Taylor Swift concert ticket",
            "score": 1,
            "author": "Chemical_Ad5967"
        },
        {
            "level": 0,
            "comment": "The next ones are free!",
            "score": 1,
            "author": "phiz36"
        },
        {
            "level": 0,
            "comment": "Legend",
            "score": 1,
            "author": "FloridaMan69ingurmom"
        },
        {
            "level": 0,
            "comment": "Legend",
            "score": 1,
            "author": "FloridaMan69ingurmom"
        },
        {
            "level": 0,
            "comment": "Legend",
            "score": 1,
            "author": "FloridaMan69ingurmom"
        },
        {
            "level": 0,
            "comment": "It's an egg, what could it cost?",
            "score": 1,
            "author": "LargeMonty"
        },
        {
            "level": 0,
            "comment": "But the second one will cost you $500.",
            "score": 1,
            "author": "sonofthenation"
        },
        {
            "level": 0,
            "comment": "Really",
            "score": 1,
            "author": "Consistent-Click-274"
        },
        {
            "level": 0,
            "comment": "Working on our first one as well.",
            "score": 1,
            "author": "midwestcannonz"
        },
        {
            "level": 0,
            "comment": "Lol! That's like my 500$/lb oyster mushrooms, and 100$/lb blue cheese",
            "score": 1,
            "author": "taemyks"
        },
        {
            "level": 0,
            "comment": "🥺",
            "score": 1,
            "author": "Embarrassed_Abalone2"
        },
        {
            "level": 0,
            "comment": "That’s a nice egg.",
            "score": 1,
            "author": "Loving-is-eazy"
        },
        {
            "level": 0,
            "comment": "I would have sold you one for $100, just saying, hit me up next time!",
            "score": 1,
            "author": "HighSolstice"
        },
        {
            "level": 0,
            "comment": "The golden white egg.",
            "score": 1,
            "author": "Memory_Less"
        },
        {
            "level": 0,
            "comment": "So that chicken surgery finally paid off and you laid an egg?  Congratulations",
            "score": 1,
            "author": "Tall_Square252"
        },
        {
            "level": 0,
            "comment": "Oh you’re paying way too much for your eggs. Who’s your egg man?",
            "score": 1,
            "author": "VonSwabbish"
        },
        {
            "level": 0,
            "comment": "Mmmm",
            "score": 1,
            "author": "DrDrinky"
        },
        {
            "level": 0,
            "comment": "1 egg cost like 40 eggs?",
            "score": 1,
            "author": "CanadianKaiju"
        },
        {
            "level": 0,
            "comment": "i want to see the picture of the chicken coop aka free egg factory",
            "score": 1,
            "author": "monty08"
        },
        {
            "level": 0,
            "comment": "Go Wanda!!! Hows Cosmo??",
            "score": 1,
            "author": "d_higgsboson"
        },
        {
            "level": 0,
            "comment": "That first egg is always the best",
            "score": 1,
            "author": "Remi708"
        },
        {
            "level": 0,
            "comment": "Where’s the fish? \n\nCongrats :)",
            "score": 1,
            "author": "ilu70"
        },
        {
            "level": 0,
            "comment": "That one egg was 40 eggs?",
            "score": 1,
            "author": "Iliker0cks"
        },
        {
            "level": 0,
            "comment": "Man, proctologists are making a killing these days",
            "score": 1,
            "author": "notyourwindow"
        },
        {
            "level": 0,
            "comment": "Don't drop it... I SAID DON'T DROP IT!!",
            "score": 1,
            "author": "MadOvid"
        },
        {
            "level": 0,
            "comment": "This 1 egg is worth 40 eggs?",
            "score": 1,
            "author": "Dexter321"
        },
        {
            "level": 0,
            "comment": "Dollars dollars",
            "score": 1,
            "author": "Soup-Wizard"
        },
        {
            "level": 0,
            "comment": "You're getting eggs?",
            "score": 1,
            "author": "yourdrunksherpa"
        },
        {
            "level": 0,
            "comment": "I get it. Im $2500 in on ducks and have yet to have eggs lol.",
            "score": 1,
            "author": "EricAbmaMorrison",
            "replies": [
                {
                    "level": 1,
                    "comment": "We had ducks once ..they hide eggs everywhere. Wed find them under 2 inches of mud, in corners, under the edges of their mud hut. It became a game of hide n seek.",
                    "score": 1,
                    "author": "Freetourofmordor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "$12k per dozen!? Must have been up at Whole Foods, huh? :P",
            "score": 1,
            "author": "coder4567"
        },
        {
            "level": 0,
            "comment": "Cover it in epoxy and set it On the mantle,  mate.",
            "score": 1,
            "author": "Ivizalinto"
        },
        {
            "level": 0,
            "comment": "Ooo, that’s some sexy ROI.  Wanna trade for a $1200 strawberry or an $80 bitter head of romaine?",
            "score": 1,
            "author": "jeffersonairmattress"
        },
        {
            "level": 0,
            "comment": "Is it dragons egg",
            "score": 1,
            "author": "iamreddituserhi"
        },
        {
            "level": 0,
            "comment": "is it a snake ?",
            "score": 1,
            "author": "EamSamaraka"
        },
        {
            "level": 0,
            "comment": "The price of a left nut.",
            "score": 1,
            "author": "Guardian5985"
        },
        {
            "level": 0,
            "comment": "Chicken tax",
            "score": 1,
            "author": "drizztandgwen"
        },
        {
            "level": 0,
            "comment": "Why?!!!!!!",
            "score": 1,
            "author": "Sweaty_Report7864"
        },
        {
            "level": 0,
            "comment": "I get it.",
            "score": 1,
            "author": "UrbanArtifact"
        },
        {
            "level": 0,
            "comment": "Ahh the $40 dollar tomato. A must read.",
            "score": 1,
            "author": "Silent_Special_9024"
        },
        {
            "level": 0,
            "comment": "Sounds like an Audiophile Egg.",
            "score": 1,
            "author": "SureTechnology696"
        },
        {
            "level": 0,
            "comment": "I have some cattle that I need to sell for $85 lbs a pound to break even",
            "score": 1,
            "author": "kingofnottingham"
        },
        {
            "level": 0,
            "comment": "You got hosed, 60 are now less than $10 in the supermarket lol",
            "score": 1,
            "author": "Odd-Turnip-2019"
        },
        {
            "level": 0,
            "comment": " What happened",
            "score": 1,
            "author": "Classic-Angle2262"
        },
        {
            "level": 0,
            "comment": "Congrats on your first egg! Eat it wisely.",
            "score": 1,
            "author": "edtheheadache"
        },
        {
            "level": 0,
            "comment": "woo hoo!   Ours cost us several thousand…. doesnt it feel so good!  lol",
            "score": 1,
            "author": "Infinite-Health-9907",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep still need to finish the tunnel house then move some post that's be concreted in the ground so I can finish the chook house , first egg would have cost me $2500 and the first Tomato got to be at least coming up to $4,500  and the cucumber are going to cost a fortune. Keep up the good work.",
                    "score": 1,
                    "author": "Huntanz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All you need is 3000 more eggs to break even compared  to store bought price!",
            "score": 1,
            "author": "shmexysagem"
        },
        {
            "level": 0,
            "comment": "soon you will have so many you will have to give them away to your neighbors",
            "score": 1,
            "author": "Ok_Button2855"
        },
        {
            "level": 0,
            "comment": "I want to see a picture of the chicken",
            "score": 1,
            "author": "thunderborg"
        },
        {
            "level": 0,
            "comment": "why is it $1000? and what animal?",
            "score": 1,
            "author": "ottipi"
        },
        {
            "level": 0,
            "comment": "1000 dollars... Those are rookie numbers :).  Seriously though, don't you love how everyone got into the chicken world thinking they would save money on eggs. Lol",
            "score": 1,
            "author": "JOHNNYTWOXS"
        },
        {
            "level": 0,
            "comment": "Not to brag but my 🍆 is 7inches",
            "score": -7,
            "author": "m2468rQ"
        },
        {
            "level": 0,
            "comment": "Not to be critical, but placing a dollar sign before the number is sufficient enough. Adding \"dollars\" at the end is just silly. You're basically saying \"one thousand dollars dollars\" here 😉\n\nAnd excuse my ignorance, but $1,000 for an egg? What is the point?",
            "score": -5,
            "author": "HolySeph1985",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used voice to text because my hands are trash from my disability and I was too excited about my first egg to notice it did that. The cost of the coop, run, chickens, feeds, etc. is what makes this expensive.",
                    "score": 3,
                    "author": "odd_variety6768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ahh gotcha thanks for the info",
                            "score": 0,
                            "author": "HolySeph1985"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cheaper to buy the chicken and shag it at home, getting caught on cctv and paying blackmail costs a stack!!",
            "score": -2,
            "author": "Front_Farmer345"
        },
        {
            "level": 0,
            "comment": "I’ll sell you a piece of candy for 10k.",
            "score": 0,
            "author": "Aposta-fish"
        }
    ]
}