{
    "id": "148zl0e",
    "score": 0,
    "title": "Kroger dozen large white eggs - $1.29 ... Free Range large brown organic eggs - $5.99",
    "author": "PoppaT1",
    "date": 1686720989.0,
    "url": "https://www.reddit.com/r/homestead/comments/148zl0e",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why do I need to know this?",
            "score": 9,
            "author": "Antique-Public4876",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Why do I need to know this?\n\nNo one needs to know this.  I posted it because I find it interesting that the white eggs are about 1/5 the cost of the organic brown eggs. Since many homesteaders raise chickens I thought many here might find it interesting too.\n\nThe price disparity is pretty stark, and I suspect that homestead raised organic brown eggs are even more expensive.",
                    "score": -1,
                    "author": "PoppaT1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anyone considering raising chickens for eggs should probably consider the high cost of the egg producing hobby.",
                            "score": -1,
                            "author": "PoppaT1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Homestead shell-egg producers like myself are doing just fine. Agricultural tax exemption and production write offs keep profit margins wide.\n\nWhen you state “high cost,” you must be speaking from experience. Are you having problems tracking overhead costs?",
                                    "score": 3,
                                    "author": "Antique-Public4876",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "High cost is relative, consider the price of homestead eggs vs. store bought eggs.  I doubt that any homesteader with a back yard flock is getting an agricultural tax exemption or production write offs.  \n\nHow much does it cost you to produce a dozen eggs?",
                                            "score": -1,
                                            "author": "PoppaT1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a successful shell egg producer you have your cost per egg down to the penny.  Why not share?  With a large operation with an eye to making money, what is your cost to produce a dozen eggs?",
                                                    "score": 1,
                                                    "author": "PoppaT1"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its crazy how cheap eggs are in other parts of the world . Cheapest here in Melbourne is about $5 a dozen with most expensive in the supermarket being about $12~ .",
            "score": 2,
            "author": "Suspicious_Candle27",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in the northeastern part of the US and the cheapest eggs at the store are over $4/dozen. Thankfully I have my own hens, but I was sticker shocked when I saw the store prices recently.",
                    "score": 3,
                    "author": "xenedra0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We raise chickens primarily so our kids can have interesting real-life experiences as they grow up. They helped build the coops and love naming the chickens and seeing their different personalities. Had a baby chick die and an older chicken get sick and die recently, and they were sad for a bit, but got to help bury them and made a nice little grave. Seems to me like an easier way to learn about and process death than most. We don't make the kids work much to keep the chickens yet, but we are thinking of selling eggs soon and if the kids want to get the profit they will have the option to do the work. We're not planning to make any money from it, certainly never going to recoup the thousands we spent on coops and runs. The higher egg quality is also nice (big, dark yolks). They make tastier souffles.",
            "score": 1,
            "author": "JaguarMammoth6231"
        },
        {
            "level": 0,
            "comment": "I have 40-50 hens and a few roosters. I feed my free range chickens non-GMO chicken feed. I sell eggs for $5/dozen.  That's enough to barely pay my feed bill, only.",
            "score": 1,
            "author": "MajorWarthog6371"
        },
        {
            "level": 0,
            "comment": "For my own family of four we eat about 2 dozen eggs a month.  That would be about 24 dozen a year which would cost about $30/year purchased from Kroger.  Would it make financial sense for me to raise chickens for eggs?",
            "score": -2,
            "author": "PoppaT1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Homesteading isn’t about saving money. You’ll never be able to compete with large producers who have economies of scale on their side.",
                    "score": 7,
                    "author": "darnedkid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is the truth, it is an expensive hobby that involves a lot of hard work!",
                            "score": 1,
                            "author": "PoppaT1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Two dozen eggs a month for a family of four? You do not eat very many eggs at all. My family of three goes through 3 dozen a week. I think for you it is probably not worth it. Focus on the things you actually eat, and trade for eggs with your neighbors.",
                    "score": 2,
                    "author": "That_Put5350",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;You do not eat very many eggs at all. \n\nI agree.  But your family would have to pay almost $4.00/week for eggs from Kroger. A few years back I had chickens and the feed cost about $3.00/dozen eggs.\n\n How much does it cost you to produce 3 dozen eggs at home?",
                            "score": 0,
                            "author": "PoppaT1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Costs me about $3.60 per dozen in feed costs, I don’t include the cost of setup/construction or purchasing of birds. I also don’t include the value of the meat when the bird is eventually slaughtered. I can’t get eggs for under $2.50 a dozen where I live, but for me it’s about more than price. The $2.50/dozen eggs have weak shells, weak, pale yolks, and most likely come from battery hens that are kept in deplorable conditions where they can’t even hardly move for their entire life and are fed the cheapest corn and soybeans money can buy. I don’t wish to support the treatment of animals in this way any more than I have to. The eggs that come from my chickens have strong shells, rich yellow-orange yolks, and the chickens themselves have a pleasant life in a large outdoor run and eat very healthy soy-free food that I make myself.  Eggs that come from chickens treated similarly are about $5/dozen. It is worth every penny.",
                                    "score": 2,
                                    "author": "That_Put5350",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So your family eats 150 dozen a year with a feed cost of $3.60.  Eggs cost you over $500/year!  And that does not include your time or other costs.  From the store in your area they would be $375/year. From the store in my area they would be less than $200/year.  \n\nCan you tell me what area you are in?  I can't understand the disparity in pricing for a dozen store bought eggs.",
                                            "score": 1,
                                            "author": "PoppaT1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am in the New England area. Everything is expensive here. And again, I willingly pay extra to have higher quality food from better-treated animals. In my opinion, I am saving money because buying the same quality eggs from the store would cost me more. Same reason I buy my beef and pork from a local farmer instead of buying the cheaper factory farmed meat from the store. If that sort of thing doesn’t bother you, and cost is your number one concern, you probably won’t save any money at all raising anything yourself. The only thing might be if there’s a plant you can raise successfully from seed without needing any fertilizer or bug sprays. Maybe fruit trees too.",
                                                    "score": 2,
                                                    "author": "That_Put5350",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am in Central Virginia.  The only things I can raise without pesticides is corn which gets an easily removable worm at the top of each ear, and tomatoes which I have to go out at night and remove the big green caterpillars, another easy fix.  I no longer raise either due to deer, rabbits, and when mine comes in corn and tomatoes are inexpensive at the store.  Apple trees here have to be sprayed four times a year and peaches have to be sprayed six.  I no longer deal with that either.",
                                                            "score": 1,
                                                            "author": "PoppaT1"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[https://www.youtube.com/watch?v=5j\\_AKrr9foE](https://www.youtube.com/watch?v=5j_AKrr9foE) in the long run?  probably.  But it'll take a minute.",
                    "score": 1,
                    "author": "BunnyButtAcres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Store-Bought Eggs\t\r  \nCheapest eggs: $4.50/carton\t\r  \nOrganic, free-range: up to $9/carton\t\r  \n\r  \nTOTAL: between $234 and $468 for 12 eggs per week (624 eggs per year)\t\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nBackyard Chicken Eggs\r  \nHousing and accessories: $435\r  \nBirds: $90 (three pullets)\r  \nMaintenance costs: $125\r  \nTOTAL: $650 for three birds, 12 eggs per week (624 eggs per year)\n\nhttps://www.moneypit.com/cost-of-raising-chickens-for-eggs-store-bought-vs-owning-chickens/\n\n&amp;#x200B;\n\nThis is an interesting article on the finances of raising chickens for eggs, but you have to double check every article like this for accuracy.  For example, this article says that the cheapest store bought eggs are $4.50/carton and Kroger is selling them for $1.29/carton.  That would equal $67/year, not the \"between $234 and $468\" they indicate.\n\nBottom line is I can buy a dozen eggs a week for $67/year, why would I raise chickens?",
            "score": -2,
            "author": "PoppaT1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is such a strange post for this sub.",
                    "score": 6,
                    "author": "Brief_Schedule_5036",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Strange?  How?  Lots of homesteaders raise chickens for eggs.  Before they start shouldn't they do some cost analysis?",
                            "score": 0,
                            "author": "PoppaT1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It comes off as you trying to convince people not to do it. Nobody is under the illusion that they can beat heavily subsidized factory farms on cost. Money isn’t everything.",
                                    "score": 2,
                                    "author": "Brief_Schedule_5036",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Nobody is under the illusion that they can beat heavily subsidized factory farms on cost.\n\nNobody?  You sure are speaking for a lot of people!  \n\nLook how many downvotes I get.  Why would anyone care about my talking about the cost of raising chickens?  I suspect a lot of \"nobodies\" don't want to admit how much they spend on their hobby!  But there are probably many who would like to do an honest cost analysis before raising chickens.",
                                            "score": 0,
                                            "author": "PoppaT1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}