{
    "id": "isk14c",
    "score": 5695,
    "title": "Two pairs of cheap leather gloves later, firewood stacking complete.",
    "author": "amanfromthere",
    "date": 1600087039.0,
    "url": "https://www.reddit.com/r/homestead/comments/isk14c",
    "media_urls": [
        "https://i.redd.it/4itvhcqxx3n51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "That’s great! One suggestion. I’ve been cutting, junking, splitting and stacking wood since I was old enough to be at it and in my opinion and experience one long line like that is more prone to a domino styled topple. Shifting ground under the weight, a big windstorm, anything to make it founder could topple the whole thing. I’d have split that up into about 3 rows about half a foot apart just so that if some of it starts to fall for any reasons it’ll just list over into another row and hopefully stay where you put it. Also if it’s three rows or four rows you can tarp over it easier than a 120 foot row of wood. That’ll keep it dry so you’re not putting soggy wood in the stove. Fantastic job all the same though! That’s a lot of work!",
            "score": 376,
            "author": "Jonesetta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice.  I'm hoping the columns will serve a similar purpose as a gap.  It's pretty stable though, I can give it a pretty good push anywhere along it and it barely moves.  We'll see what the wind says though. \n\nAny opinion on this method vs the Norwegian round stacking method?",
                    "score": 142,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Norwegian method saves space, but lends itself more readily to water retention on the inner pieces if its not covered. \n\nNobody stacks wood like that around here (southwest Virginia), but i have seen the method used in Norway. If you're limited on space, you can stack a significant amount of wood with the Norwegian method in a smaller space.",
                            "score": 28,
                            "author": "Old_LandCruiser"
                        },
                        {
                            "level": 2,
                            "comment": "Haven’t done a big lot of research into it other than growing up in Newfoundland Canada. People still burn wood very often here so everyone and their dog has a cord of wood stacked up on the property. A “cord” of wood is a stacked pile with the dimensions of 4 feet high by 4 feet wide by 8 feet long. That’s usually two or three 8 foot long rows stood up next to each other so you can eyeball how much wood people have for burning or for sale or whatever. I haven’t done the pros and cons for many different methods other than just seeing the entire population around me sorta accept one way as standard practice so I did too. That and the experience of having a few tier topple over before haha. Any way that works for you is the best way on your property! Congrats on it all by the way, live the dream :)",
                            "score": 77,
                            "author": "Jonesetta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TIL",
                                    "score": 9,
                                    "author": "Crezelle"
                                },
                                {
                                    "level": 3,
                                    "comment": "WooHoo Newfoundland!",
                                    "score": 2,
                                    "author": "19snow16",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha woohoo altogether! Where are you from skipper?",
                                            "score": 3,
                                            "author": "Jonesetta",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Husband is from Corner Brook. Our best military posting was Gander.",
                                                    "score": 1,
                                                    "author": "19snow16"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just Googled [Norwegian round stacking](https://www.google.com/search?q=Norwegian+round+stacking) and had my mind taken on a very wild trip.  Some very artistic work here.",
                            "score": 53,
                            "author": "IWasGregInTokyo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For some reason a beetles song comes to mind",
                                    "score": 3,
                                    "author": "man9875",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean beatles?",
                                            "score": 4,
                                            "author": "FirstGameFreak",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes. Spell check sucks",
                                                    "score": 2,
                                                    "author": "man9875"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I attempted the Holz Hausen this year. 4.5 cord. I did order a custom 12.5’ diameter tarp for the top though. It looks fantastic. As the previous poster said, my long ‘fence’ style on skids blew down in a snowstorm. I am confident this new style will absolutely not move. I’m unsure how to post a photo in replies, but I have them if someone can explain the process. \nIn Maine if that makes any difference regarding weather etc.",
                            "score": 9,
                            "author": "2020-JLU",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I’m unsure how to post a photo in replies, but I have them if someone can explain the process. \n\nUpload the pictures to an Imgur album, then edit your comment to have the album link.",
                                    "score": 7,
                                    "author": "Notagtipsy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Tried the Norwegian round method it seemed to have more benefits and looked cool. Mine got lopsided and i turned into what OP has, would have worked better if pieces are smaller and close to the same size.",
                            "score": 5,
                            "author": "solarslacker"
                        },
                        {
                            "level": 2,
                            "comment": "I stack mine into IBC Cages. It works out to about a cubic metre/700kg of wood per cage and it's hell easier to move around with the tractor with pallet forks on. Also you can use the old IBC as a lid if you really want and easily strap a tarp over it if that's your thing.",
                            "score": 1,
                            "author": "goss_bractor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I second this. Also if you don’t have it yet, build yourself a sizable wood shed. It should be big enough to store at least a cord of wood easily. It should also be wind and water proof so that your wood can season before it goes into the stove. You loose tons of efficiency with even slightly humid wood.",
                    "score": 35,
                    "author": "MFTPC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, I'm a noob, but I just wanted to ask how OP plans on keeping it dry.",
                            "score": 14,
                            "author": "nj_legion_ice_tea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tarp",
                                    "score": 8,
                                    "author": "Piratey_Pirate"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yea, I've got it planned and ready, just didn't realize lumber prices were through the roof right now.  Hoping that comes down a bit soon, otherwise I'll have to bite the bullet or make something temporary.",
                            "score": 8,
                            "author": "amanfromthere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If there is somewhere nearby that builds sheds/roofs, ask about the cover sheets or scraps from metal roofing.  \n  \nWhen palletized, they put an extra sheet on top of the roofing sheets to protect them from getting scuffed up or dented in transit. This piece usually gets scrapped upon arrival - and most places will sell them cheap or even give them away. Local place sells them for $10 for a 2'x12' sheet - retail is $35.  \n  \nA cheap and easy option is to just build a pole barn. Get the posts up and the roof on, put a couple inches of 3/4\" stone, and you're set. If you want a concrete pad you can just pour it later, and you can nails boards straight to the posts for siding. If you can find a local mill, rough cut hemlock is a great cheap option for non-ground contact.",
                                    "score": 7,
                                    "author": "Dire88"
                                },
                                {
                                    "level": 3,
                                    "comment": "We made our woodshed with log poles, rough. Then all you need to buy are a box of long nails. It spent a couple years with tarps (way styley) as walls til we had slabs to shiplap with. Oh, and some metal roof sheets. The shed came after a couple years of digging out the ends of the tarped wood pile of feet of snow and ice. You'll get there!",
                                    "score": 4,
                                    "author": "bunnysnot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;You'll get there!\n\nThis is the attitude I love to see.  Thanks for posting a snippet of your journey.",
                                            "score": 3,
                                            "author": "I_SMELL_ASS"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have a question that Google gives a mixed answers on. Seems like you're a wood expert, so might as well ask. Are there any concerns with smoking wood for food that has been left in the elements and is potentially rotting and moldy?",
                    "score": 8,
                    "author": "Alarmed-Honey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No idea but it’s easy to avoid by keeping the wood dry.",
                            "score": 7,
                            "author": "TheBlueSully"
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't use anything that is moldy and not supposed to be in food preparation.",
                            "score": 5,
                            "author": "Diorannael",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I wouldn't use anything that is moldy and not supposed to be in food preparation.\n\nI suppose no Roquefort cheese, then?",
                                    "score": 1,
                                    "author": "teebob21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it's supposed to be moldy, right? Wood you use to smoke isn't.",
                                            "score": 3,
                                            "author": "Diorannael"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't use moldy or rotten wood for smoking. It will impart an off flavor, and deepending on the mold can cause health issues.  \n  \nBest way to prep your own smoking wood is to debark it and put it in a dry place as soon as possible.",
                            "score": 5,
                            "author": "Dire88"
                        },
                        {
                            "level": 2,
                            "comment": "If it is rotting that means it is damp. Damp wood produces a wetter &amp; whiter smoke. White smoke is bitter. You want your smoke out of your smoker to be almost blue. The type of wood you are using is very important as well. Steer clear of conifers (pine, cedar, cypress, spruce, etc.) as the tar in these woods will make your food taste \"off\" and high levels will make you sick. Oak, hickory, mesquite, and fruit woods are a good fall back and each lend their own unique flavor. My apologies if you are aware of this already, you just got me started on something I am passionate about.\n\nTo keep your firewood from rotting, elevate it off the ground. I usually run a couple limbs (from the tree I felled) perpendicular to the direction my stack will be and use it as a base to stack on. You could do the same thing with a pair of 4x4. I live in a humid environment and have never tarped or covered my firewood, but this puts me in the 12 month range for seasoned firewood. I have a 12' long rack in my covered smoker area where I keep the wood I will be using for the year. Every spring I rotate in firewood from my oldest stack. \n\nTLDR : you can use rotted wood but it will affect the flavor and have an unreliable burn rate and do so quite inefficiently. This will make it difficult to keep a consistent temperature and smoke level. Save that stuff for the firepit and use the dry stuff for smoking.",
                            "score": 2,
                            "author": "PissedSCORPIO",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "great post, do you make your own charcoal?",
                                    "score": 3,
                                    "author": "I_SMELL_ASS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Occasionally, if I end up with a large amount of oak or ash. The oak  and ash in my locale is simply too bitter to use for cooking. I've tried and it produces a smoke so bitter it will numb your lip. I use a 55 gallon drum I've cut a few dampers into. It works but it takes a large amount of wood to have a decent yield. I haven't figured out how to store it away from humidity, I'm currently trying out a rubbermaid tote. I mostly use wood in my smokers and wood chips for my sausage smoker. The only real use I have for charcoal is my gaucho grill &amp; it takes probably 6 lbs of charcoal everytime I fire it up.",
                                            "score": 1,
                                            "author": "PissedSCORPIO",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I haven't figured out how to store it away from humidity,\n\nYeah this is always a problem for me with the regular stuff, I too store in a tote that sees sun part of the day but no matter what it gets moist and pops. Thats interesting about the oak and ash in your local. Sound like you got a nice little smoke house going on!",
                                                    "score": 1,
                                                    "author": "I_SMELL_ASS"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I do a tetris interlock stacking technique. Over time it becomes a log again.",
                    "score": 2,
                    "author": "no-mad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still need to build a lean-to outside my basement door for easy-access storage, but holy crap lumber prices are through the roof right now.  Over $8 for a 8' PT 2x4 is insane.",
            "score": 35,
            "author": "amanfromthere",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you can wait, you should. Our lumber yard just keeps watching the prices go up and shipments getting zeroed out. Also, after I got tired of burning through leather gloves, I got some inexpensive Showa atlas gloves, work way better for handling wood all day.",
                    "score": 31,
                    "author": "kindredfold",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea I'm going to wait, not in so much of a hurry that I want to pay a 50% premium.   \n\nI'll check those gloves out thanks.",
                            "score": 10,
                            "author": "amanfromthere"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you're in the US you can thank your government for failing to honour NAFTA softwood lumber treaties. You're not getting cheap Canadian wood right now.",
                    "score": 26,
                    "author": "AugustSprite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In BC right now and lumber prices are definitely up here too",
                            "score": 16,
                            "author": "SkipTheMoney",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn't that because many of our raw logs are milled in the States, and then sold back to us as lumber? If the American mills that mill Canadian lumber and sell it to Home Depot or whatever retailer, who then ships the lumber back to Canada are paying more ... then Canadians also have to pay the inflated price of US mills too?\n\nAre small scale mill prices up? \n\nAre log prices up, or just lumber?",
                                    "score": 12,
                                    "author": "AugustSprite",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In the states it's lumber in general.  In my area the yards said its due to a lot of mills closing for a bit due to Covid.  Im not certain how accurate that is so take it with a grain of salt.",
                                            "score": 6,
                                            "author": "whiskeyjack434",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have heard that it is that plus the increased demand.  Families are skipping Disneyland or whatever this year and remodeling the home this year.",
                                                    "score": 2,
                                                    "author": "forgottenbutnotgone"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Where I live in upstate NY, you can still get lumber from local mills at a reasonable price, but anything from a big box store is expensive.  And the local mills are very busy so you have to special order.",
                                            "score": 4,
                                            "author": "Spirckle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Figures....",
                            "score": 1,
                            "author": "OldMan151068"
                        },
                        {
                            "level": 2,
                            "comment": "USMCA&gt;NAFTA",
                            "score": 1,
                            "author": "6-8-1967"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Get yourself a big chainsaw (over 60cc) and get and Alaskan mill. Takes a bit of practice and learning, but you never have to worry about lumber after that.",
                    "score": 5,
                    "author": "MFTPC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just be aware it might not be as reliable as dried and treated commercial wood.",
                            "score": 3,
                            "author": "TheBlueSully",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's only a problem if you don't let the wood season. I grew up getting the wood for our stove on our property. It was never hard to get a fire going.",
                                    "score": 2,
                                    "author": "Diorannael",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They're talking about milled lumber for construction, not burning.",
                                            "score": 8,
                                            "author": "whiskeyjack434",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My bad, I missed that in my purple haze.",
                                                    "score": 7,
                                                    "author": "Diorannael",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We have an Alaskan chainsaw mill. We did have to invest close to 1k on a larger saw. We use green wood for building outbuildings and loafing sheds. Its strong and reliable, and the right size. Lots of folks out here use green wood. I certainly wouldnt build a log home without seasoning whole logs but green lumber is great. You have to account for drying and get your fasteners in asap.",
                                                            "score": 2,
                                                            "author": "bunnysnot"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "From a cost/effeciency standpoint, you really want to run a 90cc+ saw for milling. Smaller saws will wear out prematurely.  \n  \nSaws aren't designed to run balls to the wall for long periods of time, and they cool off during idle. Also, don't run a 50:1 fuel for milling - more like a 35:1.",
                            "score": 3,
                            "author": "Dire88"
                        },
                        {
                            "level": 2,
                            "comment": "I've only got a MS271 (50cc) currently, but yea I'd love to get an Alaskan mill at some point.",
                            "score": 2,
                            "author": "amanfromthere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Alaskan mill\n\nFirst I've every heard of this (so thanks MFTPC for mentioning it) so I did a quick google dive and found this YouTuber who tests a $22.50 lumber cutting guide.  I know absolutely zero about cutting lumber so I'm only going off the video but this might be a cheap short term solution.  Amazon link to the guide is in the video comments.  \n\nhttps://www.youtube.com/watch?v=kz3g7NB8bC8",
                                    "score": 10,
                                    "author": "downtime37",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He does a lot of product reviews and I tend to believe what he says about things. He started getting political in the past year or 2 so I have largely stopped watching him but he does have some great videos.",
                                            "score": 6,
                                            "author": "Mr_MacGrubber",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks, this is the first time I've ever watched him. I liked the lumber cutting video but I have no interest in hearing his political views.",
                                                    "score": 5,
                                                    "author": "downtime37",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just go back in time. His political rants are largely separate videos so it’s also pretty easy to not watch them.",
                                                            "score": 7,
                                                            "author": "Mr_MacGrubber",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He's really condescending, too. I used to watch that asshole, but quit when he keeps downing on men that don't do manly lumberjack and survivalist shit, his constant christian holier-than-thou shit. I hate hearing how he talks to people.\n\nTurns out his product reviews aren't unbiased, i think someone found evidence that he's paid off or something. I can't remember, but he's a dick anyway.",
                                                                    "score": 8,
                                                                    "author": "dethmaul",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "For sure.  I don't like how he is always talking down to his son.  That kid is going to have issues.  In general the click-bait titles and the preachiness are a big turn off.  In one recent episode he made a cut at east coast men implying they were timid wimps.  Dude! you apparently have never watched Andrew Camarata videos on Youtube.",
                                                                            "score": 3,
                                                                            "author": "Spirckle",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah! The east coast thing pissed me off too! It's not their fault that their natural habitat has smaller, easier trees. Shit happens.",
                                                                                    "score": 2,
                                                                                    "author": "dethmaul"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah he got like that somewhat recently. Don’t know what changed. I’m sure he gets money for some stuff but it seems like a lot of things are stuff that fans send him. Who knows.",
                                                                            "score": 2,
                                                                            "author": "Mr_MacGrubber",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I watch him a lot less based on his recent titles alone. \n\nWhen I started watching him he was doing some cool things like felling trees or building a log cabin right from standing timber. But now, most of his videos are just him talking about whatever and his titles are very hyperbolic. \n\nMaybe he’s making these hyperbolic titles on purpose, but it would be nice if they actually described the video, not “THIS IS MY LAST YOUTUBE VIDEO EVER” or something to that effect.",
                                                                                    "score": 4,
                                                                                    "author": "RustyShackleford14"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No worriers, I'll watch him for the knowledge and skip the rest.",
                                                                    "score": 1,
                                                                    "author": "downtime37"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks for this.  I just ordered one and look forward to playing with it!",
                                            "score": 2,
                                            "author": "forgottenbutnotgone"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mill 2in boards and a few beams with my 50cc chainsaw. I do not go for long stretches without sharpening and cooling down the engine a bit. Longest sections of wood I cut are ~12'.",
                                    "score": 2,
                                    "author": "crew88"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice apartment building for salamanders!",
            "score": 14,
            "author": "SaintOfVacantLots",
            "replies": [
                {
                    "level": 1,
                    "comment": "A pond near me is home to tiger salamanders. I love those little monsters.",
                    "score": 4,
                    "author": "mr_misanthropic_bear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re goddamn adorable.",
                            "score": 3,
                            "author": "SaintOfVacantLots"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is beautiful.  Good work. I long for all-wood heat.",
            "score": 43,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "First house with wood heat for me.  Learned a lot last winter.  I do have some electric baseboard heaters, but I'd go broke trying to run those. \n\nNext up is fixing the insulation and air-sealing so I can actually hold onto some of this heat...",
                    "score": 59,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Long time wood stove guy here, my advice is to keep your stove burning has hot as possible as much as you can. Better to have small hot fires all day than to load it up and “shut it down” due to creosote build up in chimney. \nI wish I had your stack on my homestead!",
                            "score": 23,
                            "author": "yewwould",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Towards the end of last winter I started getting good at keeping it going through the night, at least enough where I still had a bed of coals to easily restart.  Last winter sucked though because I was at work for 10 hours, so I just couldn't keep a hot fire going long enough to really heat the house except for weekends.  I work from home now, so should make things more comfortable.\n\nI didn't mention, but that's 90% ash",
                                    "score": 26,
                                    "author": "amanfromthere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As someone who grew up with a wood stove that caused the house to burn down because of creosote build up in the chimmney, I highly second yewwould's advise.  Also have you chimney cleaned regularly, it can save lives.",
                                            "score": 22,
                                            "author": "downtime37",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea that’s one task I’ll gladly pay to have pros come and do yearly.  I actually remembered to schedule it early this year",
                                                    "score": 12,
                                                    "author": "amanfromthere",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As one of 3 boys growing up my dad would have never gone for that.  :)",
                                                            "score": 2,
                                                            "author": "downtime37"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I learned this last year. We would burn lower heat fires because the house got too hot easily. The problem was as you say the creosote build up in the chimney was BAD. I made it a point to pull the cap and power clean the chimney every few weeks to be safe. But the other issue discovered later was while the house didn’t get too warm the parts of the house further from the stove stayed more humid so there was issue with mold in the back of the house. \n\nThis year even if I means just having to start more fires I’m going for hotter fires and letting them burn down if it must. Hopefully this will keep the chimney cleaner and the moisture out of the air.",
                                    "score": 2,
                                    "author": "tekza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How do you make your fires burn hotter? The wood stays the same, so what can you tweak? \n\nMore/less air is the only thing I can imagne.",
                                            "score": 1,
                                            "author": "LudoA"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How do you make your fire \"small and hot\"? Having trouble imagining how you can tweak this (except for regulating the air). (And by small, you mean less wood I suppose?)",
                                    "score": 1,
                                    "author": "LudoA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes exactly. Split wood small and let plenty of air into stove to keep the fire burning hot.",
                                            "score": 3,
                                            "author": "yewwould",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Very interesting, thanks!",
                                                    "score": 1,
                                                    "author": "LudoA"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know! Our house hasn't really been updated since its build in the late 60's. We're doing the roof this week, which will help. The next project is new windows and doors. Then, I'd like to start the heat conversion process. Natural gas is easy, but its expensive. I don't mind chopping and stacking wood. Good exercise, anyway. Excited for you! Little steps.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Serious question that I've always wondered. Do people run out of wood in their surrounding area? Like if you only wanted to source wood from your own land for heating and whatnot, wouldn't you run out of trees faster than you can grow their replacements?",
            "score": 13,
            "author": "caligloo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely yes. \n\nThis is the reason that [there are more trees now than there were 100 years ago](https://www.treehugger.com/more-trees-than-there-were-years-ago-its-true-4864115) \n\nParticularly in the US, the european settlers cut down 90 or 95% of trees for miles around big settlements, mostly for firewood and construction and clearing land for agriculture.  Many of those have been re-planted as industrial agriculture moved into the most productive areas, and construction lumber has largely begun coming from \"planted\" wood rather than natural forest.  Most lumber comes from vast stands of southern yellow pine and douglas fir that mature in 15 years or so. \n\nThe good thing is that although a true \"old growth\" hardwood forest takes 100 years or more,  a forest can be largely mature in 20 years with proper management, then good selective cutting practices can keep it that way.\n\nAnd, given enough land you could probably permanantly maintain firewood for a family without too much trouble, but you'd need maybe 20 acres of forest to not have much of an impact.",
                    "score": 12,
                    "author": "BigBennP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When they say “volume” are they talking trees per acre or ‘weight’ of wood per acre? Having 1000 old growth huge trees is better than 5000 young trees in terms of usability.  Like if I chop down one of the live oaks on my land that would clear room for probably 30 pine trees but the amount of wood would decrease significantly for a long long time.",
                            "score": 2,
                            "author": "Mr_MacGrubber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't know, but from the context I'm guessing that it's just straight number of trees per acre, because they talk about lack of species diversity and other things in the same breath.",
                                    "score": 2,
                                    "author": "BigBennP",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That seems like a flawed argument then. I’m not an expert though.",
                                            "score": 1,
                                            "author": "Mr_MacGrubber"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You probably know this, but that 20 year figure is going to be regional.",
                            "score": 2,
                            "author": "TheBlueSully"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It depends on how much land you have and how many trees are on it.\n\nI own about 10 acres in NC, maybe 5 acres of it are wooded. There are a ton of standing deadwood trees that I could cut down for firewood - most of them are ash trees that were killed by the EAB and it makes great firewood.\n\nFor my needs, 1 tree worth of wood is enough for winter so it's really not that much. For a larger cabin or a family, you might need 2-3 trees worth of wood. \n\nIn rural areas you can get cut trees delivered pretty cheaply too. A local tree service is usually happy to drop off a few trunks at your place if they're doing a job in the area. And national forests typically allow people to come in and cut deadfalls for firewood during a certain time of year with a $15 permit. \n\nSo if you live in a heavily wooded area, you won't have a problem finding wood. If you live somewhere without a lot of trees then yeah, you might have a problem.",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus neighbors are sometimes happy to have you deal with their dead tree. We’ve removed some before for the “price” of keeping the wood.",
                            "score": 6,
                            "author": "wehrwolf512"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Personally, I have about 10 years worth of dead ash on my property, and I only have 5 acres (only 50-60% wooded).  \n\nA lot of people will just buy wood instead.",
                    "score": 4,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I pass by a guy who sells and delivers a cord for 130. How early might not be worth the effort to source it myself.",
                            "score": 2,
                            "author": "TheBlueSully"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My understanding was always a cord a year could be cut off an acre, in an area with decent rainfall, and would be sustainable forever. So if you burn through 3 cords a winter, you need 3 acres of woodland.",
                    "score": 2,
                    "author": "naidim"
                },
                {
                    "level": 1,
                    "comment": "We have a few hundred acres and we have an overwhelming amount of wood available despite using wood heating on the farm since the 40s. We just stick to already dead trees and still can't keep up.",
                    "score": 2,
                    "author": "666simp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to help my dad from the time I was around 13 till I was 19 every summer to get a minimum of 5 cords for the winter as our house only used a wood burning stove as a heater 😅 We would literally drive out to the woods with a 16’ trailer, load up as many trees as we could find (mind you I was a hundred and fifteen pound girl) just him and I. We’d bring it home, cut them down and then split it. Then my sister would help us stack it up. \n\nIt’s also the reason I laugh if a guy asks if I need help carrying a fifty pound bag of potatoes or onions in the kitchen I work.",
            "score": 5,
            "author": "Reznic007"
        },
        {
            "level": 0,
            "comment": "I love a nicely stacked wood pile.  Gotta love wood heat!",
            "score": 3,
            "author": "woodsdweller45"
        },
        {
            "level": 0,
            "comment": "Leather gloves are to avoid blisters? \n\nHmm I might have to buy some I always end up with blisters and scabs in my hands. That would not be an issue except I work in IT and my fingers and hands are my money makers 🤣",
            "score": 9,
            "author": "mauro_oruam",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me, mostly splinters / cuts.  But if I'm swinging an ax, yea certainly helps with blisters there.",
                    "score": 11,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're not cheap, but I highly recommend [Vermont Glove](https://vermontglove.com/). They're the most comfortable &amp; durable pair of gloves I've ever owned. So much so that I dropped another $100 after my dog ate my first pair. I cut and put up four cord with them this year and they're just getting going.",
                            "score": 13,
                            "author": "likeahurricane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not adverse to spending on quality, I'll keep those in mind.",
                                    "score": 3,
                                    "author": "amanfromthere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Another vote for the goat leather. It's not exactly buy it for life but they do last a couple of years with some care. Bison leather also stands up to life on the farm.",
                                            "score": 4,
                                            "author": "fuckingbeachbum"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Truly beautiful",
            "score": 4,
            "author": "Qwel_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks.  It is nice look at after all that work.",
                    "score": 6,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yah. I split wood like an asshole so I also stack it like as asshole. My woodpile looks crooked lol",
                            "score": 7,
                            "author": "Qwel_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My \"stacked\" wood is a pile. We call it the snake den. Because it's full of snakes.\n\nI like having it full of snakes because they keep the rats away, and rats fucking suck.",
                                    "score": 13,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, good job!",
            "score": 2,
            "author": "PipSqueakScalywag"
        },
        {
            "level": 0,
            "comment": "Cross posted to r/oddlysatisfying hope that’s okay! Nice stack!!",
            "score": 2,
            "author": "prodbymoon"
        },
        {
            "level": 0,
            "comment": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSvVBwNT-3lW-ZQ4ihzOOGpBrTHLknuFTcKeOFrZ6jXZEj1YwWL&amp;s\n\nTrying that this year. Thought it'd make moving it a little easier. Have done a round pile before, worked fine, getting from the pile to the house just takes too much energy and time for my liking.",
            "score": 2,
            "author": "deniedforbenf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yea I saw that one.  Once I get a bigger tractor with forks I'd like to give that a shot.",
                    "score": 1,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll let ya know. I just have a little thing with 3-point forks. It'll work, I hope.",
                            "score": 1,
                            "author": "deniedforbenf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like warm winter to me 👍",
            "score": 2,
            "author": "MidwestFescue82"
        },
        {
            "level": 0,
            "comment": "My ma would ask me to get a log from the bottom.",
            "score": 2,
            "author": "ObiWanBockobi"
        },
        {
            "level": 0,
            "comment": "You’re making me feel soooo guilty! I need to get to work.",
            "score": 2,
            "author": "bemorecreativetrolls"
        },
        {
            "level": 0,
            "comment": "Am I the only one who wanted to see a picture of the gloves?",
            "score": 2,
            "author": "transitional_phase"
        },
        {
            "level": 0,
            "comment": "This looks amazing!\n\nAny advice from anyone on how to ensure woodpiles don't turn into a bug/spider motel?",
            "score": 2,
            "author": "markisaurelius8",
            "replies": [
                {
                    "level": 1,
                    "comment": "There isn’t really a solution to this. I find winter in New England takes care of most of them.",
                    "score": 3,
                    "author": "2020-JLU"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was about to say, split into a few separate stacks.  But goddamn!  That’s a beautiful line of split logs!",
            "score": 2,
            "author": "Spqr_usa-"
        },
        {
            "level": 0,
            "comment": "Why do you need gloves?",
            "score": 2,
            "author": "chubbdeep206",
            "replies": [
                {
                    "level": 1,
                    "comment": "Splinters",
                    "score": 1,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing in life that I will ever do will be nearly as great as this",
            "score": 2,
            "author": "Patrodragon"
        },
        {
            "level": 0,
            "comment": "Plot twist: due to wild fires, no cold weather this year.",
            "score": 2,
            "author": "AUCE05"
        },
        {
            "level": 0,
            "comment": "This is a thing of beauty!",
            "score": 1,
            "author": "Plan_in_Progress"
        },
        {
            "level": 0,
            "comment": "As someone with OCD who likes order this makes me happy. If only it was organized by shade 😂",
            "score": 1,
            "author": "DigbyTheDogKing"
        },
        {
            "level": 0,
            "comment": "That’s so pleasing to look at! How long do you think that will last you?",
            "score": 1,
            "author": "GeorgiaGrind",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hard to say, 2 winters I hope.  If I get the house insulation fixed up and we don't have a super cold winter, might stretch it a bit more.",
                    "score": 2,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do rats live where you are?",
            "score": 1,
            "author": "walkswithwolfies",
            "replies": [
                {
                    "level": 1,
                    "comment": "My cat hasn't brought me any dead ones, so it does not appear so.",
                    "score": 2,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How are you going to keep it dry? Or is this just an outside store until you have room for it in your dry storage?",
            "score": 1,
            "author": "fellow_reddit_user",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea this is outside / long term drying.  I'll have a smaller, covered structure close to my basement that'll store ~1 cord, and then a little store inside.",
                    "score": 3,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can buy rolls of thick plastic in 100' lengths (such as is used in water proofing, house wrap, etc).  I've found it in widths up to 16' so you can easily cover a 2 pallet deep line of wood.  (or just get a 12' wide one and cover a row that is 1 pallet deep).",
                            "score": 1,
                            "author": "amoathbound"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice stack",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What, no pixelart? :P\n\nJ/k, good job!",
            "score": 1,
            "author": "Somethinggood4"
        },
        {
            "level": 0,
            "comment": "Ummm were is the nsfw label?",
            "score": 1,
            "author": "scotch-fanatic"
        },
        {
            "level": 0,
            "comment": "Looks great! Reminds me of a cordwood wall.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Maybe you will get lucky and some ornery kids will push it over",
            "score": 1,
            "author": "Plane-Victory4592"
        },
        {
            "level": 0,
            "comment": "Dang.",
            "score": 1,
            "author": "patchouliwook"
        },
        {
            "level": 0,
            "comment": "As someone who also builds a wood wall every year, beautiful work. I’ve got to start on mine. It’s too dang smokey to work that hard currently but I look forward to the day that mine gets us through another winter.",
            "score": 1,
            "author": "happilyeverbonnie"
        },
        {
            "level": 0,
            "comment": "Leather conditioner for gloves too not just boots",
            "score": 1,
            "author": "Iconoclast674"
        },
        {
            "level": 0,
            "comment": "I want this job. Anti depressants for free.",
            "score": 1,
            "author": "Solitary--Refinement"
        },
        {
            "level": 0,
            "comment": "How many cords is this?",
            "score": 1,
            "author": "Mad_V",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looks like 6 to 7.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some would call this hoarding . Jk . Looks amazing !",
            "score": 1,
            "author": "surfinsnoopy"
        },
        {
            "level": 0,
            "comment": "The Spider Kingdom is complete",
            "score": 1,
            "author": "Getghostdmt"
        },
        {
            "level": 0,
            "comment": "That's a work of art. 👍",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "126 in, 3 up is upside down.  Otherwise perfect.",
            "score": 1,
            "author": "Kuvenant"
        },
        {
            "level": 0,
            "comment": "any wood chopping axe you recommend? sniffin' round the internet now... thanks!",
            "score": 1,
            "author": "InnerOgre",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got this and love it- https://www.amazon.com/Fiskars-Super-Splitting-Inch-378841-1002/dp/B004M3BAQE",
                    "score": 1,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you cover it? How do you keep it dry?",
            "score": 1,
            "author": "Hkspwrsche",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll probably just cover the top with plastic sheeting for now.  This location gets direct sun from 9/10am until dark and it gets a good breeze, so I'm not that concerned about it staying wet for the time being.",
                    "score": 2,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is a hella lot of wood! (That’s what she said)",
            "score": 1,
            "author": "spunkytoto"
        },
        {
            "level": 0,
            "comment": "Dang",
            "score": 1,
            "author": "mrcoy"
        },
        {
            "level": 0,
            "comment": "Lots of ash tree in there.",
            "score": 1,
            "author": "the_TAOest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aside from the small dark section towards the end(oak), it’s all ash.",
                    "score": 3,
                    "author": "amanfromthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in upstate NY about 8 years ago helping my dad with a farm beyond his abilities...the ash trees were under siege from a fungus.  Anyway, I worked. 10 hours a day splitting and stacking and chainsawing so much wood.  \n\nAsh burns nice and hot after seasoning.  Great job on all the work.  I noticed a few were critical of the single, long linear stacking....whatever.  If it falls, the wood burns the same and there is always next year.  Hard work indeed",
                            "score": 2,
                            "author": "the_TAOest"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This picture makes my back ache",
            "score": 1,
            "author": "QuidYossarian"
        },
        {
            "level": 0,
            "comment": "Wow 😃",
            "score": 1,
            "author": "evol6968"
        },
        {
            "level": 0,
            "comment": "firewood tears through gloves like nothing else.  I've heard good things about rubber coated gloves.  Just switched myself and it looks promising but can't say conclusively yet.  ActivArmr medium duty.",
            "score": 1,
            "author": "jaasx"
        },
        {
            "level": 0,
            "comment": "Ah for the days when I can live somewhere where I need to stack wood for heat. One day I hope",
            "score": 1,
            "author": "flamingphoenix9834"
        },
        {
            "level": 0,
            "comment": "Might be a dumb question- what do you put under the stacks? We’re going in to our 2nd winter with a wood stove and had them stacked on pallets last year, but I’m sure there’s a better way.",
            "score": 1,
            "author": "Csyj",
            "replies": [
                {
                    "level": 1,
                    "comment": "looks like treated 4x4s on pavers or blocks.",
                    "score": 1,
                    "author": "stuckit"
                },
                {
                    "level": 1,
                    "comment": "I used 4x8x16 concrete blocks, with 2x4 rails. I also used some plastic sheeting underneath  https://imgur.com/gallery/O2yFvqY",
                    "score": 1,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy moley",
            "score": 1,
            "author": "skippin_kid"
        },
        {
            "level": 0,
            "comment": "So nicely stacked!  This pleases the OCD in me.",
            "score": 1,
            "author": "Mulberry-Branch-Farm"
        },
        {
            "level": 0,
            "comment": "Holy shit",
            "score": 1,
            "author": "Linger96"
        },
        {
            "level": 0,
            "comment": "This appeals to my inner me a little. Except I’m not that organized.",
            "score": 1,
            "author": "biermaken311"
        },
        {
            "level": 0,
            "comment": "I agree that, yes, you're mostly done. So close - those last few pieces are killing me!",
            "score": 1,
            "author": "WitYoBadSelf"
        },
        {
            "level": 0,
            "comment": "Craig Miller???",
            "score": 1,
            "author": "Boxersrock1000"
        },
        {
            "level": 0,
            "comment": "That is not firewood... that is a fence.",
            "score": 1,
            "author": "OldGeezerInTraining"
        },
        {
            "level": 0,
            "comment": "How's your back?!",
            "score": 1,
            "author": "what_is_blue"
        },
        {
            "level": 0,
            "comment": "Now that is a beautiful thing!\n\n Great job, your arms officially can never be referred to as \"noodles\"! :)",
            "score": 1,
            "author": "I_SMELL_ASS"
        },
        {
            "level": 0,
            "comment": "Now you have a new saying and “excuse” to buy a more expensive pair of gloves “why go through two pairs of cheap gloves when one nice pair will do the job?”",
            "score": 1,
            "author": "SupGirluHungry"
        },
        {
            "level": 0,
            "comment": "You are right to proud of your stack but a few people take it to another [level](https://duckduckgo.com/?t=ffsb&amp;q=fire+wood+art+stacking&amp;atb=v232-1&amp;iax=images&amp;ia=images).",
            "score": 1,
            "author": "no-mad"
        },
        {
            "level": 0,
            "comment": "The last based subreddit lol",
            "score": 1,
            "author": "Eagleheart585"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Central Ohio.  I used to live in NW Ohio, which is just flat and dull.  Different Ohio once you get far enough E/SE",
                    "score": 1,
                    "author": "amanfromthere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s an insane amount of work great job 👏",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s it? You’re gonna need more",
            "score": 0,
            "author": "bifftanin1955"
        },
        {
            "level": 0,
            "comment": "Nice work I'm sure it took some time, but kind of feel let down that you didnt stack a cool picture or pattern into the pile.. Oh well, maybe next time!",
            "score": 0,
            "author": "whatisyournamemike"
        }
    ]
}