{
    "id": "mjc4vh",
    "score": 4955,
    "title": "Woke up to a pleasant surprise in the sheep pen this morning!",
    "author": "huisek",
    "date": 1617468186.0,
    "url": "https://www.reddit.com/r/homestead/comments/mjc4vh",
    "media_urls": [
        "https://i.imgur.com/0Udw6fS.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Cute alert!!! Call the cute police we’ve got another one on the loose!",
            "score": 135,
            "author": "roryhere"
        },
        {
            "level": 0,
            "comment": "Awww a surprise with a massive head",
            "score": 122,
            "author": "mafiamasta"
        },
        {
            "level": 0,
            "comment": "That calf has a very small body!",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a lamb, I think",
                    "score": 9,
                    "author": "7ilidine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "what breed is that? what do its parents look like? how many hours old is it now? Tell us everything!!!!!!!!!!! pretty please?",
            "score": 70,
            "author": "wimaereh",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mom is an Icelandic x Gotland cross. Dad was a Border Leicester. The photo is the mom, never met their dad. That lamb is less than 8 hours old. Here is a pic of mom https://i.imgur.com/zvbfjlk.jpg",
                    "score": 107,
                    "author": "huisek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yay!!!! Thanks so much for your reply",
                            "score": 30,
                            "author": "wimaereh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Moms name is Ethel by the way. This is her first baby",
                                    "score": 50,
                                    "author": "huisek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Name the baby Noal, so you'll have ethanol.",
                                            "score": 71,
                                            "author": "Deceptichum",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Take your upvote and *get out*",
                                                    "score": 34,
                                                    "author": "somethingnerdrelated"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Name the lamb Lucy!",
                                            "score": 12,
                                            "author": "MutedArugula4"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have 4 goats 3 girls and one boy. They are named Lucy, Ethel, Ricky, and (Wini)Fred.",
                                            "score": 6,
                                            "author": "djdigiejfkgksic"
                                        },
                                        {
                                            "level": 4,
                                            "comment": ":)",
                                            "score": 2,
                                            "author": "owlswollen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mom and baby look radiant, give them both gentle hugs from me (and everyone else who sees your post). I wish all of you the best!",
                                            "score": 2,
                                            "author": "censorinus"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Judging from the photo, the mother’s wool seems to lean more towards Icelandic than Gotland, is that the case?  Do you use her wool for crafty things at all? I work in a textile mill and love interesting crossbreed wools! I’d be fascinated to see how her fibre works up. Congrats on the adorable addition to the family!",
                            "score": 6,
                            "author": "isaiddanger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If I was interested in getting the wool milled, would you have any tips on finding a local mill? I did some cursory searching but not really what to look for. Need to find a shearer yet too. I borrowed a shear to crutch them before lambing and woof I don’t know that I can shear them without some mentor ship. That’s hard stuff",
                                    "score": 3,
                                    "author": "huisek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where are you, approximately? If you go to local 'fiber shows', there will usually be several wool processors among the vendors/exhibitors. They can spin, even dye the wool in any way you desire. Best way to find a fiber show is to go to a place (or even an online vendor) that sells spinning wheels, wool and such.",
                                            "score": 2,
                                            "author": "Then_Independent932",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Southern Minnesota",
                                                    "score": 2,
                                                    "author": "huisek",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Here's a fiber festival, which appears to have been cancelled for 2021.\nhttps://shepherdsharvestfestival.org/\nLike I said, try to find an area spinning store or guild and network with them. These gentle people tend to be very generous with their time and knowledge, having a true love of the craft and a desire to keep it moving forward. Also, University of YouTube has a wealth of information on how to do things.",
                                                            "score": 2,
                                                            "author": "Then_Independent932"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can’t help with the shearing unfortunately, I only deal with wool once it’s already off the beast! Talking to others who own sheep, especially others that have small herds like yourself, should give you some shearer’s names - Facebook can be helpful too. \n\nAs for processing the fibre, it sounds as though u/Then_Independent932 is talking about hand spinning - which definitely has its merits and makes a different character of yarn to commercially-spun yarns, but is probably only viable for a fleece or two at a time. If you want larger volumes done you’re probably best looking for a spinning mill, although there are huge variations in what each mill will process and how, and you might be limited by the variation of wools within your herd. A quick search on google gives a few mills in your state - but be aware that most mills will accept fibre shipped to them so you could also probably go to an out-of-state mill too. Again, talking to others for recommendations might help. \n\nAs for what you’re looking for with a mill, your best bet first is to talk to the mills themselves. Whenever potential clients phone my mill we’re always happy to chat about fibre and give guidance about their wool. It’ll give you an idea of minimum batch sizes (some mills can do very small batches of a couple of fleeces, others will have a minimum of c. 20kg or so, some will need &gt; 100kg which will likely be far too much for you), products they can do (just knitting yarn? Weaving yarn that you could then send to a weaving mill for finished items to be made? Other craft items?), and the type of spinning they can do: woollen or worsted. Woolen spinning is fluffy, typically not particularly strong (although that can vary with fibre type), and quite ‘open’/not dense as far as fibre arrangement goes. Worsted spinning produces a very sleek, uniform yarn that tends to be stronger and more dense - worsted spinning can also produce finer yarns than woollen. I would personally recommend worsted for your wool, assuming they’re all of the Icelandic/Gotland-y type of fibre (versus, say, Shetland which is very springy). \n\nI hope that helps! Happy to talk some more about it if you’d like.",
                                            "score": 2,
                                            "author": "isaiddanger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To be more clear, I was not suggesting hand spinning the fleece, rather just connecting with  the hand spinning community to find area wool processors. Fleece processing is a good skill to have. You might not mind paying for the service after one time of DIY! At the very least, you'll appreciate the work that goes into doing it right.",
                                                    "score": 2,
                                                    "author": "Then_Independent932"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Awesome! I appreciate the advice. I’m not into fiber craft at all but don’t want to put the wool to waste. if the money could work out to process it and sell the yarn or something on a small scale that would be cool. Not looking to get rich but wouldn’t want to lose money on it. Can you give me a ballpark what it costs to process a fleece to roving or yarn? I was trying to read on one mills site and my lack of understanding terminology is making it hard to know what all needs to happen but it was looking like $20-30 per pound to end up with a finished product. Is that true?\n\nOne of the reasons I picked up wool sheep is also because I’m interested in tanning fleeces in the future",
                                                    "score": 2,
                                                    "author": "huisek",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m in the UK so pricing might be a bit different but those figures look more or less correct. It isn’t cheap, I recognise that, but coming from someone in the industry: it takes a lot of work and expertise to take raw wool and make it into yarn. \nMarketing is your best friend when it comes to making your money back: people love to know the provenance of their wool. They want to know which farm it came from, and if possible they want to know which individual sheep it came from. A bit of farm history, info on the flock or sheep, and a nice photo will mean you can tack an extra $10 on the price of a ball of wool. Artisan, locally-made yarn with provenance should already fetch a decent price. Look at your run-of-the-mill ball of acrylic yarn and quadruple the price, at minimum. \n\nIf that all seems too daunting or just simply something you don’t want to get into - you can always sell raw fleece to crafty people. You won’t make a ton of money, but it’ll cover the cost of the shearer. Again, provenance and marketing will be your friend with getting a decent price.",
                                                            "score": 2,
                                                            "author": "isaiddanger",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You are amazing. Thanks so much for the advice!",
                                                                    "score": 2,
                                                                    "author": "huisek",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "😊 no worries! Best of luck, whatever you decide to do.",
                                                                            "score": 2,
                                                                            "author": "isaiddanger"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I believe her mom was the Icelandic and the dad the Gotland. Her wool is unique in that it is short and tight, very tight curls. My other ewe that is the same mix has very different wool. Longer and fuller. I only just got these sheep this year so I haven’t had time to make any plans for the wool yet. Just focusing on lambing and getting their pasture rotation figured out. The lady I bought them from was a hand spinner though and was breeding for wool quality https://i.imgur.com/a7qEByL.jpg https://i.imgur.com/ImuXjOc.jpg",
                                    "score": 2,
                                    "author": "huisek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We have Icelandic and the lambs have that adorable Jerry-curl coat but it gets longer and straighter as they grow up.",
                                            "score": 2,
                                            "author": "angrypigfarmer"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s really interesting, thanks for the reply. It’d be fascinating to see how the original breeder’s plan worked out... do either of your girls have the Icelandic undercoat?",
                                            "score": 1,
                                            "author": "isaiddanger"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The lamb seems pleasantly surprised as well.",
            "score": 21,
            "author": "walkswithwolfies"
        },
        {
            "level": 0,
            "comment": "Baa Baa black sheep, have you any wool?",
            "score": 13,
            "author": "billygoat2017",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes sir yes sir",
                    "score": 4,
                    "author": "__ShopSmartShopSMart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Three bags full!",
                            "score": 3,
                            "author": "greeneman05"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow!  What a blessing!",
            "score": 9,
            "author": "Zealousideal-Pool826"
        },
        {
            "level": 0,
            "comment": "Cutest thing I’ve seen in a bit - thx for sharing!",
            "score": 8,
            "author": "OdinsOneGoodEye"
        },
        {
            "level": 0,
            "comment": "Oh look how smoll",
            "score": 19,
            "author": "graszitrone",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/illegallysmol (you're welcome)",
                    "score": 8,
                    "author": "calm_chowder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Too many rats.",
                            "score": 3,
                            "author": "dopeandmoreofthesame"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very cool yes definitely a big head is it a sheep or a calf?",
            "score": 4,
            "author": "annezieleman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, the topic is \"Woke up to a pleasant surprise in the sheep pen this morning!\" so I guess it's a lamb. Althought the angle does make it look odd.",
                    "score": 14,
                    "author": "esc0r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only someone else called the lamb a calf that is why I was confused beautiful little lamb",
                            "score": 1,
                            "author": "annezieleman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a cutie!",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I wants to hug you!",
            "score": 4,
            "author": "allabtdatranch20"
        },
        {
            "level": 0,
            "comment": "Give it to meeeeeeee! (Just kidding but please do smooch this bb for me)",
            "score": 3,
            "author": "KentuckyMagpie"
        },
        {
            "level": 0,
            "comment": "Too cute",
            "score": 3,
            "author": "mrzman_bigz17"
        },
        {
            "level": 0,
            "comment": "LOL! Much better than we had this morning. Woke up to a hen in our tent. To top it off, she had laid an egg for us too...",
            "score": 3,
            "author": "Heck_Spawn"
        },
        {
            "level": 0,
            "comment": "Aww.   So cute.",
            "score": 3,
            "author": "antifakism"
        },
        {
            "level": 0,
            "comment": "Oh heck! What a wonderful, happy surprise!!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh hey little baby 😍",
            "score": 3,
            "author": "Wise_Acanthaceae_435"
        },
        {
            "level": 0,
            "comment": "😍😍😍 happy Easter lovely!!!",
            "score": 3,
            "author": "TheNokk"
        },
        {
            "level": 0,
            "comment": "lil baby",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What a cutie!!  Thanks for posting!!",
            "score": 3,
            "author": "greeneman05"
        },
        {
            "level": 0,
            "comment": "so cute",
            "score": 5,
            "author": "mcluse"
        },
        {
            "level": 0,
            "comment": "Cute as a button!",
            "score": 2,
            "author": "Lebraan"
        },
        {
            "level": 0,
            "comment": "He is so cute!!",
            "score": 2,
            "author": "Due-Mistake-2666"
        },
        {
            "level": 0,
            "comment": "Oh dang!! That’s cute",
            "score": 2,
            "author": "the_neil_show"
        },
        {
            "level": 0,
            "comment": "Wow that is very cute",
            "score": 2,
            "author": "herptasticplastic"
        },
        {
            "level": 0,
            "comment": "You sleep in the sheep pen?",
            "score": 2,
            "author": "zabutter"
        },
        {
            "level": 0,
            "comment": "Awww 🥰 cute",
            "score": 2,
            "author": "Just_Exercise_9899"
        },
        {
            "level": 0,
            "comment": "But why does its head look like that?",
            "score": 2,
            "author": "BizarroIsNo1",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s just the perspective. His ears are back and he has a tuft of hair on the top of his head that is making it look big",
                    "score": 2,
                    "author": "huisek"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[I'm the black sheep the real black sheep ](https://m.youtube.com/watch?v=rJVyxAdwZgw)",
            "score": 2,
            "author": "boil_juice"
        },
        {
            "level": 0,
            "comment": "[I don’t want to alarm you but..](https://en.m.wikipedia.org/wiki/Jersey_Devil)",
            "score": 2,
            "author": "TuckHolladay"
        },
        {
            "level": 0,
            "comment": "What was the surprise?",
            "score": 1,
            "author": "OneGratefulDawg"
        },
        {
            "level": 0,
            "comment": "What animal is that I need one!",
            "score": 1,
            "author": "TwinzNDogs"
        },
        {
            "level": 0,
            "comment": "Cutie 🐑",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Omg he/she is so cute",
            "score": 1,
            "author": "Enough-Historian-366"
        },
        {
            "level": 0,
            "comment": "Aw!! So small!! Little friend!!",
            "score": 1,
            "author": "InformalFiggy"
        },
        {
            "level": 0,
            "comment": "I didn’t know Zika was zoonotic.",
            "score": -7,
            "author": "RealBuckNasty"
        },
        {
            "level": 0,
            "comment": "But can it say the n word?",
            "score": -3,
            "author": "desk4300"
        }
    ]
}