{
    "id": "rt5fwd",
    "score": 5378,
    "title": "I bought the ranch! Paid off OWC loan 11 years early, Grant Deed in hand, starting new year as FULL owner of my 24 mountain acres!",
    "author": "LIRON_Mtn_Ranch",
    "date": 1640991335.0,
    "url": "https://www.reddit.com/r/homestead/comments/rt5fwd",
    "media_urls": [
        "https://i.redd.it/h1nzv1btjy881.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Congratulations! Super jealous of the land and the hat.",
            "score": 106,
            "author": "Joro1up",
            "replies": [
                {
                    "level": 1,
                    "comment": "What hat?",
                    "score": 170,
                    "author": "Warlockdnd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi, dad!",
                            "score": 10,
                            "author": "redsthename",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Where are the cigarettes?",
                                    "score": 1,
                                    "author": "Ok-Yogurt-2743"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dream of retiring to this particular area of wilderness one step closer to fruition!  After camping in the area since my early 20s, reading the local paper's ads for cabins and acreages and dreaming, I finally found a parcel for sale by owner with a down payment I could make.  In the 4 years, I was able to pay the principal down with extra payments on track to pay off in under 10 years as opposed to 15.   Seeing housing prices at a peak with potential for a long term dip, I sold my house in town for a good amount and paid the loan off.   Now here I stand as FULL OWNER going into 2022!\n\nYou can do it too!   Finding an owner willing to carry with a low down payment IS a viable way to launch your dreams of owning a homestead some day.",
            "score": 217,
            "author": "LIRON_Mtn_Ranch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats!! There are certainly owners willing to work with you like this.  Banks didn't want to work with us for raw land,  but we wanted to get this parcel that was near us (western PA). So my wife and I recently did the same,  put a larger down payment, and the owner is financing us for the remainder.",
                    "score": 16,
                    "author": "PH_Hollow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome, congratulations!",
                            "score": 13,
                            "author": "LIRON_Mtn_Ranch"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is exactly what I was working towards until Covid.  Now land prices are out of reach just as I have about saved enough for 40 acres in the hills.",
                    "score": 21,
                    "author": "TheMachoManOhYeah"
                },
                {
                    "level": 1,
                    "comment": "I am 67 living in the hot windy flatlands ( but very near beaches) of Florida and have large home and prepping to sell as market strong. Love the west, informed I am going to have to go alone as wife is electing to Move to the tundra. So new plan. Me and a couple of dogs but need strong Internet unfortunately. Any suggestions welcome! And thanks for sharing how your dream was fulfilled through sheer will and hard work!",
                    "score": 14,
                    "author": "chrjenjulluk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; but need strong Internet \n\nThat's a must have for me too.  My proximity to the I-5 corridor means I get excellent cell coverage on much of my property despite steep remote terrain.  I can also pick up the premium wi-fi signal at the truck stop below with just the internal antenna of my laptop.   I'm thinking of finding someone line of sight down the hill who wants to split their internet bill, and set up a directional antenna at their place, and local repeater/range extender communicating with that.\n\nStarlink is neat, but unless it slides down the price/volume curve over time it's way more expensive than other options available to me rn.",
                            "score": 10,
                            "author": "LIRON_Mtn_Ranch"
                        },
                        {
                            "level": 2,
                            "comment": "The SpaceX starlink is reallybreally good IF a zipcode already has it, and they do exist.",
                            "score": 10,
                            "author": "garaks_tailor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any word on when he's going to do the portable version?",
                                    "score": 5,
                                    "author": "buffalo_Fart",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably not till they have full coverage.  Right now they only have...idk the actual number but like 20% of the total number of satallites up.  Once they have them all up i think they will begin offering the portable one.  Right now its limited to certain locations and only a certain number of people in regions so they dont get overwhelmed with demand.\n\n\nI coworkers uncle has it north of Albuquerque and is very happy with it.",
                                            "score": 3,
                                            "author": "garaks_tailor"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’ll this is too personal I apologize, does this mean you are getting divorced?  I only ask because I can see my wife and I differing on where we want to live when we get a bit older.  We have a valuable full time home in a high cost of living area that we would like to leave when kids are done with school.  We also own cabin and some land in upstate ny.  I would love to go there but my with wants to go south to Florida.  Not sure how it will shake out.",
                            "score": 2,
                            "author": "blackdogpepper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hi Black DogPepper. Not at all. We have been married for 43 years. All happy and still no fighting issues. We live in SW FL and I am also from Upstate NY. Moved to Miami day after we were married. Finished college. I was in real estate business my entire career. Struggled a great deal financially as wife wanted to stay home with first child. In any event I was fortunate and did well enough to send kids to college debt free. Here is thing. The only thing we found challenging was our different concept of parenting. I am firm believer that we needed to raise kids to be independent. However, a recent phenomenon has been written about a great deal. Very simply the current question facing many in marriage after the kids move out is this; is the spouse, and is usually Mom at risk of being gender biased going to choose staying with her husband or continue to serve at pleasure of children. Ours are spoiled. Her not working was bad idea after third son entered middle school. I earned good living but traveled internationally extensively. \nSo  fast forward all three still dependent on Mom for Mom and two at 30 and 23 on Dad for money. Son totally blew two years at university and moved home over my strenuous objections. I put a tent and sleeping bag in the driveway. Harsh? Not really. That was over two years go and mom still does his wash, cleans room etc…\nShe does not see long-term damage. \n\nSorry, plan was to buy a house in MN near daughter (Phd) professor, son-in-law atty and two very young grandchildren. So wife is not home much. I was willing to buy small little summer place in country but she want\nS near city. Nope was never plan. So divorce, I have zero desire to see other women and never would. However, economically for her and kids may be better. \nGreat article in Psychology Today dissecting why this is more and more of an issue.  In fact many articles on matter. Mostly it is money and wife never could say no. I take responsibility for not being more budget minded. Very sad for us. Not sure what your particulars are but clearly bond from wife is stronger with eldest daughter than with me. Hurts. But life goes on! Bless you and your family in the new year!",
                                    "score": 3,
                                    "author": "chrjenjulluk"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also, have done nothing but real estate my entire career and in FL. Don’t buy right away. A suggestion of course. So many folks don’t really like it because depending on where you,live of course it is nothing like the travel ads. Seems entire northeast and mid-west and moving here. I would rent for four or five months a year and enjoy cabin! A suggestion of course. I am jealous! Anyway very best of luck.",
                                    "score": 1,
                                    "author": "chrjenjulluk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for both of your responses.  I have no intention of buying anything in Florida anytime soon and hopefully never, if forced to go south I would prefer the Carolinas. We have a few years to go before I can leave Long Island.",
                                            "score": 2,
                                            "author": "blackdogpepper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Time to plan is helpful. I wish I had written down some specifics informally because recall changes as time passes but all will end well. Positive thinking. And again sorry for long responses earlier.",
                                                    "score": 1,
                                                    "author": "chrjenjulluk"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://imgur.com/gallery/8toIzOJ\n\nHere's a map of your property with the ridges/valleys mapped out.\n\nFrom here you would ideally: \n\nseek water in the valleys/do earthworks for water harvesting\n\nbuild access to the water on ridges/contours\n\nThen place structures on a ridge, near the water (ideally mid slope and south facing).",
                    "score": -15,
                    "author": "OakParkCooperative",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice work",
                            "score": 5,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Here's a map of your property with the ridges/valleys mapped out.\n\nBro I know where the ridges and valleys are.  Please stop now.",
                            "score": 6,
                            "author": "LIRON_Mtn_Ranch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're asking strangers to take an interest in your property, and then when someone actually does, you have snapped at them. Maybe it wasn't a very useful suggestion / map, but I think they were just trying to help / participate in their own way. Just a neutral observation.\n\nAlso they mentioned they're autistic elsewhere in the thread, so showing some grace there would be a nice thing IMO.\n\nGood luck with your property, it's always fun and inspiring to see such enthusiasm.",
                                    "score": 12,
                                    "author": "pataoAoC",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Just a neutral observation.\n\nAll people can see here is the *end* of a long process.  He wrote several kinda escalating responses in a short time to different posts in a different subreddit, and other threads of this post, before coming here to the top post, *all before I even responded to the first one.*   \n\nThat's why my \"first\" response looks all out of proportion when you start reading here.  ¯\\\\\\_(ツ)_/¯",
                                            "score": 1,
                                            "author": "LIRON_Mtn_Ranch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Before replying, I did check his post history to see what got you so wound up, and I saw eg https://www.reddit.com/r/LironMountainRanch/comments/plz1fc/-/hqr0bkd which seems completely harmless and eminently reasonable. And the \"escalations\" are things like asking how the pine trees are located relative to valleys to try to understand the water table. Lol, escalating in helpfulness, I guess?\n\nI understand being overwhelmed with notifications but ¯\\\\\\_(ツ)_/¯ really feels like you're overreacting a bit here",
                                                    "score": 5,
                                                    "author": "pataoAoC",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh criminy Reddit, if people aren't going to take *please stop* for an answer, I'll go ahead and spell it out for y'all.\n\nWhen meeting a stranger, one offers an initial greeting, **then waits for the other to respond, then calibrates their next words according to how the other person responded.**  \n\nIf the first person keeps talking without the other person responding, *the other person experiences this as an unpleasant intrusion,* and one that is likely to continue and even escalate if they engage.   **The INTENT of the person unilaterally communicating is IRRELEVANT to the recipient at this point.**  \n\nIf it was a salesman ringing your doorbell for 2 minutes straight, or a stranger following a teenage girl saying, \"Hey baby... HEY BABY... Are you deaf?...  Come on, don't be so stuck up!\"  who would you scold for acting rude and antisocially in those cases?\n\nHim stating he's autistic does not change any of this.   This is not his fault, **but it is still his responsibility.**  I grew up aspie myself, and had a rough time in my teens and early 20s, till I WILLED myself to manually learn how neurotypical people \"naturally\" interact smoothly with one another.   All the wishing and whining an scolding that the world was unfair for not understanding my pure intentions was not just wasted but counterproductive.  ONLY by changing my \"natural\" behavior to flow in typical expected ways changed my OUTCOMES with other people positive for all parties.\n\nNow.\n\nI don't want a new map of my property right now, thanks.  Would that be OK with you?  &lt;--- (This is a rhetorical question or thought experiment, NOT a request for anyone's permission.)",
                                                            "score": -2,
                                                            "author": "LIRON_Mtn_Ranch",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I get why you got annoyed, but your \"salesman ringing the doorbell\" analogy is pretty far off base IMO. He wasn't trying to sell you anything or get anything from you, just trying to help. Even if you found it less than useful, getting upset isn't a generous response IMO.\n\nFWIW I wondered if you might also be on the spectrum, so that makes a lot of sense, and I'm happy you seem to have figured out how to navigate life. My son is autistic so that is something I think about a lot.\n\nAnyways, I hope you enjoy your new property and I'm happy for you! Whether you have the ridges on a map or not 😂",
                                                                    "score": 1,
                                                                    "author": "pataoAoC"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What would you like me to stop?",
                                    "score": 1,
                                    "author": "OakParkCooperative",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "OP posted the info himself.",
                                                    "score": 9,
                                                    "author": "redrocket608"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He posted maps of his own property \n\nwith diagrams and written directions on exactly how to get there\n\nOn an account specifically made for discussing his property.\n\n*Stop offering unasked for advice*",
                                                    "score": 8,
                                                    "author": "OakParkCooperative"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Invading his privacy? The guy is a boomer who posted all this private information himself and then [surprise pikachu face] people looked at it. His fault for being an idiot on the internet.",
                                                    "score": 8,
                                                    "author": "ThisFreaknGuy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If someone went out of their way to provide maps of my new property, I would be ecstatic.\n\nI certainly wouldn't call them brain damaged and then keep saying \"stop\" like I've been victimized...",
                                                            "score": 8,
                                                            "author": "OakParkCooperative"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "(redacted response)   That's reddit for ya.\n\nEdit: was a forgettable exchange.",
                                                    "score": -10,
                                                    "author": "LIRON_Mtn_Ranch",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Bit of an old cunt aren't you?",
                                                            "score": 4,
                                                            "author": "fre3k",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "After 1/3 century of soul-crushing customer-facing work in the big city, I look forward to retiring to a density of 1 house per 25-40 acres.  ( ͡°╭͜ʖ╮͡° )   Nuff said.",
                                                                    "score": 0,
                                                                    "author": "LIRON_Mtn_Ranch",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "😢💔🙋‍♀️🙋‍♀️👏👏🔥💗",
                                                                            "score": 1,
                                                                            "author": "WhoaHeyAdrian"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Actually I'm autistic but thank you for implying I am  brain damaged...\n\nJust because some dummy posted a picture of his private documents onto the internet\n\nand then posted a Google Earth map of his own property, describing exactly how to get there...\n\n*Those damn redditors always causing me to dox myself*",
                                                            "score": 8,
                                                            "author": "OakParkCooperative",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If I wanted to drill down on the topic of literally drilling down in this post, I would have responded to you below, before you moved here to the top thread.  I'm not even worried about doxxing.\n\nNow, please.  *Stop.*",
                                                                    "score": -2,
                                                                    "author": "LIRON_Mtn_Ranch",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I have no idea what you are talking about \n\nor what you want me to \"stop\".\n\nYou want me to stop posting in this public thread that you created?\n\nObviously your not concerned about me doxxing so what are you whining about?\n\nThis is the internet, sir.",
                                                                            "score": 6,
                                                                            "author": "OakParkCooperative"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Could you explain how this is \"cringe troll shit\"?",
                                    "score": 5,
                                    "author": "OakParkCooperative"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please keep hold of it and don't let them develop it into a human land the world needs to have wild areas I'm really happy for you maybe you could even make more wild so the planet has half a chance",
                    "score": 0,
                    "author": "Aggravating-Yellow85"
                },
                {
                    "level": 1,
                    "comment": "Hell yeah brother",
                    "score": 1,
                    "author": "garaks_tailor"
                },
                {
                    "level": 1,
                    "comment": "Congratulations!  I noticed you spent plenty of time looking over the local area, and read the papers... how did you finally make the connection with the local owner, were they willing to meet with you based just on your call, or on your time / interest you'd spent in the area + getting to know you, etc.?  From what you could tell, what clinched it for the prior owner that made them think it would be good to sell to you (vs. someone else maybe)?",
                    "score": 1,
                    "author": "pcvcolin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; how did you finally make the connection with the local owner\n\nThe guy made it real easy for me, by listing it on Ebay.   It was a \"Your winning bid is the down payment, balance put into a 15 year 9% mortgage with no early payoff penalty\" type of deal, as many OWC auctions go.",
                            "score": 1,
                            "author": "LIRON_Mtn_Ranch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for covering this detail, I will be thinking about this technique as I look around.  Appreciate you sharing a part of your story, enjoy (and care for) the land!",
                                    "score": 1,
                                    "author": "pcvcolin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Happy for you! Congrats!!!!",
                    "score": 1,
                    "author": "Chippopotanuse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck yeah! Congratulations!!!!",
            "score": 11,
            "author": "Mr3cto"
        },
        {
            "level": 0,
            "comment": "That must be an amazing feeling!  Gratz, man!",
            "score": 9,
            "author": "Shenanigatory"
        },
        {
            "level": 0,
            "comment": "Good on ya",
            "score": 8,
            "author": "iceroad_indy"
        },
        {
            "level": 0,
            "comment": "Congrats Lord of the Mountain!",
            "score": 9,
            "author": "manerivera"
        },
        {
            "level": 0,
            "comment": "I can read some info on that paper, kind of pin pointing yourself, I would delete and mark it out better! \n\nCongratulations! Enjoy and post pics of what you’re doing with it (if you want!)",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh shoot, you're right!  Between the thread title and a digit on the paper, you can get an integer value of the acreage!  From there you can go onto county assessor and GIS websites, and in under an hour, want to throw your computer into a volcano because of how poorly these enterprise level systems perform at tasks like parsing an APN in the same format they list it in, on another part of their own website, and still be no closer to finding me than when you started!\n\nEdit:  I don't particularly care about getting doxxed here.  It's strange that more than one contentious side-discussion has emerged.   Maybe it's due to NYE tippling.  Let's try to keep the mood happy-celebrating-drunk here, not angry-argumentative-drunk.",
                    "score": -5,
                    "author": "LIRON_Mtn_Ranch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems like it took somebody 30 minutes on new years eve (on a smaller sub) to find and post your property. Internet be crazy.",
                            "score": 13,
                            "author": "redrocket608"
                        },
                        {
                            "level": 2,
                            "comment": "I was able to read the parcel number and everything with about 30 seconds of photoshop work.  Not that I give a shit about it, because I'm happy for you for owning your own land, but the commenter is right, there's assholes out there, so using pure black to censor (replace pixels) is the way to go.",
                            "score": 26,
                            "author": "RickMuffy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Better yet, remove the pixels completely.",
                                    "score": 4,
                                    "author": "CKRatKing"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bro I’m just trying to help, not everyone is tech savvy and wanted you to know, I like privacy, I live the the woods for a reason, you do you. But don’t under estimate people’s douche baggery or just boredom, have a great New Years and stay safe!",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That rant got threaded after your response but it wasn't directed *at* you.  Cheers.",
                                    "score": 6,
                                    "author": "LIRON_Mtn_Ranch"
                                },
                                {
                                    "level": 3,
                                    "comment": "Douche baggery indeed.",
                                    "score": 1,
                                    "author": "Hedph0nes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for your feedback.  There were a couple of side threads going off into the weeds at once for some reason, and the rant that emerged above was not aimed at the person I was responding to but the subjects within.",
                                    "score": 3,
                                    "author": "LIRON_Mtn_Ranch"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "now what?   \n\nseriously...what's next/first/the-plan?",
            "score": 6,
            "author": "paynoattentiontome98",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was completely unimproved land when I bought it.  Lots of extremely steep terrain and untamed chaparral.  At first I was a bit, \"What the heck did I buy?\"  I visited several times over the first months, getting a feel for the land.  Learning the light and win patterns, the sounds, the way water flows when it rains.  Picking my way along faint 4-legged game trails and shoom-shooming through brush getting foxtails in my socks and ticks in my pants.  Through this process, I decided where I wanted the initial roads and parking pads, and where some trails should run.\n\nFast forward several years to now.  I've built a couple of roads and parking areas, and dug a network of trails criss-crossing the hillsides all the way to the 600' bottom.  I've set up camping areas and gotten some income renting to campers through Hipcamp.  This year I hope to improve these sites even further, and start in earnest toward my dream of semi-retiring on the mountain soon.  I may start in a small house in town and have a secure coyote and bobcat proof cattery built up at the ranch so I can spend days at a time living up at the property without leaving my cats alone at the house.  It will be a 2 or so year process once I get the ball rolling on building an actual house on the property, but that is the ultimate plan.  \n\nI've been looking at log cabin kits and have even considered a dome home, which I think would blend in with the rounded hills well.",
                    "score": 12,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done!!",
            "score": 4,
            "author": "BouncedPlace03"
        },
        {
            "level": 0,
            "comment": "Congrats!!!",
            "score": 5,
            "author": "horsehaver"
        },
        {
            "level": 0,
            "comment": " Congrats! Share more pics!",
            "score": 4,
            "author": "Learninger2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, and I will.   I made this Reddit account specifically for Ranch stuff, but like so many things on the internet, basically ended up mostly using it to post pictures of my cats.",
                    "score": 12,
                    "author": "LIRON_Mtn_Ranch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Start on the second page of my submitted posts.  It's cats all the way down.",
                                    "score": 2,
                                    "author": "LIRON_Mtn_Ranch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They're almost 2 now, and I've only adopted off one of the five.  The claws baby is a beautiful tortie with a quiet ultrasonic meow and demeanor.  The males are lithe and muscular.  Mama Kitty was semi-feral; I had her spayed and eartipped and released her when the kittens were well weaned.  She hung around the shop for over a year.   The last 2 days she was around she sometimes meowed at me like there was more than food that she wanted.  Haven't seen her since that late summer day.   :(",
                                                    "score": 2,
                                                    "author": "LIRON_Mtn_Ranch"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Am I jealous? You bet your ass that I am!  \n\n\nCongratulations!!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Will anything grow there ? Seems like a harsh environment.",
            "score": 4,
            "author": "HHWKUL",
            "replies": [
                {
                    "level": 1,
                    "comment": "I plan to build a ranch and have a sunken greenhouse to moderate temperature changes and water use, in order to have crops for domestic use and fodder.  Also some chickens and maybe pigs and goats.  Also vermiculture compost bins to completely recapture and amplify the organic matter in my soil.  Neither the climate, terrain, or zoning are fit for row crops, which I knew going in.",
                    "score": 7,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Usually the whole sub is so overjoyed to say congratulations that I make a fun \"your shrub are drab\" sort of joke jab at the land people get. But dear lord you look so genuinely happy it warms all the cackles in my heart and I can't even see anything to make fun of. \n\n\nI hope your homestead is everything you want it to be and more.",
            "score": 3,
            "author": "Tetragonos"
        },
        {
            "level": 0,
            "comment": "Just pay your property taxes or you'll find out the bank never really owned your property either.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hellscape for some is a crowded city, to each their own.",
                    "score": 12,
                    "author": "Desner_"
                },
                {
                    "level": 1,
                    "comment": "&gt; No offense but that looks like a hellscape.\n\nHaha, none taken but that sounds like the minority of bad reviews I've gotten on Hipcamp.  I *saw* the people, they stepped out of their air conditioned car at high altitude wearing flip-flops, swimming trunks, a sheer SPF-0 spaghetti top, and no hat, then get right back in the car and leave.  Then a review comes, complaining, \"Oh, it was hot and there was sun and wind and brush and bugs and dirt and dust and and and...\"   lol plebs. (Except this really DOES hurt you in algorithmic recommendations, search results, and consequently booking numbers!)\n\nThis is in the mountains above the I-5 \"Grapevine\" corridor between Bakersfield and Los Angeles.   It's well-rounded old sand-clay mountains overlooking the San Andreas fault, with oak-chaparral biology.",
                    "score": 34,
                    "author": "LIRON_Mtn_Ranch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This guy reads like Jay Peterman: how I’m better than everyone.",
                            "score": 0,
                            "author": "StuckInsideAComputer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sounds like city slicker talk...",
                    "score": 6,
                    "author": "PeoplesFrontOfJudeaa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations 🎉🎉",
            "score": 2,
            "author": "dominikn23"
        },
        {
            "level": 0,
            "comment": "Congrats!!!",
            "score": 2,
            "author": "dasz88"
        },
        {
            "level": 0,
            "comment": "This is awesome! Congrats! 🍾🎉",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nice\n!",
            "score": 2,
            "author": "Claymart"
        },
        {
            "level": 0,
            "comment": "That's a beautiful spot you've got there.",
            "score": 2,
            "author": "Blear"
        },
        {
            "level": 0,
            "comment": "grats!!!",
            "score": 2,
            "author": "Yanrogue"
        },
        {
            "level": 0,
            "comment": "YAY... this post makes me so happy!",
            "score": 2,
            "author": "Happypsycho8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Samesies ☺️💗🤗",
                    "score": 1,
                    "author": "WhoaHeyAdrian"
                },
                {
                    "level": 1,
                    "comment": ":)",
                    "score": 0,
                    "author": "comfort_bot_1962"
                },
                {
                    "level": 1,
                    "comment": ":D",
                    "score": 0,
                    "author": "comfort_bot_1962"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's an owc loan?",
            "score": 2,
            "author": "SilvrxM0nst3r",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great question, actually.  OWC stands for Owner Will Carry.  Undeveloped and rural properties are often sold this way.  The advantage to the seller is, it gets people paying on unusual properties that won't qualify as-is for a bank loan or necessarily attract conventional speculators/developers.  The advantage to the buyer is, it's a way to BUY LAND with little money down and little to NO QUALIFYING.\n\nYou make a down payment to and sign an agreement with the seller.  Many offer different down payment and years of loan in a matrix of lower interest the bigger your down payment and shorter the duration of loan.  \n\nYou want to have a no penalty early payoff clause.  I'm not sure if it's enforceable to charge interest for a period longer than a loan was carried, but wouldn't want to put it to the test in court.",
                    "score": 5,
                    "author": "LIRON_Mtn_Ranch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the info!  I've never heard of that and now I want to look into that for my state or near by. Congrats on paying off early and happy new year. 1 of my goals was looking into land and this seems like an option",
                            "score": 2,
                            "author": "SilvrxM0nst3r"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the info! How did you find the property if you don’t mind me asking?",
                            "score": 1,
                            "author": "johnnybagels",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My seller listed it on Ebay.  Some good websites when searching for land include landwatch and bid4assets.  Buyer beware, not every parcel is suitable for what you plan, and lots of \"junk\" properties get listed for high prices.  California City comes to mind here.  Due Diligence!  Good luck!",
                                    "score": 2,
                                    "author": "LIRON_Mtn_Ranch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks a lot!",
                                            "score": 1,
                                            "author": "johnnybagels"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have to pay property taxes on the land? Just wondering, if so it's probably not much.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congratulations man! What an amazing accomplishment.",
            "score": 4,
            "author": "alecxheb"
        },
        {
            "level": 0,
            "comment": "i hope you plant some trees!",
            "score": 2,
            "author": "corpjuk",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's been a bit of a learning curve for me, plus there's been a drought the whole time I've owned the place.\n\nMy first year I figured the native Yucca were thriving, I'll plant some similar species from my native and succulent collection near sea level.   The next week, I returned to some of the succulents dead and black from freeze damage, and the others eaten to a nubbin by local wildlife.\n\nSo next I figured, \"Junipers thrive here\" and put one in which became dead and stiff before I returned the next weekend and still stands erect as a monument to my local horticultural incompetence.  Then I figured, \"I'll plant some of them in late fall so the root system is established for the arid heat of summer.\"   I put in a couple, which didn't die RIGHT away, but the next weekend after planting, I pulled up to find a pair of scruffy rabbits standing on their hind legs, eating the last remaining greenery atop a fresh bare trunk.  This one hung on for months as I hauled 5 gallon bottles of water to it, but succumbed for good by August that year.\n\nIt's rained a LOT already this season, so hopefully all my trees will bounce back after looking worse and worse during the drought.  I'll have to start now, preparing bulk plant purchases into bigger pots, to be ready for next fall's planting window.\n\nThe trees on the property are mostly oak with a few elderberry, juniper, and a single unexpected pine way down the canyon.   I like this property because the complex topography makes for many microclimates and diversity of flora.  \n\nMost of the trees are the same ones visible on old aerial photos dating back to the early 50s.  Though some new trees have started since then and grown to maturity today, time has shown a steady net loss of trees over time.  A fire in 2003 damaged a lot of the crowns of the old oaks, but many are regenerating from trunk or root level as they do.   It's a challenge for *nature* to establish new trees here, and so far I haven't been able to outperform her, though I will still try.   The guy who recently bought the lot next to mine has some degree in land conservation (only met once so far) and plans to apply this to his property, so I'll follow what he does in establishing trees with keen interest.",
                    "score": 11,
                    "author": "LIRON_Mtn_Ranch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's situated in the bottom of a box canyon.  Its elevation is almost the same as a municipal water wellhead 2 miles South near the main river drainage, with the well depth over 300 feet.   The water district wants an active building permit from the County in hand and a $50,000 deposit to even tell me exactly how much it will cost to bring a water meter the last half mile to my property line.  Therefore, I've pondered a well, but determined it wasn't in the cards for my property, even if it could be drilled at the lowest point about 600' lower than the level where the roads and eventual water uses are.  The pine did seem to find a local reliable wet stratum in this mountain, but it's one of the few pines to be seen that's not way up the flanks of the much higher mountains well beyond the ridge I'm on.",
                                    "score": 5,
                                    "author": "LIRON_Mtn_Ranch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Relative of mine has a house in the Rockies; when their well failed they got an in-ground tank installed to collect winter rain and snow run off. Later they put a 2nd tank in. The thing about that is, if water doesn’t last the summer you can get the tank filled by bulk water supplier (assuming it’s road accessible). That costs, but not as much as you might think. You’d design your buildings to feed into the tank. And collect water off your walpini roof too. I was surprised at how well it works.\n\nThe thing about trees is nature scatters thousands of seeds to get a few to take hold. In your kind of environment planting a few well-grown trees is a high-stakes bet. Collecting seeds and scattering them, or growing a bunch of small trees yourself and planting them with some protection may be a better bet.",
                                            "score": 3,
                                            "author": "nautilist"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "2 miles is 3.22 km",
                                            "score": 2,
                                            "author": "converter-bot"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Could you point out where the pines are relative to the property map I sent you? Curious how close to the valleys they fall.",
                                            "score": 4,
                                            "author": "OakParkCooperative"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi it’s me your long lost son here to make sure you leave it to me in your will!",
            "score": 1,
            "author": "Lexx4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Given my historic attempts at keeping step-families together that were not reciprocated, that's actually not *quite* as far-fetched as it seems.  ( ͡°╭͜ʖ╮͡° )",
                    "score": 6,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! Adventure on and stay safe. Happy new year",
            "score": 1,
            "author": "wessle3339",
            "replies": [
                {
                    "level": 1,
                    "comment": ":D",
                    "score": 2,
                    "author": "comfort_bot_1962"
                },
                {
                    "level": 1,
                    "comment": ":)",
                    "score": 0,
                    "author": "comfort_bot_1962"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!",
            "score": 1,
            "author": "Badgerdirtoutdoors"
        },
        {
            "level": 0,
            "comment": "Epic work mate I'm really happy for u",
            "score": 1,
            "author": "SRM-87",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope you have a great day!",
                    "score": 2,
                    "author": "comfort_bot_1962"
                },
                {
                    "level": 1,
                    "comment": "Nice!",
                    "score": 2,
                    "author": "comfort_bot_1962"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you got this👍",
            "score": 1,
            "author": "Deafening_Silence999"
        },
        {
            "level": 0,
            "comment": "🎉🎉",
            "score": 1,
            "author": "Zestyclose_Storm2156"
        },
        {
            "level": 0,
            "comment": "awesome! i'm looking for land in similar area. would love to hear your process for finding this parcel! also if you have any ideas about building (i'm really interested in cob construction but I know CA building restrictions are strict)",
            "score": 1,
            "author": "ficusbro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd totally do earthbags or full earthships, but yeah building requirements.  You can't so much as station an RV or shipping container on your own land here without a conditional use permit, and they WILL flex on you sooner or later if you just do it anyway, especially when you try to legally permit as little as a doghouse at some point.\n\nYour county's assessor GIS map has layers you can select for display, to show usage codes and zoning (not quite the same thing, learn about both) visually for the whole area, instead of looking these up lot by lot.  Then look up these usage codes and the relevant zoning code on the county's website.  My property is situated in an \"estate\" zone, which is intended for quiet uses the same as an R-1 residential zone but on properties exceeding 5 or so acres.  The usage code is \"mountain and desert property unlikely to get developed.\"  Because of the E zone, you can legally build your unlikely development here, I already confirmed.",
                    "score": 3,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beautiful!  And, congrats!",
            "score": 1,
            "author": "Joele1"
        },
        {
            "level": 0,
            "comment": "Wow! Congratulations!!",
            "score": 1,
            "author": "Optimal_While_796"
        },
        {
            "level": 0,
            "comment": "Beautiful!",
            "score": 1,
            "author": "Dsaladino"
        },
        {
            "level": 0,
            "comment": "The dream",
            "score": 1,
            "author": "Negative_Mancey"
        },
        {
            "level": 0,
            "comment": "You are a very rich man now!  Honors and respect, my Good Sir!",
            "score": 1,
            "author": "PlagueOfDemons"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 1,
            "author": "RedSquirrelFtw"
        },
        {
            "level": 0,
            "comment": "Congratulations man, that's awesome!",
            "score": 1,
            "author": "killimajig"
        },
        {
            "level": 0,
            "comment": "I’m looking for my own land. What’s the water access here??\n\nCongratulations!",
            "score": 1,
            "author": "stephcurrysmom",
            "replies": [
                {
                    "level": 1,
                    "comment": "I need to connect to the municipal supply, which starts around $50,000 according to the surprisingly difficult communications with the water board.  I knew this going in, and will either bite the bullet or get my own potable water tender trailer and onsite tank going.  I may explore options with the friendly connected neighbor.\n\nCost to supply utilities, including off-grid options, is part of the calculus of whether a given property is a good fit for your needs.  Making sure you have deeded access to the property if it doesn't touch a county road is also a potential pitfall.  Beware of land locked properties!",
                    "score": 3,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So happy for you, congrats dude",
            "score": 1,
            "author": "Joecool77",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're Awesome!",
                    "score": 2,
                    "author": "comfort_bot_1962",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disagree",
                            "score": 1,
                            "author": "OcelotNo3347"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice!",
                    "score": 1,
                    "author": "comfort_bot_1962"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like beautiful country.  Its going to be a good year for you and yours.",
            "score": 1,
            "author": "vihrea"
        },
        {
            "level": 0,
            "comment": "Awesome",
            "score": 1,
            "author": "kunfusedpsyko"
        },
        {
            "level": 0,
            "comment": "Big congratulations! Great way to bring in the 2022 with that fantastic news.",
            "score": 1,
            "author": "IRISHWOLFHD"
        },
        {
            "level": 0,
            "comment": "Congratulations here's to many long a prosperous years to your ranch",
            "score": 1,
            "author": "ShoddyBison"
        },
        {
            "level": 0,
            "comment": "Absolutely fantastic.  You are a lucky man",
            "score": 1,
            "author": "Carly_L"
        },
        {
            "level": 0,
            "comment": "Congratulations!!!",
            "score": 1,
            "author": "Antique-Car6103"
        },
        {
            "level": 0,
            "comment": "Congratulations!",
            "score": 1,
            "author": "Mgiwar"
        },
        {
            "level": 0,
            "comment": "Much better than buying the farm, congrats!",
            "score": 1,
            "author": "groveler"
        },
        {
            "level": 0,
            "comment": "Yaaas!!!! 💗👏👏🙋‍♀️🙋‍♀️\n\nI'm so very happy and excited for you, may you experience even more abundance happiness and inner joy in 2022.",
            "score": 1,
            "author": "WhoaHeyAdrian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope you do well!",
                    "score": 1,
                    "author": "comfort_bot_1962",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't",
                            "score": 1,
                            "author": "OcelotNo3347"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice!",
                    "score": 1,
                    "author": "comfort_bot_1962"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations! You've achieved something most never do. You should be very VERY proud of yourself and your accomplishments.",
            "score": 1,
            "author": "WhiskeyTrail"
        },
        {
            "level": 0,
            "comment": "Congratulations! I've got 1.5 acres but I'd love something like yours.\n\nFolks at r/offgrid and related subs will have a lot of useful info. Start typing r/offgrid and all the other related subs will pop up in a list.",
            "score": 1,
            "author": "ol-gormsby"
        },
        {
            "level": 0,
            "comment": "What a dream. Congratulations!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s amazing! Good luck and happiness building your homestead!",
            "score": 1,
            "author": "Fast_Option_4178"
        },
        {
            "level": 0,
            "comment": "Not jealous at all 👍🏻👍🏻👍🏻👍🏻👍🏻",
            "score": 1,
            "author": "JoineryBaz"
        },
        {
            "level": 0,
            "comment": "You’re living the dream man. If I could choose a plot of land it’d certainly be in California… politics aside that is.  Love it.  It’s always a great feeling owning and not being in debt.",
            "score": 1,
            "author": "itsjeffme"
        },
        {
            "level": 0,
            "comment": "congratulations!!!! \n\nwhat are your plans for 2022? :D So excited for you!",
            "score": 1,
            "author": "Chocobean"
        },
        {
            "level": 0,
            "comment": "Congrats man!",
            "score": 1,
            "author": "DistinctRole1877"
        },
        {
            "level": 0,
            "comment": "Congratulations and all the best moving forward!!",
            "score": 1,
            "author": "Admirable-Mousse3031"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 1,
            "author": "CXB1313"
        },
        {
            "level": 0,
            "comment": "4WD!",
            "score": 1,
            "author": "Xx_endgamer_xX"
        },
        {
            "level": 0,
            "comment": "This makes me very happy to see. Keep up the good work!",
            "score": 1,
            "author": "YoungSanta6",
            "replies": [
                {
                    "level": 1,
                    "comment": ":D",
                    "score": 1,
                    "author": "comfort_bot_1962",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Imagine using text emotes in 2021",
                            "score": 1,
                            "author": "OcelotNo3347"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice!",
            "score": 1,
            "author": "Titboobweiner"
        },
        {
            "level": 0,
            "comment": "Congratulations, might be weird but also proud of you",
            "score": 1,
            "author": "Gman1905"
        },
        {
            "level": 0,
            "comment": "Congratulations on the best way to start not just the new year, but from this point forward in your life. Inspirational!!!",
            "score": 1,
            "author": "Logical-Marketing161"
        },
        {
            "level": 0,
            "comment": "Goals",
            "score": 1,
            "author": "Cinthiaseesall"
        },
        {
            "level": 0,
            "comment": "Congratulations on completing life",
            "score": 1,
            "author": "Hot_Ad_6442"
        },
        {
            "level": 0,
            "comment": "Congratulations!!\n\n\nIt must be niceeeeee\nIm trying to be like you my boy.",
            "score": 1,
            "author": "gentlemenpilot"
        },
        {
            "level": 0,
            "comment": "Congratulations on your new place!",
            "score": 1,
            "author": "EtherealLove"
        },
        {
            "level": 0,
            "comment": "South Central Oregon?\n\nEdit: Ah, Cali.",
            "score": 1,
            "author": "Hedph0nes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Above the I-5 \"Grapevine\" corridor in the mountains between Bakersfield and LA to be exact.",
                    "score": 1,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Niiiiice",
            "score": 1,
            "author": "jwat4455"
        },
        {
            "level": 0,
            "comment": "badass",
            "score": 1,
            "author": "PDXnative503"
        },
        {
            "level": 0,
            "comment": "Fucking awesomeness…. I’m sooo jealous…. 🍻",
            "score": 1,
            "author": "AccomplishedInAge"
        },
        {
            "level": 0,
            "comment": "Congratulations! This is literally the DREAM!  What a blessing 😃",
            "score": 1,
            "author": "mrsbernardez"
        },
        {
            "level": 0,
            "comment": "Good for you! You saved allot of money paying your loan off early.",
            "score": 1,
            "author": "RonV70",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree!  Sometimes carrying debt makes sense, even at this uncompetitive 9%.  If I could have taken that 5 figure payoff sum and invested it in a flip property that returns say 50%, then paying the 9% is an acceptable cost in the big picture.\n\nRight now it's most important and attractive to ME to get out from underneath monthly payments.  With this move selling the house and paying off the ranch property, I've gone from having payment obligations of $3000+/mo to under $1000/YEAR for the property tax!",
                    "score": 1,
                    "author": "LIRON_Mtn_Ranch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! I have a little ranchlet myself on 5 acres. It’s a harsh climate but I love it! Wide open spaces. Enjoy.",
            "score": 1,
            "author": "killibee"
        },
        {
            "level": 0,
            "comment": "Still too much info on the grant deed. Was able to find you and the property in 5 mins. You should delete this.",
            "score": 1,
            "author": "knucks_deep"
        }
    ]
}