{
    "id": "12h0i1x",
    "score": 5,
    "title": "Living between Caltech and Riverside?",
    "author": "ALimitingCase",
    "date": 1681084788.0,
    "url": "https://www.reddit.com/r/Caltech/comments/12h0i1x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all, possible incoming PhD student here with a question about off-campus housing options. My partner is possibly going to be at UC Riverside, so was wondering if anyone knows a feasible place to live between the two schools that is nice enough, relatively affordable, and splits the commute pretty evenly (assuming we both have our own transportation). I know it would be pretty non-ideal especially with traffic but am willing to deal with a bit of a painful commute to live together. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Fontana, Rancho Cucamonga, Ontario, Montclair, those would be some relatively (I don’t even know what is considered affordable nowadays in socal) affordable places that seem to be in between? Maybe even Chino?",
            "score": 4,
            "author": "looseseal-bluth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I'll take a look at those! Affordability is a little flexible since we'd be looking to split a 1br, so I'm sure those places have some decent options",
                    "score": 2,
                    "author": "ALimitingCase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a good point, I hadn't thought of it that way! Maybe even if I don't go for Pasadena we can look at places nearer to Caltech than Riverside to make the most of that traffic difference. Thanks!",
                    "score": 4,
                    "author": "ALimitingCase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "similar to pasadena, and nearby:  Monrovia, Sierra Madre, Altadena, South Pasadena, San Gabriel. These may be cheaper than pasadena, and possibly nicer too. Best of luck.",
                            "score": 2,
                            "author": "UnderTheRain"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Had a friend and his partner do exactly this and they lived in Pomona",
            "score": 2,
            "author": "doll_feet_24"
        }
    ]
}