{
    "id": "12ttbn0",
    "score": 6,
    "title": "Caltech or Michigan (Undergrad)",
    "author": "SobolevRegretting",
    "date": 1682060306.0,
    "url": "https://www.reddit.com/r/Caltech/comments/12ttbn0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sorry for making one of these posts, but I'm really struggling with this decision and I won't be able to visit Caltech until 3 days before the deposit deadline, so I'm trying to gather as much information/input as possible. Also, yes, I realize that Caltech and Michigan are very different.\n\nSome important background: \n\n* I want to do a math/physics major with the goal of getting a PhD and doing research\n* I focused heavily on academics, so I have done math up to graduate PDEs and functional analysis and physics up to Griffiths EM and QM (among others)\n* I live RIGHT next to UMich (and have taken many classes there)\n* I have amazing financial aid from both\n\nIt more or less boils down to:\n\nCaltech: \n\n* small, tight knit community (+ house system)\n* more personalized, 1 on 1 with professors\n* extremely rigorous and STEM research focused\n* socially open and collaborative environment\n* nice weather and close to rocky nature\n\nMichigan\n\n* right at home (I'm very close with my family)\n* more diverse student body (background and interests)\n* very strong math program, analysis and PDEs in particular\n* greater number of clubs and opportunities\n* more active social life\n\n\\*Clarification about social life: I do NOT seek the stereotypical \"college partying and hookup culture\" social life, but I do want to be in an environment where there is a certain amount of extroverts, diverse personalities, and people with a good sense of humor (is Caltech like this?).\n\nAll this together, what are your thoughts? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "if this is true: \" I do NOT seek the stereotypical \"college partying and hookup culture\"\" then you will like caltech. if you've really already done those grad courses, caltech is great. you will fit in. people are very fun at caltech with a lot of extroverts in certain houses. caltech is very special. i recommend it to anyone that can handle the workload.\n\ncaltech kinda sucks if ur in the bottom 50% of students though, which is literally half of the people",
            "score": 32,
            "author": "faithforever5",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;if ur in the bottom 50% of students though, which is literally half of the people\n\nr/hedidthemath",
                    "score": 17,
                    "author": "FitzwilliamTDarcy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/r/theydidthemonstermath",
                            "score": 4,
                            "author": "MikeyNg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True. It *is* Caltech after all.",
                                    "score": 3,
                                    "author": "FitzwilliamTDarcy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I graduated in the bottom 25% or so and was just fine.",
                    "score": 8,
                    "author": "McN697",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "huhhh how.. didn't u feel like u didnt learn that much",
                            "score": 0,
                            "author": "faithforever5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "how can you be sure that half of the people are bottom 50%",
                    "score": 5,
                    "author": "jo5i4h",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm having a good laugh at this",
                            "score": 3,
                            "author": "omegabluess"
                        },
                        {
                            "level": 2,
                            "comment": "You’re one to talk lmfao",
                            "score": 1,
                            "author": "AncientWeek613"
                        },
                        {
                            "level": 2,
                            "comment": "I remember Rod Kiewiet giving a speech on the lawn in front of the Ath right before we got the bus for the boat to Frosh Camp and he did tell us that half of us would be in the bottom half of our class.",
                            "score": 1,
                            "author": "Powerful-Inside2892"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you'll get a lot more value out of Caltech... 1) Stronger math and physics peer group, 2) More access to research opportunities, 3) Fancier name which will make PhD admissions down the line much easier and 4) yeah you can get that social life in certain houses. \n\nAlso for analysis and PDEs, if you want to go beyond the couple classes the math department offers, you can also check out the ACM catalog \n\nI'd honestly only recommend Michigan if you really want to be near home, really want lots of non-nerds in your life, or are really scared of the intensity of Core / junior year physics.... but it sounds like you aren't.... so come to Caltech please",
            "score": 15,
            "author": "literally_mental"
        },
        {
            "level": 0,
            "comment": "\"I do want to be in an environment where there is **a certain amount** of extroverts, diverse personalities, and people with a good sense of humor (is Caltech like this?).\"\n\nI think herein lies the rub. Caltech is small. Super small. I'm sure you know the numbers. Will you find \"your people\" (these people) at Caltech? Absolutely! Will there be hundreds of them? Ehhhhhh probably not. Whereas there may be thousands of them at Michigan. \n\nAlso, Caltech is smack dab in the middle of a (beautiful, expensive) suburban neighborhood (though you can easily walk a few blocks to the businesses on Lake). It will feel very different from Ann Arbor IMO. \n\nAll that said, my $.02: go to Caltech.",
            "score": 6,
            "author": "FitzwilliamTDarcy"
        },
        {
            "level": 0,
            "comment": "I think you’ll enjoy Caltech. I had the most amazing social life there. If you find the right group of people, it’ll be paradise. If not it will kinda suck haha",
            "score": 5,
            "author": "pialin2"
        },
        {
            "level": 0,
            "comment": "Come to Caltech! Great research opportunities, and sounds like it has the social scene you're looking for.",
            "score": 3,
            "author": "caltechcyborg"
        },
        {
            "level": 0,
            "comment": "If research is what you want to do, particularly in math and physics, there are few places that offer more opportunities than Caltech.\n\nThere is the Summer Undergraduate Research Fellowship program, which is a summer research program and the most obvious example of this. But beyond that, Caltech is a research institution first and foremost. The faculty and staff are there to conduct it, and if you have an interest and want to help, you can find someone who is in need of another person.\n\nThe opportunities can come via the weekly physics symposium lectures (which at a bare minimum, offer free cookies and tea/juice, but can also feature talks given by big names in the field), talking to professors during their office hours if their research areas interest you, etc.\n\nGiven what you've said about your advanced academics, I think Caltech could offer you more in that regard as well. Also, its small size means you can dabble in other academic interests, and cross-discipline collaboration is a big part of Caltech.",
            "score": 3,
            "author": "pierquantum"
        },
        {
            "level": 0,
            "comment": "I go to u-m (go blue!) but I think you’ll be happier and more intellectually stimulated at caltech. Being a small fish in a big pond can feel overwhelming and making friends is hard but clubs certainly help. It’s much easier to make friends when you see the same people around constantly and are almost forced to collaborate on ur sets. The weather is much better too!",
            "score": 2,
            "author": "plsjuststop007"
        },
        {
            "level": 0,
            "comment": "It’s hard to really understand how small caltech is. I think go for umich assuming you have visited and liked what you see.",
            "score": 1,
            "author": "Historical-Ad2656"
        },
        {
            "level": 0,
            "comment": "College is a really good time to expand your boundaries and live somewhere new, and the smaller and more intimate Caltech environment will be a good way for you to do this without being totally overwhelmed. Go grow!",
            "score": 1,
            "author": "tangerinix"
        },
        {
            "level": 0,
            "comment": "mich was my top choice tbh, didnt get in and went to caltech instead. I think it would've been a much more freeing/social/diverse/growth-esc experience. If you can afford it, rather just go to mich in my opinion. Its a great school that carries a ton of weight esp in aerospace/stem/engineering and will probably be a better decision. Also, being close to home has tons of perks.",
            "score": 1,
            "author": "AgitatedSignature666"
        },
        {
            "level": 0,
            "comment": "Given what you've said, at Michigan, you'll probably graduate early.  At Caltech, they won't let you do that unless you're coming in as a transfer student.  They'll let you skip classes, but they won't let you have units for them, so you'll need to replace them with more advanced classes or with electives.  That can be good or bad.  I'd actually say it's good apart from the financial aspects.  You'll have an extra year to explore a bit more., whether going deeper in math and physics, or taking some art or music or history or whatever classes that you might not fit in if you were graduating 2 1/2 years from now.\n\nA second point: I think you might actually find that a student of your caliber would get more personal attention from professors at a school like Michigan than a school like Caltech.  One reasons is that Caltech advertises its faculty-student ration, but that's faculty per undergraduate, and it doesn't take into account that it has a very high fraction of students majoring in math and especially physics.  I currently work at a university with a faculty-student ratio about a factor of 6 worse than Caltech's but our physics majors get a lot more personal attention and our classes for physics majors are much smaller.  What we don't have is the breadth of electives or the same amount of research resources, but neither of those is really that important for an undergraduate.\n\nMichigan has a lot of good students, but if you took junior level physics classes as a high school student, you're clearly exceptional for Michigan.  At Caltech, most of the students wouldn't have had the opportunity to do that, but probably lots could have if they had had encouragement to do so and lived in a university town.  And lots of the professors have enormous research groups, to the extent that if you do research with them, really their postdoc or grad student will likely be your every day contact.  The Caltech faculty may, on the whole, be more distinguished than the Michigan faculty, but the Michigan faculty will, on the whole, be more distinguished and more experienced in mentoring undergrads on research than the Caltech grad students and postdocs.  There will be some huge groups like that at Michigan, too, but a smaller fraction.  To test if I'm right, send a bunch of emails around and see how many professors you can get at each place to do a zoom call with you. \n\nThe social environment is really unique at Caltech, and for a student like you, even if you're very kind and charismatic, you may find it hard to find people you fit in with at a place like Michigan.  At Caltech, it's easy for anyone who's a decent person, even if they are quite eccentric, and it's not a problem at all if you're ahead of everyone else academically, as long as you're not a jerk about it.",
            "score": 1,
            "author": "Powerful-Inside2892"
        }
    ]
}