{
    "id": "1jrrds",
    "score": 16,
    "title": "reddit cofounder here - I'd love to visit Caltech during my booktour (I wrote about starting reddit + many tales of internet entrepreneurship)",
    "author": "kn0thing",
    "date": 1375741515.0,
    "url": "https://www.reddit.com/r/Caltech/comments/1jrrds",
    "media_urls": [],
    "other_urls": [],
    "postText": "I reckon this would be a lot of fun and although the subreddit isn't the most active, I'm hoping enough of you are reading this to be able to help :) please intro folks to me and my team via epicbooktour@alexisohanian.com",
    "comments": [
        {
            "level": 0,
            "comment": "I just passed this post on to the undergraduate social chair person. Hopefully she'll contact you! ",
            "score": 3,
            "author": "transatlanticism08"
        },
        {
            "level": 0,
            "comment": "Hi, looks like you got spam queued. Unfortunately, I don't check the modqueue very often. Hopefully it's not too late!",
            "score": 1,
            "author": "Ilyanep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Curses! We hadn't heard anyone so I assumed.... ok, lemme try posting again tomorrow. Thanks!",
                    "score": 1,
                    "author": "kn0thing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure thing. Another thing to note is that campus is a lot less lively during the first three weeks-ish of September, so I hope you're planning your book tour either before or after that. \n\nWish I could make it, but I just moved up to the Bay Area. Good luck in getting it all put together!",
                            "score": 1,
                            "author": "Ilyanep"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, I'm not 100% sure how one would go about doing this, but I'm sure there's some sort of avenue for contacting the administration and discussing the possibility.\n\nEspecially since I'm fairly sure that people would show up; I feel like half of the campus is addicted to Reddit anyway...",
            "score": 1,
            "author": "DoubleAW"
        },
        {
            "level": 0,
            "comment": "Cool! I can drop a line to the Caltech Entrepreneurship Club. I'm not a student anymore (graduated a long time ago), but I work on-campus.\n\n*Edit*: Oops, I just realized that this post is 21 days old, and the last post was 6 days ago. Do you still need contacts, or is everything settled already or too late?",
            "score": 1,
            "author": "Valedictorian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I'd still love some help. Please intro me via epicbooktour@alexisohanian.com",
                    "score": 1,
                    "author": "kn0thing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just sent a line to the e-club. ",
                            "score": 1,
                            "author": "Valedictorian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awesome! thank you!",
                                    "score": 1,
                                    "author": "kn0thing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just got an annoucement from the eClub about the fireside chat next Thursday. :)",
                                            "score": 1,
                                            "author": "Valedictorian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Success! Love seeing students get fired up about this tour. Thank them for me.",
                                                    "score": 1,
                                                    "author": "kn0thing"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yo.  I was just asked to co-host with you.  Looking forward to meeting you @kn0thing , if it works out.\n\nI see a lot of connections between my startup (LaborVoices, crowdsourcing info on working conditions from supply chain factory workers) and your book's message!",
            "score": 1,
            "author": "KohlGill"
        }
    ]
}