{
    "id": "5qs0w8",
    "score": 0,
    "title": "What are good extracurricular activities that can increase my chance of getting into Caltech?",
    "author": "NamhoonKim",
    "date": 1485664175.0,
    "url": "https://www.reddit.com/r/Caltech/comments/5qs0w8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to get into Caltech but I don't have any extracurricular activities related to science and math. I am living in Thailand so I have no chance to join science and math competitions because Thailand doesn't really have that sort of things. What are some good extracurricular activities that is related to science other than science and math competitions? ",
    "comments": [
        {
            "level": 0,
            "comment": "I had a similar predicament when I was younger. My solution was to teach myself bionformatics and begin analysing genetic sequences. All you need is a computer. I don't know if https://www.ncbi.nlm.nih.gov is accessible in Thailand but starting there could work for you. Find sequences for species that nobody has annotated and begin making sense of it. Read research papers to learn what to do. Contact your local university when you have made progress and try to publish afterwards.",
            "score": 3,
            "author": "zhandragon",
            "replies": [
                {
                    "level": 1,
                    "comment": "When did you start teaching yourself? How long did it take for you to learn?  Did you learn from books? Did you publish a paper?",
                    "score": 1,
                    "author": "NamhoonKim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Robotics is a pretty big one. It seems like many of the undergrads have done robotics",
            "score": 2,
            "author": "dedicateddan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you mean robotics competition? ",
                    "score": 3,
                    "author": "NamhoonKim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, organized robotics ",
                            "score": 1,
                            "author": "dedicateddan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are some universities around the place I live. I did not find any labs open for high school students. Students here in Thailand are only focused on studies. They do not  activities because it is not acvounted for when applying for universities",
                    "score": 1,
                    "author": "NamhoonKim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did not contact the professors yet. I think I should contact them to find more info about it. Thanks for advice.",
                                    "score": 1,
                                    "author": "NamhoonKim"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just doing research would be great, breaking the mold and being the first high school student to do university-level research would be the clincher. Push yourself, put in the effort to excel in ways that others don't/can't, and it will send a strong message about your preparedness for the rigors of Caltech.",
                            "score": 2,
                            "author": "msittig"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are formal high school programs at a lot of universities. But volunteer work in a lab? Almost impossible because of liability issues allowing independent under 18-year-olds in the lab.",
                    "score": 1,
                    "author": "DavidDPerlmutter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, by all means ask. But I was just setting up the fact that blanket policy seem to be pretty prevalent.\n\nAnd it occurred to me that the professor who might want to encourage an eager high school student might suggest some programs that you do not know about",
                                    "score": 1,
                                    "author": "DavidDPerlmutter"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}