{
    "id": "7asxmn",
    "score": 1,
    "title": "Is this true?",
    "author": "[deleted]",
    "date": 1509825814.0,
    "url": "https://www.reddit.com/r/Caltech/comments/7asxmn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is it true that unless you get a near perfect score on your SAT/ACT, near perfect score on your SAT subject tests, and all As you won't get in? Is there a chance I could get in if I got a 3 on one math AP exam? Do they care a lot about AP exams",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "do you think they have a possibility of accepting me even if i messed up on one math ap exam?",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People with perfect scores don't get in either. It's about your holistic application. A 3 won't torpedo your application, it's what else you've included. ",
                            "score": 8,
                            "author": "turtles_are_weird"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Caltech doesn't even consider AP scores for credit.  \n\nAs others have said, you don't need super high grades/scores - but you should also consider that you're going to a ridiculously difficult academic university.  Your class valedictorian is probably going to have a rough time at Caltech academically.  (It happens, but very very few people cruise through Tech)  Valedictorians are literally a dime a dozen at Tech.\n\nTo be blunt: if you can't get good grades at your high school and on standardized tests - why would you want to subject yourself to the academic rigor?\n\nLook at the class profile for this year's frosh class and see if you'd \"fit in\": http://www.admissions.caltech.edu/content/class-profile\n",
            "score": 8,
            "author": "MikeyNg"
        },
        {
            "level": 0,
            "comment": "You should have good scores and GPA. They definitely don't have to be perfect by any stretch, but they should be top-tier without question and show that you challenged yourself. Some additional holistic merit as a good potential student/scientist/engineer is important too.",
            "score": 5,
            "author": "PerAsperaDaAstra"
        }
    ]
}