{
    "id": "7bz0i4",
    "score": 5,
    "title": "Requesting feedback from current caltech students.",
    "author": "[deleted]",
    "date": 1510289897.0,
    "url": "https://www.reddit.com/r/Caltech/comments/7bz0i4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Parent here. My freshman student says that there is too much work and is difficult, Not able to find enough time to rest or sleep.  My student is used to difficult and had experience with rigorous and demanding work before and did very well before. Trying to make sense. Does it get better?  Any advice?",
    "comments": [
        {
            "level": 0,
            "comment": "Not a current student, though.\n\nIn all honesty, the workload gets tougher. Your child might adapt; they might not.  \n\nEveryone has their \"boggle point,\" where things just don't come easy anymore.  \n\nKeep talking to your child and be supportive. It's a tough environment, but they should try to stick it out.  Caltech is pass/fail for the first two terms. They should use that time to get used to it.\n\nThere have been a lot of changes in their life recently, and that takes some getting used to. They've moved out and are on their own. There's no parental supervision. They're thrust in this ridiculously rigorous academic environment, and they're not significantly smarter than their peers. \n\nConsider now that for half of these new freshman, they're below average. These people have never been below average in their entire lives. That takes some getting used to.\n\nKeep communicating and be supportive and listen to your child.  It does get tougher, but most people build resiliency once they hit the comfort zone.  They've been in school what one month now????\n\nThere are counseling services available also. Take advantage of them.",
            "score": 13,
            "author": "MikeyNg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for taking time to respond. I fervently hope that things settle down and in the end it is all worth it. I am starting to have doubts and questioning my judgment to encourage caltech over other options.  I still believe Caltech is fantastic place for the right kind of student. Thanks again",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also not a current student, but...\n\nOne (of many) ways that students make things harder for themselves is by continuing a high school mentality of \"more is better\".  More classes.  Harder classes.  Must.  Learn.  Everything!  A student that went through high school crushing every class and pushing the limits of the curriculum might be used to taking on everything that the system can conceivably throw at them.  That's a bad strategy at Caltech.\n\nDo you know if your student is \"overloading\"?  That's a technical term meaning taking more than 48 units in a given term.  On average, 41 units per term is sufficient to graduate, though some terms will need to have more to fulfill certain requirements.\n\nWhat is your student's expected major (or \"option\" in Caltech lingo), if he/she knows yet?  For many options, there is decent flexibility in how much you try to take on.\n\nRegarding another Caltech feature: Do you know whether your student is working in collaborative groups on homework sets?  This is the norm.  Assigned work is designed with the expectation that students will learn from each other while working through the same challenging material.  A student that holes up in a dorm room and tries to crank through all the material by himself/herself will have a difficult time unless they are an exceptional case.\n\nAre there some classes that your student finds more overwhelming than others?  Students that have poor background in a couple of subjects may struggle with those, and then as either (1) they catch up or (2) they stop taking courses in that subject, things level off.\n\nFinally: Is it the sheer amount of work, or the difficulty of the material?  If it's the former, I'd point to what I've said above.  If it's that latter, I'd ask whether your student is doing the following things: (1) working on homework in a responsible group (e.g., a group that doesn't wait until the very last minute to start a problem set, thereby staying up all night to finish), (2) taking advantage of TA office hours, (3) taking advantage of tutoring through the dean's office (either the group sessions that are organized each week, or private sessions), (4) actually going to class.\n\nAny additional information you have might help folks provide more targeted advice and prognoses.\n",
            "score": 7,
            "author": "mynamesnotbill"
        },
        {
            "level": 0,
            "comment": "Recent student here. \n\nTech is a difficult place. It's really hard, and the constant work and little sleep makes it even harder. That doesn't mean it's impossible to get through four years here (people graduate every year, after all). In my experiences, I had to lower my standard for good grades (going from straight As in HS to, well, not many As) and accept that at Caltech, sometimes my best just wasn't good enough. There won't be enough time to finish everything to the precision you want it, and sometimes i needed to call it quits on a set for my own mental health. Doing this helped me get through each year. \n\nMy friends in my house were a great support network, providing people to work on sets with and people to comfort me when it was all just too much. There also exist \"official\" resources (counseling center, deans, UCCs, RAs, TAs) that will usually provide help when asked. It can be hard to ask them, sometimes, and I've had experiences where their help wasn't that great. Don't give your kid a hard time if they don't use these resources. \n\nI can't guarantee it will get better. Things got worse for me my smore year, slightly better junior year, and then were definitely better my by senior year. It varies for each person. I certainly can't guarantee it won't get better, so keep that in mind. Chances are things will improve. \n\nOverall, my advice for students is to double check your expectations and standards, and to think about what you want to achieve and what you're willing to give up to do it. But no matter what, it's gonna be really hard. That's just how Caltech works. \n\n\n",
            "score": 4,
            "author": "ToTheStarsAndOn"
        },
        {
            "level": 0,
            "comment": "Current grad student here. This isn't an uncommon story: I hear a lot of upperclassmen undergrads saying they had a similar experience during their freshman year, but stuck through it and figured out how to be a real person (reasonably well-slept, and social) despite the insane workload (which never goes away). \nTwo things I'd suggest to them: \n1. Go to their TA's office hours regularly, even if they just use the OH as a study hall. As a current TA, I do not mind *at all* when people come in and just sit there doing their homework in case they have questions. This may not be something they ever had to do before, but (to reiterate a point /u/MikeyNg made) many of them are also not used to being average, and are not used to utilizing the resources (like office hours) that schools provide for struggling students. \n2. Go to the counseling center. Being average feels bad, when you're used to being the best. Also, just because Caltech produces great students, doesn't mean that their students have healthy habits! Going to the counseling center doesn't mean they're weak or worse than other students, it actually means they're more in touch with their own health. And when you're struggling between spending time on your work vs spending time on your health (e.g. sleeping), it really helps to have somebody helping you to find that balance. ",
            "score": 3,
            "author": "Nat-The-Cat"
        }
    ]
}