{
    "id": "arb1ul",
    "score": 4,
    "title": "What are the XC/Track requirements?",
    "author": "Giratinalawyer",
    "date": 1550339032.0,
    "url": "https://www.reddit.com/r/Caltech/comments/arb1ul",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a high school sophomore, and when I was looking at some XC/Track page for MIT, I saw that mile time had to be under 4:37, which I’m not totally sure I can get by the end of senior year. However, I’m very committed to running, and I don’t know what I’d do otherwise. Is there a club at Caltech that a lot of slower people are in or something? Or is it small enough that anyone who wants to be is on the team?",
    "comments": [
        {
            "level": 0,
            "comment": "This might have changed since I attended, but the requirements were:\n\n1. Be willing to run.\n2. Show up. ",
            "score": 19,
            "author": "turtles_are_weird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome, thank you! Right now, Caltech is my number 1, followed by MIT a bit back. I love the ideas of a school with the same number of students as my high school, the honor system, being able to run with a group that cares but isn’t necessarily as whack as the MIT runners, and since I don’t actually know anybody from Caltech. Also, I’ve never been very far west, and MIT is pretty close to me, which I’m not a huge fan of, although carrying my luggage across the entire country also seems like a lot.",
                    "score": 7,
                    "author": "Giratinalawyer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Go to the closer school. You'll appreciate family being able to have your back. ",
                            "score": 1,
                            "author": "hecc987654321"
                        }
                    ]
                }
            ]
        }
    ]
}