{
    "id": "cfgc1d",
    "score": 3,
    "title": "Warhammer Club?",
    "author": "AdjustedMold97",
    "date": 1563587596.0,
    "url": "https://www.reddit.com/r/Caltech/comments/cfgc1d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys. I’m a rising senior in high school and definitely looking at Caltech as an option for college. I visited today and when the guide started talking about clubs, I got to wondering if there was a Warhammer club. I figured the Reddit users of Caltech would be the most knowledgeable people on this topic, so is there a Warhammer club?\n\nBonus question: what other nerdy clubs do you know of? What’s your favorite?",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t know the answer to your specific question, but be warned that clubs are wayyyyy less popular at Caltech than at your high school and at other colleges, and probably less popular than the guide led you to believe. Most people don’t have the time/energy to commit to clubs, and the school’s too small for really niche clubs.",
            "score": 14,
            "author": "hypercube42342",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree that clubs are less popular here then at other places but I dont agree that most people don't do clubs.  Most people I know are in approximately one club.  Not everyone, but a significant amount.  Time commitments also vary greatly by club.  Some are really just for fun and on your own time, but some (like acapella groups and robotics team) require a lot more teamwork and actual time commitment.  Its also very possible to start new clubs - one of my friends started the Pokemon club a few years back amd it quickly grew to be one of the biggest clubs on campus.  Finally, it's not difficult to find like minded people through house email lists and get a group together, even if its not a formal club",
                    "score": 2,
                    "author": "galacticopera"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the reply, I’ll definitely keep that in mind",
                    "score": 1,
                    "author": "AdjustedMold97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the clubs are listed [here](https://apply.clubs.caltech.edu/clubs).  It doesn’t seem like they had one last year, but maybe you can start one when you get here!  Best of luck on your application!",
            "score": 4,
            "author": "baseballboyg"
        },
        {
            "level": 0,
            "comment": "There wasn't one as of a few years ago. Starting a club is easy enough. There's a form you have to fill out. However WH is a lot of time commitment. The real problem is that most people can't handle more than one club or two. Don't worry about it too hard. Find a couple of people you enjoy playing with. If y'all can keep like 5 plus people playing together for a few months make it into a club.",
            "score": 2,
            "author": "xThoth19x"
        },
        {
            "level": 0,
            "comment": "I have been at Caltech for 2 years and don't believe this club exists.  But I definitely think joining at least one club will help you meet new people. Good luck.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Caltech*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Caltech) if you have any questions or concerns.*",
                    "score": 4,
                    "author": "AutoModerator"
                }
            ]
        }
    ]
}