{
    "id": "dyo2he",
    "score": 2,
    "title": "My summer term and the SURF period don't overlap properly",
    "author": "[deleted]",
    "date": 1574186682.0,
    "url": "https://www.reddit.com/r/Caltech/comments/dyo2he",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm an undergrad in India, and our summer term is from May to July. I've talked to a prof already and she's agreed to take me but the problem is that the SURF results will be announced on the 1st of April. Getting the Visa ready will take a month is what I hear (best case scenario, 1 and a half months more realistically) and cause of this I won't be able to complete 10 weeks unless I miss a couple weeks of classes in the fall term.\n\nIs there any way to get to know the results early (and the I-20 form for the Visa)? Is the SURF office flexible that way? Please tell me what options I have, cause I don't know much about Visa applications either.\n\nThanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "I’d recommend just calling the SURF office and asking",
            "score": 5,
            "author": "hypercube42342"
        },
        {
            "level": 0,
            "comment": "There are plenty of students every year from India. Last year, we actually started SURF a few weeks early. I'm sure the visa shouldn't be a problem.",
            "score": 2,
            "author": "wellfriedbeans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for that",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, when did you exactly mail the professor? I'm also an undergraduate from India planning to apply for Caltech SURF. What's your major?",
            "score": 1,
            "author": "tanmaykonnur",
            "replies": [
                {
                    "level": 1,
                    "comment": "Physics, around July.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She just asked me about my interests and my previous projects but I don't think it was really an interview. She took me in because a prof I worked with before knew her and recommended me. So I can't really tell you how these interviews go, if lots of people are applying to the same project.\n\nGood luck though!",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}