{
    "id": "frju2k",
    "score": 8,
    "title": "How important are research attachments/internships at science institutions in high school for admissions into caltech?",
    "author": "Aryanlaw9",
    "date": 1585540767.0,
    "url": "https://www.reddit.com/r/Caltech/comments/frju2k",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am wondering how important these are. I had applied for a few and gotten one but due to the COVID-19 situation, all of them this year have been canceled and next year have been put on hold. The only ones left are the ones for undergraduates. I feel really left out and don’t know how much this will impact my application.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm not a Caltech student, as you could probably tell by checking my post history, but do you need lab space and equipment to conduct your research? A lot of theoretical work, or CS and Bioinformatics research can be done remotely. Also, if they are cancelled for you, they are also cancelled for everyone else. Finally, College Admissions are honestly a wash anyways. Nobody really knows what gets you into x university. Just keep studying and being curious. A deep passion for science will get you much further in research than any award or short term success will. \n\nSo I will ask you, why are you passionate about science? What can you do to further this passion? What can you do to help frontline healthcare and supply chain workers during the current COVID-19 crisis? Can you leverage AI to predict viral mutations or find new therapies? etc. I think these are all more important questions than \"will I get into x university if I do y?\"\n\n\"Don't live life for the prizes. Live life for the surprises\" -The PhD Movie 2",
            "score": 14,
            "author": "triaura",
            "replies": [
                {
                    "level": 1,
                    "comment": "You might not be a Caltech student but your answer is on point.",
                    "score": 7,
                    "author": "inventor1489"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that you sought out those opportunities and got accepted to one matters, even if it was cancelled due to circumstances out of your control. It's still worth mentioning that you tried, since these activities demonstrate a deep passion for STEM.",
            "score": 13,
            "author": "harel55",
            "replies": [
                {
                    "level": 1,
                    "comment": "In that scenario, is it ok to mention in any application that I tried as there’s no official statement of my acceptance. If they question it’s validity I don’t have anything other than a message to prove it.",
                    "score": 4,
                    "author": "Aryanlaw9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Firstly, the message would probably be sufficient if you were asked for proof, assuming it came from an official at the institution and explicitly mentioned your acceptance (you could also just ask for a verification to be sent). Secondly and more importantly, I don't doubt that the admissions office will take you at your word, knowing that people's internships and summer plans have been getting cancelled left and right.",
                            "score": 5,
                            "author": "harel55"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was admitted to Caltech RD this year, and I didn't have any research under my belt before applying (and still don't). I had other extracurriculars and decent stats though, but I'm still honestly not sure how I got in (since I hear all about these other admits who've been doing research since freshman year and have accomplished so many amazing things).",
            "score": 4,
            "author": "sarbar02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here, I got in EA without any research experience at all. I come from a fairly wealthy neighborhood and probably had the opportunity to take part in research if I tried, but it wasn’t a common thing in my school and I didn’t realize it was a “thing” until junior year. Instead, I showed that I was passionate about STEM by taking classes and participating in clubs. Basically, I spent my time learning more math and science, and that showed to admissions that I was super passionate about STEM. \n\nMoral of the story: it’s amazing that you’ve had these opportunities, and it really sucks that COVID is interfering, but don’t get too bogged down in this problem. Research isn’t a prerequisite by any means, and fill the time you were supposed to use for research with other things you enjoy.",
                    "score": 4,
                    "author": "rodent_racing"
                },
                {
                    "level": 1,
                    "comment": "If you don't mind me asking, could I know what your extracurriculars were? I am an international student so I don't know how much more or less difficult it would be for me to apply.\n\nI am currently in 4 CCAs (Executive Committee elections have been suspended due to the virus but I have applied for 3 and am pretty much guaranteed a spot in 2) and have applied for student council. I don't really know how much these things are valued in California and the US as a whole as I used to live in NJ when I was really young (early elementary) but don't remember much.\n\nI mean I've tried my best for all these research attachments before but Singapore (where I live), stuff like physics and stuff that doesn't make money very easily and quickly isn't really supported so I feel like I'm pretty disadvantaged to the point that even though our education ministry has a bunch of research attachments, my school doesn't even know about them and at this time it's pretty much impossible to source my own. I have considered writing my own short papers and submitting them to the Journal of Emerging Investigators but am unsure about the time constraints and quality that I would be able to submit consequently. I am also going to have to request for a 2-year deferment due to mandatory military service in my country and am unsure of how this will affect my application.",
                    "score": 1,
                    "author": "Aryanlaw9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm an international student and came in having absolutely no research experience. A lot of Caltech students experience research for the first time the summer after their freshman year in a SURF. There are definitely people who seem to have been doing research since forever, but as long as the rest of your application is good you shouldn't have a problem! With the military service bit - you won't have to defer until after you get accepted so that won't matter at all. Good luck with your app!",
                            "score": 3,
                            "author": "PoppySeedPan"
                        },
                        {
                            "level": 2,
                            "comment": "Got it! I don't know much about international students, but shoot me a DM and I'll share my stats and all",
                            "score": 2,
                            "author": "sarbar02"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’m a prefrosh at caltech, and i did zero internships or research but, i did do a few summer programs in stem. it probably shouldn’t make a difference everyone is affected by covid. admissions will see your application in context",
            "score": 2,
            "author": "sasenz"
        }
    ]
}