{
    "id": "ibt7rg",
    "score": 8,
    "title": "What should I do to increase my chances of getting in as someone who loves engineering",
    "author": "the_outspoken_mz_laf",
    "date": 1597720496.0,
    "url": "https://www.reddit.com/r/Caltech/comments/ibt7rg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a rising junior in a very competitive high school (in the US) and Caltech is my top choice for college. I hope to major in aerospace or electrical engineering and/or physics. So far I've taken both AP CSP (A-) and CSA (B+), AP Bio (3 on the exam &amp; B), AP Chem (B) as well as AP Seminar (3 on the exam &amp; A+). I plan on taking AP Calc AB, AP Physics C: Mechanics, AP Research, and some engineering electives in my junior year. I'm won medals in Science Olympiad (although I knew almost everyone else also does), DECA (have medalled at the district level), Ethics Bowl, and VEX robotics (I've won at the state level). I know some of my xc's don't have to do with engineering but they are simply things that I enjoy. I am also planning on taking a few physics/astronomy courses on edX this year bc I genuinely love the stuff. As it stands, I know Caltech can only be my reach school due to its selectivity and the fact that I'm not at the top of my class, but I want to do something that can supplement my application that shows I have interest besides me just taking classes in school. I've been studying a lot of astronomy on my own, and the focus of my research project for AP Research will have to do with aerospace as well. Could anyone give me any ideas on boosting my app or should I forgo the idea that I could get into Caltech in the first place? It would be a huge help :)",
    "comments": [
        {
            "level": 0,
            "comment": "Tangent, but I was similar to you 6 years ago. Look into what you want to learn from college. If you’re looking for hands on Aero work, don’t worry about getting into Caltech and go somewhere else (MIT, GT, Perdue, Stanford(ish), Auburn, Penn State, Ohio State). Yes, those schools are “lesser” than Caltech, but their AE program for UNDERGRADS is better. At Caltech, you have the AE minor for MechE students, and a lack luster rocket team. The great rankings of AE you see on the ranking lists are just based on mostly the Grad program. However, if you’re looking for just theory, you’re on the right track. Feel free to DM me for more thoughts.",
            "score": 9,
            "author": "timebendingnut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh okay, thanks for the advice!! I do have some follow up questions though so I'll DM you.",
                    "score": 2,
                    "author": "the_outspoken_mz_laf"
                }
            ]
        }
    ]
}