{
    "id": "jxot82",
    "score": 7,
    "title": "Am I am fit for Caltech...? Masters -&gt; PhD help#chemistry",
    "author": "mrdoobiewho",
    "date": 1605878108.0,
    "url": "https://www.reddit.com/r/Caltech/comments/jxot82",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm wrapping up the end of my masters program and its almost time do decide the next step.  I love science and doing it keeps me alive, the rigor and stress exictes me far beyond that its incomprehensible.  \n\nI study chemistry and I will be getting my masters soon but what now?  I enjoy novel discovery and research and have been looking at institutions forever and this school I've always had great interests in.  The thing is.... am I fit for it?  I've never been the smartest one, but I work harder than an average person to get where I want (sadly, sometimes I think people work less as hard and excel just like that).  Its weird to say that this is probably the smartest I've been in my life, yet the potential is not where I wish it would be. \n\nCutting the nonsense, does anyone on this sub know what the transition to an MS-&gt;PhD is like?  What is the application process like and if anyone has personal experience with admitting to caltech, what do they look into the most?  Research experience? Publications?  Grades?  Of course it's all accounted for, I'd just like to know other personal experiences from those that attend/have attended cal tech.",
    "comments": [
        {
            "level": 0,
            "comment": "- \"I love science and doimg it keeps me alive\" Same story with every undergrad and PhD student here \n- \"I study chemistry and will be getting my master's soon\" Great!\n- \"I enjoy novel discovery and research\" Great! \n- \"am I fit for it?\" because of the previous two points, yes you are.\n- \"I've never been the smartest one\" You are what you are, what matters is whether you can excel at research\n\nThe first two paragraphs are not really necessary because everyone here has a love for their field and (usually) imposter syndrome. I guess it doesn't matter on reddit but for your SOP and when emailing potential advisors, definitely skip that stuff.\n\nAs for your third paragraph, I imagine the difference between PhD after BS and MS is not huge (other than that the MS is an extra qualification). Generic information can be found on the Caltech website. Usually the order of importance is\n\nLORs ~ papers &gt; research &gt; coursework &gt; other stuff \n\nwith sometimes different weighings. So get good letters of rec and research experience. \n\nIt would perhaps be a better idea to ask more targeted questions (such as \"I want to work with Professor Nate Lewis, does anyone know what his lab is like?\").",
            "score": 7,
            "author": "A_FUCKING_RETARD",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for your detailed and upfront answer.  of course I wouldn't put all that sappy shit in my SOP haha (it was 5am my time so i was feeling some kind of way...).  But yes I think I have decent research experience and my advisors definitely write strong LOR for me.. I guess I'm just wondering about the transition to an entire new institution and adapting to new research... I'm thinking about switching different areas than what I'm familiar with.  Nonetheless, there are quite a few PI's at caltech that I'm interested in working with!",
                    "score": 1,
                    "author": "mrdoobiewho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thing about PhDs is that finding the right advisor is more important than getting into a particular school. So my advice would be to think really hard about what exactly you want to research, figure out whose labs are publishing the good papers in that area, contact those faculty about project ideas, and only then worry about the prestige of the institution. Wanting to collaborate with different faculty is great but you need a strong single focus and an advisor that wants you in their lab to get yourself admitted to any top graduate program.",
                            "score": 3,
                            "author": "RedPanda5150",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100% agree!  Research is the most important aspect over institution imo.  I find that I like the research conducted at Caltech as they have specialized in biochemistry/biophysics (which I'm currently doing for my masters).  So far, Caltech and UCLA are my top two interested schools with interesting research.  I appreciate the advice and insight!",
                                    "score": 1,
                                    "author": "mrdoobiewho"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}