{
    "id": "kfgk6v",
    "score": 9,
    "title": "List of Labs/Research Groups",
    "author": "l22jordan22",
    "date": 1608276313.0,
    "url": "https://www.reddit.com/r/Caltech/comments/kfgk6v",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey Everyone! I hope break is going well.\n\nI'm a frosh and looking at potential SURFs (in Astronomy/Physics/Planetary Science). I've found a few I'm interested in and have realized that several faculty are heads of or part of a research group. Is there a place where I can find a list of these groups and labs?\n\nThanks! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Probably all faculty are heads of their own research group/lab, so just poke around faculty listings and websites.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "On the PMA division website, there's a \"research and academics\" heading, under which you can find options for physics, math, and astronomy, which then have subheadings for \"physics research\" or \"astronomy research\" (probably there's something similar on the GPS division website for planetary science, I'll leave that to you). If you click on those you can find more information about the groups, the physics page lists faculty by broader research area, and the astronomy one is a little less well organized but the \"research centers\" part of that page might be helpful to you. That can help narrow down which professors might be in areas you're interested in, but you'll need to do more digging on your own to actually find out what specific opportunities exist, usually you can find lab websites with more info by googling \"caltech \\[professor name\\] lab\" or something like that. \n\nAlso, since you're looking for SURF opportunities specifically, make sure you're checking the Announcements of Opportunity on the SFP website to see if there's any opportunities there you're interested in. Hope that helps!",
            "score": 3,
            "author": "dandelionboy"
        },
        {
            "level": 0,
            "comment": "Nick Hutzler's group has SURF opportunities I think- google [hutzlerlab.com](https://hutzlerlab.com)",
            "score": 0,
            "author": "trondheim_fjord"
        }
    ]
}