{
    "id": "kt55rk",
    "score": 10,
    "title": "Exchange student experience",
    "author": "Raikhyt",
    "date": 1610121178.0,
    "url": "https://www.reddit.com/r/Caltech/comments/kt55rk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I'm a theoretical Physics major from a European uni and through my school's exchange programme I got accepted to go to Caltech next year, i.e. senior year for me. I had a few questions for you guys, some more specific, some more general:\n\n* What's the workload like in senior year, especially in physics? I'm not too worried about grades, since all the courses become pass/fail for me, but I've heard some people say that senior year is more chill than junior year or something like that.\n\n* What's the exchange student experience like in general? Does anyone know any past exchange students I could get in contact with?\n\n* How bad are the exams? At my school there are only end of course exams, so a few each semester, and generally the split is 80% exam, 20% coursework for the grades. How do Caltech's exams compare in frequency and in importance?\n\n* Are there any really cool courses I should take? I'm not too much of an astrophysicist, but I'm open to suggestions.\n\n* How necessary is it to have a car? How good is biking for getting around?\n\n* As far as I understand, I'd be staying in residence halls if the coronavirus situation permits. How are they and what kind of facilities can I expect?\n\n* Similarly, has there been any communication as to what the next academic year will look like?\n\nSorry for all the long questions, I'd really appreciate it if you could answer them. Hope to see you all next year.",
    "comments": [
        {
            "level": 0,
            "comment": "I can answer some of these:\n\n* The exams: In general, Caltech (&amp; most american universities) have less emphasis on the exams for the overall grades. In a typical class, the midterm might be worth 10%, the final worth 20%, and the rest based on weekly problem sets - the exact numbers vary but your coursework will typically be at least 50-60% of the grade. For most classes there is a midterm exam halfway through the term and a final exam, though some classes will have only a final or no exams, and others might also have smaller quizzes. I'm a CS major so I'm not too familiar with the physics department and which of these is most common but these are the sorts of grading schemes you can generally expect. That being said, many exams do tend to be very difficult in content\n* The necessity of a car depends on how much you want to go into LA or explore more outside of the area close to Caltech. LA as a city is not very bike/public transit friendly and if you want to spend a lot of time exploring the greater city you'll need a car (or a friend with a car) to really do it effectively. For just getting around pasadena a bike or the busses work just fine. A lot of students don't have cars and are happy spending time mostly on campus and occasionally getting a friend with a car to drive somewhere, but this will depend what you want out of the experience. There are also rideshare apps or zipcars (a few-hour car rental thing) if you just want to go somewhere occasionally, but these can get expensive.\n* iirc as an exchange student, there will be a specific residence hall you'll be assigned to, but separately you will also get the chance to go through rotation. Caltech's housing situation is somewhat unique in that we have 8 houses which each have their own personalities and cultures, and when you first arrive on campus you will spend \\~2weeks visiting each or them for dinners and events before ranking your choices and becoming a member of one of them. For freshman they then move into that house as the place they will be living - for exchange students I believe you become a member of the house (so you can go to their events, be a part of the culture, etc) but will still live in your assigned residence from the start of the year. We also have a few residence halls that are more traditional places to live which are separate from the system I described above. Things may have changed recently but in the past I think exchange students would live in Marks and Braun, two mostly-grad-student residence halls. They have reasonably large rooms, shared bathrooms in the halls, a/c and heating, etc. Most of the bathrooms in caltech's dorms are all gender-neutral (only a few very old ones have urinals though, and in places where they do there are also a set of mens/womens bathrooms specifically. They can also almost all be locked entirely so there's nobody else in the bathroom as well). Marks and Braun I don't believe have any kitchens, but all of the other houses and residences do. \n* I don't think we have heard anything about what next year will look like yet\n\nHopefully some of that was helpful, and hopefully someone with more physics knowledge can help you out with the more department-specific questions. If you want any more detail or anything I said doesn't make sense feel free to ask.",
            "score": 5,
            "author": "kerine999"
        }
    ]
}