{
    "id": "l0otey",
    "score": 7,
    "title": "is Caltech housing available over the summer?",
    "author": "MR-BOW-TIE",
    "date": 1611077985.0,
    "url": "https://www.reddit.com/r/Caltech/comments/l0otey",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a high school student hoping to go to Caltech fall of 2022 and I'm doing some research to figure out a plan for how to do that\n\none of the big things is I live in Missouri so over the summer I wouldn't have anywhere to live unless I rented an apartment or stayed at Caltech \n\nover the summer I'm hoping to get an internship at SpaceX and/or do some research work at Caltech \n\nso I'm trying to figure out if I would be able to stay in one of the houses over the summer in between semesters \n\nand if it is - is it better to just get an apartment anyway? a lot of the financial stuff for Caltech is confusing and I'd be going with very little money so if one is cheaper that would be great I'm just not sure\n\nif anyone can help that would be great",
    "comments": [
        {
            "level": 0,
            "comment": "Might be different with COVID, but when I was a student housing was available during summer if you do a SURF on campus or at JPL",
            "score": 6,
            "author": "Contomtu"
        },
        {
            "level": 0,
            "comment": "It is definitely possible to stay in the dorms over the summer if you're working for Caltech (SURF/JPL/other research), and I think I know people who stayed there even if not working for Caltech. However, Caltech housing costs are actually pretty expensive for what you get, so an apartment nearby (split with a roommate or two) would probably be more cost effective. Also, there's not a huge number of companies that hire summer interns right near Caltech, so getting another place to stay wherever your work is (if not Caltech affiliated) is usually the better choice.",
            "score": 7,
            "author": "nowis3000",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks a lot!",
                    "score": 2,
                    "author": "MR-BOW-TIE"
                }
            ]
        }
    ]
}