{
    "id": "mpotln",
    "score": 18,
    "title": "How is this GPA even possible? Is the maximum GPA actually a 4.3?",
    "author": "Stvdent",
    "date": 1618265854.0,
    "url": "https://www.reddit.com/r/Caltech/comments/mpotln",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yep, A+ is weighted 4.33, as +/- add and subtract a third respectively. The GPA calculation is slightly more complicated than this, but that’s approximately how it works.",
            "score": 24,
            "author": "nowis3000",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; The GPA calculation is slightly more complicated than this\n\nhttps://docs.google.com/spreadsheets/d/1gOQvHZjdH8XBpwrodfjiEpMSIEZ4MPQ0xo3qT7R1cvk/edit",
                    "score": 4,
                    "author": "nicholas818"
                },
                {
                    "level": 1,
                    "comment": "This is also why some of you bastards did your best to break the curve in ACM 95/100 which was already brutal enough without having taken a proof-based math course before, lol.",
                    "score": 4,
                    "author": "racinreaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How?  Is Ma1 not proof-based now?",
                            "score": 3,
                            "author": "pfarner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Current undergrad here. Ma 1a is still very proof-based now but that is a core class, Ma1b and Ma1c are also proof-based if you take the analytical track (but not if you take the practical track which many engineering majors do). Many of the engineering majors do not have many proof-based math courses after that, but majors like CS, Physics, and of course Math do.",
                                    "score": 3,
                                    "author": "supermiis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, they were only starting to split to practical/analytical tracks a year or two after mine, and I hadn't heard of it extending to math.  I'm definitely much more used to the rigorous-math-first approach.",
                                            "score": 1,
                                            "author": "pfarner"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Came in as a grad student.",
                                    "score": 1,
                                    "author": "racinreaver",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm just baffled, as styles of education must have changed a whole lot since my time (admittedly, in a previous millennium) if a whole undergraduate program with sufficient math prep doesn't involve a bunch of proof-driven classes.",
                                            "score": 2,
                                            "author": "pfarner",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most engineering programs won't be proof-based since they're, in general, a lot less useful than focusing on more applied techniques. Part of it was also a disconnect between what seems to be a proof in physics (were simplifying assumptions are expected) and one in math where it's assumed to be rigorous.\n\nLike, take a look at the AP Calculus curriculum which has been unchanged, afaik, for decades as what's taught to most calculus students. Caltech assumes their Math 1a isn't their first calc class, and decides to retread it in a more rigorous manner.",
                                                    "score": 3,
                                                    "author": "racinreaver"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worth noting a large number of classes it is not possible to get an A+ (and in some classes it is impossible to get an A...)",
            "score": 6,
            "author": "skelo"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, CALTECH™ sounds impressive",
                    "score": 4,
                    "author": "Stvdent"
                },
                {
                    "level": 1,
                    "comment": "I'm confused. What is this?\n\nAlso, you stated in other threads that you're a 17 year old high school student. Can you share with me your experiences with Caltech then?",
                    "score": 4,
                    "author": "rxravn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know. I mean I understand it's technically possible given the way they do A+'s, but I was never close enough to 4.0 to worry about it when I was there lol",
            "score": 1,
            "author": "htownchillin"
        }
    ]
}