{
    "id": "zw9fxf",
    "score": 4,
    "title": "how to Convey Circumstances?",
    "author": "casually_bizzare",
    "date": 1672124617.0,
    "url": "https://www.reddit.com/r/Caltech/comments/zw9fxf",
    "media_urls": [],
    "other_urls": [],
    "postText": "intl + fin aid here, \n\nnow, I have 10-11 STEM oriented exams/awards, mostly national and few state level, finalist for india's IOAA team, wrote a book on HS Physics,  founded tech start up which is  currently getting pre sign-ups and stuff etc.\n\nMost parts of my application are suited for Caltech; however my school has this horrible grading system which is leading to grade DEFLATION!\n\nAll courses are regular, no acc/AP/IB, so no weighing GPAs either. although I'm in top 1-2% of class, my uw GPA is 92.15/100 which is roughly 3.72/4, junior year highest score was 90/100! \n\nGiven how competitive Caltech admission is, i wish to let AO's know of this, how can I do so without sounding as if I'm making excuses",
    "comments": [
        {
            "level": 0,
            "comment": "Get the grade deflation in grades 9th/11th mentioned in the transcript (I’m assuming you have a board score for 10th and a predicted board score for 12th).",
            "score": 3,
            "author": "physicsurfer",
            "replies": [
                {
                    "level": 1,
                    "comment": "i tried but my counselor isnt that flexible, teachers are super helpful but say they don't have the authority to comment on school's stats like that to an official institution, any way *I* could convey that? My board score in 10th is solid: 97.8/100, no predicted scores",
                    "score": 1,
                    "author": "casually_bizzare",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m afraid if your teachers and counsellors cannot write about it, you have no choice but to explain it yourself in the additional information section. \n\nDon’t worry though, I’m assuming an overwhelming majority of applicants from the Indian curriculum have the same grade trend as you (at least I did) so they probably already know it.",
                            "score": 3,
                            "author": "physicsurfer"
                        }
                    ]
                }
            ]
        }
    ]
}