{
    "id": "6393x4",
    "score": 82218,
    "title": "\"r/place\" digital, 2017",
    "author": "Schozinator",
    "date": 1491248547.0,
    "url": "https://www.reddit.com/r/Art/comments/6393x4",
    "media_urls": [
        "https://i.redd.it/o4oku48qk9py.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hello! I hope everyone is well. This is just a reminder to be civil! Jesus folks. Parts of this thread have gone full dumpster fire.\n\n&gt;######8. Be respectful and stay on topic\nBigotry, slapfights, and off topic comments will not be tolerated.\n\nViolating the rules will result in deportation!",
            "score": 1,
            "author": "awkwardtheturtle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oh man, good job Runescape guys",
            "score": 470,
            "author": "goodzgamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "We sit down doing the most repetitive, menial shit for hours on end every day, *and we find that fun.* \n\nMaintaining a little disconnected message in the corner was a walk in the park for us :P   ",
                    "score": 170,
                    "author": "Swordstone_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shoutout Mona Lisa's middle finger ",
            "score": 320,
            "author": "hcizzle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This has to be the most concentrated dose of internet culture ever. Also it's really beautiful, as a concept and an art piece :)",
            "score": 194,
            "author": "pizzadeficiency"
        },
        {
            "level": 0,
            "comment": "I like benders tranformation to all his forms \n\"bite my shiny metal ass\"\n\"bite my golden glorious ass\"\n\"bite my wooden splitery ass\" \nit's perfect.",
            "score": 2392,
            "author": "JollyPandaBerr",
            "replies": [
                {
                    "level": 1,
                    "comment": "At one point it was \"bite my shit ass\".",
                    "score": 551,
                    "author": "Ephemara",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That and Mario's transition to Luigi, wario, waluigi and then finally Mario ",
                    "score": 233,
                    "author": "tegamil",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't realize that they managed to sneak in Waldo as well! That's so cool!",
            "score": 139,
            "author": "box-art",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's best is he's been there since a few hours in. Sure, it got shat on a couple times by the likes of the void (and is damaged in the final shot), but most people worked around it and let it up. The same goes with a surprising number of nice small art.",
                    "score": 40,
                    "author": "upset_platypous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately he got erased at the very end by the void. This is not the final project...",
                            "score": 19,
                            "author": "Dewy_Wanna_Go_There",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, I made a few of those dots!",
            "score": 3325,
            "author": "TooShiftyForYou",
            "replies": [
                {
                    "level": 1,
                    "comment": "I helped coordinate the beatles yellow submarine ^^\n",
                    "score": 688,
                    "author": "Zach4Science",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm ~~significantly~~ partially responsible for the Starfleet insignia! I placed maybe a quarter of it myself, but also turned a new artist onto it ~~after the original artist abandoned the project~~ (looks like they didn't abandon it, I just thought that after a slow period, my mistake). Very proud :) \n\nEdit I don't mean to sound like it's totally my thing, I was just so excited to play a significant role in such an important icon being memorialized in the Place. Thanks to everybody who worked on it or protected it from vandals!! ",
                            "score": 241,
                            "author": "microcosmic5447",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 251,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I managed a tiny flower underneath Trogdor",
                                            "score": 48,
                                            "author": "musedav",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Please, I'm a veteran, give me Karma, I had all my pixels swallowed by r/de during the 2nd invasion of r/france\n",
                            "score": 175,
                            "author": "justformeandmeonly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "R/canada respects your efforts. That's why we made poppies. For those who fought the good fight.",
                                    "score": 26,
                                    "author": "starlaluna",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most of mine were to help make Bender gray again. Bite my shiny metal ass!",
                    "score": 288,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was following the Bender situation closely all weekend. Got concerned about him getting gobbled up by all the blue!",
                            "score": 94,
                            "author": "TooShiftyForYou",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Which ones exactly? proof or it didn't happen!",
                    "score": 63,
                    "author": "zacknquack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A few of Mega Man's flames there were totally me!",
                            "score": 48,
                            "author": "TooShiftyForYou",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The RuneScape disconnected message is perfect.",
            "score": 3459,
            "author": "MeLikeChoco",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's where it's from! Looked so familiar but didn't know from where",
                    "score": 673,
                    "author": "dbfsjkshutup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 389,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Perfect connection for a while\n\nGo to wildy\n\nAttempting to reconnect...\n\nDed.",
                                    "score": 223,
                                    "author": "SluttyMcCumdumpster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The word \"wildy\" just gave me a major fucking flashback. ",
                                            "score": 32,
                                            "author": "HampsterUpMyAss",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you play today you'll see it regardless of what you play with!",
                                    "score": 19,
                                    "author": "Negabite"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really like the unregistered hypercam 2 in the right corner too.",
                    "score": 264,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; unregistered hypercum 2\n\nFTFY",
                            "score": 120,
                            "author": "blasphemistActavist",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 487,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Man I'm so proud of everyone. We really pulled that off",
                            "score": 286,
                            "author": "Z4CX",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Literally 1:1 scale with the ingame font too, really proud of the /r/runescape and /r/2007scape guys working together for this, that and anyone else who jumped in for nostalgia's sake... Thank you.  ",
                    "score": 146,
                    "author": "Ambler3isme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I spend a whole day with a tab open just to clean it up when it gets vandalized. It was strangely satisfying.  ",
                            "score": 11,
                            "author": "MugenBlaze"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the upper right area there is also an   'a pq w   Nice', a 108 dds spec, a max stack of cash and an ice barrage, lmao\n\n   ",
                    "score": 29,
                    "author": "Statik81",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Is nobody pointing out the fact that the Mona Lisa is flipping the bird?",
                    "score": 62,
                    "author": "Trippy__Ferret",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She also had her tits out for a bit.",
                            "score": 33,
                            "author": "MegaFanGirlin3D",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 'Straya cunts part made me laugh. Then I saw Steve, and that made my day. ",
            "score": 302,
            "author": "WhatALoadOfAnabolics",
            "replies": [
                {
                    "level": 1,
                    "comment": "'straya was pretty cool though.  There was some initial friction when /r/parahumans got in the way of the kangaroo ears, but I think there was some collaboration and cooperation and it was positive in general.",
                    "score": 77,
                    "author": "Wildbow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/parahumans got really lucky in positioning. We had straya to the south, attracting attention from those who wanted a recognizable target and helping shore up our beetles. Portugal did much of the same to the north, though cooperation with them wasn't as predominant as it was with the great guys at Straya. Rainbow Road kept the Void from advancing towards us, and the MLP/Undertale/Random art to the East didn't encroach upon our little banner. All in all it was a very good spot.",
                            "score": 48,
                            "author": "TheCosmicCactus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then there was the Pink Vomit Monster helping us out and letting us connect our Worm to to them making our space look way bigger than it was.  The Roll 20 people weren't really allies, but they weren't aggressive either.  The bugs meshed with /r/straya's theme enough that they were helping us build them, and provided the rooftop for the Undersiders.  And don't undersell how awesome it was of Portugal to let us have the worm peeking out of their water.  We ended up with the perfect spot and it's glorious.",
                                    "score": 19,
                                    "author": "ZellZoy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 6494,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just such a wholesome idea, everyone coming together to make a giant pixel mosaic, and it actually worked.",
                    "score": 2867,
                    "author": "96Phoenix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe I just got randomly lucky but I never saw a single swastika when I checked it which was a pleasant surprise. I thought for sure there would be some edgelord out there that would make it his purpose to get one in there somewhere.\n",
                            "score": 1837,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There was a naked woman getting ejaculated on in the Blue Corner for awhile. That was the edgiest thing I saw. Well that and the occasional penis outline, but those never lasted long.",
                                    "score": 287,
                                    "author": "PhoenixKA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What about the pink shitting penis monster in the lower right? That thing was there the whole time.",
                                            "score": 124,
                                            "author": "StevenBurnham",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That thing was made out of penises? I guess I never noticed that's what it was made out of. I just thought it was some random weird as hell looking monster.",
                                                    "score": 47,
                                                    "author": "PhoenixKA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It started out looking kinda like Jabba the Hutt, but became more and more deformed.",
                                                            "score": 23,
                                                            "author": "KaitRaven",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I miss the charmander with a massive erection ",
                                            "score": 84,
                                            "author": "Riot_Jet_Pirate",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Everybody chipped in to destroy swastikas on sight.\n\n^^^Makes ^^^you ^^^think.",
                                    "score": 2471,
                                    "author": "iwhitt567",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its some asinine keyboard warriorism but I'll take it. 4chan seemed to wear itself out early on with the attempt at giving it bluescreen of death mibbe. its funny to see that redditised as the relatively benign bluecorner guys\n\nI'm pretty surprised the_donald don't have any place on it, and the general lack of protrump/antitrump jerking. Very refreshing, and I don't blame people for having fatigue in that respect",
                                            "score": 976,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 355,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They tried to write their subreddit name next to the flag too.  ",
                                                            "score": 199,
                                                            "author": "wilf182",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 207,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "t_d Tried really hard, but were met with constant opposition.",
                                                    "score": 561,
                                                    "author": "iwhitt567",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As is tradition.",
                                                            "score": 778,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They did help create the flag!  It was designed and started by r/AmericanFlaginPlace and r/Murica helped out a bunch too!\n\n**edit** Also have to give a shout out to r/Indieheads and r/GrowTheTree for generously allowing us the space.",
                                                            "score": 175,
                                                            "author": "boy_wonder69",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "After we had to move to the side our album art project over at r/indieheads, I know some people of American Flag In Place helped with the reconstruction, so it did go well for both sides. ",
                                                                    "score": 17,
                                                                    "author": "dude_in_the_mansuit"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, Swastikas were wiped out, but I'm even impressed that the community eliminated even things as juvenile as penises (for the most part), and random F-words (mostly), and replaced Dickbutt with Vincent Van Gogh.",
                                            "score": 20,
                                            "author": "Shadrach451"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 52,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "No swastika but there is the NY Jets. Basically worse. ",
                                    "score": 378,
                                    "author": "flacidd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's 4 F's. I didn't realize it would look like that.",
                                            "score": 95,
                                            "author": "Pickled_Kagura",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "http://i.imgur.com/MJEgQB5.png",
                                                    "score": 80,
                                                    "author": "spid3rman1"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You didn't see the Funhaus logo?",
                                    "score": 41,
                                    "author": "Tit4nNL",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 78,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where can I get pixels?",
                                    "score": 62,
                                    "author": "PM_ME_YOUR_PM_PHOTOS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They're in the computers, Dorothy\n\nPS ORDER CORN",
                                            "score": 48,
                                            "author": "Duke_Dardar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They're \"in\" the computer?!",
                                                    "score": 23,
                                                    "author": "Mech__Dragon",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was beautiful. It was chaos at first, but between the subreddits and their associated Discord servers, a beautiful massive cooperation was born. Coolest social experiment I've ever seen, by far. ",
                    "score": 127,
                    "author": "Arcadian_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It makes me happy because it says to me that most people are awesome and want to build cool things, and the ruiners and destroyers are in the minority.\n\nSo often on the internet, people who just want to mess stuff up have an outsize impact. One spammer or botter can ruin conversation in an entire community. They're persistent and their work - ruining - is easier than building. Like with last year's April Fools, Robin, how it only took 1 person spamming nonsense to seriously disrupt a chat of 16 or 32 people. So you get this idea that a good portion of people are terrible, because a good deal of what you see is terribleness. \n\nBut when you limit everyone to each having the same impact, so one ruiner can only post one pixel at a time - or two or three, if they have some alts - and each creator can place the same number of pixels, the sheer overwhelming number of good people becomes apparent. Someone puts down a pixel to mess something up, someone else puts down a pixel to fix it, and a second person puts down a pixel to build it further. Progress is made. The void was beaten back every time, and I'm sure it would have been again if the experiment had gone on a few hours longer. \n\nPeople had a huge canvas that they could do anything with, and they chose to fill it with really cool things and expressions of teamwork and love. And they successfully fought off the few who tried to ruin it. Because that's what humans do, when the impact of terrible people isn't disproportionately distorted by the nature of the internet.",
                    "score": 385,
                    "author": "TryUsingScience",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even more fascinating were the alliances and such formed between groups to defend their small piece of turf against invasion, similar to countries. \n\nFor example, I helped work on the /r/DestinyTheGame design. We had /r/Scotland and /r/RocketLeague near us, and there were some bots that kept trying to make some flag right on us, and a couple people placing pixels in the middle of designs. We all helped protect each other. \n\nWe really had a strong alliance formed, and helped each other. Another nearby ally gave up a little bit of their turf for us to expand and make our design even cooler. \n\nWould have been really interesting to see this go on longer, what would happen? Would \"governments\" form between large designs? Like what if there were two huge entities next to each other and they had a treaty between each other, like don't mess with me, and you'll be okay? And then someone breaches the border, and the one side gets pissed off and invades the other and destroys their design... would people have gotten together to stop the Black Plague?\n\nAmazing. I loved this game. ",
                            "score": 74,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You put everything I was thinking into words - yes! I've been feeling super cynical lately and this just made me happy!! Yay humans of Reddit!",
                            "score": 43,
                            "author": "Clairijuana"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Here is a 4K Time Lapse of the whole thing](http://spacescience.tech/place/)",
                    "score": 314,
                    "author": "JetBalsa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm mesmerised by seeing 'Toronto Maple Leafs' change to 'Fuck My Life\" and back again over and over....",
                            "score": 210,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you mean on /r/place? Or just, like, every season?",
                                    "score": 198,
                                    "author": "whogivesashirtdotca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "http://i.imgur.com/xezAwAe.gif",
                                            "score": 69,
                                            "author": "YepYepYepYepYepUhHuh"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The way the German flag takes over the French flag. I could've sworn I've seen that happen a time or two already....",
                            "score": 146,
                            "author": "_Tibbles_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then the French flag try to take it back then it became the European Union flag. I couldn't stop laughing at that.",
                                    "score": 193,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It turns into the EU flag as the rainbow intersects the two fighting parties!",
                                            "score": 23,
                                            "author": "cultish_alibi",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It becomes pretty clear in the time lapse when certain groups started using bots to do the painting.",
                    "score": 31,
                    "author": "qcole",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm pleasantly surprised with how it turned out in the end. The first 12 hours seemed like it was just going to be a big goofy color war that would end in 90% blue pixels.",
                    "score": 16,
                    "author": "Hes_A_Fast_Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has to be one of the most interesting studies of human behavior I've been witness to. \n\nEDIT: To all the people commenting/complaining about it being taken over by bots - I still thinks its a very interesting study in human behaviour. Humans started it, humans created the bots and told them what to do. However this thing turned out, it was still something put together by people coming together - whether they manipulated it with bots they created or did it by hand on their own. Until we have true AI, I don't think we can argue that humans weren't involved with each other even if it was partially through bots interacting. ",
            "score": 2880,
            "author": "MrRobotsBitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "And participate in. \nAnd fight in. \nGlory to the Etho logo at the top left and the Hearthstone logo and the Bender. Lol\n\nE: yo there's a Bill Cipher too!! Awesome",
                    "score": 784,
                    "author": "Blazing_Shade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know what's also in the top left corner?\n\nA friendly reminder that the Atlanta Falcons blew a 25 point lead with 3 minutes left in the third quarter of the Superbowl (courtesy of /r/buccaneers)\n\nEdit: Alright my bad, credit to /r/Patriots and the rest of the NFC south as well (/r/saints &amp; /r/panthers)",
                            "score": 391,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was a native to the Midwest, Mona Lisa ranch-hand was my occupation until I turned 28.\n\nI had a great time participating. It's a really great concept. There's an unfortunate aspect that no one really accounts for - many groups used scripting bots to control their spaces and touch-up. \n\nGood job Reddit you cheated at art.\n\nHow the fuck do you cheat at art.\n\n",
                    "score": 301,
                    "author": "eS_wiggle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that's your answer, you can't cheat at art. It is what it is, bots or not. I still call that art :) ",
                            "score": 137,
                            "author": "MrRobotsBitch",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, its especially fascinating when you consider all the social organization, political deal-making, and diplomacy that went on behind the scenes.",
                    "score": 53,
                    "author": "KaitRaven",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok so what the heck did I miss this weekend. Can someone explain for lowly ole me?",
            "score": 701,
            "author": "Danger_Zebra",
            "replies": [
                {
                    "level": 1,
                    "comment": "A subreddit opened up called \"r/place\" for April fools. In this subreddit you were able to place one pixel and had to wait a minimum of five minutes in order to place another. Various communities were arranged in order to organize specific works. The sub recently closed after hitting the 72 hour mark. This is near the end of it. It's not the final because a group of greifers messed areas up and I preferred this look better.",
                    "score": 1115,
                    "author": "Schozinator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "every 5 mins? I popped in there for a moment in put down about 15 in a couple mins?",
                            "score": 196,
                            "author": "ashesarise",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was a bug. Anything after your first probably didn't stick around.",
                                    "score": 409,
                                    "author": "carbonated_turtle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Comment removed]",
                                            "score": 92,
                                            "author": "thecodingdude",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Then they didn't count and you had to refresh the page",
                                    "score": 66,
                                    "author": "TheGuyWhoIsBadAtDota",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1912,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 851,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was satisfying to watch.\n\nEdit:  Wow so is the heat map.",
                            "score": 225,
                            "author": "SaltLakeCitySlicker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 120,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 94,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Must be really drunk replying to yourself",
                                                    "score": 83,
                                                    "author": "OrcaDevil",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 48,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People may hate the void, but it sure looks cool in timelapse..",
                            "score": 96,
                            "author": "ludwigmiesvanderrohe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I love how there's a last minute sabotage of the American flag and the quick recovery just before r/place ended. Spectacular.",
                            "score": 138,
                            "author": "Avarrocka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check how the German flag overtakes the French flag but the French flag fools the German one and rises up to be on top. OMG that was the funniest shit I have seen all week. ",
                                    "score": 72,
                                    "author": "43566875433678",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The best part is the European flag emerging in the middle.",
                                            "score": 64,
                                            "author": "ZeeBeeblebrox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "http://imgur.com/1YqcyoO",
                                                    "score": 19,
                                                    "author": "hayLAYdee"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I like how the first 3 things were a drawing of a dick, the word 'dick', and 'send nudes'",
                            "score": 42,
                            "author": "yoLeaveMeAlone",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Looks like there was a strong fight about the US flag at the very end.",
                            "score": 31,
                            "author": "Prof_Dr_Patrick",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 83,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 146,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 43,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We used references. For most of the art pieces someone would post the pixel art with coordinates and you would go off that.",
                                                    "score": 121,
                                                    "author": "RubberBabyBuggyBmprs",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not but I liked this version the best. [This](https://i.redd.it/72vbx01kpdpy.png) is the final for those who want it. ",
                    "score": 883,
                    "author": "Schozinator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "denmark made a hell of a last second land grab. ",
                            "score": 364,
                            "author": "Enlight1Oment",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That's also not the final that's sitting on r/place right now.  ie. Canada flag now incorrectly says \"Oh Canada 158\" instead of \"150\" that's on your version. ",
                            "score": 131,
                            "author": "engcan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also missing the Mona Lisa's red eyes and subtle booger.",
                                    "score": 36,
                                    "author": "WorkingFoxglove",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Gogh pornhub lol",
                            "score": 43,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 43,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many people in all worked on this?",
            "score": 389,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Somewhere around 90 thousand if I remember correctly.",
                    "score": 578,
                    "author": "Schozinator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There were 90.000 people active at the same time but I'm sure the unique user count  has\n to be bigger. I mean around 200.000 people alone subscribed to the subreddit.",
                            "score": 557,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Makes this even more impressive of a feat!",
                                    "score": 103,
                                    "author": "Schozinator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "News sites reporting on it say ~ 1 million users total participated",
                                            "score": 164,
                                            "author": "Mav12222",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is wild!",
                                                    "score": 52,
                                                    "author": "Schozinator",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's kinda mindblowing to think about. I don't think anything like this on this scale has ever been done before.",
                            "score": 40,
                            "author": "RedDane",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i love how no matter who you are, you can find something in there that you're a fan of/recognize. excluding flags.",
            "score": 587,
            "author": "Dragon911X",
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally. I saw like four things from Stardew Valley and I didn't know so many people played that. \n\nEdit: TIL Stardew Valley is an immensely popular game!",
                    "score": 177,
                    "author": "theycallmemintie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 118,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No not kidding, I just got it as a gift and I'm not a gamer or part of the gaming community so I was surprised anyway.",
                                    "score": 27,
                                    "author": "theycallmemintie",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ftl got a tiny but recognizable engi",
                    "score": 20,
                    "author": "hitlerallyliteral",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The Temmie (from Undertale) in the Irish flag is still cracking me up. I neither know why it's there or why I find it so funny. ",
                    "score": 9,
                    "author": "An_Lochlannach"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol at those RuneScape Memes",
            "score": 331,
            "author": "WalkerDabberRanger",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Connection lost: Attempting to reestablish\" while in old wilderness and your heart is about to give out on you.\n\nA qp XD this is nostalgia if I ever felt some",
                    "score": 125,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And 'buying gf' as well as a ddp++, the pixel style allows for runescape to be recreated perfectly, the connection lost work looks weirdly identical",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Emily faking cancer will now be a part of Reddit history",
                    "score": 10,
                    "author": "MeridianBayCaballers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This would make an epic sheet of blotter.",
            "score": 171,
            "author": "MAG7C",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My boy aku there on the left looking E X T R A  T H I C C as always",
            "score": 150,
            "author": "Dbz123amv",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Shout out to r/Straya for their ripper effort on Sir Steve Irwin and our Nations contribution to world cuisine; the Bunnings snag.",
            "score": 58,
            "author": "Budgiesmugglerlover2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just wanna say, I see my country's flag there (india) and our neighboring country is right next to it. (pakistan)\n\nRegardless of what bullshit politics get reported in the media, I love that our two flags are together in this. \n\nlove you guys :D",
            "score": 259,
            "author": "blueberry-yum-yum",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry to say, but Pakistan's flag was actually destroyed later on.",
                    "score": 98,
                    "author": "rasherdk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nooo! 😱",
                            "score": 29,
                            "author": "Gunji_Murgi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, India nuked it. :/",
                                    "score": 50,
                                    "author": "_MuchoMachoMuchacho_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's so much detail to look at here, but I'm quite a fan of the /r/prequelmemes in the center. Seeing their takeover of /r/movies made my Saturday.\n\nEdit: I meant top center.",
            "score": 384,
            "author": "frozen-silver",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well deserved takeover too, /r/movies has legitimately awful taste.",
                    "score": 31,
                    "author": "TheTVC15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Place feels like a metaphor for human progress.  Alone you can't get much done, but great things happen when people mobilize. Projects seem mundane on a microscopic scale, but with a little bit of waiting, great things are made.",
            "score": 100,
            "author": "perfectbluu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Seeing little pixel arts that I drew out and then got support from other people to build makes me more proud than anything else I've ever done in my life.",
            "score": 100,
            "author": "kainoasmith",
            "replies": []
        },
        {
            "level": 0,
            "comment": "RIP Tom Searle got me in the heart ",
            "score": 47,
            "author": "Brohnly",
            "replies": []
        },
        {
            "level": 0,
            "comment": "im not an arty person but ive spent the last 20 minutes staring at this thing so it must be good, or at least interesting.",
            "score": 333,
            "author": "NevilleBart0s",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this and consider it a genuine work of art. I think it would be an amazing museum exhibit.",
                    "score": 40,
                    "author": "___VK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you ever hear the tragedy of Darth Plagueis the wise?",
            "score": 759,
            "author": "Terminator144",
            "replies": [
                {
                    "level": 1,
                    "comment": "No.",
                    "score": 386,
                    "author": "Catacomb82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought not. It's not a story the Jedi would tell you. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the Midichlorians to create life… He had such a knowledge of the dark side that he could even keep the ones he cared about from dying. The dark side of the Force is a pathway to many abilities some consider to be unnatural. He became so powerful… the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice killed him in his sleep. Ironic. He could save others from death, but not himself.",
                            "score": 676,
                            "author": "ThisBasterd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it possible to learn this powers?",
                                    "score": 217,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not from a Jedi.",
                                            "score": 241,
                                            "author": "brecka",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love that somewhere in there, someone changed \"dark\" to \"dank\"",
                    "score": 43,
                    "author": "bihan27",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The unregistered hypercam 2 is perfect. ",
            "score": 45,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can we all agree the Dutch are a bunch of assholes? They took over the Puerto Rican, Dominican republic, and Colorado flags. AND the SkiFree Monster dispite already having a huge untouched flag and Coat of arms.",
            "score": 1231,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 332,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Historical re-enactment.",
                            "score": 285,
                            "author": "Nimonic"
                        },
                        {
                            "level": 2,
                            "comment": "I was actually impressed that the Canadian section managed to keep both the medicine wheel and Metis flag relatively untouched. Maybe because they were small or because people don't know that those are Indigenous symbols...",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were both a part of the /r/placecanada [official design](http://i.imgur.com/otJMxcR.png), so they were actively defended by that community.",
                                    "score": 25,
                                    "author": "Thalvos",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are two things in this world I can't stand.\n\n1. People who are intolerant of other people's cultures.\n2. The Dutch. ",
                    "score": 821,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Schmoke and a pancake?",
                            "score": 76,
                            "author": "bug_eyed_earl",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tell me about it, r/Dominican and r/PuertoRico were so happy to have their flags on there.",
                    "score": 198,
                    "author": "josetavares",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's just land reclamation, it's a part of their culture.",
                    "score": 61,
                    "author": "DC-3"
                },
                {
                    "level": 1,
                    "comment": "The dutch just lucked into a massive space created by the void. The void was a group of users who would just start placing black pixels in areas and wipe out what they could. If no one was there to resist them it would just destroy large sections of the image. The dutch swept through after the void destroyed the whole top left section.",
                    "score": 97,
                    "author": "Tekar",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Don't forget nyan cat",
                    "score": 40,
                    "author": "bob_sagget",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The dutch nyan cat was pretty cute though.",
                            "score": 35,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The process is the real art here.",
            "score": 111,
            "author": "mogoh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This would make a really fun jigsaw puzzle. ",
            "score": 36,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was not expecting Soylent to be on there. ",
            "score": 31,
            "author": "REVIGOR",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As someone who has been mostly lurking on /r/all for the past ~4 years, this is pretty much what reddit is in my head. It's so clearly captured on a canvas now. It expresses beyond what I could imagine, but makes so much sense. It's really cool.",
            "score": 32,
            "author": "wuddupdude"
        },
        {
            "level": 0,
            "comment": "Nobody's mentioned your porn hub window yet.",
            "score": 215,
            "author": "Kungfu_McNugget",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's actually part of the artwork aha.",
                    "score": 337,
                    "author": "Schozinator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah yeah, sure it is.",
                            "score": 93,
                            "author": "SrpskaZemlja"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can't tell whether you're joking or just don't understand what r/place is/was.",
                    "score": 113,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That means r/placestart did a really good job",
                            "score": 112,
                            "author": "bad_at_photosharp",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He's gotta be joking. Nobody still runs Windows 95. lmao",
                            "score": 26,
                            "author": "TheHuntingHunty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like how Canada is the only flag that's perfect. Nobody has shit with Canada lol",
            "score": 493,
            "author": "ThatThrowaway29986",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are actually quite a few perfect flags there.",
                    "score": 77,
                    "author": "TraveLifestylers",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It was a constant battle but some beauties even surrounded our lovely flag with the provincial and territorial flags of our country. &lt;3 sadly the final image lists our 160th anniversary while we are celebrating our 150th but it's still a great representation despite that. My favourite snap is this http://imgur.com/c7RDmEY",
                    "score": 130,
                    "author": "tarantulated",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Considering we had SO MUCH trouble getting the smaller version of our flag to look right, it's so gratifying that we were able to pull it together in the end. Maple leafs are HARD to draw! ",
                    "score": 213,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "same with Toronto Maple Leafs :p I like this version because it still said Original 6 near the leaf.",
                            "score": 13,
                            "author": "duzzles",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maryland",
                    "score": 22,
                    "author": "DJMooray",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And Argentina! Vamos Manaos",
                    "score": 35,
                    "author": "Gfreydank",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was about to say, im from the square spiral and I noticed that your flag was always the neatest of our neighbors",
                            "score": 14,
                            "author": "PM_ME_UR_PERSONALlTY",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A surprise to be sure, but a welcome one",
            "score": 27,
            "author": "tduerden"
        },
        {
            "level": 0,
            "comment": "Nice to see the Viva Mexico Cabrones, the mexican flag and yoshi in their splender, rip and fuck the void.",
            "score": 47,
            "author": "metalsluger",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I helped preserve the r/Wales flag! As I am Welsh it seemed the right thing to do :)",
            "score": 21,
            "author": "EthanJJM",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This should be on display in the Smithsonian. ",
            "score": 17,
            "author": "AchillesImperial",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There needs to be a creation timelapse of this. Is there one?",
            "score": 55,
            "author": "Wishalloy",
            "replies": [
                {
                    "level": 1,
                    "comment": "[I gotchu](https://www.youtube.com/watch?v=XnRCZK3KjUY)",
                    "score": 122,
                    "author": "Schozinator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not even 2 seconds in and Lord Helix appears, praise he!",
                            "score": 67,
                            "author": "leadeater89",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I like how you can see in the top corner when /r/Masseffect was asked to scoot over a bit ",
                            "score": 17,
                            "author": "SoGodDangTired",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The German and French flags at 0:45!",
                            "score": 12,
                            "author": "lawrencelewillows",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything looks so nice then you see Osu! torn apart",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm so happy the Tom Searle tribute remained, it makes me so happy that everyone accepted the grieving of a fairly small community in r/metalcore",
            "score": 14,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Glad it ended because I had to stay up all night working on it. What a cool experience though. It really brought people together. The pixel wars were intense though. These houston rockets fans kept trying to change our rip city Into nip tity.",
            "score": 28,
            "author": "sheazang",
            "replies": []
        }
    ]
}