{
    "id": "krs3za",
    "score": 57849,
    "title": "Death, Me, Digital, 2021",
    "author": "michaelzrk",
    "date": 1609952961.0,
    "url": "https://www.reddit.com/r/Art/comments/krs3za",
    "media_urls": [
        "https://i.redd.it/98jw25j3uq961.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is great. I can feel The Call of the Void through my screen.",
            "score": 523,
            "author": "excelerati",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im so glad someone else said this. \n\nNot to sound like Imagine Dragons, but I can feel it in my chest.",
                    "score": 19,
                    "author": "moosecatoe"
                },
                {
                    "level": 1,
                    "comment": "I'm enjoying the view from halfway down",
                    "score": 3,
                    "author": "tiefling_sorceress"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 32,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to be confused with [L’appel du Vide (metalcore)](https://youtu.be/8FUIwMELKY4)",
                            "score": 13,
                            "author": "RealGamerGod88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Polaris are so good",
                                    "score": 7,
                                    "author": "StrykerRamoray"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t express how much I love this picture",
            "score": 1845,
            "author": "ReadMyThots",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much",
                    "score": 588,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly, it makes me want to turn this into a writing prompt. Night on the town, out drunk joking around, suddenly there is a car coming at you as you cross the road.... It's loud, it's bright, then it's all gone. Everything is quiet ... Something that never happens when being in town... And everyone is gone. The feeling of being drunk is gone. You can hear the wind, feel the air... And hear the buzz of a neon sign. Several feet away from where you were hit, you see exactly what appears in this image. The neon buzz is coming from the hovering words and is the only man-made sound you can hear.\n\nYou begin to wander around, and examining the world around you. Everything is as it was, but emptier and much more clean and organized. The cars won't start, electronics won't work... And you can't help but shake the feeling that there is nothing left to do....\n\nEdit: was asked to continue it, did so:\n\nYou begin to walk further away from the place that you died. Exploring, looking for anything and anyone that is alive or could give you some information about where you are... What you are. Though you can tell many hours have passed- enough that it would be morning by now- it still remains dark, with everything caught in twilight of clear summer night. Nothing seems out of place... But nothing else seems to be around either. Nothing moves but what the wind encourages.\n\nIt's beautiful. But the emptiness and calm are quickly becoming drowned out by the intensity of everything that is missing... The evermore loud sensation that this is all as it is everywhere else, no matter how far you could go. The only thing different, the only thing abnormal enough among all of this that could explain what was going on lied beneath neon lettering that read, \"The End. Thanks for playing\" at the very place your journey began... and ended. It is a dark call with single answer. So you turn back, down the roads you've walked, the streets you've seen, to arrive at the place with answers.\n\nIt is as you left it. The only remarkable thing left on these unremarkable streets. A stones throw from a pub, in middle of your average old road, in just another town. What a place for it to end... It is ending, right? Something... Certainly ended here.\n\nYou stood and stared. Questioned if it was to be ceremonious. The neon buzzed on. You stepped forward. It happened almost the same way you arrived...in that it was quick. But instead, this time it was dark and quiet. \n\nAnd then, just for a moment you slipped back into a familiar world. Somewhere, off to your side, there was a voice. \"Aye, mate\" it said, heavy and dark with sadness. Then, cynically and drunkenly slurred out, \"but that's life...\" And then you were gone.\n\nEdit: Guys, thank you for all the love on this! I really appreciate it. For those of you who inquired, I'm not actually a publisher writer... But it's on my to do list. Atm I'm a college student fighting his way through. I don't often find myself with good enough inspiration to write like this, so it was joy for me to write too. Developing the discipline for writing is something I work on as I can...but don't often have the time for. All of the feedback is an encouragement though :)",
                            "score": 712,
                            "author": "silverlight145",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is so terrifyingly beautiful it should be a movie",
                                    "score": 229,
                                    "author": "michaelzrk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your art was the inspiration :)",
                                            "score": 127,
                                            "author": "silverlight145",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wholesome",
                                                    "score": 97,
                                                    "author": "michaelzrk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Write the book. Do the cover art.",
                                                            "score": 25,
                                                            "author": "Logthisforlater",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it has been done",
                                                                    "score": 5,
                                                                    "author": "Pandovix"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Phase 3 - Profit",
                                                                    "score": 3,
                                                                    "author": "GrandmasBoyToy69"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Now kith",
                                                            "score": 97,
                                                            "author": "SupermotoArchitect",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Get outta here Mike Tyson!",
                                                                    "score": 23,
                                                                    "author": "Rubels",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "and I gave him a dolla",
                                                                            "score": 5,
                                                                            "author": "Phormitago"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Reminds me of *The View From Halfway Down.*",
                                            "score": 19,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A nice character study with an A lister looking for an Oscar. Dude.",
                                            "score": 9,
                                            "author": "Sthurlangue"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahaha okay I'll prioritize it",
                                            "score": 7,
                                            "author": "silverlight145"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This would be an amazing short film!",
                                    "score": 17,
                                    "author": "o___o__o___o"
                                },
                                {
                                    "level": 3,
                                    "comment": "This sounds a bit like how I remember the atmosphere in the movie \"[the langoliers](https://m.imdb.com/title/tt0112040/)\".",
                                    "score": 5,
                                    "author": "Cabslock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A paper-tearing Balki Bartokomous was very creepy in that movie",
                                            "score": 3,
                                            "author": "brother_of_menelaus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hahaha wow I totally forgot about perfect strangers!",
                                                    "score": 2,
                                                    "author": "Cabslock"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love that you wrote this, because it's exactly what this picture made me feel!",
                                    "score": 4,
                                    "author": "OSUfan88"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It evokes so many emotions. Brilliant!",
                            "score": 6,
                            "author": "Popular-Catch7315"
                        },
                        {
                            "level": 2,
                            "comment": "New phone wallpaper",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly if this is how it ends.. I'll be OK.",
                    "score": 20,
                    "author": "bonefawn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it aint\n\ndo you remember before you were born? 'cause that's where youre going back to. no thought, no emotion, no heat, no cold, no YOU",
                            "score": 10,
                            "author": "mitsukaikira",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "nope. sounds pretty good to me.",
                                            "score": 7,
                                            "author": "mitsukaikira"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you love it so much then why don't you marry it?",
                    "score": 8,
                    "author": "kpacny",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yup",
                    "score": 5,
                    "author": "YupYupGood"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there 'New Game +' on the other side?",
            "score": 406,
            "author": "CompetitiveChance895",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sure hope so",
                    "score": 281,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If there is a new game after then mine will likely be The Floor Is Lava",
                            "score": 46,
                            "author": "FisterRobotOh",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah you get to keep all the stds from the first run",
                            "score": 7,
                            "author": "this_will_go_poorly",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh Bojack, there is no other side. This is it.",
                    "score": 105,
                    "author": "Stigona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God, that sent me for six. What a great show, what a horrifying premise.",
                            "score": 36,
                            "author": "Marsawd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah, it messed me up lol",
                                    "score": 10,
                                    "author": "Stigona",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[A view halfway down](https://youtu.be/u1_EBSlnDlU), poem will always give me chills. That whole episode in general gives me chills and existential dread.",
                            "score": 14,
                            "author": "dre224",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for sharing. Might finally get around to watching this.",
                                    "score": 6,
                                    "author": "ImTrash_NowBurnMe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "First season is a bit mediocre, but it sets up some good stuff and season 2 onwards gets better and better.",
                                            "score": 3,
                                            "author": "Qetuowryipzcbmxvn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A buddy of mine told me last night he started Bojack after years of me recommending it, he said he was around episode 9 of the first season and planned to finish the season last night. When I finish work I'm gonna ask him how he enjoyed the season finalé",
                                                    "score": 3,
                                                    "author": "A_Generic_Canadian"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is it...terrifying?",
                            "score": 3,
                            "author": "brother_of_menelaus"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly what I thought",
                            "score": 2,
                            "author": "ArtbyLoyal"
                        },
                        {
                            "level": 2,
                            "comment": "I watched that episode while tripping HARD on acid and it genuinely fucked me up and had me shaking and bawling. It felt like a hole was near my chest and swallowing me and expanding throughout my whole body and it was just gone as the episode ended on the flatline. It’s like I was dying inside with Bojack.",
                            "score": 2,
                            "author": "Bradythenarwhal"
                        },
                        {
                            "level": 2,
                            "comment": "Damnit you beat me to it",
                            "score": 2,
                            "author": "R3adyplay3rone"
                        },
                        {
                            "level": 2,
                            "comment": "I went to the comments to see if anyone else was reminded of that. \n\nMy favorite show",
                            "score": 2,
                            "author": "lookingup9"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly great through and through",
                                    "score": 3,
                                    "author": "Stigona"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh, now that’s a good idea. 31 year old me starting all over again.",
                    "score": 14,
                    "author": "dlittlefair1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if you already have been restarting several times and this life was your last chance to do it right but you screwed it up?",
                            "score": 14,
                            "author": "reallyserious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jesus. I wasn’t prepared for a mental breakdown. It would be classic me to mess it up more than once!",
                                    "score": 8,
                                    "author": "dlittlefair1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No.",
                    "score": 8,
                    "author": "reallyserious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good.",
                            "score": 9,
                            "author": "Carburetors_are_evil"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Inspired by the movie soul?",
            "score": 296,
            "author": "niko_de_gallo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotta be",
                    "score": 91,
                    "author": "GundamThigh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Place of power...",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 16,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Damn you're ugly",
                                            "score": 6,
                                            "author": "drgigantor"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The great beyond",
                                    "score": 7,
                                    "author": "GundamThigh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*...the count's off...*",
                                            "score": 6,
                                            "author": "EpicLegendX",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's Terrytime!",
                                                    "score": 3,
                                                    "author": "zxain",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I definitely see the connection but the whole “you died but it turns out it was just a game/simulation” idea has been around for quite awhile.\n\n\nThe stars in the doorway definitely remind me of Soul though.",
                    "score": 17,
                    "author": "Accer_sc2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it’s the doorway itself that makes it seem like Soul. Just watched the movie last night, the doorways in the movie look the exact same with the blue outline appearing in the air, except squareish instead of oval.",
                            "score": 8,
                            "author": "MiniCorgi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly what I thought",
                    "score": 30,
                    "author": "Marina_2000"
                },
                {
                    "level": 1,
                    "comment": "Probably more Bojack Horseman",
                    "score": 24,
                    "author": "Blatblatblat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My first thought was Bojack as well, Possibly both!",
                            "score": 6,
                            "author": "TryEasySlice"
                        },
                        {
                            "level": 2,
                            "comment": "My first thought was Bojack, followed immediately by Soul.",
                            "score": 4,
                            "author": "velociraptorjax"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shake your Phone slightly. Or am i the only one to see the middlepart moving?",
            "score": 200,
            "author": "c0nstantfailure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, it's weirds me out. Still love the picture but the void space seems unstable.",
                    "score": 62,
                    "author": "xero_art",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here, had to check if it was a gif or pic.",
                            "score": 24,
                            "author": "HMS_Shorthanded"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It happens with [images with a black blob in the middle](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQIwj90nAsY8XzgDsZi7ueNC29jYV-IYNqwWw&amp;usqp=CAU). Also try moving it closer to your face back and forth.",
                    "score": 49,
                    "author": "JawnF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "whoa thats sick, i notice it a lot more in this picture too",
                            "score": 13,
                            "author": "Fezem"
                        },
                        {
                            "level": 2,
                            "comment": "Wow moving it toward my face and back was really trippy. Like a 3D effect.",
                            "score": 5,
                            "author": "Aging_Shower"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It made me stop scrolling.",
                    "score": 12,
                    "author": "AllergicToStabWounds"
                },
                {
                    "level": 1,
                    "comment": "Thank God. For a second I thought I was too high.",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "THE VOID...jiggles?",
                    "score": 3,
                    "author": "GENITAL_MUTILATOR"
                },
                {
                    "level": 1,
                    "comment": "Yeah it moves for me too.",
                    "score": 3,
                    "author": "StarWaas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2/10 would not recommend. Fun at first but gets increasingly depressing and needlessly difficult early on. No replay value.",
            "score": 64,
            "author": "Misery_Forever",
            "replies": [
                {
                    "level": 1,
                    "comment": "First 18 years are a trial, then it’s pay to win",
                    "score": 53,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% painthrough",
                            "score": 6,
                            "author": "Valerica-D4C"
                        },
                        {
                            "level": 2,
                            "comment": "18?? I only got 14 dammit.",
                            "score": 4,
                            "author": "W0mbatJuice",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Narrator “But it, in fact, wasn’t the end. But rather the beginning of something much much bigger..”",
            "score": 40,
            "author": "CannabisPrime2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! Thank you for that",
                    "score": 8,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its always great to see a poster (let a lone someone posting OC) being interactive with their feedback/comments. Great post dude, from your art to your interaction here.",
                            "score": 3,
                            "author": "threebottleopeners",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of the ending of Bojack horseman a little. Beautiful picture",
            "score": 170,
            "author": "YaboiCAPYBARA",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s actually a bit of the inspiration, I still get chills every time I think about it",
                    "score": 99,
                    "author": "michaelzrk"
                },
                {
                    "level": 1,
                    "comment": "Oh bojack there’s nothing else",
                    "score": 6,
                    "author": "Electromass"
                },
                {
                    "level": 1,
                    "comment": "Also the good place, both shows give nihilistic vibes",
                    "score": 18,
                    "author": "Flashsouls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Imo those shows have such different vibes. &gt;!one ends with your good will going to join the world when you're ready, and the other ends in nothing. Just nothing. Same door though.!&lt;",
                            "score": 31,
                            "author": "chuff3r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly! It’s on how do you wanna end things, it is your control within your universe",
                                    "score": 13,
                                    "author": "michaelzrk"
                                },
                                {
                                    "level": 3,
                                    "comment": "Crazy how they both ended within a day of each other. I'm glad I saw The Good Place finale second.",
                                    "score": 9,
                                    "author": "kranple",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me too. Though I think Bojack is a far better TV show, I've never been happier watching a show end than with The Good Place. It was just perfect.",
                                            "score": 3,
                                            "author": "chuff3r"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And thank you so much",
                    "score": 26,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“See you on the other side,” “Oh, BoJack, no. There is no other side. This is it.”",
            "score": 40,
            "author": "Lord_of_Barrington",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got chills from your comment and every time I think back to that scene!",
                    "score": 12,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Don't stop dancing. Don't stop dancing...\"\n\nGreat piece, it reminds me of when I was a child and loved to stare at neon lights, but in a darker version!",
            "score": 25,
            "author": "Angelica-Reveries"
        },
        {
            "level": 0,
            "comment": "Reminds me of The Good Place",
            "score": 20,
            "author": "Volkor3_16",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you care to elaborate on that? I’m actually interested in how",
                    "score": 3,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Spoiler Alert* the show if you're not familiar follows a few peoples existence in the afterlife. Its a long story but by the end they manage to make their way to a heavenly existence. But they also realize over the course of whats probably thousands of years that eternity loses its allure since humanity often defines ourselves by what we do with our limited time. So they decide that there is a doorway that they can walk through that disperses their souls across the cosmos once they feel at peace with ending their existence. Its just small natural archway made out of tree roots but in essence it is the same idea as the image here. Walking through \"into\" the end.",
                            "score": 13,
                            "author": "Volkor3_16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That sounds really fucking nice and most of my thoughts were very close to this while making my art piece! Thank you for sharing this :))",
                                    "score": 7,
                                    "author": "michaelzrk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely! The show, for being a comedy, really delves into meaning of existence and the philosophy of an afterlife and eternity. Really enjoyed the show, and your artwork.",
                                            "score": 5,
                                            "author": "Volkor3_16",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "WHAT IS THIS 3D LOOKING MAGNIFICENT THING.",
            "score": 25,
            "author": "amanxyz13"
        },
        {
            "level": 0,
            "comment": "‘There is no other side, this is it.’",
            "score": 9,
            "author": "Rurgle"
        },
        {
            "level": 0,
            "comment": "I’ve been seeing this in my dreams for a few months. Except it’s blindly white and every time I turn and try to escape, it screams and engulfs everything.",
            "score": 43,
            "author": "Shadymoogle",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s beautiful and terrifying at the same time",
                    "score": 34,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll agree to terrifying. Seeing your art triggered the memory of the dream. Very surreal seeing it in real life, fantastic piece by the way.",
                            "score": 14,
                            "author": "Shadymoogle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much! \n\nI hope your dreams become better btw",
                                    "score": 8,
                                    "author": "michaelzrk",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Like this bit from Soul?](https://i0.wp.com/icantunseethatmovie.com/wp-content/uploads/2020/03/Soul_StairwayToHeaven.jpg?fit=2557%2C1074&amp;ssl=1)",
                    "score": 5,
                    "author": "Spectacularity",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I get one without texts for background?",
            "score": 11,
            "author": "TheHaterBoss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dm me",
                    "score": 6,
                    "author": "michaelzrk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not suicidal or anything but sometimes I wouldn’t mind taking a dive through that portal",
            "score": 8,
            "author": "Filthy_Chops",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to being a human",
                    "score": 3,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know what feeling I’m getting from this it’s a mix of sad and wonder it looks awesome",
            "score": 7,
            "author": "joshua-albino",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s my intention! I was having an existential crisis and feeling very inspired by the beauty of the universe and our history",
                    "score": 5,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m having one now and I’m not sure if it helps or not.",
                            "score": 3,
                            "author": "Zedekiah117",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’ll be okay",
                                    "score": 5,
                                    "author": "michaelzrk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God, this horrfies me. Like imagine you see this after a great night out as you're walking home. You try to go around it and it is like a solid wall where it looks like you can walk. And when you try to turn around, it just pushes you back towards it. Fuckin eh.",
            "score": 9,
            "author": "MoSqueezin",
            "replies": [
                {
                    "level": 1,
                    "comment": "That should be a movie!!",
                    "score": 3,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this looks like an iliwys era the 1975 song artwork",
            "score": 5,
            "author": "the1975hannah"
        },
        {
            "level": 0,
            "comment": "Reminds me of the ending of Scott pilgrim  where they go into the sub space",
            "score": 4,
            "author": "realMouse_Potato"
        },
        {
            "level": 0,
            "comment": "Do I get to see credits once i step through?",
            "score": 7,
            "author": "jeerabiscuit"
        },
        {
            "level": 0,
            "comment": "Feels like something out of “Ready Player One”",
            "score": 6,
            "author": "Fuzzy_Muscle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you jiggle your phone it gives it a 3d illusion of depth to the void, cause the stars seem to be moving separately from the street.",
            "score": 5,
            "author": "B00NIE",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve never noticed that, thanks for pointing that out!",
                    "score": 2,
                    "author": "michaelzrk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really enjoy this. Feel like it fits me somehow",
            "score": 5,
            "author": "jakedangler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I know the feeling man",
                    "score": 3,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't...stop...dancing...\n\n\nIs what this made me think of. Amazing work.",
            "score": 3,
            "author": "rubyspicer"
        },
        {
            "level": 0,
            "comment": "This is giving me some serious bojack vibes.",
            "score": 3,
            "author": "SerpentineCurio",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was the inspiration, the last two episodes really hit me on another level",
                    "score": 2,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Episode in question literally left me shaking. I know exactly what you mean. Top notch art, hope to see more!",
                            "score": 3,
                            "author": "SerpentineCurio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know what you mean, I always get chills. Thanks a lot, I’ll try my best",
                                    "score": 3,
                                    "author": "michaelzrk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The View From Halfway Down\n\nThe weak breeze whispers nothing\n\nThe water screams sublime\n\nHis feet shift, teeter-totter\n\nDeep breath, stand back, it’s time\n\nToes untouch the overpass\n\nSoon he’s water bound\n\nEyes locked shut but peek to see\n\nThe view from halfway down\n\nA little wind, a summer sun\n\nA river rich and regal\n\nA flood of fond endorphins\n\nBrings a calm that knows no equal\n\nYou’re flying now\n\nYou see things much more clear\n\nThan from the ground\n\nIt’s all okay, or it would be\n\nWere you not now halfway down\n\nThrash to break from gravity\n\nWhat now could slow the drop\n\nAll I’d give for toes to touch\n\nThe safety back at top\n\nBut this is it, the deed is done\n\nSilence drowns the sound\n\nBefore I leaped I should’ve seen\n\nThe view from halfway down\n\nI really should’ve thought about\n\nThe view from halfway down\n\nI wish I could’ve known about\n\nThe view from halfway down.\n\nEdit: Love this picture a lot OP",
            "score": 3,
            "author": "maxnotcharles",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is so beautiful! Thanks for sharing",
                    "score": 2,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it... terrifying? \n\nNo, I don’t think so.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is that the same street where mr bean landed?",
            "score": 3,
            "author": "FreshOfADrill",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ll guess I’ll see you on the other side",
            "score": 3,
            "author": "mooshy_201"
        },
        {
            "level": 0,
            "comment": "Later Nerds 🏃‍♂️🏃‍♂️🏃‍♂️🏃‍♂️",
            "score": 3,
            "author": "Ferny421",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This could happen in Alice in Borderland in the next season",
            "score": 5,
            "author": "Jordiscu7"
        },
        {
            "level": 0,
            "comment": "Reminds me of the portals in Quake 1. Excellent work!",
            "score": 5,
            "author": "_jordammit_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Seems like something out of Alice in Borderland",
            "score": 3,
            "author": "B00TYMASTER"
        },
        {
            "level": 0,
            "comment": "That reminds me of [this photo that I took several years ago](https://i.imgur.com/XFo3PsE.jpg).\n\nThe picture is a close up of an LED light. I was really surprised to see the red ring around the blue light in my picture. I know its really nothing, but this picture always stuck with me, and this image reminded me of it.",
            "score": 3,
            "author": "TweektheGeek",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Should say `INSERT COIN TO CONTINUE`",
            "score": 3,
            "author": "mothzilla"
        },
        {
            "level": 0,
            "comment": "This reminds me of Alice in borderland",
            "score": 3,
            "author": "yazzy1233",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You beat cancer and went back to work at the carpet store??",
            "score": 3,
            "author": "i-like-to-pinch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Booooo",
                    "score": 2,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great stuff. Will you reveal how you did the text to obtain that effect? Thanks!",
            "score": 3,
            "author": "swauzzy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used stroke and outer glow in photoshop with the blending options effects on the text layer :)",
                    "score": 4,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wonderful , thank you!",
                            "score": 5,
                            "author": "swauzzy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of my experiences with mushrooms. In a comforting way.",
            "score": 3,
            "author": "1kingtorulethem",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you experience? I’m actually thinking of trying mushrooms but a bit scared",
                    "score": 3,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve done them three times and each had b a bit different. The first time was the most memorable. Honestly, it felt like I had realized or remembered that I was ancient and had been living in some kind of loop forever. Like that each time I got to the end of my life I started over.\n\nIt felt like I was the entire universe, and I was collapsing in on myself. Everything outside of the room I was in had faded away and I was sinking into the feeling of ancientness, as if I were a forest allowing my leaves to die for winter, not knowing if spring would come. \n\nThen things changed. And I was “reborn” so to speak. And it made me feel as though I had at one point been every mythological figure of greatness in history. Hercules, Zeus, Odin. Those kind. And showed me how much I had been failing myself and those around me in life, and how much potential was inside of me to be the man that I can be. It gave me the courage to rely on faith and take some leaps that I’d been avoiding. \n\nIt can be a bit daunting but they have been a very very introspective experience for me and the things I experienced that first time will stick with me forever. I’d give them a try.",
                            "score": 3,
                            "author": "1kingtorulethem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That honestly sounds like such a nice experience and a beautiful way to get perspective on the world and on yourself! Thank you so much for sharing this",
                                    "score": 3,
                                    "author": "michaelzrk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely, thanks for sharing your artwork. It speaks to me.",
                                            "score": 3,
                                            "author": "1kingtorulethem",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone watched 'Soul'\n\nVery cool artwork man",
            "score": 3,
            "author": "DopestDopeHead",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would walk into that portal with a quickness. So ready for game over down here; this game has gotten tedious as heck!",
            "score": 3,
            "author": "mission_zer0"
        },
        {
            "level": 0,
            "comment": "I believe in God, and I hope heaven is completely personalized. Like, anything you want to do, you can do. I want to spend eternity just exploring the universe, even if I can't interact with it, endless possibilities abound.",
            "score": 3,
            "author": "ksyoung17"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is amazing. This speaks to me",
            "score": 3,
            "author": "chironxl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is absolutely fantastic. As a huge gamer, I would absolutely hang this over my urn at my funeral.",
            "score": 3,
            "author": "TheUlty05",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Double tap the center of this image and thank me later.",
            "score": 3,
            "author": "MassimoMok"
        },
        {
            "level": 0,
            "comment": "I’d never end my own life, but I would go through this in a heartbeat",
            "score": 4,
            "author": "anon0002019"
        },
        {
            "level": 0,
            "comment": "I love this! I’m pretty new to digital artwork, how does one go about doing this!",
            "score": 2,
            "author": "gisellegraham133",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! \nI use photoshop and Lightroom :)",
                    "score": 2,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty neat. Makes me feel like we’d see\nThis once these full VR movies happen",
            "score": 2,
            "author": "Wiknetti",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be amazing honestly",
                    "score": 2,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm imagining this getting bigger and bigger like the end of level portal in Eat Girl.",
            "score": 2,
            "author": "insertcaffeine"
        },
        {
            "level": 0,
            "comment": "Hmm...gives me Red Dwarf:Better Than Life vibes...",
            "score": 2,
            "author": "Digital_Pharmacist"
        },
        {
            "level": 0,
            "comment": "Ender Dragon better be scared",
            "score": 2,
            "author": "Hyrum01"
        },
        {
            "level": 0,
            "comment": "I'd walk through that in a heartbeat",
            "score": 2,
            "author": "DreamInAtmos"
        },
        {
            "level": 0,
            "comment": "Makes me very much want to rewatch Altered Carbon",
            "score": 2,
            "author": "ppardee"
        },
        {
            "level": 0,
            "comment": "This is really nice. Would've been awesome if it looked like a sinkhole or portal that warps the edges inward a bit. What do you think? \n\nMad stuff though. Very inspiring.",
            "score": 2,
            "author": "sreek4r",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is brilliant, I'll be using it as my new back background.",
            "score": 2,
            "author": "1DrinkAnd1KnowThings",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m glad you liked it! Thank you",
                    "score": 2,
                    "author": "michaelzrk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oof. That's pretty hardcore.",
            "score": 2,
            "author": "p_dimi"
        },
        {
            "level": 0,
            "comment": "I love the concept, and great execution.",
            "score": 2,
            "author": "treesntreesntrees",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It makes my eyes trip out I love it!!!",
            "score": 2,
            "author": "Hesnotyourfather_Iam"
        },
        {
            "level": 0,
            "comment": "There's a Tolkien quote on a wall in Edinburgh in red neon...This reminds me of that in a good way",
            "score": 2,
            "author": "nimnum"
        },
        {
            "level": 0,
            "comment": "I like how if I shake my phone while looking at the void, the stars appear to wiggle in the oval. Very cool!",
            "score": 2,
            "author": "GoodOldeGreg"
        },
        {
            "level": 0,
            "comment": "Existential crisis in 3..2..1..",
            "score": 2,
            "author": "jmesma-illustration",
            "replies": [
                {
                    "level": 1,
                    "comment": "How you think this came to mind? :D",
                    "score": 2,
                    "author": "michaelzrk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where the fuck is the skip the game button",
            "score": 2,
            "author": "Yurgburg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When you step through you enter the Beatsaber realm",
            "score": 2,
            "author": "The_Lemon27"
        },
        {
            "level": 0,
            "comment": "The only thing I noticed out of place is the blu light of the post, on the top left corner. The shine is white on the floor",
            "score": 2,
            "author": "Carrillozea",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s the red light from the title, I mixed it with blue and it gave that weird whitish exposure. Very nice eye for detail, thank you for pointing that",
                    "score": 2,
                    "author": "michaelzrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love it btw",
                            "score": 2,
                            "author": "Carrillozea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you kind stranger!",
                                    "score": 2,
                                    "author": "michaelzrk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd better get a fucking thank you.",
            "score": 2,
            "author": "Imhaveapoosy"
        },
        {
            "level": 0,
            "comment": "Reminds me of the movie Nerve. Cool.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You get some nice movement illusion from the stars when you slowly shake your phone!",
            "score": 2,
            "author": "Lucky_Bacon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would read this book. I mean, the art is lovely, but I am obsessed with the idea now.",
            "score": 2,
            "author": "bohdel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Makes me want to commit suicide.",
            "score": 2,
            "author": "Admirable-Spinach"
        },
        {
            "level": 0,
            "comment": "I actually had a dream I died recently, it was terrifying",
            "score": 2,
            "author": "Super_NK"
        }
    ]
}