{
    "id": "nbfh6x",
    "score": 78509,
    "title": "Resistance, me, digital, 2021",
    "author": "KymmaLabeija",
    "date": 1620908906.0,
    "url": "https://www.reddit.com/r/Art/comments/nbfh6x",
    "media_urls": [
        "https://i.redd.it/c2uwxfvusvy61.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Immovable Object vs. Exasparated Owner",
            "score": 2880,
            "author": "lorelleii",
            "replies": [
                {
                    "level": 1,
                    "comment": "And this doesn't apply just to dogs \n\nMy cats have tried to lie there like they're dead and dying and will meow cry not wanting to leave the lawn \n\nBUT IT'S TIME TO GO HOME MUNCHKIN, DO YOU NOT WANT FOOD",
                    "score": 248,
                    "author": "itoldthetruth_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And my cat does this if you try to make him the leave house at all ever. And if you successfully get him outside... you're not going to enjoy yourself until tomorrow 🙈",
                            "score": 57,
                            "author": "TurquoiseTurtle0022",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;And this doesn't apply just to dogs \n\nObjection. Shibas are cats.",
                            "score": 26,
                            "author": "tiefling_sorceress"
                        },
                        {
                            "level": 2,
                            "comment": "I can’t keep up with my cat when he’s on the leash",
                            "score": 6,
                            "author": "dat2ndRoundPickdoh",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This a perfectly relatable comment!",
                    "score": 212,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm getting annoyed by just looking at that shit-eating-grin 😂",
                            "score": 144,
                            "author": "lorelleii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My doge enjoys goose poop, so I too loathe his shit-eating grin...especially after the fact.",
                                    "score": 61,
                                    "author": "subtlelight"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s why I like small dogs. I just pick them up and off we go. \n\nBut I’ve realized picking up my terrier agitates her breathing/throat and she starts coughing when I put her down. It’s sad because she has arthritis, so when it flares up I have to pick her up sometimes.\n\nCBD for your dogs is great btw! For arthritis, growths, chron’s, etc...",
                            "score": 37,
                            "author": "-p-a-b-l-o-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can you get her a shirt with handles on the top?",
                                    "score": 13,
                                    "author": "Saucermote",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m trying to think of the logistics of that. I don’t believe it would be any different than how I currently pick her up and carry her. I already use a harness instead of a leash.",
                                            "score": 7,
                                            "author": "-p-a-b-l-o-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not endorsing this product, it is just one of the random amazon searches: \n\n[https://www.amazon.com/OneTigris-Tactical-Harness-Durable-Vertical/dp/B07MGZRQXZ/](https://www.amazon.com/OneTigris-Tactical-Harness-Durable-Vertical/dp/B07MGZRQXZ/)\n\nI'm sure they (the proverbial they) make many sizes and styles covering different areas that would put more or less pressure on areas to help with anxiety/agitation, or pressure on her chest/throat.\n\nJust an idea.",
                                                    "score": 5,
                                                    "author": "Saucermote"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I was gripping her throat with one hand and lifting her up I thought that was the right way.",
                                            "score": 3,
                                            "author": "-p-a-b-l-o-"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol",
                    "score": 0,
                    "author": "Megabyte7637"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never wanted to squish a piece of art so badly. He’s adorable",
            "score": 895,
            "author": "Hypothermal_Confetti",
            "replies": [
                {
                    "level": 1,
                    "comment": "We gotta get this on a pillowcase asap",
                    "score": 112,
                    "author": "OrangeCreeper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YES. Now I really want this to be on a pillow case.",
                            "score": 15,
                            "author": "Hypothermal_Confetti"
                        },
                        {
                            "level": 2,
                            "comment": "Body pillowcase",
                            "score": 26,
                            "author": "mynoduesp"
                        },
                        {
                            "level": 2,
                            "comment": "Here's a sticker I got a friend with a similar dog hahaha\n\nhttps://shop-bside-label.com/?pid=125416700",
                            "score": 3,
                            "author": "ululant"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ngl would hang this on my wall",
                    "score": 7,
                    "author": "ManOrReddit-man"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks so happily defiant. I love him!",
            "score": 527,
            "author": "iherdyou",
            "replies": [
                {
                    "level": 1,
                    "comment": "Defiant doge",
                    "score": 73,
                    "author": "James_Cartwright_7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was me when the security came to drag me back to the hospital mid fried chicken escape attempt. I love it!",
            "score": 362,
            "author": "Cunninglingmiss",
            "replies": [
                {
                    "level": 1,
                    "comment": "what",
                    "score": 158,
                    "author": "diego2134",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He said \"This was me when the security came to drag me back to the hospital mid fried chicken escape attempt. I love it!\"",
                            "score": 140,
                            "author": "Homey_Dont_Play_That",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What?",
                                    "score": 44,
                                    "author": "seditive26114",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This was him when the security came to drag him back to the hospital mid fried chicken escape attempt. (He loves it!)",
                                            "score": 63,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With a name like cunning ling miss, I have assumptions about the gender of the person who posted it.",
                                                    "score": 11,
                                                    "author": "setibeings",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What it it’s miss like hit or miss",
                                                            "score": 3,
                                                            "author": "NeonMoment",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I never said what my assumptions are.",
                                                                    "score": 0,
                                                                    "author": "setibeings"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What?",
                                                    "score": 23,
                                                    "author": "gravv",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "#This was him when the security came to drag him back to the hospital mid fried chicken escape attempt. He loved it!",
                                                            "score": 42,
                                                            "author": "OnionOnion-",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh",
                                                                    "score": 24,
                                                                    "author": "thenickelfish"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Somehow reading it a second time made it make sense",
                                    "score": 9,
                                    "author": "stjakey"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude escaped the hospital to get fried chicken.",
                            "score": 28,
                            "author": "sweBers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably psych ward. Not sure of any other ward where security is involved. Been in one of those hellscapes myself, I preferred jail.",
                                    "score": 26,
                                    "author": "Deep_Grady",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Orthopedics ward. I did jump off a bridge and break my leg though. The security in NZ hospitals are pretty much the only ones who'll actually listen to you and treat you like a human. But even they have their orders. Food in jail is nicer than hospital",
                                            "score": 24,
                                            "author": "Cunninglingmiss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The local VA hospital actually has good food. Had fried chicken and Mac and cheese",
                                                    "score": 2,
                                                    "author": "Prowindowlicker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In nz, it's made weeks/months in advance from frozen ingredients by an external catering company. Refrozen brought in and reheated again. It's nutritionally and portionally inadequate. because our health system is underfunded due to boomers who exploited a housing system and fucked the economy. We can't sue doctors for malpractice or anyone for that matter (If I lived in the states I'd literally be a millionaire, instead I'm nearly homeless). So imagine roast chicken so dry and hard it physically hurts to eat. You don't actually digest it either, it clogs you up worse than the opiates do. The veges are so over cooked they're watery cardboard tasting mush. And the only good sandwich is the tuna mayo sandwich, Which still tastes off.",
                                                            "score": 2,
                                                            "author": "Cunninglingmiss",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;Have you ever went over a friend's house to eat\nAnd the food just ain't no good? I mean the macaroni's soggy, the peas are mushed And the chicken tastes like wood. So you try to play it off like you think you can (By saying that you're full)\nAnd then your friend says, \"Mama, he's just being polite! He ain't finished, uh-uh, that's bull\"\n\n&gt;So your heart starts pumping and you think of a lie and you say that you already ate and your friend says, \"Man, there's plenty of food\"\n\n&gt;So you pile some more on your plate\nBut while the stinky food's steaming, your mind starts to dreaming\nOf the moment that it's time to leave\nAnd then you look at your plate and your chicken's slowly rotting\nInto something that looks like cheese\nOh, so you say \"that's it, I got to leave this place I don't care what these people think I'm just sitting here making myself nauseous With this ugly food that stinks.\"\n\n&gt;Oh, so you bust out the door while it's still closed (Still sick from the food you ate) And then you run to the store for quick relief From a bottle of Kaopectate\nAnd then you call your friend a two weeks later To see how he has been\nAnd he says \"I understand about the food Baby bubba, but we're still friends\"\n\nRapper's Delight - The Sugarhill Gang",
                                                                    "score": 3,
                                                                    "author": "drvondoctor"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wooooow you too?",
                    "score": 4,
                    "author": "shiny-spleen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMG, SOMEONE SHOW ME THE ORIGINAL PLS ,THE ONE HE DREW FROM PLS PLS PLS",
            "score": 264,
            "author": "AVerySimpleRubbyDuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://imgur.com/dUwwWqB",
                    "score": 432,
                    "author": "InappropriateAaron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking the eyes in the art looked a bit too beady and \"derpy\", but now I've seen this photo, nope they're spot on.",
                            "score": 64,
                            "author": "Paulpaps"
                        },
                        {
                            "level": 2,
                            "comment": "You know, I’m always amazed that when this pic comes back up no one comments on the smaller doge figurine at its feet with the same skwershed features.  \n\n\nWhat’s up with that thing?",
                            "score": 32,
                            "author": "poxxy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw the baby Doge. \n\nI love both doges! \n\nI want to hodl those doges!",
                                    "score": 4,
                                    "author": "Smokeybearvii"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "TY!",
                            "score": 41,
                            "author": "AVerySimpleRubbyDuck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn this was funny as a drawing but sad as hell as a pic.",
                                    "score": 15,
                                    "author": "InYoCabezaWitNoChasa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that dog is pretty overweight",
                                            "score": 10,
                                            "author": "Dolormight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah that's real sad *Looks in mirror*",
                                                    "score": 19,
                                                    "author": "wing3d",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lmaooo I feel that, but feel so bad for over weight animals.",
                                                            "score": 1,
                                                            "author": "Dolormight"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well they are at least attempting to walk it so it's not all that bad.",
                                                    "score": 2,
                                                    "author": "kaz-amars"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That is not a healthy dog",
                            "score": 14,
                            "author": "soggydave2113"
                        },
                        {
                            "level": 2,
                            "comment": "What a lovable chonk",
                            "score": 5,
                            "author": "bearmuffin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seems like linking doesn't work, the model is 柴犬ハナ",
                    "score": 15,
                    "author": "KymmaLabeija",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shiba inu Hana? This cute chunk is named Hana? That's adorable.  She's so cute!",
                            "score": 4,
                            "author": "LittlestEcho"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great! I would recommend adjusting the shadow on the leash, and have more of the leash be in sunlight, instead of having the shadow happen at the same time the dogs shadow happens, the leash is higher so it wouldn’t be affected by the dogs shadow the same manner the ground is. \nBut it’s not a photo realistic painting so it’s no big deal. \n100/100, thanks the chuckle",
            "score": 55,
            "author": "chapmanator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for this criticism, I've seen a lot of comments be confused by the leash but none explaining how to fix it. This really helps, and thank you for the nice compliment! :D",
                    "score": 40,
                    "author": "KymmaLabeija",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not a painter as I’ve always found it very difficult to paint/draw something from scratch. I do enjoy sketching buildings but that’s easy because I can just draw what I see lol. Creating something from scratch I find challenging, because it’s hard to figure out how certain things behave, in this case, shadows. \nBut like I described earlier, since the leash I higher than the ground it will be less influenced by the dogs shadow. Maybe see if you can reduce the shadow maybe to the midpoint of the leash, or even more so maybe 60% is in the sun and the 40% closer to the dog is in shadow. That might help remove the confusion some people see when looking at it.",
                            "score": 8,
                            "author": "chapmanator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You have mistaken. That’s the shiba’s personality casting its shadow on the leash.",
                    "score": 2,
                    "author": "icohgnito",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All images of shibu inus I have seen are 80% doge and 20% resisting a leash while sitting down\n\nIt's kinda unsettling how many I have seen by now",
            "score": 357,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a new shiba owner, 20% of her personality is resisting a leash while sitting down.\n\n[Doge tax](https://imgur.com/a/EO1vpgf).",
                    "score": 77,
                    "author": "middleliving",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;As a new ~~shiba owner~~ person owned by a shibe, 20% of her personality is resisting a leash while sitting down.\n\nFTFY.\n\nAlso, here's a pic of MY [owner](http://imgur.com/gallery/wlaiNGO) being crabby and cute!",
                            "score": 11,
                            "author": "jmxdf"
                        },
                        {
                            "level": 2,
                            "comment": "wow",
                            "score": 4,
                            "author": "MoffKalast"
                        },
                        {
                            "level": 2,
                            "comment": "i think the factory messed up the paintjob on this boi",
                            "score": 10,
                            "author": "ewanh19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " [They can run out of ink too](https://i.imgur.com/WwIH0tx.jpg)",
                                    "score": 34,
                                    "author": "Chaytup",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "we learned something from this, they are dipped ears first.",
                                            "score": 15,
                                            "author": "ewanh19"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://i.imgur.com/9VXGLK1.jpg",
                    "score": 133,
                    "author": "TheDrowsyArcher",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the image.",
                            "score": 28,
                            "author": "Antonykun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, his name is Genji - my long haired Shiba Inu",
                                    "score": 17,
                                    "author": "TheDrowsyArcher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*your* doge? Ahhhhhhh you’re a lucky thing",
                                            "score": 3,
                                            "author": "Picturesquesheep"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wow I had no idea they had long haired varieties and I thought I knew a lot about them! Here’s mine for dog tax  https://i.imgur.com/5hfWbld.jpg https://i.imgur.com/0b9JQ33.jpg",
                                            "score": 3,
                                            "author": "Geta211"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[what in tarnation!?](https://dm.reddit.com/r/whatintarnation/)",
                            "score": 18,
                            "author": "Lightfooted",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My current wallpaper, I forgot where I got it https://i.imgur.com/sDUWNzZ.jpg",
                                    "score": 13,
                                    "author": "BorgClown"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Howdy",
                            "score": 4,
                            "author": "Volvaux"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks, this makes my day better",
                            "score": 4,
                            "author": "andre5913"
                        },
                        {
                            "level": 2,
                            "comment": "That’s a real nice hat",
                            "score": 3,
                            "author": "sammamthrow"
                        },
                        {
                            "level": 2,
                            "comment": "To everyone who sees the above image, you really gonna scroll by without saying “howdy, pardner”?",
                            "score": 3,
                            "author": "mdgraller"
                        },
                        {
                            "level": 2,
                            "comment": "what in canine evagation",
                            "score": 2,
                            "author": "skeled0ll"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You didn't ask for more shiba pictures but I have them and must provide them \n\n[Kit chillin after pulling the leash](https://i.imgur.com/7CF9EL4.jpg)\n\n[Kit pretending he's a good boi](https://i.imgur.com/5dQi1HA.jpg)",
                    "score": 8,
                    "author": "MotoKittenMeow"
                },
                {
                    "level": 1,
                    "comment": "Don’t you like it though?",
                    "score": 20,
                    "author": "Natannan15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’d be a great illustrator for children’s books. If you wanted to, of course.",
            "score": 19,
            "author": "Rabbitary",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's actually a dream of mine, I've been working on one for some time but never got around to finishing it :)",
                    "score": 21,
                    "author": "KymmaLabeija"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What kind of currency is this?",
            "score": 22,
            "author": "Cosgnosis_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moon currency",
                    "score": 10,
                    "author": "balancetheuniverse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of the rocketing variety",
                            "score": 6,
                            "author": "Moo_Shim"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dogecoin",
                    "score": 4,
                    "author": "NopalGrande"
                },
                {
                    "level": 1,
                    "comment": "It's a POS currency- Proof of Sit",
                    "score": 0,
                    "author": "Flexorrium"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Are you threatening me, master Jedi?”",
            "score": 6,
            "author": "JankyDroid"
        },
        {
            "level": 0,
            "comment": "Looks pretty cool! I love the perspective",
            "score": 17,
            "author": "Place0k"
        },
        {
            "level": 0,
            "comment": "*anime villian voice*\n\nHa ha ha \n\n私は犬です\n(I am dog) \n\n*smirks*\n\n犬を動かすことはできません\n(You cannot move dog)",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As a corgi owner I feel attacked.",
            "score": 43,
            "author": "Chemical_Favors",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! Sometimes my corgi just decides to do this on his walks for no reason... I'm not ever sure what he is trying to accomplish lol",
                    "score": 34,
                    "author": "OrnLu528",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My guy will play fetch for hours. We're talking full on sprints back and forth. Try to go for a leisurely stroll, and this is what he does after about a quarter mile. Resumes walking normally when he knows we're headed back towards home. Is this a corgi thing? He just doesn't care for walks.",
                            "score": 25,
                            "author": "HurkyJerkyDancer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gotta be a small dog thing. My Sheltie does the same thing",
                                    "score": 9,
                                    "author": "echisholm",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My corgi does the exact same thing. I just pull her along a little bit by her harness strap. She eventually caves and continues walking lol",
                                    "score": 5,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "My corgi loves walks (did a 4-hour hike with him recently) but he'll drop to the ground when he knows I'm taking him back home.",
                                    "score": 3,
                                    "author": "Hoenirson",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m a new corgi owner so I can’t say for sure, but I’ve read that they like having jobs to do and are pretty intelligent so if they don’t see the point in what they are doing, they can get stubborn. So fetch to them is better because there is a clear job (go get it, bring it back), where as walking to them seems to serve no purpose and after a little while/after going too far they will start to resist and get difficult. Would certainly explain why your corgi likes to play fetch over walking.",
                                    "score": 2,
                                    "author": "grachi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Corgis and shibas look so similar, it’s pretty neat. \n\nJust ran into a Corgi the other day walking my shiba, they look like slightly distorted versions of each other!",
                    "score": 7,
                    "author": "Slggyqo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The doggo looks so derpy and I love it!",
            "score": 5,
            "author": "MoonieSucksAtArt"
        },
        {
            "level": 0,
            "comment": "One of the few posts from art I have saved. Your art is the prettiest art of all art. \n\nPost this in r/dogecoin. They'll love it.",
            "score": 28,
            "author": "Ermahgerd1"
        },
        {
            "level": 0,
            "comment": "That is a cute doggo you have drawn there good sir",
            "score": 4,
            "author": "Dank-bonker69420"
        },
        {
            "level": 0,
            "comment": "What software did you use for this?",
            "score": 4,
            "author": "aaronrk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used procreate!",
                    "score": 5,
                    "author": "KymmaLabeija",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ":o What brushes did you use? I love the effect you achieved. Well done!",
                            "score": 5,
                            "author": "ekorra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! I use slightly altered versions of the Oriental and Damp brush in the standard procreate painting collection :)",
                                    "score": 3,
                                    "author": "KymmaLabeija",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You captured the smug, stubborn facial expression perfectly!",
            "score": 3,
            "author": "PuzzleheadedFlan188"
        },
        {
            "level": 0,
            "comment": "Absolutely love it. Reminds me of my old boy Buttons.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You can tell by the way the fat folds around his collar that he is only using a fraction of his power in order to resist the tension from the leash",
            "score": 4,
            "author": "Dannymax333"
        },
        {
            "level": 0,
            "comment": "I actually needed this today, thank you!",
            "score": 7,
            "author": "MrTrekk"
        },
        {
            "level": 0,
            "comment": "I rarely comment on art...but damn this made me smile. Great work.",
            "score": 3,
            "author": "Thedeadlypocketbrush"
        },
        {
            "level": 0,
            "comment": "looking at his squashed face makes me so happy ;o;",
            "score": 3,
            "author": "Vertunia"
        },
        {
            "level": 0,
            "comment": "A work of art incomparable in beauty has finally been created.",
            "score": 3,
            "author": "sircheesy"
        },
        {
            "level": 0,
            "comment": "This is so cute i wish i could hug it and squish that chubby boy",
            "score": 6,
            "author": "Kaneki_AlGhoul"
        },
        {
            "level": 0,
            "comment": "No, I'm not going where you want me to go anymore. This is 2021. Who are you to tell me what to do? You don't own me.",
            "score": 2,
            "author": "embership"
        },
        {
            "level": 0,
            "comment": "I just got back from my first day of work this week after a bad anxiety spell kept me home and this has cheered me up no end. Thanks",
            "score": 2,
            "author": "dungeonbitch"
        },
        {
            "level": 0,
            "comment": "I dunno man, his face just reminds me of Evrart from Disco Elysium",
            "score": 2,
            "author": "jer113"
        },
        {
            "level": 0,
            "comment": "This...now *this* bring joy",
            "score": 2,
            "author": "SUDDENLY_VIRGIN"
        },
        {
            "level": 0,
            "comment": "Resistance: Fall of Man's Best Friend",
            "score": 2,
            "author": "CzechzAndBalancez"
        },
        {
            "level": 0,
            "comment": "Woah nice to see you here lol",
            "score": 2,
            "author": "Sherbs_Study"
        },
        {
            "level": 0,
            "comment": "My really slow old dog messes with the house hold, he will wander outside, but won’t come in the house for awhile and the more you ask him the faster his tail wags. He also picks on my wife and will follow her around the house even though she tells him “leave me alone!” And go between her legs and walk around her. And then he asks to go out on the porch to spend time with the cat, but won’t come back in when you ask, you have to wait until he starts barking.",
            "score": 2,
            "author": "Fast-Chemistry-3401"
        },
        {
            "level": 0,
            "comment": "I used to have a 90 lb moose of a dog who would just decide to lay down during a walk. I was in middle school or junior high, so I was just a kid (albeit an unusually large one). You weren't going to drag that anchor very far.",
            "score": 2,
            "author": "Nerdn1"
        },
        {
            "level": 0,
            "comment": "Omg I thought this was r/adorableart for a second! So cute!!!!",
            "score": 2,
            "author": "goodgonegirl1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for leading me to that sub",
                    "score": 2,
                    "author": "Ok_murderer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a source image?\n\n(Edit: OP, your replies are being deleted/hidden, must be linking something that's banned here - can you PM or explain without the link?)",
            "score": 2,
            "author": "King_Jeebus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh right, I did link somewhere. The Shiba is from 柴犬ハナ on tweeter :)",
                    "score": 2,
                    "author": "KymmaLabeija",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have a place to buy prints",
                            "score": 3,
                            "author": "lawtosstoss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not yet but I'm working on opening a shop asap!",
                                    "score": 2,
                                    "author": "KymmaLabeija",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let me know! Would be interested in a print!",
                                            "score": 2,
                                            "author": "whersmacheese"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Please also let me know. I would be interested in a print of this.",
                                            "score": 2,
                                            "author": "saudiaramcoshill",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Any update on the shop?",
                                            "score": 2,
                                            "author": "mrsreinbold",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would love to see it without the reflection",
                    "score": 2,
                    "author": "KristyAmador60"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is it. This is as good as art gets.",
            "score": 2,
            "author": "M_K_L_"
        },
        {
            "level": 0,
            "comment": "me when im get a walk outside",
            "score": 2,
            "author": "Recent_Ad6142"
        },
        {
            "level": 0,
            "comment": "This made me legitimately smile. This is fantastic.",
            "score": 2,
            "author": "marigoldilocks_"
        },
        {
            "level": 0,
            "comment": "much pulling. very painting. such struggle.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My dog sprawls out and drags his nails to create more resistance. He weighs 10lbs. I volunteered at a animal shelter and walked so many pit bulls, German shepherds, Doberman, etc. \n\nMy 10lbs guy is the most challenging dog I've ever walked.",
            "score": 2,
            "author": "SaltRecording9"
        },
        {
            "level": 0,
            "comment": "Is that a leash, or an umbrella, or what? I can't figure it out.",
            "score": 2,
            "author": "Art_vs_MACHINE"
        },
        {
            "level": 0,
            "comment": "Lol my shibe did this all the time when he was a pup. Or would just [lay down wherever when he was done with the walk](https://i.imgur.com/iBV2pyJ.jpg)",
            "score": 2,
            "author": "Brettish"
        },
        {
            "level": 0,
            "comment": "I adore everything about this!  Love the colors, textures, lighting, and of course the endearingly stubborn subject.  :]",
            "score": 2,
            "author": "SluttyGandhi"
        },
        {
            "level": 0,
            "comment": "LITTLE SHITBA!\n\nJust got home from a walk with mine, too relatable.",
            "score": 2,
            "author": "Showercopter"
        },
        {
            "level": 0,
            "comment": "I love this so much hahah, perfect caption and everything",
            "score": 2,
            "author": "Helunky"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah my Shikoku does this too and that picture is the most relatable thing. \nIf she does not want to go that way, she WILL NOT go that way. If she has some urgent sniffing, she WILL NOT move until it is properly sniffed.",
            "score": 2,
            "author": "WitheredGlitter"
        },
        {
            "level": 0,
            "comment": "Beautiful painting\n\nBtw what colours did you use here???",
            "score": 2,
            "author": "incely-fa-boi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My neighbor has a shiba he attempts to walk everyday and this is basically how they look everytime they pass my house.",
            "score": 2,
            "author": "gravityofthesitu"
        },
        {
            "level": 0,
            "comment": " https://i.imgur.com/L3jxnUU.jpg",
            "score": 2,
            "author": "Jerimiah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Deregulate tapioca.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[My corgi is the WORST with this!](https://i.imgur.com/SSWcn5E.jpg)\n\nHe's still a very good boi tho",
            "score": 2,
            "author": "demevalos"
        },
        {
            "level": 0,
            "comment": "Holy crap is that an r/art post that isn't about an astronaut in water?",
            "score": 2,
            "author": "_iamsadrightnow_"
        },
        {
            "level": 0,
            "comment": "OH MY GOD THIS IS AMAZING",
            "score": 2,
            "author": "diswaythrow"
        },
        {
            "level": 0,
            "comment": "I absolutely love that you included the angle of the leash. Love this.",
            "score": 2,
            "author": "judgementforeveryone"
        },
        {
            "level": 0,
            "comment": "How long have you been painting?",
            "score": 2,
            "author": "RiskOfMschf",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuckin love it, good work lad/lady",
            "score": 2,
            "author": "KellyCTargaryen"
        },
        {
            "level": 0,
            "comment": "[All Shibas Are The Same](https://i.imgur.com/nn3lyfu.jpg)",
            "score": 2,
            "author": "tiefling_sorceress"
        },
        {
            "level": 0,
            "comment": "Stop forcing him please, let him eat and roll over the flowers.",
            "score": 2,
            "author": "AlonetoxiCStone"
        },
        {
            "level": 0,
            "comment": "I fucking love this painting and I legit want it",
            "score": 2,
            "author": "Tupiekit"
        },
        {
            "level": 0,
            "comment": "I would love this on a canvas haha",
            "score": 2,
            "author": "Paulie_Bee"
        },
        {
            "level": 0,
            "comment": "OMG KYMMA CONGRATS!! Well deserved attention!!",
            "score": 2,
            "author": "Mouskegamer"
        },
        {
            "level": 0,
            "comment": "Hi, OP! I know nothing about art of any kind. Don't know anything about the forms or techniques, nor can I do it myself. However it's always nice to see art, especially paintings, that are done well. So I decided to look up different subreddits dedicated to art, and checked out their most liked works. And out of all of those masterful pieces of art that I came across, this is my favourite. The title and the face of the dog are super wholesome! The style is nice too. Awesome work :)",
            "score": 2,
            "author": "TheJiggaBoggy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "what kind of dog looks familiar",
            "score": 3,
            "author": "gamingwithvisa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shiba inu.",
                    "score": 7,
                    "author": "neoseafoxx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "can you get me one",
                            "score": 8,
                            "author": "gamingwithvisa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shiba inus are notoriously difficult to train. They are also infamous for their \"shiba scream\" which is the equivalent of a banshee's wail.",
                                    "score": 2,
                                    "author": "ShiroTheHero",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "or would you like to get me one",
                                            "score": 4,
                                            "author": "gamingwithvisa",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My first thought was about the DOGE coin. It'd be more explanatory if the leash had instead of white dashes the dollar symbol $.",
            "score": 4,
            "author": "hukep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not everyone eats crayons and lives led by the hand of others.",
                    "score": 7,
                    "author": "MeowWow_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"People are doing something I'm not doing, they are idiots that can't think for themselves!\"\n\nLmao what",
                            "score": 0,
                            "author": "DoctorCrasierFrane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You crypto noobs are cute.",
                                    "score": 1,
                                    "author": "MeowWow_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Being condescending and dismissive is a great personality trait 👍",
                                            "score": 2,
                                            "author": "DoctorCrasierFrane",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this but it took me a second to see him being pulled by a leash. I thought someone was poking/smushing his face with a stick and he just didn’t mind 😅😂",
            "score": 2,
            "author": "IridescentBlossom21"
        },
        {
            "level": 0,
            "comment": "OP YOU HAD THE CHANCE TO NAME IT *VIVE LA RÉSISTANCE* but you didnt take it",
            "score": 2,
            "author": "juicy_belly"
        },
        {
            "level": 0,
            "comment": "...as a Shiba owner, I’m triggered.",
            "score": 2,
            "author": "Slggyqo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same.  My Shiba did this all the time or just laid down until I gave in and carried her the rest if her walk.\n\nShe was a pain in the ass and my all time favorite dog.  Every day was interesting with her.  I want another Shiba some day when I'm in a situation to own another dog.",
                    "score": 2,
                    "author": "What_Was_I_doi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The perfect work of art doesn't exi....",
            "score": 1,
            "author": "mattdalorian"
        },
        {
            "level": 0,
            "comment": "The pattern on the lead should be little Tesla logos.",
            "score": 1,
            "author": "Triangle_Player"
        },
        {
            "level": 0,
            "comment": "Never thought I would see myself on Reddit",
            "score": 1,
            "author": "CircuitFooijd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can feel this picture, and I love it",
            "score": 1,
            "author": "RakshasaDealer"
        },
        {
            "level": 0,
            "comment": "AAAAHAAHA ITS THE BEST THING EVER CAN I PLEASE USE IT IM JUST GONNA USE IT AS MY PHONE BACKGROUND AAAAH",
            "score": 1,
            "author": "Pikachumain1130"
        },
        {
            "level": 0,
            "comment": "It’s looks like the leash is pushing on the dog instead of pulling on it.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Needs a harness. No more strangling.",
            "score": -1,
            "author": "saminfujisawa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't understand what that green thing is.  My first thought was one of those shock sticks like they use in The Handmaid's Tale.  But maybe it's actually just really bad perspective on a leash?",
            "score": -1,
            "author": "solongandthanks4all",
            "replies": []
        }
    ]
}