{
    "id": "13zz6zp",
    "score": 23,
    "title": "Keto &amp; Antidepressants: Experiences",
    "author": "codguru",
    "date": 1685848474.0,
    "url": "https://www.reddit.com/r/keto/comments/13zz6zp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, r/keto!  \n   \nI hope you're all doing well on your keto journeys. I wanted to start a discussion today about a topic that has been on my mind lately: the combination of antidepressants and the keto diet. I believe it's a topic that many of us might be curious about, and sharing our experiences could be helpful for others in similar situations.  \n   \nPersonally, I had followed the ketogenic diet for several months in the past. I have been taking antidepressants for a while. While I've seen positive changes in my mental health, I've often wondered if incorporating keto would make any difference.  \n   \nSo, I'd love to hear from those of you who have experience with both the keto diet and antidepressants. Here are a few questions to kick off the discussion:  \n   \n1. Have you noticed any specific changes in your mood or mental health since starting the keto diet while taking antidepressants?  \n2. Did you experience any side effects from the combination of the two? If so, how did you manage them?  \n3. Did you consult with your healthcare provider or nutritionist about combining these two approaches? If yes, what advice did they give you?  \n4. Have you found any particular foods or supplements to be beneficial or disadvantageous for maintaining both the ketogenic state and your mental well-being?  \n5. Any tips or suggestions for someone who is considering starting the keto diet while taking antidepressants?  \n   \nOf course, please remember that everyone's experience is unique, and what works for one person may not work for another. This discussion is not meant to replace medical advice but rather to share personal anecdotes and insights.  \n   \nSo, if you've followed the keto diet while taking antidepressants, or if you're currently doing so, I'd love to hear your thoughts! Your experiences and insights could be invaluable to others in our community who are considering a similar path.  \n   \nLet's support each other and foster an open and understanding environment for this discussion. I look forward to hearing from you all!  \n   \n\\[Disclaimer: Always consult with a healthcare professional before making any changes to your medication or diet regimen.\\]",
    "comments": [
        {
            "level": 0,
            "comment": "I don't want to sound like a snake oil salesman, and this is just my personal experience. I'm not saying it'll work for anyone else. I don't think keto will fix everyone's problems. But here's my story. Take it with a grain of salt (for the electrolytes).\n\n\nI had been on Wellbutrin for about 3 years when I started keto 4 months ago, and I was also looking at medication for my ADHD. By the time I saw my psychiatrist (there was a 2 month waiting period), I no longer felt that I needed ADHD meds. As of a couple of weeks ago, I'm completely off Wellbutrin. I discussed going off it with my psychologist and my psychiatrist and they both agreed that it was a good idea.\n\n\nMy mental health has turned around completely since the start of this year and I feel that keto is the most significant factor, though it's not the only thing. At the end of last year I was diagnosed with ADHD and ASD. Having that diagnosis has helped a great deal.\n\n\nKeto had this cascading effect, where improving one thing has led to everything else improving. Keto gave me more energy so I could do the things I had been feeling guilty about not doing. It helped with my brain fog so I could perform better at work. My daughter told me once, \"Dad, you have so much energy! You have even more than me!\" This was a big deal for me because I had always been so tired after work that I struggled to actively play with her. In my therapy sessions, I'm constantly surprising myself when I talk about all the things I'm doing and mention how I've been sticking to my exercise regiment and seeing friends, etc. All of that was impossible before I started keto.",
            "score": 20,
            "author": "PangolinIll1347",
            "replies": [
                {
                    "level": 1,
                    "comment": "My psychiatrist actually recommended keto to me to improve mood and manage OCD I haven’t started yet but reading your comment made me realize I’m gonna get my ass in gear so Tysm for this",
                    "score": 8,
                    "author": "Lollihoppy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome! I hope you also have good results.",
                            "score": 5,
                            "author": "PangolinIll1347"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for your insights.",
                    "score": 3,
                    "author": "codguru"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m grieving my mum who died six months ago and I honestly feel quite balanced - even quite chirpy - on keto. No mood swings.\n\nI’m not particularly moody anyway but I wonder if some of my precious “moments” 😂 have been down to sugar sugar sugar",
            "score": 6,
            "author": "Gettin_Piggy_With_It"
        },
        {
            "level": 0,
            "comment": "Ketogenic diets increase gaba in the brain, which is calming and anxiolytic.",
            "score": 6,
            "author": "spot_removal"
        },
        {
            "level": 0,
            "comment": "I started keto/carnivore about a year and a half ago and have been on zoloft on and off for about 18 years. I didn't notice any changes to mood at first, but after a few months I started to feel much more stable. Now the depression and anxiety symptoms are very manageable. I still might get into a depressed mood, but it usually lasts a couple hours, instead of weeks or months. Same with anxiety. I might feel anxious but I can distract myself instead of spiraling.\n\nSo the only changes have been good. \n\nIn terms of nutrients, I find that I feel better with some added vitmain D and omega 3s. I don't really take supplements, so I eat seafood a couple times a week, especially mackerel, oysters, and salmon.",
            "score": 5,
            "author": "c0mp0stable"
        },
        {
            "level": 0,
            "comment": "Thank you for posing such an interesting question and with such care, regarding keto, diet, and anti-depressants. I’m wondering if it might be helpful to add one more to your list of questions, namely, regarding the state of their health, and especially whether they were overweight when starting the diet. from following this forum for several months, I’ve had the impression… Only an impression, but somewhat consistent… That it tends to be people who are substantially overweight, and in poor shape, who get the best results with the diet. So I’m wondering if that may also be the case specifically with effects on mental health.\n\nI ask because I have a family member having a very hard time getting off of antidepressants, but he’s not overweight, and I’ve wondered if that makes the diet less auspicious for this purpose but I’m not sure at all.\n\nAnd thanks again for your post!",
            "score": 3,
            "author": "dsschmidt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ketones are good for all. Ketones cross the blood-brain barrier. So the weight loss is helpful to those who need it. The ketones is helpful either way.\n\nBut it's not just the ketones; It's the array of positive side effects and good habits. Electrolytes/sodium helps use *neurologically*, and it helps with the absorption of *water-soluble nutrients.* Some have increased nutrients from *increased veggie* eating. Fat-soluble nutrients are helped by the fat-burning of keto. The absense of sugar and carbs, *significantly decreases inflammation and insulin resistance*. These benefits happens to all. An overweight person, may have more inflammation, but everyone has some inflammation from the carbs/sugar. Skinny people do get diabetes t2. Sugar is our most acidic food.",
                    "score": 0,
                    "author": "Magnabee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well. Maybe on a theoretical level, But after four months of strict clean keto, then off for two weeks, then back in for a week I got just about zilch in terms of changes or benefits. A little lower blood sugar, sk that’s good. But I’m I’m skeptical of “it’s good for everyone” trope and with the “everyone is different” crowd on this one. \n\nThemes my thoughts.  Thanks for chiming in.",
                            "score": 1,
                            "author": "dsschmidt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You would need to be more consistent for at least 3 to 6 months. You don't have to be strict but staying in ketosis is important. I can not say it's good for all because not all are doing it well. And you turn off the benefits when you stop the keto. \n\nBut hopefully you do research and six months later or a year later you know so much that you are not going to make major diet errors while on a carb diet.\n\nYou weren't doing it very long. If someone only does it for *two* weeks, it's possible to not notice benefits. I agree on that. Maybe do more research. I found that I committed more to it because I knew for sure it was the right diet, through research. It would also decrease newbie mistakes to learn more and more about keto.",
                                    "score": 1,
                                    "author": "Magnabee"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started Keto about a month and a half ago and have been on anti depressants for about 7 years.  It was planned before that I would probably stop in July based on progress with counseling and such but I wasn't sure I'd be ready based on how I was still feeling before Keto. In mid May I decided I felt good enough to try it and got off my antidepressants all together and have been feeling great.   Still taking vitamin D as a safe guard though.",
            "score": 3,
            "author": "kottashtrophe"
        },
        {
            "level": 0,
            "comment": "Op..\nI hope you don’t mind if I ask for some help on your thread. I’m having a problem and I’m not even sure if Keto is the reason or part of the problem.\n\nI was taking Lexapro for about 2 years and decided to abruptly stop it about 3 months ago (wanted to get off meds). I was originally given lexapro for sleep issues not depression. About 2 weeks after stopping lexapro, some developments occurred at work that caused major stress/shock to me that I’m still dealing with. And I started Keto at about the same time. \n\nA week after staring keto  I started getting very bad panic attacks. I started waking up in the middle of the night gasping for air and it felt like I was being water boarded. It’s gotten to the point where I am scared to go to bed.\n\nHas anyone experienced anything like this? I don’t know if it’s the getting off the lexapro, work stress or keto or a combination of them that’s causing my symptoms but I’m getting pretty desperate. \n\nIf anyone has a similar experience and can share their solution, I would very much appreciate it.",
            "score": 2,
            "author": "blibblub",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not a good idea to abruptly stop these meds. They need to be tapered over a month or more. Even then, most people will have withdrawal symptoms.",
                    "score": 6,
                    "author": "VincaYL",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;It's not a good idea to abruptly stop these meds. They need to be tapered over a month or more. Even then, most people will have withdrawal symptoms.\n\nI agree. I apologize. I misstated. I did slowly taper off the med. I took about 3 weeks to taper off. I was given this med by my general physician without much guidelines and I really wish I had never gotten on it to begin with. I am hoping this is just temporary withdrawal symptoms that will resolve",
                            "score": 2,
                            "author": "blibblub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It should get better. \n\nThat being said I have gone off them a few times in the 20 years since I first went on. And it was never better enough for me to stay off.\n\nIf you can manage to stay off, it's better for your long term health. They were never tested for long term use and it's only now we are seeing increasing metabolic dysfunction in the long term users.",
                                    "score": 1,
                                    "author": "VincaYL",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the comment. Did you have similar panic attacks when you went off it? How long did your issues last?",
                                            "score": 1,
                                            "author": "blibblub",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not panic attacks. Uncontrollable urge to sleep. I don't remember how long it lasted. But shorter than months.\n\nProtein from animal sources is key",
                                                    "score": 1,
                                                    "author": "VincaYL"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I used to wake up gasping and choking. It totally sucked. Turns out I have sleep apnea. I got sleep tested, got a shiny new C-Pap machine and an ultra sexy mask and now I sleep great and I don’t stop breathing in my sleep.",
                    "score": 3,
                    "author": "dg313",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for posting this. I am starting to wonder if I have sleep apnea. Did you call a sleep place yourself or did your physician send you to one?",
                            "score": 1,
                            "author": "blibblub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "After my husband and my cardiologist both told me that I should get sleep tested, I asked my primary care physician for a recommendation. My insurance doesn’t require a referral, but YMMV.",
                                    "score": 1,
                                    "author": "dg313"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Looks like you weaned off quickly. See this [post](https://www.reddit.com/r/lexapro/comments/h7u92r/how_i_tapered_off_lexapro_escitalopram_with_zero/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button)",
                    "score": 1,
                    "author": "codguru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I appreciate you posting this. But it’s a little too late since I am 3 months into quitting it already and that initial damage is done. Although my dosage was low. I was only taking 5mg per day. \nI’m just trying to figure out if anyone else has had symptoms similar to mine and if it’s more related to ssri withdrawal or keto/stress.. and how long it lasted for other people",
                            "score": 2,
                            "author": "blibblub"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It sounds to me like that's probably from getting off the Lexapro. From what you say below, your taper was relatively fast as these things go. The trick is that problems getting off of SSRIs can happen well after you've stopped taking them. That was the case for me--about a month or even 6 weeks after the end of a taper with Zoloft I would get hit with the most awful depression--it happened several times before I was finally able to get through it without restarting. And I've read of others having the same experience. Your anxiety sounds to me like it could be the same thing.\n\nI've also heard Chris Palmer, who's the key person on keto for depression, say in interviews that he never has people start keto unless everything else is stable--so does not do keto and tapering at the same time. He's mostly working with people with severe and treatment-resistant depression, so might not apply to you...but then again, it might still. \n\nI hope that's of some help, wishing you best of luck with this!",
                    "score": 1,
                    "author": "dsschmidt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. This was super helpful. I am starting to feel better now that I sort of know what the reason was.\n\nIn hindsight, I did everything wrong. I didn't put much effort into tapering off the meds, added Keto at the same time all while going through an extra stressful period at work. Now that I am in the middle of it, I will try to get through it.",
                            "score": 1,
                            "author": "blibblub"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not a doctor but I have a family members who are taking medicine for anti depression and anxiety. I think one should start keto but please don't stop your medicine. The way I have seen that these medicine affects in your body slowly and the same way when you quit taking medicine it takes time to go away from your body. Please don't quit taking your medicine by reading peoples opinion from these thread. Please consult your doctor and maybe go low dose. All the best!!!",
            "score": 2,
            "author": "dial1010usa"
        },
        {
            "level": 0,
            "comment": "Not on SSRI anymore (I ran out during xmas period in december) so I quit them cold turkey.\nThey did relieve me of my suicidal ideations, but at the same time made other symptoms worse.\nQuitting them was fine for a while, but them a couple of months ago my binge drinking and eating got worse and worse until I got suicidal ideations again.\nThat's when I thought I have nothing to lose by trying keto+OMAD.\n\nJust a few days in my mood improved more than it has in 13 years, and by day 5 I was balls deep in cleaning my apartment due to the spike in energy I've never had before. I just started week 3 and I've only had 2 low energy days since starting, and that is because I had too many carbs.\n\nI hope this was helpful, even though it isn't exactly what you asked.",
            "score": 2,
            "author": "No-Technology-2039"
        },
        {
            "level": 0,
            "comment": "Unfortunately everyone is different and so it's very difficult to go down a diet based medication. I was always taught that anxiety and depression were negatively impacted by low carb diets. I can't remember why they were but something about how the vagus nerve and gut microbes worked. It was all very theory based as it's incredibly new research. \n\nWe do not understand the gut. We still don't understand how the body works. Fat was evil until a few years ago and we still don't understand cholesterol. Processed foods are definitely not good for us and we have some scientific proof in that area. Unfortunately we don't really know why certain medications work as most mental health is an imbalance of chemicals but more trauma or something else. Medication seems to alleviate some stress but obviously can't fix the underlying mechanism at work. \n\nFood definitely has some impact. I think it's a game of trial and error. Just like medication. It's about finding out what works for you. And also at a certain time period. Things change. Environments change you change and things change. It's not static and so you need to keep moving. \n\nBest advice is Biopsychosocial. Good sleep less stress exercise and try to find things that you enjoy. Mindfulness is incredibly powerful. Far superior to most medication.",
            "score": 1,
            "author": "Mojojojo_1947"
        },
        {
            "level": 0,
            "comment": "I found keto causes a dramatic decrease in my anxiety symptoms, but I don't think I personally see any changes to depression. Maybe the very darkest of thoughts occur less, but it's hard for me to credit keto with that directly. I'd say my PTSD has improved, but not as dramatically as my anxiety.\n\nNo side effects. Though it seems to me like my med timing affects my ketone reading. My highest readings are always when I'm the furthest from my last dose.\n\nI do have a dietitian. I take a multivitamin/mineral, B complex, calcium, D+K, NAC, fish oil, and Lutein+zeaxanthin. In addition she wants me to get 1000mg of magnesium and extra potassium. She also has me take vitamin c whenever I eat something high in iron. This plus my 4 meds can all be overwhelming sometimes.\n\nI think everyone with mental health issues should try keto just to see if it helps. It might not, but if it does help you the way it helps my anxiety, I'd hate for folks not to give it a couple months to see. I always recommend people with mental health issues take a multivitamin/mineral, B complex, and fish oil. And check blood work to see if they're low in D or magnesium, and supplement those if they are deficient.",
            "score": 1,
            "author": "AmNotLost",
            "replies": [
                {
                    "level": 1,
                    "comment": "I take escitalopram mainly for anxiety. When I tried keto 5 years ago, I felt constant fatigue, but I do recall that all my allergies and asthma were resolved while on keto at that time. I think I should try keto again.",
                    "score": 1,
                    "author": "codguru"
                }
            ]
        }
    ]
}