{
    "id": "141c09n",
    "score": 67,
    "title": "Keto - A lifestyle or a diet",
    "author": "Himbeerensalat",
    "date": 1685965837.0,
    "url": "https://www.reddit.com/r/keto/comments/141c09n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do you want to do  keto forever, as a lifestyle or do you think that you can one day eat healthy carbs. I have the anxiety that I will become obsessing about the food and that I will one day fear fruits or maybe something like sweet potato that’s also considered healthy. I just started and yes I see big changes, but will I do it forever??\n\nAnd I am sorry: my English is not the best! :)",
    "comments": [
        {
            "level": 0,
            "comment": "As someone who went through a point in time where I demonized carbs and structured my way of eating around avoiding them, you are right to worry about potentially having this issue.\n\nI say to you, don't worry about it. The one thing about Keto is that once you do it, you never forget how it makes you feel both mentally and physically. It is a tool that the body knows how to use instinctively, and like the hammer everyone has in a toolbox somewhere, it is there when you need it. \n\nKeto taught me a lot about myself, my body, and the power of addiction and the strength of will it takes to break it. Keto helped me quit a 2 pack a day smoking habit, and because of Keto, I am no longer a high functioning alcoholic. \n\nKeto reset my baseline, and helped me to relearn the difference between feeling \"normal\" and feeling my best. I learned what foods make my joints hurt the next day, like potatoes. I learned that bread and pizza makes me break out in whitehead pimples on my face within 3 hours of eating them. I learned that certain \"healthy\" vegetables cause severe gastrointestinal distress when I eat them now. \n\nIf it wasn't for keto, I would never know this and would have just continued plodding along poisoning myself with cigarettes, daily drinking, and food that was causing me harm, because that was my baseline before. \n\nI learned to just be okay with breaking keto once in a while, like when my wife wants to go out to dinner and I eat sushi with her. I don't want to, but it makes her happy and I am back on track in two days. \n\nIf you want an apple, eat the damn apple. You can always get back into ketosis, but it doesn't work if you keep cycling back and forth every few days in metabolic purgatory. \n\nFor some, Keto is a way of life. For others it is a way of eating, but for everyone it is a tool that is always there when you need it.  Most importantly, Keto teaches us that there is a way to eat that allows our body and mind to operate optimally, whether you do it for a few months out of the year, or the rest of your life.",
            "score": 173,
            "author": "repulsive-ardor",
            "replies": [
                {
                    "level": 1,
                    "comment": "A well written explanation/ article. Thank you for sharing your thoughts and experience.",
                    "score": 19,
                    "author": "SpiritsWalking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for reading it!",
                            "score": 6,
                            "author": "repulsive-ardor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very sensible stuff, also well done with the smoking &amp; drinking",
                    "score": 8,
                    "author": "P1ckleR1ckGr1mes"
                },
                {
                    "level": 1,
                    "comment": "It was good of you to share your journey through some difficult addictions with the help of keto. I have benefited in so many metabolic and non-metabolic areas of my life as well. Keto is a great tool as you said but it’s even more versatile than the hammer. Maybe a Swiss Army knife because it might be the only tool you need or just a good one to know is there in the glove box. I think I’ll stay with keto as a lifestyle even if I deviate occasionally, knowing the consequences",
                    "score": 5,
                    "author": "EggplantEast847",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All I know is, Keto changed my life for the better. Because of Keto, I no longer have diabetes, am no longer on 4 BP meds, and the Zoloft went in the trash as well. I'm really happy it helped you and all the others, the results people have had on it belie all the garbage misinformation out there.\n\nI do like the Swiss army knife analogy, it seems more apt considering the different types of Keto one can employ as they see fit. I drift in and out sometimes because of work location, and vacations and such but I always default back to Keto.",
                            "score": 9,
                            "author": "repulsive-ardor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rob Lowe has been into keto forever. \"Sometimes you just want those nachos\"",
                    "score": 4,
                    "author": "mbr902000"
                },
                {
                    "level": 1,
                    "comment": "&gt;If it wasn't for keto, I would never know this and would have just continued plodding along poisoning myself with cigarettes, daily drinking, and food that was causing me harm, because that was my baseline before.\n\nWow, exact same here.  I battled my addictions for YEARS and then with keto they went \"poof!\".   People think I developed sudden will power but that is not the case - I just loved feeling good.",
                    "score": 4,
                    "author": "louderharderfaster"
                },
                {
                    "level": 1,
                    "comment": "Well written pal 🤝",
                    "score": 3,
                    "author": "Tixtr"
                },
                {
                    "level": 1,
                    "comment": "Great comment. Tell me why doesn’t it work if you cycle? I am currently doing around 12 days on Keto then 4 or 5 days off, and back onto Keto for 12 days again. I’m losing weight albeit more slowly and the first couple of days after I’m “off keto” can suck a little but apart from that is there any metabolic impact of this cycle, or are you alluding to the mental challenges of sustaining such a lifestyle?",
                    "score": 2,
                    "author": "DonCharco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think for most people starting Keto, they never get truly fat adapted before cycling on and off and they wind up going into a metabolic purgatory if they do it within the first 4 weeks of Keto.\n\nIt takes time for the mitochondria to switch over to primarily fat burning after a lifetime of primarily glucose metabolism. So if someone is still in the middle of making the transition and then starts cycling carbs in and out, the mitochondria and cellular machinery never has a chance to adapt to either, and this leads to metabolic purgatory. Some people can get away with it, but most can't and this is why it is so important to give Keto at least 6 weeks to get the cellular machinery in place and up and running before cycling if it's their first time doing Keto. After that, the body has learned what to do and tends to make the switch back more easily, at least in my case.",
                            "score": 11,
                            "author": "repulsive-ardor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Metabolic purgatory” - brilliant",
                    "score": 2,
                    "author": "Aegongrey"
                },
                {
                    "level": 1,
                    "comment": "This was so great to read and very much how I feel as well.  For myself, I know now beyond a doubt that a higher net carb day once in awhile works ok for me.  But if the net carb day includes sugar laden sweets I'm probably heading for a hard fall that I'd rather not go through again.  There is too much great food out there that I like to start up the sugar or alcohol addictions again.  That is my goal anyways!",
                    "score": 1,
                    "author": "SillyJBro"
                },
                {
                    "level": 1,
                    "comment": "Best comment ever! Here’s your well deserve upvote ⬆️",
                    "score": 1,
                    "author": "georgegar630"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This month marks five years of uninterrupted keto for me and I’ve never looked back. Dropped almost 50 pounds and have had no trouble keeping it off for the long haul. I don’t obsess about what foods I can or cannot eat because food is fuel and meat and veggies make me physically and cognitively happy. I see no reason to stop.",
            "score": 25,
            "author": "gohappinessgo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats on 5 years! I'm two months away from 5 myself, but very much interrupted for a few holidays and traveling(food is a big part of cultural immersion for me).\n\nLost all the weight in the first year, but everything just works better on keto. It's a lifestyle for me, I can't go back to feeling awful and thinking it's ok. Especially in the bathroom.",
                    "score": 7,
                    "author": "64557175"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both.\n\nLowcarb lifesyle, keto while losing weight, lowcarb while exercise.   \nThen on maintenance, probably keto on-off based on life events. I wouldn't say no for a dinner just because there is no keto option, but still try to be at least low-carb, but i would not care if one day of the week is high carb, just don't make it a habit.",
            "score": 16,
            "author": "freeubi"
        },
        {
            "level": 0,
            "comment": "I know others aren't me, so this is just me:\n\nI still enjoy a lot of healthy carbs. Berries. Roasted vegetables. I made french fries out of turnips the other day -- delicious. I regularly save up all my carbs for the day to eat a bowl of popcorn at night -- I LOVE popcorn.\n\nAs to sweet potato, I do make stuff like that for my husband. If it sounds good, I'll have a very small serving that still fits my macros. I realize a small serving would make some people crave it more or be sad. But I'm fine with it because keto helps my anxiety and it's worth it to me to choose small portions of carb-y things if I want them.",
            "score": 37,
            "author": "AmNotLost",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work construction and go to gym a couple of days a week. Lets me eat more carbs and stay in ketosis. I find this allows it to be a lifestyle and not a diet.",
                    "score": 13,
                    "author": "Hopfit46"
                },
                {
                    "level": 1,
                    "comment": "I also limit all of my carbs to enjoy popcorn.  It’s such a tasty treat and reward.",
                    "score": 8,
                    "author": "djdayer"
                },
                {
                    "level": 1,
                    "comment": "Ooooo popcorn 😫😫",
                    "score": 3,
                    "author": "AZ-FWB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keto is a lifestyle, but that does not mean I will never touch another piece of fruit for the rest of my life.  I’ve been eating keto since 2014 (with the exception of last year - had a little fall from grace).  \n\nTake yesterday for example.  We went to a family reunion, which was pot luck.  I ate plain meat and veggies.  I had a small bit of lower sugar fruit, but I did have a small taste of dessert as well.  Dinner went right back to keto.\n\nIn order to keep the lifestyle, you have to remember that one bite or one slip-up or one intentional cheat is not an invitation to go whole hog on a carb binge.  Your next bite or your next meal needs to get right back into keto.  That’s how you keep it sustainable as a lifestyle.",
            "score": 13,
            "author": "Repulsive_Belt7954",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s crazy how your brain will go full drug addict and try to make ya turn that cheat into a month long binge",
                    "score": 3,
                    "author": "gatorallday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think now I know too much to go back to high carb.\n\nThe benefit of ketosis for the brain and inflammation and the harm of sugar spikes made the choice easy. But I can easily cook low-carb version of whatever I crave.",
            "score": 12,
            "author": "avomayo"
        },
        {
            "level": 0,
            "comment": "I’ve started thinking of it more as an addiction to carbs and sugar and reframing it as a carb “allergy” because my body has so many inflammatory reactions (high blood glucose, cravings, bloating, acne, the list goes on) and this has helped encourage me to think of it as a lifestyle. you wouldn’t encourage an addict to one day “be able to” go back to drinking for example. and you wouldn’t encourage someone with a shellfish allergy to just “cheat for one day” and try some shrimp. Lol of course I won’t go into anaphylaxis eating carbs but I will suffer for days after",
            "score": 11,
            "author": "goddessparticle1"
        },
        {
            "level": 0,
            "comment": "For me personally it has to be a lifestyle. If I'm not on keto I simply go overboard with my eating. When I'm on keto I don't have the crazy hunger I have off of it. \"It's easier to cage a dragon than to take it for a walk.\"",
            "score": 10,
            "author": "OhTheHueManatee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am just like you, after a vacation I am trying to get back to keto eating. When I go off, I go OFF big time.",
                    "score": 9,
                    "author": "Paula_56",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same it’s wild",
                            "score": 1,
                            "author": "gatorallday"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is me!",
                    "score": 2,
                    "author": "scouserdave"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely lifestyle. My body can not deal with carbs or sugar. I've done keto happily and healthily for over 6 years now, and I don't plan to ever stop. It's sustainable if done correctly.",
            "score": 29,
            "author": "JadeMoon085",
            "replies": [
                {
                    "level": 1,
                    "comment": "P my mm\nBut",
                    "score": -8,
                    "author": "bloodypink"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lifestyle. I’m not going back to migraines and getting HS lesions, and being prediabetic.",
            "score": 8,
            "author": "aafreis"
        },
        {
            "level": 0,
            "comment": "I may be the minority here, but I treat it as a moderately-termed diet (1-2 months). Helps me reset my appetite and cravings for sugar. I just don’t find it sustainable as someone who finds diverse ethnic foods a joy of life. I can hold them back or find some keto alt way of eating for a month or two, but it’d be too cruel to take it away completely from me forever 😭",
            "score": 8,
            "author": "yorzz"
        },
        {
            "level": 0,
            "comment": "I did keto for 4 years and now for the last 2 years have intermittently switched between low carb and keto. When I introduced carbs it's mostly sweet potato, milk and some pastries. \n\nDefinitely a lifestyle for me mostly because I don't have much knowledge at all for cooking carbs, I know how to cook veg and meat so that's mostly what I eat.",
            "score": 8,
            "author": "Kaghei",
            "replies": [
                {
                    "level": 1,
                    "comment": "Big ups! Cooking most of your food I think is just about as impactful on health as dropping carbs(and seed oils for that matter).",
                    "score": 2,
                    "author": "64557175"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't fear them.  \nI just don't eat them. Don't care. That's about it.",
            "score": 7,
            "author": "Raddenson11"
        },
        {
            "level": 0,
            "comment": "Lifestyle for me! I may steal a French fry or a tortilla chip here and there but I’m not going back to carbs and sugar. I’m very happy with where my body and overall health is with keto.",
            "score": 5,
            "author": "AZ-FWB"
        },
        {
            "level": 0,
            "comment": "Well… for me the alternative was being overweight with type 2 diabetes as a lifestyle. \n\nSo I will stay keto/low carb. Definitely a lifestyle for me out of necessity and ease of operation.",
            "score": 6,
            "author": "dantasticdanimal"
        },
        {
            "level": 0,
            "comment": "I started it as a diet is 2018. I lost 50 lbs. I went off of it and gained everything back (also found out I have autoimmune conditions, hypothyroid, hormonal issues and food allergies). I went keto again and started losing weight again. I then tried clean low carb (under 100 carbs but kept them healthy), felt crappy because I wasn't getting enough carbs. I am back on keto and losing weight and feeling fantastic again. Once I get to my goal weight I am not going to sweat a very occasional carb here or there where I eat a potato something but overall, keto seems to be life for me!",
            "score": 5,
            "author": "leogrr44"
        },
        {
            "level": 0,
            "comment": "Lifestyle - I love refined carbs but they turn me into a way worst version of myself. Everything in my life becomes shittier. Def not worth it",
            "score": 4,
            "author": "FrenchRoo"
        },
        {
            "level": 0,
            "comment": "Here's my answer:\n\n[https://snipboard.io/L1pruJ.jpg](https://snipboard.io/L1pruJ.jpg)\n\n(Just so happened to grab it when I got out of bed this morning. 😁)\n\nI started keto a little over a year ago, and it's my permanent way of eating from now until I'm carried out in a box. My daily carb limit is 20g net carbs or less per day. Going over the limit, like to 25g nc, is OK for me once in a while...it won't kick me out of ketosis or affect my glucose and A1C. Your limits might be different from mine. Good carbs like berries and some vegetables are perfectly healthy, just don't overdo them, stay within your daily carb limit and you should be fine.\n\nHere's some carb and nutrition info about sweet potatoes. You might be able to eat a small one, or half of one only occasionally, and still be OK. With butter and a little cinnamon...yum. [https://www.webmd.com/diet/sweet-potatoes-for-a-low-carb-diet](https://www.webmd.com/diet/sweet-potatoes-for-a-low-carb-diet)",
            "score": 5,
            "author": "RondaVuWithDestiny"
        },
        {
            "level": 0,
            "comment": "I started keto just to lose weight. I’ve been doing IF for years but wasn’t losing much anymore so I decided to try keto. But I decided to make keto a lifestyle after learning what carbs does to the body. Giving up rice wasn’t as tough as I thought it would be",
            "score": 5,
            "author": "-HiggsBoson-"
        },
        {
            "level": 0,
            "comment": "Thank you all so much for your advices this is very helpful!!! ❤️❤️❤️",
            "score": 4,
            "author": "Himbeerensalat"
        },
        {
            "level": 0,
            "comment": "Lifestyle but not strict. While most days I’m near zero carbs, I don’t shy away from seasonal fruit, some honey here and there, I’ll eat the potato purée that comes with a steak at a restaurant and maybe even dessert if it’s not something generic. I still avoid grain based foods and nuts/seeds on the regular. \n\nFor me, being metabolically flexible is great",
            "score": 10,
            "author": "Zackadeez"
        },
        {
            "level": 0,
            "comment": "I’ve eaten keto nonstop since I started in 2017 and will continue until I die. It’s definitely a lifestyle change for me. I don’t fear sweet fruits or sweet potato, I just don’t eat them because I have no desire to. They would make me miserable at this point, not worth it.\n\nBut I am not you, and you are not me. You do whatever is best for **you.** 👍🏻",
            "score": 24,
            "author": "ReverseLazarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long did it take you to lose the desire? What was your relationship w carbs and sugar before? Ty🙏🏼",
                    "score": 4,
                    "author": "Independent_Dot63",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't speak for them as each is different, but to offer my perspective I've been keto for just over 3 months and the craving went away for me in around 2-3 weeks (was quite a hard 2-3 week). \n\nBefore I ate mostly unhealthy but snacked on sweets and crisps every night like they were going out of fashion. I now walk down the sweet aisle and don't bat an eyelid.\n\nI could stay like this forever, no need to go back to carbs. I have a holiday in a few months, all inclusive for a week, I might let loose then but get back to being strict when I come back.",
                            "score": 12,
                            "author": "SimplyInept",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ty! Ive never had a sweet tooth but i am swedish so meat and potatoes is engrained in me so my main problem is giving up starches, also i love a dry champagne almost nightly and its a very low carb content but i feel like it still prolongs the “cravings” \n\nIve given up all forms of potatoes now but that craving havent went away yet and same with wanting my dry champy, but i guess will give it a solid 2-3 weeks and really commit- just hard to imagine actually not craving it on a visceral level",
                                    "score": 2,
                                    "author": "Independent_Dot63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's hard to think it but (for me and my Mrs) it did vanish, one night about a week in we were laying in bed talking the most filth I think we ever had \"OooOooOoh imagine a creamy doughnut!\" \"\"Oh God yes, which crusty warm bread with melted butter!\" The cravings were insane but all of a sudden, gone.\n\n I used to demolish a tub of pringles every night, I love(d) them but i can now simply live life happily without ever having a single crisp.\n\nI like chocolate too so I had cravings for sweet things, I bought 100% chocolate, it tastes like the sole of a hikers boot, vile. Every time I had a craving I'd have a tiny piece, needless to say, I wasn't craving sweet things for very long.\n\nIt's up to you what you do about the bubbly, you don't want to be miserable on the diet but at the same time if it's keeping you craving carbs you'll have to find a balance. If it's a must have, try it for a few weeks without removing it and see if the other cravings have gone, if it's not a must or it's keeping you craving, go cold Turkey, that's how I would approach it.",
                                            "score": 6,
                                            "author": "SimplyInept",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh damn, that seems to be the popular sentiment so i guess just gotta get to that sweet spot\n\nBut thank you ill deff follow this advice as far as 🥂",
                                                    "score": 1,
                                                    "author": "Independent_Dot63"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My relationship with carbs and sugar was a tumultuous and incredibly unhealthy love affair. I am a recovering binge eater so it was not unusual for me to have half a dozen donuts with chocolate milk for breakfast, fast fried food for lunch, and an entire large  pepperoni pizza with whatever dessert I had on hand (brownies, cake, cookies). It was bad. \n\nIt took me well over a month of strict keto before the cravings dissipated completely and my endless hunger was quieted, I didn’t experience the immediate appetite suppression many people do unfortunately. But I’ve been great ever since and that’s why I’ll never go back to carbs.",
                            "score": 11,
                            "author": "ReverseLazarus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg thank you for sharing, this means a lot! Im also a former binger (and purger) so this gives me hope to escape the insatiable cravings and establish a sense of normalcy",
                                    "score": 5,
                                    "author": "Independent_Dot63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Keto is the only thing that ever made a huge difference for me, it gave me the gift of no longer being ravenous 24/7 which is the *only* way I was able to let go of those rough binging habits. I hope you have the same experience. 🙂",
                                            "score": 9,
                                            "author": "ReverseLazarus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s incredible, gives me motivation ty!",
                                                    "score": 1,
                                                    "author": "Independent_Dot63"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Different person, but:\n\n&gt;How long did it take you to lose the desire?\n\nFor me, it takes a week or two of a break from anything sweet, including keto-friendly things like artificial sweeteners and berries.\n\n&gt;What was your relationship w carbs and sugar before?\n\nI couldn't taste the icing on a cupcake without then finishing off the container of it with a spoon.",
                            "score": 6,
                            "author": "SomeInternetRando",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lolol on the cupcake! But gives me hope, thats amazing you learned to handle it",
                                    "score": 1,
                                    "author": "Independent_Dot63"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well said! 🙂👍🏼",
                    "score": 1,
                    "author": "SpiritsWalking"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keto is definitely a lifestyle. And the benefits are far more than losing weight. I sleep better, my headaches have all but disappeared, I have more energy and best of all my severe IBS is something of the past.  So if I should ever contemplate going off Keto because I’ve reached my desired weight, I’ll  just remind myself of all those insomniac nights, headaches, lethargy and going to the loo 10 times a day. Also, i have lost my taste for sweet stuff and basically all carb-rich food. I don’t have to count the carbs anymore - I know what to eat and what I like.  I have a fruit two or three times a week … and that’s the extend my sweet tooth. And I’m never hungry! I eat when I’m hungry and I eat until I’m full …never more or less than I need.",
            "score": 7,
            "author": "entitledpeoplepizoff"
        },
        {
            "level": 0,
            "comment": "IMO, it is a lifestyle choice. I  occasionally cheat st family gatherings and survived.  At first, it wasn't easy.  It gets better.  I feel that after 4 years of this, I know my metabolism and relationship with food that I  don't miss anything so much to make me not be keto.",
            "score": 3,
            "author": "monstrol"
        },
        {
            "level": 0,
            "comment": "I was an unintentional mostly keto gal for about 35 years. I just really did not grow up liking most carbs much, probably as a way to rebel against my Southern upbringing! I did not realize this until I got pregnant with my son and ate a bunch of carbs trying to ward off nausea the whole pregnancy. Then after I had him I was trying to eat super cheap, so carbs became a staple. And I have felt like absolute trash ever since. So I now know carbs simply can't be the majority of my diet, and when I eat them I need to eat them with a lot of protein or they make me feel awful. I think once I get the extra weight off I will go back to eating the way I ate for the first 35 years of my life. I never even one time followed anything resembling a diet, never weighed myself, always had energy, doctor visits were always a snap and clothes shopping was a dream. That feels like the way life is supposed to be. I work a lot harder to be able to exist as a person who eats like a raccoon in a state park after a holiday weekend!",
            "score": 3,
            "author": "Puzzleheaded_Lake451"
        },
        {
            "level": 0,
            "comment": "Keto needs to be a lifestyle for me. I've dieted on and off my entire life.  I'm obese and afraid to become morbidly obese. I'm only 5ft tall, so I can't carry the weight well.  I have Hashimoto's and lupus and am very lucky not to be diabetic. I am gluten sensitive and really should be avoiding those types of carbs anyway. \n\nKeto has forced me to quit sugar and gluten-laiden carbs.  I physically feel better, but my heart is a little sad.  I'm hoping I can stay on keto until I meet my goal weight and incorporate a little gluten-free bread once I get there. I miss grilled cheese and garlic bread!\n\nIt helps me keep motivated to have long-term goals, like a vacation to keep me focused. My current goal is to be in better shape for a Disneyland trip in September.",
            "score": 3,
            "author": "fbombmom_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you on the vacation motivation! A good friend is getting married in Oahu in 10 months. I need to drop another 40 pounds and be best friends with the weight room and get reaquainted with my running shoes. \n\nI'm not looking like a fat slob in all those beach pics.",
                    "score": 3,
                    "author": "Iwalksloow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lifestyle for sure! I feel so much better on keto/ carnivore, I dabble between the two. Have been keto almost 5 yrs minus about 6 months where I stopped after I had my baby.",
            "score": 3,
            "author": "Momvstoddler"
        },
        {
            "level": 0,
            "comment": "I see it as a lifestyle. The details of that lifestyle can change over time.  \n\nI’m active and in maintenance mode for 5 years, so I am very fat adapted.  I’m strict on ingredients (no gluten, no seed oils), but eat small portions of whole food carbs on occasion, like sweet potato, fruit or a bit of rice with sushi.  Those things do not trigger my sugar addiction brain.  \n\nThings like dried fruit can be triggering because it’s more condensed sugar. I do not take break days or meals but tend to eat more say, fruit and nuts on vacation. \n\nNotice what makes you feel good, what doesn’t , and what makes you crave more.",
            "score": 3,
            "author": "DogtorAlice"
        },
        {
            "level": 0,
            "comment": "Keto for life here, but even on 20g net carbs in a day I still manage to eat plenty of fruits I like. \n\nAnd sweet potato now and then. But over time, I have lost my taste for most of the higher carb foods anyway.",
            "score": 3,
            "author": "surfaholic15"
        },
        {
            "level": 0,
            "comment": "Keto is a lifestyle for me. After learning that carbs are addictive for me, and that they are inflammatory, etc., I see no reason at all to go back to a high carb diet. I'm actually moving closer to high fat keto, or ketovore. And there is a keto version for every comfort food.",
            "score": 3,
            "author": "Magnabee"
        },
        {
            "level": 0,
            "comment": "Lifestyle, unless my diabetes magically disappears.\n\nHmmm actually, I'd probably stay on Keto regardless because I love this way of eating.",
            "score": 6,
            "author": "pieguy3579"
        },
        {
            "level": 0,
            "comment": "I am not going to do \"keto\" forever, because being in ketosis doesn't matter to me anymore.\n\nAt this point, I think what I am doing would be considered closer to a CKD (cyclical keto) than standard keto, but I don't stress over the carb count. But I would still be considered as having a very low carb diet.\n\nWhen I eat at home, it's protein, veggies, and berries for the most part. I don't buy refined grains or things with added sugar in them. I pack my lunches and cook dinner. I will make sweet potatoes on occasion, because they are yummy. I had a honeycrisp apple last week and it was tasty.\n\nWhen I eat out, I am okay with things like sweet potatoes, a bit of rice, something sweet if it seems worth it. That's usually going to be on a Thursday or Friday, and I think it's fine because  I will burn the extra carbs during my workout and subsequent ADF over the weekend.\n\nBasically, I am mindful of not eating too many carbs regularly, but I don't stress over the count anymore. I had been at a point where I was really obsessive about it, and I thought that I was on the edge of developing an eating disorder. Relaxing the \"rules\" and stopping the testing for ketosis really helped me.\n\nCarbs are not evil, they aren't \"bad\" foods, but like any good or neutral thing, it can be taken too far. I think keto is great but also can be taken too far. Everyone needs to find what works for them, and ultimately set yourself up for long-term success. Giving up watermelon, corn, bread, apples, peaches, etc. for the rest of my life isn't what is going to make me successful. What will make me successful is finding a healthy balance where I can make room for foods I enjoy without going overboard.",
            "score": 6,
            "author": "RemarkableMacadamia"
        },
        {
            "level": 0,
            "comment": "i eat healthy carbs, just not a lot of them. spinach, broccoli, cucumbers. just keep it under 20 grams a day net.",
            "score": 5,
            "author": "MsSeraphim"
        },
        {
            "level": 0,
            "comment": "Forever. Keto controls my migraines like nothing else, and comes with a boatload of other awesome perks:\n\n- perkier lady bits (yes, actually)\n- PCOS management (insulin _sensitive,_ yeeehaaaw)\n- better ADHD and ASD symptom management (still sucks, but less. I need ALL the help I can get)\n- lots of enjoyment from food\n- depression is basically gone\n- epic face gains, less acne\n\nMeanwhile meds only control one or two things, and you don't get perks, you get side effects. Keto for life is way better.",
            "score": 4,
            "author": "Damascus_ari"
        },
        {
            "level": 0,
            "comment": "So who determines what a healthy carb is?",
            "score": 5,
            "author": "smitcolin"
        },
        {
            "level": 0,
            "comment": "Definitely a lifestyle. I had to get professional photos recently and noticed I had put on a little weight due to eating more carbs. I immediately drastically went into a slightly more strict keto and immediately the weight disappeared in just a few days. In the past I would have been freaking out and never would have been able to achieve these results in a healthy manner without feeling hungry",
            "score": 2,
            "author": "Rosemarysage5"
        },
        {
            "level": 0,
            "comment": "Your definition of diet is limited. But I'll be doing it forever. 9 years so far, and it just keeps getting easier.",
            "score": 2,
            "author": "ChanceStad"
        },
        {
            "level": 0,
            "comment": "I did keto for over three years before, depression wrecked my streak. \n\nI was never afraid of fruits or sweet potatoes or other carbs I just simply didn’t eat them. Just like how I’m not afraid of sardines I just don’t want to eat them.",
            "score": 2,
            "author": "AshleysLymeDisease"
        },
        {
            "level": 0,
            "comment": "Lifestyle.  I have been eating like this well over a year and have a diagnosed eating disorder.  A lot of it is background noise from others and a frame of mind.  There is a keto version of any food out there.  I couldnt go back to eating more carbs unless it was just more of the types of carbs I eat now.  The whole idea that it is restrictive or unsustainable is nonsense, again it's a state of mind.  The fear that you will suddenly not be able to eat those foods is from all the eating disorder warnings out there combined with weight loss advice.  In fact I can now eat those foods in moderation and not have trouble stopping eating them cuz of keto vs before theyd have sent me into a binge and I would have eaten as much as I could or believed it wasnt possible to stop.\n\nThe standard diet was not for me and it was not sustainable.  I had many issues and got diabetes.  When you eat to live vs living to eat you realize food can be just as fantastic and enjoyable maybe even more enjoyable.  I actually hate restaurant eating now and prefer making my own food.  Eating a single high quality well selected chocolate is WAY more enjoyable than mowing down on a bag of 2 dollar chocolates for example.\n\nI basically have sometimes and always foods.  I sometimes have a piece of birthday cake but it's usually a half piece or few bites and only ON family birthdays I dont always plan them out but I eat them in serving sized portions or smaller portions my sil does this and she isnt on any diet and is very healthy naturally.  Fruit and sweet potatoes are sometimes foods for me.  An always food is like eggs, meat or non starchy veg meaning I can eat it whenever I want.",
            "score": 2,
            "author": "Sweet_Musician4586"
        },
        {
            "level": 0,
            "comment": "I initially used keto for weight management and binge-eating control. I was pretty strict for a while, but I've relaxed a bit.\n\nI now use fruits and starchy veggies as treats and snacks instead of baked goods, chips, and other processed snacks. The whole foods taste more palatable now that I've broken my sugar addiction.\n\nJust do what works for you. I haven't personally felt any negative effects of eating a little bit of fruits and veggies, and I haven't lost the surprise bonus effect of mosquitos not bothering me as much!! I don't think I could go back now that I can experience FUN outdoors!",
            "score": 2,
            "author": "-DexStar-"
        },
        {
            "level": 0,
            "comment": "CONTEXT: I am a Type 2 Diabetic. I have memories from childhood, before I was significantly overweight, of a conversation about oatmeal being a stupid breakfast because two hours later I would be hungry again. My maternal grandfather was born in 1905, I believe it was, in a very rural area, lived an active lifestyle and grew most of the food he ate. He was quite thin until at least his mid-40's. He died at 71 years old from Type 2 Diabetes-related complications.\n\nKeto, for me, is a tool for survival and also for comfort (my physical and emotional comfort is very quickly damaged when I eat too many carbs). I use keto as often as I can bring myself to do so, but especially as a correction after times of indulgence when life makes keto difficult (vacation, special events with friends and family). I would love to get to the point where keto 100% of the time is realistic for me, but I'm not there. It will, however, be a significant part of my life for the rest of my life.",
            "score": 2,
            "author": "SeaWeedSkis"
        },
        {
            "level": 0,
            "comment": "There are so many “diets” out there!! I am more curious how many diets people have tried before they have chosen keto? For me keto made a lot of sense - you cut out carbs and limit yourself to 20 net !! I started out counted calories and that was harder than keto! Keto is a lifestyle for me … the minute you call it a diet people think they can sway you away from it… People will respect you more if you stick it… because they aren’t as strong as you are !!!  I always.. feel like garbage if I eat too many carbs (it’s a huge wake up call to get back on track) Also, it’s okay to make mistakes and have too many carbs … keto is very forgiving and you just forgive yourself and get back the next day!!",
            "score": 2,
            "author": "Altruistic-Wasabi-60"
        },
        {
            "level": 0,
            "comment": "I plan to stay mostly keto, but eventually relax and not stress the occasional carb, especially in social settings. Mostly, I'm just replacing my \"standard\" meals that I cook from ones full of carbs to ones that are keto-friendly.  Rather than pasta, I've got grilled chicken with asparagus, or I make taco meat, but use it for taco salads instead of tacos.  These are things I should have no problems sticking with.  The thing that's harder is poor options when eating out, but that's been improving a lot recently with a lot of restaurants (at least in the USA) starting to have keto options on their menus.\n\nOnce I've got down to my goal weight, I don't really plan on changing my diet much, but if I go to a family gathering, I won't fret about having a slice of the pie or a bowl of ice cream- it's fine to indulge occasionally if you're not needing to lose weight, so long as you don't let it change your normal eating habits.",
            "score": 2,
            "author": "Rakatosk"
        },
        {
            "level": 0,
            "comment": "You could do the Dr. Ian Smith diet which is pretty much keto for a week, good carbs on the weekends. I personally have the discipline to stay on Keto for a long time. Once I get to a 170, I have a ridiculously disgusting, nauseating cheat day. Then I hop back on to my Keto lifestyle.",
            "score": 2,
            "author": "External_Passenger87"
        },
        {
            "level": 0,
            "comment": "Both, I think. I envision a day where I no longer think about ketosis and all that, but still use low carb/keto knowledge to keep sugar out of my life forever. Or simply used as a blunt instrument when I need to lower calories to drop weight.",
            "score": 2,
            "author": "backbodydrip"
        },
        {
            "level": 0,
            "comment": "I've found a way to do keto that works for me. I do keto and IF 90% of the time. On the odd occasion, like a birthday party or a wedding or something, I will get off the wagon, eat whatever I want, enjoy myself, and get straight back on the next day. Do I feel like shit, physically, when I do this? Yeah, sometimes. But after a day or two of fasting and eating low carb, I'm back to normal.\n\n\nI know there are probably good reasons why I shouldn't do this, why I should stick to keto 100% of the time and have low carb food at these events. But that would kill me. It would feel oppressive. I love pastry. I studied patisserie at chef school. Instead of doing keto 90% of the time, I'd be doing it 0% of the time. But now I do get to have that stuff every once in a while.\n\n\nDoing it the way that I am, I'm still losing weight steadily, my mental health is better than its ever been, I'm managing my ADHD without medication, I've gone off antidepressants, I'm exercising regularly... I'm doing _really_ well.\n\n\nI should note that when I first did keto three years ago, I did it by-the-book for 3 months in order to get fat-adapted. That wasn't sustainable for me.",
            "score": 2,
            "author": "PangolinIll1347"
        },
        {
            "level": 0,
            "comment": "I viewed it as a diet to a lifestyle, though its influence on your lifestyle is up to you!\n\nFor me, 6.5 months in, I’m starting to relax a little, but the lifestyle change I take from it is a healthier relationship with food, thanks to now being able to eat until satiety, as opposed to “full”. I don’t plan on being keto forever, but will be much choosier with carbs and when I choose to have cheat meals. \n\nIf you “finish” keto without any lifestyle changes, you’re likely to gain all the weight back in the long run.",
            "score": 2,
            "author": "dennispang"
        },
        {
            "level": 0,
            "comment": "Absolutely a lifestyle here.  In maintenance mode I add berries, perhaps the only truly \"healthy\" carbs.  I'm not sure you should be concerned that maybe you'll be so successful that you won't want to eat carbs again!  Cross that bridge when you get to it!",
            "score": 2,
            "author": "wendell-gee"
        },
        {
            "level": 0,
            "comment": "I am 6 + years on keto because on day 10 I realized I loved how my *brain* felt. I could not remember how long it had been since I woke up with a clear head AND in a good mood.  At 47 when I started - it was like a second chance at life. The weight loss was secondary at that point (but not knocking it).  I now eat about 40-45 net carbs a day of healthy carbs (veggies and berries) and am still in ketosis but even my emergency food stash is 100% keto.",
            "score": 2,
            "author": "louderharderfaster"
        },
        {
            "level": 0,
            "comment": "I eat keto only because it improves the symptoms of my chronic illnesses somewhat. If I ever get a medication that actually works, I'm sure as hell getting back to eating bananas and ice cream and sushi and sour candy!",
            "score": 2,
            "author": "bipolar_heathen"
        },
        {
            "level": 0,
            "comment": "See what fits your macros and then use your imagination.",
            "score": 1,
            "author": "slipperystar"
        },
        {
            "level": 0,
            "comment": "I do not plan to do it for forever.",
            "score": 1,
            "author": "saladflambe"
        },
        {
            "level": 0,
            "comment": "I've been having a monthly cheat day, but strict Keto for the rest of the time.  Works for me.\n\nThat could be a slippery slope for some though, so be careful. \n\nIf you're new to Keto, I'd stay in ketosis for at least a few months before having your first cheat day.",
            "score": 1,
            "author": "YeetMann696969"
        },
        {
            "level": 0,
            "comment": "I want to do Keto for several months then caloric restriction then back to keto",
            "score": 1,
            "author": "SugarinSaltShaker"
        },
        {
            "level": 0,
            "comment": "I go back and forth on this all the time. \n\nPart of me totally misses gorging myself on a massive bowl of liquid mac and cheese and passing out from carb coma. Not being to ever do that again, is kind of depressing. So the trick will be to find a cheat day once every two weeks, where I can totally go nuts and pig out. I think that's really the trick - to keep this as a life style but in more moderation. I bought the keto urine test strips and it's definitely helped me increase/decrease where I am in the process.",
            "score": 1,
            "author": "tommygunz007"
        },
        {
            "level": 0,
            "comment": "For keto I do it for the entire month. If it’s someone’s birthday graduation or someone got a license I’ll break keto about once. For a day or two.",
            "score": 1,
            "author": "TPA_deadplant"
        },
        {
            "level": 0,
            "comment": "I’ve been lifestyle for almost four years with not one cheat meal. 85 pounds lost and have been in maintenance for ~2.5 years. It’s become such an autopilot thing for me that I don’t even think about it. I’ve had small bites of carby foods a handful of times and while they’re good they don’t make me want more. If I had a good meltdown it would most likely be honeycrisp apples. I sure miss those!",
            "score": 1,
            "author": "MehLady74"
        },
        {
            "level": 0,
            "comment": "I eat any carbs I want 1-2 times a week and then almost no carbs the rest. Been doing it for a year",
            "score": 1,
            "author": "Osgiliath"
        },
        {
            "level": 0,
            "comment": "Can someone please tell me what Happy Cake Day is about?",
            "score": 1,
            "author": "Moon0812"
        },
        {
            "level": 0,
            "comment": "I mean the gist of it is; it's your choice. \n\nIf you're not diabetic, chances are you can go back to eating carbs, if perhaps not in the amounts you used to (I don't know what your diet looked like pre-keto).\n\nIf you do have diabetes, and you're unable to reverse it (some people manage to do that but it shouldn't be counted on), you should never go back to eating according to the food pyramid. In fact, avoiding the food pyramid is a bad idea anyway. \n\nMe, I'm on a weight loss journey and I don't know exactly what I'll be doing after that, carb-wise. Probably try to build some muscle, which might mean targeted carb consumption or cycling or something down the line. But, it's a long time away and each day has enough of its own worries.",
            "score": 1,
            "author": "JG1991"
        },
        {
            "level": 0,
            "comment": "I love the clean keto approach, but let’s face it: 20 grams of carb or less is hard to achieve… unless you do OMAD or full fasting, it’s unsustainable in the long run.",
            "score": 0,
            "author": "GMAN316316"
        },
        {
            "level": 0,
            "comment": "I think the big thing is learning not to sweat it too much. I know that might seem counter-intuitive, that's how you got overweight to begin with, but what I mean is--set up a few baseline rules: for me, that's usually ordering chicken salads or something like that when I eat out, unless I'm on vacation somewhere, then I don't sweat it at all.\n\nAt home I eat totally keto-compliant meals. I also do intermittent fasting, and don't start eating until 1-2pm each day, usually finishing off around 8pm.\n\nIf I go to someone's house and they've prepared food that's not keto-compliant, I eat it. Most of my good friends and family know that I'm on keto, so this only happens once every few months.\n\nIf my friends want to go out to a patio and have a few beers, I don't sweat it for that one night of the month that we tend to do that. If we're having drinks at our own places, I drink vodka seltzers instead.\n\nI'm not trying to give you a system, but just show you that, within broad constraints, carbs every once in a while is harmless.\n\nFor myself, I've been doing keto and intermittent fasting for just over a year (started late April 2022). I'm down about 50lbs in that time, and I'm finally at the point where I need to really go clothes shopping. That was more or less by following what I outlined above.\n\nIf I had been super-super strict, could I have lost weight faster, even a lot faster? Probably. But I like this idea of pacing myself a bit more liberally because, as you say, hopefully this is how I'll eat for the rest of my life. Being a little relaxed compared to the most-ideal keto protocol still got me back into my high school jeans, so, you know, I'll take a bit of slack on the rope if it means something more sustainable over the long haul.",
            "score": 0,
            "author": "vixaudaxloquendi"
        }
    ]
}