{
    "id": "142hdqr",
    "score": 4,
    "title": "Weight-loss stall and re-feed",
    "author": "OldFanJEDIot",
    "date": 1686060715.0,
    "url": "https://www.reddit.com/r/keto/comments/142hdqr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anybody successfully used a “re-feed” to end a weight loss stall? \n\nConsidering it. My weight loss has plateaued for several months now and I’m constantly hungry. \n\nEating around 2k calories a day, but exercise almost every day. Mixture of weights/HIIT/endurance/Yoga. 300-600kCals a day if you believe the HR monitor app. Currently around 175lbs, 5’9”, 47 year old male. \n\nMy calories in are slightly higher than when I started 30lbs ago, but my activity levels are higher. Have tried to cut calories but I’m starving the days I do. I generally IF 16:8, and I’m not usually hungry until I eat, but when I do, I’m basically insatiable. \n\nThe TDEE calcs say I should be at roughly 2600 a day, so a bit of a mystery as to why I’m not losing. I know my deficits is lower than when I started, but I should be dropping a pound a week. Perhaps a re-feed is in order to re-set my hormonal system. Thoughts? \n\nAlso, not really eating the Keto Frankenfoods (only occasionally) and my snacks are weighed and logged.",
    "comments": [
        {
            "level": 0,
            "comment": "Hello and welcome to /r/keto!\nBefore posting about a stall, please read the following sections of our FAQ\n\nhttps://www.reddit.com/r/keto/wiki/faq#wiki_what_to_do_about_plateaus.3F\n\nhttps://www.reddit.com/r/keto/wiki/faq#wiki_adapting_to_a_low_carb_lifestyle\n\nPlease pay close attention to the section called “What will my weight loss progress look like?” Weight loss is non-linear and it is common for weight to fluctuate multiple pounds across days particularly during the adaptation period.\n\nAs a reminder, please read our FAQ before posting to r/keto. It can be found at https://www.reddit.com/r/keto/wiki/faq. Please also review our posting rules and community guidelines.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/keto) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Not sure what calculator you are using but I am 47, 6'0, 185 and my maintenance is about 1950. You are simply eating too much.",
            "score": 10,
            "author": "orangeirwin",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are you using? That is just sedentary.  Add the exercise. I honestly can’t eat less. I’m starving constantly. Moderate exercise has me at 2,572. \n\nhttps://tdeecalculator.net/result.php?s=imperial&amp;g=male&amp;age=47&amp;lbs=175&amp;in=69&amp;act=1.55&amp;f=2",
                    "score": 1,
                    "author": "OldFanJEDIot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sedentary is the setting to use unless you have an extremely physical job. I do CrossFit 5 days a week and get in 3-7 miles of walking daily. There are 168 hours in a week and for a large percentage of them I am either sitting at a desk or sleeping. Using sedentary isn't judgemental, but for a very large percentage of the population it is the fact.",
                            "score": 7,
                            "author": "orangeirwin"
                        },
                        {
                            "level": 2,
                            "comment": "The exercise is not burning nearly as much as you think. The estimators and apps are not accurate. If they were, you’d be losing weight? You need to eat less, and see how you do after a month or two.",
                            "score": 6,
                            "author": "blue0mermaid"
                        },
                        {
                            "level": 2,
                            "comment": "That seems way too high.\n\nIf you are starving then you might need to play with different foods to see what satiates you, but the reality is hunger is still a thing you'll sometimes have to deal with when losing weight, especially when starting.",
                            "score": 3,
                            "author": "rachman77"
                        },
                        {
                            "level": 2,
                            "comment": "I agree with you, idk how everyone here gets way low numbers. I’m basically the same height and even just lifting 3 days a week with no cardio my maintenance is about 2800-3000 at about 180lbs. I feel like if you’re a 6 foot healthy weight guy with a maintenance of 2000 that’s a problem and I’d begin reverse dieting immediately because that is stupid low\n\nI feel like a lot of people here have lower metabolisms after losing a ton of weight and never put the work in to recover it after losing it.",
                            "score": -3,
                            "author": "SeniorBaker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am taller and bigger than you and I eat less than you are eating. I know it's not a 1:1 comparison like that but you are definitely over eating which is why you aren't losing weight \n\nRefeeding isn't going to start weight loss while you are over eating.",
            "score": 6,
            "author": "rachman77"
        },
        {
            "level": 0,
            "comment": "You’re vastly overeating for your stats, a “re-feed” is only going to make the problem worse. I’m getting these macros for your stats:\n\n1644kcal Daily Calorie Intake\n\n20g Carbs (80 kcal)\n\n130g Protein (520 kcal)\n\n116g Fat (1044 kcal)\n\n&gt;should be dropping a a pound a week\n\nWeight loss is nonlinear, there is no “should” when it comes to this. 🙂 A plateau is 6+ weeks with no loss, so going a month or so without losing is actually a totally normal thing we **all** went through.\n\n&gt;starving\n\nWhat are your fat and protein macros in grams? How are your electrolytes?",
            "score": 4,
            "author": "ReverseLazarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been roughly the same weight for close to 3 months. I wasn’t hungry the first three months. Now I’m starving. If I let myself eat I’d actually be closer to 2500-3000 calories. Where are you getting such a low number from (1650 calories)? You don’t think there is a chance six+ months of under eating has messed with my grehlin/leptin/cortisol?",
                    "score": 1,
                    "author": "OldFanJEDIot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, you aren't under eating at that many calories, if you were, you'd be losing weight.",
                            "score": 5,
                            "author": "rachman77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who is to say I’m not losing body fat? I can tell you I’m much much stronger. Clothes I haven’t worn in years fit. The constant hunger and fact that I still have a gut sucks. I do think it’s quite possible my metabolism has down regulated after six months of dieting. EDIT: I was never hungry when I first started, and would literally tell people that was the best part of the diet.",
                                    "score": 0,
                                    "author": "OldFanJEDIot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You aren't losing body fat and gaining muscle at the same rate. Especially if you were in a deficit.\n\nMany people have told you the answer here you just don't really seem to want to hear it.\n\nMetabolism down regulation and starvation mode are over used buzzwords, at 2k calories you aren't going into starvation mode or hurting their metabolism.\n\nYour metabolism is fine, you are just eating too much food and I think also over estimating calories burned from your workout.",
                                            "score": 6,
                                            "author": "rachman77",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe. I just don’t see how I could cut any. So hungry. All the time. I feel awful.",
                                                    "score": 1,
                                                    "author": "OldFanJEDIot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You might need to change up what you are eating to find foods more satiating.\n\nEating lots of meat is a good start. Also make sure you aren't low on electrolytes, that can cause cravings and make you feel awful.",
                                                            "score": 3,
                                                            "author": "rachman77",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks. I have been taking the electrolytes. I basically just get ravenous. Will try more protein, but I’m already at 120 grams.",
                                                                    "score": 1,
                                                                    "author": "OldFanJEDIot",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How many mgs of sodium/magnesium/potassium are you getting a day? How are you tracking them? \n\nIf I’m electrolyte deficient, I can be absolutely *ravenous.* It can play a huge part in hunger control.\n\nAlso, more protein will help considerably. I’m a 5’5” 135lb woman and I eat 140-160g a day.",
                                                                            "score": 3,
                                                                            "author": "ReverseLazarus",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;Also, more protein will help considerably. I’m a 5’5” 135lb woman and I eat 140-160g a day.\n\nCurious...how many calories a day do you eat?",
                                                                                    "score": 1,
                                                                                    "author": "jjg4l",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I don’t track the electrolytes, but I have an LMNT everyday and also take magnesium before bed. Protein is currently 120 grams a day.",
                                                                                    "score": 1,
                                                                                    "author": "OldFanJEDIot",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Only 120g of protein???\n\nYou should be eating way more protein, especially as a man. I’m a woman and get 130-150g of protein daily and I’m not nearly as active as you are. And my calories are only 1300-1500 per day. \n\nNo wonder you are so hungry! Lower your fat and raise your protein.",
                                                                            "score": 2,
                                                                            "author": "RemarkableMacadamia"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What bf% are you at currently?",
                                            "score": 1,
                                            "author": "jjg4l",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": " Not sure. Above 15%, but below 20%. I guess I need to get it measured. What this does imply is perhaps the constant hunger is from not eating enough protein.",
                                                    "score": 1,
                                                    "author": "OldFanJEDIot"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re near your normal weight which makes it harder to show results on the scale. As others have mentioned your simply over calculating your daily calorie intakes. You also mentioned yourself you’re consuming more than you did. \nLet’s assume we believe the HR monitor and take the low end 300 since we’re try to cut, that puts you around 2000 give or take.\nThe results are showing your getting maintenance calories but if you just want to give re-feed a go that’s totally fine. My take would be eating the same amount of food but lower the calories if starving is an issue.",
            "score": 2,
            "author": "praiserngsus"
        },
        {
            "level": 0,
            "comment": "I don’t think there’s any science out there showing a “refeed” will help break your stall but you can certainly give it a go. Once every month or so I’ll generally have a pretty carb heavy meal. \n\nThat being said the reason for a weight loss plateau comes from one thing and one thing only. You are eating too much. Weight loss isn’t linear but several months of not dropping weight means you aren’t in a deficit. Could you be not tracking your calories quite as closely as you used to? Condiments/sauces/butter/oil can rack up the calories pretty quickly if you aren’t tracking and weighing amounts",
            "score": 3,
            "author": "Mysterious_Chapter65",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s possible, my understanding is your body will compensate and lower metabolism unconsciously. You stop tapping your foot, twiddling your fingers etc…",
                    "score": 0,
                    "author": "OldFanJEDIot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before I did a refeed, personally I'd relax exercise a little for a couple weeks to see how I feel.\n\nIf you're trying to lose weight, don't default to \"eating back\" exercise calories. My suggestion, use the sedentary suggested intake for weight loss. Then after a week or two if you find you're too weak to continue activity levels, then add 100-200 calories per day. \n\nYou're basically an ideal weight now, when you're already at a basically normal weight, when you're in a deficit you'll be hungrier than you were when you were more overweight.\n\nFWIW, weights, yoga and endurance don't burn many extra calories. HIIT can burn some, if you're doing it right, but again, if your goal is weight loss I wouldn't count on those calories burned as helping me lose. Exercise is for health or body composition, weight loss is in the kitchen.",
            "score": 3,
            "author": "AmNotLost"
        },
        {
            "level": 0,
            "comment": "I mean unless you are under muscled 175 pounds at 5'9\" is a great weight. Maybe you are just changing out fat for muscle on a 1 for 1 basis right now, it would explain the hunger.",
            "score": 2,
            "author": "thrillhouz77"
        },
        {
            "level": 0,
            "comment": "Man, I am in the same spot like you only difference im 32M 165lbs. I started overfeeding like 2000+ cals a day. It’s been 1 week and i feel better at least. Not sure if it’s a good strategy thou, need more time to figure it out. Glad I’m not alone.",
            "score": 1,
            "author": "drumbyzz"
        },
        {
            "level": 0,
            "comment": "If you’ve been dieting for months on end it’s time to take a diet break, I’d start adding back like 100 calories a week until you can comfortably get up to maintaining on about 3000 calories with your stats at least with that activity level.",
            "score": -2,
            "author": "SeniorBaker"
        },
        {
            "level": 0,
            "comment": "A possible solution. A 2 nap during your 8 hours. When you feel you are starving plus everything everyone else said on here",
            "score": 1,
            "author": "HopeisnearGodislove"
        },
        {
            "level": 0,
            "comment": "You eat the same calories as I do.",
            "score": 1,
            "author": "BigTexan1492"
        }
    ]
}