{
    "id": "1442mqk",
    "score": 0,
    "title": "Help me research for my mum :)",
    "author": "Pearlnexklace",
    "date": 1686210022.0,
    "url": "https://www.reddit.com/r/keto/comments/1442mqk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey!\n\nMy mum, aged 52, insists on loosing weight through the Keto diet. She got leukaemia this time last year and is only just recovered to her full self. She won’t eat all day and then get home and have dinner. My father will cook a keto friendly dinner and then afterwards she will have yoghurt and berries. She is getting only the nutrients and protein from the one meal and insists she is in ketosis just not loosing weight. I am worried about her eating habits getting worse and causing harm to her body. She tells me she eats keto but in such small amounts surely this means she is just starving herself ? She hasn’t lost any weight because she isn’t that strict with Keto and will still drink 25 cups of teas daily. \nPlease give me advice that can help my mum - thank you",
    "comments": [
        {
            "level": 0,
            "comment": "You can (I even do it) eat one meal a day and get all the food you need in that one meal, I'm even gaining weight with it (along with weight training).\n\nIt's not so much about how much she is eating but it's about what she is eating. If those 25 cups of tea have cream in them that's a good chunk of calories right there, milk too but obviously milks not good for keto.\n\nIt's all depending on what she wants, is she happy and healthy? Awesome, let her carry on, being in ketosis doesn't mean you'll be losing weight, it's simply a state of your body burning fats instead of carbs for energy (of course you can get into keto from starving yourself too).\n\nYou can be on the keto diet and gain fat, it's over simplified of course but it's all about calories in Vs calories out in terms of weight loss. Keto is also a very good natural appetite suppressant, I've not looked into It but I would hazard a guess it's to do with sugar/glucose addiction being killed off, but don't quote me on that, I'm probably wrong.\n\nIf I could give you a piece of advice, try keto for a month and experience it first hand, it might take some of your worries away. I love that you care for your mum so much, you're awesome.",
            "score": 2,
            "author": "SimplyInept"
        },
        {
            "level": 0,
            "comment": "How many calories is she eating? In most cases, calories are THE thing that determine weight loss or weight gain.\n\nHow many net carbs is she eating? If she's eating 20g carbs per day or less, she's in ketosis. (Sounds like you may be using UK/EU style food labels, so the net carbs there is figured a little differently than when you're using US food labels)\n\nWhat are her other stats? (Current weight, height)",
            "score": 1,
            "author": "AmNotLost"
        },
        {
            "level": 0,
            "comment": "Is she eating under 20g of net carbs a day?\n\nIf you’re worried about her having only one meal a day, maybe propose to do intermittent fasting, for example skip breakfast and do only lunch and dinner.\n\nFor how long has she been doing keto?\n\nSome Drs (like Peter Attia) say that fasting can decrease muscle mass, which is important as people age. Maybe your mom can exercise to prevent this or extend a bit her feeding window",
            "score": 1,
            "author": "Captain_Smoothie"
        },
        {
            "level": 0,
            "comment": "It sounds like you're worried for your mom and your mom is very new to keto. \n\nI think the best way to support her and to soothe your fears would be to use the macros calculator in the FAQ here to determine how much she should be eating, then help her use an app like CarbManager to track her food - remember that anything that goes into her mouth should be included (so vitamins, cream in her tea, etc.). \n\nGood luck to both of you!",
            "score": 1,
            "author": "Fable_Writes"
        },
        {
            "level": 0,
            "comment": "How’s she starving herself when she hasn’t lost any weight? She maybe deficient. If she’s drinking that much tea with sugar in it she may not be in ketosis",
            "score": 1,
            "author": "Funny_stuff554"
        }
    ]
}