{
    "id": "144ljcp",
    "score": 4,
    "title": "Low-effort but healthy/fresh snacks",
    "author": "pfizzy70",
    "date": 1686259274.0,
    "url": "https://www.reddit.com/r/keto/comments/144ljcp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have broken my leg and everything is a huge effort. My hubby is about to go back to work, so I'll be on my own for long periods in the basement. I have fridge, freezer, and air-fryer, and whatever I get hubby to bring me from upstairs. I've barely been eating, but need some ideas for what I can quickly make for myself with not too much work. Getting tired of mixed nuts, fat bombs, and pork rinds. Also just very tired in general...",
    "comments": [
        {
            "level": 0,
            "comment": "One of my favorite 5 minute stoner snacks is to take a low carb tortilla, spread cream cheese on it, sprinkle it with a cinnamon and swerve mixture, roll it up, cut it into pinwheels, and then fry the pieces up in butter. 🤤🤤🤤",
            "score": 13,
            "author": "Folk_Punk_Slut",
            "replies": [
                {
                    "level": 1,
                    "comment": "From one stoner to another I appreciate this 🤣🤣",
                    "score": 8,
                    "author": "Lavender_ballerina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "String Cheese? Avocado?",
            "score": 3,
            "author": "wutdefukk"
        },
        {
            "level": 0,
            "comment": "Spread cream cheese on deli meat, wrap around a pickle, and nosh. Or just pickles and deli meat on its own 😂 \n\nmaybe have hubby boil some eggs in advance for you, I like hard boiled eggs with Dijon mustard and paprika, it’s kind of like a lazy deviled egg\n\nBaby carrots and ranch",
            "score": 3,
            "author": "BiomedBabe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Root veggies bad?",
                    "score": 2,
                    "author": "idunnoprollyok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "4.5 net carbs per half cup… enjoy in moderation ;)",
                            "score": 3,
                            "author": "BiomedBabe1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a fan of sardines.  One of my goto meals is just chicken thighs with salt and pepper air-fried.",
            "score": 2,
            "author": "contactspring"
        },
        {
            "level": 0,
            "comment": "I'm recovering from a knee dislocation! Not being able to walk normally sucks! \n\nLots of bone broth. Cooked to crisp ground beef drenched in butter, portioned and frozen solid, like a savory fat bomb. Premixed kale salad in jars (lasts for a few days). Peanut butter on celery sticks.",
            "score": 1,
            "author": "cell-of-galaxy"
        },
        {
            "level": 0,
            "comment": "I really like tuna fish + mayo with diced pickles, or those little balls of mozzarella.",
            "score": 1,
            "author": "latenightsnackattack"
        }
    ]
}