{
    "id": "144ola7",
    "score": 35,
    "title": "DEXA Scan and ketogenic diet",
    "author": "Sunset1918",
    "date": 1686266471.0,
    "url": "https://www.reddit.com/r/keto/comments/144ola7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I had a DEXA scan today for bone density. My new dr ordered it bc I'm postmenopausal, and was a vegan for yrs. I also don't take calcium supplements. \n\nResults? My bones are fine! He was amazed bc he said many postmenopausal women who never took hormone replacement therapy get osteoporosis from lack of estrogen. He thinks my ketogenic lifestyle of the past 6 yrs or so, bc it includes a lot of calcium-rich dairy,  prevented me from osteopenia and/or osteoporosis!",
    "comments": [
        {
            "level": 0,
            "comment": "I agree with the poster above that it isn't from calcium. It's probably because you get more K2 and D3 since being on keto, in combination with more calcium.",
            "score": 8,
            "author": "RaptorTickles-"
        },
        {
            "level": 0,
            "comment": "Calcium supplements aren't really that beneficial. A person can get enough bioavailable calcium from three serves of dairy per day (fine now you're not vegan). What you should look at supplementing with is vitamin K2 (MK-7 specifically), along with vitamin D3. Vitamin K2 MK-7 stimulates a protein in the body which binds with the calcium and directs it into the bone and away from the soft tissues. This is probably why studies show that vitamin D supplementation alone isn't that great as you'll see an increase in blood calcium, but it isn't going anywhere. But when combined with vitamin K2 MK-7, it is much better for the bones. Alternatively you could eat natto (Japanese fermented soybeans) three times a week, which has the highest amount of vitamin K2 MK-7. But most western people don't like the flavor.",
            "score": 8,
            "author": "Remarkable_Light_195",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nobody likes the flavour. \n\nYou have to have it with dashi soy sauce + mustard, then whip it into clouds.\n\nThen it becomes an umami bomb. Eat with hot rice.",
                    "score": 5,
                    "author": "kwpang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Grass-fed/ finished beef, poultry, fish, eggs, butter, nuts/seeds, berries, water to drink.",
                    "score": 7,
                    "author": "Sunset1918",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a 180 in diet, isn’t it?  I hope you’re feeling great.",
                            "score": 4,
                            "author": "robintweets",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel fantastic!",
                                    "score": 1,
                                    "author": "Sunset1918",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great to hear!!!",
                                            "score": 2,
                                            "author": "robintweets"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is K2 MK7 one supplement?  Where so u buy ans whats the dose?",
            "score": 2,
            "author": "colsie78"
        },
        {
            "level": 0,
            "comment": "You do know that bone density cannot appreciably improve past your late 20's, right?",
            "score": 1,
            "author": "TY-Miss-Granger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just reporting what my dr said.",
                    "score": 1,
                    "author": "Sunset1918",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe you- it is crazy how little the average GP knows about nutrition.  I think they \"bend\" their advice to try to urge behaviors in their patients.  They mean well but it also shows their lack of knowledge.\n\nYou need to have all the bone density you are going to have by age 30 because it is only going to go down from there.  And you sure don't need dairy to do it.  I have always despised dairy and would almost never have it.  But I did lift weights pretty seriously in my 20's (and beyond.)  The PT who did my first DEXA scan commented that she could tell I lifted weights at some point in my life because my bone density was so much higher in my upper body than most women.  I measured in the 87 percentile.\n\nI assume you had a DEXA to test your bone density?  Did you actually see the percentile numbers change?  That would be pretty miraculous.  What were they, if you don't mind sharing?",
                            "score": 2,
                            "author": "TY-Miss-Granger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They told me my score was -1 and that that's normal. They also put it in my online medical records but I haven't actually seen any paperwork. I'm assuming my dr will get that.",
                                    "score": 1,
                                    "author": "Sunset1918",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah ok - \n\n\\-1 is actually considered osteopenia, so not as severe as osteoperosis but going that way.  For reference, my T score was 1.1.  That is a bummer but at least it is not worse and you know, so you can be careful.  The next time you get a DEXA, ask for the full print out.  It is really very interesting and you can see how your bone density varies in various bones and from right to left.  Plus it can give you your body fat percentage and actually show you where the fat is.  Pretty cool test.",
                                            "score": 1,
                                            "author": "TY-Miss-Granger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://www.adventhealth.com/hospital/adventhealth-winter-garden/blog/what-a-dexa-scan-tells-you-about-bone-health#:~:text=Normal%20bone%20density%3A%20%2D1.0%20or,Osteoporosis%3A%20%2D2.5%20or%20lower\n\nThey said I'm fine, normal bone density. This link seems to agree. Unless I typed it wrong?",
                                                    "score": 1,
                                                    "author": "Sunset1918",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Interesting!\n\nI am looking at my last report right now and the scale describes -1 one as \"osteopenia.\"  I guess I am not too surprised at the difference because optimal and normal often get interchanged with each other and they are not the same.  One time, when I was going over blood work with my doctor, he described my total cholesterol, which was 211 at the time, as \"fine.\"  All I could think was \"it was sub 170 most of my life and 134 when I was vegan and you call 211 'fine'???\"\n\nWell, I am glad you are doing well.  It sounds like your diet changes have been really positive so that is great :)",
                                                            "score": 1,
                                                            "author": "TY-Miss-Granger"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}