{
    "id": "144od2v",
    "score": 8,
    "title": "Help with electrolytes?",
    "author": "SnooStrawberries7110",
    "date": 1686265904.0,
    "url": "https://www.reddit.com/r/keto/comments/144od2v",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I’ve read the FAQ on electrolytes but I’m still struggling pretty hard with what I’m supposed to be doing. From my meals that I eat, my daily intake appears to be 1500mg sodium, 1400mg potassium, and only like 100mg calcium. I don’t know how to calculate magnesium since it doesn’t appear on any of the nutrition labels.\n\nI guess I can pretty easily add more sodium to my diet by adding salt to my meals (apparently pink Himalayan is best?). But I’m struggling with how to add more potassium, calcium, and magnesium. I can’t really figure out what foods to eat to get these electrolytes but not add any more carbs? Should I just drink a ton of those LMNT things?\n\nSorry if this has been asked a lot, I just have read a lot of information and it all kinda confuses me and I just don’t know how I’m supposed to get my electrolytes in balance :(",
    "comments": [
        {
            "level": 0,
            "comment": "“Welcome to r/keto! It sounds like you’re asking a question about electrolytes, which is a topic that is covered in our FAQ. Please read the following sections\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_adapting_to_a_low_carb_lifestyle\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_how_do_i_replenish_electrolytes_when_i_am_deficient.3F\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_ketoade.3A_your_best_weapon_to_fight_the_flu\n\nAnd consider searching for other posts on this topic. As a reminder, please read our FAQ before posting to r/keto. It can be found at https://www.reddit.com/r/keto/wiki/faq. Please also review our posting rules and community guidelines.\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/keto) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "No salt salt is potassium. \n\nYou could take a magnesium supplement.",
            "score": 3,
            "author": "upandatom85"
        },
        {
            "level": 0,
            "comment": "Do you feel you need to do this? It’s not a mandatory thing.",
            "score": 4,
            "author": "Zackadeez"
        },
        {
            "level": 0,
            "comment": "Take an electrolyte supplement and you don't have to worry\n\nhttps://www.hollandandbarrett.ie/shop/product/sis-go-hydro-lemon-60031713",
            "score": 1,
            "author": "Rakatack"
        },
        {
            "level": 0,
            "comment": "I like the LMNT mixes. I use them all the time because I sweat like a pig when exercising. They are excellent",
            "score": 1,
            "author": "duck_dork"
        },
        {
            "level": 0,
            "comment": "That's a lot of sodium, I sip on bone broth just once a week because I sweat alot at work and can feel when my salts are low",
            "score": -1,
            "author": "RegularDragonfruit74",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s not alot of sodium at all really",
                    "score": 3,
                    "author": "Gunther_Reinhard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eat more spinach. It’s loaded with potassium and magnesium. I stopped supplementing potassium when I noticed I was going overboard, between my diet and then adding 2-4kmg on top of that, I was seriously close to overdoing it. Like funny chest feelings. I feel now as if I get enough just from foods. If I go overboard with salt I will add a scoop of potassium powder to negate those effects and it seems to work ok. Main thing is to see what works for you. Just an FYI though you can get really hurt from taking too much potassium so I wouldn’t ever go supplement above the recommended amounts here if you are also eating foods with potassium too.",
            "score": 0,
            "author": "Gunther_Reinhard"
        }
    ]
}