{
    "id": "145124b",
    "score": 1,
    "title": "[2023-06-09] - [Weekend Victory Lap] - Have you had a personal victory this week? Share it with us!",
    "author": "AutoModerator",
    "date": 1686304834.0,
    "url": "https://www.reddit.com/r/keto/comments/145124b",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/keto/wiki/keto_in_a_nutshell)",
        "https://www.reddit.com/r/keto/wiki/faq)*."
    ],
    "postText": "Hello /r/keto Community!\n\nYou've all been working so hard and we love hearing about all of your personal victories! Clothes too big? Friends and family noticing a difference? Skipped over something unhealthy? Please use this thread to share any of your Scale or Non-Scale Victories with us!\n\nMake sure to give us some background - what brought you to keto? Do you have any specific goals that align with your victories? Have you tried something new that led to your success? What's the next step for you?\n\nSince this thread is likely to fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts and support your fellow community members.\n\n*If you're new to* /r/keto *and need some info, start with* [*Keto in a Nutshell*](https://www.reddit.com/r/keto/wiki/keto_in_a_nutshell) *and* [*the FAQ*](https://www.reddit.com/r/keto/wiki/faq)*. Or, if you have a question that doesn't seem to be covered, head on over to the Community Support thread (pinned to the top of the subreddit) and ask the community!*",
    "comments": [
        {
            "level": 0,
            "comment": "I hit 10,000 calories of exercise this week.  More than double my typical weekly output.\n\nMon-Friday has been cycle 8 miles to the gym, sauna, swim, another sauna, cycle 8 miles home.",
            "score": 3,
            "author": "silasgreenback"
        },
        {
            "level": 0,
            "comment": "Went from 325-295. GW is about 200 I also managed to run a 10 minute mile thanks to steadily increasing my runs every day! I started run/walking then increase to more running less walking till I could do it. \n\nMade an investment to pick up a Garmin 965 and the data is so insightful to my works out and so helpful.\nI believe in everyone!",
            "score": 2,
            "author": "luis2423"
        },
        {
            "level": 0,
            "comment": "Just feeling good staying in my lane and waking up in the morning knowing I stuck to it the day before.\n\nI used to buy riced cauliflower at Sam's Club, but it hasn't been available, even online. Anyone else notice this?",
            "score": 2,
            "author": "LongjumpingPlant607"
        },
        {
            "level": 0,
            "comment": "I posted this in the community thread, but I'm 2 weeks in &amp; down 5 pounds &amp; definitely de-bloated. Also, while I've definitely gone over my calories on nights when I er...partake in the devil's lettuce lol...I've not gone over my carbs, and I've kept my calories to like 1,700 on those nights rather than 2,700 :P My goal right now is just to keep on keepin on - trying to lose about 9 more pounds.\n\nI've lost weight many times through tracking, but I decided to try keto because of others in my life who love it so much. I'm not sure if I'm experiencing non-scale effects or not. I don't have a very good memory for what things are like day to day.\n\nFavorite new product this week is Wegman's cheddar bacon chive cheese dip/spread. It's SO GOOD on burgers!\n\nOh...and cloudies cloud bread!!! Life saver. i know I can make it myself, but I have 2 young kids and no energy right now.",
            "score": 1,
            "author": "saladflambe"
        },
        {
            "level": 0,
            "comment": "It’s crazy that I wake up with energy instead of running to get my coffee. I’m drinking much more water these days and feel amazing. Im one week in and Sunday weigh-in shows 11lb loss. Tracking macros is not as hard as I thought it would be. Im using the chronometer app.",
            "score": 1,
            "author": "It_wasAll-aDream"
        }
    ]
}