{
    "id": "145ox7s",
    "score": 1,
    "title": "Back on keto after a 3 year hiatus - Potassium/electrolyte question",
    "author": "Lexi_Liu",
    "date": 1686366585.0,
    "url": "https://www.reddit.com/r/keto/comments/145ox7s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI took a 3 year break from keto but now I want to get back on the wagon. I (F41) am currently sitting at 76kg (171cm) after giving birth 6 months ago and would ideally like to get back to around 60kg. \n\nI struggled with my potassium intake in the past on keto. Any tips for making sure I'm getting enough potassium, magnesium, etc?\n\n&amp;#x200B;\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "“Welcome to r/keto! It sounds like you’re asking a question about electrolytes, which is a topic that is covered in our FAQ. Please read the following sections\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_adapting_to_a_low_carb_lifestyle\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_how_do_i_replenish_electrolytes_when_i_am_deficient.3F\n\n* https://www.reddit.com/r/keto/wiki/faq#wiki_ketoade.3A_your_best_weapon_to_fight_the_flu\n\nAnd consider searching for other posts on this topic. As a reminder, please read our FAQ before posting to r/keto. It can be found at https://www.reddit.com/r/keto/wiki/faq. Please also review our posting rules and community guidelines.\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/keto) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Spinach, broccoli, mushrooms, leafy greens all have a nice amount of potassium.",
            "score": 3,
            "author": "silasgreenback"
        },
        {
            "level": 0,
            "comment": "You can make an electrolyte drink that you can drink throughout the day with the optimum quantities of potassium, magnesium, sodium etc.",
            "score": 2,
            "author": "i--am--the--light"
        },
        {
            "level": 0,
            "comment": "I struggle with potassium any time I do keto, always ended up with the worst leg cramps in the middle of the night. I started taking Up and Up (Target) potassium supplements with my daily vitamin when I break my fast (most vitamins should be taken with food) and haven’t had a problem since.",
            "score": 1,
            "author": "Away_Ad_3641"
        }
    ]
}