{
    "id": "146tmjd",
    "score": 31,
    "title": "Did you manage to stay on Keto when you had kids?",
    "author": "milespiles",
    "date": 1686489147.0,
    "url": "https://www.reddit.com/r/keto/comments/146tmjd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Was on keto for 4-5 years, lost 70 pounds and maintained it.  My son is now 2 and eating pretty much the same food as us, and I just stopped doing keto. Making two different meals all together is pretty much impossible with work/daycare/time. I know there's a lot of useless Keto bashing around (my doc still thinks i'm doing wrong), but I still strongly believe that developping brains need a lot of carbs. \n\nGaining weight slowly :/... Any tips?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm a mom of 5 aged 1.5-13, I prepare almost every meal for my family of 7. Essentially, I start every meal by picking a protein and a veggie, that's what I eat. Then I add whatever carb makes sense for my family, or just make a family meal, then substitute or skip the carb for me. It doesn't always work, and sometimes I just eat leftover turkey breast and some vegetables, while my family eats spaghetti.\n\nExamples\nI'll make chicken, I'll separate my portion and chop their's up and add to noodles or rice \nThey have hamburgers, I'll have a bunless burger.\nTacos/nachos, I have a burrito bowl.\nWe like to make our own pizza, I use a keto tortilla as the \"crust\"\n\nI won't lie, it is hard to smell some of my old favorite foods, and resist. But I remind myself of the mental benefits and weight loss after struggling with my weight for so long",
            "score": 47,
            "author": "Dancingfiremama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, its not that hard to be honest.",
                    "score": 0,
                    "author": "Rakatack"
                },
                {
                    "level": 1,
                    "comment": "I have 5 kids and needed to hear this ! I was struggling with whether it's practical to eat so differently than my family.",
                    "score": 1,
                    "author": "Wildchildanything",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's difficult if you approach it as having to prepare different meals. But if yours is just a part of what they're eating anyway, the part without carbs, it's pretty easy. \n\nBut gone are the days of a carb-y casserole that feeds everyone.",
                            "score": 1,
                            "author": "Geeko22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brains need fat, not a lot carbs. \n\nIf you want to give carbs, make a 3 part plate for everyone and just take out the carbs for yourself. \n\nI went keto when my daughter turned 3. 3 years later and one more kid and I’m still going strong. My wife is a “balanced meal” proponent so they have more carbs than I prefer but when she’s away for work, it’s more animal based meals.",
            "score": 56,
            "author": "Zackadeez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was just coming to say this!",
                    "score": 6,
                    "author": "fkeehnen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Doctors are ignorant of alot of things.",
            "score": 13,
            "author": "Chance_Fisherman1918"
        },
        {
            "level": 0,
            "comment": "Or meals consist of a meat, vegetable and a carb (generally speaking).\n\nI just omit the carb, and the vegetables for the most part, depending.",
            "score": 8,
            "author": "morbidangel27"
        },
        {
            "level": 0,
            "comment": "Make some combination of meat and low carb veggies for the family and make him a carby side like potatoes or bread or rice. Then you both eat the meat+veggie and HE gets the carbs. 👍🏻",
            "score": 16,
            "author": "ReverseLazarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yhea that makes a lot of sense! I just became harder i guess and I'm lazy/looking for excuses.",
                    "score": 6,
                    "author": "milespiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is easier to make excuses when you’re feeding kids the stuff you can’t have, but recognizing they are indeed excuses is the first step towards staying on track. 🙂 I’ve eaten keto nonstop since 2017 with a kid in the house and I’m nothing special, anyone can do it! The way I feel on keto is better than any bowl of mac &amp; cheese will ever taste.",
                            "score": 15,
                            "author": "ReverseLazarus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I pretty much cook the same foods without the carbs for me.  Burger night=bunless burger for me. Taco night= taco bowl for me.  Pasta Alfredo night=Alfredo sauce over grilled chicken for me. Potroast night= meat and asparagus for me. Pizza night= pizza bowl for me.  Everyone loves bacon and eggs or a good omlette. \n\nI honestly don't have time to make two different meals, so this is how I work it out.",
            "score": 6,
            "author": "fbombmom_",
            "replies": [
                {
                    "level": 1,
                    "comment": "What in the world is a pizza bowl?",
                    "score": 2,
                    "author": "redrabbit1289",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally pizza in a bowl. All the toppings, no crust.  I use a small, glass baking pan or oven- safe bowl. Spray with cooking spray, put the cheese down first, pizza sauce, then the rest.  Bake at 350 for about 15 minutes.  I like it so much better than \"crust alternatives.\"",
                            "score": 2,
                            "author": "fbombmom_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having little kids makes it hard, they waste so much food too it's hard not to eat some. \n\nWith my wife and two little one (5 &amp; 3) I just eat the meat and veggies when I cook for my family.\n\nPasta with meat sauce? I separate some of the ground beef and sauce into a pan/dish and melt cheese on it while my family eats it normal. \n\nSteak or another meat with veggies and rice/potatoes? Just eat the meat and veggies.\n\nTaco night. I use lettuce wraps while they use tortillas.",
            "score": 5,
            "author": "Hobbles_vi"
        },
        {
            "level": 0,
            "comment": "We do more animal based than keto with our baby. She has fruit in addition to whatever we eat and sometimes I finish her fruit. I think not keeping junky carbs in the house is the easy answer to this. You can choose to keep whole food carbs like fruit, rice or potatoes. But even if you do cheat on those foods its not as addictive and nutritionally empty as processed carbs like chips, pies, cakes, cookies.",
            "score": 4,
            "author": "Admirable_Split4896"
        },
        {
            "level": 0,
            "comment": "There is a nutritionist named Maria Emmerich who has raised her two kids on keto basically their whole lives (they were adopted at 4 months and 18 months).  They are happy, healthy kids who are doing fine.\n\nMy son, as a toddler, naturally preferred a lower carb diet - he used to eat protein, veggies, nuts and seeds, and then fruit as his carb choice.  Now that he’s older, he’s strictly keto.  His carb-heavy middle school years lead to T2D and NAFLD (definitely genetic factors involved - his grandfather has diabetes), which keto has put into remission.\n\nParenting decisions are a personal choice, but kids don’t need to have bread and pasta to be healthy.",
            "score": 9,
            "author": "Repulsive_Belt7954"
        },
        {
            "level": 0,
            "comment": "As a kid my parents restricted my diet heavily and I would binge eat anything I could get my hands on when they weren’t around. Because of that I don’t restrict my kids food whatsoever and so far, they have a great relationship with food. I too believe a well rounded diet including carbs is best for kiddos.\n\nAs for meals, I make the exact same foods I always made. Pasta and meatballs? I skip the pasta and eat more salad. Burgers? No bun please. Steak and baked potatoes? I make extra veggies for myself. Sunday roast? Mashed cauliflower instead of mashed potatoes for me. It’s honestly super easy to do. Even pizza night is fine, I just order dry rub wings and indulge in the few extra calories. And much to my husbands dismay, I steal the toppings off a slice or two. \n\nIf this is going to be a lifestyle for you, you must make it part of your pre-existing life.",
            "score": 10,
            "author": "mrck119"
        },
        {
            "level": 0,
            "comment": "I’m doing keto now with a two year old. It’s still early days for me so you’re much more experienced here.  But anyway, I mostly meal prep for myself (grill a zillion chicken breasts or whatever), reheat/ chop into an enormous salad for myself.  I bought a rice cooker and it’s easy to make a huge batch for everyone else that stays perfect all day (seriously, these are worth the money).  Then I’m only ever really cooking for my toddler and everyone else (including me) is just assembling food.\n\nFor toddler I try to switch up the whole grains and I mostly make a pizza for him every day from scratch which I know sounds insane but literally takes 12 total minutes of mostly baking/inactive time.  Toddler eats the entire thing, veggies included every night so it is a win.  Let me know if you want the quick recipe, I actually enjoy doing this every night even after my work day, run/lift, and the insanity of being a toddler parent.",
            "score": 5,
            "author": "Miles_and_Gainz",
            "replies": [
                {
                    "level": 1,
                    "comment": "After you cook the rice you can put it into plastic bags and freeze. 3 minutes in the microwave and ready to eat",
                    "score": 2,
                    "author": "basketma12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The body will *manufacture* the glucose that organs and brains use. Also, we don't use a *ton* of it. A few grams will work.\n\nAnyway, I think it is kind of complicated to put kids on keto (if their health is not already complicated). Plus, their active bodies will burn the carbs better. Most young kids are running even if they are only going 30 feet. Still they should not be on very high carbs. Weight gain is a sign of having too much (or maybe insulin resistance), especially if they already had their pre-teen growth spurt. But can they do keto, yes... but maybe it complicates things for them. It's not totally necessary for all kids. Going a day or two without carbs weekly, could probably fix insulin resistance for most kids (assuming their blood sugars do not go up to 300 for the rest of the week).\n\nEdit:\n\nThere are some carnivores whose kids do great on meat and fat 99%. But those kids may want the diet for different reasons, or they just have not had opportunity to get hooked on processed foods or junk foods.",
            "score": 4,
            "author": "Magnabee",
            "replies": [
                {
                    "level": 1,
                    "comment": "If the kids are gaining too much fat they’re just eating too many calories. People should just let there kids eat a balanced healthy diet and not force them onto restrictive diets.",
                    "score": 1,
                    "author": "SeniorBaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think parents can lower carbs/sweets at home without announcing a diet plan. They can just buy different things or just buy only one sweet thing a week. But going a day or two without carbs is not really restrictive in my view. It's healthy. There is a lot of other foods to eat/buy. Kids should not become reliant on sweets.\n\nAnd frankly, no one knows what a balance diet is. That is just a diet plan. It won't help an insulin resistant kid... unless you want to harass them every day about a balanced diet.",
                            "score": 2,
                            "author": "Magnabee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If your kid is a healthy weight and active odds are they are not insulin resistant.",
                                    "score": 1,
                                    "author": "SeniorBaker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, maybe. It depends on if you know what insulin resistance is and how to recognize it. I think lowering carbs or sweets once or twice a week is a prophylactic thing. But not all will need that.",
                                            "score": 1,
                                            "author": "Magnabee"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I cook the same for the whole family, I just add an extra vegetable dish and don't eat the starch that I made for my husband and kid. For me it's easy to resist cheating because the side effects of going in and out of ketosis are very unpleasant.",
            "score": 2,
            "author": "thespottedbunny"
        },
        {
            "level": 0,
            "comment": "Op im a mom  to a tween boy. Im doing keto, he isnt.\n\nWith kids, they are pucky as f eaters. If u dont want to cook seperatw meals, dont. The thing is, if u dont u make it where the carb sub isnt noticeable ad keto so u dont have to alter, or u do it where tge carbs are seperatly cooked then topped.\n\nExamples of keto kid fteindlt family meals.\n\nHot dogs/burgers. I recently foubd keto hot dog buns. I eat one hot dog with a keto bun, add shredded cheese and micriwavr the bun with cjeese to mt while i heat the dog on stove. \n\nU can use those keto buns foe the kid with say home made air fryer veggie chips, add kimchi or saurkraut to ur hot dog, sigar free keychup to kiddos. Throw in extra meat as a side for satiety since the hot dog is mlre fat than protien. Even a couole boiked eggs woukd do.\n\nWith burger , add alvacado, air fried veggie fries, cheese, tomato, greens or lettoce, etc to urs. Without a bun or use a low carb bun sub. Put ketchup and maybe cheese on kiddos. Serve them the veggie chips or fries, but nix the kimchi and toppings they likely wont like. \n\n\nTacos. Use fresh onion and peppers with eggs or otger protien, or do frozen bell pepper and onion blend. Cook in keto safe fat. Add to low carb tortilla or lettice wrap for u with toppings , use liw carb tortilla and likely no toppings for kiddo. \n\n\nLow carb pizza. Ive gor three options for crusys, one being using a low carb tortilla, one ising italian sausage, and one using egg whites whipped into aerangue and a bit of coconut flour added in then baked. Any of these u would not have to alter at all for kiddo unless they dont like veggies on their pizza and u do. But if ur not into veg on pizza as toppings, just do any of these as a pepperoni pizza with a good old side salad for ur veg and just let kid eat pizza. \n\nThen there are options where u do carbs seperate so u have ur keto iption, kiddo does non keto. Fried rice for example. U do stir fry. Do fried rice separate or do cauli fried rice for u and normal fried rice for kiddo. \n\nSpaghetti/alfredo/pesto. U make kelp or shiritake noodkez for u, normal noidles for kiddo. Or do kelp/shiritake/veg noodkes for everyone. \n\n\nSouos and stews, u dont have to make a keto and non keto optuon at all. Same with yogurt or cottage cheese bowls. Tuna salad/chicken salad sandwhiches, even ehg salad, use a couple slices of home maxe carnivore bread. U can use that for the whole family inuding kiddo and nobody would know. \n\n\nHeck even ham and cheese sandwhich on varnivore bread is a option for kuddo, but add toppings like lettuce, tomato, mayo, etc tp urs. Do a salad or home mafe veggie chips ad ur side, veggie chips for kid. Throw in some strwaberries for dessert maybe with lillys choc chips. Easy keto picniv lunch or gamily dinner. No fuss, no muss, no seperate meal or side effort needed .\n\nEgg, meat and veg frittatas, scrambled eggs and bacon with pancakes made if egg, protien powder, and a bit of mashed banana and baking powder and topped with berries cooked in ghee with stevia and cinnimon and nuts and or hwc /sugar free whipoed cream is a everubody breakfast /breakfast for lunch or dinner option. Stuff kids wont fuss over, and are as keyo fteindky as it gets. \n\nHeck, potato pancakes are something i learned about with my ex. kids like them too. But if u use egg, coconut flour, and grated eggplant u can make a keto version and pair with good old eggs and bacon. Both kid and u eont tell the difference it u seadon and cook right.",
            "score": 2,
            "author": "missy5454"
        },
        {
            "level": 0,
            "comment": "I just add rice pasta or potato to every dinner I make for the kids. So my meal is keto and theirs is not.",
            "score": 3,
            "author": "AdorableEmphasis5546"
        },
        {
            "level": 0,
            "comment": "The brain needs carbs for sure. \n\nAnd your liver makes all you need.",
            "score": 3,
            "author": "KetosisMD"
        },
        {
            "level": 0,
            "comment": "Eating keto with kids is like playing on hard mode. I couldn’t do it till my daughter was weaned, and I’m still like 2 seconds from sabotage every day.",
            "score": 4,
            "author": "cwassant"
        },
        {
            "level": 0,
            "comment": "Why is cooking two different meals impossible? I am used to cooking 3 different meals for me, my kids and my wife and if you plan it smartly you can do it all at the same time. If you cook for example meat, with potatoes and vegetables, you just cook the chicken, cook spinach and cook potatoes. You can eat the meat and the spinach is for all of you and you mash up the potatoes for your kids and leave a few hole for your partner. There are plenty more tricks, you can cook keto Bolognese sauce and throw it on spaghetti for your kids and on spiralled courgette for yourself. And there are lot of meals you can cook and freeze. Cook 3 beef burgers, put two on buns for your partner and your kid, and yours between two lettuce leaves. And you have only 1 kid it seems, which is quite a breeze compared to having twins, or triplets. So see it from the positive side. \n\nAnd brains run on glucose or ketones, not carbs",
            "score": 2,
            "author": "Rakatack"
        },
        {
            "level": 0,
            "comment": "It’s easy to add a carb for a kid.  Eggs and bacon for breakfast?  The kid gets a piece of buttered whole grain toast.  Steak and salad for dinner.  Easy to air fry potato wedges ( or baked potato) for the child.  You can also add those microwaved pasta cups ( but don’t use the nuclear cheese powder, add shredded cheese and butter.). Takes three minutes.  Carbs are cheap so if he doesn’t eat the toast it’s not a big time or money investment.  Also fruit!  Add a serving of fruit… instant carbs.",
            "score": 1,
            "author": "dragfan99"
        },
        {
            "level": 0,
            "comment": "[This](https://youtu.be/LonrxK3wf4E) maybe helpful.",
            "score": 1,
            "author": "shiplesp"
        },
        {
            "level": 0,
            "comment": "I would never ever restrict carbs for anything below a young adult. It doesn’t even matter if it’s healthy. Did not someone lose custody of their children after being what is considering and predatory mother? Enforcing a vegan diet?\n\nBetter get a pediatrician sign off before going down that route.\n\nUnrelated, i started keto for physique sports after having a family of six. Eating keto is really easy. Easier than eating a traditional American diet. Saved time, not the reverse. \n\nI cook all my meat and veggies on Sunday. That’s what i eat all week. Also allowed me to really focus on what’s best for them without having to worry about anything else.\n\nSeriously, just eat Whole Foods and places like Costco/Sam’s club make sturdy easy to buy a weeks worth and prepare it at once.",
            "score": 1,
            "author": "omniblue"
        },
        {
            "level": 0,
            "comment": "I give everyone the same meals, but just leave the carbs off my plate. If it’s pasta I’ll pour my sauce over steamed cabbage or green beans. If it’s curry I just have extra curry but without the potatoes and rice. If it’s pie I take a portion of filling out for myself and cover the rest with pastry. It just requires a bit of practice and planning.",
            "score": 1,
            "author": "Irksomeone"
        },
        {
            "level": 0,
            "comment": "I have a 2 year old and an 11 year old. I did keto before I had the 2 year old and now for the past 6 or so months. Most of our household meals are meat with a lower carb veggie. The 2 year old is a big fan of green beans which we tend to have frequently. \n\nMy husband does most of the cooking (woohoo!!) so he has to deal with it more than I do from that perspective, but recently we signed up for a meal service to mix things up for him and the 11 year old. Most of the meals we pick aren't keto-friendly so I usually have leftovers. We usually make extra meat for most of our basic dinners so that helps when we have things I won't eat. \n\nI do cook breakfast on the weekends sometimes, like pancakes or French toast for the family, but I'll just make eggs for myself. Sometimes we do eggs and bacon and throw biscuits in the oven or they'll make toast. \n\nWith spaghetti, they'll have regular noodles and I'll have frozen noodles. For taco night, I make a salad while they use taco shells. For burgers, I just skip the bun. We have a great keto meatloaf recipe that we all like that we haven't had in a while. \n\nMy diet is my choice, but I don't have to have a carb-free house to stick with it. We have plenty of things with carbs for the kids or my husband that I wouldn't eat under other circumstances anyway.",
            "score": 1,
            "author": "guacsteady"
        },
        {
            "level": 0,
            "comment": "It’s harder for sure; mentally!\nI have 4 kids 8-17 and our house ALWAYS has a high rotation of fruit and carbs and nuts and sweets and crackers in it - so you have to be more disciplined \n\nI watched an interesting video of how, when you’re mentally exhausted your brain is wired to not be able to make rational decisions very easily (hence why supermarkets mentally wear you down before you get to the chip/chocolate aisle) and are more likely to make impulse choices.\nI find that the hardest part. Later in the day when the mental overload has kicked in; to NOT eat what’s quick and available.",
            "score": 1,
            "author": "SnooPredictions5635"
        },
        {
            "level": 0,
            "comment": "I slowly gained it back until I gained back all 90 lbs and I wish I had caught it before I slowly gained it all back. Maybe plug in calories and eat lower carb but not keto?",
            "score": 1,
            "author": "Electronic_Artist709"
        },
        {
            "level": 0,
            "comment": "From what I have learned, any glucose your body needs (this includes babies and children), your liver will supply via gluconeogenisis. There isn't really any reason to take in carbs from your diet, besides just \"liking\" to eat them, or if there is a food shortage and all there is to supplement the protein and fat are rice, beans, grain, or vegetables. Otherwise, there is really no need.\n\nI've had six children within a 10 year window. For four of those pregnancies, I was not living a ketogenic lifestyle. My first two, I was actually more on a plant based diet, nutritarian way of eating (with fish and turkey meat occasionally), vegan at times (not good for me or babies). The next two pregnancies, I was more of a standard American diet, or you could say standard Filipino/Asian diet. My last two pregnancies, I was low carb/keto. I am currently more ketovore and possibly going to be on my seventh pregnancy. Which I will more than likely keep the ketovore way of eating, because I feel best this way.\n\nI can say that living a ketogenic lifestyle has fared much better than any lifestyle I've lived. I was incredibly inflamed before, living with chronic pain and obesity, even when doing plant based whole foods (since there was fruit, whole grain, etc, you get it).\n\nMy children and my husband are not keto, but I encourage them daily to make informed choices about what they put into their bodies and on their bodies. \n\nI'm not sure if any of this information is helpful, but long story short, yes, living a ketogenic lifestyle is sustainable and doable with family members who are keto or not. Cooking separate meals and preparing ahead (like a prep day for your meals) is just a reality if one wants to live the ketogenic lifestyle with or without the family following it.\n\nMany have already shared useful tips in preparing your personal meals and your family's meals. Like many, I simply cook a separate (usually uncomplicated) meal for myself and just cook the usual somewhat healthy, balanced whole food  meals for my family. It isn't always easy, but worth it to stay on the path and even show my loved ones they can do it too.\n\nI hope you can find a way to sustain the ketogenic lifestyle. You know from many years of living it how great it is for your health and general well being. \n\nBest of luck!",
            "score": 1,
            "author": "david1ten8"
        },
        {
            "level": 0,
            "comment": "You can always save the carbs for snacks and sides, there's no need to make it a feature of your dishes.",
            "score": 1,
            "author": "niko4ever"
        },
        {
            "level": 0,
            "comment": "My roommates (keto) have 5 kids (who aren't). It basically comes down to a couple different strategies:\n\n* They have \"dinner\" and \"kid dinner\" when making two meals makes more sense. Things like pizza or frozen breaded meats or whatever don't make sense as an input into keto, so they'll just cook that and then also make an adult keto dinner. \n\n* They'll make food which is keto and then the kids will have that in addition to bread / fruit / whatever. \n\n* Sometimes the meals are straight keto, and snacks throughout the day are carby instead. So like they'll make a giant pile of eggs and bacon as a meal and then the kids can have bread / fruit then or later.\n\n* The kids will also make their own meals or snacks or each other's meals or snacks when that isn't physically possible, which seems to work well.\n\nIn addition to these strategies, it's important to remember that making meals of *any* kind doesn't have to be a giant ordeal. You can meal prep, buy precooked stuff, opt for food that doesn't require a lot of prep work, grill or smoke stuff in batch, eat veggies semi-raw, turn snacks into meals, etc.\n\n&gt; but I still strongly believe that developping brains need a lot of carbs.\n\nWhatever amount they need can be provided through GNG. Not saying you should make your kid keto, but you don't have to load them down with carbs either. It's also worth pointing out that the keto diet was originally formulated for kids.",
            "score": 1,
            "author": "Fognox"
        },
        {
            "level": 0,
            "comment": "It’s the easiest for me. I just give all the carb on my plate to kids. Kids love carbs . No food wasyed",
            "score": 1,
            "author": "thelastresort87"
        },
        {
            "level": 0,
            "comment": "If the kids are gaining too much fat they’re just eating too many calories. People should just let there kids eat a balanced healthy diet and not force them onto restrictive diets.",
            "score": 1,
            "author": "TomatilloPrudent1838"
        },
        {
            "level": 0,
            "comment": "I'm a single mum, always making different stuff for my son! I mean 50% of the time we eat the same dinner but lunch always different. When I'm cooking for wider family I make 3 different meals! A veggie version, meat version and keto version. So learned a few things on the way. Basically you add the carbs in last, so for instance; \n\nSpaghetti Bolognese: just make the sauce and cook the pasta and your \"pasta\" separate. I use shredded cabbage personally. My son actually likes this one so he'll often have that aswell! \n\nPizza: make a bunch of bases and keep them in the freezer, that way when it's pizza night you can throw one together as quick as a regular one.\n\nTapas: Often I'll cut up lots of raw veg and we'll have meats and cheeses with it. My son likes to have chicken nuggets on the side, I season steak + chicken and cook them in cubes in air fryer. I serve the whole thing as a platter basically so you just pick what you want. \n\nBBQ Brisket: Same method just use erythritol instead  of regular sugar. Also don't put potatoes on your plate ofc just have more brisket instead! 🏆\n\nPicnics: I make a salad 🥗 so a portable salad bowl would be good to get! And for my son + friends I make regular sandwiches. \n\nMovie nights: I cut up cucumber, celery and cheese into bitesize pieces then put in a big bowl with some tiny tomatoes. My son actually prefers this to popcorn!\n\nI think bottom line is cook the carbs separate and you can all eat the same thing 👍",
            "score": 1,
            "author": "Shesa-Wildcard"
        },
        {
            "level": 0,
            "comment": "I’m in a similar situation. It’s scary feeling like I can’t get back on track cause it’s hard try to do two parallel meal plans. And I’m a single mom\nSo it’s not like I have anyone to cook for other than my little one. I wish I had some advice! Just following for now. I just got some\nKeto cereals for me and I’m gonna start with the first meal of the day and see if I meal\nPrep some maybe that will make it more feasible to get back into long term.",
            "score": 1,
            "author": "Commercial-Ad-5973"
        },
        {
            "level": 0,
            "comment": "This is not a tip, just a genuine question- have you tried consciously cutting down on the amount of food that you're eating with your current diet?  \n\n\nIf yes/no, what has happened and why did you choose to do so?   \n\n\nI'm asking about this because recently I've been trying to consciously choose the amount of food that I can eat per day, and even though I eat a \"small amount\" (small to my perception), I still feel quite full and can go on for the rest of the day only after having a 1 meal, and my weight drops slowly. What's weird is that intuitively I'd like to eat more, but since I've developed bad habits with my dieting, I have to be very conscious of what desires I have and what aspects I choose to satisfy and which ones I choose to inhibit.   \n\n\nIt's not easy, but so far this approach of just simply eating less whether I feel like eating more or not seems to work for me. What about you?",
            "score": 1,
            "author": "iNhab"
        },
        {
            "level": 0,
            "comment": "I generally cook for the family, essentially keto for all. I will add any combo of noodles, rice, grits, dumplings, cornbread, baguette, or what have you for the carb-eaters. \n\nEdit: waffles and pancakes always go over well, too.",
            "score": 1,
            "author": "Green_with_Zealously"
        },
        {
            "level": 0,
            "comment": "If you want to maintain your weight but stop eating keto learn about CICO. I lost 60 lbs on CICO and just recently switched to keto.",
            "score": 0,
            "author": "Lutya"
        },
        {
            "level": 0,
            "comment": "I ate the kids",
            "score": 0,
            "author": "intheazsun"
        }
    ]
}