{
    "id": "147bcdg",
    "score": 10,
    "title": "Terrible taste in mouth",
    "author": "hmdoctor",
    "date": 1686533211.0,
    "url": "https://www.reddit.com/r/keto/comments/147bcdg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone- I’m about 2 weeks into keto, trying now to stay between 10-15g carbs, sometimes a little more. However, I’m having a hard time with a terrible taste in my mouth that makes me want to eat to get rid of it (though that doesn’t really help). I thought ketosis caused a fruity acetone like taste but this is nothing like that. I’m also pretty tired and have headaches. I am supplementing electrolytes fine, I think: 2 LMNT packages a day, extra potassium, and 400mg magnesium citrate at night. Any tips? Does this go away?",
    "comments": [
        {
            "level": 0,
            "comment": "**Are you getting 5000mg sodium, 1000-4000mg potassium, and 400mg bioavailable magnesium daily?**\n\nIf the answer is “I don’t know how many mg I am getting,” start tracking it.\n\nBuy salt and salt substitute in the grocery store. You don’t need any fancy products or pills for sodium and potassium. Magnesium glycinate is very cheap on amazon to boot.\n\nThe keto flu is nothing more than electrolyte deficiency. It can happen anytime you are deficient, not just at the start. Google “ketoade recipes” and start feeling better. 👍🏻\n\nThere’s more info in the FAQ if you’d like to know more:\n\nhttps://www.reddit.com/r/keto/wiki/faq",
            "score": 1,
            "author": "ReverseLazarus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like keto breath. Drink more and chew gum.",
            "score": 10,
            "author": "Dragon_wryter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "hmdoctor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But does keto breath go away? Is it related to not having enough electrolytes? This is not something I can tolerate long term",
                            "score": 1,
                            "author": "hmdoctor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, it goes away after a bit if/when you get fully fat adapted. \n\nI  did \"oil pulling\" with coconut oil thanks to someone on here and it killed the bad breath and that awful taste. I've also stuck with it because I like the benefits.",
                                    "score": 2,
                                    "author": "louderharderfaster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Helpful. Looking up oil pulling now. Is it true that you need to do it for 15-20 min? That seems like a long time…",
                                            "score": 1,
                                            "author": "hmdoctor"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same for me. Just add lemon juice to your water! It will work. Trust me.",
                            "score": 1,
                            "author": "FiddleVGU"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keto crotch is a thing too…. 😬 \nIt goes away.",
            "score": 9,
            "author": "muddyyeti123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Keto crotch? Can you explain that in more detail?",
                    "score": 2,
                    "author": "MissMax773",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s exactly what you think it is.",
                            "score": 3,
                            "author": "robintweets",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wow, I had this. Had no idea it was the keto that caused it.",
                                    "score": 1,
                                    "author": "MissMax773"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Haha yeah basically as your body is transitioning everything smells “off” \nBut then it all goes back to normal.",
                            "score": 2,
                            "author": "muddyyeti123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bad breath, tiredness slowly goes away as your body becomes more adapted to utilising fat as primary fuel instead of glucose.  All bad things goes away and will reward you with a healthy body with all organs working better than ever.",
            "score": 7,
            "author": "All-Day-Meat-Head"
        },
        {
            "level": 0,
            "comment": "If you have that metallic taste in your mouth, you're in ketosis.",
            "score": 3,
            "author": "topazbee"
        },
        {
            "level": 0,
            "comment": "I think everyone’s Keto breath tastes a bit different. Mine tasted like old blue cheese and sometimes it tasted like cheap burned bacon. Neither are fruity or metallic. I also don’t really eat either of those things. It does go away though. Calorie free fruit teas  helped me keep the taste manageable. And sliced of cucumber are good too.",
            "score": 3,
            "author": "Irksomeone"
        },
        {
            "level": 0,
            "comment": "Maybe you had candida or something and its die off causing your symptoms. Regardless people don't realize your gut microbiome will change once you go from eating carbs to going on keto and that can produce various effects.",
            "score": 2,
            "author": "Grip_N_Sipp"
        },
        {
            "level": 0,
            "comment": "I had that too when I tried keto for 2 months. My saliva also disappeared from my mouth. I drank a lot of water and I was always thirsty. I also peed a lot. \n\nMy breast decreased in size so I stoped.",
            "score": 1,
            "author": "GeriToni"
        },
        {
            "level": 0,
            "comment": "You may have a tonsil stone",
            "score": 1,
            "author": "Thetruthisneeded"
        },
        {
            "level": 0,
            "comment": "I already drink a lot of water and on keto I have to drink like double. I get the worst dehydration/dry mouth that makes bad breath and fatigue happen. I got one of those 64 oz bottles and I usually drink like 3 of them a day haha",
            "score": 1,
            "author": "jazmanimal6"
        }
    ]
}