{
    "id": "147rd7x",
    "score": 36,
    "title": "Depleted and exhausted 14 days in",
    "author": "Important_Peach_7422",
    "date": 1686587812.0,
    "url": "https://www.reddit.com/r/keto/comments/147rd7x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi All, I am 14 days exactly in to Keto and I am counting every macro, staying under 20 carbs/ day, making sure I’m getting enough sodium/ magnesium/ potassium, cut out processed foods, etc.  \nI already feel way better mentally and emotionally which is my reason for trying this way of eating, but I woke up today and I am completely exhausted/ depleted.  Like I barely got my daughter to day-camp (2 hours late) and now I am just barely propped up at my computer trying to work from home.  I want to take a half day so I can lie on the ground and stare at the ceiling.  I have no gas at all.\nI have read it takes 30 days for our body to adjust to using ketones instead of glucose, and this may be part of that transition.  Has anyone else experienced this in their first month?",
    "comments": [
        {
            "level": 0,
            "comment": "**Are you getting 5000mg sodium, 1000-4000mg potassium, and 400mg bioavailable magnesium daily?**\n\nIf the answer is “I don’t know how many mg I am getting,” start tracking it.\n\nBuy salt and salt substitute in the grocery store. You don’t need any fancy products or pills for sodium and potassium. Magnesium glycinate is very cheap on amazon to boot.\n\nThe keto flu is nothing more than electrolyte deficiency. It can happen anytime you are deficient, not just at the start. Google “ketoade recipes” and start feeling better. 👍🏻\n\nThere’s more info in the FAQ if you’d like to know more:\n\nhttps://www.reddit.com/r/keto/wiki/faq",
            "score": 1,
            "author": "ReverseLazarus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Electrolytes. Electrolytes. Electrolytes.\n\nGet more electrolytes.\n\nYou could also try increasing your calories as well.\n\nTry eating more energy efficient foods such as Eggs, Fish and Avocados. \n\nAnd eat until you're full.\n\nEventually, your brain and body will adjust and it won't be as difficult and you'll start to have energy again.",
            "score": 16,
            "author": "RustyCrusty73"
        },
        {
            "level": 0,
            "comment": "Get those electrolytes!",
            "score": 8,
            "author": "Otherwise_Ad6629"
        },
        {
            "level": 0,
            "comment": "When I did keto, I ate tons of protein, protein and fat provide cleaner energy for longer. Be less inclined to eat exactly under 20 carbs, and instead eat when you need it and are hungry and limit fruits and vegetables. You can also take magnesium and B12 supplements",
            "score": 16,
            "author": "Equivalent-Book919",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Important_Peach_7422",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You also may want to reanalyze what you ate and/or drank in the days leading up to these symptoms. What might have happened is you accidentally knocked yourself out of ketosis, and now you're experiencing keto flu again as your body re-enters it. A lot of people need more electrolytes during that period than their standard baseline in order to shake those symptoms.\n\nOne thing I keep on hand is powdered supplements for magnesium and potassium, and of course some salt. This allows me to mix my own Gatorade using a keto friendly sweetner (I use Mio personally but not everyone is a fan). If I'm ever feeling low on energy, usually mixing up some keto juice sets me right. 75% of the time it was either electrolytes or dehydration, and the rest of the time I didn't sleep right. This mix is also clutch for IMF or longterm fasting purposes.",
                            "score": 1,
                            "author": "DefNotAShark"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will be ok. Drink some salty broth",
            "score": 5,
            "author": "Fisherman-daily"
        },
        {
            "level": 0,
            "comment": "How do you know you’re getting enough sodium, potassium, and magnesium? What electrolytes are you using to ensure that you’re getting the proper ratio? I love Redmond Re-Lyte’s electrolyte hydration mixes. The flavors are great. I typically drink 2-3 servings a day.",
            "score": 4,
            "author": "mimtek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Re-Lyte is great.  Highly recommend.   I dont even do keto yet but have been drinking this when I get low on energy.   Works like a charm.",
                    "score": 2,
                    "author": "Downtown_Jackfruit"
                },
                {
                    "level": 1,
                    "comment": "I just ordered an electrolyte mix on Amazon today since I obviously need some help through this first month.  Zeal Electrolyte powder.  I’m hoping it helps!",
                    "score": 1,
                    "author": "Important_Peach_7422"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re walking over the coals, my friend. On the other side is the promised land.  You need to stick with it and keep the faith you’re almost to the other side.",
            "score": 6,
            "author": "Sumnation",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Important_Peach_7422"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have a bowl full of raspberries.   And if that isn’t enough, keep having carbs and salt until you feel well.\n\nThis is keto flu / electrolyte deficiency.  \n\nYou may benefit from a more gradual reduction in carbs … say target 35g net carbs a day for 2 weeks and then drop by 5g.  \n\n“My electrolytes are fine”. \n\nUsually on close inspection … this isn’t true.  If it is… add 50% more sodium.\n\nThere could be many other causes to your symptoms entirely unrelated to keto.  \n\nIf I didn’t bill your insurance company …. You didn’t receive medical advice.",
            "score": 10,
            "author": "KetosisMD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't do this. Get the electrolytes sorted out, but don't eat a bowl full of carbs. That will set you back and make everything more difficult for you.",
                    "score": 3,
                    "author": "binkkit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What actually is “set back” with a bowl full of berries ? \n\nTelling people to push through electrolyte deficiency is dangerous.",
                            "score": 7,
                            "author": "KetosisMD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine pushing through and having a seizure and hitting your head. 🤦‍♂️",
                                    "score": 1,
                                    "author": "ravens52"
                                },
                                {
                                    "level": 3,
                                    "comment": "Telling people to eat carbs is counterproductive.",
                                    "score": 1,
                                    "author": "binkkit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chicken broth with a splash of Tabasco has picked me up on several occasions.",
            "score": 2,
            "author": "6inchVert"
        },
        {
            "level": 0,
            "comment": "Oh man, I wish not having gas was an issue for me whenever I restart keto…\n\nIn all seriousness though, I remember the first time I did keto, it was a nightmare for the first month. I always felt exhausted and I kind of felt gross. All I can say is that it gets better, one morning you will wake up and have more energy than you know what to do with.\n\nAlso, if you’re someone like me who tends to fall off the bandwagon, it does get easier to adjust in future attempts. I just started up again 2 weeks ago after almost 1.5 years of stuffing my face with carbs and within 48 hours I was feeling great. Though results may vary…",
            "score": 2,
            "author": "Away_Ad_3641"
        },
        {
            "level": 0,
            "comment": "What are you eating? Are you getting plenty of fat?",
            "score": 1,
            "author": "c0mp0stable",
            "replies": [
                {
                    "level": 1,
                    "comment": "102g of protein and 126g of fat, 20g of carbs.  I usually exceed the fat, so no problem there.",
                    "score": 3,
                    "author": "Important_Peach_7422",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How about electrolytes? You said you get enough but how are you tracking that? Electrolytes can make or break people in the first month or two. Supplementation is usually needed in the short term.",
                            "score": 3,
                            "author": "c0mp0stable"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I usually exceed the fat\n\nJust to note... fat is supposed to be a *limit*, not a goal.",
                            "score": 5,
                            "author": "Illidari_Kuvira",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is protein the same?  A limit, not a goal?",
                                    "score": 1,
                                    "author": "Important_Peach_7422",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nope.\n\nProtein is a goal that can be exceeded (despite false rumors about it being horrible for keto to exceed). \n\nFat and Carbs are a limit. The amount of all 3 varies person-by-person, but 20g carbs is the guaranteed keto limit.",
                                            "score": 2,
                                            "author": "Illidari_Kuvira",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t know why people Protein bash, it’s not like it undergoes gluconeogenesis or anything. \nYes dietary glucose isn’t ideal, However if you starve the body of the things it needs to make more glucose you will crash hard",
                                                    "score": 0,
                                                    "author": "bmxtricky5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dunno why, myself. My only guess is it's an extension of the \"meat is bad\" fear that companies tried to instill into people.",
                                                            "score": 1,
                                                            "author": "Illidari_Kuvira",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ve been carnivore for 3 years! Changed my life completely. Lost 180lbs, fixed my horrible stomach issues, chronic fatigue. If meat was bad I’d probably be dead already because before the switch I felt like\nI was going to die soon",
                                                                    "score": 2,
                                                                    "author": "bmxtricky5",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Same with me and keto overall. \n\nI actually feel like a person, rather than a barely-alive blob of human.",
                                                                            "score": 2,
                                                                            "author": "Illidari_Kuvira",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Right, I didn’t know what it was like to wake up until my mid 20’s. Scary thought thinking about that now",
                                                                                    "score": 1,
                                                                                    "author": "bmxtricky5"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Post a sample 3 meal.",
            "score": 1,
            "author": "20190229"
        },
        {
            "level": 0,
            "comment": "Congrats for sticking with it. Most ppl fail so good job for making it this far.\n\nWhat’s your current weight and how many calories are you eating/day?",
            "score": 1,
            "author": "psilocybin6ix",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a female, 5’8 and 140 pounds.  If I get all my macros in it’s about 1600 calories, but anywhere from 1200 - 1800 depending on whether I am in the mood to cook or not.",
                    "score": 1,
                    "author": "Important_Peach_7422",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not trying to lose weight, although I wouldn’t hate burning some fat off.",
                            "score": 1,
                            "author": "Important_Peach_7422",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How did you get those macros?  I use carb manager and it has me at the macros I listed previously: \n1624 calories = 102 protein/ 126 fat/ 20 carbs",
                                            "score": 2,
                                            "author": "Important_Peach_7422"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ketoade recipes? Now that's some wizardry I can get behind! Thanks for the tip, friend.",
            "score": 1,
            "author": "Wonderful_Peach6971"
        },
        {
            "level": 0,
            "comment": "if all else fails, eat a bunch of carbs in one sitting, then go back to keto straight away, or even fast for a day. that helped me when keto got to much",
            "score": 1,
            "author": "AppropriateMethod793"
        },
        {
            "level": 0,
            "comment": "Drink lots of water. It always makes me feel better!",
            "score": 1,
            "author": "micksies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only drink lots of water if you also take lots of electrolytes.",
                    "score": 1,
                    "author": "gafromca"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same thing. I felt like someone had drained the blood from my body.",
            "score": 1,
            "author": "Fantastic_Stuff_7917"
        },
        {
            "level": 0,
            "comment": "Sugary sports drink before exercise! It will give you energy and won’t break you out of ketosis as long as the exercise is decently challenging.",
            "score": -5,
            "author": "BrugadaBro"
        },
        {
            "level": 0,
            "comment": "This is why I had to quit keto. The exhaustion. A teaspoon of Himalayan salt often would set me straight but managing the lack of energy eventually became too much for me.",
            "score": 0,
            "author": "Danae-rain",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long were you on Keto before you quit?",
                    "score": 1,
                    "author": "Important_Peach_7422",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Two years or so. I looked great but had a flat effect in my personality and no energy.",
                            "score": 3,
                            "author": "Danae-rain"
                        },
                        {
                            "level": 2,
                            "comment": "I would put a teaspoon in my water bottle it helped alot",
                            "score": 1,
                            "author": "hello_ldm_12"
                        }
                    ]
                }
            ]
        }
    ]
}