{
    "id": "148jkro",
    "score": 187,
    "title": "6 weeks",
    "author": "After-Exercise3675",
    "date": 1686674232.0,
    "url": "https://www.reddit.com/r/keto/comments/148jkro",
    "media_urls": [],
    "other_urls": [],
    "postText": "I started out at 269 and very uncomfortable. My belly was so big and my age it was getting very difficult to even tie my shoes. I couldn’t even see past it as I stood naked and looked down towards my feet. Now after six weeks I’m beginning to feel and look so much better. I have lost 17 pounds and I really don’t know how many inches, but I can see my feet now.",
    "comments": [
        {
            "level": 0,
            "comment": "Keto is an amazing tool!  Keep it up and you’ll be a new person!",
            "score": 27,
            "author": "BikingWithAViking"
        },
        {
            "level": 0,
            "comment": "Well done! Stick with it, make it a habit and not a chore, before you know it, you'll be feeling 10 years younger.",
            "score": 14,
            "author": "Robdataff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 9,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hear you! Congratulations 😊 Keto and intermittent fasting has been a game changer for me. I began the 2nd week of April, now down 21 pounds. I have struggled lately with sweets cravings, but keep plugging along. Wearing smaller clothing has been so great.  Keep on keeping on!",
            "score": 13,
            "author": "Puzzled_Helicopter35",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have learned that a teaspoon of organic peanut butter helps when I have a craving for sweets",
                    "score": 14,
                    "author": "After-Exercise3675",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! Teaspoon of peanut butter on a square of 90% dark chocolate works for me!",
                            "score": 8,
                            "author": "PugsAndNugsNotDrugs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How do yall feel about baking sweets with monk fruit sweetener and almond flour? Do you feel like this interrupts weight loss?",
                                    "score": 1,
                                    "author": "RuinGlass",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Luckily for me I don’t have a massive sweet tooth but I have made a few treats with both of those (hello cheesecake!). It’s all about the amount for me - monk fruit is *really* sweet to me so I tend to naturally self limit. Some people have otherwise keto friendly foods that they can’t stop eating, often salted nuts for example. I also don’t eat treats regularly enough for it to stall my fat loss. \n\nI guess it’s a matter of how much / how often you eat them that would cause stalls or gains. \n\nAs a side note, I used to be the person who baked sweet carby things and brought them into my workplace. When I first started keto I brought some keto baked treats in and was finally able to include a few coworkers who were diabetic. The non-diabetic people couldn’t tell the difference!",
                                            "score": 3,
                                            "author": "PugsAndNugsNotDrugs"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 4,
                            "author": "Puzzled_Helicopter35"
                        },
                        {
                            "level": 2,
                            "comment": "As a historically creamy peanut butter guy, I’ve switched over to crunchy to get a little more for my teaspoon :)\n\nAlso, it’s fancy (more expensive) but the keto peanut-macadamia butter is yummy and lower in carbs thanks to the macadamias",
                            "score": 3,
                            "author": "Thfrogurtisalsocursd"
                        },
                        {
                            "level": 2,
                            "comment": "I am just starting but thanks for this advice! My whole reasoning behind starting keto is the sluggishness I have, I have no energy prior, joints/muscle aches, etc. But I crave sweets and junk so I'm keeping this in my head! Hoping to be satiated 💪",
                            "score": 2,
                            "author": "queenpenelope34"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On keto I just eat a spoonful of whipped cream, it's quick and so tasty and no carbs basically!",
                    "score": 1,
                    "author": "ZhangB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nWhen you can't see your feet, it's called a dicky do.\nYour tummy sticks out more than your dicky do. It gets better every year you stick with it.\nIF and exercise as you gain energy.\nKeep it up, good job!",
            "score": 6,
            "author": "ketoLifestyleRecipes"
        },
        {
            "level": 0,
            "comment": "Awesome! Ive lost 60 pounds in 4 months with a few hiccups but I feel so much more alive and it's awesome not being so tired to do simple things. Keep up the great work!",
            "score": 7,
            "author": "Underwhore_score"
        },
        {
            "level": 0,
            "comment": "Congrats pal! Also started 6 weeks ago, down 22lbs. We got this 💪",
            "score": 4,
            "author": "Tixtr",
            "replies": [
                {
                    "level": 1,
                    "comment": "CoRRect",
                    "score": 2,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing job!",
            "score": 4,
            "author": "Betzschaba"
        },
        {
            "level": 0,
            "comment": "Congratulations! I've been there and know exactly what you're going through. Hang in there. \n\nRemember, this is a lifestyle change and not just a temporary diet. \n\nBest of luck! :)",
            "score": 3,
            "author": "Boebus666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so very much",
                    "score": 2,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only thing thats going up is the likes on this post! KEEP going!",
            "score": 4,
            "author": "Mountain-Humor1699",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really didn’t notice till I read your post. Thank you for your response",
                    "score": 1,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats!!",
            "score": 3,
            "author": "No_Essay_8854"
        },
        {
            "level": 0,
            "comment": "I’ve lost 81 pounds since January, fasting is another level and wait until you start working out! You feel insane! Keep crushing 🙌🏽",
            "score": 3,
            "author": "supreme120",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I already am fasting a little because I just don’t feel hungry. It’s amazing.",
                    "score": 1,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats!! That’s inspiring for sure, I’m only on week 2 and can’t wait to see where I am at 6 weeks.",
            "score": 6,
            "author": "Lucyknuckles",
            "replies": [
                {
                    "level": 1,
                    "comment": "The road seems tough at times but it doesn’t compare to what joy I have knowing this is what’s right for me.",
                    "score": 5,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good for you! Keep up the great work.",
            "score": 4,
            "author": "KFos01"
        },
        {
            "level": 0,
            "comment": "Congratulations! That's so awesome🥳",
            "score": 2,
            "author": "hbouhl"
        },
        {
            "level": 0,
            "comment": "Congratulations 🎊 🎊 💪🏽💪🏽",
            "score": 2,
            "author": "Mansa_x912"
        },
        {
            "level": 0,
            "comment": "Excellent start. Keep at it!",
            "score": 2,
            "author": "mac2914",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you.",
                    "score": 1,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a dietitian that shows people how much they lose in fat. Like if you google 10lbs of fat vs 10lbs of muscle it's absolutely insane. Because fat takes up significantly more volume",
            "score": 2,
            "author": "Melodic_tyrant"
        },
        {
            "level": 0,
            "comment": "Congratulations!  Enjoy the journey, and welcome to the keto club!",
            "score": 2,
            "author": "shushyou2019"
        },
        {
            "level": 0,
            "comment": "Woohoo! So happy for you! \nI’m new to Keto and you are inspiring🙌",
            "score": 2,
            "author": "Positivelifevibes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. Thank you so very much",
                    "score": 1,
                    "author": "After-Exercise3675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is AMAZING I need all these motivations! 🙌 I'm day 1 and I'm feeling pretty good fasting been doing that already, and had my bullet proof coffee. Made egg cups and bacon! Made turkey burgers and cole slaw stir fry for later!",
            "score": 2,
            "author": "queenpenelope34",
            "replies": [
                {
                    "level": 1,
                    "comment": "It works for me so very well. I hope and pray it does for you too. If I can help hit me up. I don’t know everything but I’m willing to help.",
                    "score": 1,
                    "author": "After-Exercise3675"
                }
            ]
        }
    ]
}