{
    "id": "148qnwt",
    "score": 4,
    "title": "Keto tortillas",
    "author": "Famous_Pollution030",
    "date": 1686693120.0,
    "url": "https://www.reddit.com/r/keto/comments/148qnwt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am new to keto and need advice.  Are keto tortillas legit? Will I be adhering to a strict keto diet by following that",
    "comments": [
        {
            "level": 0,
            "comment": "Mr Tortilla is awesome",
            "score": 5,
            "author": "GenieGrumblefish"
        },
        {
            "level": 0,
            "comment": "If they fit your macros. I use Orowheat tortillas.",
            "score": 3,
            "author": "smitcolin"
        },
        {
            "level": 0,
            "comment": "Maybe. Some tortillas raise my blood sugar more than advertised net carbs. Some don’t. I wear a Libre.",
            "score": 3,
            "author": "jonathanlink"
        },
        {
            "level": 0,
            "comment": "I indeed use mission, Guerrero nutricas are my favorite, and everyone in-between to stop myself from getting the full carb stuff.",
            "score": 3,
            "author": "durpado"
        },
        {
            "level": 0,
            "comment": "I’ve used Mission’s for 6 years, no issues.",
            "score": 2,
            "author": "YUBLyin"
        },
        {
            "level": 0,
            "comment": "I love Mama Lupe’s low carb tortillas (really inexpensive if you buy at Sam’s)",
            "score": 2,
            "author": "LadyOwle97"
        },
        {
            "level": 0,
            "comment": "La Tortilla Factory zero net carbs works for me. Get them at Costco.",
            "score": 2,
            "author": "CowboyEngineer89"
        },
        {
            "level": 0,
            "comment": "I love making mini pizzas with them.  It is my favorite keto junk food option",
            "score": 2,
            "author": "FeeFiFooFunyon"
        },
        {
            "level": 0,
            "comment": "I couldn't do keto without them. I hear la banderita are best, but I buy mission. I try not to eat more than one in a day and not everyday, but they are a lifesaver for me.",
            "score": 2,
            "author": "beansandwheels"
        },
        {
            "level": 0,
            "comment": "Mr Tortilla is great and I also use my oven to toast these and use them as crackers for charcuterie boards! So delicious",
            "score": 2,
            "author": "SwimmingSeaweed1603"
        },
        {
            "level": 0,
            "comment": "I’ve used mission carb smart and La banderita carbcounter tortillas, they taste good and sometimes too good to be true. The ingredients and macros are questionable, suggest testing your blood sugar shortly to double check if it spikes. In my case it doesn’t and I have them sparingly.",
            "score": 2,
            "author": "lt_dan457"
        },
        {
            "level": 0,
            "comment": "Mission taste like cardboard and is very powdery, especially if heated. Mr Tortilla is the best",
            "score": 1,
            "author": "nugnug1226"
        }
    ]
}