{
    "id": "148yb5e",
    "score": 26,
    "title": "What are your favorite keto meals?",
    "author": "patriot9622",
    "date": 1686716624.0,
    "url": "https://www.reddit.com/r/keto/comments/148yb5e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recently started keto (type 2 diabetic) and it has massively improved my sugar numbers, as well as dropping 20 pounds in about two months. My question is, what are your favorite keto meals/recipes for breakfast/lunch/dinner? I’m still fairly new to this and would love hearing different recipes to mix things up a bit!",
    "comments": [
        {
            "level": 0,
            "comment": "Dinner: Cabbage steaks with sausage crumble, onion, garlic, maitake, mix of mozzarella and parmigiana on top.\n\nLunch: 0 carb tortilla, lettuce, red onion, sauteed broccoli and cauliflower, shredded cheese quesadilla\n\nBreakfast: 4 eggs over hard, sauerkraut (or kimchi), sprinkle of parmigiana",
            "score": 7,
            "author": "YanksFanInSF",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dinner as the first meal of the day? I admire it ;)",
                    "score": 5,
                    "author": "Dazpiece"
                },
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 2,
                    "author": "patriot9622"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most of my meals are incredibly simple. Some kind of red meat with something on the side (eggs, sardines, shrimp, bacon, fermented vegetables). I never get sick of them, though.",
            "score": 3,
            "author": "c0mp0stable"
        },
        {
            "level": 0,
            "comment": "I made some delicious ribs the other day in the crockpot with harissa seasoning, then broil in the oven for a few minutes with sugar free sweet n spicy bbq sauce, and side of coleslaw. \n\nI also made some amazing horseradish deviled eggs! Just swapped out yellow mustard for horseradish mustard. So tasty 🤤",
            "score": 3,
            "author": "astrobish"
        },
        {
            "level": 0,
            "comment": "Steak with frozen cauliflower risotto. The risotto is about 10 net carbs per serving, but feels like you're eating a plate of pasta.\n\n spam n eggs (a hawaii thing) with cheesy broccoli \n\nDeviled eggs with celery and peanut butter\n\nTuna sandwich on inked keto bread with a side of chicharrones\n\nKalua pork (another hawaii thing) with cabbage and riced cauliflower \n\nSteak or chicken stir fry. I make my own teriyaki sauce using soy sauce and monk fruit sweetener",
            "score": 3,
            "author": "maverick1ba"
        },
        {
            "level": 0,
            "comment": "Tuscan shrimp: heavy cream, shrimp, spinach, cherry tomatoes, garlic, parmesan cheese, salt, pepper.\n\nYou can add mushrooms, chicken, sausage, pork, onions, or really anything else, if you like. It's a \"pantry cleaner\" recipe meaning that you can add almost anything and it'll still taste good.",
            "score": 3,
            "author": "c_c_c__combobreaker"
        },
        {
            "level": 0,
            "comment": "Summer is here so I'm barbecuing meats as well as pan frying and serving with salad.\n\nBelly pork roasted.\n\n\nSomething I eat a lot of is a sort of charcuterie style meal.  No fixed recipe, it's usually just what's in the fridge a selection from.\n\nA cured meat of some sort.\nOlives and feta cheese\nBrie and dry roasted peanuts\nPickled gherkins\nCucumber with apple vinegar and salt\nWensleydale\nCelery\nPate\nCream cheese / greek yoghurt mix.\n\nTypically served with some berries and clotted cream.\n\nIt's nice as it's variable per day and also a variety of foods.  Usually I'll take four of the above as the meal.\n\nI don't eat breakfast.",
            "score": 3,
            "author": "silasgreenback"
        },
        {
            "level": 0,
            "comment": "Bacon Cheeseburger Salad, Roasted Veggies w/Cauliflower Rice, and then probably Lettuce Wrap Tacos",
            "score": 3,
            "author": "aboveaveragewife"
        },
        {
            "level": 0,
            "comment": "When I'm in the mood to cook, crispy chicken with pork rinds. But usually, just some eggs. I jazz it up with onions and chives.",
            "score": 3,
            "author": "boomer_wife"
        },
        {
            "level": 0,
            "comment": "A bowl of ground beef, eggs, sour cream and habanero hot sauce is my go to meal.",
            "score": 3,
            "author": "Zackadeez"
        },
        {
            "level": 0,
            "comment": "Steak eggs mushrooms onions",
            "score": 3,
            "author": "Chance_Fisherman1918"
        },
        {
            "level": 0,
            "comment": "Favorite?   A rare steak (New York strip or ribeye), sautéed mushrooms and salad greens with my homemade blue cheese dressing.",
            "score": 3,
            "author": "shiplesp"
        },
        {
            "level": 0,
            "comment": "Egg roll in a bowl, sardines, Greek salads with various meat additions, burgers\n\nBreakfast is either everything bagel cottage cheese, a slice of frittata, or nothing.",
            "score": 2,
            "author": "Icy-Conclusion-3500"
        },
        {
            "level": 0,
            "comment": "My typical breakfast is 2 hard boiled eggs and 2 slices of keto toast with cream cheese.",
            "score": 2,
            "author": "MarcusAurelius68"
        },
        {
            "level": 0,
            "comment": "Breakfast- Black coffee and a cup of broth. Lunch -Keto Chow shake made with heavy cream, coconut milk and cold coffee . Dinner - Air fried Italian Sausages with some veggie (usually sauerkraut)",
            "score": 2,
            "author": "mwroblew"
        },
        {
            "level": 0,
            "comment": "Right now my favorite meals are grilled cheese chaffles with chicken and bacon for lunch, and chicken crust pizza for dinner.",
            "score": 2,
            "author": "that_other_person1"
        },
        {
            "level": 0,
            "comment": "Eggroll in a bowl!",
            "score": 2,
            "author": "beansandwheels"
        },
        {
            "level": 0,
            "comment": "Breakfast usually eggs (I love them so much)\nDinner some kind meat preferably with more fat, with some greens (broculy, spinach etc) with raw veggies in summer or olives",
            "score": 2,
            "author": "franko2707"
        },
        {
            "level": 0,
            "comment": "Bi bim bop using cauliflower rice, beef short ribs, kimchi and eggs.",
            "score": 2,
            "author": "jammixxnn"
        },
        {
            "level": 0,
            "comment": "I love this [taco casserole](https://www.reddit.com/r/ketorecipes/comments/101t0wi/easy_5_ingredient_taco_casserole/) - really simple but so delicious.  I've tried making it with red and green salsa and both are great.  I double the recipe, use fattier beef and drain it, and don't bother with the egg.  I also make my own taco seasoning since all of the store-bought ones are mostly cornstarch.",
            "score": 2,
            "author": "pocketradish"
        },
        {
            "level": 0,
            "comment": "2 sides of sausage and 3 scrambled eggs with cheese and ham from Waffle House",
            "score": 1,
            "author": "peayness"
        },
        {
            "level": 0,
            "comment": "Breakfast: coffee with heavy cream, chia seed pudding with almond butter, cloud bread with zaatar\n\n\nLunch: nuts, salads with cheese olive oil and sometimes meat\n\n\nDinner: Boston lettuce wraps with some kind of protein inside and mustard, a mozzarella omelette, lots of sashimi as a treat some days\n\n\nDessert: avocado brownies (must try!) with strawberries, or a chocolate milkshake, or berries",
            "score": 1,
            "author": "Bayleefstits"
        }
    ]
}