{
    "id": "709njn",
    "score": 4948,
    "title": "Doc said I could achieve 235 within 2 years after gastric sleeve - keto did it in 8 months",
    "author": "eatbaconloseweight",
    "date": 1505480213.0,
    "url": "https://www.reddit.com/r/keto/comments/709njn",
    "media_urls": [
        "https://www.reddit.com/r/keto/comments/709njn/doc_said_i_could_achieve_235_within_2_years_after/"
    ],
    "other_urls": [
        "https://www.instagram.com/p/BY_Wqe2BKKI/?taken-by=eatbaconloseweight"
    ],
    "postText": "Actually, it took me 8 months and a week to lose 127 pounds ... but who's counting?\n\n\nIn Jan, doc said my only hope was bariatric surgery - thank god I found Diet Doctor and this sub before I had a portion of a vital organ removed permanently.  \n\n\n235 has been a marker in my head for a while because in January it seemed like such a dream weight - an impossible thing to achieve.  And yet, here I am, 8 months (and one week) later standing **IN** the pants I wore to that doctor's appointment ... \n\nThanks Keto!\n\nhttps://www.instagram.com/p/BY_Wqe2BKKI/?taken-by=eatbaconloseweight",
    "comments": [
        {
            "level": 0,
            "comment": "**Slow Clap**\n",
            "score": 873,
            "author": "atxtraveler",
            "replies": [
                {
                    "level": 1,
                    "comment": "HA!!!  I'VE ALWAYS WANTED TO BE THE RECIPIENT OF A SLOW CLAP!!!\n\n**THANK YOU!!**",
                    "score": 596,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You've earned it. ",
                            "score": 129,
                            "author": "atxtraveler",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 90,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\nClap............clap.............clap......clap.....clap..clap..clap..\nClapclapcalpclapclap",
                                    "score": 91,
                                    "author": "hoody5566",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Puts 2 fingers in my mouth and whistles loudly*",
                                            "score": 79,
                                            "author": "badass4102",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Puts 2 fingers in mouth and blows, but no whistle sound comes out because even after watching YouTube videos can't fucking do that shit.",
                                                    "score": 123,
                                                    "author": "AllegroDigital",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Directions too vague, ended up with fingers in someone elses mouth. I dont think they like whistling.",
                                                            "score": 41,
                                                            "author": "NorseOfCourse"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Swallow the peanut butter first. I always forget.",
                                                            "score": 12,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Queues up [Simple Minds -- Don't You (Forget About Me)](https://youtu.be/CdqoNKCCt7A)",
                                                    "score": 15,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You've done amazing. Great job. Keep up the good work.",
                            "score": 8,
                            "author": "StumbleOn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You rule.  Awesome.  \n\nhttp://www.reactiongifs.com/wp-content/uploads/2012/01/yes-rudy1.gif",
                    "score": 29,
                    "author": "bb_jonez"
                },
                {
                    "level": 1,
                    "comment": "[This *was* the right moment.](https://www.youtube.com/watch?v=lEHKa2iF95s)",
                    "score": 7,
                    "author": "zyzzogeton"
                },
                {
                    "level": 1,
                    "comment": "You are an inspiration!  ",
                    "score": 3,
                    "author": "SYON254"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been following your Instagram for a few weeks. You're a true inspiration and revelation! Kudos to you!",
            "score": 79,
            "author": "sappychick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww thanks!!  \n\n(We have the same goal weight ... hahahaha!!)",
                    "score": 24,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wanna know what an inspiration you are? I'm reading your post at a diner before I order. I'd almost decided, \"Screw it. There's carbs all over this menu. I'll just slide and eat whatever.\"\n\nThen I see your post and progress. I'll be having the protein breakfast now. \n\nCongrats. And thank you for keeping me on track. ",
            "score": 48,
            "author": "Tappanga",
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally ... you just made my day!  I'm screenshotting the asshole responses and sending them to my husband and laughing about them ... now I'm screenshotting yours because YOU ARE AWESOME!!\n\nThank you for saying such an awesome thing about me!  Glad I could help!  Enjoy your meal!!",
                    "score": 26,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was about to ask why anyone would react negatively to your post and then remembered that some people are always going to be negative.",
                            "score": 18,
                            "author": "bluehands"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome that you didn't listen to the doc and did it the right way! The pants pic is incredible!",
            "score": 144,
            "author": "PalkonesWoods",
            "replies": [
                {
                    "level": 1,
                    "comment": "The truth is the doc pissed me off - like, \"you can't tell me that I can't do this without help!  I'll show you!\"  Which, is kinda hysterical because I had failed SO MANY times before and she should've been right.  I felt I was in this deep hole that I couldn't get out of.",
                    "score": 182,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It sometimes takes an epiphany - and getting pissed off when someone tells you that you can't do it works for many.\n\nKeep going.  199 by the end of the year?",
                            "score": 74,
                            "author": "bidnow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shockingly, while 199 is my goal ... I never put a time frame on it.  \n\nBut yep!  That sounds like a plan!  \n\nAnd damn ... that would make it 161 pounds lost in less than a year  Yowza!  ",
                                    "score": 76,
                                    "author": "eatbaconloseweight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went from 332 to 192 on the pretty fast slope that others show here and then hit a long plateau.  I think that when your body wants to lose weight, you just keep riding that horse as long as you can.\n\nKCKO ",
                                            "score": 41,
                                            "author": "bidnow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think there's a problem with kind of pausing weight loss for a while. I went through the same thing - 230 lbs down to 170 lbs or so through the early parts of 2015. Then, I just stayed about the same until a month ago where I dropped calories and carbs to begin losing again. Gave my skin time to catch up and time for me to get used to being smaller (took a long time to be able to see myself properly.)  My overall goal is 135 lbs, but I feel more energized about that now, looking at it like a fresh start rather than a continuation",
                                                    "score": 41,
                                                    "author": "taylor-in-progress",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is nice to read. I lost 52 pounds earlier this year in about 4 months. I have another 50 I want to lose, but I've been happily eating at maintenance for a couple months now. Slow and steady with a pause is working for me and I'm glad to see someone else has done the same. ",
                                                            "score": 17,
                                                            "author": "mizzaks"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey, that is where I am.  I am a year in, down from ~215 (the highest I have ever been was 230 2 years ago), sitting at 160/165 (depends on water)... and I'm targeting 155 (I'm a bit taller than you and organs and blood weigh *something* after all).  [High five!](https://i.imgur.com/B0epwy7.gif)",
                                                            "score": 5,
                                                            "author": "zyzzogeton"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; took a long time to be able to see myself properly.\n\nI read this over and over, and is probably a key to long-term health. How was this process for you? Active/passive?",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm honestly not sure when I started being able to see myself as being thinner. I think comparing before and after photos side by side made the biggest difference. The rest was just time, I think.   It's strange because when I look at my original \"before\" photos, I don't think I ever realized quite how heavy I was. I suppose it was because I gained weight so gradually over the years. I barely recognize the person I see in my before photos, especially the face. I feel like I never really saw that person in the mirror at the time, maybe denial or something.\n\nI think day to day things helped as well, like needing to buy new clothes because the old ones were starting to look comical, or realizing that I could fit better in a restaurant booth. My partner would make comments like \"there's no way you could have walked this long before, you would have had to sit down a bunch of times by now\". I guess just small things over time",
                                                                    "score": 6,
                                                                    "author": "taylor-in-progress",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Makes sense - all those things you've mentioned coming at you over and over add up.  \n \nGlad you're doing well - here's to your continued success!",
                                                                            "score": 4,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What if the doctor knew the only way to motivate you to break through failure was to tell you that you couldn't do it, so you would be determined to do it?",
                                            "score": 3,
                                            "author": "b4d_b100d",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe - but she would have to know me as both a patient and a person.  And she didn't/doesn't.\n\nAnd ... that's not why she said what she did - she was trying to be motivational to me, certainly - but from a \"weight loss surgery is going to be your saving grace!!  yay for surgery!!\"",
                                                    "score": 10,
                                                    "author": "eatbaconloseweight"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's the mechanism that made me stop smoking. I just didn't allow the cigarettes anymore to tell me what I should do, and when I got the need to smoke I just got pissed off and simply denied it :-)",
                                    "score": 9,
                                    "author": "LCAnemone"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To be fair, in the scientific literature, bariatric surgery has the highest success rate out of all weight loss strategies in the long term (meaning the lowest relapse rate). They were probably using the best evidence available to give you the best possible suggestion they could. Keto hasn't been evaluated alongside these other weight loss alternatives in this way yet, AFAIK.\n\nBut since everyone wants to circle jerk about how much they hate doctors and medicine in here, I'll probably get downvoted.",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As I wrote in another comment, bariatric surgery reduces a biological drive that doesn't fit most of the modern industrialized world - that of trying to eat everything you can, while you can. The worst most of us will face is possibly being broke. For anyone with a bank account and a credit card, there's never a time when you can't have food, and some of us just don't think much about it.\n\nI have a good friend that, as part of his food plan, swore off any restaurant that has a commercial or a drive through. That cuts out a lot of the junk if you can stick to it. Ego depletion and decision fatigue can make it hard for many to do so and the surgeries available make it less of a struggle.",
                                    "score": 5,
                                    "author": "Grinzorr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My GF is looking at the gastric sleeve procedure and going through the testing and such to get it done. Her doctor basically told her the same thing.\n\nThe hard part for her is that she already believed it was impossible for her to get there on her own. I get the feeling. I can't concentrate when I'm hungry. I have done keto before and I like it, but I am often uncomfortable because I'm craving carbs. I've eaten two pork chops and six servings of vegetables and felt a strange combination of full and famished at the same time, because my body wanted something else.\n\nOur modern world works against our instincts and biology in almost every way. It's even been shown in a study that merely thinking about being \"poor\" is enough to make people crave empty calories. Probably an adaptive trait for our ancestors - thinking about a lean winter led to trying to put on more weight while you can.\n\nSo now we have food EVERYWHERE and most of it is TERRIBLE from a health perspective, but our bodies think it's great - fat, sugar, salt, ENERGY. But we don't need it. There won't be a lean winter, there won't be a famine, in all likelihood. The worst most of us will face is possibly being so broke we can't get 50 cent tacos.\n\nThat's what the sleeve would offer her - freedom from her body telling her she's hungry at inappropriate times and for unhealthy things.",
                            "score": 10,
                            "author": "Grinzorr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Two things ...\n\n1.  The lack of hunger that people experience after weight loss surgery is from (or lack of) the ghrelin hormone.  (Or that's what bariatric surgeons will tell you.)  But it does come back.  \n\n2.  And I'm not trying to ketoevangelize, I'm really not, but keto 10000% gave me the freedom from not being hungry AND not having any cravings.  \n\nNow ... there hasn't been enough research done on the ghrelin hormone (the way I understand it) when it comes to weight loss surgery.  Do post-surgery patients experience the loss of hunger because of ghrelin OR because they are essentially on a very low carb diet?  And it's been said that the hunger DOES come back ... is that because those same patients re-introduce carbs at a later date?\n\nI don't profess to know all the answers - or even 1% of them - but it's something to think about.",
                                    "score": 11,
                                    "author": "eatbaconloseweight"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What did he say when he saw what you did and how you did it?",
                            "score": 3,
                            "author": "Th3R00ST3R",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She.\n\nShe was pretty meh about it all actually.  Truthfully, you would think she would've been very interested in how a 47 year old woman lost 100 pounds in 6 months - especially since she specializes in obesity research at one of the nation's top hospitals.  But she was very \"that's nice dear\" about it all.",
                                    "score": 25,
                                    "author": "eatbaconloseweight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doctors like this piss me off. Rather than researching it, and suggest this as an alternative treatment to try, she would rather schedule a surgical procedure that benefits her, the insurance companies, and the pharmaceutical companies. ",
                                            "score": 13,
                                            "author": "Th3R00ST3R"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How horrible.  I guess she was just disappointed that she didn't get her fat (excuse the expression) fee.  You need a different dr.",
                                            "score": 2,
                                            "author": "marsglow"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Your doctor sucks. In a look down their nose from underneath their glasses kind of way. ",
                                            "score": 2,
                                            "author": "Heph333"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[Don't tell me...](https://i.imgur.com/Lh0HO8E.mp4)",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bariatric Surgery is a great tool used by people to help them lose weight. For many many many people, Surgery *is* the right way.\n\n\nI've done Keto before and after Bariatric Surgery and without my surgery, I wouldn't have been able to 1) keep the weight off long term, 2) been able to control my portion sizes, 3) avoid the massive cravings I'd develop and 4)  I've been able to greatly exceed the results of my surgery with my diet and exercise.\n\nI failed to keep the weight off twice using Keto diets. Not because Keto didn't work, but because my body fought me until I couldn't fight back. It was part of a larger issue with my body, and diet (and exercise) alone wasn't the answer for me.\n\nBariatric Surgery was the *only* way to allow my body to work with me, not against me, and together I've been successful. \n\n\nIn the 7 months since my surgery (I did a newer procedure called the [Endoscopic Sleeve Gastroplasty ](http://www.houstonweightlossuthealth.com/bariatric-surgery/endosleeve.html) yes, nothing was removed from me, but my stomach has been sewn from the inside to make a sleeve.) and I've lost 142 pounds and counting. 50 pounds is the average amount of weight loss for the surgery. \n\n \nI've done this with exercise and a great Keto diet. My Doctor has told me that I am one of the top weight losers *in the world* for this procedure and I credit that partly to my diet, which is effectively Keto. \n\nI am now training for a 50mile walk through the NZ wilderness on a famous walk, I will hit the 150 pound lost mark very soon. That procedure saved my life.\n\nSurgery is not for everyone, I get that. But please don't say that surgery is bad, or wrong, or say things that make people feel ashamed because they may need the surgery to help them. Bariatric Surgery is an amazing tool and we shouldn't feed a stereotype that surgery is wrong or incorrect or a negative thing to agree to.\n\n\nIf anyone is contemplating Surgery,  there is no shame in pursuing  Surgery as an option. And please reach out if you need support. Please feel free to message me if you need to talk. \n\nYour weight loss is awesome, and I'm so proud of you all, just remember there are many valid and positive paths to a healthy, and happy weight loss and weight maintenance. Keto is one, Bariatric Surgery is another. Using both is yet still another. \n\nThanks for listening. \n\n\n\n( edit: That moment when you realise you need to change your flair)",
                    "score": 89,
                    "author": "wanderlustcub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly!!! I just wanted to be that voice of support for those who feel ashamed of their Surgery, or the thought of having one to help them. \n\n*The* biggest topic I talk about with Sleevers when it's comes to the social aspect of Bariatric Surgery is effectively \"Coming out.\" There is so much shame and fear surrounding surgery and the snarky comments cut deep. There are people scared to tell their spouses. \n\nIt's funny, I feel like being an out gay man helped me with coming out and being an advocate about Bariatric Surgery people. I just hope that talking openly about it takes away the negative stereotypes people have about it and encourages others to see it as an option. ",
                                    "score": 7,
                                    "author": "wanderlustcub",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dad died an awful death from bariatric surgery complications, so it's not all roses either.  I sure wish he'd tried something less drastic.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm sorry for your loss. *hugs*\n\nAbsolutely there are risks, however, it's now quite rare to have a fatality from Bariatric Surgery, the technology and the Medicine has come a long way. My procedure had me as an overnight patient, and I was back to work in 3 days. \n\n[current stats put survival rates for Bariatric Surgery at 99.8%](http://www.bariatric-surgery-source.com/gastric-bypass-surgery-deaths.html) \n\nYour chances of obesity related death is much higher. \n\n\nGenerally the order of \"Risk\" is ESG -&gt; Keyhole Sleeve -&gt; Gastric Bypass. \n\nI personally went with the least risky option that did not remove any of the stomach, only internally sewed into a sleeve. That option also had the \"least effectiveness\" but I kinda destroyed that thought with my results. \n\nAlso there are Bariatric surgeries they no longer do. The Lap band for example is no longer done in most places because it's not a good tool for almost anyone. \n\nThis doesn't diminish your loss, I'm so sorry for that. \n\nSurgery is a big decision and shouldn't be taken lightly. Always do your research and talk/consult with your doctor. And decide what risk is comfortable for you. I'm not going to lie. I was nervous. I was worried at moments before the surgery. But for me (and the vast majority of people), the surgery and the after effects will not be fatal. ",
                                    "score": 12,
                                    "author": "wanderlustcub",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In theory I'd agree, but through the whole process we met a lot of former bariatric nurses who quit because as they said, \"there are complications now or there are complications later.\"\n\nAnd TECHNICALLY, his bariatric surgery was considered a success.  He lost weight and lived three years.  (I think that was the measure.) The fact he couldn't speak, was bedridden and had a feeding tube didn't seem to us to be successful.  But his surgeon still has advertises 100% success rate.",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I want that surgery so bad but insurance doesn't cover it and not many places are doing it yet. Getting a sleeve or RNY instead in a few months. Awesome job! ",
                            "score": 2,
                            "author": "dissociation844",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She absolutely did the right thing but can't blame the doctor. I bet most of his overweight patients that pass through his office don't have the drive and determination that op had and the dr would have more positive results by only resorting to surgery.\n\nNice to see op persevere!",
                    "score": 17,
                    "author": "DongWithAThong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that too is a negative stereotype. Being in Bariatric support groups (and finding that due to my success I talk about this with sleevers *a lot* ) I find that it's actually a vast majority that do have that determination and grit to lose weight. That's why many seek surgery in the first place. \n\nSurgery is not an easy out, that is a huge misconception. Surgery is not an easy path to weight loss. \n\nAgain, Just like a Hammer is not the best tool in every situation, neither is Keto, ( orSurgery) the best tool for everyone.\n\nPeople look at Keto negatively and say things like it's a fad diet or a lazy way to lose weight. Let's not be like like that towards others. We should all support each other in their weight loss journey no matter what tools they use. \n\nLet's build each other up, not tear others down to make our achievements seem better. \n\nThanks for listening. ",
                            "score": 13,
                            "author": "wanderlustcub"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is fantastic progress. I hope you feel proud.",
            "score": 20,
            "author": "AZ_Mountain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do.  And a little weirded out when I realize what I've done in such a short amount of time.  Sometimes, I get it ... sometimes my brain needs to really catch up!",
                    "score": 15,
                    "author": "eatbaconloseweight",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "First, let me say that is fuckin awesome. congrats.\n\nSecond, let me point out that there is nothing wrong with getting VSG surgery.  \n\nA lot of people who have it, eat a keto style diet after. Whatever steps you need to take to get control of your body is better than being 300+ pounds. ",
            "score": 85,
            "author": "PsychicWarElephant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!\n\nBut where did I say that it weight loss surgery was wrong?",
                    "score": 30,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You didn't say it was wrong, other people in here did. You did give a negative connotation to it though. \n\nEither way, not a big deal, just don't want people who have had it too think they somehow made a mistake.  ",
                            "score": 67,
                            "author": "PsychicWarElephant"
                        },
                        {
                            "level": 2,
                            "comment": "You implied it when you said \"before I had a portion of a vital organ removed permanently.\"",
                            "score": 6,
                            "author": "HeyJustWantedToSay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it not a vital organ?\n\nThat doesn't imply weight loss surgery is wrong.  It implies that I fixed my shit (in progress actually) before I had an organ removed.\n\nNothing more.  Nothing less.",
                                    "score": 13,
                                    "author": "eatbaconloseweight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. You can't undo surgery. If there's a non-invasive option, any option at all, you owe it to yourself to try it first. ",
                                            "score": 11,
                                            "author": "Heph333",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love hearing/seeing shit like this!! Amazing job!!\n\nP.S. I have to say thank you to you, I learned about cheese taco shells from a post you put up a while ago and it changed my world!",
            "score": 7,
            "author": "gettinawesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!!  Everyone should have the joy of cheese shells in their life!",
                    "score": 6,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "where is this cheese shell post... asking for a friend...",
                            "score": 3,
                            "author": "cobyn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here's one of my insta posts where I talk about it ... I give the recipe in the comments:\n\nhttps://www.instagram.com/p/BY9ZDGNBJ8u/?taken-by=eatbaconloseweight",
                                    "score": 2,
                                    "author": "eatbaconloseweight"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well ma'am, we have watched your progress for the past 5 months, and you have done so dang good.  I hope you go see your doctor again soon and make him look at his notes from that visit 8 months ago.  I hope you make him do blood work and compare it to your visit 8 months ago.  I hope you then ask him why you should continue to use him as your doctor.    \nYour work these past 8 months has been fantastic.  You have taken control of your life and I am so proud of you.  You ma'am--YOU are fantastic!",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Simply amazing progress!!!! 👏 👏 \n\n(and a huge inspiration for me as another 40-something lady with similar stats!!)\n\nHas your doctor seen your progress? \n",
            "score": 4,
            "author": "TANSTAAFL13",
            "replies": [
                {
                    "level": 1,
                    "comment": "My primary care doc is 100% on board w/ my diet ... she's awesome.  But yes, the specialist I saw in Jan (there's actually 2 of them - but I've condensed the story for simplicity sake) knows .... I emailed her in 3 months (after I lost 50) and when I lost 100 in 6 months.  ",
                    "score": 3,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just curious, is your doc pro-keto or just very pleased with your progress? ",
                            "score": 2,
                            "author": "TANSTAAFL13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pro-keto ... for me.  She definitely is on the reducing-carbs-bandwagon for overall health reasons though.  But I don't think she's actively telling her other patients to investigate a ketogenic diet.",
                                    "score": 3,
                                    "author": "eatbaconloseweight"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very very impressive, I'm glad you found keto and it saved you from surgery!",
            "score": 5,
            "author": "Bigredbauss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! :)",
                    "score": 3,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think that most doctors see people that come in and won't quit smoking, or stop drinking, or eat less... and they automatically assume everyone can't do it (after all, the stats are on their side there) so they suggest things that don't take willpower because they are tired of being disappointed by individuals with no self discipline.  Plus, I bet bariatric surgery is pretty profitable.",
            "score": 4,
            "author": "zyzzogeton"
        },
        {
            "level": 0,
            "comment": "Wow!  Good for you!  I'd considered gastric sleeve, and others around me have done it, but I just couldn't pull the trigger.  \n\nSo, have you told the doc yet?",
            "score": 7,
            "author": "blondiekate",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been considering it too, but everyone I know who's had it done didn't lose allllll of the weight and most of them gained half or more of it back after. You can't out-surgery bad habits, so I might as well just lose the weight with the new habits I'd have to develop anyway! ",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is the best way to look at it!",
                            "score": 2,
                            "author": "blondiekate"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep.  I emailed her when I lost 50 in 3 months (to cancel my appointment) and then when I lost 100 in 6 months (just to rub it in).\n\nShe is an obesity specialist/researcher at one of the country's top hospitals - and you would **think** she would be very interested in how a 47 year old woman lost 100 pounds by diet alone in a very short amount of time.  But nope.  She was very kind, make no mistake, but she really didn't give a shit either.",
                    "score": 46,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably a cynic. Get back to her in a year and show her how you KEPT it off and even if she doesn't show you, she'll be impressed!",
                            "score": 35,
                            "author": "sassy0930",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah.  I was going to say that docs have seen a lot of yo-yoing so if you keep it off over a year she should eat her words to you.\n\nEveryone knows it's better to keep your stomach/intestine intact, but they get jaded by the people who fail and think surgery is the only way.  The truth is that even people who have surgery end up obese again if they don't actually make life changes and own it.",
                                    "score": 23,
                                    "author": "lush_rational",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's one part i'm stuck at.  ive lost 150lbs through keto in the past.  but i didnt really improve the rest of my life.  so when some stress came in from work, i started slipping and eating more food again.\n\nnow i'm back where i started.  i don't know what to fix in the rest of my life so that i don't seek out excess food again.  i mean, i have all these grand ideas on how i'd want my life to be, but i have no idea how to get there.",
                                            "score": 2,
                                            "author": "aManPerson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We're here for you.  You can do this!",
                                                    "score": 2,
                                                    "author": "lush_rational"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I made sure to have one last appointment with my doctor so that he could register me as a success data point.\n\nDoctors generally really don't care.  It is known that some people are successful with diet and exercise, so seeing one more won't change their mind.  They already know it.  The thing is, diet and exercise simply isn't their specialty and they aren't trained in how to do it successfully, so it's essentially trivia from their perspective.  Interesting but not useful.",
                                    "score": 2,
                                    "author": "lf11"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not to be a pessimist, but if she specializes in obesity, she probably has some scope of how a low carb diet can quickly make you lose weight.  She probably also is under the conclusion that a good % of people who lose a ton of weight quickly, are more likely to gain it back than those who lose it slowly over a long period of time. Whether that is true or not is debatable. \n\n",
                            "score": 27,
                            "author": "PsychicWarElephant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope - at least to the low carb aspect.\n\nShe doesn't/didn't believe that a low carb diet could have any effect on weight loss.  ",
                                    "score": 10,
                                    "author": "eatbaconloseweight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A low carb diet helps you take in less calories. She understands that. There isn't evidence that it's significantly better than other diets. They all help you eat less calories. Whatever works for the individual is fine. ",
                                            "score": 14,
                                            "author": "loofawah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "l",
                                                    "score": 7,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, that's just stupid.",
                                            "score": 2,
                                            "author": "marsglow"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She's probably seen zillions of patients lose lots of weight on the low-carb diet only to gain it all back once they returned to eating \"normally\". I've done it myself. Only when I went fully keto and accepted that it would be my eating pattern for the rest of my life did it stick. ",
                                    "score": 2,
                                    "author": "Heph333"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;she really didn't give a shit either.\n\nThat's because she didn't get paid.\n\nWhat you did is amazing.  I know that surgery is sometimes unavoidable, but I imagine there is significantly less risk and cost involved in doing it through diet and exercise. What a great example for everyone. ",
                            "score": 4,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Poop on her, then.  Seriously, some doctors got an advanced degree in God Complex 101.",
                            "score": 5,
                            "author": "blondiekate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take care of your gallbladder! Sudden weight loss can trigger gallstones like what happened to me! Fuck my doctor for not telling me anything about this so I had to undergo operation...",
            "score": 5,
            "author": "Yinshid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't.  It's in the medical scrap dump somewhere.  ;)\n\n(I haven't had a gallbladder since 2012.)",
                    "score": 5,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After your operation, did you gain weight?",
                            "score": 3,
                            "author": "Yinshid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep ... but it had less to do with my missing gallbladder and more to do with Twinkies.  \n\nI will say this ... after the removal I had the dreaded \"dumping syndrome\".  Keto completely cleared that up for me.",
                                    "score": 5,
                                    "author": "eatbaconloseweight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In my case I had no problem with my daily bowel movement. I just had some problems with oily face and acnes that I had to get pierced in the face by some dermatologist. I think I should try keto too... but I need to find a nutritionist because it's pretty risky without proper guide. Just wrong food intake can subtly damage the liver. (Bad liver produces bad bile that can block the bileduct.) Glad to hear there are no side effects ",
                                            "score": 2,
                                            "author": "Yinshid"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stumbled on your post from /all, not too well versed in Keto, but fucking grats. That's a great accomplishment. ",
            "score": 3,
            "author": "SlapChop7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well thanks!  :)  Much appreciated!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great work - but if you are going to insist on telling everyone, doc ain't going to be able to jet down to the Bahamas anymore    ",
            "score": 3,
            "author": "BloodAndBroccoli",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sure they'll live.  :)",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YUP good job man. wife was as 260, i was at 346, she went lazy surgery, both a year ago, she is at 155 today and i am at 255 (which i carry well due to my frame) i started seeing a 1 pack develop in my gut. so we both lost a bunch but i still have my internal organs. my goal is maybe another 25lbs but i dont want to looks like im sick. im a tree stump so i got that going for me",
            "score": 3,
            "author": "AcidRayn666"
        },
        {
            "level": 0,
            "comment": "Congrats! Looking good!",
            "score": 2,
            "author": "Petra_Ann",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!!  :)",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! You're making awesome progress. ",
            "score": 2,
            "author": "JennLnz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 3,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "great progress!",
            "score": 2,
            "author": "mvadovic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You go girl!!!",
            "score": 2,
            "author": "kerry_alison",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So awesome. Great work. ",
            "score": 2,
            "author": "sassytaters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh ... doesn't feel like work.  Feels like delicious on a plate.  ;)",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "did you exercise regularly or extra hard ?or just change your diet ?\n\ni change my diet to almost no carbs and i am losing some weight which my physician says is \"not healthy\". 4 kg in 2 weeks is apparently a bad thing :P but i am on a 1500 calorie diet atm.\n\n",
            "score": 2,
            "author": "TrinityF",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not unhealthy if you're obese in the first place. 4 kg when you only weigh 51 kg? Not healthy. 1,500 is plenty of calories to be getting adequate nutrition, keep it up!",
                    "score": 3,
                    "author": "snickers_snickers",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Nope.  Zero exercise (until very recently) ... 100% diet.",
                    "score": 3,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this.  Congratulations on your hard work",
            "score": 2,
            "author": "ifallalot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!  And honestly, I know this sounds trite, but it honest to goodness wasn't hard work.  I feel like this is how I should've been eating all along.",
                    "score": 6,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's amazing! Congratulations! You are such an inspiration to me.",
            "score": 2,
            "author": "SashaWombat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!\n\nAnd I'm no inspiration ... or I don't feel that way.  But thank you for saying nice things about me!  :)",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck.  Yes.  Fuck yes!!!!",
            "score": 2,
            "author": "Release82",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you ... and I'll add ...\n\nFuckin' A!\n\n(I just realized have no idea what that really means, but I remember saying it a lot in the 80s.)",
                    "score": 2,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here, from Boston friends especially lol \n\nBut seriously that's amazing you keep it up 👍🏽",
                            "score": 2,
                            "author": "Release82"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What has been your daily caloric intake and what macro percentages were you working with?\n",
            "score": 2,
            "author": "Oct3ismybirthday",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done one meal a day since about May - I average between 800-1200 calories a day depending on what I'm eating.  Chicken/fish:  lower end.  Ribeye:  higher end.  I used to be super super anal about percentages - I'm not anymore really.  I'm just always, 100% of the time, under 20 carbs a day.",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations! You look fantastic! You have honestly inspired me to go balls out (figuratively), full force into doing keto. I have about 100 lbs I need to lose and it is like a self defeating cycle of feeling like, \"Wow, I can't do that,\" making me more depressed about the weight. I'm so inspired! I will go check out your insta. \n\nThis is so good to hear! ",
            "score": 2,
            "author": "rainbowbrighteyes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get you.  When it's such a large amount it seems like the biggest frickin' hill to climb.  But day by day, pal!  :)",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome! And those neck gains!",
            "score": 2,
            "author": "diegroblers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha!  Thank you!",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at that...\n\nDoc wanted you to get surgery with potentially serious complications and all manner of discomfort and you did it more than twice as fast just by changing your diet.\n\nWell done!",
            "score": 9,
            "author": "redeyemaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"you did it more than twice as fast just by eating bacon\".\n\nFTFY",
                    "score": 3,
                    "author": "sfcnmone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "HAHAHAHAHAHAHA!!  \n\n#truth",
                            "score": 5,
                            "author": "eatbaconloseweight"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Major props on your weight loss! \n\nThat said, most people who go to a bariatric surgeon have reached a point where they are not willing or are unable to diet and exercise. They've already been told by 50 doctors to eat less and move more. \n\nIt's fantastic that you decided to put in the effort to reduce your caloric intake, but it's not the doctor's fault for recommending a surgery that people go to her for. \n\n",
            "score": 4,
            "author": "dustlesswalnut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!  \n\nIt's too long to go into here ... but cutting out carbs/sugar really flipped a switch in my head.  It's not as simple as simply cutting calories (though I'm quite aware that's how weight loss happens) ... I lost 70 pounds on Weight Watchers years ago and was starving on 1200 calories.  1200 calories on a ketogenic diet is entirely different ... not only am I not hungry, I don't crave anything either.  ",
                    "score": 8,
                    "author": "eatbaconloseweight"
                },
                {
                    "level": 1,
                    "comment": "You clearly don't understand keto.\n\nIt is ***Not*** a question of simply eating less and exercising more. It's about cutting out carbs that some people are not genetically evolved to process. Instead of having 15 copies of the AMY1 gene, they may have only one. Therefore, their body does not produce amylase in their saliva to break down starch, so the body can't digest it to provide energy, so stashes it away as body fat instead. \n\nUnfortunately the low fat diet started by Ancel Keys encourages people to eat more carbs instead. Hence the obesity epidemic.\n\nAncel Keys has been responsible for more deaths that Hitler. He was paid by the sugar industry to blame Something Else other than sugar for the rising rate of heart disease, in order to exonerate sugar. So he picked saturated fat instead. Then persuaded the government and entire medical profession to believe him, leading a smear campaign against the doctors and scientists who said that it was sugar that was causing all the trouble, not fat. But money speaks. ",
                    "score": 4,
                    "author": "EvaOgg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You gain weight if you eat more calories than you need, regardless of the source. It's fantastic that OP found a diet they were able to maintain but whether a person loses weight on any diet, including keto, comes down to calories in vs calories out. ",
                            "score": 6,
                            "author": "dustlesswalnut"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; In Jan, doc said my only hope was bariatric surgery\n\nThis is concerning.. I thought surgery was supposed to be a last resort? Regardless, congrats on the weight loss!!",
            "score": 2,
            "author": "Mysterious_X",
            "replies": [
                {
                    "level": 1,
                    "comment": "At 47 and a lifetime of yo-yo dieting .... surgery did seem like the last resort I suppose.\n\nAnd thank you!",
                    "score": 5,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, that makes it more understandable then. Glad you found a non-surgical way to get healthy!",
                            "score": 2,
                            "author": "Mysterious_X"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "!redditsilver",
            "score": 2,
            "author": "rudbek-of-rudbek",
            "replies": [
                {
                    "level": 1,
                    "comment": "###[Here's your Reddit Silver, eatbaconloseweight!](http://i.imgur.com/x0jw93q.png \"Reddit Silver\") \n***\n/u/eatbaconloseweight has received silver 1 time. (given by /u/rudbek-of-rudbek) __[info](http://reddit.com/r/RedditSilverRobot)__",
                    "score": 3,
                    "author": "RedditSilverRobot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go back to the doctor, and oink in his face and say, eat it, eat it pig.. Ala Erin from the office. ",
            "score": 2,
            "author": "nbo10",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Notice that the doc would have made a lot of money with his gastric bye-pass surgery, but none with your going keto.\n\nPlease don't forget to read about intermittent fasting.",
            "score": 1,
            "author": "birdyroger",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done OMAD since about May .... but thanks!",
                    "score": 2,
                    "author": "eatbaconloseweight",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are amazing.",
            "score": 1,
            "author": "DausenWillis",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think I'm amazing - I think keto is amazing  ... but thank you for the nice words!\n\n:)",
                    "score": 3,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow congratulation!",
            "score": 1,
            "author": "ketophian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy crap, you did an amazing job! You're an inspiration, ha",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very good job. You have to be elated. You're killing it, and I'm sure you'll continue to do so. It'll slow down a bit as you get smaller, but I'm sure you already know that. :)",
            "score": 1,
            "author": "SocraticallyPwn"
        },
        {
            "level": 0,
            "comment": "Standing ovation!!!!!!!! That's incredible - you should be super proud of yourself!!!",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww!  Have a seat please ... but thank you!!  :)\n\n(And I am!)",
                    "score": 1,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You lost more than 1/3 of your SW, I am still standing and clapping!!!",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is incredible! You're an inspiration! \n",
            "score": 1,
            "author": "booknerdwhit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Less inspiration, but more hot mess ... but thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude! Awesome job!!! ",
            "score": 1,
            "author": "Jacruzer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 1,
            "author": "fabianogina2"
        },
        {
            "level": 0,
            "comment": "Fantastic!\n",
            "score": 1,
            "author": "Tinkboy98"
        },
        {
            "level": 0,
            "comment": "You continue to inspire, eatbaconloseweight!!!",
            "score": 1,
            "author": "lil-lemon-tree"
        },
        {
            "level": 0,
            "comment": "Damn what feat! KCKO and you go Girl!!!!",
            "score": 1,
            "author": "dantheman49"
        },
        {
            "level": 0,
            "comment": "Your Instagram is amazing by the way! You have a lovely sense of humor! Keep at it young lady! ",
            "score": 1,
            "author": "metroelph"
        },
        {
            "level": 0,
            "comment": "That's incredible... congratulations. Mine is going a lot slower than that but I am finally making some progress",
            "score": 1,
            "author": "susyquk"
        },
        {
            "level": 0,
            "comment": "Fuck yeah! Great job!\n\nIt still amazes me that anyone in the medical profession can not comprehend that cutting carbs will make you lose was safely and swiftly.",
            "score": 1,
            "author": "broskiatwork"
        },
        {
            "level": 0,
            "comment": "I follow you on instagram and you are such an inspiration! Love seeing your posts everyday. Keep it up. :D",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Keto works. Congrats and don't stop now.",
            "score": 1,
            "author": "F80M305"
        },
        {
            "level": 0,
            "comment": "Congratulations! Very inspiring. ",
            "score": 1,
            "author": "Ausr1"
        },
        {
            "level": 0,
            "comment": "You are inspiring! Keep it up! ",
            "score": 1,
            "author": "pistol_annie",
            "replies": [
                {
                    "level": 1,
                    "comment": "LOL!  I don't think I'm inspiring ... but thank you for saying nice things!  :)",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats on your progress! ",
            "score": 1,
            "author": "StrangestTwist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "AWESOME AWESOME!!! THATS GREAT! ",
            "score": 1,
            "author": "awholeneworld85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's freakin awesome! Keep at it, don't let this fantastic milestone distract you from the rest of your journey.\n\nPhenomenal username too btw!",
            "score": 1,
            "author": "crownjewlscrownjewls",
            "replies": [
                {
                    "level": 1,
                    "comment": "No worries!!\n\nAlso ... I like my username too.  ;)  ",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good science and hard work. Well done. ",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jeebus. That is incredible. ",
            "score": 1,
            "author": "Dr_Gillian_McQueef",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep.  Kinda shocks me too sometimes.  Like this pic ... I'm just kinda like, wtf dude?  ;)",
                    "score": 1,
                    "author": "eatbaconloseweight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in the early stages. AGAIN. Determined this time. Between your SW and CW. You've totally inspired me. ",
                            "score": 1,
                            "author": "Dr_Gillian_McQueef",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha, thats sooo awesome! Much love your way!!!!",
            "score": 1,
            "author": "JuanFromTheBay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing!",
            "score": 1,
            "author": "sledneck_03",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So proud of you! Keep kickin ass you look GREAT!!! ",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I look good.  One day though I'll look great!  ;)",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "AMAZING - also, keto didn't do that. YOU DID. Keto was just the way you got there. \n\nKeto on - you're a boss. ",
            "score": 1,
            "author": "vtlatria",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww ... thanks so much!!",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats!  You deserve it!  ",
            "score": 1,
            "author": "TheGalaxyEater",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Woohoo! Well done!",
            "score": 1,
            "author": "BigRedKetoGirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You may!  I've done one meal a day since prolly May ... it happened gradually since I'm not really hungry during the day and I **love** a big dinner.  It depends on what is on my plate for dinner - if it's salmon/chicken, may daily total will be lower.  A Flintstone sized ribeye, higher.  But it's probably anywhere between 800 and 1200.  It really depends.  And honestly, it's been way higher ... and also way lower.  But that's the average.",
                    "score": 3,
                    "author": "eatbaconloseweight",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome progress! Did you ever go back to that doctor? What did he say?",
            "score": 1,
            "author": "TomBonner1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorta.  I emailed her when I lost 50 (3 months - I needed to cancel my appointment) and then at 6 months when I lost 100.  She was kind, but kinda meh.  She's an obesity researcher at a top hospital and I thought she would be fairly interested in how a 47 year old woman lost 100 pounds in 6 months by diet alone ... but ... nope.  \n\nAnd thank you!\n",
                    "score": 3,
                    "author": "eatbaconloseweight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yay! Congratulations! What an achievement:) I bet you can't wait to see what will happen in the next 8 months!",
            "score": 1,
            "author": "notjacknicholson",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will be 48!!  Yay!!  No ... booooooo.\n\nSeriously - thank you so much!",
                    "score": 1,
                    "author": "eatbaconloseweight",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations OP! You look amazing!!! Also, you are cracking me up with your responses. That is a huge goal to achieve. It's funny what motivates us sometimes :)",
            "score": 1,
            "author": "-in_the_wind_",
            "replies": []
        }
    ]
}