{
    "id": "8nwtv9",
    "score": 4203,
    "title": "Down 102 pounds in 6 months! [Pics]",
    "author": "riot4u",
    "date": 1527899075.0,
    "url": "https://www.reddit.com/r/keto/comments/8nwtv9",
    "media_urls": [
        "https://www.reddit.com/r/keto/comments/8nwtv9/down_102_pounds_in_6_months_pics/"
    ],
    "other_urls": [
        "https://imgur.com/a/ZgrMY7o"
    ],
    "postText": "Six months ago I made the decision to start keto, and it was the best one I've made. At my heaviest I was at 337, now I'm down to 235. Seeing everyone's progress inspired and motivated me to keep going, I hope I can do the same as well. \n\nPics: https://imgur.com/a/ZgrMY7o\n\n",
    "comments": [
        {
            "level": 0,
            "comment": "You are my hero man. I’m on day 3 of Keto with a starting weight of 485. I’m so inspired. \nEdit 1: I just want to say thank you all for how supportive you are. ",
            "score": 807,
            "author": "Freedom1015",
            "replies": [
                {
                    "level": 1,
                    "comment": "1) Do a high-dive cannonball at an indoor pool on the first Saturday of every month and record each.\n\n2) Compile each clip chronologically back-to-back once you're at your goal weight.\n\n3) Upload the video and we can watch your splash shrink.\n\n4) Get mad updoots.\n\n5) Probably not die of a massive heart attack.",
                    "score": 724,
                    "author": "K3R3G3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even better, post it in reverse chronological order and fool everyone into thinking you are THE most dedicated cannonballer of all time. ",
                            "score": 230,
                            "author": "Buzzdanume",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course. But you do both, the second 3 days later. Double the karma.",
                                    "score": 66,
                                    "author": "K3R3G3"
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s the most evil thing I can imagine (*cries*)",
                                    "score": 7,
                                    "author": "DemSkrubs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is an odd community.",
                            "score": 22,
                            "author": "Vadersboy117"
                        },
                        {
                            "level": 2,
                            "comment": "I regret that I have but one upvote to give...",
                            "score": 18,
                            "author": "sypherlev"
                        },
                        {
                            "level": 2,
                            "comment": "That #5 brings me joy",
                            "score": 9,
                            "author": "orangemamba1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You got this. ",
                    "score": 35,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You can definitely do it man. I started really high myself (I'm still extremely overweight but still feel so much better) and I can attest, when you start seeing that scale go down and seeing small improvements to everything regarding your physical being, you will stick with it. Everytime I get the urge to \"cheat\" (which is surprisingly rare these days) I just think of how miserable I was and how that 2 minute gratification of carbs/sweets will end and then I'll just feel regret and dissatisfied. This diet is going to save our lives my dude and Im glad you decided to give it a chance too.",
                    "score": 35,
                    "author": "Loco_Mojo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would just like to say you’re doing awesome! Keep up the great work, honestly. What would you say were the most beneficial things for you? Did you exercise at all? My father is currently your sw and height, but he has major back and hip issues after a car accident many years ago. He can barely walk right now, and they won’t do the surgery until he loses the weight. \n\nI’m trying to find something to help him. Any tips you have would be amazing. ",
                            "score": 4,
                            "author": "AnImproversation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! I started in November of last year. No exercise except transitioning from a desk job to a job where i stand and walk a majority of the day. Though, I think it would have been equally doable without the slight exercise increase. \n\nA few things i incorporated to make my diet more effective were meal prepping and IF. I started a steady 16:8 everyday after a few weeks into the diet because my appetite reduction was insane. Meal prepping kept me on task and made it more effective to log macros on MFP. I attribute my current stall to be because I’ve slacked severely on my meal prepping and instead will have to decide what to randomly make each night. ",
                                    "score": 2,
                                    "author": "Loco_Mojo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you for this! ",
                                            "score": 2,
                                            "author": "AnImproversation"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely can relate, the carbs taste good for a little then i just go back to feeling bloated",
                            "score": 3,
                            "author": "Diiigma"
                        },
                        {
                            "level": 2,
                            "comment": "Potatoes are my cheat I allow once a month, but I'm very active so its eh, ok I guess I don't eat them often so I figure since I'm always doing something, active and I haven't gained only losing so I see no harm. I've lost 30 in a month so I'm doing great to. ",
                            "score": 4,
                            "author": "Project_Zombie_Panda"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you so much. How long have you been on keto?",
                            "score": 2,
                            "author": "Freedom1015",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might want to try intermittent fasting by just skipping breakfast and doing keto at the same time. I found it worked well. Trying mixing it up everyone is different.",
                                    "score": 5,
                                    "author": "threowawayaccount",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what sort of IF should I do? like 18/6?",
                                            "score": 1,
                                            "author": "Freedom1015",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Start with 12 hours fasting, then move to 14 then 16 and find your optimum point. Some people do 23 (One Meal A Day). \n\nAnother thing I've found is that changing this up for a week or two is a good plateau buster.",
                                                    "score": 5,
                                                    "author": "lad1701"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Try 16:8",
                                                    "score": 2,
                                                    "author": "threowawayaccount"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve been on keto since the beginning of November, so about 8 months so far.",
                                    "score": 2,
                                    "author": "Loco_Mojo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just stay the course man you will see huge progress! ",
                    "score": 11,
                    "author": "BourbonandCigarguy78"
                },
                {
                    "level": 1,
                    "comment": "You got it! It gets A LOT easier after the first ~week. ",
                    "score": 8,
                    "author": "ExtraHardBush"
                },
                {
                    "level": 1,
                    "comment": "Brother get at it. It gets easier to let the bad food go as time progresses. Hoping for the best on you ur journey my friend. ",
                    "score": 9,
                    "author": "jazsper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you very much. I feel great so far. I just got a CPAP the same day as my first day of Keto, so I’m sleeping so well and I feel so energized. ",
                            "score": 14,
                            "author": "Freedom1015",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's what helped me get the motivation to lose weight - my doctor said my sleep apnea was one of the worst cases. he's ever seen, so that plus my hatred for sleeping with my mask gets me eating right so I can ditch the thing asap. Stick with it, you absolutely won't regret it. The first two weeks are the toughest but after that it's smooth sailing",
                                    "score": 3,
                                    "author": "Troghen"
                                },
                                {
                                    "level": 3,
                                    "comment": "CPAP changed my life just as much as keto has so awesome.\n\nGood news, if you have it due to weight like it appears that I do...one day you can be free of the machine.\n\nMy reduced weight has reduced the impact of sleep apnea ...you'll love it.",
                                    "score": 3,
                                    "author": "Lrivard"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Keep it up! ",
                    "score": 16,
                    "author": "Frunx"
                },
                {
                    "level": 1,
                    "comment": "Keep it up Freedom. ",
                    "score": 6,
                    "author": "blooppossum"
                },
                {
                    "level": 1,
                    "comment": "I’m rooting for you! Don’t give up. ",
                    "score": 5,
                    "author": "mxmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you so much :)",
                            "score": 3,
                            "author": "Freedom1015"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You'll need to start taking magnesium to combat muscle cramps in a few weeks.\n\nLong-term you'll learn about the non food reasons that make you want to eat.  I still haven't conquered that.",
                    "score": 3,
                    "author": "NSFWies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've struggled with depression in the past and eating was one of my biggest (and worst) coping methods. I'm taking antidepressants now and seeing a counselor, so I'm slowly starting to take some of this stuff head on. \nAnd thank you so much for the tip about magnesium. Is this common in keto? ",
                            "score": 6,
                            "author": "Freedom1015",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think so.  As you lose weight, you're losing a lot of water.  With water comes minerals as well (sodium/potassium/magnesium) so it's good to make sure you get a good source of minerals in your diet somewhere if you can.  Someone correct me if I'm wrong, I'm not an expert.",
                                    "score": 3,
                                    "author": "Greel89"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes.  With a diet low in carbs, you will pee all the time.  This will depleate your electrolytes (sodium, magnesium, potassium).  So honestly, do not worry about eating salty things.  You will need it.  You can get potassium from avacados or lite salt (50% NaCl and 50% KCl).\n\nI read 3 books on keto and only in the last one did it mention the magnesium thing.  I was taking one 400mg pill before bed.  Had a good sleep, and holy cow a good crap when I woke up.\n\nYour overall testosterone is probably low because our very high amount of bodyfat concerts it into estrogen.  So you could also talk to Doctors about your testosterone and estrogen levels.  Taking an anti estrogen made a world of an emotional difference for me.  I am now much more steady and less freaking out at myself about every dam thing.  It's slowly causing me to rethink everything about my life, why I do things for pleasure and what it really accomplishes.\n\nWelcome to the start of your journey.  It won't be quick, just don't give up.",
                                    "score": 3,
                                    "author": "NSFWies"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, very common. While it's not in any way impossible to get magnesium, potassium etc on a keto diet, in the first week or two you lose loads of it as you lose water weight, so supplements are recommended. And as another poster said, SALT ALL THE THINGS! If you don't already have liteSalt (or mineral salt, it goes by different names), go buy it. That's salt with added potassium which you'll need. I usually salt my foods with both regular and litesalt :)\n\nAlso, a totally not mandatory but possibly useful supplement is hydrolyzed collagen which is great for your skin (I've used it myself so I know it works) and will stop it from becoming saggy. As you lose loads of weight fast, that's otherwise a problem a lot of people have - they look good with clothes on, but the skin sags! Now, you're young so your skin should adapt eventually anyway but hydrolyzed collagen may help :)",
                                    "score": 3,
                                    "author": "JG1991"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "All the best to you! Post any time for support :)",
                    "score": 3,
                    "author": "tranquil45"
                },
                {
                    "level": 1,
                    "comment": "You got this dude. It only gets easier from there on.",
                    "score": 3,
                    "author": "Captainknuckl3s"
                },
                {
                    "level": 1,
                    "comment": "You got this! KCKO!",
                    "score": 3,
                    "author": "PeachBumFitness"
                },
                {
                    "level": 1,
                    "comment": "Stick with it. No cheat days! Today is my two-month anniversary of starting keto and I’ve lost 33 pounds. Everyone at work is commenting on how noticeable it is. It’s a great feeling! It can be tough the first week or so, but once you get momentum on your side it gets easy and it’s so worth it! Wish you the best of luck. You can do it. ",
                    "score": 3,
                    "author": "hanswermhat"
                },
                {
                    "level": 1,
                    "comment": "hell yeah! take your before pics",
                    "score": 3,
                    "author": "Paradoxa77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Already did. haha.",
                            "score": 1,
                            "author": "Freedom1015"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Remember when you are working out, even if it’s just walking on a treadmill on an incline:\n\n“If it doesn’t challenge you, it won’t change you”. ",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for your wise words, pm_me_ur_booooty",
                            "score": 4,
                            "author": "Freedom1015"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Each day it gets easier. Stay with it!",
                    "score": 3,
                    "author": "seoulbran"
                },
                {
                    "level": 1,
                    "comment": "You got this man! As a 400lb guy myself, I also look at these success stories and my jaw drops. Keto's really phenomenal. The feeling alone is so amazing.\n\nI'm proud of you for starting. We'll see each other at the finish line!",
                    "score": 3,
                    "author": "BigHaircutPrime"
                },
                {
                    "level": 1,
                    "comment": "One thing that disheartened me at the beginning was seeing people start at a weight I would have liked to be at. Definitely keep your head up. The most important thing is being consistent. There were some weeks, even early, when I would lose just a single pound in a week after working my ass off (turns out me + keto + Crystal light don't mix). \n\nThis does work. This will work. Sick with it and you can make massive life changes.",
                    "score": 4,
                    "author": "wcalvert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much. ",
                            "score": 4,
                            "author": "Freedom1015"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's awesome.  Stick with it and you'll get down in no time.  For me it was taking it a day at a time and never thinking about the future.  Before you know it, the diet is a part of you and is effortless.  Next thing you know, your clothes start feeling huge.",
                    "score": 2,
                    "author": "TheDrunkenOwl"
                },
                {
                    "level": 1,
                    "comment": "Freedom1015 you can do it!  \n\nI am the same height as you, but I am 36.  When I started Keto in the beginning of November, I was 487lbs.  I don't weigh myself, only get weighed when I have a doctor appointment so I can't give you a completely accurate weight that I am now.  My last appointment was at the end of February and after a little over 4 months I was already down to 419.  I have continued to lose a massive amount of weight, and can't seem to stay at a size long enough to buy clothes that will continue to fit for more than a couple of weeks.  (lol not that I am complaining!)\n\nSo, with you being a young man still, and on the right track already, I am absolutely positive that if you stick with it, the future is yours!  \n\nThere will be some rough times here and there, just remember to eat enough, don't go crazy on the protein because it will slow down weight loss a lot if you get too much, and don't beat yourself up if you make a mistake, mistakes happen.  Hell, I accidentally knocked myself out of keto a few times.  \n\nP.S.  I know you are a young man, and this one may be difficult, but avoid alcohol as much as you possibly can.  There is a good chance that it will throw off your system like crazy, and kick you out of Ketosis even if you are well below your daily Carb limit.  ",
                    "score": 2,
                    "author": "Zenotetsuken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much. My first 2 weeks, I’ve pretty much checked the scale daily and I’m down about 13 pounds at this point. \nAnd as far as alcohol, I’ve never been super crazy when it comes to booze. Maybe a beer every week or so on a lazy Sunday night. And now, I’ll just have a whiskey on the rocks if I’m really hankering for something. All I can say is that it’s been about 4 years since I’ve seen the scale drop, and I gained all that back and then some. I’m excited to actually see some weight loss. I can already feel it some, because I keep having to adjust the mask tightness on my CPAP. Lol. ",
                            "score": 2,
                            "author": "Freedom1015"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "3 months in now, how are you doing?",
                    "score": 2,
                    "author": "DeusVultSaracen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "slim Jims, mozzarella sticks, nuts. the X factors when it comes to quieting the hunger on the go.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still cant bring myself to eat slim jims anymore you can eat clean keto...those things are shit",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are a life saver if you are on the road between sales calls.",
                                    "score": 3,
                                    "author": "Pksnc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is some of the biggest progress I’ve ever seen on r/keto, congrats",
            "score": 158,
            "author": "Dobro_dan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this.",
                    "score": 3,
                    "author": "Charles_Himself_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats man! I'm coming after you! I'm saving up to do a 6 month post as well! \n\nSeriously though, congrats. You look so much happier and your post is motivating me even harder!",
            "score": 49,
            "author": "RichOnKeto",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m looking forward to seeing your post!",
                    "score": 12,
                    "author": "epaka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jeezus H Bacon, HOW?! That's a dietary *deficit* of 2300kcal PER DAY.",
            "score": 75,
            "author": "bigpipes84",
            "replies": [
                {
                    "level": 1,
                    "comment": "My tdee is 3700.  I consume about 1200-1400 cals.  How is keto.  Why is motivation.  This sub kicks ass",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why is ~motivation~ discipline",
                            "score": 2,
                            "author": "words_words_words_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s almost as if CICO doesn’t exist!!! ;)",
                    "score": 26,
                    "author": "epaka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s more like CICO is not absolute, 1000 calories of alcohol a day will destroy your body for example.",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "/r/ketodrunk ",
                                    "score": 5,
                                    "author": "ketosore"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Newbie here - I don't understand your comment? Are we saying that OP basically has been living off of energy stored in fat?",
                            "score": 5,
                            "author": "alheim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know if that's what OP's saying, but what you're saying regardless is true. The great thing about Keto is that once you train the body to convert fat into fuel, your body fat becomes an oil well. As a result that usually means you're also less hungry because your body's snacking on your fat, thus you can have large caloric deficits and still feel fine. As long as you make sure to get in your essential vitamins and nutrients, and listen to your body, you're golden.",
                                    "score": 3,
                                    "author": "BigHaircutPrime"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not sure what your point is. ",
                            "score": 0,
                            "author": "RedofPaw",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I lost 24.3lbs in June. My BMR is 3173, eating 1500, walking at least 5 miles a day, hitting the gym 3 times a week. It is doable.\n\nCongrats OP, great work.",
                    "score": 4,
                    "author": "buff3r0v3rflow",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 32,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be me haha",
                    "score": 15,
                    "author": "riot4u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey man! That’s great, here’s to your health! Way to go, lookin great! ",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You no longer need to hope, because I just saved your post! I love it brother, sharing that little bit of your willpower goes a long way. Considered me inspired.",
            "score": 11,
            "author": "bdomo28"
        },
        {
            "level": 0,
            "comment": "I'm digging the Supreme shoulder bag and foamposites fr. Nice fashion and congrats on the loss. ",
            "score": 22,
            "author": "Viecris",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I started collecting shoes when I was heavy, so I wanted to get some nice fits to go along with them. When I wanted and could fit into supreme(06), I couldn't afford it. Now I can afford it and will soon be able to fit into it. I have a whole bunch stashed away for when I hit my target weight. ",
                    "score": 21,
                    "author": "riot4u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great job! Is this doing strict keto/exercise or lazy keto?",
            "score": 5,
            "author": "Dummyact321",
            "replies": [
                {
                    "level": 1,
                    "comment": "The first four months were lazy keto, then I started walking on a semi daily basis. Started by doing a mile a couple of times a week, now I'm up to walking 5 miles every other day. I only broke keto for my birthday and for two business trips. ",
                    "score": 38,
                    "author": "riot4u",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Man good for you for getting out there and walking. That's some seriously good progress. Did you IF or EF or anything? Or just eat keto when hungry?",
                            "score": 4,
                            "author": "yeah_It_dat_guy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I started IF yesterday, but before that I just ate when I was hungry, which wasn't often. After about 3-4 weeks of keto I lost most cravings for food. ",
                                    "score": 11,
                                    "author": "riot4u",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's good to hear.  I've yet to stay on keto for more than 2 weeks or so.  hope to make some better progress in the future.  Congrats you are looking excellent my dude.",
                                            "score": 4,
                                            "author": "Greel89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The benefits really start coming in after two weeks and you get used to it, so just keep it up and push through!\n",
                                                    "score": 6,
                                                    "author": "kizzmysass"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I recommend the Ketone Testing Strips. There is something extra motivating being able to visually confirm you're locked in Ketosis. ",
                                                    "score": 4,
                                                    "author": "usmcawp"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cool, very inspiring post 😊",
                            "score": 2,
                            "author": "Dummyact321"
                        },
                        {
                            "level": 2,
                            "comment": "Can you share some of your recipes",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lookin good and oooh are those the foamposite northern lights??",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "nah, just some island green pros.",
                    "score": 5,
                    "author": "riot4u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey man, I completly feel your struggle. Started at 400lbs 7 months ago, am now at 300.\n\nGreat job pulling through and thank you for sharing.",
            "score": 4,
            "author": "staubgame"
        },
        {
            "level": 0,
            "comment": "I literally started Keto three years ago so I could fit into supreme clothes. Lost 115lbs and achieved my bliss! Keep up the great work man!",
            "score": 12,
            "author": "Tiger_Millionaire",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That is some insane progress, congrats!",
            "score": 4,
            "author": "Frozen-assets"
        },
        {
            "level": 0,
            "comment": "Good shit my dude. The best thing about this is it’s so hard to to do. And you fucking did this. If you can do this, you can do whatever you want. Keep killing it. ",
            "score": 4,
            "author": "steeveperry"
        },
        {
            "level": 0,
            "comment": "Great job eddy",
            "score": 2,
            "author": "kimjongskills",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, now who is this? ",
                    "score": 3,
                    "author": "riot4u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow.   You look great! ",
            "score": 3,
            "author": "Rpizza"
        },
        {
            "level": 0,
            "comment": "Great job!!",
            "score": 3,
            "author": "soosyq"
        },
        {
            "level": 0,
            "comment": "This is epic man! Good job",
            "score": 3,
            "author": "stairstepper357"
        },
        {
            "level": 0,
            "comment": "You look like a young, latino Richard Stallman. Shave the beard and get a job, ya hippie! :P\n\nIf you don't mind me asking, what's the situation with your lower stomach? From other posts on here, losing such a huge amount of weight results in really loose skin. Was that the case for you as well?",
            "score": 3,
            "author": "blamo111"
        },
        {
            "level": 0,
            "comment": "Handsome before and after!  You are inspirational!",
            "score": 5,
            "author": "Sidco_cat"
        },
        {
            "level": 0,
            "comment": "Wow. Amazing!! Well done mate. ",
            "score": 2,
            "author": "astroboy__"
        },
        {
            "level": 0,
            "comment": "You are amazing! I’m so proud of you!",
            "score": 2,
            "author": "cleochatra"
        },
        {
            "level": 0,
            "comment": "Wow! That was fast. ",
            "score": 2,
            "author": "Afdavis11"
        },
        {
            "level": 0,
            "comment": "Your progress is amazing! Also, I respect the foams in the after pic!",
            "score": 2,
            "author": "lonewanderer44"
        },
        {
            "level": 0,
            "comment": "YOU KICK ASSSSS!!!! Im so very impressed  \n you!",
            "score": 2,
            "author": "Baconbitsrock"
        },
        {
            "level": 0,
            "comment": "You’re awesome",
            "score": 2,
            "author": "Eelmonkey"
        },
        {
            "level": 0,
            "comment": "What an amazing transformation! Congratulations!",
            "score": 2,
            "author": "angelmama4"
        },
        {
            "level": 0,
            "comment": "Amazing! Congratulations!",
            "score": 2,
            "author": "FOODloljk"
        },
        {
            "level": 0,
            "comment": "How many calories did you eat per day? ",
            "score": 2,
            "author": "Alerintek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Around 1500",
                    "score": 6,
                    "author": "riot4u",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "how often do you run into people who don't recognize you?",
            "score": 2,
            "author": "lvl3BattleCat"
        },
        {
            "level": 0,
            "comment": "Dope fit too",
            "score": 2,
            "author": "PersonalityChamp"
        },
        {
            "level": 0,
            "comment": "Loving the foamposites!",
            "score": 2,
            "author": "Krock23"
        },
        {
            "level": 0,
            "comment": "Damnnnnn dude. Those losses are impressive on their own, let alone over a 6 month period. Amazing work",
            "score": 2,
            "author": "rsmitty497"
        },
        {
            "level": 0,
            "comment": "Your hard work has certainly paid off!!",
            "score": 1,
            "author": "ItsReallyMia"
        },
        {
            "level": 0,
            "comment": "You went from that dude from lost to imaqtpie.  Impressive man keep it up!",
            "score": 2,
            "author": "Fappinonabiscuit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lazy keto is the bestest!",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You look great. Congrats. Now get a haircut and shave.",
            "score": 10,
            "author": "Luigi7777",
            "replies": [
                {
                    "level": 1,
                    "comment": "no and maybe",
                    "score": 45,
                    "author": "riot4u",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love your hair. ",
                            "score": 12,
                            "author": "Rose1982"
                        },
                        {
                            "level": 2,
                            "comment": "Dont listen to that guy you look awesome!",
                            "score": 11,
                            "author": "dothebananasplits96"
                        },
                        {
                            "level": 2,
                            "comment": "Srsly don't listen to this fool! There are enough short-haired man around already. Long hair rocks!",
                            "score": 2,
                            "author": "Azolin_GoldenEye"
                        },
                        {
                            "level": 2,
                            "comment": "Idk I think you could rock something short on the sides, a little thicker on the top, and a nice trimmed scruff. ",
                            "score": 0,
                            "author": "bethmethdeath"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fantastic work! You look Supreme!",
            "score": 2,
            "author": "northshore21"
        },
        {
            "level": 0,
            "comment": "Wow congratulations ",
            "score": 1,
            "author": "valley72"
        },
        {
            "level": 0,
            "comment": "That’s awesome!! Congrats!",
            "score": 1,
            "author": "GusOrviston"
        },
        {
            "level": 0,
            "comment": "Awesome pix. Great size. You look thick. Solid. Tight. ",
            "score": 1,
            "author": "Billy1121"
        },
        {
            "level": 0,
            "comment": "Wow, great work and solid commitment. 😬",
            "score": 1,
            "author": "thataguymuc"
        },
        {
            "level": 0,
            "comment": "Holy smokes!  Congratulations!",
            "score": 1,
            "author": "CarawayReadsAlong"
        },
        {
            "level": 0,
            "comment": "Killer!!! you're my motivation",
            "score": 1,
            "author": "chemknife"
        },
        {
            "level": 0,
            "comment": "Way to go, man-amazing progress!",
            "score": 1,
            "author": "anahatasanah"
        },
        {
            "level": 0,
            "comment": "Congrats, you look awesome!",
            "score": 1,
            "author": "Merlin2018"
        },
        {
            "level": 0,
            "comment": "Damn man!!!  Way to go!!!",
            "score": 1,
            "author": "ppeddy1971"
        },
        {
            "level": 0,
            "comment": "Dude!  Good for you. That is amazing progress!",
            "score": 1,
            "author": "philgrad"
        },
        {
            "level": 0,
            "comment": "Wow!!!!! Amazing. I just started Keto 2 weeks ago cause I saw another girl with mad results on YouTube !😁\nWay to go keep it up!\n",
            "score": 1,
            "author": "Magenta64"
        },
        {
            "level": 0,
            "comment": "Great work man! Stay on the grind.\n\n Mind body and soul, take care of those 3 things and life will be easy.",
            "score": 1,
            "author": "--Sassythesasquatch"
        },
        {
            "level": 0,
            "comment": "HELL YEAH! Proud of you brotha! KCKO x",
            "score": 1,
            "author": "norma_xo"
        },
        {
            "level": 0,
            "comment": "Amazing work!",
            "score": 1,
            "author": "carrott36"
        },
        {
            "level": 0,
            "comment": "That's amazing, man! Great work. I wish I had your dedication.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "HELL YEAH! Congrats and keep up the good work",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "fantastic self improvement man!  How tall are you? in the before photo that one guy towers over you, but in the second you appear tall yourself or its just a trick of perspective with the door maybe...",
            "score": 1,
            "author": "coloradoraider"
        },
        {
            "level": 0,
            "comment": "102 lbs to go.",
            "score": 1,
            "author": "shabbagoy"
        },
        {
            "level": 0,
            "comment": "Yeah bro! Get it!!!",
            "score": 1,
            "author": "DanFlyhight"
        },
        {
            "level": 0,
            "comment": "Congratulations!  You’re an inspiration, everyone I turn on to ketos I tell them you have follow Reddit and you’re one the many reasons why! ❤️",
            "score": 1,
            "author": "Fmacey"
        },
        {
            "level": 0,
            "comment": "Holy heavy cream!! You look amazing!! ",
            "score": 1,
            "author": "NoBettahThyme"
        },
        {
            "level": 0,
            "comment": "Jesus. \n\nGood on you.",
            "score": 1,
            "author": "erzulee"
        },
        {
            "level": 0,
            "comment": "You look amazing dude wow",
            "score": 1,
            "author": "2POTMSON"
        },
        {
            "level": 0,
            "comment": "Looking good, big man! Keep up the excellent work!",
            "score": 1,
            "author": "Squickworth"
        },
        {
            "level": 0,
            "comment": "Holy smokes dude.  Consider me inspired.",
            "score": 1,
            "author": "LetsMakeGlamourShits"
        },
        {
            "level": 0,
            "comment": "Get REAL this is incredible!!! You must feel absolutely amazing. Congratulations on your success, this truly is inspiring. I feel joy from my head to my toes when I see success stories like this. Did you keep close track of your macros and exercise? ",
            "score": 1,
            "author": "GlamourTits"
        },
        {
            "level": 0,
            "comment": "You are my hero man! I’m at 295 and been on this keto journey for 1.5 months and I’ve only lost 5lbs. So I’ll keep trying. Thanks for the inspiration man! ",
            "score": 1,
            "author": "Elisia0214",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just stay on course and you'll get there. It's not a race, as long as you get there, that's all that matters. ",
                    "score": 5,
                    "author": "riot4u",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amen! Yeah I’m seeing all these folks really watching their macros and i try but what i do keep track of is what i eat and put into my body. I used to be really bad about portions and now I’m doing lots better. ",
                            "score": 1,
                            "author": "Elisia0214"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's amazing congrats. Is this a diet, where do you get it?",
            "score": 1,
            "author": "TruthDontChange"
        },
        {
            "level": 0,
            "comment": "Awesome work. You look happier. You are an inspiration. ",
            "score": 1,
            "author": "ChicagoTrader71"
        },
        {
            "level": 0,
            "comment": "You’re a hero, man. ",
            "score": 1,
            "author": "LaCita"
        },
        {
            "level": 0,
            "comment": "Hey hey, man. Great work. People always talk about improved physique, which is great. But I hope there's some newfound peace and comfort in your mind. ",
            "score": 1,
            "author": "DoLittlest"
        },
        {
            "level": 0,
            "comment": "Awesome job, man. I know how much effort it takes.  You look great. ",
            "score": 1,
            "author": "Thomisawesome"
        },
        {
            "level": 0,
            "comment": "Love those foams 😁\n\n(oh, and good job on the loss too👍) ",
            "score": 1,
            "author": "Morkai"
        },
        {
            "level": 0,
            "comment": "The change is stunning!!!!! Congratulations ",
            "score": 1,
            "author": "Quicksilver58111111"
        },
        {
            "level": 0,
            "comment": "Shit dude, I rarely post on stuff like this but great job. Keep up the good work",
            "score": 1,
            "author": "bottlerocketz"
        },
        {
            "level": 0,
            "comment": "Congratulations on your achievements!!!!",
            "score": 1,
            "author": "FatFatUrzua"
        },
        {
            "level": 0,
            "comment": "Good shit man!",
            "score": 1,
            "author": "chuiy"
        },
        {
            "level": 0,
            "comment": "This motivates me big time because I am heavier than your starting weight. Thanks for posting. You look great!\n\nEdit: words",
            "score": 1,
            "author": "dontblinkfirefly"
        },
        {
            "level": 0,
            "comment": "Just curious, do you have a lot of loose skin ?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't have a huge amount of loose skin yet, but I can feel it on my back at times. ",
                    "score": 1,
                    "author": "riot4u"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aw man congratulations. You look amazing.",
            "score": 1,
            "author": "hanquartet"
        },
        {
            "level": 0,
            "comment": "Awesome, you're looking great! Hair looks much better now too",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That is seriously impressive! I gotta get back to doing this right for sure ",
            "score": 1,
            "author": "InTheSip"
        },
        {
            "level": 0,
            "comment": "Looking great my man. Thanks so much for posting this. ",
            "score": 1,
            "author": "WrfWrfWrf77"
        },
        {
            "level": 0,
            "comment": "Good for you bro. Suck an amazing change. Honestly a lot of people lose 100 lbs on here but your 100 lbs made you go from looking pretty obese to looking like an average person. Nice bud. \n\n*such. ",
            "score": 1,
            "author": "FupaKiss"
        },
        {
            "level": 0,
            "comment": "Sick fit too!",
            "score": 1,
            "author": "daewonnn"
        },
        {
            "level": 0,
            "comment": "Amazing. You did that! You can do anything!",
            "score": 1,
            "author": "miche_in_Vic"
        },
        {
            "level": 0,
            "comment": "Wow! Awesome!! ",
            "score": 1,
            "author": "bitcoinbjorn"
        },
        {
            "level": 0,
            "comment": "Great job dude!",
            "score": 1,
            "author": "Floyd91"
        },
        {
            "level": 0,
            "comment": "What the fuck! Proud of you!!!!",
            "score": 1,
            "author": "Lopezj5646"
        },
        {
            "level": 0,
            "comment": "Congratulations, what a significant progress. As a marathoner, I'm reallt happy when people take up losing weight as a challenge and post amazing transformation stories. \nGood luck ",
            "score": 1,
            "author": "Head-full-of-dreams-"
        },
        {
            "level": 0,
            "comment": "Amazing amazing work!! yes! keep it going!!",
            "score": 1,
            "author": "mister-fackfwap"
        },
        {
            "level": 0,
            "comment": "What foods can i eat on keto im new to this",
            "score": 1,
            "author": "mandavaler",
            "replies": [
                {
                    "level": 1,
                    "comment": "No carb (&lt;30 a day) - no sugar;  many vegetables are out;  check the FAQ.",
                    "score": 1,
                    "author": "Voir-dire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice job dude I'm working on a combination of lifting, keto and intermittent fasting the holy trio.",
            "score": 1,
            "author": "IronProdigyOfficial"
        },
        {
            "level": 0,
            "comment": "You look fantastic! Well done!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amazing job, and the fact that you are sharing it is inspiring to others, may I suggest, trimming the hair / shaping the beard, it'll make you look younger and slimmer, this will make you feel even better about yourself. ",
            "score": 1,
            "author": "mileseypoo"
        },
        {
            "level": 0,
            "comment": "Great job! ",
            "score": 1,
            "author": "kkardi"
        },
        {
            "level": 0,
            "comment": "I'm just here to say I see you flexing those foamposites 👀👀 and also congrats, man!",
            "score": 1,
            "author": "jimi_hendrixs_godson"
        },
        {
            "level": 0,
            "comment": "I’m very happy for you! But I am slightly worried as well. 102 lbs in 6 months seems very drastic. That’s 17 lbs a month. \n\nCould someone explain to me if this is safe? I’ve always read that it is extremely unhealthy. No hate, I am genuinely just curious and I would like to understand a bit better what is going on.",
            "score": 1,
            "author": "lauf13"
        },
        {
            "level": 0,
            "comment": "God damn, dude! 100lbs in 6 months?! Killin this game! Great job!",
            "score": 1,
            "author": "joedrums8a"
        },
        {
            "level": 0,
            "comment": "This is an amazing transformation!! Wow you have accomplished something so terrific, and something so many people wish they could do. And you did it!! KCKO!!!!!",
            "score": 1,
            "author": "LeeLeeBoots"
        },
        {
            "level": 0,
            "comment": "So awesome dude! I hope you realize how amazing you are, and how inspirational you are! I'm on my own journey and I am down 75lbs in the last 5 months!\n\nKeep up the amazing work!",
            "score": 1,
            "author": "Nick_Gymbalvo"
        }
    ]
}