{
    "id": "8w4xnb",
    "score": 3382,
    "title": "Got a skydiving ticket for Christmas and was over their weight limit, so I couldn't jump. 7 months and almost 70lbs later, I've scheduled that jump for this coming Sunday!",
    "author": "[deleted]",
    "date": 1530737699.0,
    "url": "https://www.reddit.com/r/keto/comments/8w4xnb",
    "media_urls": [],
    "other_urls": [],
    "postText": "The limit in their jumps was 220, I started keto shortly after the first of the year not as a \"New Years Resolution\" but more out of general frustration, unrelated to the jump.\n\nI started at a little over 260, at my heaviest I was 286 but some recent work had brought me down a bit.  As of writing this I weight 196 which is the lowest I've been in almost 4 years.  \n\nI had forgotten about the ticket and limit until recently on my birthday, when I remembered I had it and went to check.  I saw their weight limit and thought \"Thank god I followed through with this\", I feel so relieved that I can participate in those sort of activities now.  It's even motivating some of my other family to do it too!\n\nI did strict keto, no alcohol, no cheats for 5 months.  I've relapsed a bit into \"lazy\" keto since then and I've started to allow myself a cheat meal once or twice a month, but I'm still losing weight and hitting the gym 3-4 times a week so I've got no problems with that!\n\nStick to it!! It's worth it!  The amount of opportunities that open up for you can be endless, It's liberating!",
    "comments": [
        {
            "level": 0,
            "comment": "You’re freakin crazy to jump out of a perfectly good airplane. \n\nThat being said, congratulations!!! ",
            "score": 152,
            "author": "whatthehellisketo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've wanted to for years, I just finally made it happen for myself!",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No such thing as a perfectly good airplane! Congrats! Can’t wait to hear about your experience.",
                            "score": 12,
                            "author": "anaganji"
                        },
                        {
                            "level": 2,
                            "comment": "Here's a little known fact: You don't have to do a tandem jump ever. You can pay about twice as much and take a 5 hour class to get to jump with your own chute and 2 coaches. It's called AFF. If you love it, 6 more coached jumps and your get to start jumping entirely alone (assuming you pass your assessments). Then in as little as 25 jumps you get a USPA license and you can jump anywhere in the world. It really changes tourism when you think, \"I'm going to see this place from 15 thousand feet.\"\n\nThat's what I did. I had a tandem scheduled with a group and switched it to AFF.",
                            "score": 7,
                            "author": "RichardBronosky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except it is not that great of an idea. Sensory overload is a real thing. You are very likely going  to repeat that jump.\n  \nAlso it is a lot more expensive. FJC is around 100 bucks and AFF-A is around 300.\n  \nEnjoy your tandem. If you like it and want to get licensed, then do AFF",
                                    "score": 3,
                                    "author": "Meanee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn't have to repeat any of the first 7 AFF jumps. I'm glad I never did tandem. I probably wouldn't have continued. When I'm responsible for myself, I don't register fear, I just get the job done. When I am relying on someone else (like a passenger in a car) I react to stress much worse.",
                                            "score": 1,
                                            "author": "RichardBronosky",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's different for a lot of people. But most dropzones require a tandem before you take AFF. And not to milk the customer. \n  \nI am a private pilot, and when I fly, my well-being depends on altitude and airspeed. Yet on my tandem, I lost altitude awareness. I was looking at altimeter, but numbers were not registering. Mostly because so much other shit was going on around me.\n  \nI didn't fail any AFF levels, mostly because I am also very methodical to my training, and I took a bit of a tunnel before AFF-A. So I was somewhat aware of what I am expected to do in freefall.\n  \nI also know people who took a lot of tandems. Buddy of mine, did 9. Until his TI was like \"Maybe you should get a license?\" and he did. Good belly flyer too.",
                                                    "score": 1,
                                                    "author": "Meanee"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How much free fall are you going to get?  I did it once and got 60 seconds.  It was the longest 60 seconds ever!  It was such an adrenaline rush I felt hung over for a couple days.  Had zero energy, zero motivation, zero cares.  It was awesome!",
                            "score": 10,
                            "author": "funkbum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most tandem skydives give you 60 seconds. Give or take 5.",
                                    "score": 2,
                                    "author": "Meanee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gotcha.  Wasn't sure about tandem.  My jump was in the AFF program so the jump masters just held on to me while I did the 'circle of awareness' drills on the way down!",
                                            "score": 1,
                                            "author": "funkbum",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's about the same. You all jump from same altitude, tandem or AFF. Tandems fall a lot faster, but they have a small parachute (called drogue) that slows them down to normal fall speed. And because you have two instructors hold you, your fall rate is also a bit slower than a solo jumper.",
                                                    "score": 1,
                                                    "author": "Meanee"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’ll be exhilarating.  I loved it",
                            "score": 4,
                            "author": "Sioswing"
                        },
                        {
                            "level": 2,
                            "comment": "I've only been in an airplane once in my life. Let's just say I didn't land in the airplane. It was sooooo awesome!!! You'll have like a 4 day high off pure adrenaline! Congratulations!",
                            "score": 4,
                            "author": "Rlhealbot"
                        },
                        {
                            "level": 2,
                            "comment": "This was the reason I bought a scale for the first time in my life too! You will have so much fun. Congratulation to your achievement And to your first sky dive.",
                            "score": 1,
                            "author": "Lumpensamler"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of my motivations to lose weight was to try skydiving. And I lost weight, got under limit, and jumped. That was two years ago. Fast forward to today, I spend every weekend at dropzone, and last weekend started to fly a wingsuit.",
                    "score": 4,
                    "author": "Meanee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'll be ripping through narrow, Rocky canyons, hugging the face of a mountain 10 feet from the surface in no time!\n\nGodspeed, sir.",
                            "score": 1,
                            "author": "PandaK00sh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh hell no. I am fine jumping out of a plane, thank you very much.",
                                    "score": 2,
                                    "author": "Meanee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's actually easier to jump out of the plane than off of the 8' or so platform you need to jump off of to practice landings for a static line jump. No mental connection to the ground on a plane.",
                    "score": 7,
                    "author": "SeattleMotoDude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I fly airplanes for a living. The idea of jumping out of one just boggles my scared of heights mind. :)",
                            "score": 5,
                            "author": "whatthehellisketo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thus the disconnect between the height of the airplane and the height of anything attached to the ground. :-)",
                                    "score": -1,
                                    "author": "SeattleMotoDude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Airplane is fine. Airplane in the air is fine. Departing airplane before airplane is on the ground so not fine. ;)",
                                            "score": 5,
                                            "author": "whatthehellisketo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Says you.\n  \n*hops out with my rig*",
                                                    "score": 1,
                                                    "author": "Meanee"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm with you, I worked hard to get over my fear of heights...on a ladder. Will not be jumping out a plane any time soon!",
                                                    "score": 1,
                                                    "author": "runbrooklynb",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My husband totally wants to do it. Like OP he now weighs light enough he can. The idea of him doing it scares me. Crazy stuff. \n\nI’m sure it’s a thrill but damn. ",
                                                            "score": 1,
                                                            "author": "whatthehellisketo"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’ve never seen a jump plane ;)\n\nThere’s a reason I have to wear a rig too when I’m flying my jumpers",
                    "score": 3,
                    "author": "trashbinpilot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also you never seen our jump pilot land. Screw that, I will be more comfortable freefalling.",
                            "score": 1,
                            "author": "Meanee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations !!\n\nBTW your original post of this topic was immediately next to another un-related post titled \"Someone please push me over the edge\".\n\nI thought that was an hilarious back-to-back coincidence !!",
            "score": 69,
            "author": "Angelica2121"
        },
        {
            "level": 0,
            "comment": "I did a photo shoot for a zip line place last week, and their weight limit is 275. I started at 375 and had just hit 325 the day before I did the shoot. \n\nWhile there I decided that a soon as I hit 100 lbs down I'm going back as a reward! \n\n(I'll just ignore the fact that I'm afraid if heights.)",
            "score": 15,
            "author": "filmgeekvt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm afraid of heights too, but I think it's more a fear of falling to my death. If I'm strapped in or something, and not just standing there looking down, I'm okay.",
                    "score": 3,
                    "author": "thesecondkira",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm *kinda* the same way. I think it's the perceived danger. I have a hard time with looking down in tall buildings through glass windows, but I don't have issues when strapped into a rollercoaster. ",
                            "score": 3,
                            "author": "filmgeekvt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, exactly. It's the vertigo, the spinning feeling. It's miserable, so even if there IS glass there, why would I subject myself to feeling dizzy and ice cold? \n\nIt's like... being strapped in + movement negates the height. The movement is distracting and the straps minimize the risk that I might die. Either one of those on their own wouldn't be comforting, haha.",
                                    "score": 2,
                                    "author": "thesecondkira"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How exciting, please post on this Reddit after your jump to let us know how it was.",
            "score": 13,
            "author": "PippaPrue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, or we’ll assume the worst. :(",
                    "score": 5,
                    "author": "Permtacular"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always wondered about the unlucky person who determined the weight limit. ",
            "score": 10,
            "author": "snortinsawdust"
        },
        {
            "level": 0,
            "comment": "I lost a bet and had to go skydiving once. The guy failed to mention that after the chute is out, they have to loosen your harness a few inches so that you can ‘sit’ in your harness without the pressure in your groin. So basically it felt like he dropped me out of the harness. I almost shit myself.",
            "score": 9,
            "author": "dj_djtanner",
            "replies": [
                {
                    "level": 1,
                    "comment": "The rule book actually prohibits instructors from telling that to students. They may freak out and start grabbing things they are not supposed to grab.",
                    "score": 3,
                    "author": "Meanee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh good call! \nI didn’t think about that. Yeah, I could totally see that happening.",
                            "score": 1,
                            "author": "dj_djtanner"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awesome, congrats! I have wanted to skydive for a long time too. unfortunately, I currently exceed the weight limit by quite a bit. maybe with keto, I too can jump out of a plane!! 😊 ",
            "score": 6,
            "author": "mcdubbx"
        },
        {
            "level": 0,
            "comment": "Congratulations.  I lost over 140 on Keto and went Skydiving.  You'll love it.  It's the greatest rush.\n",
            "score": 5,
            "author": "maddrb"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not OP, but we tried to go a few years ago and my fiancé was over the weight limit. We asked about it, and the company said the weight limit is in place because as new divers we would have to do tandem jumps while attached to the instructors. So while the equipment *might* have been able to handle the added weight, the instructors couldn’t. Also there are federal regulations about safety standards/maximum jumping weights. ",
                    "score": 3,
                    "author": "ketokate-o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is no actual federal regulation. Most popular tandem equipment manufacturer (UPT) limits the total weight to 500lbs. This is you, instructor, and all gear. So a really scrawny instructor can take you up. I went when I was 245. The sent me up with skinniest guy on staff.",
                            "score": 2,
                            "author": "Meanee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! This is the same goal I have for myself, when I reach weight. I’ve lost 70+ since March 1st, with 60-70 more to go. Happy for you!",
            "score": 2,
            "author": "jonrahoi"
        },
        {
            "level": 0,
            "comment": "Congrats to you! I've been watching my husband battle with his weight for years. We just started keto today and your story is such an inspiration. Keep it up! ",
            "score": 2,
            "author": "Mmmn_fries"
        },
        {
            "level": 0,
            "comment": "Awesome. Getting back to a safe wing load under canopy was one of the reasons I started keto myself. You're going to love skydiving!",
            "score": 2,
            "author": "FreefallGeek"
        },
        {
            "level": 0,
            "comment": "Good for you!!!  I have a friend in a similar situation.  He weighs 245, and the limit here is 225.  He is trying Keto so that he can jump with me this spring (I jump regularly, considering getting my license) My husband won't even try it, but my daughters jump with me:)\nKeto is awesome, so is skydiving!!!!",
            "score": 2,
            "author": "PurpleMartinLady"
        },
        {
            "level": 0,
            "comment": "Good job! If you're on the east coast, let me know what drop zone you'll be at - I'll be jumping all weekend. :)",
            "score": 2,
            "author": "skydivinghuman"
        },
        {
            "level": 0,
            "comment": "As someone who just did this for the first time literally yesterday, and is straight up terrified of heights (which is like 90% of the reason I wanted to do it), you're gonna have a BLAST! Its one hell of an experience, and the fact that you put in work to get your body toward where you want it to be AND got enough progress that you CAN jump is going to make it so much better. Props, have a stellar time!",
            "score": 2,
            "author": "MightyBroseidon"
        },
        {
            "level": 0,
            "comment": "OMG this is super motivational for me.  Look at you getting the bucket list done!  Have an awesome time with the skydive!",
            "score": 2,
            "author": "PunkyQB85"
        },
        {
            "level": 0,
            "comment": "Keep it up!",
            "score": 2,
            "author": "m0untainman22"
        },
        {
            "level": 0,
            "comment": "OMG this is exactly my goal. I am happy for you I can't wait to go.",
            "score": 1,
            "author": "Just_Eat_Bacon"
        },
        {
            "level": 0,
            "comment": "Congratulations!!! You deserve that ticket!!!",
            "score": 1,
            "author": "ConfidentlyLost16"
        },
        {
            "level": 0,
            "comment": "Congrats! Way to take a leap and commit to keto. ",
            "score": 1,
            "author": "alecpoops"
        },
        {
            "level": 0,
            "comment": "This was a point of contention for me too when I read they had weight limits",
            "score": 1,
            "author": "captainmavro"
        },
        {
            "level": 0,
            "comment": "This is something that everyone should do at least once. There's nothing like it. Have fun!",
            "score": 1,
            "author": "m0lokovellocet"
        },
        {
            "level": 0,
            "comment": "Congratulations!  Break a leg!  Figuratively, of course. ",
            "score": 1,
            "author": "NorthStar_7"
        },
        {
            "level": 0,
            "comment": "You're going to love that jump. That experience is one of the best of my life. Have fun!",
            "score": 1,
            "author": "thesecondkira"
        },
        {
            "level": 0,
            "comment": "What drop zone did you go to?",
            "score": 1,
            "author": "ljthefa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Snohomish!",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So Much Fun. Enjoy and report back.",
            "score": 1,
            "author": "SeattleMotoDude"
        },
        {
            "level": 0,
            "comment": "When I hit 225 this will also be my celebration. I have been trying for years to lose weight and Keto is finally working. I can’t wait. 30 lbs to go. ",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congrats!!! I am in the same boat!! The woman weight limit is 170 and I am on keto currently so I can go skydiving!!",
            "score": 1,
            "author": "matrawr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check with a dropzone. This seems way too low.",
                    "score": 1,
                    "author": "Meanee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Huh? Could you explain more please? I’m new to this whole skydiving thing. I don’t get why at the place I got my skydiving ticket, men’s weight limit is 225 and then women it’s 170 either. ",
                            "score": 1,
                            "author": "matrawr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is a combination of few things. \n  \nUltimately, it's about the weight, which is not a factor in this case. There's a strict limit of 500lb for total tandem weight. Means you, your instructor, and all your gear.\n  \nAnother thing is about your body proportions. If you are very short, then your weight should not exceed certain limit. It's not for body shaming or anything else, it's all about how you fit in a harness. If they can't secure harness around you properly, they won't take you up.\n  \nHowever, setting a hard limit of 170 for females does not make a whole lot of sense to me. Sure, body is built a bit differently from guys, but not to warrant 55lb difference. \n  \nSome dropzones will publish a chart. Like, \"if you are X tall, you must weight between Y and Z lbs\" which is reasonable. \n  \nWhat dropzone did you go to?",
                                    "score": 2,
                                    "author": "Meanee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow thank you so much for the info! I was thinking it had to do something about physical ability. Like even though guys may be heavier they can hold their own body weight where I have like no strength at all and would be considered dead weight. That was my hypothesis. Unfortunately no chart, they said they’d put you on a private scale if you look like you’re close to the weight limit but in my mind 170 on a female can look so different depending on height and proportions. It’s in Georgia, I haven’t gone yet as I’m hoping to be in the 150s when I go, if you want the exact place I can DM it, I just don’t want to give too much info of location. Thank you for taking the time to write a very detailed response back as I am very clueless on the subject! I just know I want to jump out of a plane! ",
                                            "score": 1,
                                            "author": "matrawr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sure thing, DM away. I am aware of few dropzones in GA. \n  \nI gained some weight after going apeshit on a cruise ship buffet, yet I am able to fly wingsuit at 240lbs weight. So I think the dropzone is just being difficult.",
                                                    "score": 1,
                                                    "author": "Meanee"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so excited for you, for your weight loss and for the jump!",
            "score": 1,
            "author": "canuckpopsicle"
        },
        {
            "level": 0,
            "comment": "Congratulations! You're going to love skydiving! I had to do it twice, I was terrified the first time &amp; felt like I had missed out on some of the experience. The 2nd time, I actually kept my eyes open jumping from the plane. Haha!",
            "score": 1,
            "author": "Desertwillow597"
        },
        {
            "level": 0,
            "comment": "Enjoy!! You will love it, I did it years ago and it was amazing. Congrats to you =D",
            "score": 1,
            "author": "Bobonyx"
        },
        {
            "level": 0,
            "comment": "That's wonderful. I love hearing stories like these. Enjoy the jump.  You earned it. ",
            "score": 1,
            "author": "atheist_by_design"
        },
        {
            "level": 0,
            "comment": "It would be too tragic NOT to die on this trip...   That being said, I hope it goes fine! ",
            "score": 1,
            "author": "kevtino"
        },
        {
            "level": 0,
            "comment": "[Break a leg!](https://en.wikipedia.org/wiki/Break_a_leg)",
            "score": 1,
            "author": "_Administrator",
            "replies": [
                {
                    "level": 1,
                    "comment": "**Break a leg**\n\n\"Break a leg\" is an idiom in theatre used to wish a performer \"good luck\" in an ironic way. Well-wishers typically say \"Break a leg\" to actors and musicians before they go on stage to perform. The origin of the phrase remains obscure.\n\nThe expression reflects a theatrical superstition in which wishing a person \"good luck\" is considered bad luck.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/keto/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28",
                    "score": 1,
                    "author": "WikiTextBot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoy your jump! Link me to the video maybe?",
            "score": 1,
            "author": "valiant1337"
        },
        {
            "level": 0,
            "comment": "Congratulations! I am so proud of you. ",
            "score": 1,
            "author": "InvitedAdvert"
        },
        {
            "level": 0,
            "comment": "Awesome! The reward I have planned for myself when I hit my goal weight is to get certified in Skydiving.",
            "score": 1,
            "author": "An_Apathetic_Sloth"
        },
        {
            "level": 0,
            "comment": "Nice!  That's on my bucket list!  Gotta get 10-15 lbs below 250 though",
            "score": 1,
            "author": "THUMB5UP"
        },
        {
            "level": 0,
            "comment": "I was daydreaming about this exact thing yesterday. There's no way I could skydive at my weight now, but when I hit my goal I know I can finally get into skydiving.",
            "score": 1,
            "author": "ums00668996"
        },
        {
            "level": 0,
            "comment": "Skydiving is one of my main goals with weight loss! Congrats! ",
            "score": 1,
            "author": "souponastick"
        },
        {
            "level": 0,
            "comment": "Best NSV ever!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Besttt NSV ever!!! 🙌🙌🙌! ",
            "score": 1,
            "author": "suglu"
        },
        {
            "level": 0,
            "comment": "Nice job!  I haven't gone, but it was kind of an awakening for me when I found out a couldn't go last year with a  group from work.  It's on my list of things to do when I declare myself done losing.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Awesome job! What are you stat's? Like age, height and such",
            "score": 1,
            "author": "Nobuko42",
            "replies": [
                {
                    "level": 1,
                    "comment": "26 5'11\", started at 268",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! You are almost the same height as me. Do you know around how many calories you were taking in each day by chance? Just curious for comparison, as I have an idea of what amount I eat to hit maintenance XD",
                            "score": 1,
                            "author": "Nobuko42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't count my calories much anymore, I do keep a general idea of them in mind but I have a lot of 0 calorie drinks/foods l.  I just eat until I'm full and stick with that",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's on my bucket list, I'm so jelly! I can't wait to be a proper weight to try it out! Kudos for passing the 200lbs and reaching 196!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good luck! don’t die! ",
            "score": 1,
            "author": "melchete"
        },
        {
            "level": 0,
            "comment": "Nice work!",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are you doing on this sub? \nYou do realise people come on here to share stories, testimonials and motivation with others. \nThis sub isn't about trashing people's effort. \nMove on smiler",
                    "score": 2,
                    "author": "Overwatch_preachy"
                }
            ]
        }
    ]
}