{
    "id": "abw792",
    "score": 3897,
    "title": "Chipotle announces “Lifestyle Bowls”; including Keto Salad Bowl",
    "author": "realwords",
    "date": 1546454468.0,
    "url": "https://www.reddit.com/r/keto/comments/abw792",
    "media_urls": [
        "https://www.reddit.com/r/keto/comments/abw792/chipotle_announces_lifestyle_bowls_including_keto/"
    ],
    "other_urls": [
        "https://www.chipotle.com/lifestylebowls"
    ],
    "postText": "https://www.chipotle.com/lifestylebowls#\n\nAs announced above. Keto Bowl includes braised and hand-shredded Carnitas, Red Salsa, pasture-raised shredded Cheese, and Hand-Mashed Guac on a bed of fresh chopped Romaine Lettuce.\n\nYeah, this was an existing option to do custom; but this is great internal precedent to not have to fuss with employees there, just one phrase and you’ve got an order. \n\nAlso pressures other fast casual chains to do the same. ",
    "comments": [
        {
            "level": 0,
            "comment": "Personally, I'd rather continue ordering a burrito bowl (or salad) with no rice/beans than take the chance ordering a \"keto bowl\" and having to have **that** conversation with someone.\n\nThis is smart marketing though, I'll give them that.",
            "score": 851,
            "author": "Anonim00s3",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 533,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$11 to do this basically and the amount you get is so so little since you cut out the rice and beans. I have a hard time justifying it. ",
                            "score": 277,
                            "author": "Brotaoski",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 464,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I always do double meat split and most of them just do the big first scoop for both out of habit",
                                            "score": 79,
                                            "author": "Shhadowcaster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even when I'm getting a single serving I ALWAYS order half-and-half. The serving spoons make it really difficult to get an exact half portion even if that's what you're trying to do, and they don't want to get accused of ripping the customer off. So they'll pretty much always err on the side of too much. It is consistently more food for your buck every single time. ",
                                                    "score": 41,
                                                    "author": "rawlingstones",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok, extrapolating this tip out, seems the best way is to ask for half and half to start. Then after they give the first two \"half scoops\" ask for double meat, still half and half. Now we've combined the \"they played their hand\" and the half and half tips. Good teamwork all around. ",
                                                            "score": 21,
                                                            "author": "QuestrofK",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And a likely very confused and \"mocked-feeling\" employee",
                                                                    "score": 22,
                                                                    "author": "TheSnydaMan",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah- to add to this: they're not stupid and they know when you're trying to take advantage of things like this. Most of  the time its just easier to comply and avoid any hassle cause it figures that if a customer is going out of their way with tips and tricks to get extra food then they might be the same type of customer to complain if they weren't satisfied ",
                                                                            "score": 11,
                                                                            "author": "HisBeebo"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, half and half every time",
                                                    "score": 20,
                                                    "author": "The_Lion_Jumped"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I tried that and it never worked for me. I have never seen a big scoop of meat at Chipotle, first or second scoop. I stopped going to Chipotle two years ago because the scoops kept getting smaller and smaller.",
                                            "score": 28,
                                            "author": "oldjack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Happened to my local Chipotle when it became a training store. Now I drive an extra 10 minutes away to hit up a real non spec Chipotle. ",
                                                    "score": 13,
                                                    "author": "KorayA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 9,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a chipotle employee corporate is starting to get on my managers ass because of portioning, for 3 tacos if they wanted chicken then I would have to scoop some chicken and divide between the 3 just off that scoop no going back in. Most of the time I try to do a second full scoop for double meat but been told to bring it to more of a half scoop for the double portion. ",
                                            "score": 3,
                                            "author": "ShadowConspiracy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As someone who works on grill at chipotle, i hate this.",
                                            "score": 3,
                                            "author": "SatansCuckhold",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks from a disgruntled current employee ",
                                                            "score": 2,
                                                            "author": "SatansCuckhold"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I usually can’t even finish it. I work in Seattle where 11 dollars for lunch is on the cheap side, to be fair. ",
                                    "score": 31,
                                    "author": "koryface",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. Lunch is stupidly expensive here.",
                                            "score": 8,
                                            "author": "OneDimensionPrinter",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, even teriyaki is that much in a lot of neighborhoods now. Crazy...",
                                            "score": 2,
                                            "author": "Shmokesshweed"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I eat one of these (but with triple chicken) and I'm good for 24 hours. It's legit over a pound of food even with double meat, depending on if you get all the good stuff or not.\n\nMine is typically romaine, meat, salsa(s), sour cream, cheese, and guac. No dressing, of course, and it isn't needed with these toppings. In fact, I just had one a few hours ago. I'll be full until bedtime. It was $14, which is kinda steep. I figure, that is only a daily charge since I only eat once a day. It's decent when I haven't had time to meal prep.",
                                    "score": 40,
                                    "author": "CityOfChamps09",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same, one of these and maybe a small snack later and IM good for the day.  Same with our poke place, the salads are like $13 but they keep you full for the day.",
                                            "score": 2,
                                            "author": "ingridelena"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "True, lol. A 10-oz steak could be had for less.",
                                    "score": 14,
                                    "author": "antnego",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At Sizzler maybe.  Where can you get an $11 10oz steak’ when eating out?",
                                            "score": 20,
                                            "author": "RRL101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At the strip club..",
                                                    "score": 12,
                                                    "author": "fillups66",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The New York strip club?",
                                                            "score": 12,
                                                            "author": "danarexasaurus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lolololol ",
                                                                    "score": 3,
                                                                    "author": "She_Devil"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's truly almost $15, but every time I go it ends up being a ton of food. I'm still a pretty big dude (335) and I'm pretty full after one of these bowls these days. ",
                                    "score": 3,
                                    "author": "GentleThug"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "20 bucks later.  Couldn’t believe the price for doing this. ",
                            "score": 32,
                            "author": "ChickenAndBeer4life",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Doubling up on everything is a surprising amount of food.\n\n&amp;#x200B;",
                                    "score": 9,
                                    "author": "veritasgt",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's also like 1500 calories, so $20 isn't too bad if it's your one meal for the day.",
                                    "score": 14,
                                    "author": "adm7373"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We don’t have chipotle where I live but I do the same thing with qdoba! I agree!",
                            "score": 5,
                            "author": "mitty18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have both but I always prefer Qdoba. I like the chicken better and they don't charge extra for guac. Hell, half the time they don't even charge me for double meat.",
                                    "score": 3,
                                    "author": "wuu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "See I don’t care for their chicken. It tastes very fake to me. But that’s just me! I usually go with steak and pulled pork. ",
                                            "score": 2,
                                            "author": "mitty18"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Chipotle definitely fills a void, but Mexican burrito bowls are so easy to make at home. One of my goals this year is to food prep more and chipotle style bowls are a go to. You could make a month's worth for the same price as one week eating out. ",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve gone back and forth. I have two kiddos (3 and 4) and a startup, so my meal prep game is weak. But when I have time, I ace copycat chipotle burrito bowls!",
                                    "score": 6,
                                    "author": "NihlusKryik",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "slow down money bags",
                            "score": 9,
                            "author": "lostharbor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know what all you guys are complaining about. $50/wk for 3 chipotles a week is not bad at all. If you would rather save money and make your own food, by all means go ahead. But there are plenty of regular people for whom this is a perfectly reasonable option.",
                                    "score": 6,
                                    "author": "Malarazz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "$16/meal; $50/week; $2,600/year is a ton of money. Average US *household* income is $62k. That's 4% of the average income not taking into account normal food intake/daily needs/housing/medical costs. I'm happy you can afford that, but for most, it is not an affordable option. ",
                                            "score": 15,
                                            "author": "lostharbor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol yeah, $50/week is my entire grocery budget for myself and my girlfriend.",
                                                    "score": 6,
                                                    "author": "EthanWeber"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s reddit. Everyone here complains about money across all subs. $11 is nothing for lunch. ",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And based on your flair, it’s working! Congrats on the progress. ",
                            "score": 3,
                            "author": "Anonim00s3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! Although I should adjust the flair up about 10lbs from holiday badness, but eff it! ",
                                    "score": 3,
                                    "author": "NihlusKryik",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The holidays get almost all of us, man. Shit happens",
                                            "score": 5,
                                            "author": "Anonim00s3"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I went there twice in a row this week ",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I literally just picked it up... https://i.imgur.com/iSFuCIW.jpg",
                                    "score": 6,
                                    "author": "NihlusKryik"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just realized...when I start keto I can’t order a quesadilla, or eat their chips...god that makes me want to put it off even more",
                            "score": 2,
                            "author": "AFrostNova",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right -- I just get a burrito bowl with no rice or beans, and pretty much everyone on keto has figured out how to do this. ",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly",
                            "score": 3,
                            "author": "Anonim00s3"
                        },
                        {
                            "level": 2,
                            "comment": "I do a salad, am I messing up by not doing a burrito bowl w/out rice? Do they give you more meat with a bowl?",
                            "score": 3,
                            "author": "runbyfruitin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They don't automatically give you more meat -- I order double meat and pay for it. I don't get the salad because I want the salad dressing something fierce if I do, and it's full of sugar. ",
                                    "score": 6,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "No but I do notice them giving you more meat if the bowl is empty when they go to scoop. It’s definitely a mental thing.\n\n\nNormally I ask for no beans/rice then order my meat. After I add on the fajitas veggies then whatever else I’m looking to eat.",
                                    "score": 3,
                                    "author": "Unsounded"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except right now you won't be able to order the keto bowl when you walk in. You can only order it online for pickup at this point.",
                    "score": 33,
                    "author": "RealNotFake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's keto AND allows me to minimize human contact!",
                            "score": 144,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok, this is actually good. Also, less buttons since you're not removing anything.\n\nOk, I'm on board now.",
                                    "score": 19,
                                    "author": "Anonim00s3"
                                },
                                {
                                    "level": 3,
                                    "comment": "Sign me the fuck up.",
                                    "score": 6,
                                    "author": "UnnamedPyro"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People who really do keto are already hyper aware of what goes into there bodies, what certain foods do to them, what ingredients are in things. I don't think this new menu is for people already on keto. I don't think Chipotle is necessarily trying to be benevolent here, but it's a good and easy move to show people that you can put together a meal with all the things that have been here since the beginning and it can be healthy. That's just a new market. \n\nI will give a hard blank stare though if I put my order in and they say \"you mean a lifestyle bowl?\". I'm a grown ass man. I'm not ordering a lifestyle bowl.",
                    "score": 8,
                    "author": "U2_is_gay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Lifestyle bowl” sounds like you’re also about to hear about an amazing new business opportunity. ",
                            "score": 9,
                            "author": "Anonim00s3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Only place I ever have to go into that convo is five guys, but never had it go any way other than fine. Even had some people try to learn what it entailed so they could do it too.\n\nAt five guys they always ask if it's an allergy thing though.\n\nI need to update my flair when I get to a computer, it's way out of date. ",
                    "score": 3,
                    "author": "crypticedge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Almost as bad as pizza huts new Jack fruit pizza",
                    "score": 7,
                    "author": "ComradeCreed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.bustle.com/p/pizza-hut-uk-launched-a-vegan-friendly-jackfruit-pizza-for-veganuary-15582200\n\nOh wow... I was expecting something worse, tbh.",
                            "score": 3,
                            "author": "OrangeCarton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually love jackfruit, made me a little gassy the first time I made it at home but it’s really amazing has the meat texture and can be seasoned however you want. ",
                                    "score": 2,
                                    "author": "ComradeCreed"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "ergh yuck :P ",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s an item in their menu, so you’d just have to refer them to their menu. Shouldn’t be too in depth of a conversation. ",
                    "score": 2,
                    "author": "bier4brkfst"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Chipotle is order what you want as you go along, they're not pre-fab really. So I don't agree that saying \"No beans or rice\" makes you anywhere close to \"that guy\" ",
                            "score": 33,
                            "author": "Raptorrocket",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Can I get a bowl to go? No rice or beans, just the peppers.\"\n\nor\n\n\"Hi can I get a LIFESTYLE BOWL for my special LIFESTYLE?\" \n\nI'll call it a lifestyle bowl over my gradually lighter dead body.  ",
            "score": 269,
            "author": "bottomofashoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I doubt any of the employees care. It's like when you go to a starbucks and order a small. I've never had anyone correct me or refuse to finish my order until I say \"Grande.\" It's just low hanging fruit for the resident office comedian.",
                    "score": 11,
                    "author": "hoser97"
                },
                {
                    "level": 1,
                    "comment": "I literally cringed reading \"LIFESTYLE\". I cannot help but picture a Karen with a \"I-want-to-speak-to-your-manager\" hairstyle.",
                    "score": 56,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Karens don't believe in keto, just diet Cokes and fat free everything",
                            "score": 65,
                            "author": "wwcasedo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fucking Karen. Talking too loudly about politics in the breakroom.",
                                    "score": 12,
                                    "author": "fratstache",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“It was just locker room talk, you see, all men do it.”",
                                            "score": 5,
                                            "author": "miltonthecat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Right, they were already \"Keto Friendly\" before as long as you picked the right stuff.  But to me, being keto friendly would mean they would give you the guac free in exchange for removing the rice and beans.  Maybe the numbers don't work out exactly, but at least a discount would be nice.\n\nAlso, I don't really understand why they automatically include red salsa for 3 net carbs.  You can get fresh tomato salsa for the same.  But to be honest, since the queso is only for half a carb more (!!), I'd take that sacrifice.  Yes, additional calories, but the extra fat would probably keep me satisfied longer.",
            "score": 235,
            "author": "coolgui",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bro let me introduce you to Qdoba.  Free quac. Free bacon. And they never complain when I ask for extra cheese. ",
                    "score": 161,
                    "author": "Diegobyte",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds good, but they aren't around here (Houston, TX).  Nor are the Moe's place mentioned in other comments.  There are tons of Tex Mex and authentic Mexican places on nearly every corner, so it's a bit tough for an out of state chain to make a lot of traction.  I'll give it a try next time I'm out of town though, it sounds like a better deal.",
                            "score": 19,
                            "author": "coolgui",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also I order half chicken half steak and they usually give you between 1.5 meat and double meat for the price of single meat. I imagine this would work at chipotle too. ",
                                    "score": 13,
                                    "author": "Diegobyte",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It does.  ",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I would take an authentic Mexican place over any Chipotle 100% of the time honestly ",
                                    "score": 13,
                                    "author": "OG_Nightfox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes however good luck ordering anything Keto at a Mexican restaurant- they won’t make his type of bowl the same",
                                            "score": 8,
                                            "author": "Jenlp88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're 100% right. I typically cycle on and off of Keto and I'm about to start my next cycle. I'm gonna miss my Mexican rice and beans. ",
                                                    "score": 4,
                                                    "author": "OG_Nightfox",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "While there are no Qdoba here in Houston, we do have several Bullritos which aren't too bad (I've had good results getting keto-friendly bowls from them in the past).  Also if you're down near the MedCtr/Museum District you should check out bowls from Bodegas Taco Shop on Binz Ave.\n\n&amp;#x200B;",
                                    "score": 2,
                                    "author": "sirkerry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I used to go to Bullritos all the time, but they closed the two that were in my normal route.  I used to get tacos because those mission style burritos were never very easy to handle.  Theirs were a lot better than Chipotle, IMHO.\n\nThanks for the tip, I'll try Bodegas some time.  I've seen it, just because stopped in.",
                                            "score": 2,
                                            "author": "coolgui"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If by free you mean all burritos are $2 more...  When they switched to the \"free\" everything they just increased the prices of everything across the board.",
                            "score": 4,
                            "author": "mfrato"
                        },
                        {
                            "level": 2,
                            "comment": "Our Qdoba closed down and guess what opened in the same location a year later. Yep a chipotle, I miss Qdoba. ",
                            "score": 8,
                            "author": "huntwithdad"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, avocados are much more expensive than rice and beans",
                    "score": 25,
                    "author": "sandefurian",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah I'd go double protein, tomato salsa inatwsd of red, and sour cream instead of guac. This just isn't enough calories for me even when I'm cutting down weight. ",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just wish they had spinach for the salad, instead of only romaine.  Props to chipotle for adapting though. ",
            "score": 82,
            "author": "HeadAssBoi17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do they offer spinach in their restaurants? ",
                    "score": 13,
                    "author": "fluteitup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No",
                            "score": 18,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Nope",
                            "score": 5,
                            "author": "HeadAssBoi17"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree, or even just spring/greens mix. I don't mind lettuce but not a fan of the hard/crunchy white centers/stems that the romaine has. I just like the leafy parts. So I usually go through mine and try to take those stem parts out. A bit of a pain but at least I get some greens with it then! :)",
                    "score": 16,
                    "author": "deusxanime",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But why no sour cream on the Keto salad?\n\nWait, are we supposed to not have sour cream? Did I miss a Keto Newsletter? Because my Chipotle keto bowl definitely features some sour cream goodness (and some fajita veggies, IIFMM that day)",
            "score": 79,
            "author": "karatekate",
            "replies": [
                {
                    "level": 1,
                    "comment": "the \"keto bowl\" is literally my go-to with them but -guac and +sour cream. If it fits your marcos, etc. etc. ",
                    "score": 29,
                    "author": "PassportSloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it fits my marcos, but not my polos.",
                            "score": 15,
                            "author": "jabberbox"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "According to the Chipotle website, their sour cream has 2g of carbs per serving. may have added sugar they're trying to avoid.",
                    "score": 27,
                    "author": "TheMacMan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It doesn't. It's Daisy sour cream which is literally just cream. All Daisy sour cream is exactly the same amount as Chipotle's if you use as much as they do, which is a lot.",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was just going by what Chipotle themselves claim on their own website.",
                                    "score": 6,
                                    "author": "TheMacMan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right. It is 2g of carbs per serving because that's what two servings of sour cream runs you. There's no hidden or added sugar. That's my only point.",
                                            "score": 21,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I must respectfully disagree. If I could choose how I die, \"drowning in a vat of sour cream\" makes the top 3.",
                                    "score": 84,
                                    "author": "summitlee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 40,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Amen. ",
                                                    "score": 10,
                                                    "author": "alixer"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Shine on you crazy diamond",
                                            "score": 10,
                                            "author": "Flatline2962"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Low fat sour cream probably contains a bit more sugar than full fat.  Most places probably carry low fat &amp; don't want to have to stock 2 different types.",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Theirs is definitely not low fat. They use two servings, mystery solved.",
                            "score": 15,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They most likely mix it with milk to thin it out. It’s very common in taco shops, that’s how it has a runny consistency.",
                    "score": 9,
                    "author": "turbor32",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to work at Chipotle \\[albeit many years ago\\]\n\n&amp;#x200B;\n\nIt was daisy sour cream, hand whipped until it was pourable.",
                            "score": 17,
                            "author": "ranya_des",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I stand corrected, a lot of places in San Diego mix it with milk to thin it out and put it in a squeeze bottle to make serving faster. It's good to know they at least didn't use to mix it.",
                                    "score": 4,
                                    "author": "turbor32"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's basically just a gimmick so I wouldn't read into it too much. Don't get me wrong, it's a gimmick that I appreciate. I crave acceptance. And cheese. ",
                    "score": 2,
                    "author": "yeti77"
                },
                {
                    "level": 1,
                    "comment": "Wonder if their sour cream maybe has some sugar in it or something? Or maybe they don't want to go TOO overboard and start making people think sour cream is healthy. You know, all that fat and all..",
                    "score": 6,
                    "author": "Anonim00s3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it doesn't have sugar, I have tested this with my continuous glucose monitor. All sour cream has a little bit of natural carb but it's nothing to worry about. Some people do have issues with dairy/milk products specifically so I'm guessing that's why they left it out by default.",
                            "score": 6,
                            "author": "RealNotFake",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve eaten at Chipotle’s almost EVERY day since I started keto 7.5 months ago. I’ve lost 66 pounds doing so.",
            "score": 23,
            "author": "breadhead1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Think of how much more you'll lose now that they have a keto option! /s",
                    "score": 6,
                    "author": "ninjacereal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’ve ALWAYS had a keto option. Your keto option is don’t order rice, beans, corn or tortillas. \n\nSome of the servers at my Chipotle’s store know exactly what I’m going to order and just make it without me saying a single word. I eat this every single time I go there.\n\n1. Carnitas\n2. Chicken\n3. Pico de Gallo \n4. Hot sauce, red.\n5 . Sour cream\n6. Cheese\n7. Guacamole \n8. Fajita veggies\n\nI mix it all together with a couple of plastic forks and chow down...👅👅👅",
                            "score": 2,
                            "author": "breadhead1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; /s\n\nThis means they were being sarcastic.",
                                    "score": 9,
                                    "author": "jabberbox"
                                },
                                {
                                    "level": 3,
                                    "comment": "That's some quality ketosplaining",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These bowls are online ordering only so you can’t just walk in and expect them to know what it is. \n\nAlso the instant you try messing with it, it changes from keto bowl to (insert protein here) salad, so unless that was already your normal order, or you want to try this exactly as is, you save yourself no time doing it. ",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chipotle worker here. We are expected to know what’s on the different bowls so people coming in can ask for them as well. And we don’t charge you as a “keto bowl” we charge you for “insert protein” bowl/salad. ",
                    "score": 56,
                    "author": "Abacaxi_Pineapple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This should be upvoted more. My sister is a GM at a chipotle out here and says every employee will know what a keto bowl is if you request one. \n\nEdit: changed veto to keto",
                            "score": 26,
                            "author": "tmello001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does a veto bowl come with a bad toupe?\n\nI couldn't resist",
                                    "score": 10,
                                    "author": "Pm_Me_Gnarly_Labia",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They are likely using online only to track usage.  I feel that it will be on the main menu in a year",
                    "score": 8,
                    "author": "neuromorph"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow these are expensive compared to their regular options. ",
            "score": 43,
            "author": "mariesb",
            "replies": [
                {
                    "level": 1,
                    "comment": "The keto bowl is $10.30. Thats the same price as a \"burrito bowl\" without beans or rice and adding guac.  ",
                    "score": 46,
                    "author": "PassportSloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they're not actually charging extra for double protein in these, that's a mitzvah",
                            "score": 16,
                            "author": "DClawdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The option with double protein is 11 bucks, no guac",
                                    "score": 12,
                                    "author": "mariesb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aww",
                                            "score": 4,
                                            "author": "DClawdude"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*Cause i might just ask what the ice cubes cost*",
                                    "score": 3,
                                    "author": "fratstache"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "$7.50 here if you bring your own guac.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chipotle’s guac is better than any I’ve ever had. And it’s all fresh ingredients. ",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. Visited a couple different spots in Mexico in March/April, always had guac with a meal at each place, and when I came back I was stunned how competitive the guac at Chipotle was in terms of flavor",
                                            "score": 2,
                                            "author": "I_Need_Cowbell"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve always brought my own avocado to chipotle cause I’m cheap 😂",
                                    "score": 6,
                                    "author": "marrymeodell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Re\n\nWait, that's a thing? LOL\n\n&amp;#x200B;",
                                            "score": 5,
                                            "author": "veritasgt",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "More expensive than just picking the same ingredients on their own? I know they charge extra for double protein...",
                    "score": 26,
                    "author": "DClawdude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess not, I mean they're charging extra for guac. But idk I think that if they're making the combinations themselves, it should be for some sort of discount. Otherwise I don't really get the point. People who eat keto/whole 30/etc. probably know what to order so where's the benefit?",
                            "score": 14,
                            "author": "mariesb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The main benefit is marketing themselves as friendly to these diets/lifestyles where maybe some of the people on them didn't think they were (e.g., thought of them as burritos in tortillas only or something). Trying to get more market share/profit. ",
                                    "score": 28,
                                    "author": "DClawdude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The other benefit is that as main stream restaurant chains start advertising menu items as Keto there is a chance that it will help spread the word that this way of eating is not going to kill people. And as it gains popularity there is a chance of getting a decent keto friendly meal when you are out without having to explain it in detail. ",
                                            "score": 17,
                                            "author": "InAnOffhandWay",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Anything that makes other chains take notice of a keto-friendly dish or two is awesome. ",
                                                    "score": 12,
                                                    "author": "fluteitup"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fair point but...\n\n&gt; there is a chance of getting a decent keto friendly meal when you are out without having to explain it in detail.\n\nI eat out pretty regularly, I find keto stuff, I don't get into discussions with my server about substitutions very often and when I do I'm not using keto buzzwords or going into excessive detail to get what I want. Have not had any issues with this in 2 years. ",
                                                    "score": 6,
                                                    "author": "DClawdude",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Right, I get that. I think I interpreted the post to mean Chipotle was introducing new products to cater to customers, but that's not what's going on. They just renamed some existing combinations. Sounds cool but not really super exciting",
                                            "score": 6,
                                            "author": "mariesb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People like convenience and this creates the potential for one-word ordering ",
                                                    "score": 12,
                                                    "author": "DClawdude"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Notice, it says \"Online Only\". I guess for the workers in the shop it is just another custom order, not one of their  standard combinations.",
                                    "score": 7,
                                    "author": "BusyCode"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s the same price as a bowl plus guac because...it’s a bowl plus guac",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "These are regular options... you realize this is just marketing right? Nothing here is new or priced differently. ",
                    "score": 2,
                    "author": "Bodie217"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this!   I would do the keto bowl with steak.  It’s 520 cals and 6 net carbs!  And I would probablyyy just have to add some queso because I love queso so much.  That puts it at 640 cals and 9.5 net carbs!  Wow, I’m so excited.  Like I want to go right now haha ",
            "score": 11,
            "author": "jecksida",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a heads up, Chipotle queso is notoriously bad.  I personally ask for queso whenever the opportunity arises... except for when I get Chipotle.  That stuff aint worth it to me but to each their own of course",
                    "score": 23,
                    "author": "BackroadTwistarama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk how they managed to fuck up queso so bad. Just copy Moe’s and be done with it. ",
                            "score": 18,
                            "author": "RollTide09",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Chipotle queso is soooo grainy. Tastes like someone poured Kraft mac and cheese powder in it but didn't mix in enough milk. ",
                            "score": 20,
                            "author": "SHOWTIME316"
                        },
                        {
                            "level": 2,
                            "comment": "I've heard that the queso is better \\*in\\* a burrito where it's gritty consistency gets mixed up with all the other ingredients, so it adds flavor but no weird mouthfeel.  \n\n\nI'm not a big queso fan so I pass anyway, but after the debacle of their queso and chips offering, that's what I've heard. ",
                            "score": 4,
                            "author": "Flatline2962"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess this is a good idea to garner more attention from people unaware of their keto options.. However like most of you are already saying, it makes more sense to just order a salad and customize it the way you like for cheap",
            "score": 7,
            "author": "KnicksPino"
        },
        {
            "level": 0,
            "comment": "Sounds like my typical salad at Chipotle minus the salsa and add sour cream. Great macros too.",
            "score": 4,
            "author": "Tbhjr"
        },
        {
            "level": 0,
            "comment": "I actually calculated a good low carb option last week, and this is exactly what I came up with. Good job Chipotle.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Gym. Chipotle. Laundry.  I love the new executive/marketing team",
            "score": 5,
            "author": "Burrrrrrito"
        },
        {
            "level": 0,
            "comment": "I do double side of meat (about $4.50) then get a side of guacamole separately.  Then I just add a few drops of (free) tobacco if I’m in the mood for a little heat.  It’s way more food than I need, usually.  Often I just do one side of meat and a side of guacamole.  Yes, ordering this way often confuses the employees which run on auto-pilot.\n\nOr do just meat and cheese and they should charge you for a “3-pointer” which is one proton and one condiment.  I really wish you could order this way with the app but the app will always charge a “bowl” price and not for meat “sides” or “3 pointers.”  If Chipotle wanted to support my “lifestyle” they’d just fix the pricing in the app.\n",
            "score": 3,
            "author": "Whiplash104"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You had me all the way up to 50 cent avocado. \n\nOn sale I might be able to find them for $1, but that would be an amazing find.\n\n&amp;#x200B;",
                    "score": 26,
                    "author": "biomags",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here, I don't know where he gets his avocados but I want in on that deal.",
                            "score": 9,
                            "author": "RealNotFake",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I was lucky to find them under $2 for months, but 2 nights ago they went on sale at a local store for 2/.89!! They're the smaller ones, not the huge ones, but thatsvbetter for us anyway! No avacado turning brown in the fridge. I bought so many. ",
                            "score": 3,
                            "author": "shrinkingmama"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some people just starting out are embarrassed or uncertain about what's allowed when it comes to substitutions and omissions. This may be silly for all the pro keto people, but is great for newbies. ",
                    "score": 12,
                    "author": "fluteitup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We don't have a Chipotle around here and I hate modifying orders too much because I'm a short order cook so having a keto specific menu item blows my mind a bit. ",
                            "score": 3,
                            "author": "Pm_Me_Gnarly_Labia"
                        },
                        {
                            "level": 2,
                            "comment": "Good point!",
                            "score": 2,
                            "author": "Flatline2962",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;  Little heavy on carbs\n\nWhat are the carbs here? The pico de gallo and the fajita veggies? I'm new to keto.",
                    "score": 8,
                    "author": "bobert17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s not heavy on the carbs, at most the pico has 2 or 3.",
                            "score": 11,
                            "author": "NickyNichols",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Figured it was the pico, just wanted to know what the 'optimal' bowl was before I found started toying with what works for me. Thanks.",
                                    "score": 4,
                                    "author": "bobert17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve lost 110 pounds in the past year, I’m not an expert but what I’m doing seems to work. I just limit myself to 30 carbs a day, under 2500 calories. I also am a manager at a Mexican restaurant and each day I make a salad. The only things I avoid are rice, beans, and corn, really. As long as you know what you are eating, you are good.",
                                            "score": 11,
                                            "author": "NickyNichols",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;  manager at a Mexican restaurant \n\nYou must have the self-control of a Buddhist monk in a whore house. That is impressive, my friend!",
                                                    "score": 27,
                                                    "author": "panzershark",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He still gets to go all in on the seasoned meats and cheeses!!",
                                                            "score": 8,
                                                            "author": "Alex_Pike"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha thanks! It was more just being absolutely disgusted at myself and sick that gave me the willpower. I can happily avoid bread to not be like that anymore.",
                                                            "score": 4,
                                                            "author": "NickyNichols"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well you get some carbs from the lettuce, maybe 1 or 2, some carbs from the meat seasonings/additives, again maybe 1 or 2, but yeah, the tomatoes and onions and bell peppers are going to be heavier hitters. With easy on the sour cream and easy on the tomatillo/medium salsa, you're looking at around 12g of net carbs. If you get a full blast of each it's more like 15g.\n\nThe fajita veggies are 4g net carbs and the pico de gallo is 3.\n\n&amp;#x200B;\n\nNutrition calculator here:[https://www.chipotle.com/nutrition-calculator](https://www.chipotle.com/nutrition-calculator)\n\n&amp;#x200B;\n\nEdit: I run on a 25-30g a day carb allotment because I'm a big guy with a lot of weight to lose, so if I eat 2 meals a day the way I usually order my bowl that equals about half my carbs, so I don't worry about it. If you're trying to eat on 20g of carbs a day naturally this is kind of a heavy hitter. It becomes more reasonable if you ditch the fajita veggies. \n\n&amp;#x200B;\n\nCalories though, that's a lot of bulk for not a lot of calories. Without cheese my bowl runs around 300 calories which isn't much. With cheese and full sour cream it's closer to 450. ",
                            "score": 11,
                            "author": "Flatline2962",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You have forgotten that Chipotle's nutrition calculator already lists net carbs.  Do not subtract fiber.  Unless they've changed it and I missed that.",
                                    "score": 2,
                                    "author": "GroovyGrove",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How in the heck do you get avocados for $.50? I live in a major city and the cheapest I ever see is around $1.00 these days.",
                    "score": 6,
                    "author": "RealNotFake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in California close to where they grow. They might be at 75 cents a pop right now. At their height and around major holidays they go on sale with other salsa ingredients. ",
                            "score": 6,
                            "author": "Flatline2962"
                        },
                        {
                            "level": 2,
                            "comment": "I've always gone to the mexican super market, you can get all the ones that have a blemish or something else small cosmetically wrong for dirt cheap.",
                            "score": 2,
                            "author": "Loomy7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is basically already what i order from chipotle.  i bet they noticed a lot of people were ordering no beans/no rice and decided to go with it.",
            "score": 5,
            "author": "klaq"
        },
        {
            "level": 0,
            "comment": "Or as I called it before... my regular order... ",
            "score": 5,
            "author": "TriGurl"
        },
        {
            "level": 0,
            "comment": "Cute for being able to just drop it into your online order or if you are a part of a group order, no need to break down the bowl. However, they have the salad bowl specifically and the times I've been to chipotle and ordered it the first question is Do you want rice? and I have to resist asking why I wouldn't have just asked for a burrito bowl if I wanted rice in confusion... ",
            "score": 3,
            "author": "Lethave"
        },
        {
            "level": 0,
            "comment": "Been ordering basically this for like 2 years now, but good on them for capitalizing on 'the latest fad diet'",
            "score": 5,
            "author": "zytz"
        },
        {
            "level": 0,
            "comment": "Is chipotle similar to Moes? Where you order a base thing then go down the line and add what you want? \n\n",
            "score": 6,
            "author": "Averen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. ",
                    "score": 2,
                    "author": "realwords"
                },
                {
                    "level": 1,
                    "comment": "yes but moes has more options",
                    "score": 3,
                    "author": "MyFingerPointeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I always thought the food at Moes was a little more bland than chipotle, but I really liked the salsa choices.\n",
                            "score": 6,
                            "author": "dzr0001"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually hit Qdoba and get the mini bowl, double the meat with Queso, shredded cheese Sour cream and lettuce, the total comes out to about 8 bucks and the portion is more than enough most times. I never did like Chipotle's Queso or meats for that matter. Qdoba is where it's at!\n\n&amp;#x200B;",
            "score": 4,
            "author": "Z0MB13S"
        },
        {
            "level": 0,
            "comment": "Why carnitas though? Steak/barbacoa better right? ",
            "score": 2,
            "author": "Arthas429",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or even the chicken.  It’s thighs if I remember correctly.",
                    "score": 5,
                    "author": "MachineObsolete"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I make crockpot carnitas at home and freeze them in small batches. Enough for probably 14+ meals costs $9. Their keto bowl is pretty much exactly what I do with it on my I don't feel like cooking nights. ",
            "score": 2,
            "author": "shrinkingmama",
            "replies": [
                {
                    "level": 1,
                    "comment": "What cut of meat do you use for your carnitas? Do you have a recipe?",
                    "score": 3,
                    "author": "CityOfChamps09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's pork shoulder, goes on sale for .99/lb or less. Very fatty cut, with a bone and cooks up tender and delicious! I just throw on a seasoning mix I make, I'll look it up and add the ingredients later, and cook on low until it falls apart easily. No liquids or anything added, so easy! And you can spread it out on a baking sheet and crisp it up in the oven. I'm usually lazy and skip that step. ",
                            "score": 3,
                            "author": "shrinkingmama"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easy enough to do on your own but I like the idea of them making their staff knowledgeable.  Wonder if they actually know answers to questions when dieters ask “can I have ______?”",
            "score": 2,
            "author": "ExpositoryPawnbroker",
            "replies": [
                {
                    "level": 1,
                    "comment": "And probably don't have to pay extra for guac while not eating any rice or beans.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I already order what is essentially their keto bowl to begin with.\n\nThe meat is just what I'm in the mood for that visit.",
            "score": 2,
            "author": "LazyKenny",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thats ...... A salad",
            "score": 2,
            "author": "gratethecheese"
        },
        {
            "level": 0,
            "comment": "My Keto bowl: 3 sides of meat. \n\nEnds up being about 60g protein, maybe 3 carbs, and costs about $8. ",
            "score": 2,
            "author": "earthboy17"
        },
        {
            "level": 0,
            "comment": "nice of them to do that but i just I'd just get my regular order still...\n\n&amp;#x200B;\n\nsteak salad with cheese, sour cream, salsa, hot sauce on the side, more lettuce and sometimes guac. if I am starving my ass off, double steak and guac",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is the noro virus included or is that extra?\n\n&amp;#x200B;",
            "score": 2,
            "author": "steppinraz0r"
        },
        {
            "level": 0,
            "comment": " Hey guys, you all were a huge help in coming up with keto options to add to our menu.  So we just wanted to say thank you for helping us make the Keto Salad Bowl shortcut happen!",
            "score": 2,
            "author": "chipotle",
            "replies": []
        }
    ]
}