{
    "id": "dsyv56",
    "score": 6377,
    "title": "2 Years of Keto, 215 lbs loss - Stick with it!",
    "author": "[deleted]",
    "date": 1573138689.0,
    "url": "https://www.reddit.com/r/keto/comments/dsyv56",
    "media_urls": [
        "https://www.reddit.com/r/keto/comments/dsyv56/2_years_of_keto_215_lbs_loss_stick_with_it/"
    ],
    "other_urls": [
        "https://postimg.cc/WFNnYbL9](https://postimg.cc/WFNnYbL9)"
    ],
    "postText": "Things weren't pretty.\n\n[https://postimg.cc/WFNnYbL9](https://postimg.cc/WFNnYbL9)\n\nMade the call from a hospital bed in Sept 2017 to change. Prior to that had the mindset that life worked around me.At that time I wasn't sure if I HAD time, I was slated to go to a care center to learn how to walk again after a severe back issue. Avoided that, and left on a walker with an oxygen machine,A year of diet later, I had slimmed down a chunk and got a spinal stimulator implanted which helped with pain - was able to get into the gym in January of this year - it's become a daily.\n\nAfter a body scan a couple weeks ago, I realized that I hit goal. Loss of 215 lbs, and a body fat of 13%.  Intermittant fasting, Keto, and being stubborn absolutely saved my life.\n\n\\#ThanksKeto\n\nEDIT- WHOA!  Thanks for the Gold, Platinum, Silver - and amazingly kind words.",
    "comments": [
        {
            "level": 0,
            "comment": "Amazing dude! What a journey! Keep inspiring others.",
            "score": 350,
            "author": "smarreco",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!  I'll keep sharing - it was a post like this that led me to a macro calculator that made things black and white - hopefully it rolls forward and ignites a stranger's path.  \n\nEdit - I think all the calculators follow the same logic - find one and stick with it, the one that I started with is no longer.",
                    "score": 212,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, you are most certainly igniting many paths.",
                            "score": 79,
                            "author": "64557175"
                        },
                        {
                            "level": 2,
                            "comment": "Which macro calculator?!",
                            "score": 7,
                            "author": "Stock_is_Locked"
                        },
                        {
                            "level": 2,
                            "comment": "Macro calculator?",
                            "score": 4,
                            "author": "cokecain_bear"
                        },
                        {
                            "level": 2,
                            "comment": "Can you elaborate on meds, treatments, etc.? I am an interpreter and I have seen cases not as serious as yours, but life lessons and tons of meds and many people that won't or cant eat healthy.",
                            "score": 4,
                            "author": "boricua03",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, interesting subject.  I didn't do any meds / treatments related to weight loss.    \nAs a pain patient, I was looking at a lifetime of pain medications - made the switch to medical cannabis in a VERY regulated state, and CBD/THC became my sole medications.",
                                    "score": 41,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What do you eat when you get the munchies?\nSeems like THC is my enemy when it comes to weight loss.",
                                            "score": 8,
                                            "author": "InkzBeThyName",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "haha are you my wife? She says the same thing. \n\nI like pork rinds, cheese (good stuff, not just cheddar or whatever), or veggies and dip. Sweet tooth? Diet soda or flavoured herbal teas (think 'Smores' or 'Carrot Cake' David's Teas) with a bunch of cream.",
                                                    "score": 15,
                                                    "author": "thoriginal",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "S’mores tea?  Why thank you sir",
                                                            "score": 4,
                                                            "author": "Jackiedhmc"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Wtf you got against chedder!!??!??! There's good chedder out there",
                                                            "score": 2,
                                                            "author": "HSBen",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He didn't say that, he just said there are others as well. A lot of Keto-people think cheddar is the one and only, which isn't true.",
                                                                    "score": 2,
                                                                    "author": "Kumadori012",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No, its true, it is the one and only. :)",
                                                                            "score": 2,
                                                                            "author": "HSBen"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And munchies don’t last forever, when I first started smoking it was intense but now that I’ve been a regular smoker for a while it helps me focus on fasting, and sometimes, you don’t wanna screw up your high by eating lol.",
                                                    "score": 2,
                                                    "author": "pnwfishing17"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can you expand on the CBD/THC side of things?  My wife is in chronic pain, and we’re looking into that, but I don’t know squat about it.  I don't even know where to start looking for info.",
                                            "score": 5,
                                            "author": "curiously-b2"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bro, supplement with Kratom, Wiped my nerve pain OUT! I mix with Medical Cannibis, and the combo is a game changer.",
                                            "score": 4,
                                            "author": "mitzelplick",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Umm....so , where did the extra skin go? When people lose a lot of weight over a short time there is usually a lot of loose skin.",
                    "score": 4,
                    "author": "AviTech72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's there, you can see the skin dipping below his pecks. The rest is below the mirror.",
                            "score": 14,
                            "author": "arielaquarial",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep.",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve read fasting and the increased autophagy it induces can help\n\nhttps://youtu.be/KWh4qeVEaqw",
                                            "score": 4,
                                            "author": "1too34"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy fuck man, you’re my idol. I wish my dad followed your path before he left us. \n\nKeep up the good work sir!",
            "score": 157,
            "author": "TheSlav87",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a ton, as a dad of two - this really resonates, sorry to hear of your loss.",
                    "score": 135,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Wow man. That statement hits me pretty fuckin hard. I got 3 boys and I know I got to stay with it this time around or they will lose me. I absolutely dont want them to have to go through that shit because I didnt take care of it when I could. I'm down 40 pounds and still got a long road but reading a comment like that is for sure a wake up call to see it through for life.",
                    "score": 102,
                    "author": "Durbinonketo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Weight was a huge issue with my dad later on in his life, he had been a big man for a while and trying is best to lose it. But when he had a stroke, it changed everything. While even then he was strong willed and fighting to get the ability to walk back and lose weight, his fucking cancer came back and it was too late for doctors to do anything. \n\nBeing overweight is a disease if you ask me and my who family has had an issue with it always, it’s hereditary for some families to gain weight easily.\n\nEdit: On his death bed, since he had a hard time talking, he had to use a laptop and write us. He wrote something like this: “My children, lose weight as it will kill you”.",
                            "score": 29,
                            "author": "TheSlav87"
                        },
                        {
                            "level": 2,
                            "comment": "You and I are keto Twins!  3 boys and I’m also down just over 40 pounds..  I still have a long journey ahead but the progress I’ve made is keeping me focused.\n\nOP, good lord, awesome work!  I’m in awe.",
                            "score": 10,
                            "author": "4grams",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm almost there too! I have a little girl, and I'm down 37!",
                                    "score": 7,
                                    "author": "dannovano"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this hits hard..my dad died at age 52 from obesity :(",
                    "score": 11,
                    "author": "Godless__Goddess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My grandpa did too. My mom never really got over it.",
                            "score": 9,
                            "author": "scarletmagnolia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "unreal results. i honestly clicked before i read and was expecting you or someone to be using your photos to sell something. that's how impressive your before &amp; after is. congratulations on everything.",
            "score": 49,
            "author": "ilovecarrotcakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha! Unfortunately no products to sell, it's all in the head.    \nHowever, if Bang energy drinks want to sponsor, I think I'm sending some kids through college there.  :)  \nThanks!",
                    "score": 61,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have definitely been paying into the bang college fund as well!",
                            "score": 13,
                            "author": "Lballz"
                        },
                        {
                            "level": 2,
                            "comment": "It's funny how people want a product to solve their problem.  I've been on Keto about 18 months and my mother has told me several times how worried she is about my diet (not trying to lose weight, just be healthier).  Then, she orders some \"KETO\" pills to lose weight. I found out because it was one of those subscription scams that dings her credit card for $150 every month.",
                            "score": 8,
                            "author": "lizardflix"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have an amazing journey. It inspired me to keep pushing. I too have a goal to lose 200+(-58 so far). Thank you so much for sharing.\n\nEdit: thank you for silver, kind stranger.",
            "score": 37,
            "author": "R0b0tzki"
        },
        {
            "level": 0,
            "comment": "&gt;Intermittant fasting, Keto, and being stubborn absolutely saved my life. \n\nI like this last bit.\n\nCongrats on your transformation! Cheers to staying fit!",
            "score": 33,
            "author": "TheLastAOG"
        },
        {
            "level": 0,
            "comment": "You sir have lit a fire under my lazy fat ass. A lot of self loathing and procrastination after gaining back the 30 pounds I lost but this was the kick in the pants I needed. Thank you and congrats",
            "score": 26,
            "author": "NikToonz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same man, I started the year around 275 got down to 210 right before starting college and now I’m at 236. This has given me hope that I really can do it again and it’s all mental. On to Onederland and to stay there for good",
                    "score": 5,
                    "author": "Doubled444"
                },
                {
                    "level": 1,
                    "comment": "Do not quit! Do not quit! Do not quit! You have this!",
                    "score": 5,
                    "author": "scarletmagnolia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "WOW!!! You are amazing!",
            "score": 20,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Holy fuck! Damn fine job sir.",
            "score": 17,
            "author": "orangeirwin"
        },
        {
            "level": 0,
            "comment": "Honestly man this is the most inspiring thing I’ve seen on this sub!",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Man. I love keto. But I usually will screw up on weekends. How do you keep it going for so long?",
            "score": 14,
            "author": "_SupremeO",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mentality that helped me the most, was comparing it to prison.    \nWe're in it right, we've locked ourselves into this hell - and we have a path out of it. Deviating from that path is akin to bad behavior, and stretches the sentence. Look at every mess-up like you are extending your prison sentence by 3 days - those carbs don't sound as good then.",
                    "score": 67,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In your 2 years did you ever have a non keto day? Like a cheat meal for thanksgiving or Christmas or even just a random cheat day throughout the journey just to feed the urge? I mean I guess it could just be that you’ve 100% made it your lifestyle to cut all non-keto carbs out of your life which is really impressive.",
                            "score": 7,
                            "author": "kensanity",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too. Beer gets me everytime",
                    "score": 10,
                    "author": "stereotomyalan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tequila soda checking in lol.  My mom asked me if I miss any food in this diet.  I think I miss good craft beers the most. Haha",
                                    "score": 8,
                                    "author": "watermooses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's especially tough if you are a home-brewer like I am.  I currently have 3 (5 gal) kegs of critically acclaimed (by friends and family, at least) beer on tap at the moment.  Keto has definitely decreased my desire to have a pint or three, but I've managed to work the occasional beer into my diet.  I've achieved my goal weight, but keeping vigilant to ensure I don't creep back up.",
                                            "score": 3,
                                            "author": "DeltaJulietHotel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes! I love craft beers. It was a sad day to go without, but I'm seeing more and more low carb options pop up!\n\nNgl I miss ales and porters, but Shiners Ruby Red Grapefruit is 3 carbs and scratches the itch pretty good ☺️",
                                            "score": 2,
                                            "author": "ninasafiri",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You decide you want to live.",
                    "score": 11,
                    "author": "sfcnmone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit dude! Amazing dedication",
            "score": 12,
            "author": "Vanscottrick"
        },
        {
            "level": 0,
            "comment": "Holy shit, dude! You saved your own life, and did a fucking amazing job at it! Just amazing! Congrats on all of your hard work!",
            "score": 12,
            "author": "brick0fselfcontrol"
        },
        {
            "level": 0,
            "comment": "Good shit dude. You look great",
            "score": 26,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That's great. You are an inspiration for any of us trying to retake control of our lives.",
            "score": 11,
            "author": "donotshop"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing, I've lost 80 lbs since January 20th and started out at 411. While my life has already changed dramatically, I still have moments where it feels like I should have lost more already. \n\nBut we have to be patient with ourselves, and not let ourselves get fearful that the weight loss will just stop. I also have hypothyroidism and it's not uncommon for us women to lose weight more slowly to begin with. Plus, my weight seems to be distributed differently, I'm fitting into smaller sizes than I used to at this weight... in such a different way that it doesn't actually make sense lol.\n\nAnyway, this is inspiring even for those of us that have no problem staying keto for the rest of our lives. Thanks again for the pick me up.",
            "score": 11,
            "author": "Pankeopi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Do you lift?",
            "score": 10,
            "author": "FINewbieThrowaway19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not free weights, but nautilus style machines (almost) every morning.",
                    "score": 20,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn. Motivated is an understatement!!! Thanks for sharing 💜💜💜",
            "score": 9,
            "author": "JessDaeny"
        },
        {
            "level": 0,
            "comment": "Holy fuck, bro. Holy fuck.",
            "score": 7,
            "author": "TheSecondApocalypse"
        },
        {
            "level": 0,
            "comment": "Dude! Freaking Amazing!\n\nI had to laugh a little at the first photo with the BP cuff labeling you as a \"Large Adult\". I think I'm allowed to do that, as I'm pretty much in the same place you were then, weight-wise.\n\nI need to get me one of these awesome \"After\" pics.",
            "score": 8,
            "author": "Zaphanathpaneah"
        },
        {
            "level": 0,
            "comment": "Wow ! Great job !\n\nDo you still have the spinal implant ?",
            "score": 13,
            "author": "arnott",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do, it was a game changer.  \nHave neuropathy from the ribs down, the stimulator cuts my pain in half and lets me function a somewhat normal life.  \nIf it's something you have questions or need insight on - feel free to DM me.",
                    "score": 31,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the info. Was curious. \n\nGood luck !",
                            "score": 3,
                            "author": "arnott"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How come you don't have loose skin? I thought loose skin is mandatory for any major weight loss like over 35 lbs.\nCongratulations tho!",
            "score": 12,
            "author": "centurychild7",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's the master crop.  I have loose skin below the mirror around my naval - it's on the list to get fixed - but it's f'n expensive and I don't see it happening soon.",
                    "score": 16,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You rock!  Congrats on the new you!",
            "score": 5,
            "author": "ZadieLane"
        },
        {
            "level": 0,
            "comment": "Well done. Thanks for sharing.",
            "score": 4,
            "author": "RadalErper"
        },
        {
            "level": 0,
            "comment": "Holy crap, awesome accomplishment!  You really did save your life.",
            "score": 4,
            "author": "CBbeMe"
        },
        {
            "level": 0,
            "comment": "Holy hell. Just whoa. And maybe a wow.",
            "score": 5,
            "author": "jackbootedhugger"
        },
        {
            "level": 0,
            "comment": "What a feat, CONGRATUFUCKINGLATIONS!!!!",
            "score": 4,
            "author": "Cheesefries4lyfe"
        },
        {
            "level": 0,
            "comment": "Wow Adam you definitely have inspired me to keep on going &amp; be patient on Keto. I’m like 5 months into this process &amp; have lost about 20 pounds. Your pictures &amp; story is inspiring &amp; proof that Keto does work! Thanks Man very Happy for you! I hope to also post my progress someday!",
            "score": 4,
            "author": "cookiemonster-2"
        },
        {
            "level": 0,
            "comment": "Liar. This is made up. Those are not the same people!\n\nBut seriously, wow, you are a king",
            "score": 5,
            "author": "Zahn1138"
        },
        {
            "level": 0,
            "comment": "Holy shit... I've done keto before for sports and it worked so well that I've been putting it off thinking I can always start later and itll work out just fine. I think this post finally hammered in the idea that it's really all about health and living a better life. Just wanted to say thank you for posting this.",
            "score": 3,
            "author": "MrSwoleNutzz"
        },
        {
            "level": 0,
            "comment": "WOW!!! This is amazing!! Great freaking job.",
            "score": 3,
            "author": "poppthechampagne"
        },
        {
            "level": 0,
            "comment": "This is incredible. Thank you for sharing",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My man \nThis is inspiring \nGood on you",
            "score": 3,
            "author": "FatBoyBjj"
        },
        {
            "level": 0,
            "comment": "Simply put: WOW!!!!",
            "score": 3,
            "author": "TheDude4527"
        },
        {
            "level": 0,
            "comment": "You look incredible! Job well done!",
            "score": 3,
            "author": "learning2bhappy"
        },
        {
            "level": 0,
            "comment": "Amazing story!!",
            "score": 3,
            "author": "Kimberhof"
        },
        {
            "level": 0,
            "comment": "I needed to hear this today. Thanks, and congrats on your success!",
            "score": 3,
            "author": "hazeleyedwolff"
        },
        {
            "level": 0,
            "comment": "Nailed it bud. Shuch a motivation you are for us that keep falling off the wagon. Keep it up",
            "score": 3,
            "author": "GkGe"
        },
        {
            "level": 0,
            "comment": "Wow. O_O",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amazing dude! Keep it up. I bet you never had the thought back then you would see abs and now look!!!!",
            "score": 3,
            "author": "2qwik2katch"
        },
        {
            "level": 0,
            "comment": "Amazing transformation! Congratulations. You are an inspiration.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This right here is what keeps me going.",
            "score": 3,
            "author": "jraij"
        },
        {
            "level": 0,
            "comment": "Fucking legend",
            "score": 3,
            "author": "Jacomer2"
        },
        {
            "level": 0,
            "comment": "You are flat out inspiring! Thanks for this post. I'm 100 lbs into my 200 lbs weight loss journey. Its been a bumpy two weeks for me. I'm going to get it done no matter what!",
            "score": 3,
            "author": "Chadarius"
        },
        {
            "level": 0,
            "comment": "Choices were made. Well done my dude.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "One of the most amazing transformations I’ve seen on here!! Congrats!",
            "score": 3,
            "author": "H1ba"
        },
        {
            "level": 0,
            "comment": "This change is just unbelievable. You’ve worked incredibly hard and it has paid off. Massive well done to you!",
            "score": 2,
            "author": "Lush_Fusion"
        },
        {
            "level": 0,
            "comment": "I'm speechless and you are a living miracle!",
            "score": 2,
            "author": "nohurtjusthope"
        },
        {
            "level": 0,
            "comment": "amazing!",
            "score": 2,
            "author": "Yorktown801"
        },
        {
            "level": 0,
            "comment": "Tremendous transformation brother, congrats.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You are incredible! I respect you so hard",
            "score": 2,
            "author": "Aufwind"
        },
        {
            "level": 0,
            "comment": "Way to go!",
            "score": 2,
            "author": "jaebree422"
        },
        {
            "level": 0,
            "comment": "Mind sharing your exercise schedule?\n\nIt's great seeing people like you. Congrats.",
            "score": 2,
            "author": "b0t1337"
        },
        {
            "level": 0,
            "comment": "outstanding! Thanks for the inspiration.",
            "score": 2,
            "author": "ouch_my_liver"
        },
        {
            "level": 0,
            "comment": "Woah. You're a fucking legend!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good Lord man. Kudos. Just.... Damn. You should be on a magazine",
            "score": 2,
            "author": "Phosphorescense"
        },
        {
            "level": 0,
            "comment": "Wow, you look great! Congrats on this incredible achievement.",
            "score": 2,
            "author": "gohappinessgo"
        },
        {
            "level": 0,
            "comment": "Whooah! Congratulations!\n\nAre you also working out while on keto? Does it affect your energy levels?",
            "score": 2,
            "author": "AdamInChainz"
        },
        {
            "level": 0,
            "comment": "Inspirational. Live and love every second of your new life to the fullest my man",
            "score": 2,
            "author": "nomad80"
        },
        {
            "level": 0,
            "comment": "You are a testament of the resilience of a human body! Very well done!",
            "score": 2,
            "author": "TheHoliday-Armadillo"
        },
        {
            "level": 0,
            "comment": "Holy shit!! Wow amazing 👏",
            "score": 2,
            "author": "jeepgirl80"
        },
        {
            "level": 0,
            "comment": "Great job man.",
            "score": 2,
            "author": "Gritch"
        },
        {
            "level": 0,
            "comment": "This is amazing and inspiring! Congratulations on your strength to keep going and on your LIFE success, as this isn't just about keto for you!",
            "score": 2,
            "author": "texasketocouple"
        },
        {
            "level": 0,
            "comment": "So amazing! Very inspiring!",
            "score": 2,
            "author": "Mynusss"
        },
        {
            "level": 0,
            "comment": "Dude what?!?!?!?  Incredible results.",
            "score": 2,
            "author": "lawvas"
        },
        {
            "level": 0,
            "comment": "Getting sick because of old life habits and being told you will die young motivated me too. Good job mate. Looking fantastic.",
            "score": 2,
            "author": "whakahere"
        },
        {
            "level": 0,
            "comment": "Holy mooda fookin mooda fucka. GOOD FUCKIN SHIT DUDE! Incredible! I cant even imagine how your friends and family reacted",
            "score": 2,
            "author": "jerseypoontappa"
        },
        {
            "level": 0,
            "comment": "i’m eight days into a 100 consecutive gym day personal mandate. your post reminds me of why i am doing it. thank you!",
            "score": 2,
            "author": "sneakatdatavibe"
        },
        {
            "level": 0,
            "comment": "https://i.imgur.com/Glc9RFc.gifv",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congratulations! This honestly just takes my breath away. If stories like this don't give credence to keto's effectiveness for weight loss, I don't know what will.\n\nHope life continues to bring amazing things your way!",
            "score": 2,
            "author": "celav551"
        },
        {
            "level": 0,
            "comment": "You are a boss!!!! Your skin looks like it has bounced back really well! I am hoping mine will as well!\n\n&amp;#x200B;\n\nGreat job!! Dont stop!",
            "score": 2,
            "author": "JNorm2112"
        },
        {
            "level": 0,
            "comment": "You, sir, are amazing!  You've done such an amazing job reaching the truest version of yourself!  Congratulations are in order! 😁😁\n\n What are your plans now?",
            "score": 2,
            "author": "Lady_Senie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. :) \n\nNothing really changes?  I took goals off, as unrealistic goals are motivational killers.    \nStill hit the gym every morning, still watch what I eat - though I am more lenient to carbs especially if out with others etc.    \nBasically, the plan is to keep living and pushing forward - my goals just shift to more business or personal side.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you have any issues with loose skin? How long of fasts did you do?",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "How did you handle your excess skin? Any tips, workouts, or other ideas?",
            "score": 2,
            "author": "nola_it",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I have loose skin around my naval and chest - I think staying moving during the drop helped significantly.  \nI would still like to get it removed, but financially it's steep.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hows the back now",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately that's static.  \nHad a full lumbar splenectomy with a dural tear - I'm thankful I can use my legs, but nerve repair happens within 2 years, we have passed that so there's no looking up there.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh gg",
            "score": 2,
            "author": "purpleturtlelover",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dude!!!  How the hell?  That takes 1000% dedication and perseverance.  You look fantastic, what a great turnaround.",
            "score": 2,
            "author": "Natalicious-Keto"
        },
        {
            "level": 0,
            "comment": "Congratulations on your success and commitment. You’re a role model change.",
            "score": 2,
            "author": "liquid_diet"
        },
        {
            "level": 0,
            "comment": "This goes to show that obesity is absolutely not ok!! I applaud your work sir! You look fantastic. Keep fighting the fight and never change!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Awesome good for you, you look great",
            "score": 2,
            "author": "mezz519"
        },
        {
            "level": 0,
            "comment": "Amazing and inspirational!",
            "score": 2,
            "author": "Cisco433L"
        },
        {
            "level": 0,
            "comment": "Wow! This is amazing...I’m so happy you’ve found the right path and also happy that you shared your story. I am sure you’ll help someone that is reading your post one day! Amazing...",
            "score": 2,
            "author": "Coffee__and__Donuts"
        },
        {
            "level": 0,
            "comment": "Great job, dude.",
            "score": 2,
            "author": "cal_republican"
        },
        {
            "level": 0,
            "comment": "Holy hell. You sir, win the keto internet today. Congrats on saving your life!!!!!",
            "score": 2,
            "author": "arlmwl"
        },
        {
            "level": 0,
            "comment": "No fucking way! You're an absolute stud! People on this sub think it's just a diet, but I know how hard you worked at the gym and beyond. Seeing this transformation in two years tells me you were working your ass off EVERY SINGLE DAY. You're an amazing person and a true inspiration. Thank you for sharing!",
            "score": 2,
            "author": "Kay1000RR"
        },
        {
            "level": 0,
            "comment": "Very impressive, congrats on the turn around. \n\nOne question i often have for success stories like these on the subs is whether or not people are working during the interim. For me personally it was easier to go gung ho in college with minimal responsibilities but it seems to be much harder getting uber strict and consistent while also maintaining daily life activities.",
            "score": 2,
            "author": "RingSlayer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thanks for this post. I’m a year and 3 months in and getting super frustrated because I’m still overweight and 94 lbs down.  I felt like I was doing it for longer than other folks in this thread. Serious thanks",
            "score": 2,
            "author": "Oliviationlee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do not be frustrated by that, thats amazing and 3 months is not long! Thats more than I have lost in almost 2 years!",
                    "score": 2,
                    "author": "rachman77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saved this. Have a feeling I’ll be revisiting this post a lot during the next few years. Congratulations for completing your goal and recovery. And thank you for posting.",
            "score": 2,
            "author": "EscoPablobar6"
        },
        {
            "level": 0,
            "comment": "Unbelievable! Props!",
            "score": 2,
            "author": "ElRicardoMan"
        },
        {
            "level": 0,
            "comment": "Holy shit",
            "score": 2,
            "author": "DiefagMODSdie"
        },
        {
            "level": 0,
            "comment": "Holy shit man, good for you! Amazing",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "CHAMPION!!!!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Its so hard to wrap my head around you losing my entire body. Congratulations.",
            "score": 2,
            "author": "lvl99weedle"
        },
        {
            "level": 0,
            "comment": "Damn dude. AMAZING work and so inspirational!",
            "score": 2,
            "author": "michmcpher37"
        },
        {
            "level": 0,
            "comment": "This is absolutely incredible.",
            "score": 2,
            "author": "BadbadwickedZoot"
        },
        {
            "level": 0,
            "comment": "Wow dude good shit! Your skin looks amazing as well I would never have guessed you were 215 lbs heavier just looking at the picture on the right.",
            "score": 2,
            "author": "Yungissh"
        },
        {
            "level": 0,
            "comment": "First, omfg. You are amazing and inspiring. I love the prison analogy from another response. I’m going to steal that.\n\nSecond., You should be a poster child for Nautilus. I do keto to drop 20 lbs when I need to. You make me want to do more. I have a bow flex in my basement and you make me want to use it. Thank you.  \n\nThird, I have serious questions...\n\nDo you have a job? How do you afford to dedicate the time and money it takes to stay with this?\n\nHow old are you? Or what age range? If that’s too personal?",
            "score": 2,
            "author": "jangro",
            "replies": [
                {
                    "level": 1,
                    "comment": "First, Thank you!\nSecond... if you have any contacts at Nautilus I'm game! :)  \nThe questions - it's really only time. I work an office job that keeps me busy, but also pays my gym membership as a perk.  My extra time probably comes out of when I should be sleeping.  \nLastly, I'm 38 :)",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "smile man!look at the progress you’ve made",
            "score": 2,
            "author": "vadim69tudor"
        },
        {
            "level": 0,
            "comment": "Jesus h Christ",
            "score": 2,
            "author": "memedealer420_____"
        },
        {
            "level": 0,
            "comment": "Don't think it's the keto. It's the dedication.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amazing! How has this impacted your pain?",
            "score": 2,
            "author": "thepolishpen",
            "replies": [
                {
                    "level": 1,
                    "comment": "It hasn't.  \nThat's a tough part to swallow - I move better and feel better... But pain will be here until I am not.   \nBUT! We all have it - pain is a given, mine is just identified and static.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What an amazing accomplishment!! \nYou would never know you were the same person.",
            "score": 2,
            "author": "HelenMTobin"
        },
        {
            "level": 0,
            "comment": "Straight shredded bro, you’re an inspiration",
            "score": 2,
            "author": "SR71BBird"
        },
        {
            "level": 0,
            "comment": "Unreal man, greatest achievement.",
            "score": 2,
            "author": "SanaFTW"
        },
        {
            "level": 0,
            "comment": "Dude you lost 1 me! Congratulations!",
            "score": 2,
            "author": "jlevy1126"
        },
        {
            "level": 0,
            "comment": "And no products to sell, this guy is genuine as fuck I can barely believe it.\n\nIncredible job, well done",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m pretty big myself. I’m curious do you have a lot of loose skin? How does that impact your life? If you have tons of loose skin did you have surgery or are you just living with it?",
            "score": 2,
            "author": "Kairukun90",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow! Incredible!  😮👏👏👏",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Legend of a man. Well done",
            "score": 1,
            "author": "104thunderduck"
        },
        {
            "level": 0,
            "comment": "the change! man, i'm tearing up (no joke) with joy for you! way to take control!",
            "score": 1,
            "author": "abba77"
        },
        {
            "level": 0,
            "comment": "Wow! This is amazing! Thanks for sharing your story!",
            "score": 1,
            "author": "jizzy_mguire"
        },
        {
            "level": 0,
            "comment": "Hope you’re happy now, Adam!  Way to go!",
            "score": 1,
            "author": "vabirder",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol! PSA: always remember to look at usernames people reply to before thinking \"wtf\"!",
                    "score": 1,
                    "author": "abba77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crazy!! Nice job man!!!",
            "score": 1,
            "author": "failbotron"
        },
        {
            "level": 0,
            "comment": "This is awesome. I’ve struggled with my weight since high school but that stubborn attitude you mentioned helped me improve on myself.",
            "score": 1,
            "author": "Shock787"
        },
        {
            "level": 0,
            "comment": "This is insane! Congratulations and happy to see you regain your health",
            "score": 1,
            "author": "specialk125"
        },
        {
            "level": 0,
            "comment": "Good grief what an amazing transformation. Very happy for you sir!",
            "score": 1,
            "author": "ApolloDionysus"
        },
        {
            "level": 0,
            "comment": "You look pretty muscular for just a year of working out. That's awesome man, congrats!",
            "score": 1,
            "author": "tkdyo"
        },
        {
            "level": 0,
            "comment": "You are a badass.",
            "score": 1,
            "author": "GuacMyW0rld"
        },
        {
            "level": 0,
            "comment": "WHAT!  You are an inspiration! Amazing story ❤",
            "score": 1,
            "author": "aperez54"
        },
        {
            "level": 0,
            "comment": "Awesome work!! Are you still doing keto while building muscles? How good is it? On keto and want to start working out but having trouble finding the energy and it feels like it isn’t worth it.",
            "score": 1,
            "author": "lantmannenyo"
        },
        {
            "level": 0,
            "comment": "Well done.",
            "score": 1,
            "author": "Orbit86"
        },
        {
            "level": 0,
            "comment": "God damn, you lost almost as much weight as I weigh. That's insane.",
            "score": 1,
            "author": "360walkaway"
        },
        {
            "level": 0,
            "comment": "That's ... amazing! \n\nCongratulations.",
            "score": 1,
            "author": "MarkBoabaca"
        },
        {
            "level": 0,
            "comment": "With transformations like these. I can’t even fathom it’s the same person. You look 10 years younger!!! And holy shit you got ripped as fuck too. What a an inspiration. What was your workout routine?",
            "score": 1,
            "author": "justthetop"
        },
        {
            "level": 0,
            "comment": "Holy shit this is fucking crazy dude. So awesome! Congratulations! Curious, what's your exercise regimen like?\n\nI love stuff like this when the haters out there try to tell you that you're being unhealthy or \"gOiNg To hAvE A hEaRt aTtAck\"",
            "score": 1,
            "author": "Fupa_Defeater"
        },
        {
            "level": 0,
            "comment": "Wow",
            "score": 1,
            "author": "scratchoffqueen"
        },
        {
            "level": 0,
            "comment": "Did you ever fall of the wagon? I have a smilar amount to lose. \n\nWell done!!!",
            "score": 1,
            "author": "Toocooltocare21"
        },
        {
            "level": 0,
            "comment": "Ah, so this is the post that gets me back into the gym. Thanks buddy.",
            "score": 1,
            "author": "amusement-park"
        },
        {
            "level": 0,
            "comment": "Wow, truly inspiring!  Good job, man!",
            "score": 1,
            "author": "d_already"
        },
        {
            "level": 0,
            "comment": "Amazing!!!!",
            "score": 1,
            "author": "taytotots"
        },
        {
            "level": 0,
            "comment": "Wow, that's incredible. Congrats",
            "score": 1,
            "author": "nelli1434"
        },
        {
            "level": 0,
            "comment": "Wow amazing! Keep it up dude.",
            "score": 1,
            "author": "ZodiacK427"
        },
        {
            "level": 0,
            "comment": "Loose skin and still ripped. Bravo bruh...no excuses, love it.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "this is one of the most incredible before and afters I've seen..holy smokes! you really kicked ass and took back your life",
            "score": 1,
            "author": "Godless__Goddess"
        },
        {
            "level": 0,
            "comment": "NICE!!!",
            "score": 1,
            "author": "BobWhite783"
        },
        {
            "level": 0,
            "comment": "Wow you look amazing!! Congrats on getting your life back!!",
            "score": 1,
            "author": "OldOar"
        },
        {
            "level": 0,
            "comment": "Wow! You are amazing! Boy am I glad you shared your story. You deserve a medal! 🤗",
            "score": 1,
            "author": "KarollDBrinton"
        },
        {
            "level": 0,
            "comment": "You’re amazing OP",
            "score": 1,
            "author": "norasmom15"
        },
        {
            "level": 0,
            "comment": "What one piece of advice would you share that someone on the journey should know? I've lost 50 lbs do far but have at least 75 more to go...",
            "score": 1,
            "author": "fromamomof2"
        },
        {
            "level": 0,
            "comment": "Hooooly shit dude",
            "score": 1,
            "author": "flewtt"
        },
        {
            "level": 0,
            "comment": "This is amazing. You are so inspiring. Thank you.",
            "score": 1,
            "author": "socal-chicana"
        },
        {
            "level": 0,
            "comment": "Those muscles are ketogains?",
            "score": 1,
            "author": "xkoroto"
        },
        {
            "level": 0,
            "comment": "Fucking hell. That's one of the best success stories",
            "score": 1,
            "author": "PM_ME_BBWCREAMPIES"
        },
        {
            "level": 0,
            "comment": "Great job man! You kicked ass! You're an inspiration...",
            "score": 1,
            "author": "pixiegod"
        },
        {
            "level": 0,
            "comment": "Wow..great job...you look amazing...God bless!",
            "score": 1,
            "author": "dawnnie413"
        },
        {
            "level": 0,
            "comment": "Wow man awesome.  You are rocking it.  You look\nGreat and I bet feel amazing!  So happy for you",
            "score": 1,
            "author": "jax9999"
        }
    ]
}