{
    "id": "109dnhc",
    "score": 7,
    "title": "Car repair in Harrisonburg?",
    "author": "Machipongo",
    "date": 1673465712.0,
    "url": "https://www.reddit.com/r/jmu/comments/109dnhc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Can anyone recommend a competent and trustworthy car repair place to have brake pads replaced in Harrisonburg?  Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "That's a super easy job. Whatever shop you can find in hburg should be able to do it with no issues. \n\nBut if you want a specific place, a friend of mine took his car over to Jenkins Automotive off South Main and they did a great job for him.",
            "score": 11,
            "author": "El-Jewpacabra",
            "replies": [
                {
                    "level": 1,
                    "comment": "+1 to Jenkin’s. Love them. I also went there specifically to get my brakes replaced because I thought I needed it, and they said I didn’t and recommended a way cheaper service to address the issue I had instead. Saved me a bunch of money, and I very much trust them.",
                    "score": 5,
                    "author": "toriffico",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jenkins is awful. I used to be a mechanic and my grandma was big on taking things there whenever I didn't have time, I eventually realized they were constantly screwing her. \n\nAlso once I stopped working as a mechanic, I took my car there for a state inspection and they said it failed because the headlights were illegal(they weren't) and the front brake pads failed, and they said they couldn't tell me whether the rotors were thick enough to machine because they wouldn't measure that until they take the pads off to replace. You're supposed to measure rotors as part of the state inspection. I told them I'd do the brakes myself and tried to tell them that my headlights were smoked from the factory and are DOT, and as long as they say DOT and aren't smoked after the fact then they're legal. They just kept arguing with me about the headlights and I gave up cause I needed to do the brakes anyway. Got new brake pads and when I went to replace them the old weren't even close to failing. I should've called Trooper Kile but I just let it go and told my family to stop going there. Everyone listened but my grandma until later I realized ways they were screwing her and explained it to her. \n\nI'd recommend Rice Tire u/machipongo if you don't know how to do it yourself. If you were able to do it yourself I'd suggest doing that and taking the rotors to O'Reilly's to have them machined. It's only $10 and usually they don't even actually charge me. If you replace the pads without replacing or machining the rotors there's a good chance they'll squeak, but most shops will lie because they don't have a brake lathe and say that rotors nowadays are too thin to machine.",
                            "score": 2,
                            "author": "jmc7721"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "Machipongo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've always had good experiences with Car ER on market street",
            "score": 7,
            "author": "joel1A4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "Machipongo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Over by the townie Walmart, there's a shop called Shenandoah Auto. i've been there a couple times and they always treat me right",
            "score": 7,
            "author": "nhvfx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "Machipongo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CAR-ER",
            "score": 3,
            "author": "jayroo210"
        },
        {
            "level": 0,
            "comment": "Route 11 or Heishman (Blue Ridge Tire)!",
            "score": 3,
            "author": "brady_bunch99"
        },
        {
            "level": 0,
            "comment": "I agree with the others that you can get brake pads done pretty much anywhere. If Precision Tune Auto is still down South Main off Pleasant Hill, they were great for larger repairs. I did some stupid things to my first car and they were great with reasonable rates - would tell you honestly if after-market parts were realistic or available for your car/issue.",
            "score": 2,
            "author": "zestytwirls"
        },
        {
            "level": 0,
            "comment": "If you’d prefer to go to a small business mechanic type place, check out Fairview Auto Services &amp; Repair in Mt. Crawford. They’ll do you right and you can trust that it’s a good price",
            "score": 2,
            "author": "kporter5301"
        },
        {
            "level": 0,
            "comment": "i believe they replace brake pads, but check with Mr. Tire on east market st. my friend works there and i genuinely won’t trust anyone else with my car.",
            "score": 1,
            "author": "strawberrysully"
        },
        {
            "level": 0,
            "comment": "Try Route 11 auto, they’ve always been very helpful to me and explain everything without judgement. Very nice people, mechanics are very skilled. Reasonable pricing. Won’t do more than you’re okay with, and offer great advice. Had a different place (Mr. Tire: AVOID!) fuck up my lug nuts on my tire and route 11 took them out and re-torque them free of charge.",
            "score": 1,
            "author": "Stinkymonkybutt"
        },
        {
            "level": 0,
            "comment": "If you have a German car take it to mid Atlantic motorwerkes. They’re great over there had a lot of work done",
            "score": 1,
            "author": "GovernorGuyFieri"
        },
        {
            "level": 0,
            "comment": "I would check with your car insurance",
            "score": -2,
            "author": "ImMrAllStar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you mean check with them for a place to get repairs?",
                    "score": 1,
                    "author": "Machipongo"
                }
            ]
        }
    ]
}