{
    "id": "10ldaqv",
    "score": 3,
    "title": "Deferred questions",
    "author": "Athenian_1924",
    "date": 1674689624.0,
    "url": "https://www.reddit.com/r/jmu/comments/10ldaqv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied to JMU during EA. I found out that I was deferred and accepted at Christopher Newport University. This crushed me because JMU was the college of my dream and it fit me well. (I hve no problem with CNU) I learned that being deferred isn’t necessarily a bad thing from you guys. I just want to know my chances of getting in after being deferred. I know you guys are not the admissions department, (which btw I did email the admission department) but I know some of you were deferred but later accepted.)Could you guys guide me? I might be a little lost. \nTysm!! \n\n-3.6 GPA\n-3 AP classes\n-4 honors classes\n-President of Model United Nations\n-Part time job for 2 years \n-Feed homeless \n-Cultural Dancer \n-Veteran Clarinet Marcher \n[always had A’s // couple B’S]\n-Speak 3 languages",
    "comments": [
        {
            "level": 0,
            "comment": "I feel like a ton of people got deferred with similar and even better than stats than yours, so I wouldn't worry too much about it. If JMU is your dream college than I don't see no problem waiting, however if cost is a major concern than I would recommend the CC route.",
            "score": 5,
            "author": "Ama-4538"
        },
        {
            "level": 0,
            "comment": "I’d wait it out and worst case start at CNU then transfer. I met a lot of students during the tours who were really proud of transferring in and seemed quite happy.",
            "score": 5,
            "author": "LoveLaughShowUp"
        },
        {
            "level": 0,
            "comment": "Think you have an above average chance to get in. I'd wait it out, and update them with any improved grades or other significant positives since your original application, as a show of your continued and sincere interest. Good luck!",
            "score": 3,
            "author": "jpmGBRfan1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you recommend me sending in another transcript with new and improved grades?",
                    "score": 2,
                    "author": "Athenian_1924",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're grades/gpa improved since you submitted your EA, especially with any AP courses included, then I'd definitely consider it, along with a statement that JMU continues to be your top choice, etc... Talk to your school guidance counselor and see what he/she recommends, but I certainly don't think it'd hurt. Good luck!",
                            "score": 2,
                            "author": "jpmGBRfan1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tysm!!!",
                                    "score": 2,
                                    "author": "Athenian_1924",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure thing. Stay positive and confident in yourself. It'll all work itself out. You'll end up where you're meant to be. Just make the most out of it where ever that is. All the best!!",
                                            "score": 2,
                                            "author": "jpmGBRfan1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Send an interest letter stating why you want to still go there!",
                            "score": 1,
                            "author": "Aggressive_Corgi4216"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will get in 100% at regular decision",
            "score": 3,
            "author": "TBrooks821"
        },
        {
            "level": 0,
            "comment": "I know lots of people myself included who didn’t get in EA but got in regular. I even know people that got in off the waitlist as late as June.",
            "score": 3,
            "author": "RVA-Jade",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry to reply late but did u hear back early April or mid March during regular decision after being deferred?",
                    "score": 1,
                    "author": "Athenian_1924",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "During regular decision. When I didn’t get in EA I applied to VTech regular decision and heard back (accepted) before JMU.",
                            "score": 2,
                            "author": "RVA-Jade"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’ll get in",
            "score": 2,
            "author": "hahajjajuin"
        }
    ]
}