{
    "id": "113w6k9",
    "score": 10,
    "title": "Visiting for CHOICES",
    "author": "Connect_Studio_74",
    "date": 1676568941.0,
    "url": "https://www.reddit.com/r/jmu/comments/113w6k9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all. I am attending the accepted freshman CHOICES this weekend and will be in town a day early. I am not from the area or even the state. Looking for info on off-campus dining/shopping/bars...is there an area close to campus that I should check out while I'm there? Also, would love any food recommendations that I shouldn't miss and anything on campus/in the area that would be a must-visit. Thank you all so much!!!",
    "comments": [
        {
            "level": 0,
            "comment": "For off campus dining, what are you looking for? Something unique to Harrisonburg? Familiar but new? A good cheap Chinese place? \n\nIf you’re looking for something to do off campus and the weather is nice, go walk around downtown! There’s tons of little shops so you’ll for sure find something for you.\n\nPersonally I’d say visit Mashita, it’s an Asian fusion restaurant that I think is the best restaurant in Hburg, but some of their dishes aren’t to everyone’s tastes. \n\nLmk if you have any questions and I hope you pick JMU :)",
            "score": 10,
            "author": "Khepri64",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the reply! Definitely gonna check out Mashita. :)",
                    "score": 5,
                    "author": "Connect_Studio_74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s also a great Vietnamese place called Thien an Pho",
                            "score": 6,
                            "author": "knopflerpettydylan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re in the mood for tacos you should get Magnolias or for a burger and fries do Jack Browns (both in downtown which you should visit if you can!) If you want a quick sandwich or bagel to start the day go to Mr. Jays! For a nicer dinner of delicious pasta Vitos. For a banger grilled cheese sandwhich go to Grilled Cheese Mania. For a sweet treat, go to Kline’s they have incredible ice cream! There’s a ridiculous amount of good food in Harrisonburg and places that aren’t large chains. \n\nI would recommend if you have a chance to wander campus unguided, go to the quad and walk. See how the campus is on a typical day. Go to Downtown Harrisonburg (a short walk from campus) and wander a little! There’s a lot of restaurants and little shops in downtown. Go to the academic building your major is housed in (you can find that info on the JMU majors site, or just ask here and someone can help find it) and sit and observe what it’s like. JMU is pretty easily walkable using Google/Apple Maps so you can put stuff in and follow directions. Explore where you feel you need to, CHOICES is a great way to learn about the school and what it’ll look like to go, but you don’t get much of a chance to explore or see students being students. \n\nI graduated last May and miss JMU everyday. I hope JMU is the right pick for you because there’s no place like it in the world :)",
            "score": 9,
            "author": "Lavender-buns",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Awesome recommendations all around. I'm starting to wish I had more time to visit :)",
                    "score": 3,
                    "author": "Connect_Studio_74"
                },
                {
                    "level": 1,
                    "comment": "I second the Grilled Cheese Mania suggestion. Their sandwiches are the bomb.",
                    "score": 2,
                    "author": "Pims8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And definitely check out the student recreation center.  It made a huge impression on my kid.  And the dining halls at JMU are pretty darn good compared to another nearby Virginia school family members have attended.",
            "score": 7,
            "author": "HappyCava"
        },
        {
            "level": 0,
            "comment": "Billy Jacks is great!",
            "score": 2,
            "author": "danielle_posey"
        },
        {
            "level": 0,
            "comment": "More casual place that I stopped at when I came here for the first time would be Benny sorentinos. Pizza slices bigger than your head",
            "score": 1,
            "author": "Raichu76"
        },
        {
            "level": 0,
            "comment": "How'd your visit go? Go Dukes!",
            "score": 1,
            "author": "jpmGBRfan1",
            "replies": [
                {
                    "level": 1,
                    "comment": "So great! Loved it! Most of the restaurants were kinda packed, but we found some great places. Thinking I’ll be back in the fall 😊",
                    "score": 3,
                    "author": "Connect_Studio_74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome. Congratulations!",
                            "score": 1,
                            "author": "jpmGBRfan1"
                        }
                    ]
                }
            ]
        }
    ]
}