{
    "id": "11x0lo1",
    "score": 3,
    "title": "freshman dorms",
    "author": "Cozijozi",
    "date": 1679356676.0,
    "url": "https://www.reddit.com/r/jmu/comments/11x0lo1",
    "media_urls": [],
    "other_urls": [],
    "postText": "can i get everyone’s opinion on which freshman dorm is the “best” overall? between village, hillside and bluestone.",
    "comments": [
        {
            "level": 0,
            "comment": "There is a lot of nuance in this conversation, but I'll try my best to answer. For your information, I worked in residence life and lived on campus all four years (albeit three out of the four years I lived in Bluestone).\n\nThe main questions people should really focus on are:\n\n1. **What's your major?** Will most of your classes be on main campus? East campus? Anything happening in Memorial hall? This can be a major influence in where you want to live. Living on the same side as your classes is incredibly helpful, especially if you have early morning classes OR you would like to go back to your room between classes.\n2. **How close to you want to be around the main student population?** Do you wanna be in the thick of it on the quad? Bluestone is for you! What about being more involved with things like pickup basketball or volleyball? Then maybe you should pivot the Village. Hillside gives you the opportunity to be close to both things, albeit with must smaller rooms. I lived in skyline and didn't really feel that sense of community outside. East campus wasn't really a top \"hang out\" spot. \n3. **What sort of relationships are you looking for?** Nothing - and I mean nothing - brings people together quite like a lack of AC. With the amount of people who complained about no A/C in their rooms, a majority of them won't shut up about the relationships they made within their residence halls. It helps that the first couple weeks are super hot, so everyone is hanging out in the Village/Lakeside lounge for some reprieve. Then voila, you're forced to meet people! This isn't to say you cannot make these type of friendships in Bluestone, but misery loves company.\n4. **Are you willing to sacrifice A/C?** To go a bit further, this ultimately comes down to what you're willing to sacrifice. I had the pleasure of having A/C all four years of college. Many of my friends lived in the Village (willingly!) for at least two years. I know some people who could put up with it once, but then they just wanted A/C so they didn't have to worry about getting too hot. I can promise you that you will survive without A/C. Prioritize it however you want.\n\nUnsure if this helps with anything. Bluestone is great because you're close to the Quad, have A/C, and get to experience what's so endearing about JMU. Hillside is close to everything, hall style bathrooms (see more people!), and right next door to food! No friendships can compare to those of Lakeside and the Village. Skyline is nice, somewhat bougie, close to food, and you get great scenery. No matter where you live, it doesn't mean you're confined to those walls. Find some friends in your classes and hang out with them!",
            "score": 5,
            "author": "lilmissellen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are business, econ, and general education classes mostly on main campus or east campus?",
                    "score": 1,
                    "author": "GreenForestWalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of the humanities classes are on main campus. Most business and econ classes will stay in Lakeside, although there is a possibility of gen-ed econ classes to be in some mega classroom on main campus. If you take any science classes, those will likely be East Campus. Sometimes you'll have the dreaded walk all the way to Memorial (please just take the bus).\n\nI am also five years removed from JMU at this point (\\*cries\\*), so feel free to take this with a grain of salt.",
                            "score": 2,
                            "author": "lilmissellen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much!",
                                    "score": 1,
                                    "author": "GreenForestWalker"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bluestone is the nicest of those three &amp; would be closest to your freshman classes. Hillside and Village are much older and definitely aren’t as nice, but they are in a good location for classes &amp; food. I would recommend looking at bluestone or possibly skyline if you don’t mind walking/taking the bus. Skyline has the nicest dorms by far, but they aren’t in a good location for most classes. Lakeside is a no",
            "score": 7,
            "author": "MegaMantis75",
            "replies": [
                {
                    "level": 1,
                    "comment": "how’s the social life in bluestone tho?",
                    "score": 2,
                    "author": "Cozijozi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From my understanding it’s pretty good, it’s nothing compared to the village though (which can be a good thing). Skyline probably has the worst “social life” but overall you should have a good experience wherever you decide to live. Just know it’s never really quiet in the village.",
                            "score": 1,
                            "author": "MegaMantis75"
                        },
                        {
                            "level": 2,
                            "comment": "pretty shit you get stuck with all the weirdos and band geeks. If you want social life live in the village or hillside",
                            "score": 1,
                            "author": "EnvironmentalGrab419",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what about skyline?",
                                    "score": 1,
                                    "author": "Defiant_Pay7036"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where are most of the freshman classes located?",
                    "score": 1,
                    "author": "GreenForestWalker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in White Hall in the Village my freshman year. Absolutely nothing fancy about those dorms but I do look back on those semesters positively. Maybe my standards are low, but aside from the bathrooms (2 showers / 2 toilets - shared by 12 people) and the lack of functioning A/C, I thought it was an okay experience. Walls are thick enough to muffle the sound of near-constant partying in the Village, meaning there's no lack of a social scene. The Village is pretty much dead center of the entire campus so I rarely had to rely on the overcrowded bus system to get to classes.",
            "score": 2,
            "author": "UnusualGrunt_3"
        },
        {
            "level": 0,
            "comment": "The only good thing about the village is the location. It's between the quad and east campus. Everyone parties there. The fire alarm went off a lot. The bathroom are not that nice. the dorm has suites. I've heard hillside is similar to the village. My friend lives in Hoffman hall, which is in bluestone. The rooms are nice.",
            "score": 1,
            "author": "flutiful_fiona",
            "replies": [
                {
                    "level": 1,
                    "comment": "can u go into more detail about hillside?",
                    "score": 1,
                    "author": "Defiant_Pay7036"
                }
            ]
        }
    ]
}