{
    "id": "12cr156",
    "score": 25,
    "title": "Ranking JMU Dorms",
    "author": "MegaMantis75",
    "date": 1680714478.0,
    "url": "https://www.reddit.com/r/jmu/comments/12cr156",
    "media_urls": [],
    "other_urls": [],
    "postText": "&amp;#x200B;\n\nHi everyone, I was bored so I decided to make a list ranking the best and worst dorms at JMU. Hopefully, this will be helpful to the students currently looking for housing next semester!\n\n&amp;#x200B;\n\n1. **Paul Jennings** \\- Paul Jennings is the newest dorm located on East Campus right behind UREC. It is by far the nicest dorm on campus since it brands new with awesome amenities such as private community bathrooms and a convenience store on the first floor for students. PJ is far away from basically everything so you have to be prepared to take a bus or walk. Overall, I would highly recommend students look at this dorm, although the chance for any freshman to get a room is pretty slim.\n2. **Skyline Dorms** \\- although Location is an important factor when picking dorms, the East Campus dorms are just better. Skyline dorms are also decently new dorms that are right across from E-Hall, which has the best food on campus (not a debate). They have community-style bathrooms that are actually pretty nice, and the dorm rooms are nice and spacious. Skyline is close to the science/engineering buildings, but pretty far from Main Campus, so be prepared to take the bus!\n3. **Bluestone** \\- Bluestone dorms are right in the middle of Main Campus, so no bus taking will be necessary. Bluestone dorms are also very close to the dining halls and everything else on Main Campus. Most of the Bluestone Dorms have AC and have Jack and Jill bathrooms with another room (4 people per bathroom). Not all Bluestone Dorms are made equal, so know what you’re picking (Hoffman is the best)\n4. **Hillside** \\- Now we start getting into the Bottom half of JMU dorms. Hillside is basically the older version of Skyline on Main campus. Hillside is in a decent location in terms of food and main campus classes, but the dorms themselves aren’t in the best shape. I would recommend checking out JMU’s website for photos/videos so you know what you’re getting into. These dorms do have AC and are close to the basketball courts, but it's a decent trip to UREC.\n5. **Village** \\- The village is a highly “controversial” dorm, you will either have a horrible time or an amazing time. I did not have an amazing time which is why I ranked it so low. The village is made up of a bunch of suite-style dorms with semi-private bathrooms, but don’t let that fool you. The village is the oldest set of dorms on campus and it shows. There is AC in the common rooms ONLY, and the Clothes washing situation SUCKS. The village is also the party area of JMU, so be prepared. But, the water does taste really good (Idk why). IMPORTANT - IF YOU GO VILLAGE YOU WILL GET SICK AT SOME POINT.\n6. **Lakeside** \\- Lakeside is the last resort area, don’t pick this on purpose. There are no redeeming qualities about Lakeside other than its proximity to COB and the friends you will make along the way (you will bond through shared suffering).\n\nOverall, definitely research the dorms you want to live in and make the right choice, housing is VERY IMPORTANT, especially if you’re a freshman. It has a huge impact on your college experience so make sure to do your due diligence before selecting a dorm. JMU has great resources for figuring out which dorm will be the best fit for you",
    "comments": [
        {
            "level": 0,
            "comment": "As a COB student, Lakeside would be 5th or 4th. I know you mentioned that but it's location was a huge plus and can't be overstated if you have a lot of classes in COB.",
            "score": 13,
            "author": "Evancolt"
        },
        {
            "level": 0,
            "comment": "Whatever you do don’t go village first floor half the freshman on campus will see into your room whenever your blinds are up",
            "score": 9,
            "author": "InstaNormie0",
            "replies": [
                {
                    "level": 1,
                    "comment": "They also knocked on my window constantly",
                    "score": 7,
                    "author": "holiestcannoly"
                },
                {
                    "level": 1,
                    "comment": "nah that’s how we made new friends and heckled people",
                    "score": 1,
                    "author": "ableague"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey guys I’m a transfer coming next fall, any idea where most transfer students end up at?",
            "score": 3,
            "author": "anoym88",
            "replies": [
                {
                    "level": 1,
                    "comment": "You get to choose where you live (not sure when) but you will most likely have the options of Skyline, Hillside, Village, and Lakeside",
                    "score": 1,
                    "author": "MegaMantis75"
                },
                {
                    "level": 1,
                    "comment": "You're not guaranteed housing, so be prepared to find an apartment. That's what I had to do when I transferred.",
                    "score": 1,
                    "author": "Laesia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "freshmen r guaranteed housing",
                            "score": 0,
                            "author": "Defiant_Pay7036",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But this is a transfer coming in the fall, I assume they aren't a freshman.",
                                    "score": 1,
                                    "author": "Laesia",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oh sorry didn’t see that",
                                            "score": 1,
                                            "author": "Defiant_Pay7036"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Village is definitely the way to go. Hands down best location on campus, doesn’t take longer than 15 minutes to get anywhere on campus plus the suite style dorms help you make friends and make your rooms feel bigger than they actually are. People complain about the ac but it’s only hot for like 2-3 months throughout the year. Everyone just keeps their door open and the ac in the suite flows into the rooms.",
            "score": 3,
            "author": "Material_Guitar_4816",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is very dependent on your suite-mates and who you share a bathroom with. I had an awful time. \n\nHalfway through the first semester there were beer cans in the toilets every Friday night that lasted until cleaning on Monday. My suite mates joined a frat together and were super cliquey and my roommate was addicted to coke.\n\nI’ve had a great time at JMU, but living in the Village was one of the worst times of my life. What I listed isn’t a third of what I dealt with. Being in the village is incredibly dependent on getting along with the 4-5 randoms in your suite, and hoping the other 6 sharing a bathroom with you are decent humans.",
                    "score": 3,
                    "author": "erbii_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Second this. The location is great because everything is in walking distance but I absolutely hated the village. The bathrooms were so fucking dirty over the weekend because housekeeping only came on weekdays. I remember I had to use other bathrooms throughout the dorm because I couldn’t stand to piss in front of a pile of puke. \n\nThe village is great if you like partying every weekend/weekday but I personally couldn’t stand it. I’m a senior now and I know for a fact that half of the people on my floor are actually graduating on time and that’s because they got caught up with those lame ass dorm parties.\n\nAnother thing that really pissed me off was the fact that my room and board was the same as someone who lived in Jennings or on east campus. It’s a total rip-off. Sure, the village has AC now but everyday I woke up trying to avoid catching the bubonic plague or trench foot from the mysterious substances that bred throughout the bathrooms. Meanwhile, that same rate is the equivalent of living in a hotel at Jennings.",
                            "score": 2,
                            "author": "grandadsfearme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude I slept in my friends’ dorm (Huffman) when they had AC for like 2 weeks in my first semester because even with 3 fans going and windows open our room got to 100 degrees. I’d go to sleep and wake up in a fucking puddle",
                                    "score": 1,
                                    "author": "erbii_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I lived in weaver and those dhall shits hit different when you ran up that hill in the village 😭",
                                            "score": 1,
                                            "author": "grandadsfearme"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The location is nice but that's basically all that the village has going for it. The buildings are old and should've been torn down years ago. If you get bad suitemates it is going to suck, and even if you get good suitemates, the bathroom situation could still be terrible. Housing costs the same no matter where you go so why choose a place that you know isn't nice + risk getting bad suitemates vs choosing a location that is nice where you don't have to worry about suitemates? Not to mention East Campus as a whole has a much better vibe than Main Campus (Village area) although that's just my opinion.",
                    "score": 1,
                    "author": "MegaMantis75"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived in the village and made lifelong friends. We still text all day every day even 6 years after graduation. If you luck out with the people on your floor there’s no better dorm to be in",
            "score": 1,
            "author": "jsm757"
        },
        {
            "level": 0,
            "comment": "If you complain about not having AC in village your a pussy. I lived there freshman year and it was the best time of my life. Throw a box fan on the window and your living like a doctah.",
            "score": 0,
            "author": "Cigarguy69_"
        }
    ]
}