{
    "id": "12dk6og",
    "score": 3,
    "title": "Madison Award for Academic Excellence",
    "author": "CrazyTownVA",
    "date": 1680787283.0,
    "url": "https://www.reddit.com/r/jmu/comments/12dk6og",
    "media_urls": [],
    "other_urls": [],
    "postText": "Morning all,\n\nMy daughter is currently a Junior in high school.  She has aspirations to be a teacher and JMU is her #1 choice.  We've visited several times and she loves everything about the school.  She was accepted to the JMU Summer Honors program and will be attending this summer.\n\nIt's unlikely that we will get anything in terms of financial aid, and I would love for her to graduate with no loans. (Teachers don't get paid enough- adding student loans to a teacher's salary would make for a tight budget)\n\nI'm looking for any insight others may have about the Madison Award for Academic Excellence.  Specifically, is there anything she can do to increase her chances of receiving the award?\n\nShe currently has a 4.40 weighted GPA.  She has a successful business (with many happy customer reviews on her business's FB page), and is in the National Honor Society at her school.   One of her biggest accomplishments is that she will soon receive the equivalent of the Eagle Scout award of the scouting organization (not Boy Scouts) she belongs to- a really big deal with a lot of time and effort.  She has been part of the organization for 12 years.  She has a ton of volunteer and community service hours and has already spent a significant amount of time in the classroom at our local elementary school as part of a \"future teacher\" program that is offered at her school.\n\nI think the decision on who gets the awards is left up to the individual school.   I was thinking maybe a meeting with the Dean of the School of Education would be a good idea?  It gives them the opportunity to get to know her as a person, not just from her application.\n\nThanks in advance for any comments or thoughts.\n\nGo Dukes!",
    "comments": [
        {
            "level": 0,
            "comment": "Congratulations to your daughter! She sounds like an amazing kid! My son is a freshman and received this award - we were so thrilled. But you are correct- it is chosen by the school and there is nothing to do to further apply. Personally I think your daughter has an excellent chance of receiving this based on her merits- she will stand out no matter what. It can’t hurt to have her share that it is her number 1 choice too. Fingers crossed for your family - and yes. Go Dukes!!!",
            "score": 9,
            "author": "Simple_Character7890",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great feedback.  Thank you.  Congrats to your son.   Can you tell me roughly when he found out he received the award?",
                    "score": 1,
                    "author": "CrazyTownVA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was the last week of March. My son still isn’t sure how many others receive it (or the Dingledine) - maybe is varies year to year?",
                            "score": 3,
                            "author": "Simple_Character7890"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! Current Dingledine scholar here—I believe that the number of Dingledine scholarships (100% in-state tuition) has been significantly reduced *but* there are more opportunities to receive a Madison Award (75% in-state tuition). If your daughter is interested in a STEM major, the Second Century Scholarship may be worth looking into but I believe the \"regular decision\" deadline may have already passed since it's now April.\n\nAs for decisions, releases will vary yearly but I was notified of my scholarship in late March of my application.",
            "score": 7,
            "author": "phillygirl2702",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the feedback and congratulations on your scholarship. Amazing.  STEM is just not something that interests her. She truly has a passion for teaching.  She's still a Junior and won't be applying until the fall- hopefully in about a year we'll know. Thank you!",
                    "score": 1,
                    "author": "CrazyTownVA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "While in your eyes it feels like the right thing to do because you have always been ready to go to bat for your child, professors view students as adults and expect them to advocate for themselves. \n\nThink back to your last job interview- do you think you would have still received an offer if your mom was also in attendance and bragged about your accomplishments to the interviewer while you sat there quietly? That cringe you felt at the image is the exact same reaction every professor feels when a parent reaches out to discuss their student.\n\nThe great thing is, college is the perfect place to practice self advocacy, fail, get back up, learn from mistakes, and try again with low stakes. Your new role in your child’s life should be more of a counselor- listen to them vent, provide them with advice, and encourage them the entire way. This will pay dividends by graduation as your student will be more confident/competitive during job interviews and more resilient whenever things don’t pan out the way they hoped.",
            "score": 7,
            "author": "RedboneTruck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the feedback, but I have no intention of being involved in setting up or being a part of the meeting if it were to happen.",
                    "score": 2,
                    "author": "CrazyTownVA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Love that approach. Wishing y’all the best in securing all the necessary scholarships and aide.",
                            "score": 3,
                            "author": "RedboneTruck"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Current recipient of the Madison Award here! At least when I was applying (I'm class of 2024), this is the way it worked: my GPA, essays, and recommendations meant I qualified for the award, along with seven other students in my major. The school basically gave the list of the seven to the music faculty and said \"pick two students to nominate.\" Because I had met with the music faculty before, they recognized my name and decided to nominate me.\n\nDepending on your daughter's major, the nomination process might work differently, since not all departments have students declare their majors in freshman year like the music school does. However, if your daughter does know what major she is interested in, it would be helpful to have her introduce herself to the professors in that department. It's also important that SHE be the one to email/call/talk to the professors and faculty, as tempting as it may be for you to do it! Professors definitely remember which students were the ones to advocate for themselves and appear professional.",
            "score": 3,
            "author": "Puzzleheaded_Box_840",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great feedback. Thank you so much.\nAnd congrats on your scholarship!",
                    "score": 2,
                    "author": "CrazyTownVA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "JMU college of education also has undergraduate and graduate scholarships offered every year that students can apply to. I came in my freshman year with no scholarships, applied to the COE ones every year, and during my last year of undergrad I was fortunate enough to receive two scholarships. I think the scholarship amount totaled to around 10-12k. Definitely more opportunities to apply to if your daughter does not receive that one.",
            "score": 2,
            "author": "sparkle_water26",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great feedback. Thank you. Congratulations on your scholarships!",
                    "score": 1,
                    "author": "CrazyTownVA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "the centennial scholars program offers a full ride scholarship covering tuition, mandatory fees, food, and housing. it’s for first gen/low income (under 60k) students. i received it as an upcoming freshman! she should look into it!",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the feedback, but based on the criteria you mention this would not be a good fit for her.",
                    "score": 1,
                    "author": "CrazyTownVA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like you already received amazing feedback! Just wanted to say I definitely was not as qualified as your daughter when I applied but still received the scholarship. Good luck!",
            "score": 2,
            "author": "Nightmist515"
        },
        {
            "level": 0,
            "comment": "Hiya! What does your daughter plan to major in? From what I understand, something that will help is to just get more involved with her department, and make her face known. \n\nI’m an incoming freshman planning to double major in performance and studio art, and I have a 3.9 weighted GPA coming out of high school. I was able to receive this award after having a really successful portfolio review, so I think a big part of it is definitely meeting her department and making herself known. I’m not sure what it would translate to in terms of what your daughter wants to major in, but maybe it means connecting with a teacher to sit in on a class, taking a tour around her intended facility, what ever she can do to give a face to her name. \n\nOne thing to note though, I do agree with everyone else’s responses regarding how involved you should be in this process. Having gone through it all already, I did the things that got me my scholarships completely by myself. Granted they were both sort of audition scenarios where I were forced to be alone, but I impressed them, not me paired with my parents. The times that my parents were more involved with meeting my professors, I felt like they were talking over me when I really wanted to make a good impression. \n\nSo yeah, definitely look into ways that you can start getting involved in JMU functions, find some classes to sit in on, meet teachers! Also you should definitely tour the campus if you haven’t yet, it’s a great campus! Good luck to your daughter, she’s going to have a great time at JMU!",
            "score": 1,
            "author": "watercolorsoda"
        },
        {
            "level": 0,
            "comment": "My daughter received it this year, but I'm not really sure what made her stand out. She is planning to double major in Media Arts and Marketing. She did EA for her application and found out about the award atvtge same time with her acceptance to JMU, in January.",
            "score": 1,
            "author": "Familiar-Clerk-3048"
        }
    ]
}