{
    "id": "12zy3xq",
    "score": 4,
    "title": "WRTC professors",
    "author": "Confident-Fig-5325",
    "date": 1682539488.0,
    "url": "https://www.reddit.com/r/jmu/comments/12zy3xq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve heard that students are taking issue with WRTC faculty, I was just wondering what happened/what triggered that? Does anyone know?",
    "comments": [
        {
            "level": 0,
            "comment": "One of my WRTC Professors hasn’t graded anything since March 10th and nobody in class knows if we’re passing or not lol",
            "score": 10,
            "author": "JEBERNARD",
            "replies": [
                {
                    "level": 1,
                    "comment": "how can you not know if you're passing? don't you have a pretty good sense of whether the work you've turned in is quality work? \n\nthe irony is that the very same kids who bitch about grades and how awful and unfair they are and how much stress they cause beg and plead for...you guessed it...grades. make up your mind...or at least TRY to be consistent",
                    "score": -1,
                    "author": "halfdansk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can’t “know that you’re passing” if you don’t have all of the grade data available to calculate. As a student, one expects all of their submitted work to be their best effort possible in order to receive the highest score possible. I’m sure that you’ve taken tests thinking that you definitely got an A but when it was returned, the grade was something lower than you expected like a C or D. \n\nIf the professor was grading assignments in a timely manner, then I could make adjustments if I received a low score on something. The problem with professors not grading assignments is that they’ll upload everything towards the end of the semester when it’s too late to try and save your grade/get tutoring.",
                            "score": 3,
                            "author": "JEBERNARD"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had Michael Hickman last semester for WRTC and he was hands down one of the best professors I’ve ever had.",
            "score": 9,
            "author": "Indepen_Cali_Motel"
        },
        {
            "level": 0,
            "comment": " I had Michael Smith and he was very nice. A lot of students took issue with his grading on RMP but I turned in my first attempts and consistently got a B+. People are horrible about writing grades at JMU. None of the professors marked as harsh graders ever are, it’s astounding what people turn in at the college level.",
            "score": 9,
            "author": "_banking",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I definitely agree with that",
                    "score": 2,
                    "author": "Confident-Fig-5325"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure. I had ~~Schulze~~ Beck for WRTC and he was one of the better professors I’ve had here. Very punctual grader, incredibly light workload, and the actual class period itself wasn’t boring either\n\nEdited because I’m a moron🤣",
            "score": 2,
            "author": "igonnawrecku_VGC",
            "replies": [
                {
                    "level": 1,
                    "comment": "who?",
                    "score": 0,
                    "author": "halfdansk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m a moron. Schulze was my AP Capstone teacher in high school🤦‍♂️😂. I had Beck🤣",
                            "score": 1,
                            "author": "igonnawrecku_VGC"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sure don't, I graduated in 02... but 🍿",
            "score": 4,
            "author": "jgo3"
        },
        {
            "level": 0,
            "comment": "Damn never knew that was happening I have Marafino rn and hes so cool",
            "score": 1,
            "author": "skydk_",
            "replies": [
                {
                    "level": 1,
                    "comment": "never knew WHAT was happening? (see above comment about 'what ppl turn in at the college level')",
                    "score": 0,
                    "author": "halfdansk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I meant I never knew that students were taking issue with the WRTC faculty. Maybe it’s because I don’t have social life but who in reddit does🤷🏻",
                            "score": 1,
                            "author": "skydk_"
                        }
                    ]
                }
            ]
        }
    ]
}