{
    "id": "13g08fi",
    "score": 2,
    "title": "honors/ haynes scholars residential learning community",
    "author": "Defiant_Pay7036",
    "date": 1683933146.0,
    "url": "https://www.reddit.com/r/jmu/comments/13g08fi",
    "media_urls": [],
    "other_urls": [],
    "postText": "are there any freshmen or students in general in either of these?? i wanted to live in hillside, which honors gives me first choice, but if i do haynes scholars residential too i have to live in blue stone in suite style. what are your guys’ experiences on these?",
    "comments": [
        {
            "level": 0,
            "comment": "I just moved out of bluestone yesterday and overall it was a really good experience! It’s super close to any main campus classes, so if you’re taking a lot of gen-ed’s then it makes sense. If you’re coming in with credit and plan to take any stem classes then I would suggest Shanendoah or a dorm on east. Definitely depends on ur major but in general as a freshman, Bluestone is one of the best options in my opinion. Also Hillside (I believe) has you sharing a bathroom with 6+ people, Bluestone you just share w your roommate and 2 others so it’s significantly more convenient imo!",
            "score": 1,
            "author": "mrynne1",
            "replies": [
                {
                    "level": 1,
                    "comment": "i wanted the hall style bc the bathrooms r cleaned daily and i don’t have to do it and also it’s easier to meet new people, and what if i don’t like my suite mates. but i really want the math class in cohorts because i feel like that will be super helpful for me",
                    "score": 0,
                    "author": "Defiant_Pay7036"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can’t get Hillside you should live in Shenandoah with the honors college! It’s a hike to main, but I loved it there. Everyone was so nice and ehall was right outside. I recommend hall 2b. One of my friends is an RA there next year. It’ll be very chill.",
            "score": 1,
            "author": "Excellent-Detail140",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you sm!!",
                    "score": 1,
                    "author": "Defiant_Pay7036"
                }
            ]
        }
    ]
}