{
    "id": "13qa946",
    "score": 8,
    "title": "Laptop for Geography program",
    "author": "SendMechanicalHelp",
    "date": 1684900347.0,
    "url": "https://www.reddit.com/r/jmu/comments/13qa946",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\nIm an incoming freshman majoring in geography (doing the AGIS concentration) and currently looking for a laptop. Since GIS is a pretty heavy program I know I’ll need a fairly good laptop. Since there’s only two models recommended on the JMU website I’ve been looking other places for other options. Does anyone have any experience with the GIS programs as part of the major and have recommendations for laptops or specific specs to include when searching? \nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "The graphics card in your laptop will decide more on how your ArcGIS experience is than just about any other factor. Unfortunately version 3.x of ArcGIS still cannot take advantage of multiple cores or any of the higher end processor designs that allow for multi-threading etc. This will likely change in future versions of their software. If you can, buy a laptop with at least a terabyte SSD. I would not recommend less than 16GB of RAM for any current laptop. Oh and if you can, stick with Windows 10 for now. Win 11 is still kind of trash...\n\nSource: I work here as one of the tech coordinators for a different part of CSM but we also use ArcGIS 🙂",
            "score": 5,
            "author": "ALCO251",
            "replies": [
                {
                    "level": 1,
                    "comment": "Additionally, walk right on past Apple products. Technically you can install Arc on a Mac, but it adds extra hoops to a process that is already a pain to get through. \n\nIf you think you’ll be doing a lot of raster and LiDAR processing, plan on having an external drive on-hand. A 1 TB harddrive will be great for doing your work, but keeping data for later will start to chew through your space really quickly.",
                    "score": 3,
                    "author": "GuestCartographer"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the information! Is there a certain level of graphics card I should shoot for? Like no lower than the 3060? (just using that as an example, not sure if it’s actually the minimum or not)",
                    "score": 1,
                    "author": "SendMechanicalHelp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most any current production GPUs other than the low level onboard GPUs( think Intel) should be fine. ArcGIS themselves make their requirements very vague,for good reason. It will work on anything, but it will work better/best on higher end machines. I'd recommend you look at a Dell Latitude at minimum or Precision mobile workstation if your budget allows. I'll check one of our machines here that's running ArcGIS in a classroom setting in a Dell OptiPlex AIO with an nVidia GPU and let ya know.",
                            "score": 3,
                            "author": "ALCO251",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Latitudes are definitely appealing price wise but I worry that I’ll buy one now and need upgrade not long after, so I’ll probably shoot for higher end within budget.\n\nDo you recommend against integrated graphics entirely? Or just lower end stuff? Thanks!",
                                    "score": 1,
                                    "author": "SendMechanicalHelp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would avoid any non nVidia or AMD/ATI graphics card for this purpose. Also make sure your processor is at least a Core i7 of some flavor in a Latitude or the AMD equivalent, I don't order AMD for our machines anymore. I use a three year upgrade cycle for each workstation. You can stretch it to the full four years you're here by buying a higher end machine this go around.",
                                            "score": 1,
                                            "author": "ALCO251"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Graphics card AND processor. ArcGIS and all mapping products are essentially giant statistics software performing billions of operations - that’s mainly your processor.\n\nAlso, don’t do Mac, that’s for sure. I used a Lenovo Thinkpad, highly recommend unless you want to game in which you’ll need a thicker Lenovo Thinkpad with Nvidia graphics instead of Intel.",
            "score": 2,
            "author": "Flashy-Advantage5210",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you experience any issues while running ArcGIS on the ThinkPad? I noticed most seem to have integrated graphics and I wonder how they will effect performance. Overall they seem really good quality for the price, thanks for the suggestion!",
                    "score": 1,
                    "author": "SendMechanicalHelp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a tech guy and I've used my PC throughout college so I can't speak for exactly what laptop to get. I do have a few tips though as I just graduated from the Geography program:\n\n1) I would highly recommend getting a monitor along with your laptop. Doesn't have to be anything fancy at all (I used an old small tv for a year) but having a second display makes a world of a difference when using ArcPro while also looking at lab tutorials, searching for data, or going through your files. All labs now have 2 monitors per computer and it's made doing work on campus a lot easier.\n\n2) Buy a decent external hard drive. You'll have to download a lot of data for classes, especially once you get into higher-level classes like 385, which took up 60 gigs for me. I got a 1 TB drive and I used about 700 GB just for school. Keep it pretty organized from class to class too so you don't have to search for 15 minutes to find your project. \n\n3) When you tell someone your major say that you're Geographic Science, not Geography. They changed it to Geography about a year ago and it sounds way less cool.\n\n4) Kimberly is honestly one of the best advisors at JMU. **Always** meet with her before enrolling in classes. Have some classes in mind and she'll suggest any changes you may need.\n\n5) Talk to people in classes and in the student lab room. I learned a lot just by speaking up and asking questions while working on campus.\n\nBest of luck! I loved everything about the program and the professors, they're very knowledgeable and helpful. Let me know if you ever have any questions!",
            "score": 2,
            "author": "robdykeman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve got a pc at home (not a super powerful one but I’ll be able to easily upgrade it) I wasn’t planning on bringing it my first one or two years. How arcGIS heavy is the course load in the freshman and sophomore year? Probably not too intensive since there’s a lot of Gen Ed’s right? Do you think it would be a good idea to just buy a standard laptop right now to do my other work and just bring my pc in once I get to more advanced classes? Or should I go with something a little nicer now to run even the more simple stuff and something that will probably last and hold it’s reliability all four years and further?\n\nThanks for all the tips! Good to know you’ve had good experiences with the program, I’ve heard nothing but good things about it from just about everyone and can’t wait to get started!",
                    "score": 1,
                    "author": "SendMechanicalHelp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I only used ArcGIS Pro for 2-3 classes in my first two years and I did most of my work in the labs for those. You probably won't need the pc your first year, especially since you'll be in a dorm with limited desktop space. I had a standard Lenovo that I brought into class for notes and did my work on my pc once I was in an apartment with more space. My pc is nothing crazy either and it was able to run ArcGIS Pro just fine.\n\nUltimately up to you if you'd rather use a standard laptop for notes and just work in the labs for your first year or two vs. getting a nicer laptop to do all your work on. I knew people who did both and it didn't seem to make a big difference in their productivity, just up to personal preference!",
                            "score": 2,
                            "author": "robdykeman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lenovo Legion gaming laptops offer great value. Look into those, they often are on sale on the Lenovo website.",
            "score": 2,
            "author": "xx2030"
        }
    ]
}