{
    "id": "i8z3aq",
    "score": 133,
    "title": "We’re screwed",
    "author": "jy213",
    "date": 1597322051.0,
    "url": "https://www.reddit.com/r/jmu/comments/i8z3aq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a senior here and my snap stories are full of people partying already. No masks, large gatherings, plenty of beer pong. Not to mention that I’ve been here all summer and the chances of seeing anyone in a mask in public is at best 50/50. Students and locals aren’t taking it seriously, so in the words of our own school “pack light this year.”",
    "comments": [
        {
            "level": 0,
            "comment": "There are locals taking it seriously, but you don't see us because we're staying inside. ;-) Seriously, though, the amount of people who are not wearing masks (or wearing them wrong) is definitely concerning. I'm really worried about what will happen when the students come back. It's not that I don't want you all here, but the increase in population is going to really spike our cases.\n\nMy experience is that it depends on where and when you go places that determine how seriously the staff and clients take COVID. Walmart is a disaster, but if you go to Martin's, Kroger or Target during off peak hours, people are more concerned with social distancing and masks. I know that those places aren't an option for all of you, but just some observations from someone who has been here all summer.\n\nI can't speak to how campus is because I haven't been back since all of this started.",
            "score": 28,
            "author": "gingercat_gamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "From someone in NYC, it's like that here too. Even after everything that happened here. I'd say 50% of people don't cover their nose with their mask and some people are still assholes about wearing them inside stores when it's required by law here in the state.  \n\n\nJust today I witnessed a guy in his mid-late thirties, call a young college aged Asian man at the store a \"communist motherfucker\" for asking him to put a mask on before he went in.",
                    "score": 3,
                    "author": "andersmb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "JMU *knows* what’s going to happen and right now they are just trying to push the responsibility onto the students so they can keep as much of their money as possible when things inevitably go to shit",
            "score": 79,
            "author": "tkzant",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, it’s just really upsetting to think they would bring in a bunch of people from all over the country, only to infect them and send them home to family where they may live with people in high risk groups. My love for this school has disappeared in the past few months.",
                    "score": 43,
                    "author": "jy213",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "JMU as an experience and a community is great. JMU as an institution is awful",
                            "score": 36,
                            "author": "tkzant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But yet, its the community (people) who are going to parties/not wearing a mask, and ironically its JMU the institution that is asking people to behave in a manner of their own self interest and the community's self interest.\n\nJust maybe the JMU institution is great, and the current experience and community is awful.",
                                    "score": 26,
                                    "author": "hi-jump",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 21,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree 100%. They touted critical thinking so hard when I went there. It's a shame it doesn't matter when their wallet is hurting.",
                                                    "score": 11,
                                                    "author": "miraculousmarsupial",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is so true! This whole Ethical Reasoning goes right out the door with the actions that are being taken place by my alma mater. It throws FORCLEAR, the acronym right out the door.",
                                                            "score": 8,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I still have the card in my wallet! Someone ought to start posting it on social media and asking the administration if they used those eight questions.\n\nOtherwise, that whole event during FROG week would have been a sham, and that's surely not the case, right?",
                                                                    "score": 4,
                                                                    "author": "miraculousmarsupial"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love JMU but it's literally one of the biggest party schools in VA. It's inevitable :(",
            "score": 13,
            "author": "not_homestuck"
        },
        {
            "level": 0,
            "comment": "It makes me so fucking angry. I'm furious. My blood is boiling. We've been social distancing and staying inside for months \\*MONTHS\\* of our lives down the fucking drain because JMU wants to be a shining example in Virginia to all the other schools that are already online. Schools such as, I don't know, the HARRISONBURG SCHOOL DISTRICT",
            "score": 10,
            "author": "tomlofer"
        },
        {
            "level": 0,
            "comment": "Just saw a group having an outdoor get together yesterday on Devon Lane. Definitely more than ten people and no social distancing.",
            "score": 28,
            "author": "browneyedjewel"
        },
        {
            "level": 0,
            "comment": "I’m excited to go back but it feels hopeless as fuck too. Like I can be careful and my 10 closest friends can be careful, but what about their friends? And their friends friends? Shit is gonna spread like wildfire and I feel like there’s a 15% chance I DONT get it. Unless, that is, I barricade myself in my tiny apartment room and don’t leave. Piss out the window maybe. And that’s not gonna happen.",
            "score": 6,
            "author": "AFWUSA"
        },
        {
            "level": 0,
            "comment": "This is terrifying",
            "score": 18,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Focus on the reality:  less than 1% of infected individuals are hospitalized and are in serious trouble from the virus and the vast majority of those people are 65 and older.  That is not a political statement, that is scientific data.  We are going to hear a lot of stories about parties and infection spikes.  Groups of students are going to be quarantined.  Some of your classmates will die.  Those are all given.\n\nJust remember this as you grow into adults that run this country:  America as a whole operates under the assumption that money is more important than the lives of the population.  That is capitalism in a nutshell.\n\nChange.  It.",
            "score": -34,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Personally I understand the data and I am not fearing for myself or most of my classmates lives as we return. But as someone who’s father is in a high risk group, once I return to campus I won’t be planning to visit home until well after the semester. \n\nI think it’s fair to assume a good amount of JMU students are in the same boat, and while we may not be at risk ourselves I have concern for the families and communities of each student that is coming back to campus. \n\nMoney can still be made by offering an off-campus option, where students can agree to pay the standard tuition but complete their classes from home. Students who believe it’s in their best interest to do so should be allowed to return to campus. I strongly disagree with JMU’s “all in or nothing” approach. I think making this a bout against cApiTaLisM is a bit of a stretch...",
                    "score": 8,
                    "author": "jy213",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;where students can agree to pay the standard tuition but complete their classes from home\n\nYou feel this is okay, but from the posts I've read here recently, most will not be okay with this. I mean shit, people here were ready to grab their pitchforks and torches because they still had to pay the athletics fee.  At this point you have to look at it from JMU's perspective in that no decision is going to be acceptable to everyone so they're doing what they think will please the most people while also having the smallest impact to the institution as a whole.",
                            "score": 2,
                            "author": "andersmb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Obviously it won’t please everyone, but at least OFFERING the option would be appreciated. Right now if I want to go fully online I have to rig my schedule and change a bunch of classes, which is not an option for me as I only have major required credits left.",
                                    "score": 1,
                                    "author": "jy213"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}