{
    "id": "x1lh9g",
    "score": 4,
    "title": "Econ 488 (capstone class)",
    "author": "Remarkable_Law9040",
    "date": 1661871978.0,
    "url": "https://www.reddit.com/r/jmu/comments/x1lh9g",
    "media_urls": [],
    "other_urls": [],
    "postText": "Can anyone tell me what this class consists of? Is it a project that you write an essay about? \n\nDo you present your project at the end? \n\nAny advice?",
    "comments": [
        {
            "level": 0,
            "comment": "I just finished this class last semester. I was lucky enough to have Angela Smith as a professor (my favorite professor in the department). If you have a different professor, things may be a little different, but I'd bet you'll do similar things.\n\nThere were two exams. One exam was an exam to test your knowledge of core econ classes, which is mostly knowledge you'll enter the course with. The final exam tested your knowledge of the Nobel Laureates that we covered in class. There was quite a bit of reading on the work of the Laureates, but it wasn't particularly difficult.\n\nThere was also a group project that was presented on a topic that your group would agree upon. There was no complex analysis, but you do find and do some basic research and some basic analysis (like making Excel charts). You'll write a brief paper and give a presentation to the class. This was pretty simple and not something to stress about, just make sure to communicate well with your group.\n\nThe class also consists of a project that consists of gathering, analyzing, and drawing conclusions about data. Most people chose to do the analysis in R-Studio. I was concerned that it would be really difficult because I really struggled with R in 385, but it mostly consisted of a simple regression and some basic tests (easily found in my old 385 notes or from YouTube videos). Overall, it's not a particularly difficult project, but I definitely recommend getting started early on it for the minor inevitable difficulties that will arise.",
            "score": 4,
            "author": "clancydog1",
            "replies": [
                {
                    "level": 1,
                    "comment": "\nThank you!! \n\nI have pretty bad anxiety about presentations… how long did it have to be? I was honestly hoping it would just be writing a paper but I knew it wouldn’t be that easy",
                    "score": 1,
                    "author": "Remarkable_Law9040",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was almost the entire 50 minute class period for me, but it was split among three people and the last 20 minutes or so were just answering class questions.",
                            "score": 1,
                            "author": "clancydog1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alright thanks! Looks like I could also take it over the summer",
                                    "score": 1,
                                    "author": "Remarkable_Law9040"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't have any particular quizlets or websites to recommend. I recommend reviewing your notes or reviewing key concepts you remember from ECON 200/201/331/332/385. There's so much knowledge in those five classes though that there is only so much you can do to review. I wouldn't sweat the first exam too much.",
                            "score": 1,
                            "author": "clancydog1"
                        }
                    ]
                }
            ]
        }
    ]
}