{
    "id": "xj98cn",
    "score": 9,
    "title": "Punching out?",
    "author": "PenitentSign72",
    "date": 1663681493.0,
    "url": "https://www.reddit.com/r/jmu/comments/xj98cn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve heard a lot of people talk about punching out to get rid of excess punches, but what is this and where can I do it?",
    "comments": [
        {
            "level": 0,
            "comment": "punches reset every week, so punching out is just using your remaining punches before they reset (i think sunday?) Festi is a good place to do this since it’s a la carte.",
            "score": 22,
            "author": "Edogfaug",
            "replies": [
                {
                    "level": 1,
                    "comment": "so if you used zero punches the whole week, does that mean you could get 21 punches worth of food on the last day?",
                    "score": 7,
                    "author": "jojomahbeans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, assuming you have a 21 punch plan. Tbh idk if that exists. Iirc, the 3-punch per day plan resets daily",
                            "score": 12,
                            "author": "Bdadl3y"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks",
                    "score": 2,
                    "author": "PenitentSign72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There used to be a max dlat one time depending on the location so make sure you use them through out the week if needed",
                            "score": 1,
                            "author": "Your_Mothers_Bush"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "my freshman year we’d always go to market in dhall to punch out since they had so many little snacks u can take to go idk if its still like this tho",
            "score": 2,
            "author": "Affectionate_Neck579"
        },
        {
            "level": 0,
            "comment": "Meal plans are priced such that you’d have to use every punch at Ehall or Dhall each week for it to be worth it. \n\nSave your money and put cash on your flex account instead.",
            "score": 1,
            "author": "Kamikaze_Cash",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if you live on campus and a meal plan is required though...",
                    "score": 3,
                    "author": "Lucien_Rouvere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Get the minimum meal plan. I think it’s 3/week.",
                            "score": 1,
                            "author": "Kamikaze_Cash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "$14 dollars to get into the dining hall which is all u can eat. All of the food places on campus are way overpriced so doing this would leave you spent pretty quickly. The 14 plan &amp; DD is perfect for most people who live on campus.",
                    "score": 3,
                    "author": "AdministrativeSet236",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Compare it to the price of a dining plan.",
                            "score": 1,
                            "author": "Kamikaze_Cash"
                        }
                    ]
                }
            ]
        }
    ]
}