{
    "id": "13h22dh",
    "score": 6,
    "title": "Dorms &amp; What I Should Expect",
    "author": "MrJaJaJa",
    "date": 1684037219.0,
    "url": "https://www.reddit.com/r/Drexel/comments/13h22dh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi. I'm planning on attending Drexel this fall as a freshman, and I was wondering from the dorms listed below, which one based on your own experiences is a good place to be? Which has a good community? Which has nice bathrooms? Stuff like that to answer would be great.\n\nRight now, here are my top picks for dorms: \n\n\\- Towers Hall\n\n\\- Millennium Hall \n\n\\- Kelly Hall\n\n\\- Bentley Hall\n\nI'm prioritizing money, and I know Tower's Hall has the lowest cost, but the remaining dorms are $200 more. Is it worth that $200 extra?\n\nRight now, I'm thinking Bentley Hall, but please please let me know what you guys think.\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "i currently live in towers and it’s not bad. i would say the worst part of my experience has been the people that live on the same floor. since we share a communal bathroom, kitchen, and lounge, it’s easy to notice who doesn’t know how to clean up after themselves. \ni haven’t heard anything about millennium other than it has weird shaped rooms.  \ni have no clue what kelly is like since it’s brand new to me. \nbentley is like towers in which you have communal areas, and they are arguably nicer than the ones in tower. however, the rooms are much smaller if that’s what you value.",
            "score": 5,
            "author": "Giant-Frog26"
        },
        {
            "level": 0,
            "comment": "towers as a building has the same vibe as a semi-rundown summer camp with the linoleum floors and wood furniture everywhere. personally, i was in bentley and i stick by that. the single stall unisex bathrooms are what tipped me over. also, people are saying that the bentley rooms are smaller but my roomate and i had no problem fitting eight ppl in our room, and ik that other ppl have hosted parties in bentley",
            "score": 3,
            "author": "jackohtrades"
        },
        {
            "level": 0,
            "comment": "Kelly is being renovated now, so at least that will be newish and clean! New bathrooms, furniture etc. Room sizes won’t change though. They’re putting in a really nice first floor lounge area and the laundry room is brand new.",
            "score": 2,
            "author": "Usual-Ad-2566"
        },
        {
            "level": 0,
            "comment": "Kelly hall is a premium dorm now??!!! There’s no amount of lipstick they can put on that pig. \n\nTowers is great! Big rooms, big common areas, and big kitchens. It’s the quintessential college dorm experience and there’s no reason to fork over $2k more for any of the others.",
            "score": 5,
            "author": "Bookhuggger"
        },
        {
            "level": 0,
            "comment": "Do. not. live. in. towers.\n\n&amp;#x200B;\n\nBetween the roaches, the smells, and the out-of-date everything, it's well worth the extra cost to live in one of the other buildings. I recommend Bentley; while still a traditional building with shared rooms and communal bathrooms, it has been updated with more reliable appliances (such as laundry) and it has nice study spaces, as well as 2 private bathroom stalls on each floor. If you're looking for a standard dorm situation, Bentley is great for a traditional \"first-year\" experience with pretty big rooms (albeit not as large as the towers rooms) and a nice atmosphere. Kelly Hall, with its most recent renovation, is surprisingly nice inside and comparable to Bentley in terms of upscale traditional dorm living. However, if you live on the wrong side of Kelly, you will never rid your room of the smell of canola oil and french fries from the chick-fil-a directly below you. \n\n&amp;#x200B;\n\nHonestly, the quality of your living situation depends more on your roommate than your room. Live with someone who is clean, hygienic, and cares about the living space, and you will be far better off than many others living in the dorms. In other words... don't settle for a roommate, be picky.",
            "score": 1,
            "author": "greenbean116",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bentley Hall was the dorm they presented during the tour, so I'm not surprised why it has such a good reputation. \n\nI appreciate the insight a lot thanks. Bentley was my top choice for dorm so hopefully that works out",
                    "score": 1,
                    "author": "MrJaJaJa"
                }
            ]
        }
    ]
}