{
    "id": "13ieckn",
    "score": 7,
    "title": "I haven't completed a single assignment for CIVE 302 and it's week 7!!!",
    "author": "Nervous-Wrangler6142",
    "date": 1684171434.0,
    "url": "https://www.reddit.com/r/Drexel/comments/13ieckn",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I haven’t completed any assignments for CIVE 302 and since it’s week seven I figured I’d cut my losses and withdraw from the class. My problem is that if I drop the class I’ll only be taking 10 credits and I’m not sure how that will affect my financial aid or if it will delay my graduation. I’m a fourth year and doing a five year plan. Any advice? Is it really that bad being a part time student?\n\nUpdate for anyone who cares: I withdrew from the class and it didn’t affect my aid or graduation date✌🏼thanks academic advisor",
    "comments": [
        {
            "level": 0,
            "comment": "Don’t trip, you fucked up but it’s not the end of the world. Check degree works and see if failing this class will delay graduation. Usually you can fail or withdraw from a couple before it does. Check if you cumulative gpa at the end of the term will drop to the point where you will lose any aid (you can check the minimum gpa requirement on Drexel connect) this will answer your question. My best guess is don’t withdraw, try ur best in the class now, talk to the professor and just take the L on ur GPA.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You need to ask drexel central about your specific circumstance, but usually withdrawing from a class this late into the year will not lower your financial aid in any way. However, again, talk to drexel central for your specific circumstance.",
            "score": 8,
            "author": "Froggygobyebye"
        },
        {
            "level": 0,
            "comment": "Talk to your professor. They might be able to help you catch up. If you show you want to succeed, there are many things they can do for you.I know people who got INC(omplete) and finished the work in the next quarter. You got this!",
            "score": 5,
            "author": "mblumber"
        },
        {
            "level": 0,
            "comment": "You cannot DROP the class this late (the deadline for that was the end of Week 1), but you can Withdraw from it. The W will, however, remain on your transcript.",
            "score": 4,
            "author": "knightr1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m fine with a w on my transcript. My concern is the financial aid part. My tuition is paid with the parent plus loan and money received from fafsa. My tuition for this term was just paid off. Could they take the money away from me if I drop below 12 credits?",
                    "score": 1,
                    "author": "Nervous-Wrangler6142",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’d have to consult with the criteria of the specific grants and scholarships given to you. More likely than not, you would need to be a full time status student in which dropping below 12 credits makes you part time.",
                            "score": 3,
                            "author": "esunFun"
                        },
                        {
                            "level": 2,
                            "comment": "I’m not Drexel, so this could be wrong, but I believe as long as you complete 60% of the class it’s fine fafsa wise",
                            "score": 0,
                            "author": "ghostofappalachia1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "parent weap",
            "score": 2,
            "author": "Huang_Yong"
        },
        {
            "level": 0,
            "comment": "Bro, 302 taught by Matt Reichenbach?\n\nHe is the MOST chill professor in the world.\n\nat least talk to the guy, he may let you turn in some late, and homework assignments his classes arent 100% of the grade.\n\nI'm not saying you are going to do well per se, but if it taught by matt and you talk to him and start turning stuff in and do decent on the final, I could totally see him passing you.",
            "score": 2,
            "author": "tmahfan117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah it’s Aspasia Zerva. Have you heard anything about her?",
                    "score": 2,
                    "author": "Nervous-Wrangler6142"
                }
            ]
        }
    ]
}