{
    "id": "13w257v",
    "score": 3,
    "title": "Thoughts on film program and being a 20 year old freshman.",
    "author": "profitgirl",
    "date": 1685480822.0,
    "url": "https://www.reddit.com/r/Drexel/comments/13w257v",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am interested in attending Drexel's Film program. I am interested in hearing all the pros and cons. Cost, classes, jobs, Drexel LA...\n\nAlso, would it be weird to be a 20 year old freshman?\n\nOne more thing, can you start this program any other time but the fall semester?",
    "comments": [
        {
            "level": 0,
            "comment": "no one cares how old you are being 20 isn't weird",
            "score": 17,
            "author": "tunaspice"
        },
        {
            "level": 0,
            "comment": "Bro I was a 28 year old freshman....i think you are good",
            "score": 6,
            "author": "Kilo1028",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you live on campus",
                    "score": 1,
                    "author": "profitgirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, i live in fishtown, i avoided the dorms just because of the huge age difference i have with the classmates",
                            "score": 2,
                            "author": "Kilo1028"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know on the quarter system you can start besides the fall. Most other universities allow students to start at different times of the year. On the Drexel page it should have when you can start on the quarter or semester (law, nursing), system.",
            "score": 2,
            "author": "OreosGotChips"
        },
        {
            "level": 0,
            "comment": "I’m a FMTV major. The film program is pretty excellent here. Pros are that we have the highest gear to student ratio in the country, really well funded facilities, and mostly terrific instructors. Cons are that the equipment room managers (Bill and Jamie) are complete assholes and will try to swindle you or gate-keep the equipment at every turn. The department has no windows and sometimes smells weird, but overall I recommend if you are strong willed, ambitious, and social enough to be able to work alongside peers on almost everything. I’m a sophomore at 20, and I know a couple of first years who are 21 and 23 y/o, so you’re not going to be singled out for being older. We collaborate with students of all ages and don’t really identify ourselves by seniority in most cases. The best co-ops are amazing opportunities but very selective, so be sure to put the work in during your first two years to boost your resume. I know Drexel has a winter entry program but I don’t know how it works or if film students are eligible. Never got to do Drexel in LA because I’m a double major and my plan of study doesn’t have room for it. PM if you have more questions.",
            "score": 1,
            "author": "greenbean116"
        }
    ]
}