{
    "id": "13zl0m5",
    "score": 4,
    "title": "Is Psychology an easy major?",
    "author": "Main-Detail-3413",
    "date": 1685816556.0,
    "url": "https://www.reddit.com/r/Drexel/comments/13zl0m5",
    "media_urls": [],
    "other_urls": [],
    "postText": "How hard would it be to maintain at least a 3.9? \n\nI’m trying to transfer after my first-year at a college and I’d like close to a 4.0 as possible. I’m an incoming freshman and Drexel is fairly cheap for me but I would rather go to another state school if Pysch + pre-med isn’t easy.\n\nEdit: I’m in Honors and STAR Scholars.",
    "comments": [
        {
            "level": 0,
            "comment": "Easy major but why would you come to Drexel to take it rather than a state school?",
            "score": 9,
            "author": "hagstromisalami",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why do you say that? Excluding cost reasons because Drexel is fairly cheap for me (lots of merit aid).",
                    "score": 0,
                    "author": "Main-Detail-3413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because the allure of Drexel is the 5 year coop program but 95% of psychology coops are unpaid. Plus the current expectation of psychology majors seems to be that you need to get a masters/PhD so why go to a school that would take 5 years when you can go to a school that would only take 4 years before you started your masters",
                            "score": 7,
                            "author": "hagstromisalami",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "disagree, 95% of the coops arent unpaid. many of the research ones are unpaid but if you work hard you can get a paid coop as a psych major. chop hires a lot of psych majors for pay",
                                    "score": 3,
                                    "author": "jackohtrades"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks for responding! What if I decided to take the four year route anyway as a Psych major? What are your thoughts on the program if you know about it?",
                                    "score": 1,
                                    "author": "Main-Detail-3413"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also thoughts on the difficulty of bio/chem courses if you know them?",
                    "score": 0,
                    "author": "Main-Detail-3413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im gonna be honest, why would you spend 5 years getting your psychology degree where you can get in 4 elsewhere. You won’t get any high paying jobs without a masters.",
                            "score": 6,
                            "author": "Pdunn29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for responding! What if I decided to take the four year route anyway as a Psych major? What are your thoughts on the program if you know about it?",
                                    "score": 0,
                                    "author": "Main-Detail-3413",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just don’t major in psychology unless you plan on getting a a masters. Simple as that",
                                            "score": 4,
                                            "author": "Pdunn29"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also what about Biology? Debating between TJU and Drexel for Psych + Bio concentration.",
                                    "score": 0,
                                    "author": "Main-Detail-3413"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "psych by itself is very easy to maintain a 3.9 if you have good critical thinking. that being said, premed is a different story and i dont know if how possible a 3.9 is with premed classes",
            "score": 2,
            "author": "jackohtrades"
        }
    ]
}