{
    "id": "142mzw1",
    "score": 55,
    "title": "Lancaster walk",
    "author": "DrexelCreature",
    "date": 1686072358.0,
    "url": "https://www.reddit.com/r/Drexel/comments/142mzw1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is for WALKING. Not going 30 mph on your electric scooter or bike downhill. I know that’s confusing for some.",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t have a problem with folks biking/scootering as long as they’re respectful when passing by. I mean there’s literally a bike rack outside the gym…",
            "score": 36,
            "author": "minman789",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, my rule of thumb is that walkers have the right of way when I’m riding on sidewalks. I’ll just coast slowly at walking speed until I have a clearing to pass. And even when clear, keep it relatively slow.",
                    "score": 6,
                    "author": "mbash013"
                },
                {
                    "level": 1,
                    "comment": "Technically you’re supposed to walk your bike on sidewalks but yeah I am aware of the bike racks and I completely understand. It’s the ones flying down hill yelling at you to watch out that piss me off.",
                    "score": 18,
                    "author": "DrexelCreature",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea that’s frustrating for sure",
                            "score": 6,
                            "author": "minman789"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "With the alternative being getting run over by cars that drive in bike lanes or having to ride down the middle of market street (going east) because there aren't any bike lanes at all- I'd have to say I'm fine with bikes as long as they're being respectful and attentive. A bike + pedestrian collision is infinitely less fatal than a bike + car collision. That's not to say any collision is ideal, but there are bike racks in the middle of Lancaster Walk for the DAC, there are Indego stations all around Philadelphia in the middle of sidewalks. Everyone's just trying to get where they're going safely. As long as people are being respectful of space, I'd say it's really not a huge deal.",
            "score": 22,
            "author": "mattaj24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I know that’s kind of where I was going with the whole “not 30mph down hill”. Like go at a normal speed it’s not everyone’s job to move out of the way.",
                    "score": 9,
                    "author": "DrexelCreature",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough- I agree bikes should go a slow safe speed and respect pedestrian right of way",
                            "score": 8,
                            "author": "mattaj24"
                        }
                    ]
                }
            ]
        }
    ]
}