{
    "id": "hmybwj",
    "score": 200,
    "title": "big mood",
    "author": "[deleted]",
    "date": 1594140972.0,
    "url": "https://www.reddit.com/r/Drexel/comments/hmybwj",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Drexel needs that international student $$$. They will offer hybrid classes to get around this loophole. Even if int’l students take one class in person they’ll be able to stay.",
            "score": 30,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah but it’s gonna be hard for every international student to take one in person class. hope they offer enough in person classes",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Guess you just gotta risk COVID to stay in the US",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the most US statement you can make god damn",
                            "score": 5,
                            "author": "cokebois"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope they do offer hybrid classes as a choice for international students, but I wouldn't feel comfortable taking classes in-person. All these people going out and having parties and crap. They are not practicing social distancing and complaining about wearing masks. These ignorant pricks are total a\\*\\*holes. If we do return on campus, Drexel better pays for students who catch the virus.",
            "score": 14,
            "author": "rollingthunder001"
        },
        {
            "level": 0,
            "comment": "[You can help by signing this White House Petition ](https://petitions.whitehouse.gov/petition/allow-f-1-students-stay-us-through-fall-semester-if-instruction-online-due-pandemic)",
            "score": 10,
            "author": "HL11235"
        },
        {
            "level": 0,
            "comment": "Did they make a decision on Fall term yet?",
            "score": 6,
            "author": "BlindNinjaTurtle",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’s hybrid for now, online after thanksgiving",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the case drexel does go all online, would it be possible to put some pressure on Drex to implement some kind of loop hole. Like maybe 1 “mandatory” academic advisor meeting in person with masks per term",
            "score": 5,
            "author": "grouplovefan420",
            "replies": [
                {
                    "level": 1,
                    "comment": "there was a recent post on this sub that said UC Berkeley students are asking professors if they’d be willing to create a 1 credit in person that class that meets like once a term. it’d be open to international students who need to show they’re taking at least one in person class. hope drexel does something similar",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure they could be convinced of it, given it benefits them to have international students and it’s an easy way to get support from the student body",
                            "score": 4,
                            "author": "grouplovefan420"
                        }
                    ]
                }
            ]
        }
    ]
}