{
    "id": "10dmxlg",
    "score": 3,
    "title": "When does RoomSync open back up?",
    "author": "Silent-Pickle6402",
    "date": 1673893037.0,
    "url": "https://www.reddit.com/r/fgcu/comments/10dmxlg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone know when RoomSynce opens up during the spring semester? I'd assume around February, but that's when we reapply for housing... I'm getting kind of worried because all my current roommates are going to be living off-campus next year and I'm taking mostly virtual classes this semester so I haven't had the opportunity to meet anyone. I desperately need to meet people so I'm not rooming with complete strangers next year.\n\nI’m a 20 year old female btw",
    "comments": [
        {
            "level": 0,
            "comment": "Do you stay at north lake by any chance ?",
            "score": 2,
            "author": "Jackjoohn374",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I do :)",
                    "score": 2,
                    "author": "Silent-Pickle6402"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is RoomSync? I am curious because we have a DD and roommate that need to remain on campus and most are moving off...",
            "score": 2,
            "author": "CLGMAMA2",
            "replies": [
                {
                    "level": 1,
                    "comment": "What’s a DD?",
                    "score": 1,
                    "author": "Silent-Pickle6402",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry that's the term moms use online use for dear daughter.",
                            "score": 2,
                            "author": "CLGMAMA2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg that’s actually hilarious",
                                    "score": 2,
                                    "author": "Silent-Pickle6402"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "RoomSync is an app that allows you to meet potential roommates at FGCU",
                    "score": 1,
                    "author": "Silent-Pickle6402"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it opens the 2nd week of February, after you apply for housing. Honestly, I wish they'd open it sooner so you have more time to find people. \n\nI've had a hard time meeting people too with my class schedule, so I would be down to chat if you want! :)",
            "score": 2,
            "author": "tophat_cat"
        },
        {
            "level": 0,
            "comment": "What I recommend is going to some basketball/ ice hockey games. The schedule is online and it’s always a blast. \n\nPlus there’s a great chance you will meet like minded individuals and future friends. \n\n\nMaybe check out the FGCU Roommates and subleases if you’re looking for a future roommates or even just to meet some new cool people \n\nTry to eat on campus and talk to new people \n\nI know it can be scary to go up and say hi and introduce yourself, a tour guide once told me once the definition of courage is being afraid and doing [it] anyway \n\nYou sound like a friendly person and I’m sure you’re super fun to be around, being that to the table. Try to be yourself and not worry to much \n\nFriends will come and go, be excellent to your fellow peers and your success is guaranteed",
            "score": 1,
            "author": "memedealer22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sporty at all, but I’ll have to try going to a hockey game once in a while. Great idea, thanks!",
                    "score": 1,
                    "author": "Silent-Pickle6402"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s plenty of great clubs on campus, and most people there are trying to do the same thing as you (yes even the sports ones)",
            "score": 0,
            "author": "Owlbear5e"
        }
    ]
}