{
    "id": "10ldimw",
    "score": 2,
    "title": "What are my chances of getting into the BSN program?",
    "author": "girlonheriphone",
    "date": 1674690202.0,
    "url": "https://www.reddit.com/r/fgcu/comments/10ldimw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have heard so many mixed statistics regarding the likelihood of getting accepted into the BSN program or not. I had a rough first semester my freshman year (B’s and a C in bio) but quickly got myself together and have gotten nothing but A’s apart from 2 B’s. I have A’s in important courses like A&amp;P and microbiology. My GPA right now is a 3.57, and I got an 80.8 on my TEAS. I know it’s super competitive, but can someone from the program give me some insight? I know people with similar stats and some got accepted, and some got rejected. I’m worried my first freshman semester will potentially hold me back, even though my other grades are great. Any advice on how to not constantly fixate on this? 😅",
    "comments": [
        {
            "level": 0,
            "comment": "Spring 2022 BSN graduate here. Honestly, my only advice is to just wait. I remember I called to ask for statistics when I applied and they said they didn’t have any because they accept a range of GPAs and TEAS scores. When I applied I had a ~3.8 GPA and 81 on the TEAS. It’s a brutal wait, but good luck!",
            "score": 2,
            "author": "fazevapequeen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! Ugh, the wait is killing me already and it’s not even February. How soon did you find out you were accepted? NursingCAS says 12-14 weeks, but I’ve heard other people they found out in March.",
                    "score": 1,
                    "author": "girlonheriphone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I found out April 1!",
                            "score": 1,
                            "author": "fazevapequeen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you have a good chance. I applied with a 4.0 and an 84 teas score, I was a transfer student though. I know some people in my cohort had around a 3.6 and high 70s or mid 80s. Are you applying for this upcoming fall?",
            "score": 1,
            "author": "LayerPuzzleheaded351",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not a transfer, so hopefully that will help me a bit. I just applied for fall, but I will apply for spring if I don’t get in.",
                    "score": 1,
                    "author": "girlonheriphone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, I know some people have been receiving acceptance emails for this upcoming fall! So, you should know soon",
                            "score": 1,
                            "author": "LayerPuzzleheaded351"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey y’all! Just an update for those of you who are wondering/trying to calculate your chances. I found out I got in mid-March and start in the fall :) &lt;3",
            "score": 1,
            "author": "girlonheriphone"
        }
    ]
}