{
    "id": "10ol92d",
    "score": 6,
    "title": "Off campus housing",
    "author": "MShorto23",
    "date": 1675032684.0,
    "url": "https://www.reddit.com/r/fgcu/comments/10ol92d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking to get any advice on off campus housing. Mainly asking about apartments but does anyone have any advice on good apartments or apartments to avoid at all costs?",
    "comments": [
        {
            "level": 0,
            "comment": "Try FGCU Roommates and subleases on Facebook that’s how I found my last three places",
            "score": 5,
            "author": "memedealer22"
        },
        {
            "level": 0,
            "comment": "I lived in Audubon Cove off Daniels when I was undergrad.  Mix of college kids, families, retirees.  Good atmosphere, set back off the highway and fairly quiet, only about 15 minutes from campus, town center, downtown and the beach.  Traffic wasn’t terrible in any of those directions.  The Twins spring training stadium is only a couple minutes away and you can hear the PA during games and fireworks when they have them.  3 pools, which is awesome.  Close to grocery stores and department stores, decent amount of food options close by too.  I was at FGCU from 2011-2014, so of course it may be different now but I really enjoyed my time there and that apartment was a big part of that",
            "score": 4,
            "author": "TokyoFarquaad"
        },
        {
            "level": 0,
            "comment": "Uv is overpriced but still an option, Super close to campus so you really don’t need a car if your at UV honestly. \n\nThe Reef is goldilocks, costs like $80-100 more on average than coastal but A LOT nicer than coastal imo despite being sister complexes. Need a car.\n\nCoastal village if your desperate, but really grody when I was there. Gym is decent here and 24hours but not really needed if you go to the fgcu gym already. But cheapest in terms of rent in the ESTERO AREA PERIOD!",
            "score": 4,
            "author": "VUlgar_epOCH"
        },
        {
            "level": 0,
            "comment": "Any of them off three oaks",
            "score": 2,
            "author": "laddielou"
        }
    ]
}