{
    "id": "rpknrv",
    "score": 4,
    "title": "Honors College?",
    "author": "spacelemonadecadet",
    "date": 1640601042.0,
    "url": "https://www.reddit.com/r/fgcu/comments/rpknrv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey yall, I'm gonn be attending FGCU in the fall (highschool class of 2022), and I'm wondering if anybody knows when the Honors College applications usually come out? When I emailed to ask I was told \"early January, maybe earlier, maybe after\".  What are the applications like?",
    "comments": [
        {
            "level": 0,
            "comment": "I don't have an answer to your question, but I'd like to ask you another one.  Why do you want to be in honors college?  What exactly do you get out of it?",
            "score": 3,
            "author": "UselessGadget",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like the priority class registration, certain classes available only to honors students, and it's also just nice to be part of a community",
                    "score": 4,
                    "author": "spacelemonadecadet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The application is a pretty simple \"what do you want to be in honors for?\" and \"how are you a good fit?\" I received an invite from the Honors college during my first semester via my Eagle Outlook Email which you should have once you have a student ID and an account with the school. Just email honors @ fgcu.edu and ask if you can apply, somebody will reply and you'll probably be sent an application link right away, or be sent through whatever the proper channels are for new students.\n\nYou have to propose a TED Talk for the application as well, that's probably the trickiest part, but as long as you can make it engaging and intelligible, you'll be fine. Connect it with an academic interest that you can talk about or teach and you'll be golden.\n\nThe interview process basically has you talk to three honors college faculty and show that you understand the Honors Elements, which you can read about on the website.\n\nSource: I'm an FGCU Honors student as of spring 2022.",
            "score": 1,
            "author": "nickallanj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might be kind of off-topic from OP’s question but since you’re in the honors college, I just graduated two Saturdays ago and I honestly just wanted to know what does the honors college actually give you that helps you for the future? \n\nLike does honors courses give you an extra weight on your GPA or some thing, for priority consideration for grad school? I just never knew anyone in the honors college who actually gained anything extra from it, besides for the sense of community and I guess looks good for med school and law school. You do get a stole and a band for grad walk I think?",
                    "score": 2,
                    "author": "VUlgar_epOCH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most honors exclusive courses involve service hours, internship experience, research grants sometimes. A lot of it is stuff you could do as a normal student too. I'm only in Honors for the registration perk tbh",
                            "score": 2,
                            "author": "nickallanj"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tysm amazing",
                    "score": 1,
                    "author": "spacelemonadecadet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No just do the regular college honors college is a bunch of nonsense that I really don’t have any information base it off of other than what I gather at my time at FGCU",
            "score": 1,
            "author": "memedealer22"
        }
    ]
}