{
    "id": "vhu28i",
    "score": 9,
    "title": "Social work",
    "author": "Popteengirl",
    "date": 1655864422.0,
    "url": "https://www.reddit.com/r/fgcu/comments/vhu28i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Kind of curious is social work field worth it? I want to work in the school district field and then become a therapist.",
    "comments": [
        {
            "level": 0,
            "comment": "The pay isn’t good. Burnout happens.",
            "score": 6,
            "author": "broxsie"
        },
        {
            "level": 0,
            "comment": "I’ve met two social work majors, it’s been one semester and neither of them are social work majors. Do with that as you will.",
            "score": 3,
            "author": "Owlbear5e"
        },
        {
            "level": 0,
            "comment": "I’d consider talking to people in advising about careers or an actual social worker",
            "score": 3,
            "author": "Nbk4694"
        },
        {
            "level": 0,
            "comment": "Very high turnover rates, low pay, burnout. Also school shootings are increasing in frequency these days.",
            "score": 2,
            "author": "NAL_Founder"
        },
        {
            "level": 0,
            "comment": "No, I don’t want to lie to you but it isn’t. If you’re working in the UK you’ll be dealing with people who don’t want your help, who see you as the bad guy, there’s a lot of paperwork that you’ll take home and do for hours at a very low pay.",
            "score": 1,
            "author": "Lazy_Cat1997",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’s pretty bizarre at how little they earn for all the hard work it takes and shit they put up with",
                    "score": 1,
                    "author": "heartbrokeThroaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NO",
            "score": 1,
            "author": "heartbrokeThroaway"
        },
        {
            "level": 0,
            "comment": "don’t become a social worker it will destroy you",
            "score": 1,
            "author": "heartbrokeThroaway"
        },
        {
            "level": 0,
            "comment": "See if you can find an opportunity to volunteer somewhere that provides social services.  See what working social workers go through, and then decide if you want it.  It sounds like a very rewarding career, but the ones that I know have to spend more time dealing with bureaucratic bull than helping people and the pay and benefits suck.  And then the actual help you can provide is often minimal.",
            "score": 1,
            "author": "John_B_Clarke"
        },
        {
            "level": 0,
            "comment": "I have my MSW.  If I had to do it over again, I would not.  I made the same pay as our administrative assistant at a non profit.  My friends who work in for-profits were able to support themselves, had less responsibility, and didn't have cockroaches living in their desks.",
            "score": 1,
            "author": "jviolet123"
        },
        {
            "level": 0,
            "comment": "Licensed SW therapist. Pay for therapy services can be quite good. Where I live there's a high demand for therapy and there seems to be no end to clients that will do cash pay. All of my cohorts from grad school are booked out and make good money. But it all comes down to what path you want to take. Anything without licensure requirements is as bad as described here. Licensed positions pay better with experience &amp; independent Licensed positions often pay quite well.",
            "score": 1,
            "author": "DubLParaDidL"
        }
    ]
}