{
    "id": "z7yioe",
    "score": 3,
    "title": "off-campus housing for Summer 2023?",
    "author": "SarahMagical",
    "date": 1669738978.0,
    "url": "https://www.reddit.com/r/fgcu/comments/z7yioe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ll be a grad student at FGCU starting this summer. Wondering how difficult/expensive it will be to find off-campus housing for my family, since Ian has taken so many homes and displaced so many people.\n\nI expect housing to be more expensive than it was pre-Ian, but by how much? I know nobody has a crystal ball but any educated guesses? Can I expect to find housing prices doubled since Ian?",
    "comments": [
        {
            "level": 0,
            "comment": "Inflation has been hitting the Estero/South Fort Myers area hard the last couple of years Ngl",
            "score": 4,
            "author": "arcane-boi"
        },
        {
            "level": 0,
            "comment": "Very difficult and expensive. I attended FGCU from 2010-2012. Even then, the college was struggling to buy new land and apartments for housing, both on-campus and off due to major college growth. It's only gotten 100x worse with so many people moving to Florida.\n\nOne of my coworkers is about to be homeless in less than 2 weeks due to being unable to afford sky-high rent prices in the SWFL / Cape Coral / Fort Myers / Lehigh Acres / Estero area.\n\nIn April 2022, FGCU had a panel on the scarcity of affordable housing for students: [https://www.winknews.com/2022/04/29/fgcu-panel-addresses-anxiety-surrounding-affordable-housing-scarcity/](https://www.winknews.com/2022/04/29/fgcu-panel-addresses-anxiety-surrounding-affordable-housing-scarcity/)\n\nIn May 2022, FGCU ranked the Fort Myers area #2 in \"most overvalued rental markets\" in the entire United States: [https://www.winknews.com/2022/05/04/fort-myers-takes-second-in-fgcu-study-of-most-overvalued-rental-markets/](https://www.winknews.com/2022/05/04/fort-myers-takes-second-in-fgcu-study-of-most-overvalued-rental-markets/)\n\nIn June 2022, FGCU ranked the Fort Myers area #2 in \"largest rent increase in the nation compared to 2021\": [https://www.fox4now.com/news/local-news/lee-county/fgcu-study-fort-myers-sees-largest-rent-increase-in-the-nation-compared-to-2021](https://www.fox4now.com/news/local-news/lee-county/fgcu-study-fort-myers-sees-largest-rent-increase-in-the-nation-compared-to-2021)\n\nAs of the end of August 2022, \"For the second month in a row, Lee County leads America in largest year over year rental increases at 25.2%. But some cooling has begun, just not nearly to what had been a normal level, according to the latest monthly analysis by Florida Gulf Coast University, Florida Atlantic University and the University of Alabama.\" [https://archive.ph/Af0ge](https://archive.ph/Af0ge)\n\nOn November 4, 2022, Florida Atlantic University (FAU) and FGCU determined that \"rent prices were cooling, but not in Florida\": [https://www.fau.edu/newsdesk/articles/rent-index-september.php](https://www.fau.edu/newsdesk/articles/rent-index-september.php)\n\n&gt;“It is clear from the data that rents across the U.S. are reverting back to a more normal long-term trend,” said Ken H. Johnson, Ph.D., an economist in FAU’s College of Business. “But I’m not surprised to see Florida still at the head of the pack, given the strong demand and severe shortage of units.”  \n&gt;  \n&gt;Shelton Weeks, Ph.D., of Florida Gulf Coast University’s Lucas Institute for Real Estate Development &amp; Finance, said the long-term effects of Hurricane Ian on the southwest Florida rental market are unclear.  \n&gt;  \n&gt;“But in the short term, it is reasonable to expect a continuation of our pre-Ian supply chain issues,” he said. “It most likely will be harder than ever to acquire materials and labor at reasonable prices, which will definitely exacerbate rental issues in this area of the state.”\n\nMore recently, other sources indicate that Hurricane Ian caused rent prices to spike again.",
            "score": 3,
            "author": "Obversa"
        },
        {
            "level": 0,
            "comment": "cant exactly answer the question, but be open to a longer commute, lease takeovers, different  types of housing (apartments, duplexs) and if you have young children make them share a room\n\nit doesnt look like prices doubled, but when i was looking i had to add $400 to original monthly budget to meet what i was looking for",
            "score": 1,
            "author": "pimpmybattlewagon"
        }
    ]
}