{
    "id": "fzp8r7",
    "score": 8,
    "title": "which dorm is the best for firstyear students",
    "author": "marthastewart133",
    "date": 1586662285.0,
    "url": "https://www.reddit.com/r/IthacaCollege/comments/fzp8r7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm going to be a freshman in the fall and I was curious to see which dorm is the best to pick out towers and quads",
    "comments": [
        {
            "level": 0,
            "comment": "Holmes! It’s close enough to towers and terraces, so if you have friends there it’s easy access. Also close to the library, CC, and most classes. However, if you’re in park or CNS then def Landon or Bogart.",
            "score": 4,
            "author": "36ix9ineDamnYouFine",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I went there Tallcott, right next door to Holmes, was a freshman only dorm and I didn't enjoy that aspect of it for my first year.  Lived in Holmes sophomore year.",
                    "score": 1,
                    "author": "climbon321"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What major?",
            "score": 2,
            "author": "Esteban_The_Tortoise",
            "replies": [
                {
                    "level": 1,
                    "comment": "cinematography",
                    "score": 1,
                    "author": "marthastewart133",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Assuming you mean cinema and photography? \n\nIf so, quads are gonna be closest to Park, but I’d honestly recommend Towers. It’s really not that much farther and I feel there are more pro’s and the pro’s are better. \n\n1. They’re newer. That comes with good water fountains/bottle fillers on almost every floor. And they have 4 gender neutral bathrooms that are both newer/cleaner and I don’t know anyone who prefers a community bathroom over an individual one.\n\n2. They’re coed by door. This means dorms are segregated by gender/sex. In my opinion that’s just way better. It means bathrooms will be nicer cuz guys wont be gross and it just feels more social and like a community and less like a clique.\n\n3. Better for food. They’re closer to Terraces which is the dining hall that’s open later. There’s also just close to terraces in general. Also they’re attached to Marketplace which is a food place (pizza, burgers, shakes, snacks, etc.). You don’t even have to go outside for this shit which is ***golden*** during the winter.\n\n4. There’s 13 floors so a lot of people to make friends with.\n\n5. There’s the potential of getting a lake view. \n\n#Cons \n\n1. There’s 13 floors. So if you’re on a higher floor, not the greatest. Yes there are elevators, but they’re not totally reliable (sometimes only one works, sometimes they just take a long ass time). If you get Towers you’re gonna want a lower number... but not so low that everyone looks at you like you’re a dick for taking the elevator if you’re feeling lazy.\n\n2. There’s the potential of ***not*** getting a lake view. Not so much the lack of view as it is the noise from the parking lot that could be directly below you—this is the only time a higher up floor is preferable. \n\n3. It’s the opposite end of the campus from Park (but it’s like a 7 minute walk tops so I really don’t think it’s worth being the deciding factor. I’m a C&amp;P major and I definitely don’t regret choosing Tower).\n\n4. Farthest from the parking lot if you’re bringing a car. \n\n5. Farther from the gym than quads",
                            "score": 0,
                            "author": "Esteban_The_Tortoise"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've lived in both Landon and the Towers. The Towers are noisier but you get used to it, and there are a few stairs to take to get, well, anywhere. \n\n\n\nHowever here are the upsides:\n\n- One in four chance you get the prettiest view on campus.\n- P R I V A T E    B A T H R O O M S\n- Recently Renovated\n- Lots of laundry machines and if you can time yourself correctly you always get one. \n- The Quads have a lot of pipes that are dripping water. I can hear them in both Landon and Bogart.\n- Have I told you about the P R I V A T E    B A T H R O O M S?\n- Towers Dining is great when you want to get a burger at midnight, in flip flops, which you will. \n- you can tell your professor \"sorry I didn't make it to class today, the elevators broke down while I was in it\"\n\nAddmitably the last one can also be a con but who's counting.\n\nAlso the Quads are closer to Campus Center's dining hall but the Terraces has better food almost always (and open later).",
            "score": 2,
            "author": "stazthebox"
        },
        {
            "level": 0,
            "comment": "I liked living in towers a lot since it's so close to the forest which is very beautiful and the towers cafeteria. I also think having it be near the top of the campus made it easier for me to personally have a mental map of where every building was if that makes any sense. Hope you enjoy your first year!",
            "score": 1,
            "author": "Kajel-Jeten"
        }
    ]
}