{
    "id": "mqtgxx",
    "score": 5,
    "title": "is ithaca worth it? (physical therapy major)",
    "author": "bruhbruhbruhbro903",
    "date": 1618415594.0,
    "url": "https://www.reddit.com/r/IthacaCollege/comments/mqtgxx",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi yall\n\ni've been accepted into ithaca's 6-year physical therapy program. the program isn't ranked super high  but I've gotten in where I wont have to reapply going for grad school. i'm getting a lot of money from ithaca (like 40k) so its essentially my best option financially, but hearing all the negative things online is making me really nervous. i have other school options that are higher ranked in the program I want, but 1) I haven't gotten into their grad school programs and 2) are way more expensive. despite all the negative things I've heard, I've talked to people in person who went to ithaca and LOVED it but they went like years ago so I'm not sure how much the school has changed?\n\ni feel like a lot of people have asked this but I was just wondering whether ithaca would be worth it or not. \n\ncan someone give me honest thoughts about how you feel about the school and whether or not going here would be worth it. (esp for my major bc a lot of ppl say that park is worth it but ill be in a different school so Im not sure)",
    "comments": [
        {
            "level": 0,
            "comment": "Ithaca DPT 08, yes Ithaca is totally worth it for their PT program especially if you received a lot of money from IC. Their graduate pass rate on the NPTE is extremely high for first time takers, I believe for my class it was 98%. The program is tough but the professors are great,  although I'm sure several have retired since I graduated. I am very happy I chose Ithaca.",
            "score": 2,
            "author": "travellingbecca916",
            "replies": [
                {
                    "level": 1,
                    "comment": "ahh ok thanks for the thoughts!",
                    "score": 1,
                    "author": "bruhbruhbruhbro903"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The PT program is one of the more robust and well funded programs on campus. Obvs Park communications is the top school, but PT, With the pandemic ending in site, the school culture should start to come back to life too.\n\nThere are definitely better PT programs out there, but 40k is some pretty solid cash.",
            "score": 1,
            "author": "Wartz"
        }
    ]
}