{
    "id": "ozers",
    "score": 1,
    "title": "Any CMD/Park majors in the house?",
    "author": "Canon_Goes_Boom",
    "date": 1327688586.0,
    "url": "https://www.reddit.com/r/IthacaCollege/comments/ozers",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys, I'm exploratory right now and I'm applying to Park for next fall...\nI've realized though that a lot of the classes im taking this term are, well.... a fucking waste of my time. Things like \"Professional communication\" and \"Business and Public Communication\" where I'm just learning crap I already know/not learning anything. \n\nBecause I'm not part of the Park school yet, my class options for park are limited... so what I'm asking is if you guys know any classes I can take in Park without actually being in Park? I'm looking for classes to take now, so that I can drop these other pointless classes and take something I'm actually interested in. Does anyone know of anything? \n\nAny other help is really appreciated too... like what classes I should take that would help me get into Park... programs I should be in... stuff like that. Again, I'm mostly looking at CMD. THANKS FOR THE HELP!",
    "comments": [
        {
            "level": 0,
            "comment": "Also, does anyone know what topic I should be looking under on homerConnect to find classes I'm interested in? (CMD, or pretty much anything in Park). I'm looking under things like \"strategic communications\" but idk if this is right....",
            "score": 1,
            "author": "Canon_Goes_Boom"
        },
        {
            "level": 0,
            "comment": "Yeah man (or woman), senior IMC major here. \n\nStrat comm is exactly where you should be looking, in homer. so youre on the right track. \n\nSee if you can find any 100 level strat comm classes that would satisfy CMD requirements. Systems Thinking and Design is one. Presentations Media and Visual Design is another. \n\nAlso, give Introduction to Strategic Communication a shot. \n\nAlso, Also, don't drop Business and Professional communcation, it satisfies an IMC/CMD requirement, so theres that. \n\nIf you cant get into anything because of restrictions or what not, go talk to someone in Park. Dennis Charsky for CMD. Go tell him what you said here, and he'll help you out. ",
            "score": 1,
            "author": "dhulser",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many thanks. I'm in Systems Thinking and Design right now and loving it. ",
                    "score": 1,
                    "author": "Canon_Goes_Boom"
                }
            ]
        }
    ]
}