{
    "id": "rhd64h",
    "score": 7,
    "title": "What the hell happened at Cornell?",
    "author": "ElephantRattle",
    "date": 1639612663.0,
    "url": "https://www.reddit.com/r/IthacaCollege/comments/rhd64h",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why no outbreak here?",
    "comments": [
        {
            "level": 0,
            "comment": "There’s no outbreak here because our lovely school has optional testing and cornell has mandatory. We probably had an outbreak too we just don’t know thanks to our lovely administration",
            "score": 25,
            "author": "Mau_64290",
            "replies": [
                {
                    "level": 1,
                    "comment": "Considering the number of partiers and careless people, I think that it is mostly just that Ithaca doesn't test people unless they ask them to do so, and that it seems like you have to quarantine if you are suspicious of your status but not entirely sure. It's hard to convince a student to take a test if it means going into quarantine for a few days and being unable to go to class online and then waiting to be able to take a covid test.\n\nLet's face it; even people in the cafeterias stopped wearing masks. From students serving themselves food while their masks were pulled all the way down to some of the staff simply not wearing masks.",
                    "score": 1,
                    "author": "Empink3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was wondering the same thing",
            "score": 4,
            "author": "Annaerb23"
        },
        {
            "level": 0,
            "comment": "I think that a better question is \"when will they ring the alarm bell over covid\" as well as \"what would it take for them to ring the alarm bell\". Ithaca has some really good in-person education for PT, OT, and such, and it's not that there was no way for Ithaca College to have good safety, but it's just that there were some things that they could have done to make people safer and too many people started getting really lax in the end.",
            "score": 1,
            "author": "Empink3"
        }
    ]
}