{
    "id": "sd0y5k",
    "score": 10,
    "title": "possible incoming film student with a question",
    "author": "eggsnatched",
    "date": 1643184627.0,
    "url": "https://www.reddit.com/r/IthacaCollege/comments/sd0y5k",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi everybody! ithaca is one of my main colleges i'm really considering, but i've heard mixed reviews about different sides of campus! i'm an out of state girl &amp; was just wondering what your experiences with ithaca have been like? (&amp; any film students please lmk how the program is)",
    "comments": [
        {
            "level": 0,
            "comment": "29yo living in LA and working in the industry. It’s been several years sense I was at Ithaca but best I can say is take the plunge, work hard, and make friends with other people that work hard. They will be more valuable to you than anything you learn there.",
            "score": 7,
            "author": "Canon_Goes_Boom"
        },
        {
            "level": 0,
            "comment": "I highly suggest going to IC for that line of study. Fantastic college! Gorgeous campus.",
            "score": 6,
            "author": "Robby777777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gorgeous view of the town from campus, aside from an abusive board of trustees warning the campus itself is also in top 50 ugliest college campuses in America and when you start to (try) and understand how the college is laid out you get why- https://www.complex.com/style/ugly-college-campuses/ all the other workers and students are great though",
                    "score": 3,
                    "author": "greyladyghost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been to over 200 campuses and can absolutely tell you that list is trash. Ithaca College has a gorgeous campus and Skidmore College has a top ten campus in all of America.",
                            "score": 0,
                            "author": "Robby777777"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved being at IC. The friends you'll make, especially on Park, will perish whatever negatives you may encounter. I was friends with innumerable Parkies while there and many are still some of my closest friends. Exceptional program, tight knit little campus, beautiful little city.",
            "score": 2,
            "author": "smorgenheckingaard"
        },
        {
            "level": 0,
            "comment": "I went in as a film student who switched to writing. The film school is great, and if you decide your heart isn’t in it anymore, there are a myriad of choices to fallback on. As for the overall atmosphere of the school, I miss it everyday. It’s a great place if you can stomach the cold.",
            "score": 2,
            "author": "copyable-writer-69"
        }
    ]
}