{
    "id": "su4lak",
    "score": 11,
    "title": "Recently accepted and wondering about the culture at Hampshire",
    "author": "millennialgenocide",
    "date": 1645040921.0,
    "url": "https://www.reddit.com/r/HampshireCollege/comments/su4lak",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! As the title reads I recently got an acceptance letter from Hampshire and it’s one of my top choices so far! I have heard how inclusive and liberal Hampshire is and I think that is excellent and definitely a big draw for me. \n      Here’s what I wonder: I really value a diverse range of perspectives and love open discussion. I know that going to a college where the majority hold similar political ideology could mean that there is less variety when it comes to viewpoints.\n       I also know, as a liberal myself, that there can be a tendency for some people to immediately write-off those that hold viewpoints that do not align with their own. \n      I guess what I’m trying to get at is that I want to go to a college where there is less of a black-and-white “This viewpoint is right and all of the others are wrong and if you don’t agree with what I’m saying then you’re a bad person” type vibe that an environment with such homogeneous ideology can bring. I am looking for a school where there is more nuance and room for discussion. \n      How would you regard Hampshire when it comes to this? \n\nHopefully this made sense, thanks! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Hampshire is very left-leaning, but that doesn't mean that there's only one viewpoint for most issues.  People come from a variety of backgrounds, and consequently there's a variety of perspectives.  You won't be shut down for raising a conflicting viewpoint, and in a number of classes challenging perspectives is encouraged to lead all parties to a more nuanced and comprehensive view of the discussion.\n\nThere are some things that aren't really open to debate on campus.  Given how many queer people are here, both as students and faculty, you're not going to win any friends by playing devil's advocate against LGBTQ people as a whole, and will probably make some enemies if you make an attack helicopter joke.  Similarly, no hypothetical arguments in favor of racism or other forms of bigotry.  But I've been in classes where playing devils advocate on subjects like abortion or mandatory vaccinations has been encouraged.  There are certainly some on campus with more black-and-white viewpoints, but Hampshire encourages in-depth discussions\n\nThis extends outside of the classroom too. I've heard debates on communism, gender abolition, and a variety of other subjects while just wandering around campus or sitting in the dining commons. It's far from the only thing that happens on campus, but these conversations are not uncommon and the only time I've seen one end in people being upset was someone suggesting to deport all immigrants",
            "score": 4,
            "author": "thePsuedoanon",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much! all of the points you brought up are things that i would consider not open to debate as well. more and more convinced that this is the school for me, i appreciate it!",
                    "score": 3,
                    "author": "millennialgenocide"
                },
                {
                    "level": 1,
                    "comment": "I want to apply to Hampshire as my first option. However I come from Pakistan and I am heavily disadvantaged with the finances. I read on the international scholar award, but would like to know if anyone here has more details on the eligibility criteria or on how to avail this scholarship. Any other information regarding ways of financial cushions would be appreciated as well. Currently filling my common application.",
                    "score": 1,
                    "author": "Reverbedsentient",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sorry, but I really know little about most of Hampshire's financial page.  You're better off making a post about it probably",
                            "score": 1,
                            "author": "thePsuedoanon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hampshire was a lot of fun. The thing to keep in mind is to have a lot of fun and also study something that will make you a reasonable salary after you graduate. I wouldn't recommend any career path where you can't be making at least $100,000 a year by your late 20s.   \n\n\nFor example, if you are interested in politics, also study data science and machine learning. There are lots of political jobs that require those skills and pay really well.",
            "score": 1,
            "author": "comedybingbong123"
        }
    ]
}