{
    "id": "142wcoy",
    "score": 615,
    "title": "Credit card at 14.3k on 13k limit. I was laid off 5 months ago. What should I do?",
    "author": "tomleeroy",
    "date": 1686092788.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/142wcoy",
    "media_urls": [],
    "other_urls": [],
    "postText": "The bank is calling everyday. I owe 14.3k on a 13k limit. I haven’t had income for 5 months. Savings is gone and I’m in overdraft most of the time on my debit card. What is my smartest course of action? Obviously I’m trying to find a job. I previously had a job as an IT project manager making 123k a year. Help. Please!",
    "comments": [
        {
            "level": 0,
            "comment": "Due to the number of rule-breaking comments this post was receiving, especially low-quality and off-topic comments, the moderation team has locked the post from future comments. This post broke no rules and received a number of helpful and on-topic responses initially, but it unfortunately became the target of many unhelpful comments.",
            "score": 1,
            "author": "IndexBot"
        },
        {
            "level": 0,
            "comment": "Did you tell them you’ve been laid off? Most banks have a department that works with you when under hardship. Ask for the department to provide you with a repayment plan.",
            "score": 1087,
            "author": "Snoo-57955",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tagging onto this to say, i work for a debt collector and communication is so important. They're calling everyday for a reason. If people answer the phone when past due 35 days we can suggest non-profits, internal assistance applications, etc. but if we have 120 days without hearing a peep you've kind of forced our hand. Call them more often then they expect with updates and stick to a schedule for a repayment.",
                    "score": 314,
                    "author": "jtpower99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What happens after 120 days?  I called after getting a letter saying if i didnt respond i was gonna get sued. the phone person wanted to hang up as soon they heard im unemployeed. 2 weeks letter i got a summons.",
                            "score": 23,
                            "author": "Gold_Team_5679",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You get sued. File an answer, dispute the debt, make the law firm prove their case. They’ll be a high volume outfit so your leverage is in making them waste more time, so they’ll want to settle to avoid litigating the case. You can probably work out something like 60-70% over 36-48 months.",
                                    "score": 30,
                                    "author": "superdago"
                                },
                                {
                                    "level": 3,
                                    "comment": "Commenting because I'm in the same boat regarding getting a summons and no idea how to handle it. To say it has made nights fully sleepless is an understatement.",
                                    "score": 7,
                                    "author": "attempt_no23",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "120 days then state and federal laws can come into play. Checking especially may have to go to collections and it becomes a whole different bag of chips. We have depts less then 30 days late, 30 to 90, 90 to 120, and 120+. The 120 has to be the most experienced because it is a while separate swt of rules and laws. Even state laws can come into play there",
                                    "score": 30,
                                    "author": "Quirky-Leek-3775"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Piggybacking off the top comment since I worked specifically in this department for a bank. Talk to the bank and explain your situation, when I was there you can either qualify for a repayment program with 0 or very little interest or a settlement. The bank will offer you absolutely nothing until your account is past due. You have 180 days until the account is officially \"charged off\" which means it's sold to collections. Honestly of you're facing such hardship I would go for a settlement. When I was there and you reached 180 days we could offer as low as 15% of the balance and then it changed to 20%. The older your account is the better the settlement since they risk losing your account. Only catch is this settlement amount must be paid off in 3 months if you miss a payment it charges off and gets sold. The balance you did not pay must be declared on your taxes which is much better regardless. Do not work with a debt collection company they will simply charge you a lot more just to talk to a bank rep for you. Talk to a representative directly. Good luck.",
                    "score": 60,
                    "author": "Funtastical",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you apply for unemployment? If not, do that ASAP. Depending on your state, it may be retroactive to when you got laid off...",
            "score": 167,
            "author": "sirpoopingpooper",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to ask this exact same thing.",
                    "score": 19,
                    "author": "GoCardinal07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always told my wife I'd pick up any-old-job were I laid off...just to slow the bleed.\n\nInterviewing for a career job is important, but so is income.",
            "score": 738,
            "author": "micha8st",
            "replies": [
                {
                    "level": 1,
                    "comment": "Temp staffing if nothing else.",
                    "score": 102,
                    "author": "Deep90"
                },
                {
                    "level": 1,
                    "comment": "What is the point of any non-career job?  Like, the expected value of an hour of interviewing is so much higher.  Drive or deliver with Uber if you need to, because it's flexible, but giving up on finding the next real role is anathema to success.  Just live on your wife's income in the interim.",
                    "score": -3,
                    "author": "nycdevil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The point is stable income. I’m doing gig work right now as I’m trying to restart my career and the problem is they are actually not flexible at all. To make any decent amount of money with these gig apps you have to be logged in all the time. The pay and demand for work is more variable than you would think, and it’s first come first served so you’re always competing with other drivers. If you’re doing gig work as your only source of income it is absolutely exhausting. The unpredictability and extremely low net income are a terrible trade off for the illusion of flexibility.",
                            "score": 63,
                            "author": "foreverlearner101010",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "When laid off I used to apply for jobs until noon and then do something else for the afternoon. \n\nThere is a point of diminishing returns after hitting new postings in the AM and networking and job posting half the day.",
                            "score": 24,
                            "author": "villagewinery"
                        },
                        {
                            "level": 2,
                            "comment": "The point is not ending up like OP. You got an interview? Cool skip that job you can get any day, they problaly won't fire you anyway. Why wear down your car for pennies driving delivery.",
                            "score": 14,
                            "author": "xShooK"
                        },
                        {
                            "level": 2,
                            "comment": "Interesting post in a thread with a guy who’s been unemployed for 5 months and is completely out of cash and credit. Seems like the point of a non-career job is obvious, and “just interview bro” is not always the solution?",
                            "score": 8,
                            "author": "briareus08"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is negative EV to apply to just any job, especially if you are coming off from a 6 figure income with benefits.\n\nJust to get from 14.3 to 13k, op would have to work 2 weeks at $20/hr.\n\nOr he could spend those two weeks actively searching for a job that pays what he is qualified to earn, and make that amount in 3-4 days when he is back at work.",
                    "score": -8,
                    "author": "Shakespeare257",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Two weeks?\nSir or madam, it’s been FIVE MONTHS.",
                            "score": 44,
                            "author": "s0much2say",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And $20 an hour? Not many retail jobs are offering that.",
                                    "score": 7,
                                    "author": "Tsquare24"
                                },
                                {
                                    "level": 3,
                                    "comment": "Seriously, how are people missing this? If OP had rolled straight into a minimum wage job after getting laid off, they’d still be afloat and about 1k in debt.",
                                    "score": 4,
                                    "author": "briareus08"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What's EV mean? OP needs cash flow full stop. Nobody said stop applying to jobs or anything, but he needs to run some DoorDashes or something to at least slow the bleeding right now. There probably aren't enough good jobs for them to apply to in order to fill up every waking hour of the day...",
                            "score": 19,
                            "author": "believe0101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "EV is expected value. I agree with both of you. Applying to low pay jobs would be negative EV for OP, but unfortunately OP is now at a point where he can’t focus on medium/long term EV and instead needs to focus on short/term immediate income.",
                                    "score": 8,
                                    "author": "Ok_Opportunity2693"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Negative EV to apply to just any job? Dude, work is WORK. Especially after five months of nothing.",
                            "score": 9,
                            "author": "antilochus79"
                        },
                        {
                            "level": 2,
                            "comment": "In 5 months, OP would’ve at least made enough to go back under his credit limit. That’s the point as opposed to staying unemployed &amp; using your credit card to live.\n\nIt’s not like he HAS to stay in that lower paying job. Lazily do it while applying applying applying.",
                            "score": 3,
                            "author": "iBeFloe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When was the last time you were applying? Finding any old job is not easy right now.",
                    "score": -44,
                    "author": "nilamo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Finding a regular, retail/food/CSR job is very easy. Uber is easy. It's income",
                            "score": 39,
                            "author": "RelevantJackWhite"
                        },
                        {
                            "level": 2,
                            "comment": "You're kidding right? The entire service and retail industry is criminally understaffed and it seems the people who distribute the stuff to the restaurants and stores are also understaffed.",
                            "score": 69,
                            "author": "samtheninjapirate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im a kitchen manager and yeah, i basically hire anyone, no exp needed at 16$ starting",
                                    "score": 31,
                                    "author": "screaminginprotest1",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you’re able bodied most trade related jobs are hiring anyone with 2 feet and a heartbeat. I get that it’s not a career most want but if you need to feed your family a job is a job.",
                            "score": 58,
                            "author": "Intro5pect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Call centers suck but they are work from home now a days, always hiring, and paying $14.\n\nI’ve e had worse jobs that paid less.",
                                    "score": 31,
                                    "author": "ThisIsPermanent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This comment makes me think about Michael needing a second job because Jan spent all his money, lol. IYKYK",
                                            "score": 7,
                                            "author": "ipetgoat1984"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I haven't seen a single WFH call center job in over a year. Otherwise, most are a good 30+ minutes away from where I live.",
                                            "score": 7,
                                            "author": "IKWhatImDoing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Type in insurance first notice of loss on indeed",
                                                    "score": 6,
                                                    "author": "ThisIsPermanent"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "proof of this? trades absolutely are not just hiring anyone with a heartbeat, you have to know someone to get in on an underpaid apprenticeship",
                                    "score": 0,
                                    "author": "eng2016a",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re probably talking union. My source is me, I’m a licensed CTE instructor and I work with the workforce development committee of our local HBA. I help get students employed every summer, just had two start at a cabinet shop yesterday, hired on the spot. One cabinet shop I work with is 20-30 employees short right now.  One of my main home builders I work with literally cannot find trim carpenters. Plumbers are charging 150 an hour because there’s so few of them anymore.  I’ve got high school kids getting sign on bonuses to work construction jobs.",
                                            "score": 18,
                                            "author": "Intro5pect",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What state is this?",
                                                    "score": 1,
                                                    "author": "ii_zAtoMic"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'll vouch for him.\nSource: carpenter who has trouble finding workers able to simply show up to work in the morning",
                                            "score": 30,
                                            "author": "Ndotterweich",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have a family friend who I believe is a carpenter or something very related. His last hire was a drug addict who lasted 2 days. Why would he hire a drug addict? That’s just how desperate he is for help.",
                                                    "score": 2,
                                                    "author": "foreverlearner101010"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Look on Craigslist. Most construction sites are hiring people to come out and do basic labor. Moving companies are also hiring people. I was curious and seen an add asking for moving help at $25/hr. I ended up calling and worked around 4 hours due to being bored.",
                                            "score": 7,
                                            "author": "Pomp_in22"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes it is, every retail and entry level job is looking for people.",
                            "score": 8,
                            "author": "geoff5093"
                        },
                        {
                            "level": 2,
                            "comment": "unemployment is at a 50 year low.  Hell you can make 80k framing houses where I'm at.  It would suck, but it would pay the bills.",
                            "score": 5,
                            "author": "thefirebuilds"
                        },
                        {
                            "level": 2,
                            "comment": "It’s hilariously easy actually.",
                            "score": 7,
                            "author": "Nkklllll"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can’t you find a job for like 80-90k if you were making 123k? You need to lower your expectations. Hell take a help desk job for 50k if you have to.",
            "score": 362,
            "author": "spazeman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am in IT too, this happen to me, I said to myself the first month I am going to try to look for a job with my same salary, by the 3rd week I was already interviewing for middle paying jobs just to have a Plan B.\n\nAlso, call your bank for the car they can defer car payments for up to 3 months.",
                    "score": 31,
                    "author": "elecboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is good advice not just OP. When you were interviewing what did you say to the question if you were still employed?",
                            "score": 3,
                            "author": "AngzietyMonkey"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Important to note that OP will have to dumb down his resume if he goes this path, as being overqualified is a very real thing",
                    "score": 248,
                    "author": "WCPitt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had to try so hard to get a job at target back in 2015 after being laid off.",
                            "score": 80,
                            "author": "Logger351"
                        },
                        {
                            "level": 2,
                            "comment": "Here it's the secret: You can lie by omission in your CV, and VS adding fake jobs lying, it's not going to give you any problems.\n\nHell, even if they do a Background Check, and ask you why you didn't add some old jobs to your CV, you can always say \"Oh, I didn't find them that relevant for this position, the skills weren't that aligned\" but if you're already being background checked, you're probably so close to finish the process that they will not filter out for over qualification.",
                            "score": 71,
                            "author": "FeelAndCoffee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's kind of dumb. I also work as a hiring manager and if someone is coming to my software engineer job and they don't put their past experience as an elementary school teacher, I wouldn't give a ****. It's not relevant to the position. If a job seemed relevant and I asked them about it and they were shady then yeah it might be a problem but in this scenario? Put what's relevant on your resume.",
                                            "score": 32,
                                            "author": "DefinitelyNotA-Robot",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Just to be clear. I'm not talking about outright lying, like changing dates or adding fake jobs. That's fraud and it's dangerous.\n\nFrom friends who have worked in HR, Recruiting and managers, their advice boils down to something like this: Keep your CV to no more than 3 pages (and if you can keep it to 2 even better) and don't fill it with all your past jobs and education. Keep Just the ones that are relevant to the job. This will make things easier for the company, as they don't have to go through so much filler. Of course, this may vary from industry to industry. \n\n(I know, technically that's against the original meaning of the word CV, but bear with me for a second, if you want let's say a White Collar job, they usually don't care you worked in McDonald when you were a teenager).\n\nAnd if you do this, you should pass the background check anyway, because again, you're not lying. If they ask for more details about the gaps, you should give them. The only reason to omit this information is to bypass the step where some recruiters (or worse, automated systems) simply discard CVs for \"over-qualification\".\n\nIt's not a lack of integrity to apply for a job you are prepared for, but because some recruiters (not all of course) have a preconceived notion of \"yikes, this guy's got a lot of years of experience, he's probably going to ask for an offer above the budget, why waste my time interviewing him?\", we have to play these silly games.",
                                            "score": 2,
                                            "author": "FeelAndCoffee"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely - we have an entry/mid position we’re trying to hire for our small nonprofit and some of our applicants are wayyyyy overqualified for this role and the compensation",
                            "score": 27,
                            "author": "berryjewse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have the salary listed in the job posting? At a previous job I had two jobs I helped hired for, one had the salary range, one did not.  The one that did have the salary range didn’t have wildly over qualified candidates. \nAlso having worked in nonprofit sometimes people will want to take a step back if they are changing verticals or want experience in a particular job function. I.e. a program director who wants grant management experience.",
                                    "score": 7,
                                    "author": "brandi__h"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nobody is going to hire a former Project Manager in a help desk, they know he will stay exactly long enough to find a new job.",
                    "score": 1,
                    "author": "jdiscount"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First priority, is get a source of income.",
            "score": 456,
            "author": "Torcula",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree and that is my top priority. But I’ve been looking for a while and I’m now worried about prospects. I’ve been looking for 5 months.",
                    "score": -271,
                    "author": "tomleeroy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you can't find a job in a few weeks in your field, you should apply for literally anything, just to get something. Waiting 5 months is excessive. Hell McDonald's pays 15 bucks an hour and that's better than depleting the savings and running up debt. That's your play. Get any job and work on securing a better one while you work. Get two even if it's not enough. Sitting around and just applying and waiting isn't going to help at all.",
                            "score": 531,
                            "author": "Odd_Data2458",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When my wife was laid off during COVID, I told her to take her time to apply to the \"right\" jobs...but there was a time limit of 3 months based on our savings at the time. That was her time to apply to ideal jobs and \"stretch\" jobs. After that she had another 1-2 months to land *any* job while continuing to apply and interview.\n\nIf you don't have deep savings/emergency funds, you gotta take whatever you can and apply while working the drive thru or driving Uber or whatever.",
                                    "score": 31,
                                    "author": "P0rtal2",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This math is crazy given his specific numbers…\nMcDonalds $15/hr x 40lbs/wk x 20wks = $12,000 before taxes",
                                    "score": 58,
                                    "author": "EchoWxlf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;40lbs/wk\n\nI mean, he doesn't *have* to eat the food just because he works there.",
                                            "score": 215,
                                            "author": "FredAkbar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Free food is free food. When I was 16 at Long John Silvers, every lunch break was chili fries and I'd take a bag of fries when closing too. It's basically like giving yourself a $1/hr raise.",
                                                    "score": 10,
                                                    "author": "WM46",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're never too rich for handouts, just too prideful.",
                                                            "score": 7,
                                                            "author": "Sorcatarius",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But you definitely can be too old for fast food daily.",
                                                                    "score": 8,
                                                                    "author": "SmarterThanMyBoss"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "12k is more than zero though. Anything is better than the nothing he has coming in now.",
                                            "score": 103,
                                            "author": "Odd_Data2458",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But it cancels out unemployment, takes time/energy away from searching for a lucrative job.\n\nIt's not that simple.",
                                                    "score": 48,
                                                    "author": "MrOrangeWhips",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "OP currently has no income, so I assume no unemployment. Can't find a job as an IT Project manager... which doesn't make sense to me but I suppose location dependent. The point was they should be taking any job they can get at this point.",
                                                            "score": 26,
                                                            "author": "hbk2369"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Except for the fact that income, any income, will limit the amount of unemployment you can get. Not saying the answer is to not work at all, but if you are eligible for $300/week from UI, and earn $300, you get nothing.",
                                                    "score": 28,
                                                    "author": "oakcityhokie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's honestly terrible advice considering $300 a week is 40 hours at minimum wage. Hell even if OP was making $10/h he would be bringing home $400 a week.\nLike I don't understand your point at all.",
                                                            "score": 21,
                                                            "author": "ReallyFancyPants",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Point being working full time may limit opportunities for job searching and interviewing. I am certainly not advocating for people to abuse unemployment benefits, but they are in place for a reason. And, OP has likely already exhausted benefits at this point - but my point is that there are a multitude of reasons why people don’t get a minimum wage job compared to a $100k job previously held - one of which may be that it can work out to utilize unemployment while job searching.",
                                                                    "score": 6,
                                                                    "author": "oakcityhokie",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;but if you are eligible for $300/week from UI, and earn $300, you get nothing.\n\nOP would make double that if he worked 40 hours at $15/hr",
                                                            "score": 8,
                                                            "author": "mattied971",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So basically OP would be working at McDonald's for a gain of $7.50/hr minus taxes. Would you grind a McDonald's job for $7.50 an hour? Or use the extra 40 hours a week job searching or something?",
                                                                    "score": 2,
                                                                    "author": "Teddy_Icewater",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If I were unemployed for five months and struggling with debt, I'd take the McDonald's gig for sure.",
                                                                            "score": 10,
                                                                            "author": "Philip_Marlowe"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "People feel too proud and self-deserving to find a job out of their field or a job that pays less. It's \"below\" them.",
                                    "score": 45,
                                    "author": "SleepyHobo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's the vibe I get from it. I'd rather be a burger jockey than unemployed for half a year while I drown in debt. Job searches can be done while also holding down a temporary job, and if they aren't flexible? Who cares? Move on to a different low rent job until the career job comes along. People just don't like to put in that level of effort and get surprised when they have issues because of it.",
                                            "score": 51,
                                            "author": "Odd_Data2458",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Eh, our youngest kid left a full time job at McDonald’s making 19 something an hour to be a plumbers apprentice making 17 an hour unless it’s a prevailing wage job where he makes between 30-45, which is not most of his work.\n\n*edit- everyone can stop telling us he should take the job and that it will pay a lot more later. We know and he knows, we encouraged him to take this career path when he brought it up. He had been doing it since the first of the year, but on a wait list since last fall. I was just pointing out that McDonalds pays more than $15 an hour in most places and OP can work a job like this until he gets back into a position he wants",
                                    "score": 15,
                                    "author": "kittenmoody",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In a few years he will be making that on every job, because his pay will come from his skill and not legislation.",
                                            "score": 7,
                                            "author": "Teddy_Icewater",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh we are very aware and he is too. We definitely encouraged this career path, and explained to him that right now when the money is good, to live like he is still only making his lower wage.   My point of the post was that McDonalds is paying more than 15 an hour in a lot of places and this guy can do SOMETHING for work while looking for a long term job. We all make sacrifices, our youngest took a pay cut knowing his pay will jump drastically over the next couple of years.",
                                                    "score": 2,
                                                    "author": "kittenmoody"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; If you can’t find a job in a few weeks in your field\n\nBro fucking what? What planet are you living on? Most jobs harder to get than literal minimum wage fast-food jobs have an interview process that is at least this long if not more, and then will typically not have you start until the pay period so their accounting isn’t screwed up. It took almost a month and a half to finish interviewing for the job I got hired at and then another week and a half to start after I accepted their offer. It was over 3 months after I was “laid off” before I started a new job with a paycheck.\n\nUnless you’re ex-Google or ex-Oracle in the CS field or ex-Lockheed Martin or ex-Boeing or something in the engineering field and have recruiters practically breaking your door down, getting a job is a long and difficult process, especially now that any job can and will have applicants from everywhere on the planet.",
                                    "score": 28,
                                    "author": "roguespectre67",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Uhh think that’s their point. OP needs income. They’ve depleted their savings. Get ANY job while he continues to look.",
                                            "score": 52,
                                            "author": "kbc87"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes because OP holding out for a job in the field has worked out great for him. It's possible to work for a bit of money to keep above water or at least from plummeting, while also continuing the search. Did you get this far into debt while waiting or did you have enough saved to cover it? That's the difference in your situation and OP's either have an emergency fund, go into debt, or do a menial job while you look for a real job. It's not really a hard concept to grasp bud, I less you just feel like you are too good to do that or are too lazy too.",
                                            "score": 21,
                                            "author": "Odd_Data2458"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To an extent, it might be wise to find something part time or at a lower level/pay to keep the bills from piling up too quickly while you interview for your desired role.",
                            "score": 9,
                            "author": "gHx4"
                        },
                        {
                            "level": 2,
                            "comment": "Dude… you have to do SOMETHING. Go walk into a pizza place and start delivering pizzas. Go to Home Depot and start stocking shelves! You need income! Don’t wait for the perfect job you are in triage.",
                            "score": 8,
                            "author": "illcrx"
                        },
                        {
                            "level": 2,
                            "comment": "If you haven't found a PM job in 5 months you need to reevaluate.  Either reevaluate your pitch, or reevaluate your expectations.  You are at the point now where your unemployment becomes more of a challenge.\n\nHonestly you need some help in finding a job, or you need to go to like a government role making half what you used to until you find something else.\n\nI have personally hired four PMs since you were laid off.  If it's not the market it's the way you are handling things.\n\nI rewrote this a couple times because it seemed so harsh.  But you made a lot of money as a PM and you are not inspiring the confidence to net you the next role.\n\nAs a PM you should be able to evaluate the possible reasons for your continued unemployment.  If you aren't getting interviews work on your resume and network.  If you aren't getting the offer after the interviews work on your pitch and try completely changing what you talk about during the interview.",
                            "score": 178,
                            "author": "bahlzaq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the job market is terrible right now. not to say OP isn't going at this incorrectly, but just because you personally hired a couple of PMs, it doesn't speak to the job market as a whole",
                                    "score": 88,
                                    "author": "eugenekko",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, as a former project manager, I can say that they get hired in good times, but are often seen as a needless expense in bad times. I lost my job in 2008, and finding a new pm job in marketing/tech was impossible. You don’t need a person to do a job technical people can do for themselves especially with so much pm software. I’ve met pm’s who managed huge it/telecom/infrastructure projects. Once the buildout was done, they got laid off and many were out of work for years. In general, it’s not an actual career, it’s just something you get hired for in boom times and hope you can transition to something else before the bad times hit.",
                                            "score": 25,
                                            "author": "kippypapa",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is it terrible or is it robust? Its so confusing whats going on in the economy right now",
                                            "score": 59,
                                            "author": "hkboy3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks… I thought I had a hair on my screen",
                                                    "score": 90,
                                                    "author": "Baykes408",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Switch to dark mode, you heathen",
                                                            "score": 9,
                                                            "author": "Beekatiebee"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Depends on which industry you're in.",
                                                    "score": 16,
                                                    "author": "saintofanything"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Is it terrible or is it robust?\n\nYes and yes.  If you are in a technical field, there are a lot of layoffs and not as many joba available as a year ago.\n\nOther fields seen to be struggling to find enough people to hire",
                                                    "score": 20,
                                                    "author": "j_johnso",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As a defense attorney I can confirm that defense attorneys are in HIGH demand right now… not so much plaintiff’s attorneys though.",
                                                            "score": 12,
                                                            "author": "Acidroots",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Isn’t that always the case?\n\nMy understanding is a good defense attorney is worth the money you pay them but a plaintiffs attorney is basically a dime a dozen",
                                                                    "score": 4,
                                                                    "author": "TommyTar",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I am a former plaintiffs attorney, 6 months into my new in-house gig. Took over a year of hunting.",
                                                                    "score": 2,
                                                                    "author": "coughcough",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Tech jobs don’t seem to be hard to find. People just have expectations and only look at large companies. My LinkedIn is full of jobs.",
                                                            "score": 2,
                                                            "author": "Dro_Biden"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I am struggling under the burden of doubling the size of my group at work in one month.  So it's robust from my limited perspective.  The official unemployment numbers, as incomplete a picture as they always show, would agree.",
                                                    "score": 7,
                                                    "author": "CletusDSpuckler"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Terrible is a word reserved for much worse conditions.",
                                            "score": 32,
                                            "author": "patrickSwayzeNU"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s fair. I can only go by the data available and my personal experience. Both of those show a robust job market. But there are always going to be segments and areas that are harder to navigate than others.",
                                            "score": 18,
                                            "author": "bahlzaq"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've been having the same issue with the IT market. The market right now is horrible.",
                                            "score": 8,
                                            "author": "NO_SPACE_B4_COMMA",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Or it’s only terrible for the mediocre.",
                                            "score": -1,
                                            "author": "Vorpishly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a person who does hiring, every opening I post gets 150-200 applicants.\n\nAre 149-199 of all 150-200 applicants all mediocre? 99+%?\n\nI don't think so.",
                                                    "score": 8,
                                                    "author": "MrOrangeWhips",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "OP was laid off, has been jobless from 5 months, and has a 5 figure credit card debt. Take a wild guess which bucket they would belong to.",
                                                    "score": 11,
                                                    "author": "Viend"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Two jobs for every job seeker, my friend.",
                                            "score": -3,
                                            "author": "pawnman99",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, because the jobs are f****** s***, that's why nobody's taking them.\n\nHell, if you go look at the job subreddit, there's plenty of posts from people who are desperate and are applying for almost everything, and they're getting told to piss off at the entry level stuff because they're overqualified, and they're not getting responses for the stuff they're qualified for.\n\nI've been job hunting on again off again, even though I'm fully employed, because I'm not happy with my current job, and I'm not having much luck either. Now. Obviously I'm not looking to stock shelves at Target, because that would be a big pay cut, but the lack of responses from decent jobs which wouldn't be mind numbing and which would pay comparably is frustrating.\n\nSo reports that the job market is great and there's jobs out there for everyone are oversimplified and somewhat insulting.",
                                                    "score": 2,
                                                    "author": "Arcane_Pozhar"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I have personally hired four PMs since you were laid off.  If it's not the market it's the way you are handling things.\n\nI definitely agree with your overall point but this is very wrong...market is in a very rough spot right now, take a look at the top posts this month on /r/cscareerquestions (ignoring the posts from new grads) if you don't believe me.\n\nOP is going to need to keep iterating on their resume, but the market is definitely shitty right now and we should empathize with those struggling",
                                    "score": 2,
                                    "author": "femio"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’d double down on this. Also contract might be a way to fill a gap as well. I’m a product manager and while I don’t get a bunch of recruiters trying to poach me for a full time role, I think I could get a contract one in the next week or two.",
                                    "score": 2,
                                    "author": "Powerlevel-9000"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "get moving, do something. work at the damn store, work at a warehouse and keep looking for a job in your career path. Go into something else, HVAC programming and controls is great",
                            "score": 14,
                            "author": "PlasticDreamz"
                        },
                        {
                            "level": 2,
                            "comment": "Lowes, Walmart, food lion, target, Wendy’s.  \n\nStop making excuses.",
                            "score": 20,
                            "author": "Bad_DNA",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Then you need to lower your expectations. Walk into McDonalds and start working there as a cook.",
                            "score": 26,
                            "author": "KCPilot17",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Consider that the online gaming you're fairly heavily involved with, might be causing negative impacts on your time management, motivation, energy, and relationships. \n\nAs with all addictions, facing up to how TFT is taking more from your life than you're getting out of it, is the first step.",
                            "score": 3,
                            "author": "PyramidOfMediocrity"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "at least do like grubhub delivery or something between finding a new job, sheesh. i did grubhub for a while during a financially bad time in my life and i was clearing about $25/hr or so. it was a grind but it was better than nothing.",
            "score": 86,
            "author": "donniedenier",
            "replies": [
                {
                    "level": 1,
                    "comment": "How the hell did you do $25/hr? I’m doing doordash right now in Austin and making $16/17 hr gross and I just don’t see how I could do better than that with how much time it takes to drive to restaurant, wait for and pick up food, then drive to customer.",
                    "score": 8,
                    "author": "foreverlearner101010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did not know you could go over the limit allowed on a card",
            "score": 86,
            "author": "gothbread",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re carrying a balance fairly close to the max and then run into strings of paying partial or minimums, the interest will still grow, its not just gonna stop and freeze. The balance can absolutely exceed the limit, but you can be sure you wont be able to use it until you get under balance.",
                    "score": 59,
                    "author": "Exquitter"
                },
                {
                    "level": 1,
                    "comment": "I'm guessing it is interest",
                    "score": 52,
                    "author": "bros402"
                },
                {
                    "level": 1,
                    "comment": "The interest on $13k at 20% adds up fast",
                    "score": 27,
                    "author": "HistoricalBridge7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "your card only have a 20% interest? I never pay interest but I just checked and mine are at 22.74% and 24.74%. Oof",
                            "score": 4,
                            "author": "Woodshadow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve seen rates in the mid teens to mid twenties. \n\nEdit: mine are 19.74 and 16.45 but I’ve had these for over 10 years.",
                                    "score": 3,
                                    "author": "HistoricalBridge7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mine are all in the 20s including the one or two I've had over a decade. I just don't care about interest rate since I never pay it. All about the rewards and periodically getting a travel card for a year for the bonus points.",
                                            "score": 5,
                                            "author": "CharonsLittleHelper"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve done it many times with Chase and Amex cards without incurring any additional fees or penalties. Not sure if this is something they only offer to those with good standing or everyone",
                    "score": 2,
                    "author": "jeffiesos",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you were laid off, are you not collecting unemployment for some reason?\n\nSomething isn’t adding up with your story.",
            "score": 104,
            "author": "Remote-Grape",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or get severance. Many times you get multiple months of severance.",
                    "score": 23,
                    "author": "Powerlevel-9000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I’m so confused on OP losing a 120K+ job and being in debt 5 months later.",
                            "score": 48,
                            "author": "Remote-Grape",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They must have had terrible spending habits to begin with. If that's the case and they were already in debt before losing their job then also thinking they will find one right away then they may not have curbed their spending much initially driving them deeper in debt. What some people think of as necessity is what others think of as a luxury. Different stokes",
                                    "score": 24,
                                    "author": "samtheninjapirate"
                                },
                                {
                                    "level": 3,
                                    "comment": "He could have barely staying afloat prior to his layoff so the severance/UI only lasted so long.",
                                    "score": 9,
                                    "author": "alwayslookingout"
                                },
                                {
                                    "level": 3,
                                    "comment": "There are people employed in jobs making twice as much and with even more debt",
                                    "score": 7,
                                    "author": "PlaneCandy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, many people are bad with money.",
                                            "score": 10,
                                            "author": "Remote-Grape"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm struggling to understand why people are confused. Mortgage, utilities, car payments  - it adds up fast and faster still if you're living a 120k a year lifestyle.\n\nSh**t, I had an offer rescinded after I left my place of work and I was paying *two* mortgages. And I wasn't making 6 figures. When that income stops, you are f*cked so much faster than you think. Not everyone has rainy day cushions - I certainly didn't.",
                                    "score": 10,
                                    "author": "SnooKiwis2161",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OP states he was laid off. He should have UI and/or a severance, not just be completely out of money and dragged 15K in debt in 5 months.\n\nOP doesn’t have an income problem, he has a money problem.",
                                            "score": 2,
                                            "author": "Remote-Grape"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Its not confusing hes just the average american. Never thinks about the future, doesnt have enough money saved, never made a plan for things going south",
                                    "score": 17,
                                    "author": "Striking_Book8277"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also, is no one catching how badly in debt OP is in considering they had previously made 6 figures??\n\nRan out of savings, overdrafts on debit, $14.3k on credit. NO attempt at picking up a temp job in 5 months to stop over drafting &amp; get under $13k??\n\nAnd if OP had a family like others are suggesting, what tf is OP doing staying unemployed instead of just picking up a similar job or any job to stop increasing the money owed?? There’s no logic",
                    "score": 3,
                    "author": "iBeFloe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you thought to work with a recruiter or temp agency if you don't want to go the retail route to bringing in some income?\n\nI don't work in IT but we've gotten several of our employees through recruiters.",
            "score": 12,
            "author": "IronicSunshine83"
        },
        {
            "level": 0,
            "comment": "Apply at your local Costco warehouse. Apparently people love it",
            "score": 120,
            "author": "bass-masta",
            "replies": [
                {
                    "level": 1,
                    "comment": "$29 an hour and I pay $5 a week for excellent insurance with only a $550 deductible and $3 prescriptions. \n\n2 bonuses a year and time and a half on Sundays. I would say about 80% of the workers at my warehouse in any given position have a college degree, from cart pushers and food court, to management. It’s not $120k a year, but it is excellent, can’t complain. Some of this is warehouse specific, but there is also tons of advancement opportunities. They really encourage everyone to move up the ladder and they do their best to facilitate that happening if that is your goal. Managers often make more than $120k, GMs make more than surgeons in many parts of the country, and a college degree is not at all required to move up after you’re hired in. I love it, and look forward to going to work everyday, which is quite rare. The work culture at my store specifically is incredible, but of course that is going to vary from store to store. \n\nI highly recommend applying for anyone considering it.",
                    "score": 55,
                    "author": "helpme9282828",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you get to eat at the food court for free ?",
                            "score": 10,
                            "author": "fugazzzzi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately no, but I think I would quickly die of a heart attack if the food court was free for employees lol. I do not need the temptation of free pizza and hot dogs at my disposal everyday.",
                                    "score": 15,
                                    "author": "helpme9282828"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Costco is not easy to get into. He should still apply though.",
                    "score": 29,
                    "author": "Nuplex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I should have mentioned that in my comment. It is quite hard to get into. My warehouse hires 2 people a year on a good year. They keep maybe 1-2 seasonals out of 70+, sometimes it’s none. The turnover is extremely low so it’s rare for positions to open up. Usually when a position does open up it’s because someone was promoted or transferred stores. I think work culture plays a big part in positions opening up though, so there may still be a decent shot at some warehouses! \n\nI would still try though too.",
                            "score": 17,
                            "author": "helpme9282828"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It pays decent compared to other retail jobs and the benefits are great.",
                    "score": 31,
                    "author": "Odd_Data2458",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "3 month hardship extension. Or better yet just call and apologise and say you can make the minimum payment + $50 to avoid further collection activity.\n\nAlso you better be on Doordash or Uber or Amazon or something. Yes they suck and you may make $10ph, however it will keep things like this from ticking along and feed you.",
            "score": 30,
            "author": "citizenofconcern"
        },
        {
            "level": 0,
            "comment": "Do you have a paid off car?  During the dotcom boom-&gt;bust I was a few weeks away from bankruptcy.  I had a lead on a job that I thought was going to pan out, but it was going to take 2-3 months to do so.  But I had a paid off car - a loaded 5-6 year old Nissan Maxima.\n\nI was able to sell the car for about $10,000 in cash, and then due to having good credit buy a new car with $0 down.  Payments were sky high ... but I turned a capital asset (car) into what I needed at the time (cash) at the cost of having a new future liability.\n\nWasn't the circumstance I wanted to find myself in.  But it worked.",
            "score": 10,
            "author": "Marathon2021",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Get a job - anything. McDonalds, Walmart, Costco, anything. Get some money coming in while you look for jobs in IT again.",
            "score": 34,
            "author": "bros402"
        },
        {
            "level": 0,
            "comment": "Plasma donation center.\n\nMedical trials/studies, there are some related to COVID research. \n\n\n\nIt's summer camp season, most camps just need an adult that can pass a background check to serve as a director or supervisor. Some overnight camps will even house and feed you too. \n\nIf you're in a metro area, stadiums are always looking for staff, for large events they also look for people to clean up after events and cut a check the same day(sometimes, but usually about a week) \n\nNight crew at certain warehouses(Not Amazon or UPS) some have special pay incentives that, the faster you work, the better pay you can receive.",
            "score": 25,
            "author": "lilblu399"
        },
        {
            "level": 0,
            "comment": "Credit consolidation loan from a credit union. Basically they are buying your debts. Maybe 8-6% interest on the principle.  Best thing you can do is stop swimming with the sharks.",
            "score": 8,
            "author": "RoughFriendly3347",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can’t even get one to consolidate because my credit is so shot",
                    "score": 4,
                    "author": "FoodIsLifeAlways",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro, it might be time to start freelancing and/or working a labor job until you get back on track. Letting yourself go bankrupt because the IT job market is competitive right now isn’t doing yourself, or your family, any favors.",
            "score": 8,
            "author": "Sprinkler-of-salt"
        },
        {
            "level": 0,
            "comment": "Here are some temporary job ideas. This pays well the US Post Office is hiring note it sometimes takes feds three months to hire someone. https://about.usps.com/careers/welcome.htm Take the test and apply for jobs anywhere in USA.\r  \n\r  \nAmtrak is hiring https://careers.amtrak.com/  Jobs exist in most states.\r  \n\r  \nUS Forest service is hiring https://www.fs.usda.gov/working-with-us/jobs \r  \n\r  \nThese also pay well you may not qualify for all of them https://www.fool.com/slideshow/not-many-people-want-these-jobs-and-s-why-they-pay-well/\r  \n50 jobs over $50,000 without college https://www.mrmoneymustache.com/2013/07/25/50-jobs-over-50000-without-a-degree-part-1/",
            "score": 19,
            "author": "visitor987",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Are you getting unemployment? We need to know income and expenses to best help.",
            "score": 4,
            "author": "Iwillnotbamboozle"
        },
        {
            "level": 0,
            "comment": "You need to talk with them. They are reasonable. It’s not the mob. They aren’t going to break your legs.",
            "score": 3,
            "author": "Diegobyte"
        },
        {
            "level": 0,
            "comment": "Dude, once you figure the debt and job thing you need to really review how you were handling  and spending money.\n\nYou cannot earn 120k a year and only have savings that last you 5 months.",
            "score": 68,
            "author": "Gybrynz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends on where they live and other things. Overall I agree with you, but if OP has kids and stuff it’s a lot harder.",
                    "score": 22,
                    "author": "kippypapa"
                },
                {
                    "level": 1,
                    "comment": "It wasn't 5 months of savings since he is also over 14k in cc debt. Tough situation.",
                    "score": 5,
                    "author": "DragonfruitNo9033"
                },
                {
                    "level": 1,
                    "comment": "Agree  with you. However, It's easier said than done. \n\nOP learned a hard lesson.",
                    "score": 5,
                    "author": "Amarubi007"
                },
                {
                    "level": 1,
                    "comment": "Seriously, I’m over here on a teacher’s salary fantasizing about what I’d do with $120k a year. That’s $2k a month you could put away into savings easily",
                    "score": 25,
                    "author": "Coffeecor25",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not if you’re in HCOL and have student debt",
                    "score": 10,
                    "author": "dadsmayor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sound stubborn to find a high paying job. Get anything for now!!!",
            "score": 14,
            "author": "Greg_Pim"
        },
        {
            "level": 0,
            "comment": "Get a source of income then see if you can get a loan elsewhere to pay it off. You’ll have to pay off that loan, but likely not at 27% interest rate.",
            "score": 7,
            "author": "Sweet_Celebration369"
        },
        {
            "level": 0,
            "comment": "If you have a home you can rent rooms out . Even if all the Bedrooms with you in the garage.If your in an apt downsize to renting a room or staying with a relative. Make sure your gone all day and only sleep and shower there until job",
            "score": 3,
            "author": "Fancifaceme"
        },
        {
            "level": 0,
            "comment": "Get any job asap or  Uber eats/instacart/etc til you find something in your field. Call banks",
            "score": 3,
            "author": "Sure_Personality_156"
        },
        {
            "level": 0,
            "comment": "I would consider looking into credit card counseling. If you're facing hardship there are programs that can close your card, take on your debt, and have you commit to a monthly payment at a lower interest rate. They charge a monthly service fee, but they can make your debt feel WAY more manageable. I incurred a lot of expenses trying to get out of a bad living situation a few years back and used Cambridge Credit Counseling. I'd definitely recommend checking it out.",
            "score": 3,
            "author": "bastardoutofcarolina"
        },
        {
            "level": 0,
            "comment": "I think the beat advice I've seen here is to aim slightly lower for the job you're trying to get. And just dumb down your resume a bit.\n\nCall the CC company and explain the situation. They want you to pay your card back eventually - so they should help in times of trouble.\n\nStep 3 is to prevent this from happening again.",
            "score": 3,
            "author": "Vtron89"
        },
        {
            "level": 0,
            "comment": "Don’t understand how can someone who had a job of $120k/year can go in debt in 5 months…that’s just fucked up im sorry but please seek employment as in any kind of employment. DoorDash or Uber is a great way of side income while you look for other jobs in your field.",
            "score": 10,
            "author": "Ok-Audience-7914",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP was probably is some debt to begin with and then didn’t cut back at all until card was maxed out.",
                    "score": 6,
                    "author": "Fr33PantsForAll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "have you answered the phone? You need to let them know what's going on to see if they'll work with you",
            "score": 4,
            "author": "kynthrus"
        },
        {
            "level": 0,
            "comment": "Why haven’t you been driving for Uber for the last 5 months?",
            "score": 5,
            "author": "Tasty_Truck_4147"
        },
        {
            "level": 0,
            "comment": "Become an Uber driver ASAP?",
            "score": 2,
            "author": "Marathon2021"
        },
        {
            "level": 0,
            "comment": "drive uber every night for a few hours. it’s not a lot but it’s something",
            "score": 2,
            "author": "CallMeJimi"
        },
        {
            "level": 0,
            "comment": "You haven't found a job in 5 MONTHS?\n\nWhat the fuck have you been doing?\n\nGo get a job. McDonald's, grocery stores and Walmart is always hiring. Some money is better than no money. And if you stick it out in those high turnover jobs, they'll make you a manager with full benefits in no time.\n\nThere's literally dozens of jobs you could apply for and get within a day. You have no excuses.",
            "score": 14,
            "author": "RangerSkyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Home boy is holding out for a “remote position” cause he refuses to go back into office",
                    "score": -3,
                    "author": "texas_made1836",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lazy ass mfers. Will bitch all day about \"can't find a job\" but sits around playing videogames and posting on Reddit instead of going to work.\n\nSome people's kids, man.",
                            "score": -11,
                            "author": "RangerSkyy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Waiting 60 hours to play a game in the past 5 days and he's worried about prospects lol \nThere are jobs available and he's not here looking for answers.",
                                    "score": -1,
                                    "author": "knowledge84"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to any company that you’re familiar with their software. You could be an implementer or solution consultant",
            "score": 3,
            "author": "16whiskey"
        },
        {
            "level": 0,
            "comment": "Don't pay the creditors a dime.  Your money is for #1 food, #2 phone, and #3 housing/car in that order.\n\nTalk to the credit cards about how you are in a life and death emergency situation and you need the cards put on hold or closed... I was in the same situation before and they did not help in any way, but its worth a shot.\n\nIgnore the debt collector calls and just focus on getting through each week.  Get on food stamps ASAP and any local resources to help you pay rent, these might be labelled \"homelessness prevention services\".  You should ask on your local city subreddit about services you can apply for while you are looking for work.\n\n\\*Oh also if/when you get any paychecks or any money, try and cash it directly and/or keep most of it out of your bank account.  The credit cards might be able to steal funds directly from your account without you authorizing a payment.\n\n\\*reply to u/youwish813 since the thread closed.  I fell behind on payments for 7 months until I was working more and could start repayment - including the significant interest that accrued those 7 months. Took me until the May 2020 COVID unemployment payments till I was able to pay it off finally.  I'm close now to having those missed payments off my credit report (after total 7 years), and currently have full time job and good credit.",
            "score": 5,
            "author": "pressedbread",
            "replies": [
                {
                    "level": 1,
                    "comment": "If they were no help in any way, how did you finally resolve your debt? Did you just stop paying them?",
                    "score": 2,
                    "author": "youwish813"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in software as well, also super used to debt paying off large student loans.\n\nI agree, look for any job. You're going to run out of money for food/rent soon from the sounds of it. Don't care about the credit card, you gotta write it off. It will hurt your credit,  but credit is a joke and you can build it back in like a year and some effort.  It will be a long time before they sue you, so you are good.\n\nGet enough income so you can have food/shelter/clothes etc. Those would be my first priority and I would care fuck all about debt until those are taken care of.",
            "score": 9,
            "author": "drwebb",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Don't care about the credit card, you gotta write it off.\n\nHow exactly do you plan on doing that? That would be bankruptcy, and you're not coming back from that within a year.",
                    "score": 13,
                    "author": "KCPilot17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's frankly horrible advice. You don't just mentally forget about $14k in CC debt. You'll be sent to collections, potentially sued, and your credit will be ruined for years. It is certainly NOT within a year.",
                                    "score": 23,
                                    "author": "KCPilot17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed it’s way more complicated and troublesome than the guy you’re responding to makes it sound, but bankruptcy/defaulting are very real options for OP and may be the best course of action despite your legitimate points.",
                                            "score": 7,
                                            "author": "Bitter_Coach_8138"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What should you do? Idk maybe get a source of income? Everywhere is hiring right now it will he a low wage job ofc but temporary so who cares.\nI genuinely think this post is bait.",
            "score": 4,
            "author": "irockgh333"
        },
        {
            "level": 0,
            "comment": "Imagine being so prideful and lazy that you can’t pick up a delivery job or something to hold you over, thus putting yourself into a pile of debt AFTER you were previously making 120k a year. Where was your 6 month emergency fund????",
            "score": 6,
            "author": "Tbonejak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Going to his $850/mo car payment.",
                    "score": 14,
                    "author": "keliix06",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cut your credit card in half. That's the only other advice I would add to others comments.",
            "score": 2,
            "author": "KickAClay"
        },
        {
            "level": 0,
            "comment": "If you have a Roth IRA, you can withdraw however much you have put into it tax and penalty free, just FYI",
            "score": 2,
            "author": "lurkishdelight"
        },
        {
            "level": 0,
            "comment": "You need to get three jobs, any jobs, right now. You have got to start bringing in some income. Next, you need to get on written budget that lists out your income ($0 right now), expenses, and debts. Because you have no income and no savings, you are in critical alert mode and need to conserve every dollar you can for basic expenses. Don't make any debt payments because you can't. If your account gets closed and sent to collections, so be it. You can deal with that later. I would call your creditors and explain the situation and ask for leniency. They may work with you. \n\nMove back home, get roommates, get 3 jobs today.",
            "score": 3,
            "author": "Cluedo86"
        },
        {
            "level": 0,
            "comment": "Why haven’t you been able to find a job?",
            "score": 3,
            "author": "LordOfWintrfell"
        },
        {
            "level": 0,
            "comment": "How do people even let that type of debt add up? I’m at about $300 in debt right now &amp; i get extreme anxiety about it all the time. $14.3 THOUSAND? Please seek mental &amp; financial help. Also, cut up &amp; burn your credit cards.",
            "score": 0,
            "author": "luvgothbitches"
        },
        {
            "level": 0,
            "comment": "es very baffling how someone made 123K a year and es on reddit asking for finance advise....",
            "score": 1,
            "author": "mrcheaptimes"
        },
        {
            "level": 0,
            "comment": "Man get a job doing construction until you’re back on your feet job wise. Anything to pay the bills. I’m not being mean, just brutally honest with you if you were really looking for a job you would have found one by now. Indeed is great for entry level jobs, It doesn’t matter if they seem beneath you or not you need income. Good luck",
            "score": 1,
            "author": "mountaina12345"
        },
        {
            "level": 0,
            "comment": "You were making $123K a year and not only spent it all along with all of your savings but also went negative within 5 months? Literally how is that possible?",
            "score": 1,
            "author": "meatydp"
        },
        {
            "level": 0,
            "comment": "Have you been on unemployment? Or tried doordashing? I would do those things before I ever touched a credit card for the exact reasons you’re going through now.",
            "score": 1,
            "author": "cooldaniel6"
        },
        {
            "level": 0,
            "comment": "Find income talk to bank. Confused on how someone goes with zero income for five months. Note I'm taking about income, not a job.",
            "score": 1,
            "author": "clarkbartron"
        },
        {
            "level": 0,
            "comment": "Can you get a job driving a forklift in a warehouse? It can lay surprisingly well, and it's actually kind of fun job (for a short stint)",
            "score": 1,
            "author": "FollowJesus2Live"
        },
        {
            "level": 0,
            "comment": "Places are hiring even if it’s not your dream job or even one in your field some money in is better than none.",
            "score": 1,
            "author": "diablo69696"
        }
    ]
}