{
    "id": "144avy7",
    "score": 0,
    "title": "Can I afford to take a year off work?",
    "author": "No_Act_5441",
    "date": 1686234730.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144avy7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking for general opinons/advice on if I can afford to take 6 months to a year off work, I'm 34 with no kids and a long term gf, currently make around $80K before taxes, no debt whatsoever, $30K in high yield savings,  $35K accessible in cash value from a life insurance plan that I'm going to cash out at some point (no plans to ever have kids who would need it),  $27K in stocks (mostly ETFs), 45K in 401k, 5K in a Roth, and vested in a pension that would pay roughly $7,500/year (if I quit this year) when I hit retirement age but that could go up based on cost of living adjustments over time. \n\nReally don't like my job and want to start a new career but think I need some time off work to figure out what it is I want to do and maybe travel a bit more. I am just finishing my yoga teacher certification so would probably teach and bring in some $ during the time off but definitely wouldn't come close to what I'm making now.  \n\nAs far as expenses I figure I normally spend around $2K per month including rent/utilities, and that will go down to $1500 or less soon when my gf moves in next month and we start splitting rent/utilities. \n\nNot 100% committed to taking time off but was wondering if it was a feasible option or would set me back too far financially to consider it. \n\nThanks!!",
    "comments": [
        {
            "level": 0,
            "comment": "I would take less time off and actually travel or adventure. Reinventing yourself in next career is more important than time off.",
            "score": 3,
            "author": "Ok_Leg_6429",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think secretly this is what I want to do haha,  I know some basic Spanish now but was thinking I could do one of those work abroad gigs for room/board in a Spanish speaking country so I could become more fluent",
                    "score": 1,
                    "author": "No_Act_5441",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So why strain your relationship with the GF by having her move in and your finances by having a apartment when you really want to travel? You need to figure out what you really want to do first.",
                            "score": 1,
                            "author": "Dopeshow4"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends what your definition of \"can I afford it\" is. Let's assume with that 80k salary that you would have taken in about 55k after taxes. What would you do without that money? \n\nPersonally, I think it's a dumb decision.",
            "score": 4,
            "author": "Super_Mario_Luigi"
        },
        {
            "level": 0,
            "comment": "What is your plan for health insurance?",
            "score": 2,
            "author": "wanttostayhidden"
        },
        {
            "level": 0,
            "comment": "&gt;Really don't like my job and want to start a new career but think I need some time off work to figure out what it is I want to do\n\nWhy do you need a year off for that? Can't you just think about it in your spare time?\n\n&amp;#x200B;\n\n&gt;As far as expenses I figure I normally spend around $2K per month including rent/utilities, and that will go down to $1500 or less soon when my gf moves in next month and we start splitting rent/utilities.  \n&gt;  \n&gt;Not 100% committed to taking time off but was wondering if it was a feasible option or would set me back too far financially to consider it.\n\nSince you have $30k in savings, of course it's feasible.\n\nThe real question you need to ask yourself (and your girlfriend) is if it makes any sense.",
            "score": 4,
            "author": "GeorgeRetire"
        },
        {
            "level": 0,
            "comment": "How does your GF feel about your plans for her to subsidize your year finding yourself through yoga?",
            "score": 0,
            "author": "estherstein",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure how you got that, she's moving in so we'd be splitting everything (rent,utilities,food, etc) 50/50, which is helping her out too. Wouldn't be asking her to pay anything for me at all. Also she's taken off work for months previously so she's supportive. I definitely didn't say anything about \"finding myself through yoga\", just mentioned I was finishing up my teacher certification as I have already been asked to teach at 2 different studios upon graduation so I could make a bit of income that way to help offset the loss of income from my primary job.  Wouldn't be alot of $ but probably a couple hundred a week.",
                    "score": 1,
                    "author": "No_Act_5441",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Snarkiness aside, I think this is a terrible idea. Don't throw away an existing career and pension for vague dissatisfaction. Your savings are not robust enough to carry you through a difficult job search.",
                            "score": 2,
                            "author": "estherstein",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed.",
                                    "score": 1,
                                    "author": "Dopeshow4"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TL : dr : Can you manage it? Probably yes. Should you? Not that easy to answer.\n\nIn the short term : With no debt, 1.5K - 2K monthly expense and liquid funds of ~65K (30K savings + 35K cash value) : you could do it.\n\nAgainst that : \n\nYou'd be draining out around 12 - 24K from your savings; building back will take time, and if you have other goals / requirements (down payment for a home / replacing a car / unexpected expenditure) - you'd feel the pinch for longer.\n\nBeing debt free and with some retirement savings : those are a plus; but the general thumbrule at your age (34) would be around 1-1.5x annual income as retirement savings to be \"safe\".\n\nThird : Finding a new line and making a start can be a slower process; and if you're not earning at that time, that can become a challenge.\n\n\nDo you have the option to take \"time off\" without pay, or do you have to quit your job? If you can retain the option to come back to the job (and keep working through a transition); that would be easier than quitting and having to then figure out the next steps.",
            "score": 1,
            "author": "myze551ml",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think part of it is that I want to enjoy life a bit too, travel a bit and hopefully find a job that I enjoy but also keeps a roof over my head.  Of course most responsible decision is to just keep plugging along but get the feeling I need to enjoy this time in my life before I get too old to travel on the cheap and too set in my ways to start over career wise. \n\nThanks for the thoughtful response, definitely helps put it in perspective!",
                    "score": 1,
                    "author": "No_Act_5441"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is taking a year off work an optimal financial decision? No. Will taking time off allow you to clear your head, recover from burnout, and figure out what you want to do with your one wild and precious life? IMO, yes. I've done something similar and have no regrets.\n\nWhatever you calculate your runway to be for this adventure, build in more time than you think you need for your job search at the end of it. Especially if you're changing careers, it may take awhile to land a full time job. Having some cash flow from teaching yoga is a great idea. Make sure you and your partner are on the same page about your plans.",
            "score": 1,
            "author": "CoolSlide1960",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice and alternate view point, much appreciated!",
                    "score": 1,
                    "author": "No_Act_5441"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do not count on yoga as a source of income. It was always super competitive to get a teaching spot at a studio, and the industry has not fully come back since covid, making it even more difficult. \n\nAlso, on a personal note, I've lived with people who worked and people who didn't work before -- taking time off work at the same time as you're moving in together may put a strain on your relationship. Suddenly having a lot of free time can be great, but can also lead to boredom or doing things you might not usually do (like create a ton of mess in the kitchen because you're baking more, or pester your SO to hang out more often than usual because you're bored). \n\nIf you think of what you'd like to try out for your next career before starting the year off, you might be able to use the time taking some training classes in the field. \n\nPlanning some time for rest or travel is good, but be aware of the downsides as well. Also, would your job let you take a leave of absence instead of fully quitting?",
            "score": 1,
            "author": "effectivemarshmallow"
        }
    ]
}