{
    "id": "144c31e",
    "score": 0,
    "title": "If you make under 40k a year, most advice will not apply to you",
    "author": "xlem1",
    "date": 1686237582.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144c31e",
    "media_urls": [],
    "other_urls": [],
    "postText": "If you make under 40k a year, the sad truth is that the only financial advice you need is to get a better job. The jobs exist, they are not impossible to find, you just have to put a lot of time and effort into finding them.\n\nCutting back on expenses, working a second job, balancing credit card payment, retirement payments&gt; all bullshit you that will not meaningfully impact your life compared to making more money.\n\nLet's run a budget real quick. I'm going so cheap here, so bare with me, say you make 15$/hr  or about 30k a year monthly take home pay is about 2k a month after tax\n\n- rent 500$\n- utilities 100$\n- car payment and insurance 300$\n- gas 100$\n- food 300$\n- phone + internet 100$\n- various groceries 100$\n\nA nice $1500 on mandatory expenditure that I heavily underestimated, at best you can put aside 700$ a month, putting in all your effort, saving money, and cost cutting. You know what else gets you that 700$? A 5 dollar pay raise.\n\nWant to get that much doing gig work? That's almost 15 hours a week. If you put that time into getting a certification or job searching, you could get a 3 dollar pay raise in as little a 3 months. \n\nBe smart about where you put your energy, you're not invincible, and you can sustain a life of bare minimum living forever. Use that extra energy and focus it as best you can.",
    "comments": [
        {
            "level": 0,
            "comment": "The reason people recommend things like getting a second job/gig work or look to cut expenses is because both of those things are much easier than finding a higher paying full-time job, as you yourself acknowledge. Finding a better job is much easier when you're not struggling day-to-day and spending cuts or picking up a bartending job or whatever are ways to get your head above water so you have the space to make more significant changes in your life.\n\nAlso, I'm not sure how working a second job is \"bullshit that will not meaningfully impact your life compared to making more money\" when working a second job is quite literally a mode of making more money.",
            "score": 12,
            "author": "tired-gay-raccoon",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is better to work 1 job and spend your extra energy to improve your wages at that job, than to work 2 jobs and not have the time or energy to further your earnings.\n\nIt is th most effective and sustainable way to improve your quality of life. The reality is that part-time work has a cap on earnings, and most will not pay more than 15-20 an hour and they come an additional cost to mental and physical health, and do not come with additional benefits.\n\nAnd the harsh reality is you will not make  progress working 2 shitty jobs. If I'm constantly looking to improve my main income source, it will go up, and for the most part, it is sustainable to do for anyone up until the 80k year range. Working 2 serving jobs? I'll be stuck at the same pay rate, basically my entire career, and as I get older, and more things happen in my life my income will only go down as I can't keep working.\n\nSo when I say working 2 jobs will not improve your life, I mean they will keep you stuck where you are. Maybe there are people out there who can do it, but most can't",
                    "score": 2,
                    "author": "xlem1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always have to remember that budgets are relative to location. Specifically with food, where many who make those wages are not spending $400 a month on food and groceries. I only spend $200 in a small - medium city. Small things like that radically change the monthly outlook of a budget.\n\n&amp;#x200B;\n\nBut overall do agree, most financial advise on this sub favors higher earners given that is likely most of its userbase. That doesn't mean there aren't subs that favor other demographics though - IE r/povertyfinance",
            "score": 3,
            "author": "SpyJuz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I assume around 10$ a day with an additional 20$ each week for going or some bullshit. At less than 5 dollars a meal, that's pretty cheap.\n\nAssuming you are very good at eating cheap, sure you can drop to 200$ but it's a lot of effort to eat that cheap. You never go out with friends, never splurge for a coffee, and definitely no alcohol.\n\nThe point is if you are putting that much energy into getting 200$ a month? You should be using it to improve your earnings.",
                    "score": 0,
                    "author": "xlem1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you would be surprised what people that make under 40k can do. You have a distorted view of how people handle money. Your budget might be good in some places. But, until you live it you will not understand the drive people have. I know a few that lost their job, but had saved enough of an emergency fund that they were able to survive. Even if it took months to find that other job.",
            "score": 5,
            "author": "stoneycrk55",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have lived it, and I'm only able to say this because I was very lucky. Building a sustainable financial life under 40k really can only come from improving income sources. \n\nIf you are spending all your time and energy cost cutting and saving, instead of building a career and improving your earnings, you are wasting your efforts.\n\nIf you are out of a job for months and making under 40k a year, I'm sorry, but the average waiter can make almost 40k a year.",
                    "score": -2,
                    "author": "xlem1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry but I heartily disagree.  If you look at my Social Security earnings record you would assume that today I am living on the edge. \n\nThe most I made from salary in any year was $53k. In the 60's my highest salary was $6800, in the 70's I topped out at $11,614.  I soared to $21k in the 80's but only for 1 year.  In the 90's I consistently made $20k plus and finally made $30k in 2 years.  It wasn't until 2005 that I made $42k in salary and topped out at $53k the year before I retired.   I was laid off in 2012 and I made $69k that year but that sum includes the $27k they paid me not to sue them.\n\nToday I am worth over $1M and living in my 8th house.  Houses are one of the routes to my current net worth.  The other key was investing in stock and consistently doing so even if all I could send was $25 that month.  \n\nBut I am frugal, lived in a co-op for 5 years, almost always had room mates or tenants and was lucky enough to have had a partner 3 times in my life for a total of 33 years.\n\nIf you are single and making $40k and live alone and drink lots of lattes, yes there is little you can do but get a better job.  But don't dash the hopes of low wage earners with your you can't make it attitude.",
            "score": 0,
            "author": "txholdup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cost of living has outpaced wages since you were working\n\n30k in 2000 = 53k today\n\nUS median rent in 2000 was $602. Today, it's $1,967\n\nUS median home price in 2000 was $119,600. Today, it's $363,000\n\nI won't even go into things like groceries, gas, healthcare, cars, etc.\n\nIt's a lot harder for people today making low income than it used to be. Everything has gotten expensive relative to wages. It's not the lattes.\n\nSources:\n\nhttps://www2.census.gov/library/publications/decennial/2000/briefs/c2kbr-21.pdf\n\nhttps://www.rent.com/research/average-rent-price-report/\n\nhttps://www.census.gov/library/publications/2003/dec/c2kbr-20.html#:~:text=The%20median%20value%20of%20a,to%20findings%20in%20Census%202000.&amp;text=This%20value%20represented%20an%20increase,%24101%2C100%2C%20after%20adjusting%20for%20inflation\n\nhttps://www.cnn.com/2023/03/21/homes/existing-home-sales-february/index.html",
                    "score": 6,
                    "author": "Abstract__Reality"
                },
                {
                    "level": 1,
                    "comment": "I don’t understand how people can *possibly* be so willfully ignorant to still make comparisons like this",
                    "score": 3,
                    "author": "BigLorry"
                },
                {
                    "level": 1,
                    "comment": "You prove my point\n\n* 6800 in 1969 = 56k in today's money\n* 11k in 1979 = 45k in today's money\n* 21k in 1989 = 51k in today's money\n* 30k in 1999 = 54k in today's money\n* 42k in 2005 = 65k in today's money\n* 68k in 2012 = 91k in today's money\n\nYou have constantly made more than 40k your entire life. Your income has maintained a steady growth. It's no5 about drinking latte, it is about improving financially, and that comes from putting your effort in the right places, and at under 40k, the number one area should be improving your main income source.",
                    "score": 4,
                    "author": "xlem1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You prove your point by grabbing the highest numbers.  How much was the $307 I made during the year 1970 worth?  I boosted my income to $383 for the year of 1971 I bet that was worth a fortune.",
                            "score": -2,
                            "author": "txholdup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't do inflation calculation on non-existent numbers\n\nI took the numbers provided with the latest possible year in the decade you gave. I was not cherry picking, I did my best to do the opposite. I can't say what you made every single year of your life.\n\nBut, what I didn't mention is that you seem to have built a majority of your wealth off or real-estate. Real estate prices have increased at a greater rate than inflation by nearly 150%. The accessibility of buying property was much easier in the 1980. \n\nI'm sorry, but I don't really care if you managed to scrape by in the 1970 off a basic job, the reality is thst in today's dollars 40k is bare minimum for building any financial stability and getting to that point should be your first priority.",
                                    "score": 4,
                                    "author": "xlem1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I was making 40k and living alone, I could not afford lattes.",
                    "score": 1,
                    "author": "Pimp_Daddy_Patty"
                },
                {
                    "level": 1,
                    "comment": "I feel like it's such an old-people/Boomer thing to blame the inability to afford life on a low salary on \"lattes\".\n\nLike others said, you lived in a time period where those salaries were *actually livable* and housing prices were consistent with said wages. \n\nNot to mention the privilege of being able to afford and purchase homes during those times -- I know folks who were rejected for homeownership due to race in those time periods (it was literally written in the deed that it couldn't be sold to them). \n\nI can bet you 100% that if you were to make those same salaries today there would be NO WAY you would be able to afford those same homes at their current prices, no matter how many lattes you decided not to buy or how many roommates you have.",
                    "score": 1,
                    "author": "kimchi_paradise",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is is such a Gen Z to focus on one part of an answer and ignore the rest.",
                            "score": -1,
                            "author": "txholdup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You literally focused on his first sentence and ignored the rest. \n\nMy immigrant parents bought their first house for $69,000 in 1998. My mom was just starting her business, so no real income, and my dad was making about 60k. I'm currently making 80k in a similar trade and that exact same house sold for $540,000 early this year. I'd have to be making about 450k to be able to afford the same property as parents did 25 years ago.",
                                    "score": 2,
                                    "author": "Pimp_Daddy_Patty"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been working on raising a family and getting out of debt for 5 years and absolutely agree that a substantial shovel is a fundamental achievement that I feel gets underrated when I hear about financial advice.  There absolutely is a basic cost of living that needs to be provided for, especially if you have a family.  And when you have a family your time is so much more limited.  Work smarter, not harder",
            "score": 1,
            "author": "LearningToFly29"
        },
        {
            "level": 0,
            "comment": "$500 for rent?? I have NEVER had base rent that low even when splitting with up to four other people.",
            "score": 1,
            "author": "thylacine_pit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea... I figured I'd give a budget a fighting chance",
                    "score": 1,
                    "author": "xlem1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is some truth to this, not sure it's $40k or another number. It's true you can only cut back on expenses so much, and there comes a point where your time is better spent earning more money, working an extra hour, than driving out of your way to go to the slightly cheaper store, spending hours clipping coupons etc.\n\nGig work highly depends on location and the general state of the economy. Many gig workers are not taking all their expenses and taxes into the equation and coming up with what the true earnings of gig work are.\n\nImproving your skills and knowledge to get a better job still is typically one of the best ways to increase income, as well as changing employers every few years. Easier to do in some professions and industries than others. The big thing for a lot of people on this sub or who post similar posts is to get into a career with a pathway to move income, so many are stuck on entry level hourly jobs where advancement earns you a very small increase in pay etc.",
            "score": 1,
            "author": "Liquidretro",
            "replies": [
                {
                    "level": 1,
                    "comment": "40k was a nice round number, and at least where I live, it's basically the line between a shitty retail/restaurant job and a career. \n\nThe real headline is, \"If you are not in a career that has consistent future income growth to around 50-70k a year, most financial advice doesn't apply\" - dependent on local cost of living\n\nAt around that much, your financial decisions outside of income are much more important and impact full, at least in the time and energy cost. Most careers will pay around 50k medium wages, so it accessible to most people. Past that range, you narrow the option quite a bit, so it becomes increasingly hard it increases your income past 90k.",
                    "score": 1,
                    "author": "xlem1"
                }
            ]
        }
    ]
}