{
    "id": "144d4qx",
    "score": 1,
    "title": "Is this car loan financially smart?",
    "author": "slicedright1567",
    "date": 1686240039.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144d4qx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello. I’m 25 years old. I make $91k a year base, but can easily pull more with some extra work. I’m on pace to do $110k this year currently. My daily driver recently finally died after 280k miles. I’m looking at a brand new car (Honda Civic Hatchback) that costs right at $33k before tax/fees. Top trim. \n\nTake home is about $4600 a month. This is assuming I work just the base amount. It is very easy to bring in extra if I want. For context, I will take home $7600 this month and only worked an extra 5 days this month and after that, I still have 14 days off this month. \n\nI have no other debt. Currently right under 30k in retirement and I do 12% to my 401k with a 3% additional match from my employer. Roth IRA already maxed. Rent and utilities is right under $1000 a month (I live and split with my girlfriend). I also own another car, an unpractical for the most part 2016 Mustang GT that is paid off. No intention of selling currently. I want a practical daily driver to go along this car. \n\nI plan on putting down 12-15k, 48 month loan. I’m estimating around a $570 a month payment at 3.9% APR if I do 48 month loan with a 12k downpayment. \n\nI think I know deep down I can easily do it. I’m just getting cold feet and sick thinking about it because I am decently frugal and view that that $570 each month as money I could be using for other fun stuff. Not to mention all the Dave Ramseys and everyone always talking about how terrible car payments are no matter the income. But at the same time I drove a beater for so long and think it’s time for something nice. \n\nJust need some opinions.",
    "comments": [
        {
            "level": 0,
            "comment": "Maaaaaaaan, I have a 22 civic and about to sell it (at almost a profit after putting 40k on it, thanks car market) for a 23 camaro lt1 or 23-24 mustang gt. You have the fun car, why pay 33k for a civic? You can easily find something as a daily for way less. If you need to go new, the sport (which I have) is very nice. Sonic grey pearl gets compliments every day, but I get out of it and laugh cause it’s a civic. It’s a basic car. Don’t spend 33k on a car that you aren’t having ~fun~ in.",
            "score": 2,
            "author": "Spattt",
            "replies": [
                {
                    "level": 1,
                    "comment": "My commute is long. Like 2 hours each way once a week long. I had a 2006 Civic doing this work for a while and it got uncomfortable quick… ideally want something nice. \n\nAnd as a 2016 Mustang GT owner… get the 2024 Mustang. Please do not buy a Camaro over a Mustang at this point in time lol",
                    "score": 1,
                    "author": "slicedright1567",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I gotcha man. All I’m saying is you can get something nice without getting a max trim civic. At the end of the day, it’s a Honda civic. You can find a sport for 25-6k, save that 7-8k and have some extra pocket change. We seem to be in similar situations. I’m 26 with a large savings, good job, and no debt. This is just what I would do! \n\nAs for the v8 muscle, I’m torn. I drove an SS Camaro yesterday for shits and giggles on the lot near me. It was amazing. I’m not sure how long the wait will be on a 24 gt, I would probably go with that in a perfect world, but that could be a whole year away at this point. I’m impatient and need that v8 in my life lol. How you like the stang?",
                            "score": 2,
                            "author": "Spattt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mannnn I love it. Still gets me as excited the day I bought it. Haven’t done much to it, just wheels and tires (previous owner put off-road X Pipe, SLP Loudmouth axle backs and a resonator delete so it sounded good when I got it). Thinking about getting some long tubes for it. But whatever you get, I’d get a manual. The A10s in the newer Mustangs are so damn quick and very impressive but rowing through the gears and downshifting/rev matching in a V8 muscle car is just so much fun. In fact if I do get one of these Civic hatches, one of my absolute requirements is a manual transmission.",
                                    "score": 1,
                                    "author": "slicedright1567"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also just wanna say wasn’t trying to be an ass with my comment, feel like I may have come off as one lol",
                            "score": 1,
                            "author": "Spattt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Car payments are not an \"investment\" in your future in the same way that house payments are (or can be).\n\nBut if the car payments aren't a hardship for you and they make you comfortable, why not?\n\nI drive a nice car because I like to be comfortable when I'm driving - not because I'm expecting an economic payoff for it.\n\nThe one thing I would suggest is just like you shop around for your car, you should also shop around for your loan.  Go to some online places like Ally or Capital One.  Go to your bank.  Get your best rate.  Take that to the dealer.  See what rate they offer.  If they beat it, that's great!\n\nA couple of cars ago, I got a rate that was something like 3.5% from Capital One online (which was very good at the time).  When I went to the dealer, they offered me 5% or something.  I said pound sand.  They then offered to beat whatever financing I had.  Then like magic they came in at 3.25%.",
            "score": 1,
            "author": "FourWayFork"
        },
        {
            "level": 0,
            "comment": "Could you swing it? Sure. Would it strap you? Yes - it's over 30% of your income (gross?). I would seriously consider looking for a used Honda or Toyota you can get for $15K. Just a thought. You'd have a newer car with significantly fewer miles on it and zero payment.",
            "score": 1,
            "author": "sp3ci4lk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve already looked into that… but with the used car market, it is hard to justify paying 10-15k for a 10+ year old car with 150k+ miles. I trust Honda and Toyota and won’t fall into the “used cars are unreliable” trap… but still spending that much for a way old used car with that many miles is a hard pill to swallow. As far a few years used go, those Civics are still 25-27k. For a 2-5 year old car with miles and the last generation of Civic technology.",
                    "score": 2,
                    "author": "slicedright1567"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It sounds like you can afford it, and if you can get that really low APR it isn't even that bad of a loan.\n\nMy only hesitation is what you have saved, if you have a fully funded emergency fund (probably about 15k based on your expenses), you're likely fine.\n\nIt sounds like you're a car person, so if you want a significant amount of your fun money going to a car, that's fine with where you are.",
            "score": 1,
            "author": "kc9kvu",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a car person yes. Currently have 20k in a savings account. It would only take maybe 2 months with some extra work to completely refill my savings to where it was pre massive downpayment.",
                    "score": 1,
                    "author": "slicedright1567"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty sure 48 month financing on new Hondas are 2.9% direct from Honda...have you checked manufacturer financing?\n\nI just got an Accord $35k base $40k after tax/fees and $36.5k aftee tradein so pretty similar for 48M 2.9%.",
            "score": 1,
            "author": "Grevious47",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that 2.9% is on certain models, the Civic isn’t one of them. Best they’ve got on the Civic currently is 3.9%",
                    "score": 1,
                    "author": "slicedright1567",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah okay wasnt aware.",
                            "score": 1,
                            "author": "Grevious47"
                        }
                    ]
                }
            ]
        }
    ]
}