{
    "id": "144enh8",
    "score": 0,
    "title": "Question about student loan repayment/forgiveness situation",
    "author": "pea-ster",
    "date": 1686243512.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144enh8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone. Like many people, I was “approved” for Biden’s forgiveness plan and stopped paying during the freeze. Now, I know nothing is final yet, and it’s not looking good. I just got a notification that my credit score is plummeting. \n\nIs this something to be concerned about? Will my score bounce back after a decision is made? I can pay what is currently overdue, should I? Or, should I continue to wait it out and see what happens?\n\nAny advice is appreciated, I feel like I’ve made a huge mistake.",
    "comments": [
        {
            "level": 0,
            "comment": "The student loan forgiveness should have no effect on your credit score because it didn’t make it to the point that it was reported as paid to the credit bureaus.\n\nAll of the student loans were placed in forbearance status, where they remain for now. Nothing should be due or overdue right now.\n\nPull your credit report from each of the three major bureaus and see what else is affecting your credit.",
            "score": 5,
            "author": "throwaway9462739"
        },
        {
            "level": 0,
            "comment": "I think you're confusing two things. \n\nTrump and Biden paused payments for most but not all types of federal loans.\n\nBiden's forgiveness plan is currently awaiting a Supreme court decision. The email they sent (if it's the same one I got) is basically meaningless unless the supreme court says the president can forgive debt. \n\nIf your credit score is plummeting, you have loans that weren't part of the Covid pause or your servicer has made a mistake in reporting.",
            "score": 2,
            "author": "shadow_chance"
        }
    ]
}