{
    "id": "144fvv8",
    "score": 2,
    "title": "Early Roth Withdrawal",
    "author": "couchparsnip1",
    "date": 1686246341.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144fvv8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am looking to withdraw funds from my Roth for use as a downpayment.  This was my original intent upon opening the account because I have a separate 401k.   I will only withdraw funds that I have contributed because my understanding is that contributions can be withdrawn early without penalty or taxes.  My question is how is this dealt with during tax time?  Is there anything special that needs to be submitted or can I just withdraw the funds and make sure I am below my contributed amount? My first contribution was in 2017 so I hit the 5-year rule.",
    "comments": [
        {
            "level": 0,
            "comment": "Use Form 8606 part 3 to report the withdrawal.\n\nThere is no 5 year rule for withdrawing Roth IRA contributions.",
            "score": 6,
            "author": "DeluxeXL"
        },
        {
            "level": 0,
            "comment": "To be clear: do you mean Roth IRA? There are other types of Roth accounts, but only Roth IRA lets you withdraw contributions tax- and penalty-free. The 5-year rule does not apply to contributions.\n\nIf so, then you simply take the withdrawal. At tax time you'll get a 1099-R from your IRA provider, but it doesn't determine whether the withdrawal is taxable or not. It's up to you to fill out Form 8606 Part III accurately when you file your tax return to show that the amount you withdrew is less than your contribution basis, and therefore not subject to any tax or penalty.",
            "score": 5,
            "author": "nothlit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I meant Roth IRA.  And the Form 8606 looks like the answer I was looking for. Thank you.",
                    "score": 1,
                    "author": "couchparsnip1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You may find these links helpful:\n\n- [Retirement Accounts](/r/personalfinance/wiki/index#wiki_retirement)\n- [\"How to handle $\"](/r/personalfinance/wiki/commontopics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Yep, Form 8606 and there is no 5 year rule involved for contributions.\n\nThere *is* a 5 year rule for conversions, such as a backdoor Roth. But direct contributions have no such rule.",
            "score": 1,
            "author": "GreedyNovel"
        }
    ]
}