{
    "id": "144hqe5",
    "score": 1,
    "title": "Tips on planning my retirement",
    "author": "Loose-Ad-4159",
    "date": 1686250644.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144hqe5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Howdy. Just wanted to set a disclaimer I'm very early off in my career as a young engineer but I'd like to get a good plan set for my future. Currently I'm planning on heavily investing in my company stock. The rate of return is 24.2% on average in the last 25 years, and about 20.5% in the last 10 years. Majority of everyone in the company (of roughly 12,500 people) invest solely in the company stock. Currently I'm at 12%contribution with a 5% salary match as well as a 4-8% yearly salary company stock bonus (based on overall company performance). Doing simple calcs, if I stick with this company, my 401k would be in the millions in my 40s factoring in a conservative 15% rate of return and no stock bonus. \n\nIn this ideal situation, where I'm 45-50 years old and have a couple million in my (post tax) 401k, would it be smart to just withdraw my estimated needed income year after year and just take the 10% early withdrawal penalty? Are they're any other factors besides the 10% early withdrawal penalty?",
    "comments": [
        {
            "level": 0,
            "comment": "Concentrating wealth and income in the same entity is quite risky.   \n\nSee Enron, worldcom, General Electric, etc",
            "score": 2,
            "author": "Werewolfdad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, my grandpa actually had all his 401k in GE decades ago and never sold. He still has some shares...\n\nI'm not worried about the objectively \"risky\" financial concentration. I can sell however much I want once a year. Our company has historically outperformed almost all blue chip stocks, especially in years of global/national economic downturn.",
                    "score": 1,
                    "author": "Loose-Ad-4159"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All treasuries are sold in $1,000 increments",
            "score": 1,
            "author": "Levertki1"
        },
        {
            "level": 0,
            "comment": "You will also owe income taxes in addition to the penalty for early withdrawals. \n\nWhat the plan if most of your money is in company stocks and the company goes bust?",
            "score": 1,
            "author": "Jmb3930",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, forgot about that... I'm not worried about the company ever going bust. We're one of the top design firms in the world and if there is ever chances of catastrophic financial performance, there will be writing on the walls way before the yearly stock change. The big wigs are very transparent on the companies current performance, projected performance, and missed targets with quarterly update presentations.",
                    "score": 2,
                    "author": "Loose-Ad-4159"
                }
            ]
        }
    ]
}