{
    "id": "144nxce",
    "score": 4,
    "title": "How do you phase out a credit card while protecting your credit rating?",
    "author": "F00Manchu",
    "date": 1686264829.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144nxce",
    "media_urls": [],
    "other_urls": [],
    "postText": "Thanks for any and all advise to this question. In addition to the main question, I also want to know if closing a credit card is fine? Or if it makes sense to simply charge small amounts on a monthly basis for a card that I no longer care to use as frequently as another.",
    "comments": [
        {
            "level": 0,
            "comment": "what is the credit limit on the card?  What is your total credit limit among all your cards?",
            "score": 3,
            "author": "bx10455",
            "replies": [
                {
                    "level": 1,
                    "comment": "The card in question has a limit of $4,000. My total combined is $16,500.",
                    "score": 2,
                    "author": "F00Manchu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How old is the card versus your oldest card?",
                            "score": 2,
                            "author": "flat_top",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It happens to be my oldest card",
                                    "score": 1,
                                    "author": "F00Manchu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't close it unless it has an egregious annual fee. In addition to it negatively impacting your debt to available credit ratio, length of accounts is also a significant factor. \n\nWhat you suggested in terms of charging a small amount each month and then paying it off will help, not hurt your rating. Regular monthly bills are a good way to automate this.",
                                            "score": 2,
                                            "author": "JosePrettyChili"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’d use it once a year just to keep it open. If it has an annual fee see if you can downgrade it to a no annual fee card. Or if there’s a better card for your spending you can usually switch to that as well.",
                                            "score": 1,
                                            "author": "flat_top"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Closing a card may ding your score if you've had it open a long time and decreases your average credit history. And it will decrease your overall credit total. \n\nNo need to do monthly charges to keep it open, do one small charge every year and then just don't use it. I have a card I no longer use because of subpar rewards but I've had it open for 20 years so not going to close it, last charge I made was a coffee in December.",
            "score": 3,
            "author": "Laines_Ecossaises"
        },
        {
            "level": 0,
            "comment": "If the card has a freeze feature that lets you keep the account active but temporarily block it from use, do that.  And just leave it frozen.  Cut up the card and just keep the account open and leave it zero balance.  You don't have to charge small amounts on it every month to keep benefiting from the age of the credit line.\n\n(assuming it has no annual fee.  if it has an annual fee, i might just close it and take the credit score hit)",
            "score": 2,
            "author": "UnpopularCrayon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will look into that. I’m unaware of this card has a freeze feature. It’s my oldest card at the moment, opened about 12 years ago.\n\nThanks!",
                    "score": 1,
                    "author": "F00Manchu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oldest card has an extra aspect of it - age of account is a consideration in your score. I don’t think it necessarily drops off tho (my mom added me as an auth user in high school so my oldest account is 4yrs older than me, it still counts for that but not limit). \n\nI’m also curious on this question, but for me it’s my most recent card and has an absurd interest rate. It’s only $2.5k with a total of about $20k, but it’s utilization has been $0 for 2-3yrs now.",
                            "score": 2,
                            "author": "alnyland"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why not just leave it open? If there’s no fee, of course. \n\nI would just let them close it if they want to. I have a few cards (from my credit union) that I haven’t used in years and they are still open.",
            "score": 2,
            "author": "CanWeTalkEth"
        },
        {
            "level": 0,
            "comment": "When you close a credit card, it stays on your report and ages for 10 more years. So the only negative effect you would immediately see is if your usage % increases because your overall credit limit is lower. That can be managed away though",
            "score": 2,
            "author": "HibeePin"
        },
        {
            "level": 0,
            "comment": "Downgrade your credit card if you have an annual fee one you don’t want to use. Then don’t use it",
            "score": 2,
            "author": "biolox"
        },
        {
            "level": 0,
            "comment": "How many cards do you have currently, and what do you need a good score for right now or in the near future?\n\nPersonally, over the long term I would never keep a card open long-term just to boost credit score. It's a lot of work to go through the trouble of maintaining the card with small purchases (assuming it's a card that would get cancelled for inactivity), and the more separate cards you have to pay off each month, the more likely you will miss a payment and get your score dinged for that, which would be counterproductive. \n\nIf you're going to buy a house or car in the next few months, then just keep the card open. Short of that, keep asking for the credit limit to be raised on the cards you do use, and close the ones you don't. Simplify.",
            "score": 1,
            "author": "greyAbbot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have three cards. The biggest purchase I will make in the next year will be a new vehicle. So correct me if I am wrong. But you’re suggesting I can close any card I want with little to no penalty against my credit score?\n\nThanks!",
                    "score": 1,
                    "author": "F00Manchu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also have 3 cards. Each has a separate purpose. Card 1 is used for online purchases and subscriptions. Card 2 for physical purchases - groceries, gas. Card 3 is for work trips and vacation. Card 3 is used rarely. Cards 1 &amp; 2 make it easy to track monthly expenditures. I've also had these two for nearly 35 years; the long-term history has had a very positive effect on my credit score over the years.",
                            "score": 2,
                            "author": "Total-Beat9163"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "May I ask why you want to phase out use of a credit card at all? Pretty sure Ill be using my credit card until I die.",
            "score": 1,
            "author": "Grevious47",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not so much that I want to phase it out. I wanted to know the pros and cons of phasing out a card, and I wanted to know the potential setbacks if I simply limited activity from slim to none.",
                    "score": 1,
                    "author": "F00Manchu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cons: you dont get any rewards because you don't use your card. (just checked out of curiosity so far in 2023 $605.82 for me so I'd be giving up like $1400 a year)\n\nPros: ???  can't think of a single advantage you get not using it assuming you aren't careless with credit.",
                            "score": 2,
                            "author": "Grevious47"
                        }
                    ]
                }
            ]
        }
    ]
}