{
    "id": "144nb8i",
    "score": 0,
    "title": "Should I use homeowners insurance to pay for a new roof?",
    "author": "dox1842",
    "date": 1686263377.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/144nb8i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I currently have a roof that is nearing its life and needs to be replaced. We have two leaks that have caused ceiling damage and need to be repaired.\n\nI had two roofing companies come by and give me estimates. I had a third guy come by today and give an estimate but he also noticed that there was wind damage on the shingles and pointed it out to me. He says he works with insurance all the time and says he can help me file a claim so that the insurance will pay for it. \n\nI didn't get any bad vibes from this guy and his company has great ratings from google and yelp. Is there a down side to having insurance pay for the roof? The worst they can say is no right? Im surprised that the other two guys didn't recommend insurance pay for it. Anyways, it would be nice if all I had to do was pay my deductible and get a new roof instead of taking out a personal loan. ",
    "comments": [
        {
            "level": 0,
            "comment": "Homeowners insurance never covers wear and tear. It designed to protect against sudden or accidental damage or acts of nature. I would check with the company first.",
            "score": 6,
            "author": "FunnySpeed4546",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is true that it doesn't cover wear and tear. The thing is that the third repair company said that they found evidence of storm damage. They can draft up a report that says even though the roof needs to be replaced by wear and tear that the storm damage reduced the life of the roof and insurance needs to pay for it.",
                    "score": 1,
                    "author": "dox1842",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This sounds like it is close to the line between a good-faith claim and insurance fraud. One responder says that the \"downside is possibly getting dropped,\" but the downside for insurance fraud is higher. \n\nWe here on the webs cannot tell you which side of the line you'd be on.",
                            "score": 6,
                            "author": "myogawa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "well if it is insurance fraud wouldn't that be on the end of the roofing company? I don't know anything about roofs but the roofing company is telling me its from storm damage and if the insurance company agrees then thats what it is.",
                                    "score": 0,
                                    "author": "dox1842",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No because it’s your insurance policy and based on your post the roofing company is helping you file a claim. If they’re helping you file a fraudulent claim on your policy, that’s on you.",
                                            "score": 2,
                                            "author": "JDRodgers85"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve heard of insurance companies dropping people after making a claim. Good luck",
            "score": 2,
            "author": "Jayswisherbeats",
            "replies": [
                {
                    "level": 1,
                    "comment": "after making a single claim? I can see them dropping me if I make excessive claims.",
                    "score": 1,
                    "author": "dox1842",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. It’s crazy. People use their insurance and then they get dropped.",
                            "score": 1,
                            "author": "Jayswisherbeats"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We did this but the damage on our roof was from a storm. Is the damage on your roof plausibly from a storm? We were a bit sketched at first but it all worked out.  Be prepared for your rates to go up. But if you search around you may be able to find a different insurance company. We did and our rates aren't bad plus we got a roof and new gutters.",
            "score": 2,
            "author": "repro_prof",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes we did have a storm a month ago or so. how bad did your insurance go up?",
                    "score": 1,
                    "author": "dox1842",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like what happened to us. We had a storm but didn't think it was enough damage to involve home insurance. A month and a half later we had a leak. One of the roofers said the same as yours and we were very hesitant but it worked out.  \n\nInsurance went up about 25%. However, we shopped around and switched companies to bring it back down to what it was. \n\nIt went up about 10% this year. \n\nThis could be state dependent. I know some states, FL and CA, can be more difficult when it comes to home insurance.",
                            "score": 2,
                            "author": "repro_prof"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it’s plausible it’s from wind damage, then sure.  Downside is possibly getting dropped, but that’s well worth it for a 5 figure claim.  Besides, if you have to shop for a new insurer, at least it’s with a new roof, which is the first question insurers always ask (age of the roof).",
            "score": 2,
            "author": "93195",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would they really consider dropping me over making a single claim? I typed this in google and read that they might drop you over excessive claims.",
                    "score": 2,
                    "author": "dox1842",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Homeowner’s insurance will drop you even if you don’t make a claim at all if they decide you or where you live is a bad risk.  Insurers are pulling out of entire states.\n\nWill they drop you?  Can’t say.\n\nCould they drop you?  Absolutely.",
                            "score": 3,
                            "author": "93195"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that the first two roofers didn't immediately find evidence of storm damage should tell you something. The fact you started getting quotes for your end of life roof without any thought of storm damage or filing an insurance claim also speaks volumes. \n\nThere is an entire cottage industry of unscrupulous roofers who work with shady attorneys and public adjusters to push borderline or outright fraudulent roofing claims. And under threat of high cost of litigation, they manage to squeeze money out of the insurance companies. This has absolutely ruined the insurance market in FL.",
            "score": 2,
            "author": "JeffonFIRE"
        },
        {
            "level": 0,
            "comment": "Yes. But… be aware that if they deny you, they will send an inspector to check that it’s repaired, and if not, drop you. \n\nThey will likely send their own local inspector too, hopefully they see and agree with the roofer that noticed the damage.",
            "score": 1,
            "author": "WantToRetireSomeday"
        },
        {
            "level": 0,
            "comment": " - can you VERIFY WHEN the wind damaged happened? Has to be  while you owned the house and had your current HOI provider\n - like others said, this guy seems to be shady",
            "score": 1,
            "author": "decaturbob"
        }
    ]
}