{
    "id": "1453j09",
    "score": 8,
    "title": "Is LTC insurance my best option?",
    "author": "dialmformurderess",
    "date": 1686312625.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/1453j09",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm 34, unmarried, no kids and none planned (my partner and I are both sterilized). I live with my long-term partner  (42 m) in a house he owns. The mortgage is paid off. He has no debt. I will have my car paid off by spring of next year and have no other debts. We both have health insurance and STD/LTD through our employers. He has no life insurance. I have term life insurance through my job and a whole-life policy to take care of funeral expenses and leave a nice gift for my surviving beneficiaries or a charity of choice. He has about $20k in a 401k from a former employer. I've only been in a position to contribute to a 401k or IRA for about 2 years, so I only have a few thousand in my accounts.\n\nI'm currently looking into LTC insurance, since I know the cost of assisted living and nursing care is cuckoo and I know that Medicare doesn't cover custodial care (and who knows what the state of Medicare will be 30+ years from now?). There is a history of Alzheimer's and dementia in my family, and spinocerebellar ataxia runs in my father's family. Health history aside, I could always have a stroke in my later years or fall and break a hip. Either way, there's a decent chance I may need some amount of custodial care, albeit hopefully not for a couple of decades.\n\nI know LTC offers limited compound inflation protection and in my state (OH) protects personal assets equal to the policy amount from surrender to Medicaid.  But - I don't have any assets, and I'm not concerned about leaving wealth behind. Is LTC the best vehicle to save for potential custodial care expenses in the future, or would it make more sense to look into an annuity? Is there a different savings/investment vehicle that would make more sense is my situation?\n\nAny advice would be greatly appreciated. I can budget a few hundred dollars a month, but that amount will rise drastically in about a year.\n\nEDIT: I earn just over $60k/yr, excluding annual bonus and OT. My partner earns just over $105k/yr (salaried), plus bonus and commission.",
    "comments": [
        {
            "level": 0,
            "comment": "Curious to see what else is posted here.  \n\nWhen I looked into LTC a few years ago, the consensus seemed to be that it was ridiculously expensive and most insurers had ditched the product all together because of how expensive long term care is.  If you were lucky, you bought a policy 20 years ago and it isn't eating your lunch.\n\nThe plans that were available seemed to have benefit caps that really seem to limit their usefulness for doing what you hope they would do - cover your care in old age or certainly in a scenario when you aren't making decisions for yourself. \n\nMaybe I'm wrong, but I left it alone at that point.",
            "score": 14,
            "author": "TroyMacClure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, they're tough.  My FIL's policy was setup around 2003 and we had to execute on it in 2017.  He paid ~$350/mo in premiums for ~$4500/mo benefit for 4 years once approved.\n\n  Funny/sad side: since, as you said, a lot of insurers ditched their policies it got increasingly difficult to find anyone there that knew what to do.  Getting it started took multiple phone calls because we needed 'Joe' to get anything done.  Most phone support people had little knowledge.  The web site had zero access to the info, so it was useless.  \n\n  Annoying side: it took 6 months before we saw a dime of payback.  Approvals, waiting periods, more approvals, evaluations, etc took time.  Thankfully we had access to cash to bridge the gap.  You certainly need someone you trust to manage it and your money.\n\n  Also annoying but makes sense, sadly: you pay premiums while executing on the policy, so the payout is benefit-premiums.  It makes sense, but given the scenario its another eyeroll.\n\n  Sad side: my FIL was sold on the policy applying to in-home care.  The policy specifically did not apply to in-home care, so he was very upset and increasingly confused on the days when the dementia was less and he wasn't at home anymore... nor could afford to be.",
                    "score": 4,
                    "author": "jpmoney",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Annoying side: it took 6 months before we saw a dime of payback.\n\nI tried for a very long time to get my relatives' policies to payout.  The companies they used made it impossible.  They would not respond to letters or calls, would say that they had sent claim forms that they never did, requested documentation over and over ... \n\nI was unsuccessful.",
                            "score": 2,
                            "author": "fu_ben",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We used a home care agency to file the LTCi claim for us. They file thousands every year and we didn't have to do a thing. \n\nYou should have contacted the Insurance Commissioner in their state.",
                                    "score": 1,
                                    "author": "SnooShortcuts7162"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We used a home care agency to file the LTCi claim for us. They file thousands every year and we didn't have to do a thing.",
                            "score": 1,
                            "author": "SnooShortcuts7162"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The cost of the kind of care you are talking about is really beyond Cuckoo and continues to increase. My Mom for example is in a nice private Memory Care for Dementia for $10, 300/mo. It went up $760/mo this January. We're paying with proceeds from the sale of their home (Dad is gone) and her SS and 1/2 his Pension that he used to get. She does not require skilled care if she did it would be on average $12K+, a nice one by me is $16K/mo. No insurance.Medicare does not cover Long Term Care ever but is a Federal Program the same no matter where you live.\n\nMedicaid on the other hand is income and needs based, administered by each state. So the rules are different in each state and that is important.\n\nI'm a retired RN and used to do assessments for LTC policies back in the late 80s/90s. Often people were trying to get policies too late when Cognitive Decline had already set in and their children were trying to get it for them.\n\nOther younger people were getting them to protect themselves/assets. Back then $100 a day was considered good coverage, you could get a Live In Aide for $200-250/week. Some of those people are in the midst of needing care now and it doesn't cover anything. An hourly CNA is $25-45/hr, they've changed the labor laws to include these as hourly employees who require overtime in numerous states resulting in this being undoable for the CNAs or families.\n\nMany people do Medicaid/Estate Planning to leave their assets to their children/heirs, HOWEVER getting a Medicaid bed can be very difficult and getting decent care even harder. It's a growing Epidemic in our country, millions of families trying to take care of ill, frail, often a danger to themselves elderly people who can not be left alone for a minute.\n\nFrom what I'm hearing more recently these policies are extremely expensive. There is supposed to be some type of Hybrid policy out there of LTC and Life Insurance where if it's not used the money can flip to a Life Insurance Policy and be Inherited or at least most of it. That might be worth looking into.\n\nAs someone else mentioned I've heard to hold off until at least late 50s because the Premiums go way up after 60? Though any one of us can get in a catastrophic car wreck or even fall the wrong way in your shower and need the care.\n\nLikely someone has a formula if you took $500/mo and invested/saved where it would be by say age 70ish for the optimistic ...",
            "score": 6,
            "author": "sunny-day1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Many people do Medicaid/Estate Planning to leave their assets to their children/heirs, HOWEVER getting a Medicaid bed can be very difficult and getting decent care even harder.\n\nThis is the part that people don't get.  Not to mention that medicare and medicaid don't cover many, many items that could make life more pleasant for elderly folks.  I paid out of pocket for items like a walker that was properly sized, a good wheelchair, a cushion to avoid pressure sores ... the list goes on and on.  \n\nOne of my friends paid for a full-time caregiver to be with his wife when she was in skilled nursing towards the end.  Even the best skilled nursing facilities are hard-pressed to find workers.  So people who can't call for help will be basically ignored.  People who can might not be attended to for 20 minutes or more.",
                    "score": 4,
                    "author": "fu_ben",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, my husband has a friend relatively young was working  on his own but no real family. Developed some type of micro stroke syndrome and collapsed about half an hr from where he lived. \n\nTurns out he mostly lost his speech but is still cognitively fine but in the mean time he ended up on Medicaid in some facility where they talked him into signing over Guardianship to some organization who would 'protect him'. His wallet has disappeared, can't get ID, nobody knows where his car is, what happened to his apt., belongings or bank account, credit cards etc.\n\n He was finally able to get online with a 'free' phone and reach out to friends through Facebook. My husband went to see him and he is difficult to understand but can type things out on his phone. \n\nThey put him in a place the other end of the state and though all his friends ask about him no one else has been to see him. \n\nHe can't even go out to lunch without prior permission from his Guardian. He had zero money and nearly cried when my husband gave him what cash he had on him. All he wanted was to get a snack or soda out of the vending machine??\n\nI guess he's made some progress because he said now he gets $50/mo for personal use. \n\nIt's pretty sad... all around.",
                            "score": 3,
                            "author": "sunny-day1234"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My opinion:  LTC is a scam.  POA to several elderly people.  Have a relative who bought two separate policies for themself and their spouse (so four total).  Obtained them many, many years ago and paid a boatload of money into them.  \n\nThey went into skilled nursing.  I was unable to get the policies to pay.  And when I read them in depth, the reimbursable amount was laughably small and had a top limit.  \n\nThe skilled nursing administrator said that she had *never* seen a policy payout.  \n\nFor the amount of money that was spent, an index fund would have been a much better investment.  \n\nAlso my opinion:  managing your own money is better than an annuity.  As far as I can tell, annuities don't end up in unclaimed property so if nobody knows about them it's possible you may never collect the funds if you're unable to manage your own affairs.  Or if you forget.  I went through tons of relatives' paperwork and found some annuities that hadn't been paid out.  Took quite a while to get it sorted.  \n\n(Not directed at you personally)   Not sure I really understand people's reluctance to spend money on their own care or to keep it out of the hands of medicaid.  Medicaid isn't stealing the money; it's a program designed to help low-asset, low-income individuals.  And there's such a wide variation in skilled nursing facilities; I would never put a loved one in a medicaid-only facility if the money is there.  Usually the need is time-sensitive as well and you're trying to rush to get a good placement.  \n\nTLDR:  Good retirement savings are essential.",
            "score": 6,
            "author": "fu_ben",
            "replies": [
                {
                    "level": 1,
                    "comment": "In-laws thought that LTC was a scam and not needed…The survivor was entering destitution mode when they passed. The last few months of their lives were quite stressful for them as well as for other family members. On the other side of the spectrum my mother had a LTC policythat paid for her to stay in a quite nice facility and allowed her to live stress free of money issues the last year plus of her life.. Thanks mom. \nWife and I have policies and will have NO issue paying premiums for years and never use the policies.",
                    "score": 1,
                    "author": "Prestigious-Phone410",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ditto. my mother-in-law's policy took only 3 weeks to get the claim approved and they paid on time every month until she passed away.",
                            "score": 1,
                            "author": "SnooShortcuts7162"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I skipped the LTC policy and invested the amount I’d have spent on premiums. The LTC policy was too complicated and I was concerned about premiums increasing. A good friend, who was considering LTC at the same time, bought a policy and has been dealing with 10% annual premium increases every year. Her state caps LTC premium increases at 10% or they’d be higher. She’s been paying in fifteen years, but recently accepted a deal where her benefits are reduced in exchange for a maximum 4% annual premium increase.\n\nI’m looking into continuing care retirement communities for myself. Buy an apartment and pay monthly dues for amenities, then as health declines the CCRC coordinates home health care and moves you to assisted living, memory care, or skilled nursing care if needed. It’s not cheap, but that’s why I’ve invested.",
            "score": 5,
            "author": "ChiSquare1963",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the issue is no matter how well you try and plan, unless you are just sitting on a large pile of money, you cannot keep up with the rising costs of nursing homes, memory care, etc.  Certainly if you are 34 like OP today and looking to use this in ~45 years.  Who knows what it will be.  Insuring against that would be nice, but the insurers aren't dummies either.",
                    "score": 6,
                    "author": "TroyMacClure"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My financial advisor (who I no longer use) tried to sell me a policy.   It was expensive, and only paid out for 3 or 4 years, had a cap on the payout per month.   \n\nIt only really made sense if I was disabled right after buying it and passed away right as it ended.   As time went on, self insuring the same amount made more sense, and I think 10 years out, 7% returns on the premium matched the maximum payout the policy offered.  It made no sense, especially as every employer I’ve had has free LTD coverage (and a buy up option) and I plan on working until retirement.\n\nI couldn’t convince my wife it wasn’t a good deal, so she bought it for her, but I decided to self insure.",
            "score": 5,
            "author": "Schnort",
            "replies": [
                {
                    "level": 1,
                    "comment": "Financial advisors sell cash-value life insurance but call it \"long term care insurance\".",
                    "score": 1,
                    "author": "SnooShortcuts7162"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We bought in 2021 at 37 and 41. We will pay about $48000 each over the next 40 years. The benefit is $250k with compounding benefits for inflation and no taxes in the money, plus insulation for that level of asset from medicaid. Our company took one rate increase in 2013, and that is why we chose them over others. \n\nZero regrets. \n\nNo matter what life throws at us, or when it throws it, we have protection.",
            "score": 3,
            "author": "KiniShakenBake"
        },
        {
            "level": 0,
            "comment": "LTC is expensive, but so is LTC insurance.  Like really expensive.  Some people choose to self insure, some people buy it.\n\nLike any other financial product, it's about the cost to buy it, the benefits it provides, and the risk that you may or may not even need it.  LTC insurance is neither inherently good or bad.  You have to weigh the costs, benefits and risks of what's being specifically offered to you.",
            "score": 2,
            "author": "93195"
        },
        {
            "level": 0,
            "comment": "I'm not sure I understand your income level--and that is relevant to whether you are on-track to have a good nest egg in 30 years. If you maximize retirement and investments, then 30 years is a reasonable timeline to be able to financially manage most of your own care needs. If you are not investing with that in mind, start now. I suggest putting any planned LTC insurance payments into retirement instead, and essentially self-insure. \n\nWhile everyone worries about being disabled at an early age, the greater and more realistic problem is living to a very old age. People are living longer, medical advances continue, and the likelihood of needing care increases as you get older.\n\nSee r/Bogleheads  for long-term investment recommendations in this regard.",
            "score": 2,
            "author": "edbash",
            "replies": [
                {
                    "level": 1,
                    "comment": "I earn just over $60k/yr, excluding annual bonus and OT. My partner earns just over $105k/yr (salaried), plus bonus and commission.",
                    "score": 1,
                    "author": "dialmformurderess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you decide to do it, just use a reputable company to minimize the chance of them screwing you over. My LTC insurance also has a return of premium option and a death benefit tied into if i end up never needing it.",
            "score": 2,
            "author": "Flip9xx"
        },
        {
            "level": 0,
            "comment": "1) At this point, you need to focus more on saving for retirement rather than paying for long-term care insurance.\n\n2) Your partner should have term life making you the beneficiary. (at least 5x his annual income)\n\n3) The only reason you should consider buying long-term care insurance now is your family history (especially the history of ataxia). Buy an inexpensive policy with a rider that would allow you to buy more benefits in the future. You could get a policy like that for about $50 per month (for just you). If you both apply with the same company at the same time you can get a big discount.",
            "score": 2,
            "author": "SnooShortcuts7162"
        },
        {
            "level": 0,
            "comment": "Assuming you want to avoid Medicaid, LTC insurance is probably the best vehicle for planning for potential custodial care expenses.\n\nMost feel that the right time to purchase this insurance is just before you turn 60 years old.\n\nStill, if you have a lot of money that you can be sure is available when needed, you might not need insurance.",
            "score": 1,
            "author": "GeorgeRetire"
        }
    ]
}