{
    "id": "14569h0",
    "score": 0,
    "title": "Rate of return on 401k",
    "author": "HalloweenTown2OnDVD",
    "date": 1686319709.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/14569h0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I (26f) started my 401k last year in 2022. I don’t know much about investments, but I am trying to learn everything I need to know from my own research online. \nIs a 16% rate of return good for my 401k? And when should I change my investments? \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "S&amp;P 500 which is the top 500 companies, averages 10-11% historically so 16% is great. Look into your fees because they could eat away at the gains. Look at expense ratio. You can research the ticker symbols to learn about the funds you are invested in.",
            "score": 5,
            "author": "suggesting_ideas"
        },
        {
            "level": 0,
            "comment": "You're investing this account for 50+ years. Any one year of returns really has no significance. There are stocks that have grown 500% in a single year and were completely worthless a few years later.\n\nBetter to share what funds (or fund types) you've invested in and why you selected them -- that's a better way to get feedback.",
            "score": 5,
            "author": "pancak3d",
            "replies": [
                {
                    "level": 1,
                    "comment": "Growth: \nAmerican Funds\nEuroPacific Gr R3\nAmerican Funds Growth\nFund of Amer R3\nBlackRock Health Sciences\nOppor R1\nBlackRock Mid Cap\nGrowth Iny R\nFederated Hermes\nKaufmann Fund R\nInvesco Small Cap Growth\nR\nInvesco Gold &amp; Special\nMinerals R\nT. Rowe Price Blue Chip\nGr R\n\nIf I’m being honest, I don’t know why I selected them. I did some research and from that I came up with these investments. I’m considering taking a financial class so I can have a better understanding and hold of my future.",
                    "score": 1,
                    "author": "HalloweenTown2OnDVD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Best and worst rolling 20yr periods for the S&amp;P](https://www.thebalancemoney.com/rolling-index-returns-4061795).  It's dates (2016), but you get the idea.",
            "score": 2,
            "author": "pf_burner_acct"
        },
        {
            "level": 0,
            "comment": "That 16% gain is not necessarily a good thing. Right now you are a buyer of stock, not a seller. When you buy eggs at the grocery store you don't say \"great! eggs are up 16%.\" When you retire, that's when you want high stock prices. If you chose good investment, don't worry about short term movement and just hold your course.\n\nWhen I first started investing in my 401k, I bought funds that had high morningstar rating. If the ratings dropped, I switched funds. In hindsight, this is called buy high sell low. Not good. I wish I knew then what I knew now; build a balanced portfolio of low cost index funds, and stick to my allocation through periodic rebalancing. There are so many good resources on how to do this: the wiki here, bogleheads website, and others. But take your time learning and don't be too hasty to switch things around.\n\nMost important thing is to have a plan that you understand and are comfortable with, and stick to it. It could be a single low cost target date fund, or a four fund portfolio, or something more complicated. And ignore short term gains or losses. Unless eggs are on sale, then stock up :)",
            "score": 2,
            "author": "thinlySlicedPotatos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's a **[link to the PF Wiki](/r/personalfinance/wiki/index)** for helpful guides and information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You may find these links helpful:\n\n- [401(k) Fund Selection Guide](/r/personalfinance/wiki/401k_funds)\n- [401(k) FAQs](/r/personalfinance/wiki/401k)\n- [\"How to handle $\"](/r/personalfinance/wiki/commontopics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Because 401k is contributed every paycheck, it won't have the same rate of return as someone who buys an investment in lump sum. In order to put your 16% into context, you need to know what you invested, their annual fees, and your contribution schedule. Stocks inside a year is volatile. Even bonds are volatile when the rates are changing. Investing in January 2022, August 2022, October 2022, etc. could have plus/minus 25% difference in one year.",
            "score": 1,
            "author": "DeluxeXL"
        },
        {
            "level": 0,
            "comment": "What investments did you select and what are the rest of your options?\n\nComparing 401k returns with others is mostly meaningless. People contribute to different funds in different amounts on different schedules.",
            "score": 1,
            "author": "flat_top"
        },
        {
            "level": 0,
            "comment": "16% is a pretty unsustainable rate of return which is followed by some bad years. Over a number of years you should get the market average. Somebody said 11%, it is close to 8%.\n\nPut the money on an index fund and forget about it, don't muck with it at all. If it goes up leave it alone, if it goes down leave it alone. If it stays flat leave it alone. If people start saying that a market crash is imminent leave it alone. Nothing good comes from trying to time the market.",
            "score": 1,
            "author": "Unlucky-Clock5230",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn’t the S&amp;P something like 12% average if including dividend reinvestment? I think target date funds are around 8% though (not ~2020 ones though).",
                    "score": 1,
                    "author": "homeboi808",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pick your term and you can come up with a variety of numbers. Heck the 5 years from 2017 to 2021 it averaged 17% but the longer you average the closer it gets to near 8%, which is not bad at all.",
                            "score": 2,
                            "author": "Unlucky-Clock5230"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Double check what funds you are invested in, their performance, and their expense ratios. After that, check again\n\n&amp;#x200B;\n\nI goofed up and picked and equally weighted S&amp;P 500 vs. regular and it cost me about $10-15k in gains when I finally noticed my error",
            "score": 1,
            "author": "Urdnought"
        },
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/personalfinance/wiki/investing/",
            "score": 1,
            "author": "shadracko"
        }
    ]
}