{
    "id": "1459bbs",
    "score": 8,
    "title": "Best future savings method for a child",
    "author": "opepassdaranch",
    "date": 1686326933.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/1459bbs",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I've researched a little on Google but haven't exactly gotten answers for my specific questions. I'm looking to open a savings/investment type of account for my baby girl. A regular savings account is easy enough, but I'd like an account where anyone could make a one-time or recurring contribution to it online. I want it to be able to accrue interest so it can build. I don't want it to be specific to college funds because who knows if that's the path she will choose. If possible, I'd also like her to be the only one who can make withdrawals (when she's old enough) so that people know she is getting 100% of that money.\nAnyone have any experience with this kind of thing? Would appreciate advice and recommendations on where to open one of these accounts!",
    "comments": [
        {
            "level": 0,
            "comment": "saving for kids: https://reddit.com/r/personalfinance/comments/104tjyn/_/j36u2dm/?context=1",
            "score": 5,
            "author": "Werewolfdad"
        },
        {
            "level": 0,
            "comment": "529 is generally the standard, and can be used for more than just college. Sometimes trade schools and other programs can qualify. 529’s are also great because if you have 2 kids and the first doesn’t go to college, you can “transfer” the 529 to the second child. \n\nUTMA is another standard, but a bit more risky if your kid goes off the deep end. \n\nA trust would be another option but less tax advantaged. Family and friends can make gifts to the trusts if they want. This can help avoid taxes that exceed the gift tax exclusion amount.",
            "score": 4,
            "author": "tortillakingred",
            "replies": [
                {
                    "level": 1,
                    "comment": "529s also are being changes so they can be rolled over into a Roth IRA. If one child doesn't go to college, up to $35,000 of their account can be rolled over to a Roth IRA in the future which is an excellent head start on retirement savings.",
                    "score": 2,
                    "author": "Sage_Planter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what I am doing now with my husband for our child 529 Education Savings Plans\nIf you are looking for a tool to invest for your child's future college expenses, a 529 plan may be a good choice. There are no contribution limits (although you could run into the ceiling for the gift tax), and anyone is eligible to open and contribute to a 529",
            "score": 2,
            "author": "thelivelycountryman"
        },
        {
            "level": 0,
            "comment": "it doesnt make sense to have an account in a child's name. as thier parent it makes more sense to hold any of their assets for them in your own accounts responsibly. I have money for my kids, but its in my accounts and in 529s.\n\nhaving that savings account in their name is fun in concept only. but other than that its just a PITA to manage.",
            "score": 0,
            "author": "F8Tempter"
        }
    ]
}