{
    "id": "145ab6i",
    "score": 3,
    "title": "What's the point in a creditor suing if they can't collect?",
    "author": "Low_Mark491",
    "date": 1686329237.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/145ab6i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm being sued by a collections firm in my same state. My attorney says that because the debt is personal (only in my name) and because my house is jointly owned (me and spouse) the creditor cannot come after our home equity. State law also says they can't garnish my wages. So what exactly is the point of a lawsuit?",
    "comments": [
        {
            "level": 0,
            "comment": "1. Perhaps to scare you into settling debt with threat of ligation.\n2. To preserve the right to come after you in the future if you later have significant non-home assets.\n3. Maybe they just think you have more money than you do.",
            "score": 16,
            "author": "shadracko"
        },
        {
            "level": 0,
            "comment": "&gt; Can't garnish my wages\n\nCan they levy your bank account? The terminology can be hazy - there's wage garnishment (basically taking money from your employer), and then there's the ability to reach into your account (also sometimes called garnishment, or levy). Because that's a risk.\n\nThere's also the possibility of them obtaining a lien to place on your home, depending on state.\n\nSuing and obtaining a judgment in many states gives right to collect up to 10 years, during which your own circumstances can change. The state in question would certainly be useful to know, as would the amount of judgment.",
            "score": 9,
            "author": "theoriginalharbinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "A quick google search confirms that a creditor can levy my bank account if there's a judgment.\n\nSo now I'm feeling like my lawyer is stupid,",
                    "score": 6,
                    "author": "Low_Mark491",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't keep money in your account, keep it in your spouse's account. They can't go after an account if your name isn't on it.",
                            "score": 3,
                            "author": "ahj3939",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you move assets around after a lawsuit has begun will that actually protect your assets? Seems like this would easily be discovered.",
                                    "score": 5,
                                    "author": "JoeClackin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are a lot of moving pieces.\n\nIf you think they are going to garnish your bank account you can go get cash. Nothing illegal about that unless you have an actual court order saying not to do that (for garnishment they usually go behind your back direct to the bank) Of course if they drag you to court and ask about your assets (called a debtor's exam) you shouldn't lie that you have $10k cash under your mattress and they may get court order to turn over that cash. Never ignore a legal court order!\n\nAlso there's nothing illegal about getting out your cash and using it for living expenses while your spouse just keeps saving money that creditors can't touch.\n\nBut yea it doesn't legally protect your assets, it just buys you time but that could just mean spending YOUR money on YOUR living expenses instead of giving it away to creditors. It's not going to protect someone who has $200k in the bank and then gives it to their spouse, but in this case if OP has $10k in the bank it might stall things long enough to legally spend on groceries and gas.",
                                            "score": 2,
                                            "author": "ahj3939"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To warn other creditors that you are a financial risk. Ruin your credit for 7 years. Some states allow leins and/or garnishment of wages",
            "score": 6,
            "author": "Dry_Studio_2114"
        },
        {
            "level": 0,
            "comment": "The point is they win a judgment against you and can then pursue all legal avenues that are available to obtain monies that a court has declared theirs. \n\nCould affect your plans to sell property, buy property, tax refunds, judgments in your favor, you get the picture. \n\nMake sure your attorney actually knows what they’re talking about AND that you understand what they’re saying. For example, your statements about how they can’t go after your home equity … I think you might not be understanding that. Homestead exemptions are probably what you’re referring to, but that would prevent your house from being seized by the creditor, but wouldn’t stop them from getting their money when you sell or refinance your home.",
            "score": 3,
            "author": "automator3000"
        },
        {
            "level": 0,
            "comment": " - I have watch people go down this road and the ultimate impact on their credit score over SEVEN years cost them 10x what paying the debt off in the first place",
            "score": 2,
            "author": "decaturbob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great advice, bob, thanks.",
                    "score": 1,
                    "author": "Low_Mark491"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of states don’t allow garnishment. I’d imagine because allowing garnishment of things people need to survive and putting them in a worse off place would be terrible for the state.\n\nThere’s also differences in which states allow wage garnishment vs bank garnishment",
                    "score": 3,
                    "author": "ChassidyZapata"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assuming what you're saying is 100% true (which I find it hard to believe a creditor has 0 access to your piece of the home equity), they can tie you up in court for a while until you either settle or a judgment is issued, all the meanwhile making you spend attorney's fees which pushes you to a potential settlement.\n\nEdit: Thanks for informing me on the homestead exemption. TIL!",
            "score": 0,
            "author": "HarrysonTubman",
            "replies": [
                {
                    "level": 1,
                    "comment": "[https://www.assetprotectionplanners.com/planning/homestead-exemptions-by-state/](https://www.assetprotectionplanners.com/planning/homestead-exemptions-by-state/)\n\nMany states have homestead exemptions with widely varying caps. (And I gather that link is quite out of date. AZ is currently a $250k cap, I believe.) FL and TX are the two big states with unlimited exemptions.",
                    "score": 3,
                    "author": "shadracko"
                },
                {
                    "level": 1,
                    "comment": "Well, if we assume I am correct (not saying I am, this is just what my attorney told me) then what's even the point of a judgment?  \n\n\nThat's pretty much what my attorney told me...who cares about a judgment because they can't take anything from you.",
                    "score": 2,
                    "author": "Low_Mark491",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'll have to either pay it or file for bankruptcy. And in either event, it keeps the pressure on you so that you cough up something.\n\nMost debt collectors take a long time to actually suing someone, so my guess is you haven't paid this amount in a long time and they view you as the, \"We need to go nuclear to get anything out of this person\" type of debtor.\n\nIf I were you, I'd get an opinion from a second attorney. Your attorney should be walking you through the debt collector's strategy as part of your counsel.",
                            "score": 1,
                            "author": "HarrysonTubman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just booked an appointment with another attorney. Thanks.",
                                    "score": 1,
                                    "author": "Low_Mark491"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you have the cash to pay this debt, or not?\n\nThere are usually limits that prevent creditors from taking small amounts of money in your bank account. If you have $10k in cash to your name, it's *possible* (even likely, depending on details) that they aren't able to take that money, as it's needed for basic living expenses. But if you've got $90k in your checking account, or you have significant non-retirement investment assets, then absolutely those can be taken.",
                            "score": 1,
                            "author": "shadracko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? Because my state limits \"intangible property\" such as cash and bank accounts to a $400 exemption - anything over that is seizable.  If garnished, they can take everything except $217.50/week after taxes.",
                                    "score": 1,
                                    "author": "Altruistic-Farm2712",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They can't take more than 25%. The $217.50 is the amount you get to keep even if it's more than 75% of your disposable income.",
                                            "score": 3,
                                            "author": "estherstein"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't know the laws in your state, but in my experience once they have a judgement, it'll show up on any title search for your property. In order to ever transfer title, the debt would have to first be settled.  Maybe your state has some unique protection if it's joint ownership, which is common if only one spouse owes the debt. But, that may only apply to them being able to force a sale, whether they can collect down the road at the time of a future sale is a question for your lawyer. \n\nYou owe a legal debt, you have a judgement from a court, and you have 50% equity in a home - why would it not be on the table? They may not be able to force a sale to recover, but I'm nearly certain they can just wait to recover when you decide to sell",
                            "score": 1,
                            "author": "Altruistic-Farm2712",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would be lien, not judgement.\n\nJudgement is the ruling from court that says you owe the debt\n\nLien would be something they do to enforce judgement. If it's something like a 2nd home, rental property, etc they might be able to foreclose on it. However for primary residence that would be where those homestead protections kick in.",
                                    "score": 1,
                                    "author": "ahj3939",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But a judgement gives them the ability to file a lien.",
                                            "score": 2,
                                            "author": "Altruistic-Farm2712"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Texas is a debtors paradise. They can do nothing except damage your credit report for 7 years",
                    "score": 2,
                    "author": "Dry_Studio_2114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ":) \n\nI better get started with profligate spending, then!",
                            "score": 2,
                            "author": "shadracko"
                        }
                    ]
                }
            ]
        }
    ]
}