{
    "id": "145dfgb",
    "score": 2,
    "title": "Inheriting v. purchasing home from relative?",
    "author": "deadpatch",
    "date": 1686336648.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/145dfgb",
    "media_urls": [],
    "other_urls": [],
    "postText": "My grandfather is 94 years old and has been expressing that he would like one of the grandchildren to buy his house. I would love to have the house and really want to keep it in the family, but I just don't understand why I should buy it v. just inheriting it. The house has been paid off for decades and he is in great health for his age and still very independent so obviously even if one of us purchased the home we would want him to remain living there for the rest of his days. \n\nCan someone ELI5 the differences between buying v. inheriting? ",
    "comments": [
        {
            "level": 0,
            "comment": "Does your grandfather need/want the money?  \n\nAlso, perhaps it's easier for him to think about his legacy planning in cash dollar amounts, instead of a house.  Because a house doesn't divide easily among his heirs.  If one person solely inherits the house, then the other heirs may want/need to be 'bought out' of their inheritance share.",
            "score": 2,
            "author": "Stratton50",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a good point that I never thought of. From what I understand he has a nice pension that covers his needs now but the house is most of his equity. I'll have to ask him about it. \n\nThanks!",
                    "score": 1,
                    "author": "deadpatch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe because having one person inherit the house will screw over the others who would inherit less than the value of the house.  Why should one person get a house worth $300k (an example amount) and the others only get $25k (another example amount)?",
            "score": 2,
            "author": "wickedkittylitter"
        },
        {
            "level": 0,
            "comment": "Are you assuming he’ll leave the house to the grandchildren? He may want to sell now and move into something smaller with less upkeep.",
            "score": 1,
            "author": "blacklassie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've never heard him express this, but it may be the case. We help him with the mowing and property maintenance, and he has a family friend come and do light cleaning once every other week. Otherwise, the place is tip top. He's ex-military so he can't stand a mess. Haha. Recently he had to have a procedure and was on bed rest restriction and he told me he hated it and he just wanted to go do something. A lot of his happiness comes from being active.",
                    "score": 1,
                    "author": "deadpatch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One thing to keep in mind - if he sells a house he's had for a long time, there might be a significant tax bill.  If you inherit the house, the tax basis is stepped up the value when he passed.",
            "score": 1,
            "author": "SecretWeapon013"
        }
    ]
}