{
    "id": "145gxdl",
    "score": 12,
    "title": "My employer hasn’t been paying me for the last 3 months",
    "author": "metmirr",
    "date": 1686345022.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/145gxdl",
    "media_urls": [],
    "other_urls": [],
    "postText": "My employer didn’t pay my salaries for 3 months and finally terminated my employment. They let go of everyone in the company and said they have stopped all operations. Now they are pursuing investments, and they claim they will pay my salaries once they secure investment.\n\nShould I take any action? If so, what should I do?\n\nThe startup is in Europe and I have been working remotely from outside of Europe.",
    "comments": [
        {
            "level": 0,
            "comment": "Get a lawyer. Look up labor laws for your area. It sounds like you're going to have to go after them with the law (via a lawyer or governing body).\n\nIn the future, do not EVER accept not being paid on time. Period.",
            "score": 62,
            "author": "graphixgurl747",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Maybe give them the benefit of the doubt for a day or two beyond what the first payday should be, but **no** way should you keep working for months without pay. That's insane and you really shouldn't need to be dragging things out that long for local labor authorities to be interested in the situation.",
                    "score": 6,
                    "author": "SAugsburger"
                },
                {
                    "level": 1,
                    "comment": "Thanks! What if they don’t have money? Wouldn’t I just pay lawyers?",
                    "score": 6,
                    "author": "metmirr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you don’t have money look into legal aid if your income is low enough you can get help if your stuck in the income level where you don’t qualify but don’t have enough money you’ll have to do legal research yourself many legal aid services have a website with basic info",
                            "score": 4,
                            "author": "Substantial_Camel759"
                        },
                        {
                            "level": 2,
                            "comment": "the lawyer would take your case on contingency if you have no money, then they don't get paid if they lose",
                            "score": 11,
                            "author": "krustymeathead"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why in gods name did you wait so long?",
            "score": 17,
            "author": "justalookin13"
        },
        {
            "level": 0,
            "comment": "Surely in Europe there are laws about this.",
            "score": 12,
            "author": "dissentmemo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Usually labor laws apply from where one is working. So OP would need to look into the labor laws of his own country.\n\nIndeed many EU countries wouldn't allow this behaviour. I.e. my country would require a permit to fire someone (even due to economic reasons, though a bankruptcy would be without it), latefees are due on late income &amp; the state will cover up to 3 months of late pay incase of bankruptcy &amp; the state being notified in time by employees about non payment.",
                    "score": 2,
                    "author": "gizahnl"
                },
                {
                    "level": 1,
                    "comment": "Even if I am not European can I still benefit from the law?",
                    "score": 2,
                    "author": "metmirr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What country? Europe is a continent, not a country.",
                            "score": 18,
                            "author": "bbsz"
                        },
                        {
                            "level": 2,
                            "comment": "I couldn't say",
                            "score": 2,
                            "author": "dissentmemo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's no company. There's no employment. There's no salary. \n\nIt's a scam.",
            "score": 11,
            "author": "pineapple_and_olive"
        },
        {
            "level": 0,
            "comment": "Why did you keep working there after the first missed pay check?",
            "score": 17,
            "author": "iranisculpable"
        },
        {
            "level": 0,
            "comment": "If you are working as a consultant outside Europe then what you cn do is limited.",
            "score": 3,
            "author": "Envenger"
        },
        {
            "level": 0,
            "comment": "I'm not sure why you're still going into work huh because you're not going to get paid for it. The only action you should take is to find another job, and right away. I'm sorry to say, you're not going to see that money, ever.",
            "score": 2,
            "author": "CircaSixty8"
        },
        {
            "level": 0,
            "comment": "You are a contractor to that company, as you are not in Europe. Labor lawyer is useless in this case. You may not even get paid.  \n\nHowever, if you are employed by a subsidiary of this company in your country, you need to check with labor lawyers in your country.",
            "score": 1,
            "author": "someguy1874"
        },
        {
            "level": 0,
            "comment": "If you were working B2B relationship outside of Europe with no employee work contract, there is nothing you can't do\nEven inside Europe with B2B relationship happens the same",
            "score": 1,
            "author": "Live-Seesaw-4794"
        }
    ]
}