{
    "id": "145sxqz",
    "score": 1,
    "title": "How much does an average tax service cost?",
    "author": "Positive_Lie_142",
    "date": 1686379764.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/145sxqz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've using Exquisite Tax Service when i started a side hustle/business (sole propietor), it's been a couple years now. I just logged onto the IRS website and seen that my 2022 return summary shows my refund as $3,794.00. I received $2,687. Is this a reasonable amount?",
    "comments": [
        {
            "level": 0,
            "comment": "Hard to say without knowing how much work they did for you and how complicated your taxes were.",
            "score": 4,
            "author": "eruditionfish"
        },
        {
            "level": 0,
            "comment": "I wouldn't pay $1107 for someone to do my taxes, but I don't have a very complicated tax situation. I have a W2 and a side hustle with no dependents and filing as Single. I learned the tax code and do my own taxes. If you have a similar tax situation like me, you should do yourself a favor and learn how to do your own taxes.",
            "score": 2,
            "author": "ryuukhang"
        },
        {
            "level": 0,
            "comment": "Hard to know without all the details. You could try a different place or try to do it yourself (if you don’t have complicated tax issues) and see how it goes.",
            "score": 2,
            "author": "vb_accounting"
        },
        {
            "level": 0,
            "comment": "An “average” paid tax return service is done by a barely trained H&amp;R Block or Jackson Hewitt clerk in 20 minutes in Walmart and costs $99.\n\nYours is more complicated than “average”.  Is it $1000 more complicated than average?  \n\nCouldn’t say.",
            "score": 2,
            "author": "93195"
        },
        {
            "level": 0,
            "comment": "You may find our [Taxes wiki](/r/personalfinance/wiki/taxes) helpful.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}