{
    "id": "145yge7",
    "score": 14,
    "title": "Question about moving from Chase Managed Retirement accounts to Fidelity",
    "author": "btiger12092",
    "date": 1686398410.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/145yge7",
    "media_urls": [],
    "other_urls": [],
    "postText": "A few years ago I moved some older 401Ks, IRA, and brokerage accounts into Chase Managed Accounts, which I didn’t realize how bad the 1+% fee was at the time. Majority of my retirement now sits here, so is it possible to move it all to fidelity, or will there be tax implications on the sale and rebuy, forcing me to leave it there and just make sure all future retirement is put into my fidelity account? Or could this be a clean transfer over to fidelity?\n\nAbout 40% of the funds are in Fidelity funds, with another 40% in Six Circle funds. \n\nThanks in advance for the help, really want to get away from the manager account fee.",
    "comments": [
        {
            "level": 0,
            "comment": "Just some quick observations:\n\nThe issue will probably be the Six Circles funds and your taxable brokerage account, which seem proprietary to Chase and probably (me guessing, I do not know for sure), not be able to be transferred to Fidelity in-kind. [https://www.nerdwallet.com/article/investing/switch-brokers-move-investments](https://www.nerdwallet.com/article/investing/switch-brokers-move-investments)\n\nThis shouldn't be an issue for the IRA or Rollover IRA, since you can simply sell and buy again within your IRA without creating a taxable event.\n\nhttps://www.fidelity.com/retirement-ira/ira-transfer",
            "score": 8,
            "author": "MountainStoneMist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reply, this is kind of what I was expecting. Without it being financial advice, would you transfer what could be transferred and just leave the rest to be managed by them? Or possible moving whatever remains into a Chase self-managed or roboadvised area of their services if the fees are lowered?",
                    "score": 6,
                    "author": "btiger12092",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Or possible moving whatever remains into a Chase self-managed or roboadvised area of their services if the fees are lowered?\n\nI would go this route if possible. \n\nIt's also possible you run into the same issue with the Six Circles funds and they cannot be transferred to a self-managed or robo-advisor without creating a taxable event, you would have to check with Chase.",
                            "score": 3,
                            "author": "MountainStoneMist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just left Edward Jones after a year after I caught on to how much the fees would cost me in the long run added to the fact how easy it is to self manage my own portfolio. Good on you!",
            "score": 3,
            "author": "Vauthry"
        },
        {
            "level": 0,
            "comment": "If you decide to go with Fidelity (I’ve invested with them for over 10 years now), you may want to ask some of these questions in u/Fidelityinvestments, where they have employees to answer questions about issues like these.",
            "score": 2,
            "author": "Neuromancer2112"
        },
        {
            "level": 0,
            "comment": "You may find these links helpful:\n\n- [Retirement Accounts](/r/personalfinance/wiki/index#wiki_retirement)\n- [\"How to handle $\"](/r/personalfinance/wiki/commontopics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}