{
    "id": "14650iu",
    "score": 1,
    "title": "Advice for College Student Looking to Buy a Car",
    "author": "Nishinoya-Senpai",
    "date": 1686415716.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/14650iu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi - I am a college student studying Computer Science going into my senior year and am looking to buy a car this year. I will save enough money from my summer internship to be able to put down $10k for the down payment. I also will be a teaching assistant during the school year and earn around $700 a month. My credit score is 760+. I have done some vague research on the car-buying process, but I really am still very very lost. I have a couple of questions that I am hoping you might be able to help with:\n\n1. What is a reasonable budget to set for buying a car within the next few months?\n2. Would I be able to get an auto loan?\n3. I wasn't sure how to fill in my income since my internship is only for the summer and my teaching assistant position doesn't seem like it would be of much help. If I have a full-time job offer for when I graduate, would that be factored in?\n\nAny and all advice is appreciated - thank you for reading and for your time!\n\nEDIT: Thoughts on leasing a car for 2 years instead? Is that possible and a good decision?",
    "comments": [
        {
            "level": 0,
            "comment": "No you can’t get a car loan without income. What’s the plan to pay for the car loan? And other living expenses? Since the only income you mention is $700 a month. Everything is pointing to you should buy a car under 10k in cash.",
            "score": 5,
            "author": "so_fetch567",
            "replies": [
                {
                    "level": 1,
                    "comment": "This!!! No lender, not even the sleazy sub prime (Credit Acceptance Corp) or “buy here pay here” ones, will approve a loan to OP.",
                    "score": 2,
                    "author": "321_reddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes they would.... because the application says he makes 7000 month and has 1 year at the job. Silly!\n\nIn my world, that 760 score will get him a car with no income verification and 500 down. Auto lending is a very sketchy industry nowadays",
                            "score": 1,
                            "author": "Low_Needleworker9560"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be patient. The car repos are increasing. You may find a bargain in the future.",
            "score": 1,
            "author": "BastidChimp"
        },
        {
            "level": 0,
            "comment": "NEVER EVER EVER put down more than $3000 for a car. Horrible idea. IF anything happens to the car, you lose all that money,",
            "score": -3,
            "author": "MowMdown",
            "replies": [
                {
                    "level": 1,
                    "comment": "What? Please expand on this bizarre comment.",
                    "score": 1,
                    "author": "jakebeleren",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s pretty self explanatory. Unless you’re bad at understanding finance.",
                            "score": -1,
                            "author": "MowMdown"
                        }
                    ]
                }
            ]
        }
    ]
}