{
    "id": "146bp58",
    "score": 5,
    "title": "Increase credit score in 2-3months",
    "author": "Thaunagamer",
    "date": 1686432619.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146bp58",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve read all on how to use my credit card from utilization to payments etc.\n\nMy credit age is only 1yr 1 months, I have a Discover It student card and I’ve never missed a payment. I rarely do minimum payment (I think I’ve only done it twice, just cause ion work during the school year) I always pay my statement balance or completely off.\n$5,500 in Federal student loans (I don’t have to pay them off till 2025/2026.\n\nMy score is 693, the highest it’s been has been 719.\nI want to get my score to 740 but I’m okay with 720.\nWith a higher number I’m looking forward to a lower interest/payment on a future car I want to get in a few months, it’ll be my first car in my name. \n\nShould I get another credit card with one of my debit card banks (chase or capitol One) or increase my limit on discover?",
    "comments": [
        {
            "level": 0,
            "comment": "Opening a new card will do two things. It will lower the average age of your credit by half which will drop your score some. \n\nIt will also increase your capacity which will lower your overall utilization and raise your score by some.\n\nNo idea what it would really do for your score. A lot could also happen in two - three months. You could miss a payment and really hurt your score.",
            "score": 4,
            "author": "MowMdown",
            "replies": [
                {
                    "level": 1,
                    "comment": "So should i increase my limit? I won’t miss a payment I work full time at my internship and 2nd summer job.",
                    "score": 0,
                    "author": "Thaunagamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say increase your limit. That way the negatives won't happen. But the positives will. It seems you're pretty responsible so the utilization isn't a problem. Idk how frequently you use the card but just remember to keep it below 20%-30%. \n\nNot using it pales in comparison to using it responsibly. Companies like safe but prefer trustworthy.",
                            "score": 2,
                            "author": "KaiYoD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay thank you I'll try to lower my utilization. I know when I went out the country and vacation the past two months it might've hurt my score, I was maxing out the card, cause I didnt want to use my debit in a foreign country, but I was paying it off. I learned not to max my card anymore lol",
                                    "score": 2,
                                    "author": "Thaunagamer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Get familiar with your billing cycle and credit reporting dates.  If you have to use your credit more (maybe an emergency idk), pay it back down before it reflects on your statements/reports.",
                                            "score": 2,
                                            "author": "KaiYoD"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ask Discover for limit increase every 3-6 months. Starting today. They don't do hard pull.\n\nNext pay down your card balance before your statement date. Most banks only report your statement balance to your credit reports once a month and this is what is used to calculate utilization.\n\nFor the best possible scores you want one card to report a small balance, say $5, and the rest $0. If you let everything report $0 balance it'll drop your scores around 20 points.\n\nThose times you had 719 score was likely due to a lower reported balance.\n\nThe higher limit on your Discover card will help you get approved for a higher limit with the new bank. Do the same thing, ask them for a limit increase every 6 months. The higher limit will reduce your credit utilization and keep boosting your scores.\n\nWait until the lower balance (and hopefully higher limit) get reported. You should see a nice increase in score. Now you go and shop for your 2nd card. Look with something with decent rewards and also a nice bonus you can use (so maybe not some Amex Platinum with $5k spending requirement and $500 annual fee, plenty of cards will give you $200-300 bonus for spending $500 or $1000 and $0 annual fee)\n\nA few weeks before you go car shopping do the same thing with the balances. Pay them down so one card reports $5 or 10 balance and the rest $0.\n\nRead these:\n\nhttps://www.asksebby.com/building-credit/how-to-aggressively-increase-your-credit-score-short-term-strategy\n\nhttps://www.youtube.com/watch?v=DC9Xgnam0IA\n\nhttps://creditboards.com/forums/index.php?/topic/544017-the-master-2-reporting-trick-explained/\n\nPeople will come here and tell you don't worry about the balance it doesn't \"build credit\" yea that is true, but it will boost your scores and that will help you build credit when you go to ask for limit increases and apply for new accounts.",
            "score": 3,
            "author": "ahj3939",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much, for giving me links and a detailed explanation!",
                    "score": 1,
                    "author": "Thaunagamer"
                },
                {
                    "level": 1,
                    "comment": "I believe Discover posts balances every Wednesday, versus on statement cut date. You can also message them or chat and request they push an updated balance to your CRs.\n\nMaking claims that 0% utilization will drop some specific amount of points is not advisable. While 1-3% utilization seems to be \"best\" from a scoring perspective, and 0% is not optimal, it's impossible to predict the impact on the score other than \"down.\"\n\nFYI Amex Plat is at $695 AF these days too.. and usually a $15k min spend on the signup bonus.",
                    "score": 1,
                    "author": "Google-it-you-lazy-F"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can buy authorized user slots on peoples' old and high-limit cards. I used to sell slots; it's called piggy backing. I haven't been \"in the game\" in years, but I'm sure it's still a thing. Some folks would jump 50-100 points from just a couple of my cards. Others would see a difference but only 10-20-30 points.\n\nSomething to consider, since it's very quick (relatively speaking) results. Just no guarantee that it'll work to push you over 740.",
            "score": 1,
            "author": "Google-it-you-lazy-F"
        },
        {
            "level": 0,
            "comment": "Have you heard of a self loan? https://www.self.inc/about \n\nI have been able to raise my credit score using this method and so has significant other. The best part is you get the amount you paid in your loan back to you once the loan term is up.",
            "score": 1,
            "author": "Shtfoadb"
        }
    ]
}