{
    "id": "146hpm2",
    "score": 2,
    "title": "Withdraw I-bonds or take out student loans first?",
    "author": "ProcessUpstairs9512",
    "date": 1686449149.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146hpm2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm not sure what is the smartest thing to do with my loans and money right now.  \nI purchased $7k in ibonds (the amount I knew I would be ok to live without taking out beyond the direct unsubsidized loans) which were issued May 1, 2022 during the hype to buy (interest rate was 9.62%). Now, the interest rate is 3.62%. During the first year of grad school, I took out only direct unsubsidized loans (4.99%, which hasn't been accumulating because of the student loan repayment pause) and lived off the remainder on my savings.  \nNow, it's time to take out loans for the summer of my second year. I can take out a second lump sum in the Fall. I've used up my savings and will definitely need to take out a lot more this year, relying on direct unsubsidized loans (7.05%) and Grad plus loans (8.05%).  \nI'm wondering if I should withdraw my I bonds now, losing 3 months of interest, or wait until next year, when I'm running low and living off of the last bit of my loan money. Or keep the money in indefinitely and let it mature? Or take it out now and put it into a Roth? It's a lot of moving around and seems like a small sum of money to be so concerned about, but just trying to minimize the cost of grad school :'( Would appreciate any and all advice!",
    "comments": [
        {
            "level": 0,
            "comment": "If you can, try to keep it in I-bonds for at least 3 months at 3.62% (instead of losing the previous 3 months of 6+%).",
            "score": 6,
            "author": "FlushTheTurd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah that makes so much sense, thank you!",
                    "score": 3,
                    "author": "ProcessUpstairs9512"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You may find these links helpful:\n\n- [US Treasury Savings Bonds](/r/personalfinance/wiki/savingsbonds)\n- [\"How to handle $\"](/r/personalfinance/wiki/commontopics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Well what is it for? If it is for a planned purchase I would either keep it in there until you are ready to purchase or pull it out end of the year and transfer to an HYSA with a higher return.\n\nIf this is money for retirement I probably wouldnt have put it in ibonds at all. Id pull it out and put 6.5k in a Roth IRA and the rest is not much money so maybe into an HYSA to pad your emergency fund (which I assume you have?)",
            "score": 0,
            "author": "Grevious47",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not necessarily for a specific purchase, but just for tuition and living expenses since I won't be making money until I graduate and get a job. I've used up all the savings I had from the one year I worked between undergrad and grad.  Essentially every dollar this next year I spend will be student loan money, including a 5k emergency fund.  (other than potentially the 7k that I have in ibonds)",
                    "score": 2,
                    "author": "ProcessUpstairs9512",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah okay well if you have expenses to pay then yes you should withdraw to pay your expenses. You dont have money to invest.",
                            "score": 1,
                            "author": "Grevious47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed, I'll discount the Roth option. I guess since I have to take out all my loans at once anyway and the interest will accrue regardless, I will keep my I-bonds in until the loan money begins to dwindle",
                                    "score": 1,
                                    "author": "ProcessUpstairs9512"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}