{
    "id": "146i42s",
    "score": 2,
    "title": "Need advice/opinions on my budget",
    "author": "HungryKevin",
    "date": 1686450405.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146i42s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! \n\nI’m 28 in an MCOL area. I don’t have much guidance in the way of finance and I’ve structured them based on what I’ve read here. But I would really appreciate any advice or opinions on my budget. \n\nSalary: $95.6k \n \nPre-tax savings: \n- 401k: $1200/month (includes match)\n- HSA: 300/month (maxed)\n\nPost-tax savings: \n- ESPP: $300/month (20% discount)\n- Cash: $250/month\n- Brokerage: $250/month \n\nRoth IRA is already maxed out for the year. Roth IRA and HSA are exclusively in VTSAX. I sell the ESPP after the holding period and use it to fund my Roth. \n\n401k:\n- 70% FID 500 index \n- 20% International Index \n- 10% Alternative Energy Index  \n\nBrokerage: \n- All in VOO. I know people say to invest in this account only after maxing out the tax advantaged accounts, but I don’t see the harm in having an account that can be accessed before retirement. \n\nTotals savings: ~$2300/month \n\nExpenses: \n- Rent: $1850\n- Groceries: $400\n- Car: $300\n- Student Loans: $300\n- Utilities: $200 (includes internet/phone)\n- Insurances: $80 \n- Gym: 60\n\nTotal Expenses: $3190/month \n\nI know theres room to cut in my grocery budget but my company has subsided breakfast and lunch which is good quality and really convient. Usually have a $3 breakfast sandwich and the $7 lunch special. That accounts for half of my grocery budget. \n\nLeft Over: ~$900 a month\n\nI didn’t start my career until I was 26. I spend my first four years out of college working bar shifts and travelling. When I started my job I had like $50 in my account, so now I’m feeling a little behind compared to my peers. \n\nI also have 4 months living expenses of cash in Fidelity’s money market. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "$400 for groceries + eating out is fine (I consider any purchased prepared food, like your $10 work meals, as eating out). \n\nDo you have a savings account / emergency fund built up? What's your uninvested cash balance (probably in a HYSA or similar)?\n\nThat plus the amount in your brokerage should influence whether you put more into your 401k or keep the extra cash as accessible. [The wiki](https://www.reddit.com/r/personalfinance/wiki/commontopics/) has some good resources on this.",
            "score": 1,
            "author": "Empyrion132",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forgot about that. 3.5 months living expenses in emergency cash in a Fidelity money market. Brokerage is only $300, I just started contributions but have pay checks configured to auto-flow into VOO. \n\nI can sell my employee shares in December, which will cover the additional 2.5 months of cash needed for the 6 month emergency benchmark. Would probably be wise to stop the brokerage contributions and just put it into cash now though.",
                    "score": 1,
                    "author": "HungryKevin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like you're in a good place. You're saving more than 15% for retirement (between 401k and Roth IRA), and it's not unreasonable to keep any excess above that in taxable accounts. \n\nI just noticed you also have student loans. If the interest rate on that is more than about 5-6%, it's probably worth prioritizing paying those down with your excess $900. Otherwise, 'd use all available excess to get the HYSA up to 6 months. At that point it's a personal choice of whether you'd like to also move towards maxing out your 401k in future years (only another $675/mo) or just keep it all in a taxable brokerage account. You're doing well!",
                            "score": 1,
                            "author": "Empyrion132",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha thanks! I can’t help but to compare myself with my friends who got careers right out of college. I feel like I missed out on an important four years of savings. \n\nLoan range was between 3-6% but I think Bidens student loan plan has brought them down, not really sure to what effect. I’m locked in on $300/month payments for the next two years, which is manageable. My plan is to look into refinancing down the line if private rates are in better shape/to see how the election turns out.",
                                    "score": 1,
                                    "author": "HungryKevin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not worth comparing yourself with other people, just focus on your goals for where you want yourself to be. \n\n3-6% is a great rate, that's definitely at the level where I'd stick with building up that emergency fund rather than worrying about paying them off faster. $300/mo at your income is totally doable. I'd probably just pay them off when interest rates drop - you're unlikely to be able to refinance later, as they're likely among the lowest that were ever available.\n\nGood luck!",
                                            "score": 1,
                                            "author": "Empyrion132"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't feel like you're behind. You're actually doing far better thankst people your age. Keep it up. However I would still recommend you max out your retirement accounts before investing in your taxable account. Its not how much money you make but how much money you keep.",
            "score": 1,
            "author": "BastidChimp"
        }
    ]
}