{
    "id": "146ib8i",
    "score": 1,
    "title": "Best way to approach a home upgrade",
    "author": "ContractCreepy4861",
    "date": 1686451029.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146ib8i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all -\n\nMy wife and I moved from the Midwest to Bellingham WA 3 years ago and bought our first home here.  We've been in it two years and love the area, but have some regrets about the exact house we got.  The main one is noise, its close to a busy road, that is uphill.  Its tolerable and we could do upgrades to the home (better windows) to make it more tolerable, but long term we don't want to stay in it.\n\nWe bought it for \\~ 630K and its now worth about 850K.  We have a 3% 30 year fixed mortgage. and have about $373,000 in equity in the house.\n\nTrying to figure out the best way to approach upgrading.  The Bellingham, and most of the I5 corridor in WA state, seems to never really slow down so I do worry about prices continuing to outpace returns / salary increases.\n\nIf we were to upgrade today we'd be looking at houses in the $900K - 1 Million range.\n\nOur two options:\n\n**Use our existing funds to upgrade right now**\n\nAs outlined below we have a about $430,000 in an after-tax brokerage account we could liquidate and use + the money we walk away from our current house with we could put maybe $650,000 ish into the new place, making a major dent.  We'd be going from a great 3% rate to 6 or 7%, so our future dollars would likely be put into paying that off ASAP.\n\n**Save more cash and upgrade in 3-5 years**\n\nWe could probably save \\~50K a year in cash towards this goal.  Doing this route would allow us not to touch our current investments as much.\n\n**Third Bonus option**\n\nThe neighborhood and interior of the house rock, we could put 20K into better windows and ride this place out for 10 years until we are at a place of more financial power. Honestly its hard to justify this upgrade, but its kind of the only thing we really want to 'save' for right now.  We don't want kids, don't have debt, so... this seems logical to chase? I just don't want us to give up a our \"FU money\". \n\n**More Detail about us**\n\nNow onto the Finances. We are in our early 30s and make a household income of 300K a year (250K me, 50K my wife). We have a 1.4 million NW. 1 million is in VTSAX equiv. assets. 600K in tax advantage and 400K in after-tax brokerage. 400K equity in current home. Financial goal wise we both love our jobs, and want to do it for a the foreseeable future, though maybe sometime in the future I'll make less... maybe 150K if I take a lesser job? We spend about 6K a month in non-house things when we are being spendy.  FI is a goal for us, but RE not so much.  Maybe want to retire in mid 50s.",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly? I'd spend the $20k on better windows and see how I feel then.\n\nWith $1.4M NW, spending $20k is like 1.3% of your net worth. VTSAX can move by that much in a week. You say noise is the main issue, and getting better windows might fix that. Why send $50k+ down the drain on brokers to buy a different house, with its own uncertain problems and which you may or may not end up liking more, when you can first spend $20k and potentially solve your problem?\n\nFurthermore, even if you decide to move in 3-5 years, that means you're looking at an amortized cost of \\~$5k/yr. You make $300k/yr, so this is also only 1.6% of your pay. \n\nIt's not giving up your \"FU\" money. You have $400k in a brokerage account. You're fine. \n\nAnd if it doesn't solve your problem - odds are probably good that at least some of that cost can be recouped in the sale of the home, especially since new windows also probably means better insulation.",
            "score": 5,
            "author": "Empyrion132",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm saying that upgrading homes puts us in less of a position of power, thus giving up \"FU\".  My gut says stay in this house and upgrade the windows.  But then the other part of my brain says \"you have the money, move to the quite culdasac.\" That then gives me much less FU power having a million dollar home vs a 630K home, higher rates, and probably less fun money just for a minor housing change.",
                    "score": 2,
                    "author": "ContractCreepy4861",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah gotcha, I misunderstood. \n\nBuying too much house is also a *very* common problem, especially if you're looking to potentially lower your salary significantly in the future. Right now, you have a lot of potential freedom from your finances; switching to a more expensive house would set you up with some golden handcuffs. \n\nLooking at it from an investment perspective, a more expensive house would then also be a significant majority of your net worth - not a very diversified portfolio.",
                            "score": 3,
                            "author": "Empyrion132",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, I think you're 100% right.  Maybe once my non-house NW is 2 million I'll start thinking about (and saving) for a house upgrade.  Does that sound reasonable?",
                                    "score": 0,
                                    "author": "ContractCreepy4861",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Definitely save / invest towards the house upgrade. Rather than setting an arbitrary NW target, I'd calculate the expected expenses and work backwards from there. I'd consider pulling the trigger when I know I could comfortably afford the house (including non-mortgage expenses like tax and insurance) on the lowest realistic income I expect to have. \n\nSo, for instance, if I think I may want to make $150k later on and my wife may want to take a sabbatical or start her own business and make $0 for a few years, I'd look to have enough down payment (+ other investment income) that I could afford to keep paying the costs of the $1M house (or whatever it might be)  at that lower income, while still meeting retirement goals. \n\n**Wild speculation follows**\n\nJust to do some quick, very rough math… assuming you want $150k/yr in retirement with a conservative 3% withdrawal rate, you'd need $5M NW in taxable + tax-free accounts. Maybe if you already own the house free and clear, and you have Roth accounts, you could lower that to $100k/$3.3M in non-house NW. Right now the $1M you have invested should grow to about $3.8M in 20 years, so that could have you right on target if you make no additional contributions. Congratulations, you're (probably) Coast FIRE'd already.\n\nRight now you make $300k/yr, which is probably around $180-200k after taxes, and you probably spend \\~$110k/yr on all expenses. So you have room to save up to $90k/yr towards a new down payment. (This aligns with your $50k/yr stated above, adding on the $45k/yr from maximum 401k contributions - which you should continue making, but you can also move $45k/yr from your brokerage accounts to your house savings fund and likely be fine for mid-50s retirement). \n\nBut since you already spend around $110k, that's basically all of the available spending on a $150k single salary, so you'd want to keep your new home monthly costs to be the same as your current home costs. You could be doubling your interest rate and increasing property taxes as well, so you need to significantly reduce the debt you take on for a new house - maybe let's say $150k debt instead of $250k debt. So you'd need to save virtually the entire $1M cost, separate from your current non-house NW and associated growth. Since you have about $400k equity in the current home, that's probably about 6-10 years of saving &amp; investing, depending on how home prices and interest rates do. \n\nThe better way to do this math would be to figure out the mortgage + property tax + other costs associated with the home you want, and figure out what level of mortgage gets you the monthly cost you want, but this was faster for me.",
                                            "score": 2,
                                            "author": "Empyrion132",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the detailed response! You're right on with all that, very impressive :)",
                                                    "score": 1,
                                                    "author": "ContractCreepy4861"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Sorry I'm not sure if I follow your suggestion 100%.  So right now our spending is about 100K a year and we likely won't go down to 0 earnings for many years.  The house will be paid off in 28 years.  So, as you stated, we are well into CoastFI.\n\nOne suggestion you made was to calculate the house on my lowest expected earnings.  One thing that rubs me the wrong way is ever really living like we make 300K.  I *really* like the lack of stress that living below or means gives us.  \n\nWhile I said I did want to have the **option** to make less money, I actually am going pretty hard at my career now and could see my salary going up in the next 5-10 years.\n\nI *really* like the fact that we have this type of financial situation where we don't need to save another dollar, and we can retire on this lifestyle.  I'm not sure I want to compromise it.\n\nLast year we saved about 100K.  So I feel like I could continue to bolster our long term savings (Max 401Ks, Backdoor Roth, HSA max) - say about 50K and then save the rest for a future house upgrade in a money-market account?",
                                                    "score": 1,
                                                    "author": "ContractCreepy4861",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, I wrote all that out without really editing, which is probably why it was a bit confusing.\n\nYes - you can (and should) continue to bolster your long-term savings and save the rest for a future house upgrade.\n\nThe uncertain pieces are 1) how much to put into long-term savings, on net, and 2) where to put the house savings.\n\nUltimately, you may not need to put more into long-term savings if you do not want/expect to spend more in retirement, or want to retire later. As a result, you could put $75k or even $100k annually towards your house savings. Because you still want to utilize tax-advantaged accounts, I would do this by maxing out all those tax-advantaged accounts and then transferring / allocating that same cash amount out of the taxable brokerage and into the house savings pool.\n\nAs for where to put the house savings, a MM fund is a good place, but since your time horizon is longer than 3-5 years (more likely 6-10 years), you could put it into an index fund and would probably be okay / do better than a MM fund in the long run.",
                                                            "score": 1,
                                                            "author": "Empyrion132",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Got it, thanks!",
                                                                    "score": 1,
                                                                    "author": "ContractCreepy4861"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So I was debating really ramping up my tax-advantage savings, are you suggesting that maybe I only do 401K , HSA, (backdoor roth maybe?)? How much should I keep putting into my retirement savings? \n\nHere is a snip from another post on how I was thinking about savings\n\n*Looking for a spot check on my current savings plan. My wife and I are in the \"boring middle\" right now just stacking chips, making sure we are doing it the best way. We are both early 30s, no desire for kids, no debt other than the house and about an 80K a year lifestyle (including mortgage payments). we already have 1 million invested in VTSAX or Equiv. with 60% of that in tax advantage and 40% in after-tax brokerage. We also have 400K equity in a home we purchased for \\~650K and is now worth nearing 900K. We have $473,000 left on our mortgage at 3% interest rate (30-yr fixed).*\r  \n\r  \n*My base pay is \\~$180,000 with the rest being bonus / RSU. This will mater later.*\r  \n\r  \n*We have a combined income of 300K. Here is how we are savings. Most of these investments go into VTSAX or Equiv. funds.*\r  \n\r  \n*I max my 401K ($22,500) and get a 4% match ($7,000), great investments through Fidelity using BrokerageLink*\r  \n\r  \n*I max a family HSA with $7,750*\r  \n\r  \n*Wifes 401K has garbage investment options (high ER) so we only put in enough to get the match. Contribute $5,000 match $1,611.*\r  \n\r  \n*Backdoor Roth IRA for me (can't do her as she has a traditional IRA which I don't want to roll into her crap 401k) - $6,500*\r  \n\r  \n*At my job I also have access to a Mega backdoor Roth. I have it set to 10% of my pay, which is calculated on my base so I put in \\~$18,000.*\r  \n\r  \n*That comes out to \\~ $60,000, or 20% savings rate.*\r  \n\r  \n*This is on the low side, but we have a great base savings already. I just read die with 0 so I'm trying not to limit us too much now, but we will definitely not be spending the remaining amount fully every year. We also are likely to get a few large inheritances in the next 20 years. I know the guidance of this sub is not to 'count' on them, but I don't want to exclude them fully either in our planning.*\r  \n\r  \n*So here is what I'm thinking of doing:*\r  \n\r  \n*Max the backdoor ROTH - The max in 2023 is $66,000 and right now I have about $47,500 going in. If I change my backdoor amount to %20 I should hit that on the nose.*\r  \n\r  \n*Spend the rest, or continue to save in after-tax. I have a $30,000 ER in a HYSA which I can spend out of should we want a big purchase (great vacation, gaming PC, etc. and refill it). If I start getting too much cash I'll just throw it into VTSAX in my brokerage. I know the ER is sacred, but with us both working, and the amount of funds we have behind us I'm fine using it like that.*\r  \n\r  \n*Should I switch my 401K contributions to Roth? I'm in a no income tax state so our marginal tax rate is about 25%...*",
                                                                    "score": 1,
                                                                    "author": "ContractCreepy4861",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How much do you want to have in your retirement accounts when you start withdrawing from them (presumably when you reach 59 1/2)? Work backwards from there. \n\nAlso - given your NW and income, your best bet at this point is likely talking to a fee-only financial advisor. You will get better and more accurate advice, and more importantly more certainty  than you are going to be able to get via Reddit.",
                                                                            "score": 1,
                                                                            "author": "Empyrion132",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What do you think of this general plan?  \n\n\n\r  \nFinancially I will follow through with the following savings plan:\r  \n\r  \nThe 430K I have in a brokerage account will be worth \\~ $630,000.  This could be used for home upgrades if I want.\r  \nI will max the following retirement accounts.  This will equate to $87,000 a year in continuing to build our retirement fund.  In 5 years this will put the total value at this account at \\~ 1.5 million.\r  \n\\* My 401K \r  \n\\* HSA\r  \n\\* Backdoor Roth IRA\r  \n\\* Mega backdoor Roth 401K\r  \n\\* Wife 401K to match and employer matches for us both\n\nOutside of not upgrading a house we will live the exact life we want, traveling nicely, buy toys we want, etc.  Any extra money will be put into the brokerage account. After keeping a 50K HYSA for our ER and to help my parents should the need arise.\r  \n\r  \nAt the end of the 5 years we will likely have a 2.2 million NW, not including house.  At this point we can consider if we want a house upgrade and what that might look like.  We may also decide to live abroad, move back to the midwest, or who knows what.  Regardless we will be in a better financial position.",
                                                                                    "score": 1,
                                                                                    "author": "ContractCreepy4861"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some thoughts relating to the soundproofing of the house: even if you throw $30-40k at the problem, it’s a drop in the bucket if it makes you happier in the home and thus don’t need to upgrade to much more expensive home and lose your historically low interest rate. \n\nDouble pane windows should have two different glass thicknesses to increase their acoustic value. May make sense to go to triple pane windows at 2nd floor. The installer should pay close attention to the sealing of them when installing as that makes a difference too. If age of house makes sense you could spring for a whole weatherproofing package to improve sealing. What about a wall along the property line to dampen the sound nearer to the source? Block off line of sight to the sound source. Masonry wall would be best.",
            "score": 2,
            "author": "BanjoDelicious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! We had a construction company come out, they are going to quote us some bad-ass windows.  Our current are double pane, but super thin glass spec builder grade.  Our house is built into the side of the hill, so the window of our bedroom is like 20 feet of the ground with a hill behind it, not really able to block the sound with anything like a fence or shrubs.",
                    "score": 1,
                    "author": "ContractCreepy4861"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly sounds like you enjoy your current home. If you plan on being there for 5-10 years, go for the updates! Also see if you can add shrubs as an extra layer of sound proofing",
            "score": 1,
            "author": "small_impact",
            "replies": [
                {
                    "level": 1,
                    "comment": "The house is weirdly built into a side of a hill, so where the noise is the worst is effectively the 2nd floor (even though its the first) so that isn't really an option.\n\nTo be clear we love the PNW and could see ourselves here for many years, but given the choice we'd probably change houses today (finances aside)",
                    "score": 1,
                    "author": "ContractCreepy4861"
                }
            ]
        }
    ]
}