{
    "id": "146qzsy",
    "score": 0,
    "title": "Got on the hook to either keep subscribed for a recurring payment for a shady service, or pay significantly more if I cancel the service- will cancelling my credit card get around this?",
    "author": "IAmAccutane",
    "date": 1686481048.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146qzsy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I signed up for a Maid cleaning service where they give you something like a 70% discount on their normal service as long as you pay a small recurring monthly fee. The catch is, per the fine print, you need to stay subscribed for 1 year or more before you cancel, or else you need to pay the full price of every cleaning you had while under the recurring discount. Did the math and it would be cheaper to just wait it out for a year (but still a few extra hundred dollars I'd rather not pay). It's a shady scam, they know what they're doing.\n\nI cancelled my credit card recently because it was stolen and was going through all of my subscription services to replace the card, but I was thinking- does it count as \"cancelling\" the service if my card is no longer valid? Or is my credit card being invalid going to end up with them ringing me up for the full cleaning fees that would normally come up if I cancel?\n\nI'm thinking, they'll no longer have my a valid credit card number, but surely they have my address and other information. I'm not sure if they're legally entitled to force me to pay for this or if cancelling my credit card is just a loophole to get out of this fine-print-trap they put me in.",
    "comments": [
        {
            "level": 0,
            "comment": "It’s not a shady scam, it’s a contract.  You agreed to it, and as you said, it’s a better deal not to cancel.  Get the cheaper price with a one year contract, or the more expensive price without it.\n\nNo, cancelling your credit card will not save you.  You’ll still get billed.  If you don’t pay, best case is that it gets sent to collections and destroys your credit.  Worst case is that plus getting sued.",
            "score": 18,
            "author": "93195",
            "replies": [
                {
                    "level": 1,
                    "comment": "i would agree, strictly speaking, that it's not a scam. it is however, imo, a business practice dark pattern. just like services that try to convince you not to cancel when you try to do so.\n\nedit: OP still needs to pay. they agreed to it and signed the contract.",
                    "score": -2,
                    "author": "krustymeathead",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "None of what you're saying is correct. The way that they can give a discount on the price is to get a longer-term commitment from a customer. It sounds like a fair deal.",
                            "score": 4,
                            "author": "CircaSixty8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i was giving my opinion. i'm not saying it's unfair, i'm saying that i think it's a business model that can deliver a less than ideal customer experience.\n\na plumbing company in my area has similar setup and pushes their service plan really hard every time i've had them out, which really rubs me the wrong way. it would save me a couple hundred on my service that day, but its $15/mo for a year and i have to remember to call and cancel later. maybe some people get their money's worth from the plan, but longterm, i would not. hopefully OP's maid service isn't as pushy about selling contracts.\n\nthere is a reason cell phone plans moved away from contracts as it is crappy to customers. again, all perfectly legal and fine, and maybe it is necessary for some businesses, but it is something that i personally detest if it is pushed.",
                                    "score": 1,
                                    "author": "krustymeathead"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A new card number doesn’t not excuse you from previously agreed upon financial obligations.  You can either pay the full amount of the services rendered or keep the fee for the remainder of the year.  They will call for updated billing and if you don’t pay they are allowed to send you to collections (assuming there was a contract).",
            "score": 8,
            "author": "oxymoronic-thoughts"
        },
        {
            "level": 0,
            "comment": "Also, if you just replaced the card, IE, got a new CC number, subscription services may be able to use the new number without your intervention, many credit card companies have a mechanism for this for subscriptions.",
            "score": 2,
            "author": "AskAgainLater_Petal"
        },
        {
            "level": 0,
            "comment": "If your card is no longer valid they’ll probably cancel your service for non payment.  But you still owe them the back money per your contract.  They will reach out to you to settle and will then eventually send you to collections ruining your credit.",
            "score": 1,
            "author": "blanktom9"
        },
        {
            "level": 0,
            "comment": "How is this shady?  You've made no mention of them not cleaning adequately per the agreement.\n\nYou get a 70% discount if you keep the service for a year.  This is an extremely common incentive.  After a year you will be so accustomed to having the service that you might auto-renew at full price.\n\nCell phone, cable etc. often have deals like this.  The difference is, you've decided maid service is optional.",
            "score": 1,
            "author": "1962Michael"
        }
    ]
}