{
    "id": "146tez7",
    "score": 0,
    "title": "Land lot advice needed",
    "author": "sucurii",
    "date": 1686488566.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146tez7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking for advice on a property I bought last year. Details are: purchased lot at $43k with $11k down. Owner Financed Loan of $32,250 on a 2-year balloon with a 10-year amortization at 7% interest. Balloon payment will be due April 2024 at around $27k. \n\nCome April 2024, what would be best option  to refinance or what would be your advice? Currently, the payment is very doable for us but I feel like we got a great interest rate that we won’t be able to match with current market and the fact it is land. I really don’t know what would be the best route to finance this (can’t afford balloon payment due in lump sum). \n\nBackground info: bought planning to build in semi rural up and coming area. Since then, the $250-350k neighborhood is now selling for $600-700k, essentially pricing us out. We are moving to a new state anyway so should I keep this as a long term investment or just sell? I am viewing it as a long term asset that could potentially pay a kids college fund or something similar down the road.",
    "comments": [
        {
            "level": 0,
            "comment": "Keeping it could be wise if the area is projected to grow. But lots don't appreciate very well (relative to a house on the lot) unless it is very low supply of land in the area.\n\nPerhaps try getting a line of credit for the amount? Or negotiate a renewal with the seller?",
            "score": 2,
            "author": "GTAHomeGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely a high growth area and one of the last 3 or 4 buildable lots in an established approx 40 home neighborhood. Cul de sac lot",
                    "score": 1,
                    "author": "sucurii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah may have decent value over time. But look into maintenance costs and taxes. You don't want neighbours being a thorn in your side if it isn't kept up.",
                            "score": 2,
                            "author": "GTAHomeGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Near entirely wooded lot. $250/year HOA that manages the only strip of grass on the lot by the road. Last year property taxes were approximately $330. Not that worried about maintenance. Neighbors actually enjoy not having physical neighbors there lol",
                                    "score": 1,
                                    "author": "sucurii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Could be a good spot. Try and see if there is a way of projecting lot value, a local agent may be good resource. Area makes all the difference. I have seen some lots appreciate very slowly and some very well. Your vacant lot will likely help the adjacent neighbours until you sell though haha.",
                                            "score": 1,
                                            "author": "GTAHomeGuy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes they love that it is vacant, older retired couple that enjoy the birds and wildlife on the property. Only 3/4 acre but it’s a peaceful area. Hard to predict future value but again it’s a high growth area  (metro Atlanta) and established neighborhood. For context, lots were around sub $10k during primary construction of the neighborhood (~2007-2012), around $25-30k pre-pandemic (~2019), and are currently estimated around $50k.",
                                                    "score": 1,
                                                    "author": "sucurii",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "With that much growth, hopefully the area trends similarly. It shouldn't lose with the low holding costs.",
                                                            "score": 1,
                                                            "author": "GTAHomeGuy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm dealing with the exact same situation. I own a piece of land in another state. Two years ago I was planning to build a house on it to be closer to work but I got a great job offer in another state. I own the lot outright and only have to pay property taxes on it. \n\nI spoke to a realtor who said the lot hadn't appreciated much in the mean time. It might go up some, but I'm not sure. The realtor said it would be easier to sell for a premium if the lot was cleared and the driveway put in, but that will cost about $6k and I'm unsure if I want to put that kind of money into it. \n\nFor now I'm just holding. I put an ad on Craig's List every now and then just to see if I get any bites on it, but I'm not actively motivated to sell it and definitely won't give it away.",
            "score": 1,
            "author": "moistmarbles"
        }
    ]
}