{
    "id": "146u2qt",
    "score": 2,
    "title": "ISO advice/ opinion on what to do with $50k",
    "author": "rivermonster1231",
    "date": 1686490428.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/146u2qt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys, 28 years old and in the Navy. By the time I'm home from deployment next summer, l'll have $50k saved up, with no debt aside from my mortgage. My wife and I want to do updates on our house, but it isn't urgent. I was wondering what kind of ideas you all have for me on how I could turn my $50k into, well, more money. Always have been hesitant to dip into the market, mostly out of fear of losing the little scraps l've been able to save, losing even half of $50k would be pretty life changing. Any input would be great, thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Start with defining the timeframe for the money.\n\nYou state you want to do updates on your house, but the timeframe is unclear.\n\nIf the 50K is for a short term goal (ie &lt;5 yrs or even &lt;10 yrs), then you probably should not subject the money to market risk.\n\nShort term should be in Cash/Cash Equivalents.  Examples include:\n\n* HYSA\n* CDs\n* Treasuries\n* Money Market Funds",
            "score": 3,
            "author": "BouncyEgg"
        },
        {
            "level": 0,
            "comment": "*losing even half of $50k would be pretty life changing.*\n\nSounds like you have a low risk appetite. Investing in your house is not a bad thing so doing small updates over time to not deplete this is good. Is this in a HYSA? Right now discover, ally, capital one are all yielding ~ 4% with zero risk. You can also look at a CD yielding &gt; 4% for 12 months. Ally offers one that has no penalty for withdrawal and is currently paying 4.25%.",
            "score": 2,
            "author": "texanchris",
            "replies": [
                {
                    "level": 1,
                    "comment": "Low risk appetite is well put. Mostly, I know that $50k can be utilized to make myself more money, just don’t want much of risk to lose it while still capitalizing on it. Looking at a short term goal of making $50k turn into more during my remaining time in the navy post deployment(about 18 months). Sounds like CD would be a good choice",
                    "score": 1,
                    "author": "rivermonster1231",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you don’t need to touch the money a CD is a great choice. Ally has an 18 mo CD at 5%. Remember, most CDs have penalties for early withdrawal so only put what you don’t need in there. Here’s a nice little calculator that will show you how your account will grow based on whatever variables you input:\n\nhttps://www.bankrate.com/banking/cds/cd-calculator/",
                            "score": 2,
                            "author": "texanchris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Appreciate the help!",
                                    "score": 3,
                                    "author": "rivermonster1231"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is so much to do with it. What are your skills, what’s your credit? What are you into and what do you spend most of your time doing? Start strategizing a few ideas. You are in control of your risk to reward. I love the market but you need to learn it without 50 k first or get someone to help you. Updating your house is cool if your in a booming area for real estate and can gain a lot of equity by doing it (also keeping the boss happy). I would advise you to sit back and really think what you want and why you want it and that 50k can do a lot! Best of luck OP, please don’t get dooped and choose what will make you feel good about it for years to come",
            "score": 2,
            "author": "Sorry-Place6291"
        },
        {
            "level": 0,
            "comment": "If you don’t have an emergency fund saved yet, then I’d recommend devoting all/much of that $50K to it, and defer your home improvements since you said you had time.  4-5% is easy to find in an online savings account these days.  3-6 mos of income.  If you already have an e-fund, then figure out how much you want you want to spend on your improvement, and then invest the remainder in your TSP using an asset allocation you are comfortable with.  If you haven’t opened a TSP account then do so.\n\nWhile you’re on active duty, open a high-tier credit card with Chase, Capital One, or AMEX.  The expensive annual fees are waived for you while on active duty so that’s just free travel money and rewards, just pay the balance off every month.  I made a big mistake not taking advantage of this until late in my career.",
            "score": 2,
            "author": "welcometodapartypal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is there a tax associated with the interest you make from a CD yearly? Does that money need to be claimed as income?",
                    "score": 1,
                    "author": "rivermonster1231",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interest gained on CDs is taxed at your normal income tax rate. Typically you declare it in your tax return for each year you hold the CD. The CD providing bank will issue a 1099-INT form to you annually with the tax information. Yes, you do have to pay tax on the gains even is the CD hasn't yet paid out at the end of it's term.",
                            "score": 2,
                            "author": "nextSibling"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First get it into a HYSA or better an ultrashort treasury fund like ICSH so you get more comfortable with ETFs and investing (this is an ultra safe fund that is returning 5% with basically no risk).\n\nThen follow the flowchart in /r/PersonalFinance for what to do with your money but this may take some time as you’ll want to be aligned with your wife on these decisions.  This is a good learning opportunity for the both of you.\n\nSorry to say that investing in the house is not a great investment.  Do stuff that is necessary for your quality of life and a few special things that you think will help with curb appeal but otherwise stay frugal because that money won’t come back out of the house most likely.",
            "score": 1,
            "author": "AdamN",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's a **[link to the PF Wiki](/r/personalfinance/wiki/index)** for helpful guides and information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for your service, from a Navy vet. Are you investing in the TSP?\n\nInvest in the TSP since the government matches at least 5% of your salary. That's free money you can't pass up. Invest in the C or S fund or a combo of both especially during market corrections until you retire or get discharged. I highly recommend the Roth TSP. \n\nOpen up and max out a Roth IRA asap. There is a book you can borrow from your local library. The Little Book of Common Sense Investing by John Bogle. This book was written for beginner investors emphasizing investing in broad market ETFs like VTI or VOO for their simplicity. Just set it and forget it even during market corrections until you retire. Broad market ETFs for the win.\n\nIf you have extra money, gradually increase your TSP to the max of $22500 if you're comfortable with your monthly budget. If you receive CZTE in the future, invest that into your Roth tsp. Military personnel are allowed to exceed the TSP annual contribution limit and contribute up to $66,000 if receiving CZTE.",
            "score": 1,
            "author": "BastidChimp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank YOU for your service. I appreciate the feedback, TSP is something that I am in. Also thanks for the book recommendation! I’ll look into that",
                    "score": 2,
                    "author": "rivermonster1231"
                }
            ]
        }
    ]
}