{
    "id": "1475umd",
    "score": 6,
    "title": "28 year old looking for advice to reduce debt and form better financial habits",
    "author": "fatdaddyray",
    "date": 1686518698.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/1475umd",
    "media_urls": [],
    "other_urls": [],
    "postText": "So in January I started a job where I'm making significantly more money than I was before. \n\nI got laid off from a job in October where I was making $39,000 per year (the most I had ever made) and in December I landed a job making $60,000 per year with a great 401k, good insurance etc \n\nI grew up super poor, and as dumb as this sounds, I have just been spending like crazy lmao I bought an awesome TV, a PS5, booked a vacation for my girlfriend and I to NYC in December etc. \n\nThat being said, I really have no savings to speak of other than my 401k (that I never want to touch obviously). I have $4,000 in credit card debt. $28,000 in student loan debt that's about to kick back in. \n\nWe live pretty under our budget. She makes $60,000 as well, and we have a modest apartment in a good part of a mid-sized city (Tulsa, OK) that we pay $950 per month for. \n\nIn total, here is a breakdown of my monthly costs. I'm going to include my student loan payment which starts in August (I've already gotten on a repayment plan with my loan servicer. I graduated college in the pandemic so these will be the first payments I'm making) \n\n**Rent: $475**\n\n**Electric: $150**\n\n**Internet: $50**\n\n**Car payment: $152 ($2,100 left on this)**\n\n**Car insurance: $65**\n\n**Renters insurance: $20**\n\n**Various subscriptions: $80**\n\n**Groceries: $250**\n\n**Gas: $100 (I work from home, probably don't even spend this much in gas each month but idk)**\n\n**Credit card payments: up for discussion but I typically pay $200**\n\n**Student loan payment: this will be starting at $170 for the first 24 months**\n\n**Total bills, groceries, transportation: $1,712**\n\n**Total take home pay: $3,250 (I make $1625 take home twice per month)**\n\nAs you can see, it's fucking ludicrous that I haven't been putting a bunch of money in savings. I essentially have $1500 leftover each month even with my student loan kicking in, which is why I'd like some advice on forming better habits. \n\nHere are some things I've done recently: \n\nI've applied and been accepted for a credit card through Bank of America that has 0% APR for 21 months including 0% APR on balance transfers. They approved me for $3,000 balance. I requested to transfer my entire $4000 balance but I imagine they'll only approve the $3,000\n\nI haven't been spending on my credit card at all for 6+ months now. I pay like $200 a month on it and get charged $120 interest hence the balance transfer\n\nIf approved for the $3,000, should I apply for another 0% APR card and transfer my remaining balance, or should I just pay off the $1,000? \n\nCan I open an account somewhere that is literally just a savings account that I can have my job direct deposit $150-200 out of each of my checks to? Should I save more than that each month? \n\nI don't want to turn my financial life upside down overnight. I want to take some baby steps and build better habits. I still want to *enjoy* not being poor. For people who haven't grown up in poverty, this may be more difficult to understand. \n\nMy apologies if this post is all over the place. I'd love some input on my balance transfer plan, advice on saving money, and some other baby steps I can take to start being more of an adult with my money and less of a kid in a toy store every time I get paid. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "If I were you here is what I would do. \n\n1. Pay off the credit card. If you want to do a balance transfer that is fine. But realistically it shouldn’t take you more then 3-6 months to pay off based on your budget. I would not apply for two balance transfer cards given the fact you have an easy $1000 you could throw towards it every month. \n\n2. You need to figure out what your min student loan payment will be and what interest rates they are at. \n\n3. Yes open up a HYSA and split your paycheck so that money goes in each time you are paid. Some savings is better then nothing. I would start with like $100/check until the CC debt is gone. Once you have that paid off I would make it at least $300/check until you have $5-10k in an emergency fund. \n\n4. Student Loan extra payments. Pay the min until the credit card debt is gone. Paying extra for me would depend on interest rates. \n\n5. Once the CC debt is gone you should still have about the $1500 after all bills. (Assuming the student loan min will approximately replace the CC min.) From step 3 at least $600 needs to go to savings. Let’s be realistic and give you $400 to blow monthly so you don’t go into more debt. Then that remaining $500 needs to go somewhere productive. Extra student loan payments, savings, retirement.",
            "score": 3,
            "author": "lavacakeislife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok so my credit card is through Capital One and I was actually able to open a Capital One HYSA literally since you commented so that's awesome lol. \n\nIt's already linked to my bank account so I added $100 to start with. \n\nI appreciate the rest of your advice too and will work toward those goals.",
                    "score": 3,
                    "author": "fatdaddyray",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Congrats on starting! Good luck!",
                            "score": 2,
                            "author": "lavacakeislife"
                        },
                        {
                            "level": 2,
                            "comment": "Sometimes it's great to have everything in one place but I've found it's easier to save when I transfer money into a different savings account (different bank/credit union) that I don't use for anything else. I don't log in to check the balance when I pay bills, it's my digital mattress stash.",
                            "score": 1,
                            "author": "moderate_millenial"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Can I open an account somewhere that is literally just a savings account that I can have my job direct deposit $150-200 out of each of my checks too? Should I save more than that each month?  \n  \nDepends if your job offers split deposit. Otherwise, just open a savings somewhere (you can easily get 4% right now, I have with Capital One; other places offer more) and then just setup auto-transfers to pull out whatever you decide from your checking account where your direct deposit is transferred into. I prefer this anyway, as then if you ever want to change it wouldn’t have to wait for your employer to update.  \n  \nMake sure you are at least doing your employer match for your 401k, and that you chose good funds.",
            "score": 2,
            "author": "homeboi808",
            "replies": [
                {
                    "level": 1,
                    "comment": "You were right! Literally just opened an HYSA with capital one and got 4% instantly.\n\nAnd I am doing max employer match with my 401k \n\nI don't really know what good funds are/have knowledge of that. I'll have to do some research.",
                    "score": 1,
                    "author": "fatdaddyray",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Target Dates are usually offered, and those are for people who want a totally hands off approach of setting and forgetting. You just pick the one that closely matches your date of retirement (standard being social security age of 67 years old). Now, they are a bit conservative, so if I went that route, I’d personally go in every 5yrs and switch to the furthest out year offered).  \n  \nOr there is likely an S&amp;P 500 index fund in there, maybe small/mid/large cap funds, probably an international fund, etc.   \n  \nYou can make a separate post if you want, listing out (or uploading a photo) of all the funds offered.",
                            "score": 2,
                            "author": "homeboi808",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the heads up. I may do another post this week and see if somebody can help me along.",
                                    "score": 1,
                                    "author": "fatdaddyray"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always pay yourself first. Invest in your company's 401K especially if it has a matching contribution. That's free money you can't pass up. Invest in a fund that tracks the SP500. Just set it and forget it even during market corrections until you retire.\n\nOpen up and max out a Roth IRA. There is a book you can borrow from your local library. The Little Book of Common Sense Investing by John Bogle. This book was written for beginner investors emphasizing investing in broad market ETFs like VTI or VOO for their simplicity. Just set it and forget it. Broad market ETFs for the win.\n\nIf you have extra money gradually max out your 401K to the max of $22500 if you're comfortable with your monthly budget.\n\nBUT since you have student loans and cc debt, for now, try using either the Avalanche or the Snowball method to bring down your debt. There are YouTube videos that have extensive information on these two methods. Prep your own meals and refrain from going out to eat. Pause all investments including IRAs. Just invest enough of your salary to receive your company's matching contribution for your 401 K. Once you have ended your debt your options will open up immediately to save and invest more aggressively.\n\nUse only no annual fee credit cards that offer points or cash back. Use them only for essential items. ALWAYS pay off the balance every month and you should be good building up your credit history. Stay disciplined and live within your means.",
            "score": 1,
            "author": "BastidChimp"
        }
    ]
}