{
    "id": "14772xi",
    "score": 0,
    "title": "Is it a bad idea to go to EMT school even though I have no desire to be in the medical field after college?",
    "author": "elena20054",
    "date": 1686521602.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/14772xi",
    "media_urls": [],
    "other_urls": [],
    "postText": "At this point I just need a job I’m stuck at home for the summer before I start college in the fall. I have the money to pay for EMT school and would finish it before school starts and I have to move away. I have applied to countless “entry” positions in my hometown and have yet to receive a job. Not even McDonald’s or Taco Bell will hire me. The school costs 2600$ which is a lot but I really need a job. I’ve never wanted to be an EMT or in the medical field but I need to make money while I’m getting my degree.",
    "comments": [
        {
            "level": 0,
            "comment": "Paying $2600 for a job you don’t want, to maybe get a job, in a field you don’t want to be in, because you can’t even get hired at the most basic jobs that just need a warm body, doesn’t make any sense. \n\nI’d see if your guidance counselors from school can set you up with a mock interview to get feedback on whatever you’re doing wrong.",
            "score": 9,
            "author": "Werewolfdad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t have access to those right now because school is closed and far away. The interviews I’ve done aren’t very hard. They ask me when I’m available I say every day and I’m willing to work any shift. Then they ask me why they should hire me and I say I’m a hard worker with great communication skills. Then they never call me back. Should I change any of those?",
                    "score": 1,
                    "author": "elena20054",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It sounds like you’re saying all the right things but it’s really hard to tell what’s going wrong based on a Reddit post. Would really help if you could find someone to give you feedback based on a face to face interaction.",
                            "score": 2,
                            "author": "Fantastic-Bat-8134"
                        },
                        {
                            "level": 2,
                            "comment": "Should work. Find someone local to do a mock interview. \n\nDo you smell or do you overdress for the interview or something?\n\nOr do you tell them you’ll be leaving?",
                            "score": 1,
                            "author": "Werewolfdad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I tell them I’m looking for a long term position maybe they can sus out Im lying or something. I don’t think I’ve ever had a problem with smell i spray perfume i shower i apply deodorant the usual and I typically wear slacks and a sweater. I’ve done interview prep and resume coaching with the local community college a year ago but I could try again. How would I contact someone to do this?",
                                    "score": 1,
                                    "author": "elena20054",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Should be able to just email the community college \n\nGood luck!",
                                            "score": 2,
                                            "author": "Werewolfdad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you telling potential employers that you're going to be leaving in the fall? That might be the reason you're not getting any offers.",
            "score": 5,
            "author": "rachelshandbag"
        },
        {
            "level": 0,
            "comment": "Something is up if multiple fast-food places won’t even hire you.  \n  \nI’m a high school teacher, and some of my students you literally can’t even double a 2-digit number have fast-food job.",
            "score": 9,
            "author": "homeboi808",
            "replies": [
                {
                    "level": 1,
                    "comment": "I swear I’m a normal person I tell these companies I’m available every hour of the day and they still won’t hire me. I had a 3.92 in High school and am going to a relatively good college so I can definitely do no more then add two numbers. My mom is saying I should just start handing out my resume in person but i feel like that is a bad idea.",
                    "score": 0,
                    "author": "elena20054",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your mom is right. It shows motivation about yourself to your potential employer",
                            "score": 4,
                            "author": "mikalisterr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Normally I wouldn’t agree with this because online applications are so common. But everywhere where I am is hiring right now. This might speed it up",
                                    "score": 1,
                                    "author": "EmuRemarkable1099"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ok so would I show up at Wendy’s and ask for the manager then give it too then?",
                                    "score": 1,
                                    "author": "elena20054",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had a student this year tell me he would walk in (to a Wendy’s or DQ) and say they had an interview, when the boss/manager came out and said he didn’t, he would say that he must have gotten the wrong location but that this one works too and asked if he could still interview.",
                                            "score": 5,
                                            "author": "homeboi808",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok you know what I might try this",
                                                    "score": 2,
                                                    "author": "elena20054"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the cash register does it for them",
                    "score": 1,
                    "author": "84740296169"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They get paid so little for such a difficult job, it’s not worth it.",
            "score": 3,
            "author": "cdsfh"
        },
        {
            "level": 0,
            "comment": "So this is not necessarily finance advice and recognize it's not allowed but wanted to share. My ex is a firefighter/paramedic. We ended up splitting up about a year ago since despite our efforts to fix our relationship after he overcame the PTSD that he developed due to a certain call that made international news, we just couldn't fix the damage it caused. I say this to warn others considering the career: Being in any first responder role requires a calling. It isn't for everyone and requires a lot of sacrifice that the general public neither realizes or really appreciates. If you are just doing it for a paycheck, it's probably not worth the long term risks.",
            "score": 2,
            "author": "tantricyoni"
        },
        {
            "level": 0,
            "comment": "EMT school is hard. You have to complete coursework, labs, and a number of hours of ride alongs and fieldwork before taking the exam. The exam is difficult. Many do not pass the first time. This seems like a lot of work for something you really don't want to do.",
            "score": 2,
            "author": "formerprincess"
        },
        {
            "level": 0,
            "comment": "Do not be an EMT…. This is coming from a former Paramedic, you’re doing it for the wrong reasons and it is absolutely not a job you can phone in for a paycheque, which it appears you are looking for.",
            "score": 2,
            "author": "mikeyhol"
        },
        {
            "level": 0,
            "comment": "See r/EMS for more information on the field.",
            "score": 1,
            "author": "Lollc"
        }
    ]
}