{
    "id": "147bl6x",
    "score": 0,
    "title": "EV tax credit question",
    "author": "coonsquad6",
    "date": 1686533924.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/147bl6x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Based in California\n\nI'm personally looking to purchase an EV to take advantage of the 7500 tax credit. However my parents are able to net an extra 5K discount (off sticker price) through a program but their tax liability isn't high enough to take advantage of the full 7500 tax credit. The 5K discount program requires my parents to be the purchasers of the car. \n\nMy question specifically, is there a way for me to take advantage of the 7500 tax credit if my parents are the purchasers of the car? I feel like it'd be denied or committing tax fraud if I try to file for the tax credit.",
    "comments": [
        {
            "level": 0,
            "comment": "No, because the taxpayer who wishes to claim the tax credit must be on the seller's report (see Q9 and Q11 in [IRS article](https://www.irs.gov/newsroom/topic-a-frequently-asked-questions-about-the-eligibility-rules-for-the-new-clean-vehicle-credit)).",
            "score": 6,
            "author": "DeluxeXL",
            "replies": [
                {
                    "level": 1,
                    "comment": "That makes sense. Got it, thanks for the quick response.",
                    "score": 1,
                    "author": "coonsquad6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tax credit is directly associated with the buy of the car. I saw something about the model 3 being effectively now cheaper than a Camry, pretty nuts!",
            "score": 3,
            "author": "ues1bredev",
            "replies": [
                {
                    "level": 1,
                    "comment": "Camry hasn’t been cheap for a long while friend.",
                    "score": 2,
                    "author": "ReduceMyRows"
                },
                {
                    "level": 1,
                    "comment": "A Model 3 is way more fun to drive than a Camry! I’ve owned both. \n\nBut to be fair, you can definitely upgrade a Model 3 to be $50K+. Depends on options.",
                    "score": 2,
                    "author": "DoomBuggE"
                }
            ]
        }
    ]
}