{
    "id": "5ou70b",
    "score": 27037,
    "title": "Heads up: The federal government just filed suit against Navient, claiming they scammed millions of borrowers between 2010-2015 to the tune of $4 billion. This is huge.",
    "author": "Safarione11",
    "date": 1484795776.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/5ou70b",
    "media_urls": [],
    "other_urls": [
        "https://www.consumeraffairs.com/news/feds-sue-student-loan-servicer-navient-011817.html):",
        "http://www.latimes.com/business/la-fi-navient-lawsuit-20170118-story.html):",
        "http://files.consumerfinance.gov/f/documents/201701_cfpb_Navient-Pioneer-Credit-Recovery-complaint.pdf).",
        "http://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-nations-largest-student-loan-company-navient-failing-borrowers-every-stage-repayment/)."
    ],
    "postText": "The suit was filed January 18th 2017, by the Consumer Finance Protection Bureau (CFPB) against Navient. \n\nFirst, know that the CFPB has requested that the Court order Navient to comply with the following actions, among others: \n\n1. Restitution to consumers harmed by Navient's conduct; \n\n2. Disgorgement of all ill-gotten revenue\n\n\nHere are the details of the allegations: \n\nFrom [consumer affairs .com](https://www.consumeraffairs.com/news/feds-sue-student-loan-servicer-navient-011817.html): \n&gt;Specifically, the suit charges that Navient:\n&gt;&gt; Fails to correctly apply or allocate borrower payments to their accounts;\n\n&gt;&gt; Steers struggling borrowers toward paying more than they have to on loans;\n\n&gt;&gt; Obscured information consumers needed to maintain their lower payments;\n\n&gt;&gt; Deceived private student loan borrowers about requirements to release their co-signer from the loan; and\n\n&gt;&gt; Harmed the credit of disabled borrowers, including severely injured veterans.\n\nFrom the [LA Times](http://www.latimes.com/business/la-fi-navient-lawsuit-20170118-story.html): \n&gt;In its lawsuit, the consumer agency alleged many other borrowers had problems enrolling in programs to reduce payments and Navient instead steered struggling borrowers into plans that made more money for Navient but saddled borrowers with higher costs.\n\n&gt;Specifically, the government alleged that Navient maintained compensation policies that encouraged customer service representatives to push borrowers into forbearance, which allows borrowers to suspend payments without defaulting but does not stop interest from accruing.\n\n&gt;However, most federal student-loan borrowers earned the right in 2009 to enroll in the less costly payment options that are based on their income.\n\n&gt;Although those plans save borrowers money, forbearance was more lucrative for Navient, the agency alleged because the company could enroll borrowers in forbearance in less time and with less staff.\n\n&gt;In all, the servicer slapped borrowers with additional interest charges of up to $4 billion by enrolling them in repeated forbearance plans from January 2010 to March 2015, according to the consumer agency. \n\nIf you want to learn more about this, I highly encourage you to read the original complaint filed with the court by the CFPB. It is VERY readable (not filled with legalese) and reads as an absolutely scathing indictment of a company whose business practices targeted its most vulnerable customers in flagrant violation of the law. \n\nYou can find the original complaint on the [consumer finance .gov website](http://files.consumerfinance.gov/f/documents/201701_cfpb_Navient-Pioneer-Credit-Recovery-complaint.pdf). They also [summarized the complaint on their website](http://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-nations-largest-student-loan-company-navient-failing-borrowers-every-stage-repayment/). \n\nIn the spirit of this sub, I'm sharing this information because there are plenty of people here who may have been a victim of these alleged practices. Including myself, as I've been paying down my Navient loans since 2012 and have several years to go. \n\nI'm going to read through the complaint again, and if anything important jumps out at me that I haven't mentioned, I'll update this post. \n\n**Edit:**\nAdditional allegations: \n\n(since July 2011) Disregard of borrower instructions when processing payments submitted by check with written instructions from the borrower specifying how the payment should be applied.\n\n(Jan 2010-March 2015) Using uncharacteristically vague email titles like “New Document Ready to View” to notify borrowers that they needed to renew their income-based repayment enrollment. During this time, the number of borrowers who did not timely renew their enrollment regularly exceeded 60% of borrowers and resulting, often, in capitalization of interest. \n\n**Edit:** There is no way to know how potentially impacted borrowers will be affected by the lawsuit. We will have to wait and see. Lawsuits of this magnitude often take a LONG time to get resolved. \n\n(edit: formatting, fixed a link)\n",
    "comments": [
        {
            "level": 0,
            "comment": "Hi folks,\n\nAs the OP points out, this could potentially impact many members of this sub, so feel free to discuss the financial impact this may or may not have for those with Navient loans.  Please be aware that our subreddit rules forbid both political and legal discussions, so please limit your commentary to finance.  Thanks much in advance!",
            "score": 1,
            "author": "isobee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They have been pulling shit like this for years, and I am glad it finally caught up to them.\n\nSeveral years ago my wife had 40k in student loans with Navient. One loan and was 16k and the other 24. I got a seperation check from the navy and sent a 16k payment over the phone instructing them to pay off the one loan, which they assured me they could do. I was very specific that if it did not pay off the loan I did not want to make that large of a payment.\n\nAfter they had taken the money they decided to distribute the payment across both loans. I called them and they claimed that they did not need to put the money where I specified as they way they disbursed it saved me money.\n\nAfter 2 weeks of calling my bank and Navient multiple times a day I called Navient and told them if they didn't apply the payment on the way I specified I would file a complaint with the CFPB. \n\nAll the sudden they were more than willing to fix my issue and apply my payment to the loan the way I had asked.\n\nTLDR: Fuck Navient and their bullshit.",
            "score": 6301,
            "author": "MultipedMoss1",
            "replies": [
                {
                    "level": 1,
                    "comment": "They pull this shit on me and I get sick of going in circles on the phone. I pay extra EVERY month and want to pay off the loan with the smaller balance first and they like to apply it in the STRANGEST of ways.\n\nEDIT: To be clear I am making my payments on the navient website, and calling at a later date to ask why they're being applied in such a fucked up manor. ",
                    "score": 1418,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I pay extra EVERY month and want to pay off the loan with the smaller balance first **and they like to apply it in the STRANGEST of ways.**\n\n\n\nThis reminds me of of a story.  I know that in 2007 Bank of America was pulling this shit with my checking account, organizing certain payments and deposits to hit at certain times, and holding others off until midnight. It was done to maximize the number of times you overdraft your account, and thus pay overdraft fees.\n\nThey pulled this stunt on my at the beginning of a month, withholding my electronic deposit paycheck from work when I went to pay bills. Suddenly hit with overdraft fees, ***and then*** they applied my check to the account. At the end, when my entire check had been applied to the negative balance, I was looking at approximately -$100 in my checking account.\n\nI told them to fuck off, pulled my money from savings, and left them with the negative balance on the fucking checking account. They sent a single letter threatening to take it to collections, which they ultimately did not do. They ended up losing about $100 in their attempt to profit from me.\n\n ",
                            "score": 1068,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just listened to a podcast about this. Overdraft fees are one of the banks main sources of income so their computer programs specifically do what you just described to maximize the fees. Good on you for giving them a 🖕🏼\n\nEdit: here's a link to the podcast from 1/10/17 \nhttp://www.npr.org/2017/01/10/509126878/what-is-driving-the-unbanking-of-america\n",
                                    "score": 722,
                                    "author": "Mirmadook",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; so their computer programs specifically do what you just described to maximize the fees.\n\nhow is that not illegal?",
                                            "score": 337,
                                            "author": "Sempere",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It is now. It didn't use to be.",
                                                    "score": 615,
                                                    "author": "dylan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 132,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The laws passed after the recession, to be precise: the CARD Act and a series of consumer lawsuits. ",
                                                                    "score": 187,
                                                                    "author": "jcitme",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 11,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, probably was. It was when I was in college so something like 2010/2011 maybe? My first job was a bank teller but my bank specifically did not do this.",
                                                                    "score": 94,
                                                                    "author": "dylan",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 39,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Actually, it is still not illegal. Seriously, look it up. A few banks lost huge settlements because of it a few years back, so I think they've just gotten a little more savvy about it. \n\nIt literally just happened to me last week and it took about 8 hours total across multiple days, on the phone with my bank, before I could even TALK to someone who was capable of reversing the fees. Opening an account at a credit union this week and once I get my direct deposit transferred over, I'm closing the account. Zero reason for me to be at a corporate bank anymore, I'm just so tired of the bullshit.",
                                                            "score": 10,
                                                            "author": "hated_in_the_nation",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Was it the SYSK \"Can you live without a bank account?\"",
                                            "score": 31,
                                            "author": "__boneshaker",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What podcast was it? I'm interested to learn!",
                                            "score": 11,
                                            "author": "Smartace3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Darn it! I knew I was going to need it. All I remember is that it was an NPR affiliate. \n\nEdit: here it is http://www.npr.org/2017/01/10/509126878/what-is-driving-the-unbanking-of-america",
                                                    "score": 48,
                                                    "author": "Mirmadook",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Probably Stuff You Should Know's \"Can you live without a bank account?\" recent episode. \n\nIt's not a finance podcast, just general knowledge. It's very interesting though! ",
                                                    "score": 29,
                                                    "author": "matthewjpb",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They didn't really lose $100 - they just didn't make $100 in overdraft fees. And if it was enough to send you that far in the negative they probably still made some money on the amount they hit you for before you went negative.",
                                    "score": 320,
                                    "author": "kingbirdy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Chase did that to me as well; $900 in overdraft fees for a less than $20 overdraft, because they withdrew all payments at midnight ordered from most expensive to least -- I had several fifty cent withdrawals for my postage meter, so they nailed me with thirty $30 overdrafts. I was livid and they refused to do anything about it. At that point, I closed all accounts with them and refuse to ever do any business with Chase.",
                                            "score": 335,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's fucking thievery. And imagine, a group of people sat down and said that was a great idea, and then hired someone to program that into their banking system. Unreal",
                                                    "score": 285,
                                                    "author": "shrimpchipsaregood",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm sure that's *exactly* what happened. I've worked with some of those directors and VPs and they're all just trying to \"maximize shareholder value\" so they can claim their bonuses.\n\nNow, ten years later, I work for a big software company and have an expense account, and Chase is one of my customers. Every time I go and see them, I make sure to find every way to charge them as much as I possibly can, and I use my expense account to tip everyone I can find when I go out, and assign the expense to their account. Valets, cab drivers, wait staff, bartenders, masseuses, maids and room service -- I'm very generous because, honestly, fuck Chase.",
                                                            "score": 518,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There's a small part of me that wants to tell you that doing this is borderline unethical, petty, and won't make a difference. \n\nBut the way bigger part of me just wants to give you a huge fucking high five. ",
                                                                    "score": 267,
                                                                    "author": "gotfoundout",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's part of the cost of Chase doing business.  If they do not like the amount they have to pay, they don't have to do business with jnkml16.  Last I checked there was no law banning discrimination against certain companies by charging them more.  That's pretty standard.  ",
                                                                            "score": 74,
                                                                            "author": "wzil",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "my friend's dad runs a business. if someone he doesnt like wants to hire his business, instead of telling them to fuck off, he charges them 2-3x what he normally does. he still ends up getting the job because hes cheaper and faster than his competitors, and very reasonable withh accommodations.\n\n ",
                                                                                    "score": 50,
                                                                                    "author": "darkflash26",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Let me address those three concerns so we can just high five.\n\nWhile it may not actually make a difference to Chase (thousands of dollars to them is not noticeable), I think it makes a small difference to the people I run into. If you're in Columbus, Ohio, for example, and you're making a living in the service industry, I think a night where someone leaves you a $100 tip on a $20 bill is generally a good night and might help you not get hit with an overdraft fee for Chase to collect. If that happens to 10 people in 2 or 3 days, once every 2 to 4 weeks, that's over a hundred people a year who might not have the same story I did.\n\nAs far a petty, yes. It is. But I get to be petty -- I asked my boss when I started with this company, and he said as long as I follow our written policy, I can do what I want when it comes to where I eat, how I tip, what services I use when travelling. Banks are petty when they take overdraft fees for holding onto our money. There's banks who don't, and their profits are great.\n\nAs far as unethical goes, I'm not breaking any rules. I might not be taking into account shareholder value for the company I work for, but I'm given leeway because I make money for the company. If they wanted to crack down on my expenses, they have the right to. I'm not hiding anything. My boss approves my expenses and everyone is happy, so, while I might be able to save a few thousand extra dollars every year by tipping less, I am still following our policy. That being said, I could drink more alcohol like a lot of my colleagues (a lot of Engineers and Architects I work with are alcoholics) and maybe my $20 bill would be $100, and I would leave a $20 tip instead -- but I don't like getting drunk.\n\nI hope that kinda settles those concerns. I did think about it when I first started, but I've seen people do really shady shit, and this isn't that.",
                                                                            "score": 63,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Imagine how many people there are who do not even benefit from this that are aware that this happens and just let it continue anyway.",
                                                            "score": 32,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exact thing happened with us with Chase but even worse.\n\n We were struggling really bad for a few months and knew we were going to have to overdraft a bit one month. We did all the little things first and then put the rent check through. We checked that everything had cleared that day...like physically showing it had come out of the account on their website (groceries, various errands that day for kids etc) then put the rent through as an electronic check. The next morning it was negative like $500 instead of the $150 we were expecting. Somehow the online account showed the rent through FIRST then the rest of the things that the day before had already showed out. Not pending, fully out. We called the bank and all they would say was we should have payed better attention and/or they allow us to overdraft as a courtesy and it was our fault so they wouldn't do anything. Finally one person waived like 1 overdraft fee but not the remaining like half dozen or so. \n\nWish we had taken a screenshot the day before but we didn't know they would or even could do that. We promptly told them to fk off and changed our direct deposit and refused to pay them. Fk them and their shady ass shit",
                                                    "score": 131,
                                                    "author": "Maevora06",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 98,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 42,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 18,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 29,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I used to work at Chase, and that is so typical of them. Items were presented in descenmWhen asked, we were supposed to say that it was done as a \"courtesy\" so that your house or car payment went through because \"its a really important bill.\" \nBanks pulling this stunt got slammed with a huge number of fines for this a few years ago and most don't do is anymore as many got nailed with class action suits. It'll be interesting to see how this plays out.",
                                                            "score": 35,
                                                            "author": "purplehairedpagan",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "In the UK the laws are very strict and doing anything through banks is actually really straight forward and there's no bullshit charges for everything.  They do charge you for unpaid direct debits, but it's £6 per missed payment where it used to be £35 per iirc.  You can transfer money to other people using your phone number, if you have a regular salary coming in for more than 4 months then they will honour DDs that come out a day before you get  paid to not screw you with fees.  They also message you, email you, etc to let you know that a payment is going to make you overdrawn, and give you 24hrs to make a payment into the account to avoid fees being applied.\n\nIt used to be similar to the US with fees and stuff but the govt wasn't having it.  Honestly the service I get these days is amazing, and it's making my day to day life so much easier knowing that I don't have to wrestle with the banks bullshit, and actually that I can do all kinds of things without paying a shit load in fees for the privilege.",
                                                    "score": 26,
                                                    "author": "Mildcorma",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah I figured if they had a negative balance on the books and they didn't pursue collection, they just ate that cost.  $100 to them is nothing, of course, but it's still a negative.  Of course I still lost my entire paycheck, which sucks, but I didn't give in to their system which was ultimately the whole point. ",
                                            "score": 14,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;This reminds me of of a story.  I know that in 2007 Bank of America was pulling this shit with my checking account, organizing certain payments and deposits to hit at certain times, and holding others off until midnight. It was done to maximize the number of times you overdraft your account, and thus pay overdraft fees.\n\n&gt;They pulled this stunt on my at the beginning of a month, withholding my electronic deposit paycheck from work when I went to pay bills. Suddenly hit with overdraft fees, ***and then*** they applied my check to the account. At the end, when my entire check had been applied to the negative balance, I was looking at approximately -$100 in my checking account.\n\nTD Bank currently does this. Deposited a check? Gotta wait 3 days. Waited the 3 days then paid a bill? Let's pay the bill out first because the check didn't \"fully clear\" ans overdraft you. Oh, you went under $100 or overdrafted? Let's charge you a $15 service fee.",
                                    "score": 86,
                                    "author": "jsanc623",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The \"service fees\" are a fucking joke. It's an automated process there is no service involved unless they're counting screwing you over as the service. ",
                                            "score": 68,
                                            "author": "kgal1298",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "BoA is such an evil bank, bent on screwing anyone they can. I used ti bank with them back in 2004-2008, and in 2007 and 2008 i started to notice transactions on my statement called \"other transaction\". The amounts would vary from around 20 to sometimes over 100. Call the bank and they tell me that they use customer money to pay their bonds or whatever. I dont know banking, so i dont know the terms they used. Then they tell me that the money would be refunded back to my account at the end of the month. I immediately went to the bank and closed all my accounts. I now bank with Navy Federal Credit Union and couldnt be happier. Best decision I ever made when it comes to banks.",
                                            "score": 33,
                                            "author": "Pope_Industries",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Whitney National Bank did that to me for a while. hundreds and hundreds of dollars in overdraft fees. I upped and left.... About 7 years later I get a check from them from that massive class action lawsuit because apparently they did that to EVERYONE and they got sued for it. The settlement didn't make up for the whole amount but at least it did in part and was one of the reasons for the legislation that helped limit that behavior... (the legislation which is now under attack... )",
                                            "score": 10,
                                            "author": "cajunrajing"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 55,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hope you are banking with a credit union now.",
                                            "score": 19,
                                            "author": "chavs_arent_real",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wells Fargo did that to me as well.  I physically stopped into a branch to check that I had some money in my account and nothing was pending (hadn't spent anything in 3 or 4 days).  All good.\n\n  Pulled out a couple of bucks and made a few debit purchases later that day.  Suddenly I had a -$350 account balance because they decided to screw me over like that.  I will never again do business with Wells Fargo.",
                                            "score": 18,
                                            "author": "cobigguy",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Unsurprisingly BoA (and lots of other banks) were sued in a class action lawsuit because of excessive overdraft fees due to the reordering of transactions. BoA settled for $410 million:  http://www.huffingtonpost.com/2012/06/26/pnc-overdraft-lawsuit-settlement_n_1628130.html\n\nI was a customer at one of the banks affected and I remember seeing a good chunk of OD fees being refunded in my account after this case was settled. ",
                                    "score": 58,
                                    "author": "rangoon03",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They were doing this to my account for years. Not to mention I found out that they can late fee a late fee (but that was a diff story). \n\nWould have $50 in the account, deposit $1200 which then they said would take two days. I know when that thing deposits (3am --  on the 2nd day, every pay period), but when I had some debts coming out, they would delay it one more day and depending on time of month. You would have the large bill take up all of the money, and 2-5 small eat-out charges for $10 or so here and there would always come in.\n\n$100+ worth of overdraft in many cases. Glad I have padding now but when I was poor (making $1800/mo in San Jose, CA), they knew how to really screw you over.",
                                    "score": 15,
                                    "author": "xevian",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I'd recommend using a credit union. By being a customer, you're part owner. But I'll admit I don't know a whole lot about how banking works so I could be totally wrong. ",
                                    "score": 49,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's what I did. Switched to a credit union. The most annoying part is when they call a bunch to make sure the payments I'm making are really me. It's good fraud protection, but you don't have to call every day! You know I do weird shit with my money!",
                                            "score": 6,
                                            "author": "mewingkierara"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My wife still has $71,000 in student loans with them.  I swear the amount doesn't go down as much as it should every month.  The reason why?  The ducking interest seems to change every month.  One month it'll be $450 in interest, and the next month it'll be $520 in interest.  Their response was the billing cycle for the months changes because of the lengths of the months.  But when I calculate it, even in a 31 day month, with an interest rate of 7%, an extra day should only be another $13.61 of interest for the month.  Not $70.  ",
                            "score": 44,
                            "author": "sleepymoose88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't say if this is the way they do it,  but many accounting departments use what is called a 4-4-5 calendar. I would do a terrible job explaining it, so here is a source. This shit is a real headache for me writing SSRS reports. \n\nhttps://en.m.wikipedia.org/wiki/4–4–5_calendar",
                                    "score": 22,
                                    "author": "jspost",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why could you not pay online? I make payments directly to the loan I want to pay off.",
                            "score": 16,
                            "author": "pangolin44",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do pay online, but they don't apply the payments the way I want them to and just kind of oddly lump them together. ",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Shoulda filed anyway. ",
                    "score": 116,
                    "author": "notarealaccount_yo"
                },
                {
                    "level": 1,
                    "comment": "They were the worst. Tried more than doubling my monthly amount out of nowhere (not interest only, so was confused)\n\nFought then on the phone nonstop and consolidated to Wells Fargo. Wells Fargo had to conference in on a call with me to get loans switched over after several attempts and lies at improper paper work and information not being provided, etc. \n\nThey were all willing to help once I got a bank to talk it through. \n\nFuck Navient and fuck Sallie Mae",
                    "score": 142,
                    "author": "SenorCheen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey I had this happen to me. Did you fight it? It took me a while to figure out it even happened. \n\nI was paying way extra, and then one day I realized they bumped up the minimum payment to about what I was over paying... Why? ",
                            "score": 34,
                            "author": "Engineer_This",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They have told me that if you pay more than they require you to, then they increase your obligation to that amount.  If you get a windfall of some kind or manage to save some money, and you want to pay more toward your student loan debt, you can't because Navient will expect that kind of payment from then on.  Tax returns, settlements, savings, etc all can not be used to pay down student loans when they're serviced by Navient unless you have tens of hours within a week to devote to the process of fixing their aggressive move.  That involves filling out income based repayment plan paperwork to fight for them to change back the amount due.\n\nThat's only the tip of the iceberg.  My experience with student loan servicers in general has been that the system is designed to discourage you from paying off your debt, and to financially destroy you if you try to.  \n\nI got sick, couldn't make payments, defaulted, went through student loan rehabilitation, and Sallie Mae intentionally left loans out of consolidation until I was forced to consolidate multiple times.  Once I managed to finally get everything consolidated, they handed off the loans to Navient.  \n\nWith the interest rate I have now, I will never pay off my debt unless I win the lottery or get a scholarship for a higher degree, complete it, and find much higher-paying employment.  As in, approaching six figures.  Considering that requires networking in a way I can't possibly do while working to support a family, much less working and studying too, I don't think it will happen.  But I've applied for scholarships to try anyway.\n\nNow, consider the impact this kind of debt has on credit.  Buying a home is just not going to happen for my family, full stop.  \n\nAnd that too is ridiculous because the rent in my area is generally three to four times higher than a mortgage note, plus taxes, plus insurance.  It would be possible to pay off the student loan debt if we could buy a house instead of pay some rent-seeker's mortgage, tax, insurance, and maintenance costs plus profit.  But, no, the system isn't designed to get debts paid off.  It's designed to ensure you're in debt and financially stagnant for life.\n\nI think we're witnessing the total commercialization of housing.  The cost of a modest single family house in a decent neighborhood jumped 300% in my area *this year alone*.  It's as though there's a push for a few companies to own everything, forcing everyone else to rent.  It's quickly becoming hopeless that most of our generation will treadmill for the rest of our lives.\n\nThese two things together are destroying my quality of life.  I have a decent job that I like, but every time I think of these things at work, it destroys all morale.  I feel like a slave, constantly working my ass off just to keep ratty quarters and food while getting nowhere.  You only get one life, and between student loans and housing, these companies are taking mine.",
                                    "score": 71,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I see a few people asking about how payments are distribute online and I had a problem with it once. I put down a few hundred dollars online towards my higher interest loan(which was a big deal for me because I was still in school and broke) and they distributed it in a really weird and different way towards the other 5 loans I had out at the time. I spent forever on the phone and finally talked with someone who had to put me on hold(for a verry long time)to talk to their manager to approve the redistribution to the way I originally wanted it online. Then it was never fixed. It wasn't worth my time to go through that B.S again so I just made another payment when I saved up the money. ",
                    "score": 38,
                    "author": "Selective1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It seems like Navient thinks they didn't do anything wrong:\n\n\"Navient will not accept an agenda-driven ultimatum based on false assertions &amp; practices that will harm consumers .@Navient will vigorously defend itself against unsubstantiated &amp; politically motivated claims. Read facts here: files.shareholder.com/downloads/AMDA…\"\n\nhttps://twitter.com/navient/status/821867040747225088",
                    "score": 94,
                    "author": "Edg-R",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What knob at Navient thinks they need a Twitter?",
                            "score": 144,
                            "author": "Pdan4",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "\"politically motivated\"...wtf? Why would they mention this? They think only one side of the political spectrum is affected by this?",
                            "score": 113,
                            "author": "rangoon03",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everybody that wants to end corrupt practices of previous bipartisan political establishment, is politically motivated.\n\nI mean they're not wrong that wanting integrity, honesty and transparancy can be political objectives, particularly when those interfere with business as usual.\n\nSo if you look at it from their perspective, they're not wrong. Just terribly corrupt.",
                                    "score": 51,
                                    "author": "Kinbaku_enthusiast",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Out of curiosity, what financial difference does it make to pay one loan off completely, if the 2 loans have the same interest rate?",
                    "score": 30,
                    "author": "SoylentRox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cash flow, depending on the loan. Sometimes prepayment does not advance the due dates, so the up front payment may place the borrower's under water in subsequent months.",
                            "score": 50,
                            "author": "orlinsky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even if it doesn't save any money, from a psychological perspective it is just nice to have one loan paid off and done with. One down, one to go. ",
                                    "score": 68,
                                    "author": "Pelkhurst",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There was a thread about this recently, it is always beneficial in the long run to pay off the loan with the highest interest first regardless of the amount remaining. ",
                                    "score": 22,
                                    "author": "lAsticl",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Mathematically yes. This would save you the most money. However Dave Ramsey has convinced people to do it the other way because it is more psychologically gratifying.",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which, almost paradoxically, ends up feeding back into the \"equation\" and changes the math. The psychological gratification people get from paying off loans in full keeps them on track and the people who follow Dave's snowball approach tend to pay off their total debt faster, paying less interest overall, than those who don't.\n\nhttp://www.kellogg.northwestern.edu/news_articles/2012/snowball-approach.aspx\n\nhttp://business.time.com/2012/08/16/the-verdict-is-in-tackle-smaller-debts-first/\n\nhttp://www.forbes.com/sites/nickclements/2015/08/25/dave-ramsey-was-right-psychology-matters-more-than-math-in-paying-off-credit-card-debt/",
                                            "score": 24,
                                            "author": "threeLetterMeyhem",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Monthly payment goes down",
                            "score": 30,
                            "author": "Andy06r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had a think about it and this is the only one that makes sense and isn't a purely psychological benefit. Because the loan minimum payments tend to stay the same for the lifetime of the loan, having only one reduces the mandatory payment and increases flexibility.",
                                    "score": 18,
                                    "author": "asswhorl"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At the very least, it's a psychological advantage.  Possibly bookkeeping or credit rating.",
                            "score": 11,
                            "author": "82Caff"
                        },
                        {
                            "level": 2,
                            "comment": "You can then snowball the two payments from the double loans into the second one or use that freed up money for something else.",
                            "score": 17,
                            "author": "NightGod",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Total cessation of interest on one loan",
                            "score": 57,
                            "author": "KebabRemovalSpecial"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It took me no less than ten calls to them to get them to apply more to my monthly auto-deductions.  I was told on every call they would deduct more on the next payment, and then they failed to do so.  There's literally no way to change it on their website, and I eventually had to write a letter threatening legal action before it got changed.\n\nFuck them.",
                    "score": 33,
                    "author": "Haroshia",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Wow that's scum. Has the online portal been affected? I usually pay online. I would be pissed to put a big payment in and have it distributed in a mathematically unhelpful way against my wishes.\n\nI pay online because using their phone system is a great pain, now I feel even more justified given what you've described. I have to call the loan creating department to get a human, then I have them kick me to the right place to do literally any other task. Because going anywhere else, the phone crashes out, or goes into a loop: \"Welcome to Sallie Mai/Navient\". Broken crap, all of it.",
                    "score": 58,
                    "author": "PolyhedralZydeco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I used the online option (last time in 2014) it never distributed the extra payment the way I entered it. Get out a calculator - there might be an error.\n\nMy compulsive screenshot habit began with gathering personal evidence against Navient.",
                            "score": 32,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have student loans through navient. Can you ELI5 how I can check if they have done any of this to me?",
                    "score": 42,
                    "author": "fr1ction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless you filled for forbearance, you can ignore that part. The suit also calls into question the ethics of Navient's distribution of payments to maximize the interest you pay. Most likely you were affected by these practices. How you will benefit from the suit is yet to be determined. They mention a disengorgement of all funds earned in this manner, but there are no specific terms implied, which ultimately leaves the consumer benefits in the air.",
                            "score": 9,
                            "author": "iamthis4chan",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;(since July 2011) Disregard of borrower instructions when processing payments submitted by check with written instructions from the borrower specifying how the payment should be applied.\n\nI think I had this happen to me. I had some extra money laying around so wanted to pay down one of my higher interest loans, but they just applied it divided up among everything. I figured I did something wrong, but now I'm not so sure.",
            "score": 597,
            "author": "Sheol",
            "replies": [
                {
                    "level": 1,
                    "comment": "I regularly specify that the extra I'm paying each month go to my higher interest loans. I always pay online and (stupidly) just assumed that they were doing it as I instructed. Now I have to go and make sure they did it correctly every month since they bought my Sallie Mae account. Yay. But at least with this maybe I'll get some restitution in a few years if they did screw it up.  ",
                    "score": 168,
                    "author": "TooHappyFappy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've never seen an option online to pay to one specific loan.  Which is a predatory practice.  Sallie Mae did the same damn thing when my wife's loan was with them.  ",
                            "score": 68,
                            "author": "sleepymoose88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With Navient I believe I have to specify that I'll pay the minimum due on each loan but then I'm free to increase the amount I'd like to pay on each individually. ",
                                    "score": 40,
                                    "author": "TooHappyFappy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They actually did have an option to pay a specific amount to specific loans through the phone app last year. I was able to make payments for a few months that way. Then, they got rid of it and they told me the only way to specify how to allocate my payment is to send in a check. They provided no form or template, they just said to include written instructions on how to allocate. I tried it twice, and the disregarded it both times and allocated the payment however they felt like it.",
                                    "score": 16,
                                    "author": "whyisthissticky"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TIL. I didn't actually know it was legally mandated, even though I've seen banks say it.\nI had my mortgage provider saying that this was a good thing that they do too - nice to know that it isn't and they have to.",
                            "score": 13,
                            "author": "vilemeister"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what would happen for someone who has been paying since 2013 with no missed payments or issues with paying late?",
            "score": 613,
            "author": "shaggz235",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you haven't been harmed, then you won't see any direct benefits.  In general, the suit might result in changes in how Navient/Sallie Mae and other servicers communicate with borrowers about some of the topics at issue like setting up/maintaining income-driven payment plans, how to release a co-signer, etc.  If you need that information at some point, presumably all borrowers will benefit from those processes being more clear and easier to access.",
                    "score": 308,
                    "author": "ForTheWinters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it possible that you could have been affected without knowing? I think Navient was one of my servicers, but I paid off my loans last year.",
                            "score": 142,
                            "author": "mfball",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 99,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same. I called in and asked about lowering my payments while I was still looking for a job and they told me my only option was forbearance. I'm going to be keeping a close eye on this. ",
                                                    "score": 18,
                                                    "author": "NotEmmaStone",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Except for that \"capitalized interest\" issue. I'm not on IBR, and I've never had a late payment, and they've been capitalizing my interest. Why? Is this normal? Doesn't this cost me more money over time?",
                                            "score": 35,
                                            "author": "lizzyshoe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not sure if I understand your question, but interest is accrued during repayment (at whatever rate the loan stipulates). When you say \"they've been capitalizing my interest\", what do you mean exactly? Your payments should go towards your interest and then your principal, so there shouldn't be any interest month to month, unless you're paying strictly interest.\n\nCapitalizing means they add the interest onto the principal, which means a bigger amount for interest to be calculated from. If you're repaying normally and are never late, I can't see why there would be instances of capitalized interest. Could you maybe elaborate on what they've been doing?\n\n\nThe issue here is that they pushed people into forbearance, which may have seemed nice since they didn't need to pay, but that just made it so Navient was able to accrue interest on a bigger sum. So basically Navient said, \"yeah no problem, don't pay us, we'll just build up a bunch of interest\". When what would really benefit the customer and was within their rights was to enter into lower monthly payments.",
                                                    "score": 21,
                                                    "author": "koticgood",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Interest capitalizing is normal during repayment and is outlined with your promissory note, it is generally done once a year, if you are making payments and there is still interest capping on your account than your payments are not covering your full interest gain on the account, I would check and see what your daily interest accrual is and compare that to your monthly payment. You may need to increase your payment if you don't want that interest capping.",
                                                    "score": 12,
                                                    "author": "Anibo"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think that it may be a good idea for you to read through the allegations one by one and ask yourself or even check your records to see if you experienced any of those things. That would give you an idea of what to look out for as the lawsuit goes forward. More than likely however, if nothing jumped out at you as shady or unfair either as you were paying off your loans or as you read this article, you probably didn't suffer from any bad practices. Still check though became you never want to leave money on the table.",
                                    "score": 27,
                                    "author": "digitdaemon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm still in graduate school and Navient did not help me out at all when my private loans went into repayment mode. I did get it deferred the first 4 years (which they allow), but I had two more years of school left and tried to get some help from them for repayment (income based plan, etc.) and they did not budge at all. They rejected all my requests for further deferment or lower payments, so I had to take out other loans to make the minimum payments on my loan from them. :(\n\nMy partner has loans from them, as well, and his grad program is 8 years. They somehow managed to defer his loans for another 4 years (resulting in total of 8 years of deferment), but provided me with no assistance. I'm pretty certain they're trying to sell my loan because they've also sent me some offers for consolidating and re-signing loans for being a timely paying customer. I think the company they've sent me resigning offer from is CollegeAve.\n\nShould I be looking into this some more??",
                            "score": 20,
                            "author": "rjoker103",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I added an edit to the post with a couple of other scenarios that would be covered. \n\nFor example, if you've ever had your written instructions disregarded (such as an additional payment should have been applied to your highest interest loan but was instead allocated across all loans pro-rata), or if you missed the deadline to renew your interest-based repayment and your interest capitalized. ",
                    "score": 34,
                    "author": "Safarione11",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm in the same boat basically, been paying for a year with no issues.  Interested in how this could possibly help me.",
                    "score": 40,
                    "author": "DrunkBronco",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Companies should tremble in fear in front of the CFPB.  They don't fuck around.  I worked it 2 industries where they brought the wrath.  One company I only worked at for a year and half (Greentree mortgage servicing) got sued for $63 million.  It caused them to close over 10 offices.  They deserved every bit of it.  They also fired around 5 collection agencies collecting for the U.S. Dept of Ed.  Some had been on the contract for a couple of decades.  They investigated some of them for 2 years.  The company I worked for they only investigated for 2 weeks (they take compliance more seriously than anything.  For good reason)\n\nEdit: I just remembered I warned them the CFPB was not to be fucked with.  They just kind of shook their heads at me like I was an idiot.",
            "score": 152,
            "author": "generalnotsew",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was really impressed by the CFPB after they sued Flagstar Bank for nefarious business practices related to foreclosure. Relief came too late for me to save my house, but I'm glad someone was doing something about it.",
                    "score": 16,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. I logged on specifically to make a post here asking for advice on my Navient loans. I suspected something was off with the allocations &amp; needed some help doing the math.  \n\nI've been making steady payments for years and it looks like my debt is BARELY decreasing. My calculation at the rate they are applying my payment, it'll be 30 more years before I'm clear. 😬\n\nBut I guess loan consolidation advice is a whole other question for another day... Now I just want to know if this applies to me?\n\nMy loans were originally Sallie Mae in 2009 and transferred to Navient in 2012 (2013?). But I didn't catch this peculiarity, that's probably been happening for a while, until 2015. \n\nTL;DR - If I suspect I'm a victim (similar payment errors), but don't fall exactly in the borrowing dates listed (but my loans were transferred within them), should I write to the CFPB? ",
            "score": 142,
            "author": "ErnestGoesToPoop",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; it looks like my debt is BARELY decreasing. My calculation at the rate they are applying my payment, it'll be 30 more years before I'm clear.\n\nI'm not sure how you're calculating, but in case you don't know: when repaying a loan, your early payments *always* are heavy on interest. As the loan progresses, the amount going to principal increases and the amount going to interest decreases.\n\nI wrote this up a while back if you want more details: https://www.reddit.com/r/personalfinance/comments/3ub2mp/how_loan_interest_works_aka_why_is_half_my/",
                    "score": 51,
                    "author": "evaned",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don't have an answer to your main question, but regarding your calculation on when your debt will be gone, go to unbury.us right now if you haven't. Fantastic website that provides a very helpful visualization for when each specific loan will be paid off based on what method your are using to pay them. It really helped me see a light at the end of the tunnel, whereas before I was just throwing money at it blindly.",
                    "score": 61,
                    "author": "Simon_GodOfHairdos",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Your calculations are probably correct. I don't know your numbers, but you need to pay off the interest + the principal in order to see your principal decrease. Most people don't realize that a loan around $50,000 with an interest rate ~7-8% carries ~ $300 in interest/month. So if you aren't paying that plus some, your principal doesn't decrease and your loan doesn't shrink.",
                    "score": 12,
                    "author": "Capoose",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "\n&gt;&gt; Fails to correctly apply or allocate borrower payments to their accounts;\n\n&gt;&gt;&gt; Steers struggling borrowers toward paying more than they have to on loans;\n\n&gt;&gt;&gt; Obscured information consumers needed to maintain their lower payments;\n\n&gt;&gt;&gt; Deceived private student loan borrowers about requirements to release their co-signer from the loan; and\n\n&gt;&gt;&gt; Harmed the credit of disabled borrowers, including severely injured veterans.\n\nGood. Now when are they going to go after FedLoan for doing all of the exact same things?",
            "score": 71,
            "author": "siphontheenigma",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; When borrowers run into trouble repaying their federal student loans, they have a right under federal law to apply for repayment plans that allow for a lower monthly payment. But the Bureau believes that Navient steers many borrowers into forbearance, an option designed to let borrowers take a short break from making payments. But interest continues to add up during forbearance.\n\nLast year I was injured and could only work a small number of hours a week for a while. Because of this I couldn't afford my bills and called to let Navient know about the situation. They told me my only option was to forbear. When I asked how long I could get a forbearance they let me know I could have it indefinitely, I would have to apply again every few months but it wouldn't be rejected. Guess as long as it's growing interest they don't care",
                    "score": 11,
                    "author": "sallymaesnackattack",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sorry for being dumb and asking for a TL;DR, but I really cannot get past the jargon and unfamiliar concepts. Can someone please dumb this down for me and explain *why* this is huge - and furthermore, *what* is happening?",
            "score": 361,
            "author": "Nan_The_Man",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can tell you what regularly happens to me. My problem falls under the first allegation listed: \n\n&gt;Fails to correctly apply or allocate borrower payments to their accounts;\n\n I have Navient pull my monthly payments out of my checking account because I'm on a graduated payment plan and my interest rates fluctuate slightly. So the payment is slightly different every month and I got tired of getting late fees for being short by $.50 even though I was $5 over the previous month. So what they do is go ahead and pull the right amount of money out of my checking account, but then instead of spreading it appropriately over the four loans I have with them, they'll only apply it to three making the fourth one late. Once it's late it no longer qualifies for auto payments so they stop pulling money out. I have to call them and argue for 10 minutes with whoever I get on the phone about math. I will literally have to do a math problem with them explaining that 'No, my payment wasn't actually late, you fucked up.\" I then have to wait for them to fix shit in their system before I can go in and re-enroll my loan for auto payment. In the meantime they'll let me know that my next payment might be due before the auto pay goes into affect so I have to make a manual payment to keep that from happening. I don't always get my late fees back either. So they're basically stealing that from me.\n\nThis happens at least every six months. Not so shockingly, the loan that often seems to end up being late is the one that I have a cosigner on. I can't have the cosigner removed unless I have at least 12 months of on time payments. ",
                    "score": 536,
                    "author": "arfnargle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I will literally have to do a math problem with them explaining that 'No, my payment wasn't actually late, you fucked up.\"\n\nI have to do this all the time and it's so frustrating. I'll literally go down a list of numbers and ask the CSR to add/subtract/whatever and it will take ~20 minutes before they finally see the problem. They they \"forward my case for investigation\" which takes anywhere from 1 to 6 weeks to resolve. Meanwhile, I accrue late fees on late fees. \n\nI actually submitted a complaint to the CFPB regarding this practice a year or two ago. They waived my fraudulent late fees \"in a gesture of good faith\" without admitting any guilt on their part.  \n\nAnother annoying practice is that they will focus payments on loans with the lowest interest rates. It got so annoying to try and deal wit this that I had to cut my payments down to the minimum interest and then apply the extra manually to the highest interest rate loans every month.",
                            "score": 201,
                            "author": "Margules",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, and lord do they love to call anyone who cosigned for you. I swear if that loan is 30 seconds late they're calling my 95 year old grandmother trying to get a payment out of her. And then I'd have to call her to explain that 'no, everything's OK, no I don't need money, yes, I know being late will hurt my credit.' At least at this point she's seen enough about this in the news to know that they're a scammy company. But it's enough to make a person want to pull their hair out. ",
                                    "score": 134,
                                    "author": "arfnargle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 49,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Tieing into this my grandmother who was my cosigner passed away. I had been on time in my payments for more then a year. They stilll insisted on harrassing the hell out of my deceased gmas boyfriend for over a month  when i was 2 days late on a payment. Then insisted i mail them the actual (non copy) of her death certificate to have her removed as a co-signer. ",
                                            "score": 21,
                                            "author": "21bender21",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Seriously, the horror stories on this are insane. I once called them after being tagged for money I didnt owe that I didnt have and thoroughly explained to them that I am not their babysitter and it is not my position to clean up their mess when they cant do their jobs. The student loan market is just sheer evil, especially with places like AES and I hope that they get hit. The burden that these payments have brought on the lives of students and the absolute extent to which it has ruined lives is unfathomable. ",
                                    "score": 78,
                                    "author": "Only4DNDandCigars",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This thread is making me so happy that my student loan company has been great so far. I autopay my bill, I send them extra money sometimes and they apply it how I want, their user interface makes sense, I get my tax forms. No drama, that's it. I've never had to call or interact with them ever.",
                                            "score": 40,
                                            "author": "rem87062597",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; \"in a gesture of good faith\"\n\nI hate it when companies pull this shit instead of admitting their fault. It's insulting. ",
                                    "score": 27,
                                    "author": "lejazzvp",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Similar situation - I owe $250 but pay $350.\n\nTurns out despite written and verbal requests, they never applied that bonus 100 to my principal. They kept it as floating early payment.",
                            "score": 127,
                            "author": "xaaraan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Woah woah woah so they currently have $100x (x being the number of months you've overpaid) sitting in an account that they haven't applied to the loan? \n\nCheck that with the SEC because I'm pretty sure you have to be regulated differently if you're holding money in an account, as if you were a bank. ",
                                    "score": 43,
                                    "author": "commando101st",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; I'm pretty sure you have to be regulated differently if you're holding money in an account, as if you were a bank.\n\nAnd that's how they eventually got caught, I think.",
                                            "score": 23,
                                            "author": "katarh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy mother of fuck I would be livid",
                                    "score": 50,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "This has happened to me several times, and I still don't know what it means – the \"floating early payment.\" If anybody can explain, I would be very grateful. I don't pay an extra cent anymore, even though I can afford to pay a little bit more each month, because of this. ",
                                    "score": 13,
                                    "author": "siamesekitten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 20,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh fuck, I just realized this is what was happening to me. I would constantly get calls about missed payments even though I had autopay set up. I would have to argue with them on the phone so often, I actually started thinking that I was being scammed and refused to give them my payment info over the phone. Eventually I just had all my loans consolidated with a different provider who Ive had no issues with. Am I eligible for restitution in some way? Or did I screw myself out of it by settling my account and moving to a different provider? Really all I want is my credit score to be fixed from the havoc that they wrecked on it. ",
                            "score": 41,
                            "author": "itslef",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am not a lawyer. This is not legal advice.\n\nI think that as long as you were damaged by their shitty practices alleged in the complaint (and lowering your credit is certainly damage), then you should be eligible for restitution. The fact that you consolidated with someone else shouldn't matter.\n\nThe court probably cannot force anyone to change your credit score. You would probably just get paid if there was a settlement or judgment. ",
                                    "score": 30,
                                    "author": "TheoryOfSomething",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is exactly what would happen to me many years ago with Sallie Mae.  After the third such incident I adjusted as follows:\n\nFor conversation sake, lets say bill was due every month on the 28th.\n\nI had my autopay posted on the 20th of each month for the monthly payment amount.  I then setup an additional autopayment on each individual loan of an additional $2 on the 24th.  (you could schedule as many 'extra' payments as you wanted for up to 1 year in advance.)  \n\nThis gave it time for the large auto-pay payment to be processed across all 4 loans.  If one fell shy 0.75 or 0.50, the additional $2 payments that were setup to be towards specific loans would cover it.\n\nThis worked well but needed to be 'rebalanced' every 6 months, because I was then \"paid in advance\" and during rebalance time they adjusted my minimum monthly payment lower so that it extended for the term of the loan.  Which screwed it all up again.\n\nNote:  I received a notice last year indicating that my SML were transferred to Navient due to some regulatory BS (and the name change reflected on my credit report).  They've been paid in full for 5 years now, so things could have changed.",
                            "score": 30,
                            "author": "Starbuckz8",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is why I took my loans off auto pay and set a calendar alert. I was supposed to be saving like  .25% but the phone drama to get the late fees removed made me want to set myself on fire.",
                            "score": 16,
                            "author": "theweathereye"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; instead of spreading it appropriately over the four loans I have with them, they'll only apply it to three making the fourth one late. Once it's late it no longer qualifies for auto payments so they stop pulling money out.\n\nThat's super duper all kinds of fucked up. No wonder they're being sued. Thanks for putting into an understandable example and I'm sorry that happened to you.",
                            "score": 12,
                            "author": "Tenaciousgreen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The federal government (through their consumer protection bureau) is suing Navient, a company that administers federal student loans. The government is claiming that Navient has broken several laws and negatively impacted student loan borrowers, potentially millions of them. ",
                    "score": 122,
                    "author": "Safarione11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 74,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Considering this is a personal finance subreddit, I don't think it's out of place for me to say that you need to keep a closer eye on all of your accounts. I've had waitresses giving themselves $50 tips, self service checkouts charging an order twice, rent taken out twice, and fees for services I never wanted added to loans. Vigilance is crucial.  People and machines make mistakes. ",
                                    "score": 25,
                                    "author": "Primatheratrix",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the wake of a number of consumer complains and alleged deceptive practices the CFPB was formed (standing for Consumer Fraud Protection Bureau) and one of their primary objectives was to audit how student loans were being collected. \n\nSo the government staffed an entirely new federal agency and at certain times of the year they \"move in\" and set up an auditing area and interview employees as well as go through recordings and records. \n\nIn this case they decided that the largest servicer Navient (formerly Sally Mae) mishandled payments and kept borrowers in the dark. They have something like $300 billion of the student loan debt (both fed and private) so that's like 1/4 of all student loan debt (using 2013 figures of 1.2 trillion). \n\nFor about 8 years Obama has had in effect programs like Income Based Repayment plans and the suit alleges they didn't inform consumers or do enough to give them options and even misguided them. Why? Financial gain. Someone going into WDF or some other programs don't pay them very well. So they talked them into bigger payments and programs that benefited the company not the consumer. ",
                    "score": 16,
                    "author": "tooterfish_popkin",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a private loan through navient.  They are so unhelpful with this loan. They claim I can't put it on forebearance. They put me on an income based payment plan and I finally managed to pay that on time monthly but after 12 months it went up and they wouldn't go back down. Because \"they have to get me on track to pay what im supposed to\" which just isn't feesible.\n\nPlus last time I asked for a lower payment they said because \"I've taken on new debt since I SIGNED MY LOAN I'm ineligible\" I signed my loan in 2006 when I was still a senior in high school. Of course I've taken on new debt since then....",
            "score": 118,
            "author": "dodekahedron",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's truly impossible to negotiate with terms that you don't know and a company who has no federal regulation or consequences for loan repayment. You buy a house you know your payments. Not here. They change and no matter what you pay you are still going to get phone calls. I recommend to get in writing what you owe and how your payments were applied by certified return receipt. ",
                    "score": 58,
                    "author": "christinastelly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 62,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Reading this thread really makes me appreciate how the government handles student loans in New Zealand.\n\nReally, I don't get it how Americans are basically fucked if they're going to college. That's the gist I'm getting by reading this thread. \n\nPeople in their 20s with &gt;50k$ debt. Holy shit, how is this even possible? And why is this even a thing? ",
                                    "score": 35,
                                    "author": "cyan2k",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You got the gist perfectly. It's the reason we're seeing so many people graduate college and move back in with their parents. I'm sure it varies area to area but almost all of my close friends are either living with their parents or seriously struggling to keep afloat. My federal loans are on an income-based plan and thankfully my payment on those is incredibly low. \n\nWhen I started paying my private ones, they were $450 a month which was the majority of a paycheck. Living at home has allowed me to pay off the smaller ones and get them down to $275 a month but I would have never gotten anywhere if my parents weren't so understanding.",
                                            "score": 21,
                                            "author": "theblueinthesky"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty much the same here in Denmark, except it's not interest free. Part of the story is of course that we get about 800 euro for free (if not living at home and some other stuff), so the loan is extra stuff. I have one because I was paying for my girlfriend until she could begin studying. However total interest if I pay minimum will be around $100, which I am perfectly fine with paying for not having had to work even more than I already did next to my masters. And it will be less than that if I pay it off sooner obviously, which I should easily be able to do as the minimum payment is quite low.",
                                    "score": 13,
                                    "author": "Rahbek23"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah that's how it would be if I lived in a country where half of it wasn't trying to squeeze my generation for every penny we're worth before they can shut the door behind them.",
                                    "score": 14,
                                    "author": "IamA_Werewolf_AMA",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Fails to correctly apply or allocate borrower payments to their accounts\n\nThey did this to me. I had saved up a bit of money and decided to pay off one of my loans and I was pretty excited. I submitted the payment, and you know how you get that confirmation page that suggests you 'print this for your records'? For the first time ever I decided to print it since it was a significant amount for me. Lo and behold those jackasses had distributed my payment across all my loans instead of paying off just one as I had specified. I called to correct the issue thinking it wouldn't be that big a deal to fix, but it ended up being a giant pain in the ass and they basically refused to help. At this point I finally remembered I had printed out the confirmation page that included payment amount to which specific loan, and once I mentioned this they stopped arguing with me, fixed it, and ended the call. I have zero doubt that if I hadn't printed that page out they would have never applied my payment correctly.\n\nFuck Navient.",
            "score": 32,
            "author": "altaica"
        },
        {
            "level": 0,
            "comment": "I get those \"New Document Ready to View\" emails at least twice a month. Most of the time they were monthly statements or notification that my payment posted. I put off looking at them (logging in to their site is a hassle), and suddenly my payments went from 80$ a month to over 300$. Nice to know that their vague as hell emails were specifically called out.\n\n**Edit**: To clarify, another reason I would put off looking through these emails is because I watch my accounts regularly with Mint. Every day or two I log in and make sure that everything looks right. Nothing about my loans/payments looked off until one day I was suddenly at less than 25$ right after payday. **Thanks ~~Obama~~ ~~Sallie Mae~~ Navient!**",
            "score": 112,
            "author": "NutBoii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same thing happened to me, I called them and they were like you should have gotten an email. I eas like no I didn't but sure enough it was there mixed in with all the other \"new document\" emails. Bastards.",
                    "score": 23,
                    "author": "steelguy17",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I had this same thing happen! I was paying like 130 a month and suddenly im getting calls saying i missed my payments and they're charging 400 bucks! it's insanity!",
                    "score": 12,
                    "author": "Pacoeltaco",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like this only potentially impacts you if you have loans serviced by Navient that went into forbearance between 2010 and 2015. When people had problems repaying loans, Navient pushed people into choosing forbearance status to make future profits from the interest that continued to build instead of income based repayment options. ",
            "score": 60,
            "author": "Hoosierlaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had to claim the forbearance plan in 2016 with Navient. Why does this not effect those who did the same last year?",
                    "score": 13,
                    "author": "z7x9r0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because this is the result of investigations between 2010 and 2015.  When it started (or ended), there probably wasn't enough paperwork to include 2016.",
                            "score": 8,
                            "author": "82Caff"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had navient that entire time and had a couple long stretches of trouble paying back the loans and entering into deferments.  I finally paid it all off about 8-9 months ago, but it seems like I may have been bamboozled.",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My student loan debt was through Sallie Mae/Navient.  When I made my first few payments beyond the standard monthly payment, these funds were not put towards my principle.  Instead, they were applied to future payments in an odd way.  They were held by Sallie Mae/Navient in case I missed a payment.  This was unlikely because my payments were automatically withdrawn from my checking account.  I didn't realize this was being done with my extra payments until I saw I had paid ahead many months.  I called to ask about this and was told that if I wanted any funds to be applied to my principle, I had to send my check with a letter stating this explicitly and specifying which loan(s) I wanted the check applied to.  Later, I called to ask if the funds being held in case I missed a payment could be applied to principle and was told they already had been in a sense.  No matter how many people I had spoke with, I was never able to understand what happened to those funds.  No one could explain it so that I could understand.  I'm not stellar with these kinds of things, so it very well could have been my mistake.  \n\nI paid off my loans last year, so I just gave up trying to make sense of it all.  It was very frustrating to not understand how thousands of dollars could not be accounted for.  \n\nSallie Mae/Navient certainly cleaned up their act, though.  By the end of my loan, I could easily apply funds without having to type a letter and mail a check.  That was great!\n\nEven though I think I was affected by Sallie Mae breaking the law, I see how the government suing Sallie Mae/Navient could affect me.  ",
            "score": 63,
            "author": "sidus_3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm not sure if this will benefit or impact me in any way, but I have all my student loans managed by Navient. While I've rarely paid additional money on top of my monthly payments, I HAVE called to try and lower my monthly payments. They have almost always said, \"well we can't lower your payments, but we can put you on temporary forbearance!\"\n\nI—being kinda naive and broke—have accepted this. Multiple times. Including right now. \n\nWas I duped/encouraged to go on forbearance for Navient's benefit? And if so, what should I do? Is there anything to gain?",
            "score": 126,
            "author": "freshmintsss",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 56,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was me, graduated in 2010, could not make full payments so they put all of my loans in forbearance, was told if I applied for the income based repayment plan that I would have to consolidate all of my loans into one. Was told if I consolidated the higher interest rate loans with the lower interest rate loans the interest of the new consolidated loan would be the same as my highest interest rate. \n\nI had no co-signer so my interest rates for my private loans were almost double the amount of the federal loans. I thought I was doing the right thing. \n\nMy loans have double since I left school. Moved across the country, found a real job and have been paying $1,000 - $13,000 a month for the past 2 years. \n\nI have so much fear and anxiety around this, it has taken over my life. ",
                            "score": 20,
                            "author": "saranrapsky",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The loan company has incentive to let you do this.  Since there's pretty much no way to default on student loans, forbearance is a win.\n\nIf you're not familiar, forbearance just means that while you don't make any payments, interest is still accruing on the loan, and to the lending company, that is 100% profit for them.  ",
                    "score": 101,
                    "author": "ew73",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who may have been affected by this, what can I do? Do I sit back and watch? Do I contact someone about my experiences with Navient?",
                            "score": 26,
                            "author": "lucydent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Couldn't hurt to file a CFPB complaint, I guess.  \n\nI'd strongly suggest not trusting a damn word that comes from this company.  If they encourage you to do something with your loan beyond \"pay your monthly payment\", don't agree until you're certain you know what they're selling.",
                                    "score": 35,
                                    "author": "ew73"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm in this exact same boat and was advised to put my loans in forbearance by a rep at Navient just earlier this month. I'd be curious to find out if this is going to effect me in any way.",
                    "score": 32,
                    "author": "follymo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I looked in this before for my loans. They recapitalize the interests into the loan. In other words, the interest that built up during the forbearance period became part of the loan amount.\n\nThis makes the interest amount higher even though the percentage is the same. This makes it difficult to pay it off sooner. ",
                            "score": 23,
                            "author": "FlusteredByBoobs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoa, so my student loans are through greatlakes, any unpaid interest goes to a separate little pot that I pay off separate from my loans. They do not add it to my current loans. So you're saying that unpaid interest through Navient gets added back into the student loan amount and then you pay interest on your interest?",
                                    "score": 19,
                                    "author": "Mirmadook",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just had to make a $340 payment (when my IBR normally has me at a $0 payment) because I missed the deadline for renewal because that e-mail was mysteriously redirected to \"clutter\" despite me getting all of their other emails.  \n\nGoodbye large chunk of savings that I've been trying to accrue for months. ;_;",
            "score": 22,
            "author": "hooloovooblues",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had them tell me that my IBR wasn't going to be renewed at the end of 2015 because I hadn't responded to their request for updated income info.   It turned out they hadn't sent it.  Luckily, they did let me send in income info and got me back on IBR before I had to make any bigger payments.  I wonder if this is like what happened to you, or if this is covered in this suit...",
                    "score": 13,
                    "author": "Laney20"
                },
                {
                    "level": 1,
                    "comment": "If you haven't paid already, you can ask for a month forbearance while you send the IBR app in. I know forbearance is frowned upon but it would be better than paying what you saved. I had to do it when I logged in and my payment went from 100 to 700.",
                    "score": 7,
                    "author": "monstere316",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great...Maybe. had a relative cosign for another relatives loan. After a job loss, forbearance  and paying about $10,000 on a $20,000 loan...About $20,000 is still left on the loans. Sallie Mae/Navient is a pretty good scam at like 10% interest\n\nEdit: Just kidding, worse than that: $14,490 paid, $17,000 left (which is really $28,000 amatorized over another 13 years) avg 9.3%",
            "score": 47,
            "author": "tranding",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats ok, i have 90k of student loans now from originally a 35k loan for an associates degree from itt. Rip me.",
                    "score": 48,
                    "author": "Und3rSc0re",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "35k for an associates from itt tech? Damn you got hosed. That's fucking robbery.",
                            "score": 37,
                            "author": "hanzman82",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yep, 23k (originally sallie mae, now navient) for one shitty,  uneducated semester at that cesspool of a place.  that school was (thankfully its gone due to cfpb) 100x worse than any public school. Cant believe both of the institutions i tried to better my life with, simply scammed my ass. I still owe most of it, and its been damn near 10 years. How can we be reasonably expected to pay for this service (if you could call it that). I owe 20 grand and have nothing to show for it except hard ache, extra anxiety, and financial ruin.\n\nIm actually to a point in my life where i can afford to start working the payments, but seriously? With news like this it feels like we're being extorted by technicalities.",
                            "score": 14,
                            "author": "inshane_in_the_brain"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What will this lawsuit mean for people whose student loans fit were mismanaged or handled by Sallie Mae/Navient? I have $60k in private student loan debt that originated with Sallie Mae and is now serviced by Navient. Since 2010, I have struggled to pay the monthly payment (think just shy of $600) and have consistently been told that I can just apply for a forbearance. The problem being I finally ran out of forbearance time this fall. What is weird is Navient finally approved my IBR plan at that time. I have been making income driven $243 monthly payments since September of 2016. \nAlso it might be important to note that my state (WA) has one of the two Attorney Generals behind this lawsuit. Should I be writing or emailing my AG's office to add my name to the suit?\nPlease let me know if anyone has any ideas of how a similar lawsuit ended and what happened to the consumers that were affected by the ruling. Thank you!",
            "score": 23,
            "author": "SandraTempleton",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This just made my night. Fuck that company. My friend is a CPA and she over saw the transfer from Sallie Mae and told me they were way more corrupted but couldn't do much to stop it. Fuck Naviet.",
            "score": 19,
            "author": "Mitchs_Frog_Smacky",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So what happens when I was paying extra (told any extra goes to principle) and found out they just kept adding it up and pushing my \"payment due\" date further back. I was a YEAR ahead at one point. \n\nGot it fixed but they have to be the *DUMBEST* I've ever worked with. All this was done over the phone, including them authorizing extra payments. ",
            "score": 17,
            "author": "bionicfeetgrl",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Story: I paid off a 10 k debt over the phone because Navient's website is unable to do payments larger than 5 k (I believe). I gave the rep my information and she processed the payment over the phone- at least I thought she did. The money was taken out of my chase account but not taken from my Navient account for a week or so. So I called back and got the run around for about a month. I spoke to sooooo many different people each of which gave me different responses to why the money had not been taken from my Navient account. Finally, I demanded to talk to higher ups who proceeded to tell me they had record of the transaction but the original rep must have applied it to a different account (like someone completely fucking different than me). It finally got resolved after a month or so of calling and getting a ton of BS responses.  \n\nIt was a scary month of my life. I remember losing sleep over it because I had no idea how a company could do something so f'd up. This looks like I wasn't the only one to going through some shady shit. ",
            "score": 17,
            "author": "timcouch1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So ive been in forbearance several times on my income based plan bc, lets be honest, they don't care about any other payments you have to make so i still cant afford the lower payment... but i also had one time when my payment was raised and they said it was because i didnt renew my IBR plan and going back through everything i found that they did not correctly update my email so they didnt even send it to the right person...also i half the time when they send out those 'new document available' things i log in but can never navigate the website to find these supposed documents....if we think we were personally effected by this do we personally have to file a claim or will it be found during an investigation? ",
            "score": 16,
            "author": "catmomma3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Let's call a spade a spade. Remember, they used to be Sallie Mae. Why do you think they changed their name?",
            "score": 16,
            "author": "ProbablyHighAsShit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You only have 36 months of forbearance time total for your student loans. This is to be used as a last resort if you fall on economic hardship. During this time the interests keep accruing and is added to the principal. Almost all servicers have what are called IBR (Income Based Repayment) plans that are available such as PAYE (Pay As You Earn) where they calculate your payments using your Marital Status, Family Size and Adjusted Gross Income for the first fiscal year. After every year they recertify you meaning they recollect income data for the following year along with family size and marital status and recalculate your payment this is called a REPAE (Revised Pay As You Earn) program. Never let them defer your loans or place them on a forbearance. If youre unsure of your servicer you can actually transfer your loans to the federal government. You can submit whats called a DLC (Direct Loan Consolidation) application and in 30 days the federal government will buy the eligible loans off your current servicer and transfer them into one loan and one single payment method. Simultaneously you can submit an IBR with them as well and lower your payments considerably and if you meet certain criteria you can get your loans discharged altogether. \n\nThe website is https://fsaid.ed.gov\n\nIf you ever want to check the status of your loans go to https://fsaid.ed.gov and create an account, once you've created an account it takes about 3 days for the Social Security Administration to verify your indentity. But you can go to www.nslds.ed.gov immediately and see all your loans and what status theyre in and who is your servicer. Thats important if youre entering default status. At which point youd have to enter a rehab program to get you out of it and its huge headache, where they intercept your taxes and/or garnish your wages. There are ways to get around it. If you guys have any questions hit me up I can shoot you the info. I work in this industry and we make money helping borrowers either lower their monthly payments or discharge their loans altogether.  ",
            "score": 15,
            "author": "xMASSIVKILLx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 19,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Soooo, will I get another $3.17 check like all those other civil lawsuits or will there be something legit?\n\nEdit: Huh, they always steered me towards forbearance when I was unemployed. That's nice of them. ",
            "score": 14,
            "author": "pistcow",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had no knowledge of this case, but have anecdotal evidence from yesterday to support the claim that they use \"uncharacteristically vague email titles.\"\n\nI have been in deferment of my student loans the entire time I've been in grad school and I get an email once a semester confirming that they got the information concerning my enrollment from the school and that I am still in deferment. This semester I am just enrolled in one credit because I actually done with my PhD but I must be enrolled to defend my dissertation.  \n\nI was aware that 1 credit is not enough to qualify for deferment and that my repayment period would start on 12/17/2016.  On January 6th, I received an email from Navient titled \"Deferment Approved.\"  The body of the email had no dates, but said, \"Congratulations, your request for deferment has been approved!\" and linked to my account for further info.\n\nBeing a fool and assuming that I had been approved for further deferment as the title and body of the email suggested, I didn't log in to check the details.  On January 16th, they emailed me to say my account was past due.  As it turns out, the deferment that I was *approved* for was the deferment that had just ended in December; the one that I had already been approved for in August.  I paid my bill and called them to say exactly what they are being sued for, that their email seemed intentionally misleading and that I had made my payment.  They told me that it wasn't misleading and that the date of deferment that I had been *approved* for was clearly written and basically that I was a lazy degenerate for not realizing that email did not contain new information about my account.\n\nSo, just to corroborate the stories of others, these guys are slimy fucks.",
            "score": 14,
            "author": "fancyduke"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 66,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have to say, I'm really happy I decided not to go to sleep. For some strange reason I decided to go on Reddit, which I don't do often, and found this. \n\nI have been paying off my loans for 3-4 years now, not making so much as a dent.  I've been doing IBR plans, because let's be real, barely anyone can find a job in their field, let alone make enough money to pay back $400+ per month.  How can anyone afford to do that AND have a home, car, food, insurance, etc. - you know, adult needs?\n\nAnyway, there's a good chance I have been affected by this, so thanks for sharing. I'm going to look into this for sure!",
            "score": 39,
            "author": "GloveSave39",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I believe I was one of the victims here... If it all works out will they just send me a check? Would one have to make a claim in this situation?",
            "score": 50,
            "author": "jordobo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any time I've been someone affected by something like this, I just got a check years after the fact. I actually received one in the last year from an incident that happened 7 years ago.",
                    "score": 17,
                    "author": "gqgk",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Usually class action suits take a few years, they should send you a letter informing you that you may be eligible with a deadline to submit proof. If I recall correctly, once everyone has submitted a claim, they either access how much to fine, or this have sent this information out after the judgement has been set, and begin dispersing payouts to the victims.\n\nTldr: they should notify you by mail on how to claim, and if not, you might just have to pay attention and wait for information ",
                    "score": 11,
                    "author": "whootdat",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know it's not likely to happen, but I'll indulge in the fantasy that a judge will declare all loans serviced by Navient fraudulent and order forgiveness for all those loans. Sure, that would probably ruin Navient - but it would be a strong message that \"this shit will not fly.\" That would be nice.... instead, I imagine it'll just be a meager refund check.",
            "score": 25,
            "author": "RainaDPP",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I must be in the minority here because I haven't seen one response saying anything remotely okay about navient, but I have been paying my loans to them since 2014 and have had zero issues.  I pay online each month and specify exactly how many $ go to each loan.  If I want to pay extra on the highest interest loan I add more $ to my payment on that loan. It seems strange to me so many people could have issues with selecting how their payments are distributed... i mean does everyone really send navient a check each month? ",
            "score": 13,
            "author": "hockeypro889",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, I've been paying off my loans with SM/Navient for 4 years and have never noticed a problem with regular or extra payments. I've audited them occasionally to make sure the math checks out, and I've never made a payment by check or called for advice regarding how to reduce my payments. \nStill, I'll be taking a good look at my account soon to make sure everything still checks out ok. ",
                    "score": 9,
                    "author": "Safarione11"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile, the US Government has earned $227 billion in interest alone in the last five years on student loans. More than the combined profit of America's two largest banks over that time. Don't worry, nobody is interested in that.",
            "score": 19,
            "author": "moveovernow",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had navient student loans until late 2015, I would agree that it was really easy to go to forbearance which was helpful when it was difficult to find a job (millennial problems) but I didn't feel as though any part of that was predatory. I guess YMMV ",
            "score": 8,
            "author": "HyperionPrime",
            "replies": [
                {
                    "level": 1,
                    "comment": "The part that was predatory was when people specifically asked for income based repayment and were persuaded to go into forbearance instead without fully explaining the ramifications of doing so. ",
                    "score": 13,
                    "author": "tehbantho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Navient..... They told me they would give me an unlimited forbearance state because one day I up and wrecked my car.. My brain decided it would be a good time to become epileptic. \n\nSaid absolutely go figure out what's wrong with you! You got it!! If you are completely and totally disabled where you can't hold a job because of your seizures we can send you paperwork!! \n\nThree months later a debt collector is calling me... They sold off my loans.. I couldn't work. I had a degree that was worthless but I wasn't totally unable to work so I fought like hell. Ended up having two brain surgeries and a hell of a fight. But I am doing what I love so it's all cool.  Hope they bring these clowns to justice though. ",
            "score": 9,
            "author": "sigtaugod"
        },
        {
            "level": 0,
            "comment": "Several years ago I got private loans from Sallie Mae. Somehow half of the money I borrowed from Sallie Mae is now managed by Navient.\n\nIs there anyway this suit can benefit people who have loans managed by Navient even if they believe that they may not have been cheated by them?",
            "score": 50,
            "author": "Snazzy_Serval",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Somwhow half of the money I borrowed from Sallie Mae is now managed by Navient\n\nNavient = Sallie Mae\n\n",
                    "score": 90,
                    "author": "nph333",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Iirc based on the notices, salliemae split into two separate entities where salliemae became the lending arm and navient became the loan holding arm.\n\nSeemed very reminiscent of the housing bubble era originating banks (salliemae) that would then package and sell the debt to long term holding arm.",
                            "score": 41,
                            "author": "itchyouch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The complaint filed with the court addresses \"Navient, formerly known as Sallie Mae, Inc.\"",
                    "score": 21,
                    "author": "Safarione11"
                },
                {
                    "level": 1,
                    "comment": "Sallie Mae spun off their student loan division into Navient. Sallie Mae now focuses on banking.",
                    "score": 12,
                    "author": "aperson643",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Is there anyway this suit can benefit people who have loans managed by Navient even if they believe that they may not have been cheated by them?\n\nI hope not. Navient preyed on the most vulnerable. They deserve justice. You don't need to take a cut of that.",
                    "score": 27,
                    "author": "brd_is_the_wrd2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems like if they've been doing that much illegal stuff that a lot of people might have been affected without knowing it though. ",
                            "score": 16,
                            "author": "mfball",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I've been harmed by Navient the past five years or so, but not in any of the manners listed above. Am I just fucked?\n\nI still owe them about $30k, and was about to pay off one of the higher-interest loans. Advice?",
            "score": 6,
            "author": "PooptyPewptyPaints",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So I may have missed this post, but is there a class action suit coming or any action to take at this point?",
            "score": 6,
            "author": "jessicavenable"
        },
        {
            "level": 0,
            "comment": "Can't wait to get my $14 check in the mail from them so I can tell them I have a little extra to put towards my loans when they call again today like they do every day.",
            "score": 8,
            "author": "nodnizzle"
        },
        {
            "level": 0,
            "comment": "The people responsible for these kinds of corporate policies - let's call them what they are - should be tried and put in prison. This is theft at a grand scale. It may not be a violent crime, but it has a severe impact on its victims and should be tried as a felony. \n\nI'd like to see the executives fired, indicted and all over the pages of the national papers. This goes for investment and general banking institutions too, that for years have employed illegal manipulation tactics to STEAL money from its costumers. ",
            "score": 7,
            "author": "N301CF",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is how a justice based system should work. We live in a pay to play system that is labeled as a justice system. Truth be told these people might step down after taking their \"hush\" money (example Wells Fargo ex CEO). The funds that will be disbursed to clients hurt by this practice will be about 1% - 5% of their total I'll gotten gains. Not one of them will see jail time because not one person did it, the entire company was invloved. Their legal teams are the best of the beSt and they have more funds available than uncle sam wants to waste to try these people. So in the end the people who should be in jail will be even more rich, the people who were hurt might see a tiny fraction of the money stolen, and it's going to be business as usual. Corporations don't play by the rules they just make them for the rest of the 99% to follow. #richstayrich",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My girlfriend currently owes around 150k to navient due to the art institutes bullshit.\n\nWhat type of person does she want to seek out to get more information on fighting this? Accountant, lawyer, loan officer? We're lost.",
            "score": 6,
            "author": "Broth91",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is a different animal, to be honest.  She wants to look at the Borrowers Defense to Repayment, which will gear up in July, although about 1000 Art Institute Students have already gotten help.  Do not fall for scams promising you the moon.  Go to the Dept of Education website and see what the forms are.  I'm on mobile or I'd link.  Essentially, they settled with the government on charges of misrepresentation of the employment rates, so if she is in the class of students in the covered timeperiod, she may have relief coming to her.",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        }
    ]
}