{
    "id": "77tyep",
    "score": 16264,
    "title": "Are there any legitimate part time work-from-home jobs that aren't a scam?",
    "author": "fight0fffyourdemons",
    "date": 1508599192.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/77tyep",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking to make a little extra income as a side job after my full day gig is over and also on weekends. Was thinking of doing transcription, but not sure where to begin. If anyone knows of any legitimate part time work from home jobs that does not require selling items I'd appreciate it!\n\nEDIT: just wanted to say I am very overwhelmed by the amount of comments on this post. Please know I am reading each of your comments. Thank you all for your insight! I really didn't think this post would have so many ideas!",
    "comments": [
        {
            "level": 0,
            "comment": "All,\n\nThanks for offering some good suggestions to OP.\n\nTo the minority that decided to break [the rules](https://www.reddit.com/r/personalfinance/about/rules) especially concerning advertising, know that the mod team is working their way through this thread to deal with these comments.",
            "score": 1,
            "author": "Mrme487",
            "replies": []
        },
        {
            "level": 0,
            "comment": "LiveOps is a good place. It's a call center position you do from home. You take orders and payment info over the phone for when people want to order from those infomercials they see on TV. When they say \"call the number on your screen\", you'd be the one to answer!\n\nYou're paid per minute on the phone, so your paycheck will vary. But the scheduling is insanely flexible. ",
            "score": 417,
            "author": "TheDiminishedGlutes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t like LiveOps. You’re not employed by them. You’re an independent contractor and file taxes differently (not a huge issue). I found it difficult to get time slots and when I did take calls, they were limited. Lots of time sitting with no calls coming in. \n\nI’m with HSN WAH now and get paid hourly ($11ish). I’m part time. You can swap and give up hours as you please too. ",
                    "score": 75,
                    "author": "jc9153",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Balloon Artists make thousands a month working weekends and evenings. I've been doing balloon art at birthday parties, restaurants, and corporate events as a side hustle now for nearly 20 years and nothing beats the fun you have while making really good money.  Depending on your market, decent balloon artists make anywhere from 100-200 US dollars an hour. ",
            "score": 231,
            "author": "makemeabicycle1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's not exactly a work-from-home job, but I've heard of people becoming notaries and then advertising their services on cragslist. A typical rate might be $20 for you to show up and then $15 per document. People are willing to pay for this for the convenience of being able to have something notarized after 5pm or on a weekend. ",
            "score": 560,
            "author": "snailtimeblender",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be careful with the price setting. Some states limit how much you can charge; in Georgia it's $2 per document.\n\nBut if your state has no limits, go for it.",
                    "score": 276,
                    "author": "c-dot-gonz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$2 for notary and $25 for trip fee. ",
                            "score": 260,
                            "author": "boonepii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "$10 online service fee, $3 registration fee, $5 administration charges, $6 convenience fee.",
                                    "score": 186,
                                    "author": "muricabrb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "£4.37 inconvenience fee.",
                                            "score": 43,
                                            "author": "Unliteracy",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A friend of mine works from home as a Corporate Travel Agent. It's corporate so he is talking to companies like American Express and lining up flights for businessmen and isn't dealing with disgruntled honeymooners that missed their flight.He makes like $50k and has all he benefits, including discounted airfare and lodging from more or less anywhere in the US. \n\nThe system that they use is called Sabre Global Distribution System. It's basically just learning all the shorthand for the airports. The internet has a bunch of practice tests for the Sabre system also so you can practice memorizing all of that stuff. \n\nGood luck with your search!",
            "score": 4471,
            "author": "Gucas_Lolsvig",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1099,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 174,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 318,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 66,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sabre isn't just knowing airport ~~ICAO~~ IATA codes. It's quite a bit of learning but once you get it, it's pretty simple. Took me a couple months when I worked at an airline to get the hang of it.\n\nedit: switched ICAO to IATA",
                    "score": 466,
                    "author": "shakin_the_bacon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is just how my friend explained it to me, he didn't get too into detail about it but he did mention Sabre and to use that in a google search. He also said that a lot of the companies like the one he worked for do paid training programs as well. I know anything involving air travel is very meticulous.",
                            "score": 146,
                            "author": "Gucas_Lolsvig",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 217,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is always a need for writers or editors online, assuming you are proficient in writing, proofreading, and other applicable skills. Some of these jobs may require you to operate as an independent contractor, though.",
            "score": 4650,
            "author": "Jags4Life",
            "replies": [
                {
                    "level": 1,
                    "comment": "Assuming one had these writing skills, how would you find these jobs?",
                    "score": 1292,
                    "author": "vlt88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I write for a blog part time. \n\nI broke into it by being active on the blog. Leaving comments, responding to the facebook group, etc. After awhile reached out to see if they needed help. They did, and now it is a nice side gig. ",
                            "score": 1653,
                            "author": "attax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 444,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 642,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 153,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 100,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Deprnds on article. $100/article plus $25/hour for online work (facebook and emails). Its for a travel blog too, and they pay for all of my travel. ",
                                            "score": 1081,
                                            "author": "attax",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\\&gt; Works as a proofreader/editor\n\n\\&gt; \"Deprnds\"\n\n\\&gt; \"Its for a\"",
                                                    "score": 2717,
                                                    "author": "Juno_Malone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you're good at something, never do it for free",
                                                            "score": 2295,
                                                            "author": "daaaren",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "perfect save!",
                                                                    "score": 266,
                                                                    "author": "Swimmingbird3",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "ncie\n",
                                                            "score": 151,
                                                            "author": "01000100010110010100",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Damn that sounds too good to be true. Congrats on the sweet gig. ",
                                                    "score": 251,
                                                    "author": "gwease23",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well he isn't going to be getting enough jobs for that to be full time, or he'd be doing it full time.",
                                                            "score": 156,
                                                            "author": "TurboChewy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well sure, you'd need to write a couple dozen articles per month to have a decent FT income at that rate, but making an extra few hundred dollars each month and getting travel expenses comped, it would make life a little sweeter.",
                                                                    "score": 178,
                                                                    "author": "marsman57",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "100-250 karma plus quarterly bonus ",
                                            "score": 279,
                                            "author": "AYoungOldMan",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Go to job sites like indeed, etc and search for them. I was able to get a remote technical writing job for ~$20/hour, but it did require some fairly in-depth knowledge of the niche I was writing about. ",
                            "score": 193,
                            "author": "asusa52f",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Think about what topic you'd like to focus on, whether that be pertinent to your skillset, interest, or finances. My specialization is science writing; I only have one freelance editing gig, but I got it by scrolling through the National Academy of Science Writers online jobs boards. There are soooo many job posting threads/newsletters/online boards just like it, but they tend to be catered to slightly more specific areas than just \"writing jobs\".",
                            "score": 143,
                            "author": "MammalFish",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 151,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " I'm interested in this and have been wondering how to break in to the field. I've spent the last 18 years of my life teaching writing to kids, so I have gobs of editing experience. I'm getting burned out on teaching, not because of the kids but because of all the time I have to put into planning lessons. Also, I'm independent, and the overhead costs for running my classroom are going up at an alarming and potentially ruining rate. If you wouldn't mind discussing details of your work with me, I would really appreciate it. ",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Usertesting is a site where you get paid about $15 bucks for 20-30 min for testing out websites following scenarios",
            "score": 2737,
            "author": "kevsteezy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This seems too good to be true, not saying it is but it totally seems that way. Can you please elaborate a tad?\n\nAny special skills required? What kind of scenarios? Is there little work avaliable or could you just continue to do this all day and make some actual money?\n\nThanks! I appreciate it",
                    "score": 751,
                    "author": "ArcticFox-EBE-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a web developer and we use usertesting.com to test UI designs changes.  I'm actually surprised they only pay $15 per test.  They charge us close to $100 per tester.\n\nThey do help us develop the script of what we want the user to test and develop audience criteria.\n\n\nIt can be brutal listening to the users test, people saying they hate the look or can't figure out how to add something the cart.  \n\nAs far as special skills, we need to see typical customers of a website.  This can be college age kids that are very technical to older people with very little computer skills.  We need to see the whole range.\n\nYou do need to be able to communicate.  Most of the question we ask as you are following the script are like \"after selecting the mens shirts category, do you think it would be easy or hard to narrow the search to Red XL shirts and explain your impressions of the presentation of the products\"\n\n*I didn't mean to imply that usertesting.com didn't deserve the rate they charge.  The information we gain from real users is very valuable to us and we consider it money well spent.\n",
                            "score": 673,
                            "author": "byikes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 386,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now only 10 dollars",
                                            "score": 129,
                                            "author": "Dosier2442",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Usertesting \n\nyeah just checked it. it is only 10 dollars now..still pretty good, for 20 minutes of your life. ",
                                                    "score": 90,
                                                    "author": "Crackbreaker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 204,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I'm actually surprised they only pay $15 per test. They charge us close to $100 per tester.\n\nThats pretty much standard in service industries because people are desperate for work.  Its the guy who gets the client who getstheeward. Rarely the one doing the work.\n\nSame for landscaping.\n\nMaidservices.  You pay $100 an hour and the maid is getting minimum wage.\n\nEtc.",
                                    "score": 206,
                                    "author": "azzazaz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Am mechanic. Shop charges 150 an hour I make 17 an hour... ",
                                            "score": 154,
                                            "author": "Avoidingsnail",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Think of it this way. You're not covering the cost of rent. Materials. Insurance. Utilities, taxes marketing and risk of having no business. If you think you can do better. That's when it's serious time to open your own shop. Seriously I pay mechanics hundreds of dollars cause their technical knowledge is valuable. I don't want to be upsold garbage products and services. I pay for Labor and expertise I don't have. So there is definitely a market if you can provide it and run a independent business perhaps",
                                                    "score": 129,
                                                    "author": "Fortune_Cat",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did UserTesting to make some money while I was in high school. They're a legitimate business, and the pay is pretty reasonable. \n\nMost of the work involves you getting a list of tasks to try and accomplish on a website. You click through the tasks and record yourself talking out loud about how usable the site is. \n\nThe business's goal is to test sites for the average consumer, so there aren't really any requirements to work there. If I'm remembering right, the first one or two site reviews you do are used to evaluate whether you do a good enough job to be able to do more reviews. \n\nThe biggest downside is that it can be hard to get many websites to review, and if you don't act immediately when you get the offer, all the slots could be filled up. \n\nAll in all, not a super reliable way to make money consistently, but it can help you make a little money on the side. ",
                            "score": 1096,
                            "author": "snailtimeblender",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work over night's on the east coast front half of the week, this sounds like the perfect side job for me.",
                                    "score": 207,
                                    "author": "McLovin804",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is. I used to do UserTesting, it's pretty great. I love beta testing stuff and seeing how design decisions are made, so it was generally a very interesting gig.\n\nOne tip - leave the tab open in the background at all times. A ding noise plays when a job comes in. Go grab that job immediately. It's first come first serve, so you've gotta be quick.\n\nIf you're currently tied up with something else, grab it anyway. It gives you I think an hour for each test, so as long as you'll be able to do it in that time, just accept it.\n\nAlso, you'll get more jobs as you work and get high ratings, so if it's slow at first, keep at it. ",
                                            "score": 302,
                                            "author": "Condawg",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I tried it once, you need a mic and a camera. You speak out as you’re doing these tasks they assign you to test out on the website. For example, try to find the contact information.  \n",
                            "score": 119,
                            "author": "tewnaa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup, only downside is that the work sometimes is very slow to come by. Sometimes only a few per week :/",
                                    "score": 70,
                                    "author": "tsukaimeLoL",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But as a poor college student, I'll take $15 2-3 times a week.",
                                            "score": 75,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! I've been using usertesting for awhile and I highly recommend it. Just wanted to put in my two cents for those who are curious.\n\nThe one thing is this is not a full time (or even part time job). Realistically, you can probably make $10-40 a week, but it really depends on the available opportunities. But since most tests take 15-20 mins each and pay $10, it's worth your time.\n\nYou are notified by email when a new test is available and you have to act pretty fast when a test pops up since they close it once they have enough testers. So, this probably works best if you have a schedule that allows you to do a test at short notice. I'm a student and at home studying a lot so it works well for me.\n\nAlso, check out Validately and UserZoom, both are similar to usertesting and pay just as well.\n",
                    "score": 164,
                    "author": "psychem72",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I think I could crank this shit out for 8 hours a day all weekend.\n\nand thats exactly why you can only do it a few times a week due to how few opportunities there are",
                            "score": 280,
                            "author": "workworkwork1234"
                        },
                        {
                            "level": 2,
                            "comment": "You won't though because they aren't available in that quantity.  ",
                            "score": 30,
                            "author": "Defnotaneckbeard",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "We use usertesting to tests our designs and workflows. My piece of advice: When you apply (yes, you have to go through a casting), make sure you are as elaborate and insightful as possible, that you articulate your words and think out loud when required. Good luck",
                            "score": 50,
                            "author": "pimbolo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 798,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 177,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 140,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a side gig, I contract with assessment companies... Pearson, ETS, Measurement Inc, etc. Most of them have distributive work (what they call work at home), where you train to score an assessment and then actually score it. There are different types of tests, ranging from math to writing, and all different grade levels. Average pay is around $15/hr and for most you only need a bachelor's degree. I clear about 20-30k year doing this, in addition to my day job. The downfall is that the jobs are contract based - though they issue you a w2 as opposed to a 1099, you only work periodically through the year as the students test. So it's not steady, being seasonal and all, but it's a great cash cow when it's there. ",
            "score": 603,
            "author": "thewolfwalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 100,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try going to Rev.com. They have you transcribe audio files and interviews, and you get paid once a week directly to your PayPal. No gimmicks or tricks to it whatsoever. It does take a long time and it gets really boring, however. I still recommend trying it out though. ",
            "score": 109,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I did data entry for a year from home. Paid 13 dollars an hour and I got 30 hours a week. It was a sweet gig\n\nEDIT: Didn't know this comment would blow up. To all those inquiring, I got fairly lucky landing this job. I had a family member who worked for a company that manages low-income properties, most of which are given government subsidies to live there (Section 8 type stuff). My family member mentioned that his company needed to manually convert tenant data information from old, outdated software to a new software, and they were having trouble finding a candidate to do so. I offered.\n\n Next day, he throws my hat in the ring, and they hire me immediately, without even interviewing me. All they wanted to know was how fast I could type, as they needed to convert the data before the February of next year. I started in February by working at the office which was located about a half hour from me, but after about 2 weeks, they realized there was no reason to keep me in the office, since all I did was sit alone and key in information all day. I only had to learn to calculate basic things such as the subsidy rate for each tenant and how to classify them in the new software. I entered their SSN's, ethnicities, income, etc. \n\nThe way they tracked my hours was a little odd, though. They couldn't monitor, say, my screen, and know if I was actually working. All they could tell is if I was logged into the new software, and would take my hours directly from that. I could have easily taken advantage of that in order to get a crazy amount of money while sitting idle, but they gave me a really nice job, especially for a kid still in high school, and I respected the company my family member works for. I also wouldn't want to damage his reputation by being dishonest. After awhile, I got good at spacing out the work I was doing, and I would type as quickly and accurately as possible. Unfortunately, I knew this job had an expiration date. \n\nAfter I successfully completed the data entry job I was hired to do, I was able to get another job doing data entry through a temp agency, which is what I recommend to all of you. Although that job did not work out quite as well as my first one, it was still good pay and not difficult work. For anyone that is interested in a job doing data entry, try searching for \"data entry\" in both local job website searches AND in cities that you do not live near, and look to see if they have an option to telecommute! Additionally, temp agencies will most likely be more willing to hire you for data entry if you have at least some experience doing data entry or, apparently, if you can type very quickly! \n\nAnother option I have experience with is Rev.com. All you do is apply online to transcribe audio for them, and they will pay you $1 per audio minute if you are accepted. Good luck to you all!\n\nEDIT 2: I completely forgot to add this! I personally do not have experience with user testing, but I have friends who have had tremendous success making extra money doing this. I'd try usertesting.com for starters!",
            "score": 2680,
            "author": "jonesryan98",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd love info on this if you'd like to share",
                    "score": 414,
                    "author": "priv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just Google remote data entry or remote csr job (customer service rep).\n\nLots of companies hire remote phone support employees. Amazon, dell, most major retail places, etc. ",
                            "score": 615,
                            "author": "sovnade",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll throw Apple in there. A friend from my CSR days who has several years in that gig went to Apple. They sent him a new Mac, iPhone, and iPad, on top of paying for his gym membership and giving him soft hours. (As long as he worked a core part of his overnight shift, he could log in/out hours before or after, so long as he didn't get overtime without approval and didn't fall below the required hours.",
                                    "score": 287,
                                    "author": "WsThrowAwayHandle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think I got offered this job by Apple about 4 years ago. International sales, remote, overnight, inbound, and $22/hr they were willing to pay. Not bad if you're ok with being on the phone. ",
                                            "score": 178,
                                            "author": "cabritero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Family members husband did this while he was in college.  I don't remember what the exact terms were, but he'd basically lock himself in their spare bed room for 12 hours a day (to keep their kid out) a few days a week and got in all the hours he needed for the week in a few days.  ",
                                                    "score": 77,
                                                    "author": "admlshake"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Even better, just go to a third world country with good internet connection and make sure when it’s night in the US it’s daytime over there. You get really good money for that country AND you get to work normal hours.",
                                                    "score": 165,
                                                    "author": "ElPlatanoDelBronx",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you PM me with more details regarding this data entry?",
                    "score": 212,
                    "author": "fight0fffyourdemons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My friend worked for Amazon customer support from home.  All you need is a laptop and a mic. They pay around $12.00 an hour ",
                            "score": 320,
                            "author": "_s7_f7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 232,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And if you order in the next 4 hrs 5 minutes, it will be here on Tuesday. ",
                                            "score": 274,
                                            "author": "magicbeanspecial",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "AMAZON! My wife does it and LOVES it. She has been a great employee and is now able to set her own hours. She works when she wants. Hour there, hour here, totaling 40 hours a week. Makes great money and has never had to leave the house for work. She works for our spending extra money. Highly recommend it.\n\nThey give you training from home online. Provide you with the mic and headset. There is a team that helps you if you have questions and there is a employee helpline that the employees can call if they can't figure something out. \n\nEmployee discounts on everything. She works mainly with returns and shopping help. Super easy. Trust me she is NOT a computer wiz. \n\nMore Info: My wife had ZERO experience. They gave her all the training online, took about a week. You log into their servers and their systems online through a VPN (Virtual Private Network). You have coaches that help you, a virtual library to lookup customer problems and resolutions. \n\nThe system is VERY automated. You click what customers says, it tells you what to do. Amazon is VERY customer driven so it wants you to make the customer happy. Very easy system to use. If you can't figure out a solution you give the call to a tier 2 person or a supervisor. \n\nI promise if you can get a job here you will keep it. \n\nhttps://www.amazon.jobs/en/locations/virtual-locations\n\n\nEdit: More Info. ",
            "score": 437,
            "author": "Nuclearman83",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can someone do this outside of the US? ",
                    "score": 50,
                    "author": "bikesboozeandbacon"
                },
                {
                    "level": 1,
                    "comment": "https://www.amazon.jobs/location/virtual-locations?base_query=&amp;loc_query=&amp;job_count=10&amp;result_limit=10&amp;sort=relevant&amp;location%5B%5D=virtual-locations&amp;cache\n\nSorry for the url.  Hopefully this works for you guys. ",
                    "score": 55,
                    "author": "buddomatic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a minute take/report writer for a government agency. I had zero experience. And I mean zero. It's the kind job that requires you to be able to deal with mind numbing boredom. The plus side is I can work from anywhere I want whenever I want. I just get the audio files of the meeting sent to me and I'm golden. I only go to the meetings if the audio is not being recorded. It's a well paying job, but it's not for everyone. ",
            "score": 899,
            "author": "Tatsel24",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have lots of questions. Please give lots of details.",
                    "score": 97,
                    "author": "geoffsykes"
                },
                {
                    "level": 1,
                    "comment": "How did you get into this?",
                    "score": 161,
                    "author": "goodgoodthings",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it is for the federal government, it is probably through Ubiqus since they have the GSA contract.\nhttps://www.ubiqus.com/contact-us/jobs/faq/",
                            "score": 156,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "That's a long and complex story! I'll cut it down. Met a woman, now my wife, stbx wife. I had a very solid government job, 30 year contract, pension etc. She couldn't hold a job down, kept finding faults etc (I think she has underlining, unresolved issues due to having an unstable, unsettled up bringing). So she applied for a job with an EU agency, in Europe. This agency was based in a different country and she had it in her mind that if she got it, we were moving. She got it, we moved. I gave up my job to help her follow her dream. My qualifications were mainly in security and law enforcement. I didn't speak the language and found it difficult to find a job. My wife told me that they might be looking for report writers at her office. Not a job I was excited about, but money is money. \n\nI applied and honestly, as I have a native level of English I was hired. You see all the meetings take place with multiple different languages bring spoken and the official language is English and all reports must be submitted in business English. It really is a pain in the ass, even for a native English speaker. This job is extremely stressful with tight deadlines and boring. Now when I say boring, the initial meetings are very interesting as some of them are concerning blockchain technology, enforcement and education while others are just about finance, budgets and the like. It's after the meetings is when things get boring.\n\nI will spend entire work days (8hrs) with a pair of headphones on listening and re-listening to the same meeting over and over. It really is mind numbing. When I leave at the end of the day, I don't want to hear another human speak. I just want to get home and walk my dogs. This process will go on for days depending on the meeting/event. Headaches are part and parcel of your daily life (the amount of focus and concentration required is immense). \n\nOn the plus side, if you can figure out a way to make it \"work\" for you, it can be ok. I work from home more than from the office. If you work from home, you MUST be disciplined. You cannot be distracted easily. If you are, you will not get the work done and you will fired. You should plan for the future as this really is not a job someone should do for more than a few years, if that. There is no thanks or appreciation and while that doesn't bother me, I've seen it effect some people terribly. You will be expected to perform miracles. I was asked 9 minutes after a meeting ended if I had the report ready. It was a report that would take a week!! I got it done in a day. The real plus for a lot of people is that not many people are willing to do this job so you can get paid well a and even better if you are a freelancer. I am employed with a company now but will be going freelance in January. It will treble my income, but in the flip side, if I ain't working, I won't be getting paid so it's a calculated risk. \n\nIf you are young (20's) I would highly recommend this job to you. You will gain extremely useful skills, discipline, focus, and time management. If you are able to do this job in a field that interests you, go for it as you will have access to inform and material that your fellow students don't, not even your professor. In my situation, all my work is considered as having historical reliance meaning that all my work is entered into the archives of the EU. That's a nice thought. \n\nIf you want to apply for such a role, hit up every company, business or institution that interests you. They all need report writers/minute takers and we are hard to find.\n\nMy typing speed is faster than it was a year ago, but still not where I want it to be, I do tend to rely on the audio. I have colleagues who can tie in real time, and are not stenographers. It's crazy to watch them.\n\nI am based in Europe and not the USA. Although I do know some people who freelance for companies in the USA and it seems to be much easier to get reports done for them as they (zero offence meant by this) don't have as high standards as my European overlords.\n\nIf you can manage your time and workload efficiently, stay focused and deliver high quality reports on time, you will build a reputation very quickly.\n\nAny other questions?\n\nEdit: RIP inbox. Apologies for not getting back to you all sooner, I'm living in Europe and was asleep when the questions came in.\n\nEdit 2: If you feel i have left anything out, it have further questions, please feel free to ask me either here, or through DM. I hope I helped someone in some way. ",
                            "score": 36,
                            "author": "Tatsel24",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yo, this comment is not really helpful to people if you do not offer **how** you get a job like this.",
                    "score": 226,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How do you get started in this? It sounds like something I'd fit into easily",
                    "score": 62,
                    "author": "CapnCanfield",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 328,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can teach a language. Regardless of your native language, somebody, somewhere will pay you for a Skype language lesson. The ones I came across when trying to learn German remotely were from $10/hr and not 1 on 1, so perhaps a virtual classroom of 3-5 people, fixed time per week. Basic conversational skills and simple language trades from $5/hr, but if you have a TESOL certificate, $20/hr + is the going rate in EU.",
            "score": 423,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where are these advertised? ",
                    "score": 59,
                    "author": "onmyphoneagain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "preply.com, italki.com are two I looked at. You can sign up for lessons or sign up as a teacher. If you want to teach English and have a TESOL certificate, part of your TESOL course is how to setup a lesson plan and grade students, so you should be able to charge more and have better control of what you are doing. Having said that, if you have a TESOL cert and are under 30, you would be better off going to south east Asia on a youth travel visa to teach kids of wealthy Asian people English.\n\nI am in Germany, there are classified services, similar to Craiglist, that have people looking for English teachers for their German kids. It's relatively easy to pickup a gig, casual to help somebodies kid get ready for an exam or just help out, in some parts of Germany, English is not taught as second language in schools, so the teens go to university and struggle a bit if they choose a degree that requires it, such as software development or engineering - sure, you don'T have to speak English for that, but consider how many manuals and online material are in English.\n\nI have come across people advertising 'dialogue sessions' before: you basically have a Skype pen pal that chats with you in a language of your choosing and pay them $5/hr. Just everyday conversation and some help with pronunciation and grammar.",
                            "score": 87,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you type well?\n\nThere's tons of transcription work available online. Things like insurance interviews, subtitles things of that nature.\n\nMturk.com has a lot of cheap requested.\n\nI think crowdsurf.com\nCan net you a solid $11/hr once you get into it.\n\n\nEdit: huge opportunities if you're bilingual. I think Spanish and Chinese were the big ones..\n\nUnfortunately my Spanish left me without a tres\n ",
            "score": 479,
            "author": "Carlina1989",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 42,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i work for crowdsurfwork.com and I'm pretty sure that's what they meant",
                            "score": 35,
                            "author": "Lill-e",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Crowdsurf can possibly net you $11/hr on the higher levels (more realistically $5-9)  but you're mostly only getting paid while your fingers are moving, so it's a different kind of grind than most are used to. I haven't worked for them in probably a year but work was also extremely scarce on there between big clients. That said, it's definitely the best crowd sourced transcription platform I've used.",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shit tons of them, yes. Some of the better ones are essentially call-center jobs you work from your home desk. (Both phone and chat support) check out arise.com and places like it. \n\nTo be clear, this makes you a 1099 contractor, not an employee. This means you are not paid for training, and in most cases have to pay to take the class. You have to do all your own taxes. You have to pay for your own equipment and phone line ECT ECT.\nIt also means you get to set your own hours based upon 15-minute intervals, so you can work 1 hour on 1 hour off all day, or whatever you want, so long as the company has enough people covering the shift.\n\nThe work will usually be for companies like AAA, various cruise lines, Orkan, various apps, Disney vacations, ATT ECT. You pick who you work for, sign up for a contract (6-mo, 1 year ect) finish your training and then start picking up hours.",
            "score": 537,
            "author": "HikerKy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not all work at home call center jobs are contracted. Apple, Amazon both hire at-home CSRs directly, off the top of my head. Support.com hires at home tech support.",
                    "score": 176,
                    "author": "raeex34",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Clickable link:\nhttp://arise.com",
                    "score": 71,
                    "author": "FixUrlBot",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I make hundreds of dollars each month designing t-shirts to sell on amazon. Amazon does the selling, i just do the designs. Takes zero ability, the day i started was my first time using photoshop.",
            "score": 520,
            "author": "Threash78",
            "replies": [
                {
                    "level": 1,
                    "comment": "Checked it out, but they don't approve everyone.  In fact, I bet they hardly approve anyone anymore based on the wording.  You are very lucky.",
                    "score": 240,
                    "author": "Adam_Nox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They approve everyone... eventually. That is really the one drawback, it takes months before you get approved sometimes. Some people report as fast as a few weeks wait only though, for me it took about eight months.",
                            "score": 164,
                            "author": "Threash78",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've been waiting over a year to be approved. ",
                                    "score": 86,
                                    "author": "shadow8449",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Took me roughly a year to get approved.",
                                            "score": 32,
                                            "author": "zephan05"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I made $0 on my first shirt there and I actually put effort into my designs and draw them myself. D: How do you actually get people to buy your stuff?",
                    "score": 83,
                    "author": "tinylittleparty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "basically just throwing things at the wall until something sticks. My first shirt made zero sales also, ditto second third fourth fifth. But eventually you get a seller, and after a few sales they give you more slots, and the more slots you have the more things you can throw at the wall. My first month (may) i made 12 bucks, june 17, july 70 something, august almost 400, september almost 600. October November and December are all likely going to be more than that, though i expect a crash for the new year. ",
                            "score": 141,
                            "author": "Threash78",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you lose the rights to your t-shirt designs?",
                                    "score": 41,
                                    "author": "AreWe_TheBaddies",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have some artistic skills, and I've put a lot of effort into most of the shirts I have on Amazon (tier 25). I've had slow to no sales of the shirts, but I've actually tiered up once, and I have heard just to stick it out and keep uploading and it pays off in the long run. I'm in my 3rd month. I've seen shirts similar to mine sell, but I spend more time on my shirts than perhaps I should. I use GIMP as my image program and I love it, so it really hasn't broken the bank to get started... I used the free GIMP program, a $100 pawn-shop laptop and (when I started) used the free library WIFI to upload the finished designs. I'm not trying to sound like a success story, but I do think this venture will pay off in the long haul.",
                    "score": 24,
                    "author": "mad_gasser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having some actual artistic skill is a huge leg up on the competition. Learning how to use your titles and bullet points to fit in important keywords is the next step. The best I can describe it is that it snowballs. As you tier up and replace non selling shirts with selling ones your earnings just shoot up.",
                            "score": 21,
                            "author": "Threash78"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, I've worked from home exclusively for 4 years now.\n\nThe best place to find a work from home job is, by far, flexjobs.com. There is a fee, but this is how I found two jobs (the first one was bought out) and how my fiance also found his stay at home job.\n\nHe works for an ISP and I work in server technical support. Knowing a second language will help a lot.\n\nAdditionally, put \"remote work\" on your resumes and cover letters. Don't call it \"work from home\" or \"stay at home.\" That's a bit too casual.\n\nMany of the jobs are freelance, but don't let that discourage you. Both of our jobs come with insurance, 401K, the whole shebang. Remember to look up where the job is based out of and understand your state's unemployment laws as well as the state that it is based out of.",
            "score": 240,
            "author": "rdmhat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah, there are lots of work-from-home jobs that aren't scams. What I've done, personally, is ghost writing, tattoo designs, ads quality rating for google (the application process is pretty slow, but they pay well, competitively - or did 4 or 5ish years ago - and the work is consistent), tagging advertisements for a search engine, and content research.  Currently, I license artwork to various companies. \n\n\nIn terms of pay, tagging ads paid the least (about $8 per hour. Its brainless, repetitive work, so prob makes sense that it doesnt pay as well). Licensing artwork and fonts pays the best (it's passove income. I have no idea how it breaks down hourly because I'm positively terrible about tracking that sort of thing).  \n\n\nActually, ghost writing probably paid least when you factor in the time spent finding work, which unfortunately I did not track. I did that years ago, so I dont remember exactly, but finding work took effort. \n\n\nOverall, working from home is the same as working in the real world. You provide a skill or service and are compensated. If theres an offer for a job that seems too good to be true, it is. If there's an expectation that you'll pay upfront for something required (training, supplies, products, whatever), then I would walk away. Fast. \n\n\nAlso, the application process should be similar. Anything you just sign up for is either a scam, or doesn't pay well. You should be sending them a resume (or writing samples/portfolio) and they should be sending you a contract. Sometines there is a trial or probation period, but you should be paid for your work. Dont work on spec (doing work for free in hopes of being awarded the job). ",
            "score": 679,
            "author": "iamasecretthrowaway",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you elaborate more on the google jobs? Sounds like something I would be interested in. ",
                    "score": 126,
                    "author": "jesskarae",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure thing. The info might be outdated, but google search \"ads quality rater\" and you can find more up to date info. Google contracts a bunch of people to rate their advertisements abd weed out porn. I applied and got accepted, like, 3-6 months later. It took so long that I forgot I had even applied. If I remember correctly, you do some training and tests, and then sign a huge contract and NDA.  You contract for a year (I think the minimum requirement was 10 hours per week, but you can request time off of up to a month), and then you have to not work for a certain amount of time (maybe 9 months or a year), and then you can do anothet year long contract. At the time, there was a lot of demand for US workers who spoke second languages fluently or who had lived abroad for a long time, so they can rate for, like, South American ads. \n\n\nBut dont lie a out it. You definitely need to be very familiar with what youre rating. Overall, I enjoyed it. It wasnt time consuming and you can work whenever you have a spare hour or two. And I liked debating things with the other raters. I think it paid $15/hour. And even though it was contract, I'm pretty sure they withheld taxes. ",
                            "score": 268,
                            "author": "iamasecretthrowaway",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you talking about debating just usual stuff like you would with anyone? Or debating about whether or not a borderline ad was porn or not?",
                                    "score": 22,
                                    "author": "Bpefiz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was always either debating if stuff was too adult (google errs on the side of caution with advertising) or how relevant it was to what the user was searching for. Like, how applicable. ",
                                            "score": 46,
                                            "author": "iamasecretthrowaway"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I currently do ad quality rating through Appen Global. $10/hr",
                            "score": 52,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think there are but the important factor is where you’re seeing them advertised.\n\nA company that needs at-home part-time employees doesn’t need to advertise on Facebook or yard signs along the road.\n\nSo, if you see a company spending a bunch of money advertising part-time at-home work, you’re the customer, not the potential employee.",
            "score": 60,
            "author": "Zezu"
        },
        {
            "level": 0,
            "comment": "If you're interested in doing transcription at home on your own schedule, and live in the US, you could apply at 3Play Media, Inc.\n\nSome profiles of current contractors: http://www.3playmedia.com/company/our-transcript-editors/  \n\nLink to English transcription description (the application link is at the bottom):\nhttp://www.3playmedia.com/company/jobs/transcript-editor/\n\n(If you are fluent in Spanish and want to transcribe Spanish language clips, particularly sports clips, you can go through this link http://www.3playmedia.com/company/jobs/spanish-transcript-editor/)",
            "score": 359,
            "author": "3PlayCR",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is the pay doing this? Anyone used this before?",
                    "score": 20,
                    "author": "Lolidc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My brother did work for Lionbridge from home for a while https://www.lionbridge.com/en-us/careers They sent him paychecks and everything. Most of what he was specifically doing was mindless repetitive data entry to upgrade search accuracy on Bing and similar things. You would get an interface in the company web page and then either have to select different options, or type in descriptions. Basically think Captcha but on a more technical scale. It paid more than minimum wage.\n\nEdit: a few people have messaged me saying they have had bad experiences with Lionbridge.  All I have to go on is my Brothers first hand accounts for that, and he had a decent time of it, though he claims it was very boring. Anyways, proceed with caution, your milage may vary, etc. \n\nI used to be a paid forum administrator for Allakazam.com and later Zam.com back before they imploded. That was an extra couple hundred a month. ",
            "score": 161,
            "author": "piercet_3dPrint",
            "replies": [
                {
                    "level": 1,
                    "comment": "Allakazam... now there's a name I haven't heard in a long time...",
                    "score": 24,
                    "author": "Thrabalen",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My regular job as a lawyer lets me work from home. I've been doing document review, which is seen as bottom rung work, but holy hell does it pay well and gives me incredible work-life balance. \n\nI also do a lot of freelance writing. Pretty much every paper and online magazine takes pitches, and the more you write for them, the more likely they are to run your stuff. \n\nAs a general breakdown: op-eds pay $200-400, straight news/analysis/general interest pays $400-600, and travel pieces pay $400-800. I tend to do shorter pieces, so longer ones would probably pay more. $0.55-1.25/word is probably the range one can expect. \n\nEdit: of course, some publications don't pay...Forbes, for instance, doesn't pay for op-eds. ",
            "score": 568,
            "author": "burgerthrow1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a lawyer.  Any particular place you would recommend to look for document review work?",
                    "score": 144,
                    "author": "DirtyBurgerPhill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\nDeloitte and Epiq Systems are two big ones in the US. A lot of firms also hire in-house \"e-discovery counsel\". \n\nIt's actually better in Canada...higher pay due to fewer lawyers. ",
                            "score": 159,
                            "author": "burgerthrow1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Start your own blog and call it \"Burger Bros Op Eds\"",
                                    "score": 81,
                                    "author": "SitrukSemaj",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I want to be a lawyer, but I heard a lot of people aren’t happy with their choice of becoming a lawyer and work long stressful hours, how do you feel about it if you don’t mind me asking?",
                    "score": 80,
                    "author": "irishman78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\nCommon feeling among the lawyers I know and is something I've tried to avoid. \n\nDocument review/e-discovery work is good in that regard. The default is 40 hours/week, although we can do far more if we want, and it's extremely low stress. \n\nI guess it depends on whether you see being a lawyer as a passion, or just a job. For me, I'll take e-discovery work any day and make some stress-free money that way. ",
                            "score": 68,
                            "author": "burgerthrow1",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I am also a lawyer. Look up employment rates in your state. It's pretty dismal for the cost of obtaining your degree and passing the Bar. ",
                            "score": 106,
                            "author": "Gingeysaurusrex",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Also a lawyer here. I don't work long and stressful hours, but the ones who work long and stressful hours make more money. There are many different types of lawyers. Do you want to litigate or do transactional? Do you want to do corporate or public interest? The pay and work hours vary greatly from field to field. Law school is also expensive, so you might want to look up the average pay in your area and see if it's worth it.",
                            "score": 31,
                            "author": "immalilpig"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 104,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just started doing the same a few months ago.  I don't really have any teaching experience, but I cited some time working as a camp counselor, and leading study groups in college, and that was good enough.  It's $19/hour for me.  I usually teach 7am to 10am (EST), with a half hour break in there, 5 days a week.  It's enough for about $900/month for me.",
                    "score": 39,
                    "author": "sudifirjfhfjvicodke",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Companies like Amazon and U-Haul offer “moonlighting” positions where you work for their customer service department from home. Only thing they require are fast internet speeds, wired connections, and a simple headset. ",
            "score": 51,
            "author": "justintbh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Photo editing. I outsource most of my work at the rate of $1 an image. I usually send about 100-150 images out a day. ",
            "score": 53,
            "author": "TheRadiantOpalLLama",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The trick to avoid scams when looking for opportunities is that you should NEVER have to pay to get a legitimate job. Jobs pay YOU, not the other way around.",
            "score": 55,
            "author": "John_Fx"
        },
        {
            "level": 0,
            "comment": "I can't believe no one has mentioned this yet. Amazon hires customer support chatters to work from home. They post this several times a year, so be on the lookout. Pay is pretty decent and working for Amazon is good for your resume.\n\nAlso look in your area on indeed for law enforcement transcriptionists. I've seen it a lot lately. You'd be transcribing body cam and body mic material for court cases.",
            "score": 210,
            "author": "electricgrapes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Online tutoring.\n\nCheck out the mobile tutoring app Yup if you have solid content knowledge in either math, physics or chemistry. They hire worldwide and don’t require previous teaching experience.",
            "score": 48,
            "author": "kitschin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I worked as an Appen Social Media Evaluator for a 6-week contract position. Paid better than any jobs I've ever had even though it was a 1099 and they didn't automatically deduct any amounts from your paycheck but instead paid you your full hourly amount.\n\nNot as luxurious as everyone makes it out to be. I type around 90-100 WPM and I barely ever met their work speed requirements. Quite demanding and you do have to have an active social media account. But it's work from home!",
            "score": 89,
            "author": "WhenTimeFalls",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I know this is late...but mystery shopping is a good way to get some extra cash and get food or other items for free.\n\nCompanies (usually through MS agencies) reimburse specific expenses and pay you a fee to go to their stores and restaurants and perform tasks or just judge overall quality. It can be really fun if you're good at it. They even have hotel/casino visits, movies, fine dining, etc.\n\nYou have to be a good writer and have good attention to detail (times, names, descriptions, etc.)\n\n",
            "score": 42,
            "author": "TheDimwit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I've been doing work at home customer service for 7+ years. Many companies abuse you and if you complain they just kick you to the curb since there are hundreds waiting on positions to open up. I'm with Amazon now, and have been over a year. Everyone starts as seasonal, no matter the time of year, but if you kick ass you get hired. I actually feel respected and valued for what I bring to the table. Plus, we aren't forced to get on and off calls. We can take our time and do it right the first time.  \nThere are some good companies that contract with other companies like Sutherland, Convergys, LiveOps, but beware that they pay for call volume and productivity. I was a rep for DirecTv through one of those kinds of places and they had zero ethics.  \n1800Flowers has several sub companies  (Cheryls Cookies, Fannie May, Baskets.com) and are always hiring.  \nCheck out RatRaceRebellion.com for a good list of companies actively hiring. You want to avoid any that want you to train for free, pay minute rates instead of hourly, and make you shell out big bucks for upfront \"training and hiring\" costs. ",
            "score": 36,
            "author": "purplehairedpagan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have a full time job (typically 40 hr work week), and I do flipping on eBay on the side. The hardest part is determining from your local resources what you can flip. I'm in the retail arbitrage game, and source everything from once store so it's pretty easy. I spend 4-5 hours a week on average, and have $30,000 in sales the past 8 months. A little over half of that is profit (before taxes). This is my first year trying this, and I'm thinking of scaling up to see how far I can take it.\n\nIf you want to learn more, r/flipping is a great place to start.",
            "score": 303,
            "author": "LeBronJameson",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  retail arbitrage game, and source everything from once store so it's pretty easy.\n\nWhat kind of items do you sell on ebay?",
                    "score": 72,
                    "author": "leeringHobbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mostly men's clothing that I buy at outlets malls. You still have to know what to look for and know what sells. But once you get the hang of it, it's a lot less effort than flipping stuff from goodwill or garage sales (but people have a lot of success with that too).",
                            "score": 26,
                            "author": "LeBronJameson",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That's the secret, finding your niche",
                            "score": 39,
                            "author": "fatwoof",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And that's the story about by humble beginnings as one of the most powerful and ruthless arms dealers in the world",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How can this possibly work?\n\nWhenever I search something on Ebay, I see dozens of results, many of them at ridiculous low prices.  Presumably your price is not one of those since you have to cover your costs, and unlike a lot of these other ones, you probably will ship the actual item and you are domestic and you aren't using fake photos, etc.  So how do you overcome not having one of the low prices?\n\nSecond, doesn't Ebay have crushing fees and commissions that eat your margin? \n\nLastly, doesn't Ebay also have a customer-first policy where someone can claim they didnt receive or didnt like your item and then they just withhold your payment?\n",
                    "score": 30,
                    "author": "Chexxout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I sell on eBay full-time so I can answer a few of these =). \n\n&gt;So how do you overcome not having one of the low prices?\n\nBy sourcing at even lower prices. It really depends what you're selling though. For instance, clothing from some brands can sell on eBay used for $30-$40, but can be picked up at many Goodwills for $5. You'd be surprised what all can be found at yard sales or on Craigslist (calculators, iPod's, gaming consoles, etc). \n\n&gt;Second, doesn't Ebay have crushing fees and commissions that eat your margin?\n\nFees generally make up for around 13% of the total sale price. It's trended upwards since eBay first began, but still leaves a lot of room to make a profit unless you're operating on extremely thin profit margins. \n\n&gt;Lastly, doesn't Ebay also have a customer-first policy where someone can claim they didnt receive or didnt like your item and then they just withhold your payment?\n\nIf a buyer claims they didn't receive the item it will come down to the tracking information. If tracking shows it was delivered, it's up to the buyer to take it up with the post office and eBay will side with the seller. If the item is lost in transit, then the seller generally has to cover it. The seller can try to protect themselves with shipping insurance through USPS, but it's not usually worth it. If a buyer claims the item is defective, etc., they can get a refund only after it's been delivered back to the seller.\n\n",
                            "score": 28,
                            "author": "TheShadowAt",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is like buying something at a thrift store or a TJ Maxx and selling it for more on eBay? I occasionally see some great deals on kitchen stuff at tj maxx/Ross ",
                    "score": 61,
                    "author": "WayneKrane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do this to a much smaller degree than the above poster. I buy large lots and break them down to smaller auctions. Toys is where it's at, Lego especially. When Funci* drops new stuff, I try to jump on that and flip it fast. Also buy up non-perishable post-holiday clearance stuff from brick-&amp;-mortar and sit on it for 11 months. Halloween &amp; Christmas stuff for little kids is gold.\nEDIT: *Funko, friggin autocorrect",
                            "score": 92,
                            "author": "panacrane37",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "this is why i cant get my lego saturn v set still",
                                    "score": 42,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Medical transcription.. friend got her certificate to do it in a few months and she makes 65 cents per line and most of it, besides the personal detail and diagnoses, is just copy and pasted as most doctors appointments have the same base routine. It's easy to get certified in, mostly your own hours/work choices, and not very stressful st all. ",
            "score": 190,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except most transcription jobs are being eliminated by software that does this now. ",
                    "score": 106,
                    "author": "thebestestbestieeva",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Can you tell me how she got her certificate?",
                    "score": 17,
                    "author": "retrocomedyfan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I live in Indiana so it may differ from you. But she took the courses at Indiana Weseyan University online, passed her course(s) and certification test, then was able to work. Just google how to get certified/degree in your state and I'm sure you'll find it easily. ",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " I’m overseas right now and can’t work for a real company bc of my visa. I work full time however for a Chinese founded company that hires Americans to reach English to Chinese children online. I set my own hours and I absolutely love it and make $20/hr.  ",
            "score": 65,
            "author": "needadvice5446",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who do you work for?\n",
                    "score": 18,
                    "author": "ToolPackinMama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most likely DadaABC. Requires a bachelor's degree, and being a native English speaker. Hours are 6-9pm Beijing time. ",
                            "score": 29,
                            "author": "FantsE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stitchfix remote stylist. But you would need to most likely be a woman and have a good sense of style. 15 hrs a week $15/hr",
            "score": 115,
            "author": "Ecanem",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds like a GREAT job, but they don't hire in my area. :(",
                    "score": 19,
                    "author": "tinylittleparty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "transcription info https://www.reddit.com/r/AskReddit/comments/70erwe/serious_what_are_the_best_jobs_for_people_who/dn2xxmo/",
            "score": 35,
            "author": "743389"
        },
        {
            "level": 0,
            "comment": "I had a virtual assistant who lives someplace in bumfuck Kansas but who kept my paperwork in amazing shape.\n\nDamn, I should figure out how to hire a new one.",
            "score": 77,
            "author": "Tyr_Tyr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, I live in bumfuck, KS and am a certified Executive Assistant... hire me! Lol (seriously tho)",
                    "score": 53,
                    "author": "MrsN33dful",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try part time positions for editing/ writing . There are some online companies that pay per resume or student paper edited, based on your country.  Legit. I worked full time for similar services (but those better paying full time sites require high level testing) ",
            "score": 56,
            "author": "yo_cestbon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I got my gas safety qualifications, now semi retired, I can make a 100 quid in one visit, just pick well off people who want it done properly and someone they can trust in their house.\nOverheads are 100 a year plus a combustion analyser maintenance.",
                    "score": 22,
                    "author": "monkeypowah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're willing to sell your soul to the internet-devil, you can make $100 per 'article' making clickbait-style lists of 'facts' (aka snippets of knowledge that people might not know, explained in chewable fashion). Sites like Listverse make quite some money with shit like that, and if you get good at it you can easily make $500 in a week (1 article per day 5 days per week). \nThe only skills required are basic writing and researching skills (aka howtogoogle). \nIt's just that it's sorta painful to be feeding the clickbait hype. \n\nIf you're looking to do something online part-time for a longer period of time, I recommend specializing in a tech-related skill. You'll be able to write blogs or function as a consultant pretty easily.",
            "score": 57,
            "author": "Fantasy_masterMC",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 54,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just saw your edit and wanted to add one more comment for you to read.\n\nAlso, possibly more importantly but unlikely so, thanks for asking this. I'm sure there are tons of people who will be using some of these ideas. I know I will be",
            "score": 25,
            "author": "legalthrowawaySC"
        },
        {
            "level": 0,
            "comment": "If you like dogs, rover.com",
            "score": 83,
            "author": "Spongy_and_Bruised",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be careful with the competitor, wag.com. I was gonna work for them until I got to the very last step and found out they have a $25 on boarding fee. Any job you have to pay for to work there....not something I'm trying to get tangled up in.",
                    "score": 118,
                    "author": "_CoachMcGuirk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Never heard of wag. Rover has been excellent no complaints.",
                            "score": 28,
                            "author": "Spongy_and_Bruised",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, just a word of caution for anyone searching who thinks \"Hey, I'll apply to wag also(/instead)\".\n\nI was a bit pissed to put the amount of time I did into applying only to find out about that $25 fee.",
                                    "score": 30,
                                    "author": "_CoachMcGuirk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Replying to this on the top level so that you see it OP, but TextBroker is a place you can start off writing right away making more than minimum wage with no weird, shady stuff.",
            "score": 20,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A friend of mine mad decent money by going to peoples houses and serving papers. She made about an extra 300 a week. For a little driving and knocking on doors ",
            "score": 21,
            "author": "02grimreaper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like legal papers? Is that safe? It kinda sounds like you'd have a good chance of running into some angry people.",
                    "score": 23,
                    "author": "thekillerdonut",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can do medical billing. That's what my wife does. Pays just as much as a normal job, but it's done at home. ",
            "score": 18,
            "author": "Flablessguy"
        },
        {
            "level": 0,
            "comment": "Yes.  Get your Comp TIA A+ certification and you can work in your underwear on your couch doing tier one level tech support on your couch to your heart's content.",
            "score": 18,
            "author": "wxwatcher",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I found several work from home jobs from these two articles that list TONS of work from home jobs. Hope this helps. \n\nGeneral work from home non-phone jobs: https://realwaystoearnmoneyonline.com/work-from-home-jobs-non-phone/ \n\nEducation related work from home: https://realwaystoearnmoneyonline.com/money-earning-directory/education/\n\nMore work from home categories: https://realwaystoearnmoneyonline.com/money-earning-directory/",
            "score": 82,
            "author": "Britt121",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Isn’t there an amazon run area on their website that has short term small data entry type jobs that people can do? I think I saw it in r/beermoney. I’m actually interested in that as well",
            "score": 149,
            "author": "Spacebar_Spacebar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mturk is an ok way to make 2-10 an hour. It varies wildly and depends a lot on your tolerance for mind numbing work and ability to use appropriate tools and scripts.  \n\n\nThe signup process is super fickle as well.  Some people get denied and then approved months later for no reason.  ",
                    "score": 80,
                    "author": "Colin__Mockery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I signed up in 2012, got declined for (as far as I could work out) no reason, and then got a random email from Amazon saying they’d reconsidered a few weeks ago, more than 5 years after my original application.",
                            "score": 47,
                            "author": "existentialistdoge",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could try usertesting.com\nI made a bit of money from it when I was in University",
            "score": 18,
            "author": "sunamic",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My grandmother works from home as customer service chat for lands end, makes her a good bit of money. The discount doesn't hurt either.",
            "score": 48,
            "author": "pcnoob2002",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you have a college degree or are at least a college sophomore, you could look at online tutoring. Tutor.com is really flexible (you don't even have to schedule your hours if you don't want to) but you can't schedule very many hours each week.",
            "score": 18,
            "author": "4theloveofthegame",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I once had a weekend job working from home for a social media agency. I monitored their clients’ Twitter accounts and replied to any questions or complaints that people had. It was well paid and good experience for someone who wants a career in communications, marketing or public relations.",
            "score": 35,
            "author": "PearPeachPlum",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Don't listen to the people who tell you to work on upwork or other such \"freelance\" sites. It's oversaturated so you won't get jobs as a newbie and the pay is miserable. Try learning skills that you can pitch to local businesses and individuals like web design, graphics design, social media management etc. that way you get a flexible ish job and you get paid like a human being. ",
            "score": 144,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends. Starting out freelancing is a painful process, but you need to prove why the good paying clients should hire you. I went from $1/article to $20/article in three weeks doing blog writing, so it's definitely doable. But yeah, you have to be okay with throwing 40 or so hours into the system. I didn't mind it that much because I didn't know what I was doing anyway, so I thought of it as paid training. \nEdit: a word",
                    "score": 51,
                    "author": "rickyharline",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look into freelance copywriting. Copywriting is a pretty high-paying job as you are basically selling stuff through the words you write, and every business needs more sales. You can choose to do it with offline clients or through online sites like Upwork (I currently use Upwork and charge $75 an hour, but will be looking to expand offline soon in addition to raising my rate). \n\nUpwork only sucks if you are low-skilled and/or don't know anything about positioning. A great resource to check out is freelancetowin.com.\n\nSucks that the vast majority of people don't realize they have better options than the traditional routes society crams down our throats...but I digress.",
            "score": 50,
            "author": "FullAutoDeath",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Personally, it sucks ass but look into buying and reselling.\n\nI've been doing it and you can make a lot of money or a little money depending on how much space you have and your tolerance with dealing with fucktards online.",
            "score": 15,
            "author": "Decyde",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Go to yard sales, resell on Ebay or Amazon.\n\nWake up early on Saturday and shop all day\nSpend all day listing items online\nPackage the sold merchandise on Thursday\n Ship them out on Friday\n\nYou'll lose money at first, but once you get an eye for things, I've seen people pull in a an extra $500 per week, with only 20 hours of effort",
            "score": 58,
            "author": "Samfickel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sell high end electronics on EBay (audio, music gear, cameras, etc) on consignment for 20% commission. You have to know about the gear, you have to be able to package it properly for shipping (I buy packing supplies wholesale), you have to ship internationally to get the best price, which means knowing the ins and outs of customs forms, you have to only use PayPal and know how it works (in my experience) for example: anything over $1000 PayPal payment should be funded from the buyer's bank account instead of from a credit card, you have to be able to test the gear and sometimes repair it (I've had to fix broken speaker terminals, replace output transistors on amplifiers that have been shorted, deoxit potentiometers and switches, basic crap Iike that). It can be pretty juicy.\n\nI just sold an amplifier for $6000, so that was worth $1200 to me. Was listed for three days. Packing took a day. Buyer pays shipping cost. I take my 20% before PayPal charges and EBay final value and listing fees.",
                    "score": 43,
                    "author": "crestonfunk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love when writers and editors suggest writing and editing, with big fat typos in their comment. 👏🏻",
            "score": 61,
            "author": "isthatamullet"
        },
        {
            "level": 0,
            "comment": "FREELANCE SOFTWARE TESTING - if you own a laptop, smart phone, gaming system or any combination of these - you can be a software tester and make anywhere from $3 to $30 a defect. Check out utest.com",
            "score": 16,
            "author": "im00ny"
        }
    ]
}