{
    "id": "82z8yk",
    "score": 44447,
    "title": "Quick Reminder to Not Give Away Your Salary Requirement in a Job Interview",
    "author": "lltrs186",
    "date": 1520530130.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/82z8yk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know I've read this here before but had a real-life experience with it yesterday that I thought I'd share. \n\nGoing into the interview I was hoping/expecting that the range for the salary would be similar to where I am now. When the company recruiter asked me what my target salary was, I responded by asking, \"What is the range for the position?\" to which they responded with their target, which was $30k more than I was expecting/am making now. Essentially, if I would have given the range I was hoping for (even if it was +$10k more than I am making it now) I still would have sold myself short. \n\nGranted, this is just an interview and not an offer- but I'm happy knowing that I didn't lowball myself from the getgo. ",
    "comments": [
        {
            "level": 0,
            "comment": "Most interviews I've had they will ask\n\n\"What are your salary requirements?\"\n\nSo I just answer\n\n\"I'm actually looking at the entire package, benefits, insurance, stock options, retirement planning, and other fringe benefits that come along with the base salary. What are you offering?\"\n\nThat puts it in their court. I've never had someone evade it at that point.",
            "score": 1931,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like this! Will try this tactic as well. Thanks for sharing. ",
                    "score": 263,
                    "author": "lltrs186",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is another frustrating thing about those online form type applications. Many ask you to input a salary requirement and many of those won't let you input something like \"Negotiable\" as they only take hard numbers. I feel like I'm gaming it a lot of the time by trying not to offer myself out for too low but also not disqualify myself by asking for too much.",
            "score": 5350,
            "author": "CinnamonSwisher",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can just put $1 or some ridiculously low amount that the input will accept When asked about it later, I'll just up front say I don't make it a practice of setting salary expectation until I know the role and benefits better. You still end up in the ongoing dance back and forth eventually, but at least it gets you past the computer form and you're negotiating with a real person at that point. \n\nEdit: love all the discussion on this - negotiating is a game I love to play and chat about.  Lots of folks posting how this might get your resume auto filtered into oblivion. While that's true, my assumption was that if you're going through the numbers game of online automatic applications, you're already dicing with the algorithm gods anyway, and this just moves the game one step further without too much investment. If you really are hunting the dream job, I think there is no substitute for getting creative to get around these digital gate keepers and talking to a real person. Go to meetups the company hosts, offer to buy someone that works there a coffee or lunch even to ask about the work (not directly for a job), volunteer to help out with a project or even charity event the company is hosting. Hiring people want to find good candidates with minimal fuss, make it easy on them if you can - Good hunting y'all!\n",
                    "score": 10288,
                    "author": "mukungfu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd just press and hold the \"9\" key until it runs out of space ",
                            "score": 3174,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2530,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 846,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 294,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 233,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wouldn’t putting $1 also filter you out? ",
                                            "score": 39,
                                            "author": "Estrada620",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 65,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 457,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 79,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "SQL injections are outdated. I just hack into the mainframe and delete all other user entries. That way I am the optimal candidate for my application as a Walmart cashier.",
                                            "score": 129,
                                            "author": "BrendonD3OT",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"See Resume\". \n\"See Resume\".",
                                    "score": 238,
                                    "author": "TrenchCoatMadness",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 294,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 265,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 135,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 52,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; See Resume\n\nI have definitely done this on those application forms where they essentially want you to rebuild your entire resume. Can't tell if I've been specifically excluded _for this_, but I also can't recall getting an interview where I've done this. ",
                                            "score": 163,
                                            "author": "scottperezfox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "HR departments will regularly exclude for this. They need you to enter data in the fields so it spits out in a standard format for them. Or in a worst-case so the automated system can detect that you used the right words in the right order at the desired frequency. ",
                                                    "score": 209,
                                                    "author": "Actually_a_Patrick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In NYC, asking for a person's current salary is now illegal. Should be nation wide. ",
                                                            "score": 254,
                                                            "author": "JustAnotherSRE",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've heard from other poeple on here that this is a very bad strategy as they'll just disqualify you. ",
                            "score": 327,
                            "author": "FLHCv2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "1. Fill out the box with your expected salary range:  \na. Disqualify yourself from requesting too much  \nb. Proceed further because you undercut what they were offering  \n2. Fill out the box with 1/999999999 range:  \na. Disqualify yourself for being outside of the filter range  \nb. Disqualify yourself for not answering the question  \nc. Proceed further because the company doesn't mind  \n  \nThere's not really a perfect method to this. I miss the old days where you would actually submit your resume/CV in person, then schedule a phone interview/in-person interview, then you could discuss all that (I say old days, although I'm only 27). I'm tired of this \"Upload your resume and salary expectations here. Type everything you already uploaded on the last page here now. Good luck getting a response from us because you were off by one figure\" employment practices.",
                                    "score": 266,
                                    "author": "xZora",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am 31 and same boat, my last 3 jobs were submit a resume in person and have an interview. Granted all 3 of those interviews salary is a question. I usually answer half way, \"I make a good salary now and while I am looking to better myself and find a new role, I am not willing to do so for less than X (where x is usually a 25% raise) however I do always count benefits, perks, bonuses, and starting bonuses towards my ultimate decision.\"  \n  \n2 of my last 3 job both netted me 20% raises and a starting bonus of 10k. The 3rd was a 10% raise and my first year I had an extra 5 days of vacation. Not a perfect plan just one I personally sell well.",
                                            "score": 102,
                                            "author": "Leydonn",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nope, when I was applying regularly I would put 0 as my required salary and I would still get interviews and callbacks. If they ever asked why the form said 0 I said I was just looking for a competitive salary",
                                    "score": 144,
                                    "author": "IamTheJman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Really wow them by saying I love your company's mission statement so much I'm willing to work for free, but I understand if you want to pay me $200,000 instead.",
                                            "score": 137,
                                            "author": "Butwinsky",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If it does, you most likely don't want to work for them.",
                                    "score": 379,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 327,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've considered that, but I didn't know if that would disqualify me for not fully filling out the form. I've heard stories of companies not even considering someone if they didn't do the application fully and properly, which I would be worried putting $1 would fall into",
                            "score": 72,
                            "author": "CinnamonSwisher",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 541,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 153,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 107,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the reasons I took my current job was my boss starting the interview with \"So the salary is $x. Would you like to hear what the job entails?\" ",
            "score": 14416,
            "author": "Squints753",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is how it should be. A person's first interest in a job is usually the salary. I hate that it's taboo to talk about- it's the main motivator yet we're expected to ~~her~~ be secretive about it. \n\nIt's not greedy to be interested in the amount- it's sensible. It's literally a huge part of what defines your life and future.\n\n They're treating it like a car buying experience. \n\nEdit: a word",
                    "score": 10137,
                    "author": "noyogapants",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1662,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 334,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 28,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 258,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 82,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd rather they disclosed salary range before the interview. I dont want to take a half day off work to go waste it at an interview where the money is crap. ",
                            "score": 403,
                            "author": "dropsofjupiter23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Last job I interviewed for I told them my minimum salary requirements.  Said I'd really like to be at \"this\" number, which wasn't much more.  Talking to a number of people in my field, and my area, I felt pretty confident I was being pretty reasonable.  He nodded and said \"okay thats a decent number...\".  Second interview, came up again, said the same thing.  Third interview was him, and a panel of other people I'd be reporting to.  His boss brought up salary and I said the same thing.  And he says \"Okay, I think thats doable.  You wouldn't believe what some people were asking...\".  So I get the job offer a few days later.  10k BELOW what I said my minimum number was.  It was less than what I was making at my current job.  They would not budge on that number.  I said that I appreciated the offer, it was great meeting all of them, but I felt like their offer was below the fair market value of someone with my skill set.  \n\nAn hour later the guy I originally interviewed with called me back wanting to know why I didn't accept it.   I told him the salary was to low, and he proceeded to call me every name under the sun.  I hung up on him about half way through the rant.  The job was open for another 8 months or so, the finally had to out source it to fill the position.",
                                    "score": 275,
                                    "author": "admlshake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jesus...that's extremely unprofessional for a potential employer to mouth off like that to you...",
                                            "score": 189,
                                            "author": "Wesilii",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I was taken back by it.  The guy seemed like he was a decent person in the interviews.  I wondered later on if he was getting some pressure from the top to hire someone in a lower price range with a certain skill set and thats what caused it.",
                                                    "score": 63,
                                                    "author": "admlshake",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah, and if you have to ask, you can't afford it!",
                                    "score": 45,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I hate that it's taboo to talk about- it's the main motivator yet we're expected to her be secretive about it. \n\nMe too.  *Hint: That's what the employers want and have actively worked to make this concept to be accepted as taboo by society.*\n\nIt's a complete crock of shit and collectively people should be against this idea.",
                            "score": 3674,
                            "author": "kalimashookdeday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Hint: That's what the employers want and have actively worked to make this concept to be accepted as taboo by society.\n\nPretty much this. My wife's job has policies about not discussing wages/salary amongst employees. She's been there for years and it gets talked about behind closed doors, usually one on one, or whenever the reviews/raises go out (once a year) so she knows roughly what everyone makes.\n\nEDIT: Lots of talk about how a policy like this is against the law in the United States; Aaaaaand, we're in Canada. I couldn't honestly tell you if it was actually legal or not here (obligatory \"sorry\") - BUT, I do find the responses very interesting.\n",
                                    "score": 1192,
                                    "author": "firefighter26s",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 902,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The policies I've seen are basically \"you shouldn't talk about pay\". It is illegal for them to forbid it. Meaning they can't legally take any negative actions against people who do talk about it",
                                                    "score": 142,
                                                    "author": "d_r0ck",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Chilling the exercise of Section 7 rights can be a violation of the NLRA even without an adverse employment action.  That is why you see so much scrambling over employee policies and handbooks etc. In essence, would a policy - even if it doesn't explicitly say so - cause a reasonable employee to assume the protected activity is prohibited?  If yes there is potential liability.  This is why the NLRB can scrutinize policies in a vacuum and find violations.\n",
                                                            "score": 33,
                                                            "author": "304T180",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Spot on.  In the US this could get you some nasty fines.\nEdit: source: been there. The NLRB can issue penalties on their own hook. ",
                                                    "score": 602,
                                                    "author": "grumpyold",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 408,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "People can't discuss unfair wages if they can't discuss wages.",
                                                                    "score": 652,
                                                                    "author": "general-throwaway",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 91,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 226,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The National Labor Relations Act, 29 USC s 157\n\n&gt; Employees shall have the right to self-organization, to form, join, or assist labor organizations, to bargain collectively through representatives of their own choosing, *and to engage in other concerted activities for the purpose of collective bargaining or other mutual aid or protection*, and shall also have the right to refrain from any or all of such activities except to the extent that such right may be affected by an agreement requiring membership in a labor organization as a condition of employment as authorized in section 158(a)(3) of this title.\n\nAnd the NLRB is empowered to fine companies that aren't compliant.",
                                                                    "score": 105,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It is illegal, but employees have to know that and many don’t ",
                                                    "score": 138,
                                                    "author": "doublediamondz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Even if they do, it's hard to prove: \"yeah we don't care that you were talking about your salary, but you have a history of taking excessive lunches (by an average of 3 minutes) and that's something we just can't afford.\" Or better yet, in ~~right-to-work~~ **at will** states: \"You're fired for no stated reason\"\n\nEdit: I'm stupid",
                                                            "score": 175,
                                                            "author": "Galtego",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or you’ll get an unfavorable review suddenly ",
                                                                    "score": 61,
                                                                    "author": "doublediamondz",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One of my favourite aspects about working in the public service is that all of the salaries are public information. Everybody knows that all of their coworkers are making the exact same amount of money if they're doing the same work. There's no bullshit secret negotiations or nepotism that can have one person making far more money than they work for.",
                                            "score": 263,
                                            "author": "gellis12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There still is that stuff going on, it's just constricted a bit more by the facially-neutral rules.\n\nFor instance, if there's someone the boss wants hired, you just delay interviews until they're reachable on the civil service list. Or you create a position that's exempt from civil service, so that person can be hired private sector-style. Or you make all candidates do a written exercise in addition to the interview, which is tailored to the preferred candidate.\n\nThose are basic HR 101 ways to manipulate the system, there's also more complex ways.\n\nFor instance, management wanted to hire one of their buddies from the private sector to a public sector senior position, which was supposed to only be filled by promoting an existing civil servant from a junior position. So we created an exempt junior position, and appointed the buddy to it on a 1-day contact, from where the buddy promoted to the senior position as an \"existing\" junior level civil servant. The buddy didn't even show up for their 1 day of junior level work, they were allowed to work from home, which isn't approved for most employees in the department. Dozens of legit civil servants who had put in years at the junior level were passed over for the buddy.\n\nWhen I started it was all talk about the rules and fair play. Once you get high enough up the ladder, you find out how it really works. It's like how you have to get to a certain rank in Scientology before they tell you about Xenu.\n\nSource: work in public sector HR.",
                                                    "score": 141,
                                                    "author": "BubbaTee",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That policy is probably against the NLRB laws. Pay is one of the things that is protected speech at work. Others include injuries/workplace safety. ",
                                            "score": 21,
                                            "author": "TuggMahog"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My manager at the chain restaurant I used to clean tables at told me it was stupid of me to talk about my wage with my fellow bussers. I didn't bother arguing with him, but it took me a while to convince my coworkers that it wasn't us being stupid, but management being scared of us learning what each other made.",
                                    "score": 164,
                                    "author": "MuSE555",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It can be awkward too- my first job was in a bank and as a box-fresh, know-nothing idiot I was earning more than the lifers who were training me, purely because the starting salaries as is often the case had gone up faster than the existing salaries. I could win them back a bit by being pissed off on their behalf but it was still tricky, and I couldn't blame them.",
                                            "score": 85,
                                            "author": "Northwindlowlander",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's *why* you need to talk about wages. Those people were getting fucked.",
                                                    "score": 131,
                                                    "author": "pvXNLDzrYVoKmHNG2NVk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And they still are. Basically they got pissed, sometimes at me, but they didn't get anything fixed.",
                                                            "score": 50,
                                                            "author": "Northwindlowlander",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Fuck that type of car buying experience too. I don't want to tell you how much I want to pay, I want to know how much this car is going to cost me!",
                            "score": 202,
                            "author": "longviewpnk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also fuck speaking in terms of monthly payments instead of total cost. ",
                                    "score": 175,
                                    "author": "2mnykitehs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This, if an employer tries to lowball me, I know from the get go we won't get along. If he gives fair pay and if he can't, does not waste people's time, well great. That how you get loyalty and respect from your teams, and thus more productivity and efficiency.",
                            "score": 134,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 115,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 392,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why do places do this? It's a waste of everyone's time. I've walked into interviews and driven for hours then wasted more time there only to find out there's some dealbreaker...pays too little, has too much travel, is a night shift etc.\n\nI'm always like couldn't we have figured this shit out before I wasted like 3-5 hours? Course they don't really care about my time, only theirs.",
                            "score": 288,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell them how great you feel and set up a followup interview. ",
                                    "score": 112,
                                    "author": "Neodrivesageo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 26,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Then tell them you'll have a decision at the end of the week...and never call them again.",
                                                    "score": 36,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 57,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 265,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "A strong hint that the last 20 people they told the shift times turned it down! That's a hard NO for me.",
                            "score": 41,
                            "author": "Annabel398",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This *almost* happened to me. \n\nThey started the interview on this note:\n\n\"Look, we're a startup,  we dont want to waste anyone's time. So, what are your salary requirements?\"\n\nI told them what I made currently, and that I couldn't afford a step down. It was a dream job that would have meant leaving a job I truly hated with no growth potential so I was willing to skip the negotiations and leave money on the table. Frankly, I woukd have been surprised to learn they could afford me, but I figured it was worth the conversation. \n\nThey laughed. One guy, who I'd known but not well for several years giggled a bit, but the guy who asked the question chuckled heartily. And then he said \"Yeah, we can handle that.\"\n\nSo I assumed I'd lowballed myself and made a mental note. \n\nThe interview went great, and they asked me to come in for one day of work as a tryout. I was on four 10 hour days so that was no problem. I came in, worked an entire day. 8 hours. Did a lot of great work, impressed a lot of people. \n\nThey emailed me a week later and offered me about half of what my salary requirements were. \n\n\"We dont want to waste anyone's time\" was one hell of an interesting choice of words. \n ",
                    "score": 33,
                    "author": "dsjunior1388",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "After my first job, I interviewed at another place and when they asked what I was currently making (which I don't think is a fair question to begin with), I took my current salary, added a bunch of value based on how short my drive to work was, free gym membership, job security, etc.. and gave them a number that was probably 30% higher than the actual number. If they required proof or something I would've just explain how I calculated it all.\n\nI think the whole interview process is really shady. The interviewee shouldn't have to give a range, it should be on the employer to offer a range and the interviewee to decide if it's acceptable.",
            "score": 2408,
            "author": "paladyr",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Oregon they're no longer allowed to ask what you currently or historically made, only what you expect to make in the new position.",
                    "score": 1112,
                    "author": "PENNST8alum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is also true in MA and recently, NY. I believe it's up for passing in CA (but don't quote me on that, CA labor laws are their own beast entirely and it's hard to keep up)",
                            "score": 369,
                            "author": "mm1688",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No longer allowed in CA either.  My husband had a phone interview a couple weeks ago and the person asked, then after a few seconds of silence remembered and corrected herself, lol.",
                                    "score": 410,
                                    "author": "axel_val",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, no wonder they stopped asking.  I've had a few interviews this year, and last year, and I noticed and thought to myself \"hmm, they used to always ask, but now they don't. That's weird.\"  This explains it.",
                                            "score": 169,
                                            "author": "fugazzzzi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's great. I'm actually a recruiter based in NY and I love that it's a law now. I stopped asking salary history a while ago because it was common practice among the \"fairer / human workplace\" thought leaders in the field and generally understood that it's a toxic question and perpetuates a lot of bad shit, but I'd always get pressure and flak from my HR Directors, Partners, Hiring Managers etc and often be forced into requiring this info from our candidates. Now that it's a law, I can be a fair and honest recruiter, acting as a resource and a partner for our candidates, not an enemy / gatekeeper. ",
                                                    "score": 152,
                                                    "author": "AdamManHello",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's against the law now in CA to ask about salary history. In addition, employers are now required to provide a salary range for the position if a job seeker requests it.",
                                    "score": 92,
                                    "author": "ILoveLamp9",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is the case for New York City too\n\nEdit: clarified that this is true for New York City only, not the whole state ",
                            "score": 23,
                            "author": "belledamesans-merci",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Benefits really do add up though. My insurance is 100% paid for. None of the places I'm applying at offer that, and most have really high rates, so I include my compensation into my number. I may not get the money directly for all my benefits, but it's what my employer is paying. ",
                    "score": 58,
                    "author": "MsCrazyPants70",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "HR: What salary are you asking for this position?\nME: I really love the opportunity, and I'm confident if this is a good fit, the salary will be within range. \n\nHR: We need to put down a salary.\nME: What is the general range of salary for this position and level of responsibility?\n\nIt can go on and on. It is a dance. I usually ask on the first call from the headhunter / recruiter \"What is the general range of compensation for this position?\" . This is something they normally have in front of you, and the person cold calling is usually not the person who does the 'negotiation' to see your starting range. \n\nThere have been a couple times the HR absolutely would not budge and required a number. I would simply say \"Between *75% of current pay* and *25% more than current pay* ,depending on the benefits and job responsibilities\". If you get backed into a corner, put a big range, and then later say ... the benefits aren't nearly good enough, and the responsibility is high enough that the low offer simply isn't an option.  \n\nThis is coming from a software developer specializing in Cloud/SAAS/Agile/Medical/Finance , so your mileage may vary. ",
            "score": 6797,
            "author": "notonlynotless",
            "replies": [
                {
                    "level": 1,
                    "comment": "If a place won't budge on disclosing a salary range at all, it tells me it is probably below market or the company is assholeish about trying to keep salaries a secret. In neither case am I interested.",
                    "score": 3705,
                    "author": "TheFire_Eagle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, and you can expect your reviews to be either nonexistent or under inflation. ",
                            "score": 873,
                            "author": "AkioDAccolade",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Well we can't really pay you market rates yet, but if you work your ass off for us through the busy season and show how good you are, maybe we'll talk a raise then!\"\n\n(Later)\n\n\"Huh? Raise? Who told you that?\" ",
                                    "score": 1039,
                                    "author": "cultured_banana_slug",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; (Later)\n\n\"You did such a good job in the past year, here is a 3% raise in your salary. Congratulations!\"",
                                            "score": 309,
                                            "author": "BobSacramanto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "3%? I’m told that my 2.5% is above the average raise for an employee who is performing well... fuck my life. ",
                                                    "score": 140,
                                                    "author": "cambo456",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My company was 2% average raise, and almost no promotions occur. ",
                                                            "score": 40,
                                                            "author": "TheChosenMidget",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 257,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Word. Previous employer dangled that carrot for 4 years. Sooner or later you've got to bounce. Probably going to make more in bonus than the last place's salary this year.",
                                            "score": 365,
                                            "author": "jonnug",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. Old boss kept telling me “you’ll be up to that kind of pay in no time, don’t worry.” But never gave me a decent raise.\n\nHe was right though, I *did* get there... when I accepted an offer at another company.",
                                                    "score": 376,
                                                    "author": "proanimus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Were you looking for another job when you got the offer? Or did the second company contact you?",
                                                            "score": 72,
                                                            "author": "Deonhollins58ucla",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I was just casually looking, not putting in much effort. A friend of mine told me about the opening at her company, and I applied.",
                                                                    "score": 102,
                                                                    "author": "proanimus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh ok. Thanks for replying. ",
                                                                            "score": 40,
                                                                            "author": "Deonhollins58ucla",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 118,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 176,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My current company is getting to be this way. Our reviews are a 1 to 5 rating where 5 is highest/best. We are absolutely under no circumstance aloud to give a 5. So it is really a 4. So everyone averages a 3 to 4 which is meets expectations. Specifically so that our folks cannot use the review for getting another job.",
                                    "score": 93,
                                    "author": "vipersquad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do we....do we work for the same company? \n\nLiterally my review: \n\nBoss: here are 20 things I’m rating you on worth 5 points each for a total of 100 points. I want to start by telling you that nobody gets 5’s because nobody is perfect and there is always room for improvement. \n\n\nMe mentally: so a perfect score is 80/100....mmk \n\n\nBoss: great job! You got almost all 4’s! That brings your score to high 70’s! \n\n\nMe out loud: okay, so....the point about nobody getting 5’s is that nobody is perfect and we should always strive for 5’s, right? So can you tell me where I can improve or how to improve so the score is better next time?\n\n\nBoss: Nope! You are doing a fantastic job! You are the best on the team! Keep up the good work! You should be proud of the 70somethibg /100! \n\n\n\nMe: I am so confused.....",
                                            "score": 129,
                                            "author": "WinosaurusRex007",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sounds like my company.. nobody gets a 5 unless you donate a kidney to your boss's boss",
                                            "score": 27,
                                            "author": "Deadpotato",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I get an offer on LinkedIn or Email, I don't hesitate to ask the salary range.  If they aren't willing to disclose that information, they aren't worth your time at all!",
                            "score": 259,
                            "author": "trucido614",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Funniest things of all - there are actually recruiters getting angry when you refuse to spend 30 mins on the phone not being told in advance the company name, salary range and responsibilities.",
                                    "score": 258,
                                    "author": "MapleBlood",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly.  I also think it's ridiculous they don't work on Saturdays.  We're supposed to take time off from work to spend 1 hour meeting with them?  Proves they don't give a shit about who they're hiring.\n\nThank god I got hired on though full time, I won't have to deal with that nonsense hopefully any time soon.",
                                            "score": 170,
                                            "author": "trucido614",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Former recruiter here: If we tell you the company name, you'll just apply and cut out the middleman (which you TOTALLY should do -- companies hate paying recruiter fees for someone they could've easily found on linkedin, etc.).  Or you'll research the company and know they have a toxic or super-christian or underpaying work culture and decline to continue the conversation. \n\nOur office was in the boonies at the intersection of two tollways and we requested to meet every candidate in person \"to personally vet them\" which really meant \"interrogate you until you cough up 5 names and 5 numbers of former managers or coworkers who can \"vouch for you\".\n\nOh and yeah we expect this during the workday... oh and I'll be calling you at home after 6PM because *everyone loves marketing calls during dinner*.\n\nCompany HR recruiters are fine, but 3rd parties are just in the way. Avoid them like the plague.",
                                                    "score": 193,
                                                    "author": "Sporkfoot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I get the reluctance towards handing out the company names, for the reasons you mentioned.\n\nBut the refusal to give even a hint of a salary range is just dumb.  No, I'm not going to talk to you for an hour about a job that might be paying less than the job I currently have.  Give me something to prove that this is worth my time, or don't bother.\n\nOh, and what the fuck is up with the obnoxiously vague job descriptions?  What are they trying to accomplish when they give a description of responsibilities that is basically \"Yeah, this is a Mechanical Engineering job where you will be doing... Mechanical Engineering things\"?  I can't understand that part.  You're trying to convince me to consider this job.  So tell me what the fucking job is.",
                                                            "score": 57,
                                                            "author": "Delta_V09",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My recruiter for my previous job was 3rd party. \n\nHe asked what kind of pay I had in mind for the position he brought to me. At the time I was making $15/hr and me being new to the job market, I had no idea what to do. I told him $20/hr and his response was, \"I think I can do $25/hr\". I was shocked but grateful. He's been extremely helpful in my career. ",
                                                            "score": 87,
                                                            "author": "Lakeshow15",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same. A 3rd party recruiter treated me really well, helped me build confidence, and enabled me to advance my career way more aggressively (I doubled my take-home in two years and moved into work that is actually fulfilling) than I otherwise would have. For clarity, I've moved out of his wheelhouse with regards to industry specialization now, so we simply get beers from time to time.",
                                                                    "score": 26,
                                                                    "author": "UPVOTES_FOR_JESUS",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This^ Basically, just quit my job because I asked for a raise that would put me 5k below market value in a position where we are required to do substantially more than the general position requires.  ",
                            "score": 270,
                            "author": "Phenom408",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I left my old job to take a position where I'm about 5k-7k below market value for my experience level. Thats how underpaid I was. I'm perfectly ok with being below market where I'm employed now because I work in a fairly poor, rural area and don't have to deal with traffic.",
                                    "score": 97,
                                    "author": "lonewanderer812",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I will never underestimate how annoying traffic is again",
                                            "score": 44,
                                            "author": "ShadowShot05",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 557,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Serious question; is 4 weeks vacation considered good in the States?\n\nEdit: Thanks for all the replies. The reason I'm shocked is the legal minimum here in the UK is 5.6 paid weeks and we're not great by European standards... The French barely ever work... J/K Frenchies :)",
                            "score": 569,
                            "author": "JTTRad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s definitely above average for a career type position. Above and beyond anything that an hourly employee would be offered, if they got vacation at all. ",
                                    "score": 417,
                                    "author": "AsAGayJewishDemocrat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 219,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": " My previous job had 10 days vacation a year. Downside was that this was also sick time. Initially you could bank your OT and use it later for vacation time, but the state shut that down after finding out, likely because the time was 1 to 1, instead of 1.5 to 1 like OT pay would have been. ",
                                                    "score": 125,
                                                    "author": "aaronwhite1786",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, the downside is that you only get 10 vacation days per year.",
                                                            "score": 228,
                                                            "author": "jacybear",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m hourly and I get just shy of 6 hours every 2 weeks, comes out to approximately 154 hours PTO a year, which at a 40 hour work week is 3.85 weeks. Maybe not a full “four weeks vacation”, but not bad.",
                                            "score": 58,
                                            "author": "dirtysocks85",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah I think so. Most places start you at 2 with the option to earn more with seniority. When I was offered 3 to start at my current job I was over the moon!",
                                    "score": 50,
                                    "author": "averysmallbear2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Heck yeah!  I went from 2 weeks at my last position to 3 weeks accrued + all holidays already given + a bonus week off between Christmas and NYD.  Added it up to six weeks of *paid time off* which is unheard of in the states.  Totally worth the $5K pay cut I took to come here.  (Plus, hey, less stress.  And the company I left was bought out six months later.)  Plus sick days.  And unlimited work from home flex time. o_O  I love my job...",
                                            "score": 61,
                                            "author": "katarh",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, most places barely give you 2 weeks, and a majority of US workers don't really take vacations to begin with.",
                                    "score": 38,
                                    "author": "eliechallita",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Sheesh. That's the legal minimum? Color me jealous. ",
                                    "score": 111,
                                    "author": "aaronwhite1786",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, and most 'professionals' will get more. I get 31 days a year plus some sick day allowance also. That said, I think our salaries are generally around 10% below US standards, though we don't have to directly pay health insurance, so not sure if that balances out better or worse...",
                                            "score": 125,
                                            "author": "JTTRad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I'd be interested to compare and contrast.\n\nAt my current job, I think they pay about 10K below the average in the area, but since it's a University the vacation and sick time is absurd. I think right now I'm sitting on about 30 days vacation and probably at least 40 sick time, since they roll over each year. ",
                                                    "score": 29,
                                                    "author": "aaronwhite1786",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 139,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; $500k\n\nHaha, this will be outlandish\n\n&gt; with 4 weeks vacation\n\nouch",
                            "score": 47,
                            "author": "jd_paton",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've had this happen with recruiters, too, but a slightly different question where they were asking for my current salary. At one point the recruiter said they have to have a number, for what I currently made (not what I expected to make). I said, \"Sorry I'm not sharing that. If we can't go on, I understand.\" Turns out they didn't really need a number because we went on. They offered me $13k more than  my current salary and I negotiated them up to $25k of my then current salary. Sharing never helps you. I would have never gotten that big of a pay difference if I had told them. (I didn't end up taking the job).",
                    "score": 115,
                    "author": "pwo_addict",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If they don't budge, just don't budge either. If they say it's required or you won't be considered, just say that's fine.\n\nI've been in this exact situation and they ended up offering me 20k more than I was making. ",
                    "score": 80,
                    "author": "forresja",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've fortunately never been in a situation where a salary req is required without budging. If a company says that it's a definite red flag that tells me \"we need to pay you as little as it takes.\"",
                    "score": 128,
                    "author": "western_style_hj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;  I usually ask on the first call from the headhunter / recruiter \"What is the general range of compensation for this position?\".\n\nThis is better than OP's advice. I won't even waste my time going to an interview unless they tell me the salary range. Obviously things are different if you don't already have a job, but if you do and you're just looking around, always get the salary range first.\n\nI had a company fly me across the country for an in-person interview that took all day. They offered me the job. It was $20k less than I was already making and they told me I'd have to move to a higher cost-of-living area. I told them I wasn't interested and they made a better offer, but still not enough to make it worth it for me to move. I was expecting much more.\n\n",
                    "score": 59,
                    "author": "signos_de_admiracion",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd rather an employer laugh in my face at my number then mentally fist pump at the opportunity to get my service at X% off for who knows how many years.",
            "score": 2316,
            "author": "spartan5312",
            "replies": [
                {
                    "level": 1,
                    "comment": "I made this mistake at my last job. It was some entry level warehouse work, but I found out after almost 2 years that I was being paid $4/hr less than anyone in the office, including the new guy who came 2 years after me. The owners were family friends too so... really feelsbadman",
                    "score": 1133,
                    "author": "DepecheALaMode",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I found out after almost 2 years that I was being paid $4/hr less than anyone in the office\n\n&gt; The owners were family friends\n\nThese two statements do not belong together.",
                            "score": 818,
                            "author": "Information_High",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "tell me about it. screw those guys",
                                    "score": 330,
                                    "author": "DepecheALaMode",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe\n\n&gt;The owners **were** family friends",
                                    "score": 83,
                                    "author": "spacejockey8"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn. what did you end up doing?",
                            "score": 106,
                            "author": "localmancolumbus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had to move states for school so either way leaving the company was the only option. It was pretty lame though because I led my own mini department(small coffee roasting operation, I dealt with brewing cold brew and putting it on tap for nitro) which was a metric butt load of work on it's own, plus I did the usual packaging and other daily warehouse tasks. My cold brew method I developed myself won 2nd or 3rd in a national competition and I think there was some prize money, yet I got no reward for my efforts to start it all. Just our warehouse team of 6 brought in over 8m per year, not to mention the coffee shops that bring in 5m per year. They were making bank, yet couldn't spare the cash to pay anyone a good enough wage. I just happened to be the most underpaid out of anyone.\n\nThe coworkers were awesome which is the only reason I stayed so long, because the management was pretty poor at best. I visited when I came home recently and the place is kind of falling apart now. Our manager was fired which caused 2 of the other guys to leave and the star accountant/office manager just quit a week ago. It's a great operation so it bums me out that the owners are so sucky. I'd love to keep working there if they were fair to us, but sadly they are not.",
                                    "score": 229,
                                    "author": "DepecheALaMode",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "8 mil yearly with 6 employees doing most of the work and knowingly taking adavatge of you with underlay. Shit you be a jailable offense ",
                                            "score": 174,
                                            "author": "FuckFFmods",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah it sucked finding that out. Just glad im out of there. I was young so i didnt know better at the time, but I definitely learned a valuable lesosn",
                                                    "score": 53,
                                                    "author": "DepecheALaMode",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 827,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 178,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "uhhhhhh damn. I guess I read this post about 2 hours too late. \n\nThanks though. ",
            "score": 981,
            "author": "deeretech129",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, except 1 week too late. I was recommended a job by the person in charge of student work opportunities, and he said the range was $15 - $20 / hour. There was an electronic form and it required a minimum salary. I gave $15/hour. However, I do have an interview for this same job next week, maybe I can say something then. Idk",
                    "score": 273,
                    "author": "MSixteenI6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I replied to deer with this, but it applies to your situation as well:\n  \n  Until you sign the offer sheet, it's never too late. You can always call an employer after they give you an offer and negotiate salary (If you go this route tell them after they offer that you want to call/talk to them and discuss the position more along with the benefits). I only negotiated my salary up $2k but one friend got an extra $5k and another $7k.\n\n",
                            "score": 219,
                            "author": "dagabester69",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I read this post 5 years too late and every year I feel the sting because yearly % increases just make me feel bad knowing if I did that first part right I'd be making even more",
                    "score": 65,
                    "author": "TheEchoFilter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was literally 15 minutes from sending an email; this post is almost TOO timely.",
                    "score": 99,
                    "author": "dare2smile",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have an interview tomorrow... could not have seen this at a better time.",
                            "score": 31,
                            "author": "edgar__allan__bro",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "New Law in California forces employers to give you a salary range and they cannot ask what your current salary is. I wish this was done all over the country. ",
            "score": 1047,
            "author": "cwdesignsvs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes!  AB168, states employers CANNOT ASK:\n\nhttp://www.sfgate.com/business/networth/article/New-law-bans-California-employers-from-asking-12274431.php\n\nCalifornia employers can no longer ask job applicants about their prior salary and — if applicants ask — **must give them a pay range for the job** they are seeking, under a new state law that takes effect Jan. 1.",
                    "score": 194,
                    "author": "HelloSexyNerds2",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's starting to spread a bit. I think Washington and New York are adapting it soon. It's a great law and something everyone needs to be aware of.",
                    "score": 152,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nicely done! \n\nFor people reading this thread wanting to know more about approaches, here's a repost of mine from a while back.\n\n\nThe best time to talk about salary is when they have decided they want to hire you. If they try to talk about salary before that time, try to put them off by saying things like \"why don't we continue the conversations to see whether there's a good fit before we discuss salary\". \n\nWhen you start to discuss salary, do everything you can to have them make the first move and cough up a number (see below, and other comments in this thread). At that point you can start the negotiations. The company almost **always** has room to adjust, especially if it is a big place and they have someone that they want to hire. They don't want to go to the expense of screening and interviewing more candidates, checking references, making offers, losing working getting done, etc for another few thousand a year.\n\nMake sure you look beyond just salary and are considering a complete compensation package which may include vacation (more accrual or more to start), signing bonus, relocation expenses, retirement contributions, etc, in addition to the salary. Some of these may only be available to executives though. Ideally you would want treat each one of these separately; negotiate base salary, then vacation, then lower deductions on your health insurance, etc.\n\n**If you have the time, meet with a professional counselor and work on how to negotiate!** When I was applying for jobs after graduate school I went to a counselor and we spent an entire hour on negotiation techniques. It cost $60 and I used what I learned to increase my starting salary from $73K to $88K, with a grade increase to boot. That was over 15 years ago, so I'm at over a $200K return (not including the percentage increases during the raises) on a $60 investment. \n\nMake sure you look at GlassDoor, but you'll find a wide range and it may not be that helpful.\n\nI put the material from my time with the counselor [here](http://imgur.com/a/obsKn) so take a look at it and ask if you have questions. The key points are as follows:\n\n1) These negotiations should always be done in person if you can swing it\n\n2) The first person to mention a salary number is at a disadvantage. If they press, you can say things like \"I'm sure your company has a standard salary range for this position. What is it?\" or (if you have a previous salary history) \"Given the new responsibilities of this position, I don't believe that my previous salary is terribly relevant to the discussion\"\n\n3) Talk in ranges. When I was offered $73K, I responded with \"I was expecting something in the low $90s\". That was when he said that that type of salary would be for a level 4 and this is a level 3 position that the offered, so I countered with \"then maybe I need to be a level 4\". I got the level 4 and $88K\n\n",
            "score": 719,
            "author": "rhombomere",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok I get that advice, but then how do you avoid wasting your time (and theirs) interviewing for jobs that could be massively below your requirements.\n\nSome job descriptions are so vague that the potential salary could be anything - I would hate to go through 5-6 levels of interviews only to find that my needs are 100k more than they have budgeted for the role.",
                    "score": 204,
                    "author": "ImBonRurgundy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Once approach is to ask in a way that they have to answer: \"I noticed that there's no salary in the req. What's the budget/typical range for this position?\"\n\nIf they ask what you were expecting, you might try to defer and do at least some interviews, with the hopes that you can find someone who will say a number.",
                            "score": 102,
                            "author": "rhombomere",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is great earlier in your career and if you know the company pays well. After a couple years in some fields (like tech) you can get a lot of unsolicited recruiter inquiries from companies with lowball salary ranges. I'd rather filter those out up front and not waste time explaining software development for the 50th time to some 22 year kid.",
                    "score": 67,
                    "author": "totalrobe",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bring up my salary expectations immediately if I suspect that the position they're trying to fill is well *below* what I make now.  I don't want to waste time interviewing for a position that will pay me 25% less.\n\nBut when it comes to a job I'm actually interested in, my last one I absolutely refused to name a number first.  And they asked several times in various different ways (current salary, salary range, salary expectations, \"well, we have to put down something,\" etc.)  I would give answers but they were never answers with numbers in them (e.g. expectation = \"I expect an amount appropriate for the job title and my experience in this industry.\"  Current salary = \"You know I'm a principal engineer at Microsoft, I'm sure you have some idea of that range\" [I say fully knowing that that range is approximately $300,000 wide and thus this answer is useless])  It frustrated the recruiter a bit but they were interested in me and were willing to continue anyway.\n\nThe result was that they offered me 30% more than my previous salary -- probably more than I would have dared to ask for.  So I asked them to come up 10% from that offer and I'd take the job, which they did.\n\nObviously how well this works depends very much on your bargaining power.  If you're going for an entry-level job that you know has lots of applicants, you're probably going to have to just answer their questions.  If you're a good candidate for a job that you know is difficult to hire for, though, hold the line and never name a number first -- if you're the first to say a number, that's the ceiling, but if they're the first to say a number, that's the floor. ",
            "score": 261,
            "author": "fishsupreme",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  if you're the first to say a number, that's the ceiling, but if they're the first to say a number, that's the floor\n\n\nI will always remember this.",
                    "score": 168,
                    "author": "TseehnMarhn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "every job has a salary range and if any recruiter or employer will not discuss, best to move on.  Once you set a number, you have screwed yourself no matter",
            "score": 899,
            "author": "decaturbob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes it helps to use their own vernacular, too. If I'm speaking to a recruiter I might ask \"what banding does this position fall into?\" It's just jargon for salary range, but you'd be surprised how far you can get if you speak a little but of their language. ",
                    "score": 438,
                    "author": "western_style_hj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there a good book on this you'd recommend?",
                            "score": 118,
                            "author": "narf007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 102,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "what about discussing with recruiter that isn't related to company?",
                    "score": 73,
                    "author": "theresponsible",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who's the recruiter paid by?",
                            "score": 86,
                            "author": "layer11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many recruiters get a % of salary.  So it's to their advantage to represent you  well.",
                                    "score": 155,
                                    "author": "BobDogGo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 122,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once doubled my salary by asking 3 times 'well what are you paying' without giving an answer.\n\nThey said $90-110K.\n\nI let them negotiate me down, allowing them to think they've won when in fact I went from $45K to $90K.\n",
            "score": 400,
            "author": "sultansofschwing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why would you let them negotiate you down when they clearly stated they were paying $110k? ",
                    "score": 161,
                    "author": "Darth_MylesTurner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well some people just like to play conservative. Doubling your salary is already really good, some other people would've pushed harder and end up not getting the job.",
                            "score": 245,
                            "author": "raikmond",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "they said 90-110k. I probably could have walked away with $100K, but I was cool with it.\n\nSide note, I got fired 1.5 years later because the company was doing shitty, and I ended up being the highest paid person in my department (a few of my superiors left).",
                            "score": 139,
                            "author": "sultansofschwing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So.... Laid off? Firing is different and performance based. ",
                                    "score": 100,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yes",
                                            "score": 43,
                                            "author": "sultansofschwing"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "brilliant. congrats",
                    "score": 29,
                    "author": "thissubredditlooksco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Compensation is a mess. A colleague recently left our team to go to a competitor. He received a $20k bump in salary. A few months later, he invited me to come work for them, too. I built a spreadsheet that compared the compensation of both firms. The goal was to determine how much they would need to offer me such that I had the same amount of cash in my pocket (lateral move). The analysis compared salary, 401k contributions, health insurance premiums, maximum out of pocket for healthcare, mobile phone reimbursement, commuting/local travel reimbursement, and paid time off. I learned that in order to move *laterally* their salary offer would need to be at least $30k more than my current job. I would have required more than that. They could not meet the requirement and no offer was made. My friend never did the math and basically changed jobs for less money.  \n  \n**Lesson: Determine ahead of time what a lateral compensation will be including all benefits that impact your wallet.** There may be qualitative benefits like a Koi Pond and proximity to a nice coffee shop ... but you should know the REAL compensation, not just salary.",
            "score": 56,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'll just chime in to say that in certain fields, this strategy starts to work against you quickly.\n\nI've done it a handful of times as a young architect, and each time the interviewer got visibly annoyed and kept asking. I later learned that it's largely to do with the fact that architecture is a small field, everybody talks (certain firms have reputations as cheapskates), salary reports are easy to find, and it's usually not hard to work out what a given firm is hoping to pay for a position and what the median salary at that level in the area is. It's less a question of salary and more a question as to whether you've done your homework or not.",
            "score": 268,
            "author": "BullOak",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; It's less a question of salary and more a question as to whether you've done your homework or not.\n\nI hate that I had to scroll this far down to find this. \n\nAfter 17 years in the industry, I know what I should be paid. I know what I can ask for. I *have* a minimum salary to move jobs. I have no problem stating that up front, being cooperative and then determining if it's worth proceeding with the interview process.",
                    "score": 148,
                    "author": "The1hangingchad",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've had situations where they will say \"We can discuss salary at the end of the interview.\" Basically, they want you to put in the work of interviewing and jumping through hoops before making you an offer, so you feel like \"well that was a big waste of time\" if they offer you a lower salary at the end, and you're more likely to take the lower offer because you just put in the work. ",
            "score": 141,
            "author": "Pollymath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can work against the company if they do that though because they will end up interviewing people they can’t possibly afford.\n\nAs a hiring manager I don’t want to go through the hoopla of interviewing someone who is awesome, but I cannot afford.  I’ll always give ballpark salary range in a call before we interview to make sure its worth the bother. \nI don’t need to ask what people currently make because from their cv it’s usually obvious.",
                    "score": 104,
                    "author": "ImBonRurgundy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a note: As of Jan 1 2018 in CA, it is illegal for companies to ask for previous salary information, and if you request it, they are required to give the range for the position.",
            "score": 173,
            "author": "cfmacd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, this is a YMMV situation. \n\nIf you do your research and find out what you're worth, then you're not going to normally be getting a $30k raise unexpectedly as you'd know you're being underpaid. \n\nI've also been on the other side, when I've had a few interviews to only find out that the job is paying $10k less than I'm currently making. \n\nIf HR won't give a range, then I have no issues asking for current salary + 15-20%",
            "score": 43,
            "author": "caverunner17",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's a good ideal but when your salary requirement is a required field in the application, you're kinda in a catch 22",
            "score": 81,
            "author": "Wassayingboourns",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You did good, OP. That seven-word question was worth $30,000. How's that make you feel? \n\nSpeaking from first hand experience, clawing back from a low salary early in a career takes years. Nearly a decade in my case and I'm still working on getting to a truly competitive salary for someone with my experience. It also means you have to hop around, which can harm your reputation in some industries. You may or may not get this job, OP, but this sort of proactive strategy is what will put you lightyears ahead of some of your peers a decade from now in terms of HH income. By then you could expect to be earning 20% more than what you might be offered today, while they could be daydreaming about the salary you left behind. That has a huge impact on financial freedom, debt reduction, home purchases, and most importantly peace of mind thanks to improved financial security. And if you're fortunate enough to marry someone with the same attitude and aspirations – look out! You just potentially 10x'd your financial goals!\n\nSo many people, especially new grads, fail to ask the question you asked. Fear paralyzes us at that stage. Fear of not getting the job. Fear of encroaching student loan payment deadlines. We pay tens of thousands of dollars for a diploma but no one teaches us how to GET the job and the salary that feels fair for the work we'll provide. Jordan Peterson had a colorful back and forth with a news anchor on this subject recently, albeit more tethered to the gender pay gap in Canada. \n\nUltimately, whoever mentions a number first loses their ability to negotiate. If an employer knows I'll do the job for $50k, at best I can get them to move up 5% to seal the deal. Conversely, if a candidate knows the range or banding of a position, (GlassDoor has been a game changer for salary transparency) he or she is much better suited to ask for a competitive salary. I was once so eager to leave a bad company that when a recruiter asked what I was currently earning, I told her. I was so naive and desperate to vacate a job that I was willing to mortgage my future earnings just to get out. They offered me just enough to get me to agree to the job. Always ask what OP asked. It'll earn you more no matter what.",
            "score": 382,
            "author": "western_style_hj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Truth. My company compares their software engineer salaries to \"others in the same space\" in apparently private backroom conversations with similar companies. I said \"that's nice but regardless of your product my skill set is valued at ____\" and they came up to my number.",
                    "score": 135,
                    "author": "mozennymoproblems",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Knowing your own value and being vocal about it is priceless.",
                            "score": 63,
                            "author": "western_style_hj",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, three years into my first “career” job my supervisor admitted to me they hired me at a salary waaaaaay below what they could have given me. Because I had “Little to no experience”. I had been doing freelance for over 10 years but whatever. And then she went on to say how I exceeded their expectations right away. Ummm sooooo I proved to you I’m skilled and capable? why have I only gotten 2-3% cost-of-living raises in the THREE YEARS I’ve worked for you? Not even a bump to get me in the range? I started looking for other jobs then.\n\nAnd this was at a state government run place so all the salaries are public. I looked up hers and every year I was there she had gotten a $10k+ raise. \n\nEdit: I should mention, after she admitted this to me, I asked for a pay increase. And she said “I wish we could but we don’t have the money” *rolls eyes*",
                    "score": 113,
                    "author": "ishnite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "sounds like its time to look for a new job.\n\n\n",
                            "score": 60,
                            "author": "The_Quackening",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of comments here criticise recruiters for being secretive about salary, while advocating being secretive about your own expectations.\n\n\nMy usual answer is: \"I'm looking for (what I actually want + 20%) but job satisfaction is more important to me, so I'm really keen to find out more about the position first.\"\n\n\nI've never had a negative response from that.",
            "score": 37,
            "author": "WRONG_ANSWER_OOPS",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My company won't even accept a job application unless you fill out the salary requirement section and it meets their range.",
            "score": 79,
            "author": "wolley_dratsum",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I've got 26 yes experience in engineering.  i have to clearly state my salary minimum or they'll low ball me back to a 2003 salary.\n\ncompanies don't value engineering anymore... at least not oilfield until something bad happens.",
            "score": 505,
            "author": "omega_dawg93",
            "replies": []
        },
        {
            "level": 0,
            "comment": "On the opposite end, I’m well compensated now (not overly, 70-75 percentile for role) but hate my current company so I am looking.  I feel I need to give a range because everyone seems to be searching the cheapest option, and I feel like candidates that aren’t experienced enough for the role posted get them bc they’ll work at 80 percent market value (10-25 percentile).\n\nGoing to an interview and then finding out they’re 20k low is a waste.\n\nThat said, I fear shoot in myself in the foot always ",
            "score": 21,
            "author": "stannndarsh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm HR for my company and do all the entry level hiring (75% of employees) Salary range is a difficult dance, I always ask \"Do you have a salary requirement?\" because if they are way out of our range, I honestly tell them that they don't have to continue with the interview. All of our positions are entry level, meaning if you have the certification or ~6 months experience in a similar industry, you can do the job.  I feel bad for people who have recently lost a good position that paid really well and are interviewing for front desk. I just try not to waste their time. ",
            "score": 21,
            "author": "Jessa55JKL",
            "replies": []
        }
    ]
}