{
    "id": "adnjj7",
    "score": 17301,
    "title": "UPDATE: Bank of America Refusing to Return $700+ in Fruad Charges After 180+ Days. Solved!",
    "author": "IveGotDMunchies",
    "date": 1546902579.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/adnjj7",
    "media_urls": [],
    "other_urls": [
        "http://imgur.com/gallery/lPjXhQt](http://imgur.com/gallery/lPjXhQt)",
        "https://www.reddit.com/r/personalfinance/comments/ac96zf/180\\_days\\_later\\_bank\\_of\\_america\\_is\\_refusing\\_to/](https://www.reddit.com/r/personalfinance/comments/ac96zf/180_days_later_bank_of_america_is_refusing_to/)",
        "https://www.consumerfinance.gov/complaint/](https://www.consumerfinance.gov/complaint/))"
    ],
    "postText": "We got our money back after two days! [http://imgur.com/gallery/lPjXhQt](http://imgur.com/gallery/lPjXhQt)\n\nIf you are looking for information on what to do if your bank declines fraud purchases or your bank refuses to return your money, please read this so you can see what steps we had to take to get something done.\n\nI just wanted to post an update to anyone who followed along on my post last Thursday about the issue we were having with Bank of America declining some very obvious fraud charges and giving us the runaround for 180 days. For those not familiar with the situation, you can read up on it in detail here: [https://www.reddit.com/r/personalfinance/comments/ac96zf/180\\_days\\_later\\_bank\\_of\\_america\\_is\\_refusing\\_to/](https://www.reddit.com/r/personalfinance/comments/ac96zf/180_days_later_bank_of_america_is_refusing_to/)\n\nTLDR: July 15. Fruad on our debit card in Texas while we were in Illinois. 180+ days later, bank lies to my wife after repeated phone calls. I ask for help on reddit. It goes viral. You guys give big help.\n\nAfter posting on Thursday, I took the advice of several Redditors and took the several steps on Friday. Here is the timeline of events leading up to this being closed out.\n\n* **8:00am Friday:** Called  Jonathan Stickland, my local Texas House Representative and left a message explaining the situation\n* **11:00am Friday:** Submitted a complaint to the Consumer Finance Protection Bureau (CFPB - [https://www.consumerfinance.gov/complaint/](https://www.consumerfinance.gov/complaint/))\n* **12:00pm Friday:** My wife called me and told me Jonathan Stickland's assistant had called her to gather more information and said she would be making some calls to see what they could do for us.\n* **4:00pm Friday:** Wife called me to let me know that someone from Bank of America's \"Regulatory Complaints Department\" had called her in regards to the CFPB complaint filed earlier in the day. He called at 10 minutes before his office closed and my wife didn't get the message until after. We planned to call Monday morning.\n* **9:00am Saturday:** Wife wakes me up and says the money is back in the account as a \"Misc Credit\"\n* **9:00am Today:** I call CFPB. They say the complaint is still open with the bank and they usually respond within 15 days.\n* **9:00am Today:** I call the number left by BofA's Regulatory Complaints Department. Leave a voicemail. Wife calls him from work and leaves a voice mail\n* **1:00pm Today:** We get a notification from Bank of America that the dispute is closed. We're done. We will wait until the notice comes in the mail before we shut our accounts and move.\n\nI hope that anyone else in our situation now or in the future can use this to get some fast results too.\n\nThanks to everyone who commented with advice, their own stories, and kind words to keep me motivated throughout the process.",
    "comments": [
        {
            "level": 0,
            "comment": "\"We will wait until the notice comes in the mail before we shut our accounts and move.\"\n\nI love a happy ending.",
            "score": 8085,
            "author": "Wruin",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\*smiles in *credit union*\\*  \n\n\n&amp;#x200B;\n\nedit: Some have asked... How to find a credit union:\n\n&gt;The National Credit Union Administration (NCUA), the agency that oversees federal credit unions, provides a [credit union locator](http://www.mycreditunion.gov/)  online. Start by searching within your geographic area, then check  eligibility requirements to see if you can join any nearby credit  unions.^(1)  \n&gt;  \n&gt;If you can’t find a credit union in your neighborhood, search  nationally. It may be possible to find a credit union elsewhere that you  can qualify for (remember you can still use a local credit union’s  branch if they’re part of the [CU Service Center](https://www.thebalance.com/can-i-make-a-deposit-at-any-credit-union-315398) network).\n\n^(1) Try calling any CU you like, many are switching to accepting anyone!  \n\n\nFull article for more in depth research: [https://www.thebalance.com/how-to-find-a-credit-union-315397](https://www.thebalance.com/how-to-find-a-credit-union-315397)\n\n  \nI would also check yelp ratings.  \n",
                    "score": 4800,
                    "author": "TheReelStig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember someone posting a link to all of the best banks in near you but I can never find it. \n\nEdit:  Best financial institutions, I understand credit unions are generally better than banks.  It was like a side link a few years ago I thought.\n\nI saw once and forget to save it, neber to be seen again.",
                            "score": 342,
                            "author": "AnjinToronaga",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, you sure wont find BofA on that list",
                                    "score": 397,
                                    "author": "EyeLike2Watch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I doubt BofA is going to be on anyone's list of best banks. They are a company of scumbags. ",
                                            "score": 233,
                                            "author": "skippythewonder",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The bank I work for is a mid size bank located in two states. I found out we have a 5 star rating on Bank Rate.com ! And yes, I bank at my job... we got our mortgage there, too, although it was bundled up and sold off to a larger bank. No  complaints so far, they always honor my online payments and haven't opened any fraudulent accounts in our names yet !  :)",
                                                    "score": 110,
                                                    "author": "DeeBee1968",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "and what a fucking low standard that is",
                                                            "score": 141,
                                                            "author": "tuckmuck203",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "For real. Credit union for life.",
                                                                    "score": 40,
                                                                    "author": "D-Rictus",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah that website is absolute shit if it gives tcfbank 5 stars lol. They stole thousands from me in my teens by switching around when transactions were posted and making large transactions from multiple days ago go in first so I would go negative. ",
                                                            "score": 13,
                                                            "author": "Sphinctuss",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "How dare you sully the reputation of scumbags.",
                                                    "score": 20,
                                                    "author": "ReverendEarthwormJim"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 17,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not gonna lie. I miss my bofa account. The 6 times I had to overdraft I called them and asked for the fee back and they gave it back every time. Never had an issue with them. Then arvest bought bofa in my area and my account became an arvest and I hate them even more",
                                                    "score": 9,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What about Chase?",
                                                    "score": 12,
                                                    "author": "sgiuxxx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I've had quite a few different banks and credit cards in my life. Chase is the only one I can give a good review for to this day. I've been disappointed by everyone else, but Chase is always on top of it. It's anecdotal praise, but until they prove me wrong I'm sticking with them.  ",
                                                            "score": 12,
                                                            "author": "MylesGarrettDROY",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I won't find BofA what? ",
                                            "score": 37,
                                            "author": "Merouxsis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "BofA THESE NUTS",
                                                    "score": 151,
                                                    "author": "SuspiciousScript",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Got eeem!",
                                                            "score": 43,
                                                            "author": "coleyboley25",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 40,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went down to a local bank, 5/3rd, purchased a cashiers check, and stood at their counter to scan it via my USAA app. \n\nI got some nasty looks after that. \n\nBut fuck them, they stole 800 bucks from me and I am still fighting to get it back. The links here will help. ",
                                            "score": 112,
                                            "author": "flyingwolf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 35,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm in the process of switching to them for banking! I didn't actually know they did full banking services until recently, when I had to transfer the address for a renter's policy, and the rep mentioned something about it. \n\nI've used USAA for a few different insurance policies for years, and I've never had a single bad thing I could say about them. Every time I've had to speak to anyone on the phone for anything, they've been super easy and helpful. \n\nFor customer service quality at least, I'd recommend them to everyone. ",
                                                            "score": 33,
                                                            "author": "Vet_Leeber",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have nothing but good things to say about USAA. Their customer service is second to none.",
                                                                    "score": 33,
                                                                    "author": "Zombie_Biologist",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 21,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;Navyfed\n\nI'm happy with USAA, but I'd sure like to be able to regularly reference using the seamen bank.\n",
                                                                                    "score": 39,
                                                                                    "author": "phoide",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I used to say that too, I had an issue this past year that destroyed my faith in them (spoiler alert, I still bank with them)\n\nI had an issue where my entire checking account would simply disappear for hours at a time, randomly. I know that sounds nuts, but it did. If I had autopay bills come due while is was MIA, they simply wouldn’t get paid.\n\nI absolutely could not get past tier one support despite vigorous efforts over several months. I’d call in and since the tier 1 folks couldn’t see it either, they’d argue with me that I didn’t have a checking account with them.\n\nThen they’d ask me if I was using my phone or a computer to check it.  If I said either one, they’d transfer me to technical support where they’d tell me to “make sure my app was updated” or ‘make sure I was using the latest webbrowser’ I even had one sweet, well intentioned tier 1 person ask me where I lived, and when I told her, she replied that it had been cloudy in my part of the country and THAT was interfering with my phone.\n\nI never expressed the blind, incoherent rage that was building, but I absolutely could not get past tier 1 regardless of what I said or did. Toward the end, I thought it might be a firing offense to get me to tier 2.  And it was frightening seeing my checking account randomly pop into and out existence and my own bank arguing with me about it.\n\nI finally searched and carpetbombed as many “executive” email addresses as I could find on the Internet, including a couple to the CEO. \n\nI STILL never got to talk anyone who seemed to understand what was happening, and eventually got an email saying the issue had “been resolved and shouldn’t recur.”\n\nIt really shattered my faith in the previously solid and service oriented USAA. ",
                                                                            "score": 17,
                                                                            "author": "shadrap"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Is it true you gotta be a military member to get an account there",
                                                    "score": 9,
                                                    "author": "kingcolbe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or a family member of the military or former military.\n\nIf you can pull up your grandpa's military info you can get an account. ",
                                                            "score": 28,
                                                            "author": "flyingwolf",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And I guess he’d have to be alive?",
                                                                    "score": 6,
                                                                    "author": "kingcolbe",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nope, you just have to have proof of previous military service.\n\nSuch as a DD214 would be plenty. ",
                                                                            "score": 15,
                                                                            "author": "flyingwolf",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 10,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My credit union's ATM card works on a pretty good ATM network so I can deposit checks at many bank ATMs.  And the network doesn't charge for \"foreign\" deposits (only withdrawals)...so never pay any fees.",
                                            "score": 12,
                                            "author": "David511us",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I use Simple and have for a few years now, I can pretty reliably deposit a check by photo and have it available in a couple days. I've not been super great with my finances for our entire relationship and they're still good to me. No fees etc, plus any time I've needed customer service they were bros. ",
                                                    "score": 10,
                                                    "author": "philipalanoneal"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just get one. Almost every credit union participates in \"Shared Branching\" where you can use your account at ANY Credit Union. I found it much more convenient than a bank I had to look for. Easier to find any credit union instead of one BFA.",
                                    "score": 17,
                                    "author": "Tryin2dogood",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If you find this could you please link me? :)",
                                    "score": 11,
                                    "author": "astraiox",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Alliant, all the way",
                                    "score": 5,
                                    "author": "supratachophobia",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed.  Big banks are the WORST, and ESPECIALLY BOA.  Credit Unions are the way to go.  Good luck and good riddance to BOA!",
                            "score": 273,
                            "author": "InkSpotShanty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can use an online bank like discover or Ally where you get much higher interest rates on your savings. ",
                                    "score": 125,
                                    "author": "Wampawacka",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Alliant credit union. ",
                                            "score": 20,
                                            "author": "HoMaster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Seen very good things about Alliant, and only hurdle (if you can call it that) I've seen is the small donation if you are not Chicago resident, I believe",
                                                    "score": 16,
                                                    "author": "Holo-Kraft",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I keep seeing Ally being mentioned and not so much about Marcus by Goldman Sachs. From a numbers standpoint Marcus has a higher savings rate than Ally. I'm relatively new to this, and dunno much between the two, so what's the difference that make people prefer Ally more? ",
                                            "score": 53,
                                            "author": "MrWm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Marcus...Sachs...?\n\nI mean I get Goldman Sachs owns them but I’ve never seen it written like that...\n\nMarcus by Goldman Sachs",
                                                    "score": 50,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "lol i literally had no idea what Marcus Sachs was.,",
                                                            "score": 9,
                                                            "author": "greg19735"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Marcus, by Marcus Jacobs.",
                                                            "score": 7,
                                                            "author": "Heyoni"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Ally has a checking account and therefore can transact more than 6x a month as well as a brokerage, however I use Marcus since I almost strictly use a credit card and then pay that bill from the savings and have less than 5 other transactions a month",
                                                    "score": 56,
                                                    "author": "lefty5258"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is USAA that good? I have them for a credit card and car insurance, but hadn't looked at them for banking. ",
                                            "score": 5,
                                            "author": "RPRob1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "* They cover the fees ATMs from other banks charge.  There is a limit of $15/month of fees they'll cover, but I typically use an ATM less than once a month so that isn't really a problem.  I love not having to hunt down a specific ATM.  I just walk up to the nearest one, and it is free for me.\n\n* Other banks have kind of caught up now, but for a long time their online deposit was something no one else had (that I knew of).  Before smartphones, they offered online depositing of checks by sticking them on a flatbed scanner on a PC as early as 2006.  They added smartphone camera deposit support in 2009.  Before that, they would mail me a stack of prepaid envelopes, so if I had a check I would just stick it in the free envelope and drop it in the mail.  Because they don't have branches scattered around the country, they've always been very focused and a leader in online/remote services.\n\n* Free checking.  No fees, no minimums.\n\n* They used to be one of the only US banks offering a true chip-and-pin card, which was great for international travelers.  I traveled around Europe, and often had to help other Americans purchase things when I was the only one with a credit card that worked in the kiosks.  However, they dropped this product and replaced the cards of everyone who had it with non chip-and-pin cards.  Not sure why, but it happened when they transitioned from Mastercard to Visa, so I suspect dropping it was a side-effect and not specifically intended.\n\n* Bitcoin friendly.  While some banks are cancelling the accounts of people found transferring money in/out of Bitcoin, USAA has Coinbase integration.  It' s nothing fancy, and just shows my Coinbase balances within USAA's site, but it shows they're not afraid of Bitcoin users.\n\nAnd that's not even getting into their famed customer support...\n\nI see people talking about things like if a bank has branches nearby, and that is meaningless to me.  I think the last time I went into a bank branch was the early '90s.",
                                                    "score": 14,
                                                    "author": "mattbuford",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "USAA is AWESOME. Use them for home insurance, car insurance, and banking. Definitely recommend!",
                                                    "score": 8,
                                                    "author": "jjdawgs84"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Never had an issue with a big bank. Chase is my go to. Huge footprint, great credit cards, good offering of services, no complaints. ",
                                    "score": 34,
                                    "author": "rebelx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same here - but it seems like with big banks, 99.99% of people have no issues, and 0.001% get absolutely screwed. Using a big bank is making a gamble that you're not in that 0.001%.",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, I will take that gamble for the benefits China",
                                                    "score": 5,
                                                    "author": "rebelx"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Credit union has been trying to bleed my wife dry with bogus NSF fees.",
                                    "score": 30,
                                    "author": "Le4chanFTW",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Credit unions are better overall, but not all credit unions are good.",
                                            "score": 46,
                                            "author": "francolol",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Credit unions are the best.  However always make sure you either have 1 big bank or a big CC when traveling abroad. Usually have less strict travel rules and atm usage.  ",
                            "score": 27,
                            "author": "pilkingtun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Charles Schwab’s free checking is amazing for travel. I use a local bank and have an external transfer set up to my Schwab account. They don’t charge any foreign transaction fees and refund ALL ATM fees at the end of each month. Wife and I spent 8 weeks in Thailand and got refunded a total of $130 in ATM fees. I never worried about needing to carry too much cash, I just pulled out what I needed when I needed it. As a regular traveler/backpacker it’s been a lifesaver.",
                                    "score": 14,
                                    "author": "slow_down_kid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had a weird issue where Schwab closed my checking account the day I was heading to India for three months.  Their customer service was amazing in making me a new account and getting me a new debit card in India.  They even deposited $500 into my account as an apology.  In a time where many companies are pure evil, I will always vouch for Schwab",
                                            "score": 15,
                                            "author": "Bad_Karma21",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s awesome! I hate doing the whole r/HailCorporate thing with them but I do a lot of budget traveling and it really has been a godsend, and it surprises me how many fellow travelers are unaware of the perks they provide.",
                                                    "score": 6,
                                                    "author": "slow_down_kid",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Be careful as a lot of Credit Unions will hold you responsible for at least part of the fraud. I think the minimum I have seen them do is $50. \n\nEdit: thank you for the downvotes from stating something that has literally happened to me. I have had 2 CU tell me that I was responsible for the first $50. I went to a regional bank to find a middle ground and am pretty happy. ",
                            "score": 38,
                            "author": "pulpandlumber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I switched from Wells Fargo to a local credit union, I took some advice that I saw here and got an Amazon Prime Credit card to use for all of my daily purchases (and obviously pay it off every month). \n\nI never use my debit card except to get cash at the bank (and therefore at a minimal risk for theft), and I get all of the protection of Chase Visa on my purchases, plus points to use on Amazon. Kind of the best of both words if you can be disciplined enough to not let the balance of the credit card pile up. ",
                                    "score": 31,
                                    "author": "Cheaperthantherapy13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "BTW, don't use the points at Amazon, as you get $0 cash back. You can redeem points for a credit to your bill, and buy the same item, and still get 5% back.",
                                            "score": 31,
                                            "author": "MajinBlayze",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Damn. I’ve never thought of that. Thanks internet stranger!",
                                                    "score": 7,
                                                    "author": "Cheaperthantherapy13"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Everything I've heard about BoA is that they suck. So much so one was for closed upon. I would like nothing more than to see BoA rot. My parents have had huge troubles with them when they were with them. ",
                    "score": 42,
                    "author": "Guac_in_my_rarri",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work for a large bank and we often communicate with other banks, so I know roughly what the interior of most banks is like. Trust me when I tell you that all banks suck. They all have arbitrary rules and procedures that have to be followed just exactly, they all have arbitrary limitations and arbitrary systems (because they're usually only updated when cheap corporate management decides), and they all have a million stories just like this one. \n\nLast week it was Wells Fargo, today it's Bank of America, and I'm sure Chase is due for some \"fun\" publicity soon.",
                            "score": 33,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do banks really care when you have such little money in an account vs someone who has $500k?",
                    "score": 9,
                    "author": "flimspringfield",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know about their overall history but I've been with Chase for over 10 years now and never had any issues. I've had a couple times that fake transactions got charged and they immediately refunded me. Lost cards they try to go through the last few transactions to verify it was all used by you and will replace them pretty quick. I've been tempted to switch to a credit union but I have had zero issue with them I don't see the point.",
                            "score": 44,
                            "author": "dvaunr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea I'm going to have to vouch for Chase also as a long-time customer.",
                                    "score": 19,
                                    "author": "scorchedearthxy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ditto, their mortgage process sucked because they over estimate everything (apparently they have to pay the difference if their disclosure are\ntoo low), but they’ve beaten everyone’s rates and their customer service has been spot on at my branch.",
                                            "score": 10,
                                            "author": "NerdBanger"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Find a good credit union in your area that’s part of the nation wide coop.  Best decision I made.  BofA pulled this bullshit with a stolen check YEARS ago.  I sign pretty hard which left an impression  on the next few checks even though the plastic backer provided was used.  An old roommate found my check book, swiped a check, and cashed it for $2000.  For some reason BofA cashed the check, even though there wasn’t enough funds available.  When I filed a stolen check complaint, they did an investigation and said the sig matched previous checks and denied the claim.  Was a huge mess.  Closed my accounts and got a lawyer.  Never got my money back, but didn’t have to pay the over drawn amount or the fees or the lawyer fees.  I stopped using checks and BofA (and banks period) at that point.\n\nGlad things worked out for you!  Always great to hear good news!!",
                    "score": 5,
                    "author": "onestopmedic",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "its just kind of crazy to think you had to call your state representative and CFPB to get them moving ",
            "score": 1439,
            "author": "highwayzoneofdanger",
            "replies": [
                {
                    "level": 1,
                    "comment": "In college I couldn't be my academic advisor to meet with me to give me a PIN to register for classes. Dude was pretty wealthy due to an invention and basically checked out; however,  he was a tenured big-name professor. I tried everything - talking to dean, leaving post-it notes on advisors door, etc. I wasn't at some huge university - relatively small.  I got exasperated and emailed the president of the University and cc'd all the people who had not helped along the way.  I had been trying for weeks to get a PIN. Within a half hour of sending the email the situation was resolved.  The dean called me into her office to reprimand me and actually called my father to tell him what I'd done. The latter was a weird strategy because my dad unsurprisingly was irritated with the dean and not me. Anyway my point is it's amazing how high you have to escalate some things before they get resolved - even when they're pretty minor.",
                    "score": 1248,
                    "author": "newaccount721",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1245,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn't that a FERPA violation? In the US",
                                    "score": 545,
                                    "author": "Free2Be_EmilyG",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "most colleges give students the option to waive their ferpa rights WRT their parents.",
                                            "score": 142,
                                            "author": "uh_no_"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't think ferpa covers emails too much about registration pins. It would cover specific class registration and grades. But not interactions with the dean. \n\nI think.",
                                            "score": 72,
                                            "author": "Average650",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My understanding, after doing ferpa training at my college, is that you cannot even acknowledge that a student does or doesn't go to the school. Talking about a pin for classes is obvious that the student goes there. You have to sign a release for your parents to know anything. I believe the releases are specific to ( i.e. grades, financials, etc.) I would think this would be a ferpa violation, but I'm not a legal professional, just a college student who is a TA.",
                                                    "score": 130,
                                                    "author": "JoshSnipes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A school can disclose \"directory information\" without your permission. Directory Information can include such things as name, address, telephone listing, date and place of birth, participation in officially recognized activities and sports, and **dates of attendance**. There has to be a sufficiently public notice of what types of information the school considers directory information, and both the student and their parent(s) have to have the option to opt out of disclosing said directory info.\n\nThat said: when in doubt, treat all information as a protected education record.",
                                                            "score": 46,
                                                            "author": "georgecm12",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Aww this was also on there. Thank you for adding this. Also, better to be safe then sorry is always good advice for this kind of stuff.",
                                                                    "score": 7,
                                                                    "author": "JoshSnipes"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Very embarrassing ",
                                    "score": 48,
                                    "author": "Harpylady269"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Excuse me, Mr and Mrs /u/hchan1? They will be coming home with a very poor mark on their Stats 101 exam. You will need to sign it so that they can return a copy for our records.\"",
                                    "score": 36,
                                    "author": "illsmosisyou"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Assuming because you said Dean, your university/college dean called your dad? wtf is that shit??",
                            "score": 175,
                            "author": "ShaneoMc1989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol yeah it was the dean for my specific discipline (engineering). It was really very odd.  I also didn't go to like some unknown weird college so it was pretty weird. I'm guessing she was upset it made her look bad and then did that when she was angry and not thinking rationally. It was a weird situation. Also, when I emailed the president I just got a permanent PIN so that I'd never need to meet with an advisor again unless I wanted/needed to. So even though the dean called me in to tell me never to do it again, every practical outcome was positive so of course it'd be my go to if I had an issue in the future. ",
                                    "score": 243,
                                    "author": "newaccount721",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "haha I think any parent would be like... why are you calling me about my 20 plus son, what am I going to do, ground him?",
                                            "score": 90,
                                            "author": "ShaneoMc1989",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah my dad had already known about the story so he was irritated by the registration situation. Then the dean called to complain about while he was working so all and all not thrilled",
                                                    "score": 76,
                                                    "author": "newaccount721",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Could you probably report her to the director for that as well? If she's going to go out of her way to contact your father like that because she was embarrassed and angry, I wouldn't leave her in charge of the school bake sale, let alone be in charge of an entire discipline at the college",
                                                            "score": 54,
                                                            "author": "CocainParty",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's fair enough. It's actually a pretty major college which makes it weirder. She's left since then though, so I guess that's good",
                                                                    "score": 26,
                                                                    "author": "newaccount721"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Similar ish, I heard a friend had an issue with financial aid dealing their feet, like not refunding students even ten weeks into the semester. They kept blowing him off, he reported them to the DoE. They sent one email, two days later he got his refund lol",
                                            "score": 30,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey we found your money! What a coincidence heh heh it was right in our accounts *please don't sue us*",
                                                    "score": 13,
                                                    "author": "dingman58"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; The dean called me into her office to reprimand me and actually called my father to tell him what I'd done. \n\nDean: *dials phone* Hello kid's Dad.  We gave your son the run around for weeks and made it very hard for him to register for classes, and he called us out on our bullshit!  What kind of a parent are you??",
                            "score": 32,
                            "author": "CuddlePirate420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Terribly sorry, sir. I should have taught my son to tuck his tail and walk away. ",
                                    "score": 6,
                                    "author": "LegendOfSchellda"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Faculty at colleges/universities can be some of the most undeservedly arrogant, entitled twats that have ever roamed the earth. I don't pretend to know why, just that in my experience it's a true observation. Not all of them of course, but seems that people like that tend to concentrate in \"higher education\" teaching positions. ",
                            "score": 57,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; concentrate in \"higher education\" teaching positions\n\nWell that's mistake #1. At any research university (basically all state schools, and any private school that doesn't specifically bill itself as 'liberal arts' or 'undergraduate institution'), the faculty positions are NOT teaching positions. They're research positions that sometimes also require teaching. All of the faculty were evaluated and hired based on their research potential, with teaching getting much less consideration. Many faculty embrace the dual roles, but for a significant minority, if you're talking to them about teaching, registration, forms, whatever that isn't research, you're already bothering them with something that they'd rather not be doing.\n\nAdd on top of that that the academic market has a kind of 'rockstar' feel to it. There aren't enough tenure-track academic positions for everyone who wants one to get one. In fact, there aren't enough by a longshot. So the people who do get these jobs, even at what might otherwise be considered mid-level state schools, typically did their PhD at highly ranked universities, had prestigious postdocs, and beat out like 100 other candidates for the job. \n\nI think that kind of highly competitive process does some selecting for people who thrive on that attention, have very high self-confidence (bordering on arrogance), etc. ",
                                    "score": 43,
                                    "author": "TheoryOfSomething",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dealing with my college's staff made me lose faith in bureaucracy and dissuaded me from joining a government job after I got my degree.\n\nThe professor of my last class tried to fail me and delay my graduation a year so I had to go to through the grade appeal process. The first step was meeting with my professor and presenting why I thought I shouldn't have got an F in the class. I referenced the syllabus where it clearly outlined the grade breakdown but of course he didn't want to listen.\n\nThe second step was going to the dean of my major. We scheduled a meeting and I spend all night preparing a portfolio of class materials, grades, reports, and documents to support my side of the argument. I show up to his office at the scheduled time, introduce myself, and start bringing up the topics of my appeal, but immediately it feels like I'm in the same chair many other desperate students were sitting in. He seems unconcerned and glosses over the documents as I hand them to him, almost as if he's already decided. I burn through my prepared speech faster than expected. When it's his turn to talk he irrelevantly brings up the grade appeal process and almost like a script he says the next step will be meeting the grade committee. I try to ask him questions, if he even approves or denies my appeal because I need that to progress, but he keeps vaguely answering \"Trust the process.\" He talks a lot but doesn't say much. \"Trust the process.\"\n\nSo I went to the grade committee. And after writing up a 12 page report you know what they said? They said that my department dean has to send a signed form approving or denying my appeal before they'll even read it.\n\nAt this point I was tired of the bullshit so I CC'ed everyone in an email and attached the form. I included an advisor, head of the grade committee, department dean, and my professor and told them that the grade committee requested the report be signed with their approval or denial of my appeal.\n\nIt set off bombs. Half a day goes by and the department dean says he will meet with the professor. The next morning he says the professor will handle the rest of the appeal. The professor sends an appointment to meet. He said he will regrade my project due to the points I brought up in the syllabus. Two days go by and I check my grade, to my surprise my F was changed into an A. I graduate cum laude.",
                            "score": 25,
                            "author": "Willbo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Frankly, this is always my strategy. I usually give it one try though the proper channels (customer service or whatever) before I send an email to the head of the company (or least the division). These people don’t like to hear from me so usually they forward to someone else below them saying fix this and magically things get fixed. ",
                            "score": 39,
                            "author": "k_golden",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oh, I fucking WISH a dean would call me to try to complain about something like that. I'd call him every day to bitch him out for being an incompetent ass until he filtered my calls, then I'd have other people call him and take over the call when he picked up. It would be my hobby to remind him how stupid he was. ",
                            "score": 82,
                            "author": "NightGod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your financial aid locked down?",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think u/NightGod is the dad in this situation ",
                                            "score": 12,
                                            "author": "faderjack"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As someone who works in sales I completely understand. Sometimes you have to Cc the c levels and directors and be like who wants to take the lead.",
                            "score": 11,
                            "author": "jaysomething2"
                        },
                        {
                            "level": 2,
                            "comment": "I'm fairly certain the last part is illegal. A college can share zero things about you to anyone who isn't you. That's why they always make incoming freshman sign the authorized contacts form when parents bring them in for orientation, so parents know the rules and so students are pressured into granting helicopter parent access.\n\nEdit: to be clear the form grants the access and sharing that is otherwise illegal",
                            "score": 18,
                            "author": "ciabattabing16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Okay, so my college was really weird about this stuff. Apparently they can't 'share' things with people who aren't you, BUT they can have you sign or give access to other individuals if they pressure you.\n\nAlmost every college does this. Your college can't force you to sign it, but your parents don't have to pay for your college either.\n\n",
                                            "score": 14,
                                            "author": "uh_no_",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 147,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "State legislators are a fantastic resource for this stuff. They will have liaisons to all of the departments and can kick the can up the chain way more quickly than average joe trying to get ahold oh someone on the phone. Glad it worked out for OP",
                            "score": 33,
                            "author": "Ivota"
                        },
                        {
                            "level": 2,
                            "comment": "They only meet every two years for 140 days. They have a lot of free time. ",
                            "score": 21,
                            "author": "StraightUpBruja",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 46,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s my job too. I won’t say we live in fear of the CFPB but we do live by the mantra “what would the CFPB say about this.” I think it’s great actually. ",
                            "score": 35,
                            "author": "wallflower7522",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bank of America reneged on a $200ish open-a-checking-account offer about 10 years ago. It came down to me threatening to go to the FTC and state attorney general with one of their VPs in order for them to pay up.",
                    "score": 18,
                    "author": "drdookie"
                },
                {
                    "level": 1,
                    "comment": "I was once rear-ended, woman's fault because her dog had a seizure and she freaked out.\n\nTook pics and all.  I call her insurance to file claim and didn't hear back for a week.  I called them for status and they said they spoke to their customer and that she stated I backed up and rammed her.\n\nNo proof that she hit me other than screw marks on my bumper.\n\nAfter that they stopped answering my calls until I threatened to call the state insurance commissioner.\n\nGot a call back within 5 minutes.",
                    "score": 8,
                    "author": "flimspringfield",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1069,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or if it was slowly being neutered, which it is...",
                    "score": 304,
                    "author": "illsmosisyou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well there is always Canada.",
                            "score": 29,
                            "author": "Alarid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Consumer protection is under attack here, too. ",
                                    "score": 24,
                                    "author": "Q-Lyme",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To add on to your last comment: just as with Pruitt and the EPA, the former acting direct Mick Mulvaney was an outspoken critic of the CFPB before taking charge there. [In 2014 he said that, \"\\[The CFPB\\] is a wonderful example of how a bureaucracy will function if it has no accountability to anybody. It turns up being a joke, and that’s what the CFPB really has been, in a sick, sad kind of way, because you’ve got an institution that has tremendous authority over what you all do for a living.”](https://www.vox.com/policy-and-politics/2017/11/16/16667266/mick-mulvaney-cfpb-cordray-omb-joke) While he was director, he [\"reportedly scaled back an investigation into the Equifax data breach, relaxed restrictions on often predatory payday lenders, recommended Congress pursue sweeping changes to the CFPB’s powers, and dismantled financial protections for the military.\"](https://www.vox.com/policy-and-politics/2018/12/20/18150251/cfpb-logo-mick-mulvaney-kathy-kraninger-bcfp)\n\nA new director was confirmed for the standard 5 year term last month, so we will see what happens of the bureau now.",
                    "score": 136,
                    "author": "mityman50",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We didn't need any more investigation into Equifax, it was fucking obvious shitty security practices are what caused the problem.\n\nWhat we needed was the ability to sue them out of existence for losing our data.",
                            "score": 70,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They didn't lose our data, they found it!\n\nFound it for anyone who might want it.",
                                    "score": 24,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "By this point I fully expected them to be out of business. I just cannot believe that our regulators have taken no action. ",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And almost half of the American voters want this. Seems like some weird sort of Stockholm syndrome.",
                            "score": 8,
                            "author": "L3tum",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Who needs consumer protection? The free market will sort it out!",
                    "score": 49,
                    "author": "boozername",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had the same issue but with gas/heating.\n\nMade a payment but their site fritzed out and didn't give me a confirmation number, though since the money was deducted from my bank account I believed all was good. Then they proceeded to tell me I hadn't paid it when I clearly had, and they wouldn't even take my bank statement showing the debit card charge as proof I had paid.\n\nGot in touch with the Texas Railroad Commission, who have nothing to do with railways anymore but do regulate residential gas service amongst other things, and voila, solved.\n\nIt shouldn't take doing things like that, but sometimes it does. ",
                            "score": 6,
                            "author": "Sparta2019",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unless of course it's for mail. The postal inspector descends like an angry rabid hawk when they get a case. ",
                    "score": 14,
                    "author": "forgottt3n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one messes with USPIS. They guard what you lick.",
                            "score": 12,
                            "author": "bgottfried91",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 83,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool thing with filing a complaint with the CFPB is you get you write a review on your case after it was closes. All of this is public info (if you choose to allow it when you submit your case). The CFPB reviewers remove personal info.\n\nWhen you write your review, you get a chance to explain what you had to do to get your money back and how the bank corrected their mistake.",
                    "score": 92,
                    "author": "IveGotDMunchies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "God I hope you get a bloody credit card.",
            "score": 539,
            "author": "Bloated_Plaid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wife: \"I have one...with fucking Bank of America.\"\n\nedit: Wife: \"You didn't quote me correctly. I said *fucking* Bank of America.",
                    "score": 784,
                    "author": "IveGotDMunchies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who it’s with doesn’t matter, what matters is that it’s a credit card and not a debit card. Your chargeback and dispute process with a credit card is way less of a headache than with Debit and your money isn’t tied up while it gets resolved.\n\nEdit: ok I get it, Bank of America is shitty. But what I’m saying still holds because it’s not your money tied up, and in general the process is easier to navigate.",
                            "score": 241,
                            "author": "unborracho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The old adage \"with debit the bank is fighting for your money, with credit the bank is fighting for their money\"",
                                    "score": 191,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed but I'd still get a different CC as a matter of principle. BOA treated them like shit. It's much more straight forward to resolve fraud with a credit card than a debit card, as you said, but most banks aren't total assholes about it. I had my debit card stolen once (which I only use to withdraw cash) and it took a 2 minute phone call to get the charges removed.  ",
                                    "score": 50,
                                    "author": "newaccount721",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Depending on how old the card is, the better option is to relegate to the \"charge something on it once every six months to keep it open\" category to keep your credit score happy. Unless you can take the hit, then yeah... fuck 'em.",
                                            "score": 14,
                                            "author": "LucasSatie",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This. At 22 I had about $200 in cash back on a card. Chase cancelled it out of the blue, claiming \"credit issues\". Bitch, you gave me the card and my credit had only gone up since! Real reason was recession and the card terms being too good. \n\nThe $200? Gone. \n\nBank service? Gave me cold shoulder. \n\nMy business with Chase since? $0\n\nHope they enjoy the $200 while my lifetime of high net worth banking services are provided by competitors. Though I may sign up for a few cards along the way...to reap the promotion bonus and laugh as I then cancel it. Fuck you, Chase ",
                                            "score": 13,
                                            "author": "hurricane14",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where do you have your accounts? Credit unions?\n\nI've been wanting to move my accounts to my credit union, but their online banking system is terrible. ",
                                    "score": 7,
                                    "author": "Seref15",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ally is pretty good and has had did reviews in general.",
                                            "score": 8,
                                            "author": "lasagnaman",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My BoA rewards credit cards give me free cash back on a bunch of stuff, can’t complain about those. ",
                            "score": 10,
                            "author": "812many",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Frank Abagnale gave this advice in his Talk At Google. \n\nNever charge anything to debit, always credit. The credit card company has literally teams of people who solve these problems for them instead just you vs. vendor/bank. ",
                    "score": 38,
                    "author": "phileat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now just make sure you don’t get a 1099 issued for this credit.\n\nEdit: some confusion here.  1099-MISC are usually issued by a bank for things like interest on accounts and incentives.  When I bought a house, BofA fucked up my paperwork and gave me $1,000 to “make it right” in the form of a credit.  They then issued a 1099-MISC, which required I pay income tax on that $1,000.  OP should NOT get a 1099-MISC, but given the bank and the fuckups to date, It wouldn’t surprise me.  OP: if you get a 1099, dispute it with the bank immediately (the IRS also receives records of any 1099s issued).",
            "score": 285,
            "author": "secondarysortindex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uhhhhh, what? This is a very teachable moment for the uneducated masses. Or just me if you don't mind. ",
                    "score": 99,
                    "author": "ryancn08",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's essentially a \"miscellaneous income\" form that you file with your taxes, for income earned aside from something like an employer. Banks issue them for certain things, generally interest earned on account balances. ",
                            "score": 52,
                            "author": "xcjlongbow",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; 1099-MISC\n\nFunny you brought that up, I got one of those last year from the bank that manages one of my credit cards, and it was for $5.00 (I pretty much just laughed when I saw it). Neither I nor my accountant could figure out why I received it. A few weeks later, they sent me a corrected one with the accurate amount of $0.00, since I had no reason at all to warrant receiving such a form or statement.\n\nIn retrospect, I probably should have just called them and asked about it (and I will next time), but I'm glad somebody caught it and corrected it.",
                    "score": 8,
                    "author": "systembusy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Mr. Strickland's district (howdy neighbor!). Nice to know he's looking out for us. Also, big banks suck",
            "score": 40,
            "author": "EyeLike2Watch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bedford here! I drive by his office all the time, see the sign for his name and never even think twice about it. His office was really quick to respond. I'll be stopping by later this week to drop off some thank you's. :D",
                    "score": 38,
                    "author": "IveGotDMunchies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bedford as well. The name triggered my memory of the green street sign they put up for his office.",
                            "score": 8,
                            "author": "EyeLike2Watch",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad it happened so quickly once you guys took the right steps. Sad it has to come to be escalated before it gets resolved, but at least it's over now. Onto a better bank/credit union!",
            "score": 40,
            "author": "tedwinaslowsby",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Never do business with **Bank of America OR Wells Fargo**!! ",
            "score": 254,
            "author": "Immo406",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 75,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not something you really have control over :( ",
                            "score": 56,
                            "author": "Immo406",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I refinanced through my local credit union I told them I'd only do it through them if they didn't sell it.\n\nThey said OK and added a clause to the contract saying they won't sell it. Sometimes when you want a thing, you can just ask for it and it actually works.",
                                    "score": 66,
                                    "author": "fooey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Parents did that. It got sold anyways. They we're pissed because they didn't learn about it till they had damage over 10k to the property and had to go through some sleazy broker a state over that held their check hostage for 6 months",
                                            "score": 16,
                                            "author": "pizzaboy192",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mortgages are sold in bulk, not individually. There is no way any bank in the housing business is going to cherry-pick when selling mortgages, they're just betting you won't attempt to lawyer up. In the long-run, it's far cheaper and lucrative.",
                                                    "score": 10,
                                                    "author": "Some_Human_On_Reddit",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yea credit unions are great to their customers. ",
                                            "score": 17,
                                            "author": "Immo406",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wells acquired my mortgage several years ago. I never had a problem with them. ",
                            "score": 14,
                            "author": "sammiemo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They just removed the ability to make a principle only mortgage payment using their app. Now you have to go to a branch to do it in person. \n\nThat's pretty annoying, removing functionality like that. ",
                                    "score": 16,
                                    "author": "Flawless44"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a former Wells Fargo employee: RUN\n\nI don’t bank with Wells or BoA. Both are terrible. Made the switch to Ally and I’ll never go back. ",
                    "score": 11,
                    "author": "SunnyDayGo"
                },
                {
                    "level": 1,
                    "comment": "That said part is at one time they didn't suck.",
                    "score": 9,
                    "author": "NotYou007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean back when they were terribly secured stage coaches that lost and \"lost\" money to highwaymen?",
                            "score": 10,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've never had an issue with Wells Fargo. When I had bank of america, however, nonstop issues. ",
                    "score": 4,
                    "author": "x0EvilPikachu0x",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 130,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. These banks are garbage. ",
                    "score": 56,
                    "author": "SavageOrc",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Without agreeing or disagreeing, this argument is a form of Availability Bias - there are a lot of examples of the big banks having problems because they have a much larger number of interactions than the small banks. They may or may not have higher rates of bad interactions.",
                    "score": 9,
                    "author": "CerebusGortok",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad it worked out for you. It’s a lot easier to look after these things with a CC. ",
            "score": 13,
            "author": "creatorofcm"
        },
        {
            "level": 0,
            "comment": "It's pitiful that we have to get hold of a Congress person to fix a bank fraud error. That's...bank fraud.",
            "score": 24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was the CFPB complaint that did the trick. \n\nBanks don’t like to have lots of complaints filed with CFPB. ",
                    "score": 24,
                    "author": "BouncingDeadCats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm still on the fence about what did the trick. To be honest, I think it was a combination of both.\n\nFrom my other post, it seemed like it took people 5-7 days to get their money returned. The money being in the account at 9am on a Saturday tells me they probably stuck it in on Friday.\n\nI was also annoying enough on social media to have them block me on Facebook. So who knows. :D\n\nIf anyone was to ask me, I would definitely say #1: File a CFPB complaint, #2 Call your local government, #3 Annoy the shit out of them on social media.",
                            "score": 19,
                            "author": "IveGotDMunchies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From your post, it sounds like it was solely the CFPB complaint. It probably went something like this within the bank:\n\n1. Regulatory complaints team receives case.\n2. They email their fraud claims people and ask them to pay out the claim.\n3. Fraud approves it a few hours later and emails back saying they paid it.\n4. Regulatory complaints team tries to call you to let you know.\n5. Money is deposited during their nightly/morning processing on the next business day.\n\nI wouldn't be surprised if you got another call this week regarding the other complaint, because it'll probably get sent to a different team that doesn't communicate with the regulatory complaints one and doesn't know it's already been resolved.",
                                    "score": 10,
                                    "author": "chaseoes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "At Chase, I woke up to $400 removed from my account. I called them and they said someone used my debit card in another city from me. And I told them I was sleeping at the time. \n\nThat same day about 4-6 hours they gave me the $400 back.\n\n",
            "score": 17,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had someone rack up around $2300 (yes, two thousand three hundred) in fraudulent transactions, in increments of $1.99-$3.99 on the Google store, with my BoA credit card before they flagged it and froze the account.  It was on 9/11/16, a date that obviously sticks in the mind.  I called back their fraud department on the same day, and am told these will all be removed within the week.  Cut to 3 months and 16 follow up phone calls later, and they finally get around to removing the charges from my account, and crediting me for the interest assessed of the charges.\n\nNo apologies or anything, just the worst customer service experience ever.  They even took away the reward points that had accrued, because God forbid they do something to make up for their constant hassle.  The only pleasure I got was paying them off afterwards and cutting the card up.  \n\nA couple months back my Discover card had fraudulent transactions, and that shit was off my account within three days.",
            "score": 9,
            "author": "WhskyTngoFxtrt_in_WI"
        },
        {
            "level": 0,
            "comment": "I once had a $60 transfer from a former bank go unresolved for 6 months. I also had to resort to the CFPB and wouldn’t you know it I got a phone call derailing an expedited check and a tracking number the very next day! So stupid that it had to come to that.",
            "score": 9,
            "author": "DortFauntleroy"
        },
        {
            "level": 0,
            "comment": "We shouldn't have to call up the fucking US Federal government when the bank fucks us over",
            "score": 9,
            "author": "TruthOf42"
        },
        {
            "level": 0,
            "comment": "Close your account with them, put your money elsewhere, then send them a letter charging them for the lost interest on the $700 over 180 days.",
            "score": 78,
            "author": "ArcherSam",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol \"please write me a check for $2.40 please\"",
                    "score": 76,
                    "author": "TerpZ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make it $3.50",
                            "score": 24,
                            "author": "Alexhasskills",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Plus late fees! ",
                            "score": 5,
                            "author": "ryancn08"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think the interest would be worth your time.",
                    "score": 37,
                    "author": "ZephyrBluu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It would be a small amount... but you're still entitled to it. And a letter doesn't take long to write up. I'd definitely do that. Banks would 100% charge you if the reverse happened.",
                            "score": 48,
                            "author": "ArcherSam",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol that much interest at bofa would be less than a quarter, possibly less than a dime. ",
                    "score": 9,
                    "author": "-ADEPT-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my country, we have P.A.Y.E tax system. (So every week, my tax is automatically paid). At the end of the year, you can apply for a tax-back to see if you overpaid for how much you earned. One year I had overpaid for $0.50c, and I legit wrote in and asked for it, and they sent me a cheque for 50c.\n\n&amp;#x200B;\n\nBanks... IRS... fuck them. Anything you can get back, you get back... because they take as much as they can.",
                            "score": 18,
                            "author": "ArcherSam",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Checking accounts usually have little interest. ",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Call it an overdraft fee.",
                            "score": 15,
                            "author": "TheCurls",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do it. Literally takes like 10 minutes I'f you have your paperwork ready to upload. (Evidence)",
                    "score": 15,
                    "author": "IveGotDMunchies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use local banks or credit unions - always and forever! ",
            "score": 8,
            "author": "drivincryin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hate Bank of America. They suck. I closed my account with them. Opened up a small account at a credit union and use USAA for all my big stuff. USAA is prime time. ",
            "score": 8,
            "author": "Leolover812"
        },
        {
            "level": 0,
            "comment": "Now you know why banks want to get rid of the CPFB so badly",
            "score": 15,
            "author": "greeneyedguru"
        },
        {
            "level": 0,
            "comment": "Pretty ridiculous how people have to rely on things going viral on the internet in order to get companies to act how they should.",
            "score": 7,
            "author": "Shappie"
        },
        {
            "level": 0,
            "comment": "Mazeltov!  Thank you for posting the update and listing the steps you took to get those crooks to do the right thing (6 months later).",
            "score": 20,
            "author": "synocrat"
        },
        {
            "level": 0,
            "comment": "Write again when you attempt to shut down the account and let us know how it goes. \n\nWhen I closed out my BOA account I had to go into the branch 4 times in person because they weren't able to do it correctly the 1st time.\n\n\nGood luck! You'll still need it ",
            "score": 5,
            "author": "exceptionallyprosaic",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good job!  My wife's family had a $14k checked forged and it clearly was when compared to the real signature, yet Wells Fargo denied the claim so my wife's parents had to get attorneys involved, after months of back and forth and attorney fees, WF wouldn't budge so they settled for $10k, but after attorney fees you can imagine it wasn't the best return for her parents.  F*** banks...",
            "score": 6,
            "author": "dito22"
        },
        {
            "level": 0,
            "comment": "This is also why I left BOA. I was fraud charged 700 for an airplane ticket that I never purchased. I got the runaround for one year until my whole family threatened to leave. After I got my money I told them I’ll be moving my money else where and closing the account. Smh. ",
            "score": 3,
            "author": "Likes2LOL"
        },
        {
            "level": 0,
            "comment": "Turn and burn these incompetent banks to the ground, godspeed.",
            "score": 3,
            "author": "ridewiththerockers",
            "replies": []
        },
        {
            "level": 0,
            "comment": "BofA and I have a similar history. Banked with them for 5+ years in early 2000's, then bam, 700 fraudulent charge on ebay. They did nothing for me. Ebay reversed the charge and I dropped BofA that week. ",
            "score": 3,
            "author": "_EW_"
        }
    ]
}