{
    "id": "agqlc8",
    "score": 20238,
    "title": "John Bogle, who founded Vanguard and revolutionized retirement savings, dies at 89",
    "author": "Mediasurvivor",
    "date": 1547677015.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/agqlc8",
    "media_urls": [],
    "other_urls": [
        "http://www.philly.com/business/a/john-bogle-dead-vanguard-obituary-20190116.html?\\_\\_vfz=medium%3Dsharebar](http://www.philly.com/business/a/john-bogle-dead-vanguard-obituary-20190116.html?__vfz=medium%3Dsharebar)"
    ],
    "postText": "Someone who did more to change personal finance and investments than almost anyone in U.S. history.\n\n[http://www.philly.com/business/a/john-bogle-dead-vanguard-obituary-20190116.html?\\_\\_vfz=medium%3Dsharebar](http://www.philly.com/business/a/john-bogle-dead-vanguard-obituary-20190116.html?__vfz=medium%3Dsharebar)",
    "comments": [
        {
            "level": 0,
            "comment": "Warren Buffett: \"A lot of Wall Street is devoted to charging a lot for nothing. He charged nothing to accomplish a huge amount.\"",
            "score": 4276,
            "author": "IvePaidMyDues",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amazing quote.",
                    "score": 403,
                    "author": "rnzz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Jesus this is hard hitting. But he has left a great legacy. Was going to re-read Common Sense on Mutual Funds this year, looks like I'm starting tonight. Sad sad news.\n\nTo Jack: thanks for everything. You gave more than you could ever know.",
                    "score": 349,
                    "author": "runfayfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Vanguard making all their investor shares into admiral shares (for applicable funds) earlier in 2018 was huge too. No reason to do that and most expense rates got cut by 50-75%. They already had some of the lowest expense rates in the biz.",
                            "score": 101,
                            "author": "sr71Girthbird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;No reason to do that\n\nPeople forget that Vanguard isn't organized like a regular company.  They're goal isn't to make money off of you.  \n\nCompanies are owned by people/shareholders/cats and their goal is to make money for those people/shareholders/cats.  In the case of Fidelity/etc. the people buying the investment funds are a different group than the people who own the company.  So they want to make money off you for the owners.  This means the highest expense ratio they can charge, because that maximizes profit.  \n\nVanguard funds are owned by the people who invest in the funds.  Their goal is to make you money.  This means the lowest expense ratio that still collects enough money to run the fund.  \n\nOther companies see that everyone is buying Vanguard and slash expense ratios to be competitive and keep you invested with them and maximize profit, not because they want just enough money to keep running.  \n\nThere's other differences in how Vanguard is organized, but my point is there is reason to do that (cut expense ratios) because Vanguard has a different operational philosophy than other investment companies.  ",
                                    "score": 87,
                                    "author": "thealmightyzfactor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now I'm wondering how much my cat has invested in Vanguard.......she clearly doesn't need to work anymore.",
                                            "score": 14,
                                            "author": "chevymonza"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol of course they had reason to do it. Fidelity was pressuring them with lower ER on similar funds.",
                                    "score": 7,
                                    "author": "Dobagoh",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It was a response to the competition.   They want to be a leader.",
                                    "score": 4,
                                    "author": "yes_its_him"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amen. Bogle's contributions can't be overstated.",
                    "score": 12,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He really was a great man.\n\nA lot of more recent interviews with Bogle seemed to get sidetracked with discussions about the current market and economy, but here are a few good general interviews with him:\n\n- [John Bogle: The Only Way To Beat The Stock Market](https://www.youtube.com/watch?v=EC8rWTGZhak&amp;t=78) (interview starts at 3:57)\n- [John Bogle, Founder of The Vanguard Group | A Motley Fool Special Interview](https://www.youtube.com/watch?v=6Qg959oYCxU)\n- [Freakonomics Radio: The Stupidest Thing You Can Do With Your Money (Ep. 297)](http://freakonomics.com/podcast/stupidest-money/)\n\nedit: added the Freakonomics episode",
            "score": 1079,
            "author": "dequeued",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 190,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have had the utmost respect for him since I learned who he was. Jack Bogle has been such a catalyst of so many financial journeys- the legacy of this great man preceded his death, for sure. He will be greatly missed. ",
                            "score": 64,
                            "author": "Mooseandagoose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's made a huge impact on my financial well-being. Wish I could have thanked him.",
                                    "score": 30,
                                    "author": "pantstoaknifefight2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can, educate those around you, particularly younger coworkers",
                                            "score": 31,
                                            "author": "DesertEagleZapCarry",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Seriously why can’t all wealthy people be more like him? Why do so many become assholes once they get some money?",
                            "score": 29,
                            "author": "Zzyzzy_Zzyzzyson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 43,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 25,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But what is the marginal utility of a dollar when you already have 80 million?\n\nMaybe it is worth more to be remembered as a great man. ",
                                                    "score": 28,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or to be remembered at all.  Unless they havethe (mis)fortune to make the news, how often do we hear about Shithead Fund Manager #327?  Bogle's influence will be felt long after his passing, but the same cannot be said for a large majority of other wealthy people.  Why spend so much time hoarding wealth and money when you can't take it with you?",
                                                            "score": 8,
                                                            "author": "Clepto_06"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They absolutely were. The corporate structure of Vanguard was specifically setup so any profits went straight towards lowering fees. If he wanted money he could have easily bumped expense ratios by 0.1% or whatever and put it right in his pocket.\n\nAnd that's exactly what most of wall street does and exactly what he was morally and philosophically opposed to. He could have very easily been a billionaire and he was quoted saying his peers made fun of him for not being one. But instead of hoarding that money he gave it all away to the investors.\n\nDefinitely one of the better philanthropists of our time for that. He just did it in a much quieter, longer term and more invisible way than hoarding wealth then making a hospital or whatever. ",
                                                    "score": 17,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You know, humanity, including this sub, DOES reinforce that everybody should only be thinking about #1.\n\nI probably have 5000 downvotes for suggesting here and there that people should think of someone other than themselves.",
                                    "score": 12,
                                    "author": "Raiddinn1",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Why do so many become assholes once they get some money?\n\nI think a lot of them were already assholes. Especially since certain types of people are willing to do any number of asshole things to get rich and stay that way.",
                                    "score": 5,
                                    "author": "Did_Not_Finnish"
                                },
                                {
                                    "level": 3,
                                    "comment": "You don't hear about the ones who don't",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's wild watching him speak. He looks so old like his face is mush and his fingers frozen, but he speaks so smooth and quick you can tell his mind was still sharp as ever.",
                    "score": 56,
                    "author": "GoobopSchalop",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Got most of my money in his funds. Great man. Rest in peace. ",
            "score": 260,
            "author": "ohimnotarealdoctor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too.  \n\nMy mother started a college fund for me when I was too young to know a damn thing about any of this stuff, but as the statements would roll in I became interested and started reading the materials that would arrive with them, especially Bogle's letters to the investors, which were really eye-opening as a kid.  \n\nI remember being just 15-years-old and giving my hairdresser advice on investing and securing a loan to open their own salon.  I wound up getting free haircuts for years after they did.  \n\nA legend and inspiration to so many is sailing off today.  ",
                    "score": 61,
                    "author": "iamwhoiamamiwhoami",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow, I hope they still send those! I'm thinking about getting a retirement fund with them since my old job cashed mine out...",
                            "score": 4,
                            "author": "Falling_Spaces"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From Wikipedia\n\n&gt; Bogle started the First Index Investment Trust on December 31, 1975. At the time, it was heavily derided by competitors as being \"un-American\" and the fund itself was seen as \"Bogle's folly\".[\\[8\\]](https://en.wikipedia.org/wiki/Index_fund#cite_note-8) [Fidelity Investments](https://en.wikipedia.org/wiki/Fidelity_Investments) Chairman [Edward Johnson](https://en.wikipedia.org/wiki/Edward_Johnson_III) was quoted as saying that he \"\\[couldn't\\] believe that the great mass of investors are going to be satisfied with receiving just average returns\".[\\[9](https://en.wikipedia.org/wiki/Index_fund#cite_note-9) \n\nVanguard now has 3 trillion dollars invested in their index funds, to say nothing of Fidelity, Schwab, and all the others. It's hard to imagine a more shocking outcome for someone who was told they were wrong by everyone in their industry. ",
            "score": 1568,
            "author": "kylejack",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are few people who can say they single-handedly revolutionized an entire industry. Bogle was one of them. And he revolutionized it in a way that was beneficial to almost everyone involved. That is an even greater feat.",
                    "score": 921,
                    "author": "Shaman_Bond",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; And he revolutionized it in a way that was beneficial to almost everyone involved.\n\nI wonder how much better off everyone is. Like... how much more money wound up in the pockets of retirees because they had the chance to invest in low-overhead index funds rather than actively-managed funds, or make the mistake of trying to time the stock market.",
                            "score": 207,
                            "author": "grendel-khan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not only that but it adds stability and liquidity to the market. \n\nIndividuals that otherwise wouldn't have invested are given the opportunity to partake in investing at a risk level that is appropriate for them.\n\nMutual fund managers have to endure scorching competition, causing them to up their game rather than rely on ever-increasing fee structures.\n\nMarket participants have greater access to cheap and reliable capital to grow their businesses.\n\nI don't want to sound like an acolyte but it's hard to stray far from what is oft-repeated in \"Common Sense on Mutual Funds\" -- that active fund managers are frequently shysters that behave as black holes for capital rather than putting it to good use. Disintermediating hopeless and useless fund managers is only a good thing for everybody involved, except the hopeless and useless fund managers themselves.",
                                    "score": 111,
                                    "author": "ihsw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wont anyone think of the hopeless and useless fund managers, and the nearby lambo dearler?",
                                            "score": 27,
                                            "author": "joe579003",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And the poor struggling superyacht manufacturers!",
                                                    "score": 10,
                                                    "author": "agentpanda"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Oh there's no shortage of suckers.",
                                                    "score": 3,
                                                    "author": "jalif"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's huge, cutting  1% off your annual expense ratio gets you just under 33% more money over 30 years.  (Just add 1% to your avg annual ROI) \n\nBasically if  there was a law that every 401k had to include low cost index funds back in the 1988 American savers would have about 33% more in their accounts, given the more typical fees people have been paying of over 1% vs a fraction of that. Instead that went to fund managers and banks.\n\n\n",
                                    "score": 30,
                                    "author": "thatgeekinit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Compounded. I'd say people have 50-60% more funds because of him.",
                                            "score": 9,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Who in the world pays anything that much north of 1% expense ratio to begin with?  I didn't think there were any retirement vessels in the country that charged anything more than like 1.12% fees.",
                                            "score": 3,
                                            "author": "Shandlar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Before Bogle, everyone.  ",
                                                    "score": 10,
                                                    "author": "vikingspam",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "and that's why he's credited with revolutionizing the industry. ",
                                                            "score": 3,
                                                            "author": "WinterCharm"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fees for actively managed funds are usually over .5%, and frequently exceed 1%. My Vanguard index funds have fees ranging from .14% to .04%.\n\nThe poster above you said that Vanguard alone has $3,000,000,000,000 invested in its index funds. When you consider that every tenth of a percent in fees is $3,000,000,000, Vanguard alone is saving people at least $10,000,000,000 in fund management fees every single year, to say nothing of the tens of billions in savings from people who have index funds like this from other companies.\n\nIf Jack Bogle had pocketed even half of the money he saved all of us, he'd easily be the richest man on Earth. Instead, he gave half of his salary to charity during his high earning years, and was worth only $80,000,000 in 2017, because he chose not to be a greedy asshole. He made many of us richer, and we are all the poorer for losing him.",
                                    "score": 14,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And turned down the opportunity to be one of the richest people in the world to give his investors lower fees. \n\nI'm glad I was able to go to the last Bogleheads conference and meet him. He was still wicked sharp mentally despite his frailness and tried to sign books for his fans until he was completely exhausted. \n\nHere's his last [fireside chat](https://vimeo.com/channels/bogleheads/293765659) from the event if anyone's interested. ",
                            "score": 90,
                            "author": "notapersonaltrainer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Never seen a sharper mind at that age. I have seen 72 year olds who can't put two sentences together. Believe me.",
                                    "score": 14,
                                    "author": "WarrenAlaCarte"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks for that link, watched the whole thing. Never realized how wise he was on such a broad range of topics.",
                                    "score": 12,
                                    "author": "thesandbear319"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is such an understatement. Think of other innovators that revolutionized an industry: people like Henry Ford, Steve Jobs, Thomas Edison. These guys were all pretentious pricks. Sure, consumers saw wonderful benefits from their inventions, lower prices, increased convenience and consumerism. These guys all exploited their respective workforce, played dirty, and took the excess of capitalism to its extremes. Yes, I think we are better off with the Fords and Edisons of the world, but it comes at a price.\n\nBogle and his Index Funds are just ... magic. Not only do regular Joe and Jane Investor benefit by building wealth at low cost, everyone else benefits too: the underlying securities gain stockholders. The brokerage earns a modest and fair management fee. Competitors are forced to adapt, but they too can benefit by offering similar low-fee funds. What other innovator can make this claim, where everyone wins?",
                            "score": 350,
                            "author": "RockyMoose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, and back to your first paragraph, Bogle was actually a good guy, at least insofar as his public statements are concerned (I'm not super familiar with his private life). He more or less just wanted to do something sensible for the little guy. And in all his later interviews he comes off as unpretentious (though highly intelligent), despite his wild success. ",
                                    "score": 161,
                                    "author": "pilgermann",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He really was amazing. On my first day working at Vanguard, I saw Jack Bogle lining up like everyone else to buy a peanut butter and jelly sandwich for lunch. There was an innate humility about the man combined with an astute mind and a genuine conviction to reform an industry that was plagued (and still is) by abject greed.\n\nHe will be missed, but the legacy of his reform will endure.",
                                            "score": 157,
                                            "author": "12thKnight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No joke, he cut in front of me in the burger line a few months ago. He was surprisingly quick despite his age. But I'll forgive him.",
                                                    "score": 23,
                                                    "author": "soccerman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "really?",
                                                            "score": 8,
                                                            "author": "yogononium",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "no",
                                                                    "score": 14,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "really?",
                                                                            "score": 5,
                                                                            "author": "yogononium",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ok yes",
                                                                                    "score": 5,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have a friend who's partner knows his family. I was told that his grandchildren drive domestic SUVs without the bells and whistles. That they keep a low profile. I admire this man and what he taught his family so very much.",
                                            "score": 39,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not to discredit what you said and I agree his work really changed a ton of people's lives for the better but the dude was incredibly stubborn. He was voted out of CEO some 15 years ago because he didn't want his company to adapt to technology or diversify the company at all.",
                                            "score": 24,
                                            "author": "OnlySpoilers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "His success was heavily tied into how stubborn he was. It's not like it's surprising that he got the downside of it too. Not totally unable to change his mind though. He softened a bit on Vanguard offering ETFs recently when he realized they still had lower turnover than competitors. ",
                                                    "score": 23,
                                                    "author": "DontForgetWilson"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;This is such an understatement. Think of other innovators that revolutionized an industry: people like Henry Ford, Steve Jobs, Thomas Edison. These guys were all pretentious pricks. Sure, consumers saw wonderful benefits from their inventions, lower prices, increased convenience and consumerism. These guys all exploited their respective workforce, played dirty, and took the excess of capitalism to its extremes.\n\nHenry Ford was actually sued by some of his investors (the Dodge brothers) because he wanted to pay Ford workers more. They investors wanted that profit, and actually won. They used that money to to start their own car company Dodge. Henry Ford was a shitheel in many ways, but he actually believed in paying workers enough to buy the cars they built.",
                                    "score": 69,
                                    "author": "Enrage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also have the 5 day work week",
                                            "score": 32,
                                            "author": "LordTwinkie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He didn't do it out of the kindness of his heart, it was to reduce turnover. It's still a win-win, but nothing I've read or heard about Henry Ford paints anything rosy about the man. He was smart and had other people do his dirty work, but his hands aren't clean.\n\nhttps://www.forbes.com/sites/timworstall/2012/03/04/the-story-of-henry-fords-5-a-day-wages-its-not-what-you-think/#14c7cfb6766d",
                                            "score": 31,
                                            "author": "lostboyz"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Steve Jobs\n\n&gt;lower prices\n\nThis ain't it chief.",
                                    "score": 15,
                                    "author": "Pikamander2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At the time, it truly was. Think past not present. ",
                                            "score": 7,
                                            "author": "Calexander3103"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But not everyone wins. Fund managers lose. Pour one out for them and their yacht that never was. ",
                                    "score": 17,
                                    "author": "Y0dDmCnc"
                                },
                                {
                                    "level": 3,
                                    "comment": "Tesla..not Edison. Edison stole his ideas.",
                                    "score": 10,
                                    "author": "MibuWolve",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tesla didnt assemble the modern research lab. if you want to say Edison is a prick for his treatment of Tesla and other scientists in those labs, go right ahead, but the lab was his.\n\nAnd so was the phonograph.",
                                            "score": 7,
                                            "author": "SmallJon"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is an Internet urban legend.\n\n",
                                            "score": 3,
                                            "author": "yes_its_him"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well said.  Have an upvote friend!",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He could have been a billionaire.  Instead, he helped so many achieve financial independence.  A truly remarkable human.",
                            "score": 24,
                            "author": "niko81"
                        },
                        {
                            "level": 2,
                            "comment": "I do give the bloke credit.\n\nNow I’m going to see if he wrote any economics book.",
                            "score": 3,
                            "author": "WalkingUSB"
                        },
                        {
                            "level": 2,
                            "comment": "Not beneficial to overpaid stock pickers ",
                            "score": 3,
                            "author": "EventfulAnimal"
                        },
                        {
                            "level": 2,
                            "comment": "Well said.  Have an upvote!",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;&gt; ...mass of investors are going to be satisfied with receiving just **average** returns\n\nIt seems obvious now, but wasn't it obvious then that not everyone can be above average?  (and that guaranteed average returns itself was a good deal).\n",
                    "score": 173,
                    "author": "jtooker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also remember that information was not as plentiful thirty, forty years ago. A broker could create large returns if he was connected enough and had a good bit of intuition. \n\nRumors leak within minutes nowadays. You have all company financials at your fingertips. You can get detailed analyses easily. Heard that Company X will release a revolutionary new product that will rake in the money? Well, everyone else has, too, and their stock already reflects that. \n\nI'm not going to discount his achievements - he was a pioneer that created probably the greatest financial invention of the twentieth century. He also made investing easy, quick, and accessible for the most financial illiterate. You don't need to be some millionaire who understands finance in depth just so you can find a good financial investment without worrying if you're being robbed blind. All you need is a few bucks and an internet connection.",
                            "score": 117,
                            "author": "droans",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like to follow news around video game companies, mainly because it's 24 hour dumpster fires burning brighter every day, but it's amazing to see a news item hours or minutes old and then hop on the stock price and see how it's moved so quickly in response, even when the news is just a rumor or wouldn't mean much whether it were true or not.",
                                    "score": 14,
                                    "author": "innocuousremark",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which I think comes back to the idea/ point behind index funds. Intraday, week, even month fluctuations aren't exactly as rational as people would believe but on the whole? Over many companies and years?",
                                            "score": 7,
                                            "author": "KirklandKid"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Things were totally different in the 80s:\n\nMarket Efficiency was only talked about by a minority of Economists\n\nYou had to go to the library to look up financial data on Equities if you didn't want to request financial data from the company itself. \n\nYou also had to deal with brokers who would charge 3-10% based on how large your purchase was.\n\nFinally, stock prices were in 1/8s so you would always eat an 1/8 of a dollar per share based on the Bid / Ask spread.\n\n",
                            "score": 35,
                            "author": "ImmodestPolitician",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another thing: you generally had to purchase shares hundreds at a time. If you had $2000 to invest, and a company's stock price was $43, you would have a hard time purchasing it until you had $4300 to buy 100 shares.  Today, you can buy one share and no one bats an eye.\n\nThis the major reason why stocks don't split as often as they used to. In the past, companies had to keep share prices relatively cheap in order to ensure that buyers would be able to afford hundreds of shares. High share prices could lead to illiquidity.",
                                    "score": 11,
                                    "author": "13Zero",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "What's the deal with it being in 8ths?",
                                    "score": 4,
                                    "author": "maverickps",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Man greed is fucking powerful ",
                            "score": 48,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Besides, if every investor performed better, the average would increase by definition, and they'd still be average. ",
                            "score": 12,
                            "author": "Busybyeski"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My law firm helped him set up Vanguard and worked on getting their ETFs off the ground. I know a good few people who knew him, but I was not so lucky. RIP",
                    "score": 26,
                    "author": "Rustytrout"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's just because of how big the stock market is here culturally. There was a sort of wall street stereotype that probably was very prevalent then I'd guess. Trusting a person trained in his trade, like an asset manager, was the way it was always done in America. Like paying your HVAC guy.",
                            "score": 9,
                            "author": "Svorax"
                        },
                        {
                            "level": 2,
                            "comment": "I think the idea was that joining with a bunch of other mutual investors and buying a large basket of stocks to track the market at large, as Bogle advocated was some sort of defeatist Communist collectivism.\n\nNever mind that, you know, investing capital to generate wealth is kind of the defining characteristic of capitalism.",
                            "score": 4,
                            "author": "NoMagicJustMath"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; \"\\[couldn't\\] believe that the great mass of investors are going to be satisfied with receiving just average returns\".\n\nDamn right, let's charge 2 and 20 to piss away your money most years! That's the American way!",
                    "score": 5,
                    "author": "doctorgonzo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP Jack.\n\nI think I can speak for the whole sub when I say he was the single biggest influence on how we invest. I was watching one of his interviews recently with Christine Benz from Morningstar and was amazed how astute and sharp he was for his age. \n\nFew finance gurus can match the clarity in his writing / speaking and his no nonsense approach to investing.",
            "score": 565,
            "author": "_ty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had the fortunate experience to meet Mr. Bogle last year. Extremely sharp man. Cracked jokes the entire time too. \n\nWhen he spoke, you could hear a pin drop in the room. Absolute genius. \n\nYou know when you talk to someone and you know they're smarter than you? You knew you were talking to a mastermind when Mr. Bogle spoke. He was just on another level I couldn't compete with. We lost a legend today. Rest in peace to one of the greatest minds of the century. ",
                    "score": 163,
                    "author": "yepimasian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 94,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I too have a wife",
                                    "score": 136,
                                    "author": "SilverJeep04",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good husband, now go fetch me a bowl of cereal",
                                            "score": 8,
                                            "author": "runfayfun",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yo I'm here",
                                                    "score": 11,
                                                    "author": "sour_cereal"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Man I’d be totally lost without her. How lucky we are ",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At least you're smart enough to know that.",
                                    "score": 20,
                                    "author": "emceelokey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can only learn from people that know more than you so nothing wrong with not feeling like the smartest. When you recgonized other people are smarter at things then you know you lack in that department and now you know where to learn from. ",
                                                    "score": 9,
                                                    "author": "emceelokey"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Changed the financial future of millions. ",
            "score": 167,
            "author": "Alexhasskills"
        },
        {
            "level": 0,
            "comment": "5.1 trillion in assets. He has helped so many people. RIP to a legend",
            "score": 131,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "\"When markets crash, do nothing\"  \n\"It's not timing the market, it's time in the market\"  \n\"Stay the course\"\n\nThanks Jack for teaching me more than I ever thought I'd know about personal finance, and sparking the interest to continue to learn. RIP",
            "score": 130,
            "author": "SuperMirage"
        },
        {
            "level": 0,
            "comment": "The guy simplified investing for the everyday investor. He is easily one of the most important people in finance. \n\nRIP to the legend. Bogleheads will continue his legacy. ",
            "score": 117,
            "author": "Savaric"
        },
        {
            "level": 0,
            "comment": "There are a couple Freakonomics episodes that interview Mr. Bogle. They are both fantastic.\n\n[http://freakonomics.com/podcast-tag/john-bogle/](http://freakonomics.com/podcast-tag/john-bogle/)",
            "score": 149,
            "author": "kcarter80",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let me just mark myself here for later",
                    "score": 14,
                    "author": "bmm36",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reddit has a save function, you know. ",
                            "score": 5,
                            "author": "MrGazzo",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP to a legend",
            "score": 245,
            "author": "tshimangabiakabutuka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love stories of folks to stick to their guns and win.  RIP indeed.",
                    "score": 57,
                    "author": "duman82"
                },
                {
                    "level": 1,
                    "comment": "One of the most important people of this century. ",
                    "score": 15,
                    "author": "generally-speaking"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I will quietly make no change to my investment strategy in honor of his passing.",
            "score": 62,
            "author": "howdyzach",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bought some more shares in VTSAX and VTIAX in my taxable brokerage account in his honor today.",
                    "score": 11,
                    "author": "the_one_poneglyph"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People called him crazy for not wanting to beat the markets. But here we are, more index funds exist than ever before. \n\nHe brought manageable investing to the general public. Something that is amazing that was unthinkable before. RIP to a great mind",
            "score": 57,
            "author": "wienercat"
        },
        {
            "level": 0,
            "comment": "First celebrity death I've actually cared about in a while. Dude was a hero and opened up the world of investing to the masses.",
            "score": 50,
            "author": "DetN8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 39,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "RIP. \n\nAt 25, I am on course to a comfortable retirement because of his investing principles promulgated on the bogleheads forums. Thank you, Mr. Bogle. ",
            "score": 148,
            "author": "darealmotherfckr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hear, hear. I'm 34 and he was instrumental in changing my life as well. \n\nRest in peace, John.",
                    "score": 55,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Damn, so it's this guy I have to thanks for my 401k?",
                    "score": 23,
                    "author": "linkkjm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kind of, he basically invented the mutual fund.  IRAs and 401ks are around largely because of the mutual fund, so most people's retirement these days are basically shaped by him.",
                            "score": 12,
                            "author": "evarigan1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He did not invent the mutual fund. He invented the modern, passively managed index fund.",
                                    "score": 46,
                                    "author": "rodneyjesus",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked for Vanguard for about 15 years, and had the pleasure of meeting Jack several times. \n\nUp at the Malvern campus, it was a pretty regular thing for him to just sit down with you and ask your opinion on things.  He was so incredibly connected to not only the business, but everyone that worked for him, even after he retired and was no longer running the show and the company had grown into a juggernaut.\n\nThe guy was not just brilliant, but his humility and integrity came through like a beacon when you spoke with him.   He was absolutely the real deal.  I cried today when I heard.  Even though I no longer work for that company, I keep large portions of my assets there which is a testament to my trust in the business and the people there, and one of the few places I've ever worked in my career where the mission statements about client commitment and ethics weren't just lip service for the benefit of prospective customers.  He built that commitment into most every layer of the company.\n\nNever worked for anyone else in my career that I had such deep respect and admiration for.  He lived to his principals, and his impact to the industry really can't be overstated\n",
            "score": 34,
            "author": "DavidTheBarbarian",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Reading/listening to an interview with him is pretty amazing.  \n\nFor a guy behind so much cash, real common sense, non-pretentious dude.  \n\nThe industry thought he was nuts, he knew he was right and did his thing.  If you like a story of an underdog winning, or just want to learn a bit about a guy who had enough common sense to realize the common trends in an industry made no cents (pun intended)... look up a bit about him.\n\nHe's not the worst person who ever lived to imitate.",
            "score": 64,
            "author": "pixel_of_moral_decay"
        },
        {
            "level": 0,
            "comment": "First it was Herb Kelleher, now John Bogle. Those are probably the two businessmen I admired most. Both revolutionized their industries, against much derision, in customer-friendly ways.",
            "score": 28,
            "author": "OwnManagement"
        },
        {
            "level": 0,
            "comment": "I was looking at \"The Little Book on Common Sense Investing\" just yesterday. Decided to look at his Wikipedia page, and read that at 31 he had his first of a series heart attacks. Both bizarre and sad to read about this a day later. Making it to 89 after a heart attack in your thirties is a good run, rest in peace, you made the world a better place!",
            "score": 23,
            "author": "Nurmisz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I literally just picked up this very book today. So weird!",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just started getting into investing a year ago... read so much about Bogle.  Forsure a person out working for everyone.  ",
            "score": 49,
            "author": "jmpstart66"
        },
        {
            "level": 0,
            "comment": "Thank you John Bogle",
            "score": 17,
            "author": "zachwilson23"
        },
        {
            "level": 0,
            "comment": "One of the best things I ever did for myself in my early 20s was read his book.",
            "score": 15,
            "author": "Nylese",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Rest in peace, John Bogle. \n\nI have been following the \"Boglehead\" way of living for over 15 years. Best decision I have ever made. Just invest in passively managed index funds. \n\nNot as exciting as investing in individual stocks, but at least I can sleep at night and wake up years later not having to worry about the underlying company behind individual stock shares suddenly going worthless. ",
            "score": 16,
            "author": "darthdiablo"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 83,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too soon",
                    "score": 9,
                    "author": "BubblesForBrains",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Time in the comment section is better than timing the comment section.",
                            "score": 34,
                            "author": "goodwithwurds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "High frequency commenting provides liquidity to the lurker. ",
                                    "score": 4,
                                    "author": "station_nine"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nah, good chance John would have laughed at this ",
                            "score": 5,
                            "author": "willpc14"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never felt more sorrow for someone I've never met other than that for Jack Bogle. He's changed my and so many American's lives. RIP Bogle",
            "score": 13,
            "author": "Obvious-Sarcasm",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Very sad, indeed. I noticed he wasn't looking too hot during his CNBC interview a few weeks ago: [https://finance.yahoo.com/news/jack-bogle-shares-1-billion-140800358.html](https://finance.yahoo.com/news/jack-bogle-shares-1-billion-140800358.html)\n\n&amp;#x200B;\n\n&amp;#x200B;",
            "score": 11,
            "author": "baseballtr7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn, crazy to see someone talking and living just weeks before they pass. RIP Jack, a big influence on a lot of people. ",
                    "score": 8,
                    "author": "briballdo"
                },
                {
                    "level": 1,
                    "comment": "I just hope I look as good at nearly 90.",
                    "score": 6,
                    "author": "NoMagicJustMath"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goodbye sweet man.  Thank you for unmasking the shit show of mutual funds and setting us up for retirement.  \n\nRemember, all, that retirement investing is not hard. ",
            "score": 12,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sad day for me. What an inspiration. Will likely save me HUNDREDS OF THOUSANDS of dollars  in the course of my investing career due to not paying expensive financial advisor fees. \n\nRest In Peace. ",
            "score": 49,
            "author": "RickSteve-O"
        },
        {
            "level": 0,
            "comment": "Moment of silence for the Investing Sage. ",
            "score": 9,
            "author": "nor_cal_rider"
        },
        {
            "level": 0,
            "comment": "We lost a great one today. ",
            "score": 16,
            "author": "TrombieTrombie"
        },
        {
            "level": 0,
            "comment": "RIP sir.",
            "score": 8,
            "author": "SwAeromotion"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The idea for Vanguard was described in his college senior thesis.  His professor gave him an A+ for it.",
            "score": 7,
            "author": "larrymoencurly"
        },
        {
            "level": 0,
            "comment": "Maxed out my Roth for 2019 into VTSAX in his honor...",
            "score": 7,
            "author": "weedmylips1"
        },
        {
            "level": 0,
            "comment": "My wife was talking to me about daycare for the rest of the week while I had my laptop open. She noticed I wasn't paying attention while she was talking. She said, \"Hello, did you hear what I said?\" I said, \"John Bogle just died.\" She said, \"Okay, but I'm taking about something that affects our life here.\" I said, \"Yea, so does this.\"",
            "score": 7,
            "author": "sonusfaber"
        },
        {
            "level": 0,
            "comment": "My Dad works at vanguard and met him twice.  This is a story that he told about Bogle that really shows the type of person he was:\n\nOne day Bogle was at this fancy party in the amazing penthouse apartment, talking do someone named Chris about the persons friend George whose incredibly rich.\n\nChris: \"Ah yeah George just bought another home in the Bahamas, it's really incredible just how much he has.\"\n\nJack: \"Well I've got something that George will never have.\"\n\nChris: \"What's that?\"\n\nJack: \"Enough\"\n\n\n\nNot to mention he met my dad first during his second week at vanguard, where he sat down with him and just said \"I should know you.\" And started talking to him.  He was a really incredible person, and a unique one among his peers.",
            "score": 12,
            "author": "John_From_The_IRS",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Jack: \"Enough\"\n\nThat's what he named one of his books in 2008. :)",
                    "score": 4,
                    "author": "kylejack"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve read his books and heard numerous interviews. What a great person and a common sense investor. He’ll be missed. ",
            "score": 7,
            "author": "Selenography"
        },
        {
            "level": 0,
            "comment": "Very sad. RIP",
            "score": 6,
            "author": "Crowgar"
        },
        {
            "level": 0,
            "comment": "I just saw this logging into my Vanguard account. So sad. RIP and thank you for everything you did. ",
            "score": 6,
            "author": "enki941"
        },
        {
            "level": 0,
            "comment": "He was still very sharp at this age. RIP",
            "score": 6,
            "author": "thomask02"
        },
        {
            "level": 0,
            "comment": "A truly sad day. Rest in peace and thank you so much for your enormous contributions, John Bogle!",
            "score": 7,
            "author": "herpington"
        },
        {
            "level": 0,
            "comment": "This account has been deleted in response to Reddit's on-going objective of extracting as much shareholder value from the site instead of value for Reddit's users.",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Sad to see one of the good guys go.  So many in this world just rent seek, acting as a middle man and marking up stuff with no purpose in the world.\n\nGiven the size of the industry, it's incredible that Vanguard kept their fees so low for so long.",
            "score": 6,
            "author": "zerostyle"
        },
        {
            "level": 0,
            "comment": "I met him last year he was very nice and excited to meet us. ",
            "score": 4,
            "author": "overandunder_86"
        },
        {
            "level": 0,
            "comment": "Well damn. Such a great guy. Not just in the financial world but just seemed like a really good human in all the talks/lectures I've seen of him.\n\nMay his creation outlast him a thousand generations.. or at least until I'm dead and don't care about retirement!",
            "score": 6,
            "author": "AOLWWW"
        },
        {
            "level": 0,
            "comment": "I can say this about very few.  Because of his influence I have had a better life than I would have.  I am lucky to have read \"Bogle On Investing\" at a young age and that made all the difference.   He belongs on the Mt. Rushmore of Great Financial Minds.",
            "score": 5,
            "author": "donmark144"
        },
        {
            "level": 0,
            "comment": "I was a finance undergraduate and one of our required classes Personal Finance, and one of the books we read was “The Little Book of Common Sense Investing” by John C. Bogle.\n\nThat book resonated with me tremendously. I opened a Roth IRA with Vanguard at age 22. The account is still a point of pride in my life, 11 years later. I now work at an RIA and while I believe in the cause of what my firm does, I also know I’ll be incredibly loyal to Vanguard forever.\n\nCheers, Jack. ",
            "score": 5,
            "author": "tinyhuman_"
        },
        {
            "level": 0,
            "comment": "John Bogle is a legend.  RIP John.",
            "score": 5,
            "author": "kingcurtisnugs"
        },
        {
            "level": 0,
            "comment": "I listened to his interview on freakonomics.  He sounded like a good dude.",
            "score": 4,
            "author": "1h8fulkat"
        },
        {
            "level": 0,
            "comment": "Maybe it sounds odd, but I have always been really thankful for him. \n\nI'm not a big investor, I never met him or anything, but he seemed like a shining point of sanity in a sea of craziness.",
            "score": 5,
            "author": "InnerKookaburra"
        },
        {
            "level": 0,
            "comment": "Such timing. My father passed away today. Peace to them both.",
            "score": 4,
            "author": "Tucana66",
            "replies": [
                {
                    "level": 1,
                    "comment": "My condolences pal",
                    "score": 3,
                    "author": "roman_hellmet",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Instead of taking dollars from the average investors and leaving them with pennies, we will take pennies from the average investors and leave them with dollars. We will still have more money then we could possibly spend in our lifetime.\n\nI always felt that this is what he did with ETFs.\n",
            "score": 5,
            "author": "MyDogFanny"
        },
        {
            "level": 0,
            "comment": "Damn. RIP to an absolute legend and saint. What are the best books/docs on him and Vanguard?",
            "score": 8,
            "author": "doug3465",
            "replies": [
                {
                    "level": 1,
                    "comment": "While not specifically about him \"the retirement gamble\" has several interviews with him where he explains the need for low fee etfs and the math behind it.\n\nIts my go to documentary for getting people on board with low fee investing begining at a young age. Atleast checking out just his parts will really show how great of a man he was",
                    "score": 3,
                    "author": "Kenney420"
                },
                {
                    "level": 1,
                    "comment": "The Bogleheads Guide to Investing is a great one",
                    "score": 3,
                    "author": "St0pBetrayingMe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How big was his retirement fund? Edit - Wonder what he held at the end. A final lesson to us maybe?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was worth about $80 million, most of it held in Vanguard and Wellington funds.",
                    "score": 8,
                    "author": "Captain_Comic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rest in peace. A real inspiration. ",
            "score": 3,
            "author": "ExcellentNothing"
        },
        {
            "level": 0,
            "comment": "Thank you John",
            "score": 3,
            "author": "bodyreddit"
        },
        {
            "level": 0,
            "comment": "Sad day... He was definitely a vanguard in the investing world",
            "score": 3,
            "author": "Kilpatty_Trade"
        },
        {
            "level": 0,
            "comment": "Respect. Truly a giant in the investing world and cared more about helping others than lining his own pockets. I doubt we’ll see kind again soon.",
            "score": 3,
            "author": "Captain_Comic"
        },
        {
            "level": 0,
            "comment": "RIP Sir. You did what you always believed in and helped all of us. Thanks for everything you have done. ",
            "score": 3,
            "author": "mm9983"
        },
        {
            "level": 0,
            "comment": "Buying some more VTI in the morning in his memory.",
            "score": 3,
            "author": "JustinUti"
        },
        {
            "level": 0,
            "comment": "Weird. I was at a design talk tonight and one of the us designers from vanguard was one of the speakers.",
            "score": 3,
            "author": "_heisenberg__"
        },
        {
            "level": 0,
            "comment": "Sure he left a buck or two at the end.",
            "score": 3,
            "author": "blodisnut"
        },
        {
            "level": 0,
            "comment": "I have followed this guy for years. Loved his interviews on CNBC. What a legend and forward thinker in the world of personal finance. He was like the Stan Lee of investing. Wow, sad day and huge lose. RIP Jack.",
            "score": 3,
            "author": "Grandebabo"
        },
        {
            "level": 0,
            "comment": "Love these paragraphs in a CNN Money mag article a long time back:\n\n&gt;Bogle dubbed his rump organization Vanguard, after Nelson's flagship at the Battle of the Nile--thus keeping with the Napoleonic-wars theme set by \"Wellington.\" And while Vanguard was at first in charge of nothing but keeping records and sending out statements to shareholders, Bogle quickly devised some sneaky ways to extend its reach. He got around the distribution compromise by switching the funds to no-load--selling shares directly without an up-front fee instead of going through the brokers controlled by Wellington. Then, in 1976, came the Vanguard Index Trust, which, because it simply aimed to track the S&amp;P 500, got around the boards' decision to leave money \"management\" in the hands of Wellington. (Wellington Management is still around and still manages some Vanguard funds. But not many.) \"It was one of the great acts of disingenuous opportunism defined by the mind of man,\" Bogle says now.\n\nEdit here is the article: https://money.cnn.com/magazines/fortune/fortune_archive/2003/01/20/335617/",
            "score": 3,
            "author": "Grandebabo"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was lucky enough to meet him at my dad's retirement party (my dad was in the finance industry).\n\nSUCH a nice man! No (obvious) ego whatsoever.\n\nPrayers for Jack and his family!",
            "score": 3,
            "author": "whats_your_vector"
        },
        {
            "level": 0,
            "comment": "Why is Vanguard held in such high regard compared to others?",
            "score": 3,
            "author": "LunacyNow",
            "replies": [
                {
                    "level": 1,
                    "comment": "So while other companies focused on making more and more money by keeping fees high, Jack realized he could make a lot of money by lowering fees and growing volume.  A win win for investors and Vanguard.\n\nThis had two parts one, active vs passive investment. Jeremy Siegel and others noticed that active management (people picking individual stocks for a fund) rarely beat the market (buying one of every stock) in the long run, and the difference is even larger when fees are considered. \n\nSo Jack made it his mission to educate people on this and then to back that up by having vanguard offer index funds with the industry's lowest rates for a long time. \n\nSo we went from an era where it was typical to pay 5% up front plus 1-3% a year to where we are today which is &lt;.1% and some companies even have no fee index funds!!! that is a MASSIVE massive massive difference when you think about investing for retirement over 40 years.  So he did the right thing, educated people on the most efficient way to invest in the long term and pushed the entire market's fee structure down. ",
                    "score": 3,
                    "author": "drsboston",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Excellent. Great explanation! I didn't realize he was one of the originators of this economic philosophy. Also, good to know my strategy is completely aligned with this.",
                            "score": 3,
                            "author": "LunacyNow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Must have been a board wipe effect since Bogles have hexproof.",
            "score": 3,
            "author": "MangledMailMan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is sad news, Jack Bogle did more for the average investor than anybody else . \n\nThanks for your attitude and philosophy ",
            "score": 3,
            "author": "peachazno"
        },
        {
            "level": 0,
            "comment": "*Bows her Boglehead*  RIP ",
            "score": 5,
            "author": "BubblesForBrains"
        },
        {
            "level": 0,
            "comment": "Reading The Boglehead's Guide to Investing helped me out a ton.",
            "score": 2,
            "author": "Bukdiah"
        },
        {
            "level": 0,
            "comment": "fuck. RIP Jack. changed my financial future for sure. thanks for everything",
            "score": 2,
            "author": "sjcefrmvhs"
        },
        {
            "level": 0,
            "comment": "Oh no. That dude was awesome. I thought something was up when he started to appear less and less in their videos.\n\nHad a sharp mind to the end.",
            "score": 2,
            "author": "NonBinaryTrigger"
        },
        {
            "level": 0,
            "comment": "Well how long was his retirement? ",
            "score": 2,
            "author": "liquidmetaljesus"
        },
        {
            "level": 0,
            "comment": "Sad day lads. Sad day.",
            "score": 2,
            "author": "domlaface"
        },
        {
            "level": 0,
            "comment": "Rest in peace Jack! Just recently made a retirement account at age 19 thanks In large part to his work ",
            "score": 2,
            "author": "Dougisaac"
        },
        {
            "level": 0,
            "comment": "Man this hurts, even if it was expected. I live fairly close to Vanguard’s HQ and I’ve had the fortune of meeting him a few months ago through knowing some high level employees. I’m 23 years old and I started my first full time job last spring after college. We didn’t get to speak long (everyone wanted to talk to him), but he said I was off to a good start in life and fortunate and that I shouldn’t blow it. After meeting him, and finally having steady income in a fairly promising job, I was inspired to read up on investing and his ideas on strategy. Now I’m putting $500 into a Vanguard account every two weeks (VTSAX for now, will diversify later, got plenty of time). I expect to spend the better part of the next 40 years getting paid every two weeks. As I get raises, I’ll up my contributions, and I should be able to retire early and comfortably because of his advice and company. ",
            "score": 2,
            "author": "Hashslingingslashar",
            "replies": []
        }
    ]
}