{
    "id": "c67628",
    "score": 17843,
    "title": "What I wish people told me before I got $16,000 in CC debt",
    "author": "east_off",
    "date": 1561650670.0,
    "url": "https://www.reddit.com/r/personalfinance/comments/c67628",
    "media_urls": [],
    "other_urls": [],
    "postText": "Quick background. I got my first credit card by accident. I thought I was filling out a “loyalty card” at Cabelas. Ended up being a line of credit. I was 23. \n\n4 short years later and married with a baby girl, I find myself with $16,000 in credit card debt. I actually saved my very last dollar and have it taped to my steering column in my truck. And when I say last dollar I truly mean it. We had negative balance in the bank and overtaxed all our cards. \n\nLess than two years later, we now have $16,000 in savings and no credit card debt. (We finance one of our cars) \n\nCredit card debt is crippling. My dad calls it the ULTIMATE SLAVEMASTER. It forces you into depression almost by default and controls every aspect of your life. \n\nHere’s my list and I hope it helps you. I’m no guru, I just learned the hard way. \n\n1. You will not pay it off later. When ‘later’ comes, you’ll be buying other things to pay off later. \n\n2. Read Dave Ramsey’s money makeover. It’s got good tips and the tactics work. \n\n3. The Jones’ can suck it. They’re miserable and controlled by debt also. Don’t buy things you don’t need to compete with people you don’t care for anyways. \n\n4. Pick up a side hustle. I taught myself to make skateboards, and would handmake 2-3 a week to sell to help pay off the debt. My wife picked up Birth photography \n\n5. Talk to your boss, ask what you can do to take a bigger paycheck home. \n\n6. Be a bitch about your budget. Set it and don’t stray from it. \n\n7. Put post-it notes with $0.00 written on them at the office, in your car, on your mirror, on your phone background. Seeing that everywhere actually reminded me of my goal of achieving $0.00 CC debt. Not sure if it legit made a difference but I think it might’ve \n\n8. Become emotionless toward money. I would get so pissed that I was dumping hundreds of my paycheck into debt payoff. It was only till I stopped giving a f#&amp;@ that it became easier to make bigger payments. \n\n9. Save nothing until it’s paid off. It doesn’t make sense to save money when you have CC debt growing exponentially in the opposite direction. \n\n10. When in doubt... overpay. If you run short on money in your checking, but whoop, dip into the CC for 50 bucks. Keep basically nothing in your bank account because “you spend what you have.” My family could live off of $75 a week. But if we have $300 to live off of, guess what... we would use $300. So I would always put as much as made sense. A few times I overpaid but it forced us to be frugal. \n\n11. Unsave your cards on Amazon. So if you go to buy something you have to go through the hassle of finding the card and filling in the fields. \n\nThese are just some of the silly things I picked up along the way that I think would’ve helped me stay out of the mess. We are so happy now that we worked our butts off to become financially stable. I hope this helped!\n\nEDIT: So many awesome comments! I understand these are basic tips and not hardcore financial advice. So please leave your advice, even if you disagree with my tactics because there’s a lot of comment lurkers who are scanning for more advice, so keep all the comments coming!",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3356,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If that's where he stopped, that would be fine.  But then he goes on with, \"Don't ever use credit,\" \"You don't need a credit score,\" \"Get a house loan from me,\" \"Invest in my mutual funds with high fees,\" and so on.\n\nDave's okay for getting out of a large amount of high interest debt.  Once you're unburied, you need to run away from his further advice.",
                    "score": 2633,
                    "author": "boxsterguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 670,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; For the latter getting told to not buy coffee is demeaning and for people like myself, I had to find a healthy rock bottom to admit I had a problem.\n\nIt's a good thing that many people have figured out that [the latte factor](https://slate.com/business/2016/05/the-latte-is-a-lie-and-buying-coffee-has-nothing-to-do-with-debt-an-excerpt-from-helaine-olens-pound-foolish.html) is mostly BS.",
                                    "score": 385,
                                    "author": "boxsterguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 229,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I always thought that was avocado or lattes were stand-ins for whatever little things you spend a lot of money on. For me, it's a card game. I barely play it anymore, and when I do it's online. But I always feel the call of a new set when it come out. Today I made a little more than usual, and at Walmart I kept thinking about spending about $20 on cards to celebrate. But I kept telling myself I would be $20 closer to a car if I didn't buy something that I wouldn't use for a long time, if ever.\n\nAnother little thing is the 2 for $5 from McDonald's. I decided that was worth it over buying sandwich makings, but I found out today the deal ended, so instead of spending $8-$9 on one meal I'd just make a TV dinner at home. Or buy $1 cheeseburgers instead in the future.\n\nRedbull was one thing I dumped a ton of money into. My workplace would sell them to me for $3 each. I'd drink 1-3 almost every day. But I get coffee there for free. I just learned to tolerate coffee more, and I saved almost $30 a week. Even if I had to pay for the coffee, it would still be half of what I spent on Redbull. If $30 a week doesn't sound like much to you, then you know fuck all about living or growing up in poverty.\n\nHell, the \"avocado toast\" could even be a new car. I've taken my neighbor to the store in my minivan I payed $1k for and even helped pay for her groceries, meanwhile her own son can sit outside her house in a brand new car he's paying $500 a month for, but can't take her without gas money.",
                                                    "score": 194,
                                                    "author": "Zoomoth9000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Magic is expensive.",
                                                            "score": 130,
                                                            "author": "Ryusei71",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There's a reason the old meme still rings true.\n\nTeach your kids Magic. They won't have money for drugs.",
                                                                    "score": 118,
                                                                    "author": "SScorpio",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; If $30 a week doesn't sound like much to you, then you know fuck all about living or growing up in poverty.\n\nToo many people think in the short-term. $30 this week isn't going to change your life. That's $120 in a month - when you're struggling to make ends meet $120 for bills is HUGE. At the end of the year that's $1560. That's a down payment on a decent used car. I wish someone had made me realize that back when I was keeping myself poor.",
                                                            "score": 17,
                                                            "author": "Nishnig_Jones",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You probably granted yourself a few extra years of life by trading out those 3 Red Bull’s a day,",
                                                            "score": 61,
                                                            "author": "ericstern",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Your right in those theories the latte or avocado toasts are stand ins for the small luxuries but those theories are bullshit the small things aren't what keep people paycheck to paycheck its the fixed costs like housing and utilities. Theories like this and bootstraps are all just rich people justifying that they deserve to live in comfort while others suffer because they work harder and spend money smarter but the data doesn't support those claims. Don't buy the bullshit.",
                                                            "score": 116,
                                                            "author": "Gankhiskahn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't think those theories are BS, we as human rationalize any BS we want.  While it may not be a latte, an avocado toast, but it can be a new deck of card, a new game, a new phone, etc. Those thoeries are just a simple analogy of how we don't keep in check of our budget, a latte a day won't be a problem but it will be if you are having more, and the most toxic reason why is because you tell yourself you \"deserve it\".\n\nMy way of budgeting is I will take into calculation a latte a day, but if for whatever reason I had 2 in one day then I skip one day of latte, keeping my budget in control. Yeah it BS because it's small stuff, but this is were the money goes.\n\nMan I could go out with my SO on a Friday night just because \"it's Friday night so must enjoy\", then on Saturday we go for a brunch and get some avocado toast, no biggie. Saturday night let's order because I am lazy to cook. 3 \"small\" things that I \"deserved\" just blew over $100 on my budget",
                                                                    "score": 29,
                                                                    "author": "KezaGatame",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You do deserve it.  Maybe not 3 nights in a row, but you do deserve nights out, video games, etc etc.\n\nAll work and no play makes jack a dull boy.",
                                                                            "score": 40,
                                                                            "author": "iThinkiStartedATrend",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah indeed, as long as spending budgets are planned and retirement accounts taken care of. And having some room for adjustment like a couple of hundreds for what ever you want to do that month should be the right way to spend guilt free.",
                                                                                    "score": 7,
                                                                                    "author": "KezaGatame"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Jesus Christ thank the lord people are finally figuring that out. When I was working as a tattoo apprentice, which is like an unpaid internship, and serving in a restaurant to pay the bills I barely had any money and I had a few thousand dollars in CC debt. People would tell me ALL THE TIME “stop drinking your coffee” like all my money problems would be solved. No, random idiot, me not drinking my $3 coffee will not solve all my money problems. My problem is that I don’t make enough money to start with and that $3 coffee was often my breakfast AND lunch. Also, even if it wasn’t, I was working 70 hour weeks. If I want to buy myself a coffee every other day I should be able to without being judged. Some days that coffee was the only thing I would look forward to my whole day. \n\nWhen I started making more money I immediately paid off my debts, all the while still drinking my coffee everyday.\n\nEdit: it’s so nice to see so many people agree with me about this especially since it was something I was repeatedly harassed over for years. Its silly, but I love stupid lattes, and it got to the point where I would feel immensely guilty buying myself something i enjoyed. It’s insulting and demeaning to be told that the one little thing you indulge in to make those 10 hour work days worth it is frivolous and irresponsible and you should feel bad for treating yourself. \n\nAnd to all the people pointing out how much money you could save by simply not buying coffee - I don’t think you get what I’m saying. The reason I work so hard isn’t just to pay my bare-bones bills, it’s to enjoy my life. Many people like me work immensely hard for very little money and I don’t think we deserve judgement for choosing to use a tiny fraction of that money on something we enjoy whether it’s coffee or a manicure or a video game w/e. I would not want to live if my entire life was just making money and then only using that money on things absolutely essential. No one goes bankrupt from buying a coffee everyday, if people are struggling financially I guarantee it’s not ONLY because they buy themselves a latte.",
                                            "score": 361,
                                            "author": "ctatmeow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The coffee thing was more in response to the 5-8$ Starbucks a day coffee drinkers.  $1000+ a year is pretty significant",
                                                    "score": 169,
                                                    "author": "aegon98",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Which were mostly older people in their prime earning years.  They also happen to be the age group that wrote about \"ways to save money\" and also made fun of millenials for not having money...\n\nMy mom and I made the exact same amount in our internships 35 years apart.  $15/hr.  When I excitedly told her I got the job, she asked me how much it paid, and was so surprised that it was only $15/hr (really good money at the time to me as i had been used to $10/hr).  That woke her up on wage stagnation.",
                                                            "score": 119,
                                                            "author": "SelfANew",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Pretty much everyone at my last job would leave the office to go buy coffee 2-3 times a day and we had a super legit nespresso machine at work for free... Those are the people that need to stop their coffee habit.",
                                                            "score": 155,
                                                            "author": "nicholt",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Going out for coffee is a good excuse for getting out of the office and walking around a bit, especially if you spend all day sitting at a desk. If it was just about the coffee, they’d probably have used the nespresso machine.",
                                                                    "score": 114,
                                                                    "author": "RebelScientist",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Make the coffee inside then take it for a walk?",
                                                                            "score": 107,
                                                                            "author": "dan_arth",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I always thought of “the latte factor” as just a simple illustration of how what most people consider small amounts of money can add up to a lot if you’re not watching your accounts. I don’t know that people were literally not supposed to spend $3 on a cup of coffee. Lol. The meaning behind it has been lost in translation I’m afraid.",
                                                    "score": 87,
                                                    "author": "frmymshmallo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's exactly it.  It wasn't about coffee.  It was if you by a coffee and a muffin for 5 here, a soda later, then go by lunch and a pack of cigarettes on the way home.  How all those things add up if you do them every day.  Maybe you could give up one of them or cut back on another.  Or of you really enjoy that cancel netflix or something.",
                                                            "score": 27,
                                                            "author": "lonedirewolf21",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; How all those things add up if you do them every day.\n\nExactly. \n\nIt isn't the latte or the avocado toast; it is the latte *and* the avocado toast *and* the cigarettes *and* the soda... It isn't any *one* expenditure; it is *all* the expenditures. \n\nMore importantly, it is about **spending that is done mindlessly,** spending a little here and a little there on this and that that you don't really get much joy out of. Your spending should be done after making mindful decisions.\n\nNetflix is a great example! Netflix is a cheap entertainment and a great bargain for many people. However, think about how many people there must be who have a Netflix account and seldom or ever use it!",
                                                                    "score": 12,
                                                                    "author": "9bikes",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Like most things that are supposed to illustrate a concept, they are often misconstrued by people that are too ignorant or lazy to take time to understand that concept. So baby boomers and Facebook-warrior-stay-at-home-moms start believing it’s all the stupid millennials fault that they’re broke because they buy coffee and avocados. If only we’d stop buying vanilla lattes we’d all have 5 bedroom houses and bmw’s, obviously.",
                                                            "score": 64,
                                                            "author": "ctatmeow",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Right, that was my understanding too.  I'll sometimes buy a energy drink and a slim jim or other snack in the morning if I skipped a much cheaper breakfast at home.  That's $5.  Bottle shop on the way home for a beer or two, $6-$12.  Pick up a nice new 4 pack, $18.  Factor in if I went out to lunch that day ~$10 and suddenly some days I'm spending over $40.  Obviously I wouldn't do that if I couldn't afford to but I'm shocked at how much I do nickel and dime myself and there are people who do the same thing without the good fortune to afford to.\n\nEven being able to afford it, I question my bad spending habits.  While I do have a healthy Roth, old 401k roll over IRA and a work 401k, I really could be saving far more or paying off my house way faster.  Could probably double my mortgage payment each month if my wife and I decided to be frugal.",
                                                            "score": 18,
                                                            "author": "_HiWay",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's supposed to be a metaphor to illustrate \"ant spending\", a starbucks every day is a $150 monthly bill. Of course it's absurd if you take it literally.",
                                            "score": 29,
                                            "author": "Mr-Zero-Fucks",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "These people are spending addicts. Once they’re out of debt, some don’t feel comfortable toeing the line with credit cards. Like an alcoholic saying he’ll only have two drinks at a party. He may have the willpower to stop at two, but he may back away as far as possible to zero drinks.",
                            "score": 30,
                            "author": "Gniphe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeeeep.  My boyfriend's parents are on this kick right now.  My parents gave me his books when I was in college and I am glad I used him as a spring board to budgeting.  But I outgrew it once I learned more.  \n\nMy parents outgrew his advice too, and we all moved on.  They are retired now and I've been firmly in the industry world for a while.  \n\nMy boyfriend's parents start talking about DR and telling us \"you guys should read this and pay all your debts!\" and I had to explain that I only have 1 debt that's at 0% and he has student loans he is already aggressively paying off.  \n\nShe then says we need to set up Roth IRAs.  Again, had to explain we already had them and were maxing.  They seriously thought we had no idea what we are doing.  I own a house and have paid off all my student loans.  Yet somehow they assume I never knew this stuff.  \n\nSadly, we recognized that meant his parents likely had very little in retirement savings and if they were going through his steps then that meant they were in debt.  Which means we will have to make plans for their futures since they are not far from retirement age.  Luckily his dad has a pension plan.",
                            "score": 53,
                            "author": "SelfANew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you listen to his show, you start to think that everyone is as bad with money as the people that call in.",
                                    "score": 16,
                                    "author": "SodaAnt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The first time I heard his show I was shocked to hear people calling in saying they were 50 thousand and more in debt. I could not fathom getting in that position. It’s not everyone, but it is crazy how many people there are perpetually in the hole.",
                                            "score": 11,
                                            "author": "Sande68",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, a home mortgage is rarely below 50k. It's not hard at all to hit 50k debt with mortgages, student loans, even medical debts. Now, if we're talking 50k debt in credit cards, then yeah....that's no good.",
                                                    "score": 14,
                                                    "author": "giantoreocookie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, but theses were people with huge credit card debt for nonsense.",
                                                            "score": 9,
                                                            "author": "Sande68"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 105,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think one thing that people really miss is that wealthy people use credit.  A lot.  The difference is that credit is a tool, while debt is a burden.  Wealthy people aren't necessarily paying *interest* (though in some cases it makes sense to do so -- when you have illiquid assets that earn a higher return than the interest on a loan collateralized against those assets, it makes sense to take that loan if you need some liquid cash).  They're not paying credit card debt at 15+%, though they're likely using credit cards for many things.  They're paying it off in full.\n\nThat's not to say that everybody will have such assets, but the underlying concept is still sound -- credit can work for you, if you know what you're doing and follow a few simple rules.  Just like a hammer can smash your thumb if you're not careful, credit can really get you into trouble.  But there are jobs that can only be done with a hammer, and there are financial tasks that can only be done with credit (or at least, they can't easily be done otherwise -- yes, you *could* buy a house in cash, but you probably shouldn't even if you had the cash on hand).",
                                    "score": 145,
                                    "author": "boxsterguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Really at the base of it he's just teaching financial competency. Most people haven't a clue about anything and if they're willing to learn, they can make some huge strides. Once you learn a lot you begin to respect the value of your money and make less idiotic decisions.",
                                            "score": 29,
                                            "author": "nicholt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is exactly what happened to us. It took 15 years for my wife to convince me to take the total money makeover class. We had always lived paycheck to paycheck and never seemed to have money available. Always paid our debt payments on time though. It was super tight for several years.  \n\nWe ended up taking the class three times in three years then started teaching the class at our church and did that on 5 separate occasions.  \n\nWhat we figured out was to take what worked for us, which was get down to no debt but mortgage and pay cash for everything else. When our house is paid off in 5 years we will sell it and pay cash for some land and a house to retire in. \n\nThe envelope system doesn't work for us. Kinda. We have 4 places we fund and pull funds for paying everything from those funds. \n\nI have life insurance through  age 55 and I'll not be eligible for it ever after that due to a stroke in the mid 2000s. Neither me or my wife want to worry about debt if I die between 55 and retirement so we plan to be out of debt by the time I am in my early 50s. \n\nLike you said Dave's plan has a certain purpose.  I always felt that it was to help get you on your own path to financial stability, security, independence, freedom, whatever. \n\nIf you want it to be dead nuts simple you can follow his plan and that's fine. \n\nIf you want to figure out the rest of your path after you have some financial literacy from Dave, you can do that too.",
                                                    "score": 19,
                                                    "author": "Fairlybludgeoned"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes don’t use credit the way credit card companies want you to. Avoid the interest and fees at all costs and only spend what you can pay off. If you need more money for a house or something don’t max out credit cards to pay for it.",
                                            "score": 57,
                                            "author": "Scarlet944",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They kinda do want the fees, but that’s not all. If someone has a chase freedom card that they’re getting great cash back from, how likely are they to look at chase for their next major financing? Most people finance their house, car, student and personal loans, businesses. \n\nMany major businesses want your “wallet.” Target is willing to give you 5% off because people with target cards are big spenders and stop going to other stores. They see the red card in there when they go to pay for things and say “why am I not in target for this?” \n\nBanks are the same way.  They’re perfectly fine with being neutral or a bit negative on people that make money and smart financial  because they do things like putting down 15k towards a car and financing the other 15k instead of raiding the savings account for the whole 30 and actually paying the entire thing off.",
                                                    "score": 42,
                                                    "author": "animebop"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Yes don’t use credit the way credit card companies want you to. Avoid the interest and fees at all costs\n\nExcept the fallacy here is that credit card companies want you to pay interest.  They don't!  They want you to use your card responsibly, and that's why they throw cards at responsible credit users (aka, people with high credit scores) and give them large credit limits.  It's not to entice them to overspend and pay interest.  It's because every.  single.  transaction on a credit card earns them money.  And if you're a responsible credit user, you're going to use your card for just about everything (I know I do, and I'm irrationally pissed off the few times I can't because I try not to carry cash with me ever).  The more transactions you make, especially of higher dollar amounts, the more money the credit companies make.  The very last thing they want you to do is to get deep into debt and stop making transactions.  Yes, in that case they'll get your interest.  But they'll get significantly more money from you over time if they keep you happy and credit-healthy.\n\nThis is also why nearly every card now has rewards for using it.  Various benefits are going away like price protections and such, but those are being replaced with more and more cashback/miles/rewards programs.  Because you disputing the price on a previous purchase costs them money.  You making yet another purchase to get even more rewards makes them money.\n\nBut \"those evil credit card companies\" are held up as boogeymen to scare you away from using credit cards.",
                                                    "score": 61,
                                                    "author": "boxsterguy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 15,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This. I can’t remember the last time we paid over 25% of the total cost of a vacation out of pocket, domestic or international, thanks to miles cards. All are paid in full each month, and we typically travel 2 - 3x a year. We use 2 separate ones for almost every single purchase between the household budget and personal discretionary. Credit is a massively powerful tool when wielded correctly. A budget even more so.",
                                                            "score": 15,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Once you're unburied, you need to run away from his further advice.\n\nExactly this. His advice is for people who basically have an addiction to spending money, especially money that they don't have, and how to overcome that. But that's where his usefulness stops. His financial advice outside of paying off debt is terrible and benefits no one but himself (because he's telling you to buy all of his products).",
                            "score": 79,
                            "author": "dvaunr",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wouldn't it be smarter to pay off debts that have the highest interest first?",
                    "score": 29,
                    "author": "AnotherRedditLurker_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but psychology intervenes. Search  \"Snowball method\" and \"Avalanche method\" in this sub and you'll get a lot of results with differing opinions.",
                            "score": 25,
                            "author": "HastilyChosenUserID",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I buy tons of self-help books which essentially give me the same exact advice every time (meditation, habit forming etc etc) but I still read them. I guess reading that same thing every time (even though it's so simple) puts you back on track. Maybe more of a reassurance? like *it really is* ***that*** *easy*.\n\nEdit: Jesus fuck calm down people , I buy them because I like taking notes, highlighting and writing down my thoughts and even re-reading them again. They're not even expensive like $20-$30 which I'd spend every 3-4 months every time I get done with a book. (The reason I take that long is because I go over each strategy in detail, revisit, make notes about whether it worked or not, etc)..",
                    "score": 166,
                    "author": "M0shka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s really *simple,* not easy. We all know what to do, but are loathe to put the effort in. Putting the effort in is hard, but it’s not *complicated.* But for whatever reason we keep being afraid to do the obvious but hard thing. I think it’s because we’re afraid of putting forth the effort and not getting a payoff, and thus looking like tryhards or suckers.\n\nUltimately, all life advice boils down to either “Actually do the thing you know you’re supposed to do,” or “Try this shortcut that won’t work out in the long run instead.” Sounds like you’re buying the right books, that recommend the former, but if you don’t act on that, you’re still wasting your money.",
                            "score": 73,
                            "author": "action_lawyer_comics",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe it's more being afraid to step out of the comfort zone. There's a sense of gratification when you buy a thing from Amazon and it shows up the next day. There's a sense of gratification from managing to keep up with the Jones', or maybe even becoming the Jones' yourself. It's valuing the opinion of others that gets a lot of people in trouble. Sure, some people other issues that lead to irresponsible spending, but it's fairly easy to remedy.\n\nYou have the willpower to go to work 5+ days a week, every week, despite your job being a soul-crushing shithole. Why can't you have the willpower to simply not click a button? It really is easy. The problem is that people go about it the wrong way, or see it the wrong way. Quitting smoking is supposed to be hard. I'm 13 months clean. How? Take it one smoke at a time. Just ask yourself if you **NEED** the smoke. Is your nic fit bad enough that you're about to do something stupid? If so, have a smoke. If you don't **NEED** the smoke, don't have it. If you learn to not give into your momentary desires it's actually really easy to quit smoking. It's the same with extraneous spending. If you just ask yourself \"do I **NEED** the thing\" and don't purchase it if you don't require it, you'll find it's a lot easier to not buy things later on. Another big issue is people looking at it like all or nothing, both smoking and finance. \"I had a smoke\" or \"I had an impulse buy\" aren't the end-all-be-all people make them out to be. It's the attitude towards the debt/spending/smoking that's the problem. Most of it is just being in the right mindset, and having the willpower to look at yourself and your actions as objectively as you can.\n\n&gt; But for whatever reason we keep being afraid to do the obvious but hard thing.\n\nBecause things should be easy. We've gotten soft. Something wrong with the car? Drop it off and it's someone else's problem. Need to groom the dog? Drop it off and it's someone else's problem. Phone battery life sucks? Trade it in and it's someone else's problem. As a society we don't do things for ourselves anymore. Need an oil change? There are self service garage rentals for $10-20/hr that have lifts and tools and such provided. Learning to groom your dog isn't super hard at all. Replacing my phone battery was a $40 iFixit kit that came with all the required tools and a brand new OEM battery. Not that difficult. Hell, I can avoid vacuuming my house by using a robot. It seems that, by and large, people don't want to put the effort in. People love to try fad diets, but won't make lifestyle changes to actually keep the weight off.\n\nIt all boils down to choice. You make a choice to go to work every day. Making another choice isn't inherently more difficult than that.",
                                    "score": 17,
                                    "author": "ineedabuttrub",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Money management is 20% head knowledge and 80% behavior.",
                            "score": 60,
                            "author": "madbrewer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Financial responsibility is kind of like dietary responsibility.  It's *so* simple, but for some people, it's also very hard.",
                            "score": 23,
                            "author": "mainfingertopwise",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Well spending money on books that give the same advice ain't exactly helping either.",
                            "score": 133,
                            "author": "nonrg1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"TIFU by spending $1500 on books that explain how to get out of debt fast.\n\nTLDR: They all say stop spending money on needless things\"",
                                    "score": 115,
                                    "author": "samsangs",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly, if you can control your spending then it doesn't matter what \"method\" or program you do.  Just stop spending more than you take in, and the rest will work itself out.",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’ve never understood the lowest debt first part , pay the highest interest rate first ? Hence spend the least money over the life of the debt - simple math.",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Getting out of debt is a lot like losing weight. Sure, the fastest way to lose weight is to not have a \"cheat day\" or ever eat dessert- but if you had a healthy relationship with food, you wouldn't be fat to begin with. \n\nIf someone has a healthy relationship with money, they also wouldn't be in debt (of course, there are some exceptions- some people have medical debt or whatever, but most people in debt are because of poor decisions). So, if you're in debt, doing the \"logical thing\" probably doesn't work, because you have been shown to not be logical with money. \n\nJust like a \"cheat day\" can help you stick to your over all diet goals, the snowball method can help you stick to your overall debt goals.",
                            "score": 45,
                            "author": "Weed_O_Whirler",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a dumb question but...stop spending on what? Stop spending on everything that's non-essential?",
                    "score": 26,
                    "author": "catalinashenanigans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also spend less on the essentials.\n\nCheaper toilet paper brands on discount.\n\nTap water over sodas.\n\nHome cooking over McDonald's.\n\nUsed clothing over new. (Honestly, most can probably just shrink the wardrobe instead altogether.)\n\nBudget for entertainment or get a side hustle.\n\nThe luxury stuff doesn't feel like luxury stuff unless it's a sometimes thing anyway.\n\nEdit: Biggest saving in my life has been accommodation flexibility.  Granted, I don't have a family, but living in a worse area or smaller/cheaper place as long as it isn't condemned has been bigger for me than any pay rise.  Shared accommodation is the best for this, but even so, I acknowledge that places like New York, Sydney, etc. the answer is just to move away to somewhere cheaper with work.  Any pay cut is likely to be significantly smaller than the accommodation saving, but do your own research, and good idea to line up a job first.",
                            "score": 58,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Cheaper toilet paper brands on discount.\n\nThis is the one thing I'll never go \"cheap\" on. You can take the sandpaper, I'll stick with my soft brand name TP and find other stuff to buy with discount brands.",
                                    "score": 57,
                                    "author": "highlife159",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When you buy cheap toilet paper, you'll end up spending more cause the quality is shitty, unless you control how much tp to use. As someone who poops a lot, and lives alone, I spend $15 on tp (6-8 rolls) and it takes me like no less than 3 months before I need to buy a new pack.",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually you are right. by reducing the $$ on accommodation you are hitting on your biggest expense. No amount of avoiding lattes and using cheap toilet paper is gonna compensate for what you save in accommodation.",
                                    "score": 13,
                                    "author": "Mysterious_Bardancer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't think it's a dumb question at all.. I'm wondering the same. It's literally impossible to completely stop spending money, so where to draw the line?",
                            "score": 18,
                            "author": "cassiopeia519",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have this question too, as it stands, all the money I spend is on essentials ; hygiene products, food, transport fees, rent, medicine. The only time I buy clothes is when I absolutely need to, heck, my doctor told me that I *had* to buy more bras.",
                                    "score": 13,
                                    "author": "Omega_Tengu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same! I rarely buy clothes, when I do it's the cheapest I can find on Amazon, or using a 30% off Kohl's coupon. My next step is Goodwill, but I just get so much anxiety going there.\n\nI never go out, my only hobby is the internet (the only \"non-essential\" bill I haven't cut yet), I don't do makeup or brand names.\n\nDoes this mean that the secret to debt-free is never enjoying anything that's \"normal\" in our society?",
                                            "score": 11,
                                            "author": "cassiopeia519",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At some point it comes down to comfort. My husband and I have debt (my student loans, a car loan, a mortgage, some medical bills, some furniture and an appliance) which are all being managed. The furniture and appliance are scheduled to be paid off within the interest free zone and medical bills don't have interest as long as you're paying them-ie, they don't go to collections. \n\nThe others we're working on. For us, like I said, it's about comfort. We both have some shitty mental illnesses and my husband is having some medical problems right now (thus medical bills) so eating out and entertainment are important to us. We've cut back on eating out but it's not feasible for us to completely eliminate it right now. \n\nI refinanced the car loan to a lower rate and plan on paying more towards that and more towards student loans in a bit. We're working on building a savings nest cause his car is getting older and will need replacing soon. \n\nIt's really easy to read these things and be jealous of people who have been able to cut their debt short so fast, but I also see it like they're in a better place mentally than I am. Right now, it's just not going to work for us to completely stop eating out, live in the dark and bus everywhere.",
                                    "score": 26,
                                    "author": "asmodeuskraemer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree with what you said here. People on this sub seem to be extremely well, extreme, with things you can cut out of your life to save money and pay off debt. But honestly, I would rather dig myself out of debt slower and also enjoy my life than completely cut everything back and honestly have more of a miserable existence. I like the food I buy and I won't sacrifice that to go only to rice and beans or whatever. I cannot get to work in a reasonable time frame without driving my car. I like being able to go out occasionally. Like for goodness sakes I'm 23, I don't want to live like a hermit just to save an extra $10 every several weeks. \n\nI think cutting out extra things is great within reason. But people on here make it seem like if you do anything other than exist with the most basic accommodations necessary to survive, you're just throwing away all your money. What's the point of life if you can't at least enjoy it?",
                                            "score": 38,
                                            "author": "zzaannsebar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; But honestly, I would rather dig myself out of debt slower and also enjoy my life than completely cut everything back and honestly have more of a miserable existence.\n\nYes, and we're all gonna die anyway so might as well buckle up and enjoy the ride.",
                                                    "score": 11,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember being in 5th or 6th grade and getting into a heated discussion with my history teacher who had told us the shopping list of a poor, turn-of-the-20th-century household. Their list included tobacco, beer and newspapers for the husband. I insisted they'd not be poor if they'd just save that money.\n\nNow, some 20 years later, I truly understand how \"just don't buy creature comforts\" is much easier said than done.",
                                            "score": 19,
                                            "author": "laird_dave",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Stop Spending\" is such vague and imo unhelpful advice though. I literally only ever buy food gas and necessaties yet I'm still broke af. The main issue is I need to be paid more.",
                    "score": 63,
                    "author": "oscarfacegamble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Easier said than done.\n\nYep. I'm working 40 hours per week, I travel 10 hours per week to and fro and I have a kid as well as several social / familial obligations. No way in hell am I willing to get a side job.",
                                    "score": 31,
                                    "author": "laird_dave",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Just stop eating more calories then you need.\n\n“Just be happy”\n\n“Just work out”\n\n“Just dont drink”   \n\n“Just make friends”\n\n“Just be yourself”",
                            "score": 21,
                            "author": "Ruski_FL",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Better paying off your most expensive debt first in most cases.",
                    "score": 19,
                    "author": "rabb238",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Financially it's better to pay off the highest interest card first. However, depending on the psychology of the person in debt, it's often been shown to be more successful for certain people to pay off the lowest amount first. Getting it paid off shows a quicker image of success and encourages the person to keep going. It's why so many people take drastic steps to lose weight when in reality \"slow and steady wins the race.\" When taking on a large problem, not seeing results immediately can be incredibly discouraging, especially for those with issues with self control, which is often the case with those with large CC debt.",
                            "score": 70,
                            "author": "TrustAvidity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also, if issues pop up, having one minimum payment removed is often better than having one debt reduced.",
                                    "score": 28,
                                    "author": "Belazriel",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Credit cards are best used when thought of in the context of a debit card with better rewards and more consumer/identity protection. Track your spending meticulously. Only spend what you can afford to spend and not because you have borrowed credit. Pay it off every month. If you find you consistently can't, promptly dispose of your card and work on paying the account down.",
            "score": 615,
            "author": "YoungZM",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s how I’ve looked at it. I always check my checking account before I make an expensive purchase to make sure I can afford it. It doesn’t even take long to do so and it can save you a load of trouble.",
                    "score": 139,
                    "author": "theeglove828",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still use get and use  0% apr cards for some medium-large purchases and use it like financing. Split the total amount into a monthly payment and add it to my budget. \n\nMost recent example is I needed to buy a new mattress, financing options were at 1-5% depending on \"worthiness\" and were about 3 months longer than the 0% apr term I got with a new card. \n\nWorked out great and made it so I didnt have to take a dent out of my emergency fund to buy something I needed.",
                            "score": 72,
                            "author": "nuby_4s",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course, that’s a savvy move. My brother recently did that with all of his new furniture for his apartment. Opened up a 0% APR card, got the bonus miles for the spending X amount in the first 3 months, and paid it off before the 0% ended. Life pro tip right there.",
                                    "score": 68,
                                    "author": "theeglove828",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it’s only savvy if you don’t buy more than you would with cash. I feel like most people will spend more when they know they can pay for it later.",
                                            "score": 22,
                                            "author": "Frankie_Beans",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Best credit card deal I ever saw, although it really wasn’t worth it, was my buddy bought $X000 (I forget the exact amount) in Sacajawea (IIRC) dollar coins from the US mint. Cost was 1:1. Guy took boxes of dollar coins to the bank and turned them in. Then paid off the credit debt that day. Got (again IIRC) $500-1000 in rewards for hitting a spending limit. Only cost was gas to go to the bank and deposit (and the effort of carrying boxes of coins - those fuckers were *heavy*).\n\nI think you can’t do this anymore. The US Mint ended the practice of allowing large CC purchases with no fees.",
                                    "score": 30,
                                    "author": "jankyalias",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, old churning method. IIRC they now charge them as cash advances instead of regular purchases thus why most people dont do it (fees+insane interest).",
                                            "score": 17,
                                            "author": "nuby_4s"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone with $24k in credit card debt, this gives me hope.",
            "score": 125,
            "author": "jcdragon49",
            "replies": [
                {
                    "level": 1,
                    "comment": "You were the person I hoped it would reach. READ THESE COMMENTS!!! There are so many awesome people commenting",
                    "score": 94,
                    "author": "east_off",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also over $20k in and I concur, I feel like this might be doable.",
                            "score": 10,
                            "author": "kleinhes",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My wife and I had like 20kin debt 2.5 years ago. It was so bad we were putting off having a kid. Well 2.4 years ago we decided to kill the debt, with a baby being the reward. It took a ton of effort, we worked extra jobs, pinched where we could, and as of last month we are CC debt free. Our son is due next week.   \n  \nIt fucking sucks man, but there is a light at the end of the tunnel. If we can do you, you can do it! Stay strong.",
                    "score": 36,
                    "author": "Njdevils11",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm not sure what your takehome pay is but mine after taxes is $1600 a month, and I'm $3500 in the hole with cc debt (also 40k in student loans but thankfully the payments are being deferred until I make a little more)\n\n\nWe can't lose hope.",
                    "score": 7,
                    "author": "Allycatmeowmeowmeow",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was where you are only a few months ago.  Follow some of the tips above and you will get a good head start.\n\nI also suggest moving some debt to a new 0% interest card.  I was able to move $5000 to a new CC.  That is $5000 I am not getting hit with by APR for the next  9 months (started at 18 months, but I am half way through that)\n\nNot saying I am out of debt but I do feel a bit less stress about it.",
                    "score": 5,
                    "author": "themactastic25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\&gt;  Talk to your boss, ask what you can do to take a bigger paycheck home. \n\n\\*cries in salary\\*",
            "score": 135,
            "author": "Korzag",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 111,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure why you responded that to my comment, but I chuckled",
                            "score": 9,
                            "author": "Korzag"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The salaried version of that advice is asking how you can get either a raise or a promotion, which also implies a raise.",
                    "score": 20,
                    "author": "PC__LOAD__LETTER"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is good advice for people who are bad with debt and don’t know how to use credit cards. \n\n\nCredit cards are powerful tools to earn rewards and increase your credit as long as you pay them before interest accumulates. \n\nResponsible adults should use credit cards for everyday things, gas, groceries, anything else you would buy anyways. \n\nSaving while having debt? I disagree with what you said “save nothing till your out of debt” this is irresponsible advice. What happens if your car breaks down, you need to replace your ac unit, sudden plane trip to your moms funeral, idk use your imagination. Having an emergency fund is absolutely vital. \n\nDave Ramsey is OK. But you should cherry pick his advice if your already responsible, maybe even ignore him and find other conservative financial advisors",
            "score": 1760,
            "author": "IfinallyhaveaReddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dave Ramsey is a good drill sergeant for people who have a real problem with debt - but his actual financial advice is somewhere between mediocre and terrible.",
                    "score": 673,
                    "author": "CharonsLittleHelper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was a piece that showed up on my google home page the other day, where Ramsey said to not take company 401K match if  you have any debt.\n\nI actually never read or heard anything he has to say before. That piece automatically put him in the terrible bin for me.",
                            "score": 412,
                            "author": "hal0t",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have listened to him for a while, and I am very “Dave-ish” about his teachings. Some things I get behind, other things, not so much.\n\nThe logic behind his argument, right wrong or indifferent, is that most people can only focus on one thing at once. If you’re in debt, you may only able to do the bare minimum to get the match, which keeps you in debt longer. When you’re spraying a little bit of water on 4 different fires, rather than drowning each one one at a time. You never get out of debt, and you spend much longer putting the bare minimum (6% in most cases) into retirement.\n\nHis advice is to stop retirement, use the money to pay off your debt, then once you’re out of debt (except for your house), go back and start putting away the full 15% into retirement. Being able to putting away 15% for much longer (while still getting the match) will more than make up for the shorter period of time where you were missing out on a 6% match.  **Edit:  If this math isn't perfect, you get my idea.  If you had no debt payments (besides a house payment) and were making $50k+ a year, you can put a hell of a lot more than 6%, 15% or more into retirement.**\n\nHe even admits that his plan is not mathematically correct, but argues that if people were doing math, they wouldn’t be in debt.\n\n**Edit #2:**  I'm at home now and able to give this some more attention.  Please stop telling me how smart you all are for taking the match.  If your debts are small, and manageable, good for *you*, but the average for people who carry a balance is over $9,000 in credit card debt at 15-25% interest.  The average student loan debt is $38,000 @ 6-8%, and the average car loan is $24,000 at 8%.  So while us here at** r/personalfinance **may have our lives a little more together, stop acting like the majority of people out there have their lives together.  Some of you are sitting here telling some random person on the internet who can't afford to pay attention that it's smarter for them to hold their credit card debt at 25% interest than it is to miss a match for a couple years and dig themselves out of a hole so that they don't have to fall back on a credit card every time they run into an emergency.\n\nAlso, some of you are using hypothetical fairy-tale numbers to justify the plan.  Do you think someone making trash money can afford to put away $100 a week (5k/year) while they sit here and post memes about how they're drowning in student loan debt and can't find a job?",
                                    "score": 198,
                                    "author": "Contact40",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; He even admits that his plan is not mathematically correct, but argues that if people were doing math, they wouldn’t be in debt.\n\nThis is a really good point. I think a lot of financial advice fails because it treats people like they are robots and fails to account for psychology.",
                                            "score": 82,
                                            "author": "unknownmat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup. I feel like the people who say Dave has bad advice don’t know his typical audience and have never interacted with people who can’t control their debt.\n\nIf a person can’t control their spending and ballooning debt they might as well use the 5% match to wipe their ass. That way it doesn’t increase the portion of unsecured debts you must repay creditors as part of your bankruptcy repayment plan.",
                                                    "score": 35,
                                                    "author": "new_math",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It won't tho. You'll never recover the matching funds or the growth over time. You should reduce your own contributions to max the match of you need that money to pay down debt, but to lose it completely, an immediate 50%-100% return, for potentially years... Even without debt I'm not contributing 15% of my income to a 401 k anyway.",
                                            "score": 59,
                                            "author": "CaptainTripps82",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. Especially if you’re young. If a person saves $5000 per year from age 25 - 35 at normal interest rates, that ends up to be the same amount at retirement than if that person saved the same amount per year from 35 - 65.",
                                                    "score": 26,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed. While digging us out of dedt, I REFUSED to stop the retirement plan. I was getting 100% match up to 8%. It made ZERO sense to me to stop that. 8% of my paycheck didn't make much difference, but 16% does in the retirement..",
                                    "score": 52,
                                    "author": "LovesFLSun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Whoa! That's a fantastic plan. I'm being transferred over full time in my current position and their match is something like 6% of the total amount you contribute after a year. It's a bit of wonky wording, but that's what it comes down to.",
                                            "score": 10,
                                            "author": "kgal1298",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep.  I put in n 8% and get 8% free (as long as I keep on contributing).",
                                                    "score": 8,
                                                    "author": "LovesFLSun"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fuck that really is a good plan. My company does some ridiculous shit where they will match a percentage of your contributions up to 10% and that percentage is based on the amount of time you've been with the company. I don't remember what their scale is, but it's never a 100% match at any point, even after 20 years of employment.",
                                                    "score": 8,
                                                    "author": "aiakia",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 31,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I understand where you are coming from, but to expand on the idea he urges people to pay off all debt in 2-3 years (except mortgage). Extra jobs, sell things, kill that debt as quick as possible. Then fully fund the emergency fund, then 15% to retirement. Just getting the headline of \"Don't take company match while you have debt\" isn't the whole story. If you are going to take 20 years to pay off debt then it's not the right solution. But if you whoop ass and pay off all your debt in 2-3 years it is a very effective system. But you can't be \"Dave-ish\". You need to be all in or the system doesn't work very efficiently.",
                                    "score": 16,
                                    "author": "madbrewer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I believe he actually has a caveat that if it will take you more than 2 or 3 years to pay off the debt (I forget the exact number), then it’s okay to still contribute to the 401k.\n\nHonestly a lot of advice sounds wacky if you are responsible with your finances, but if you listen to his show it makes a lot more sense in context. A LOT of the callers he gets are high-income households with high-interest consumer debts. People in LCOL areas with 140k household income, yet with 20k in credit card debt. In those cases, it makes sense to go “all-in” and stop contributions for a few months to free up as much cash as possible to kill the debt.",
                                            "score": 13,
                                            "author": "Alex-Gopson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Man. I'm sitting here making $40K gross a year from my main job wondering how people with two 6-figure heads of the household are drowning in debt.\n\nLike, that's a household with probably 5 times my income. I could be debt free in six months with that.",
                                                    "score": 5,
                                                    "author": "Archer-Saurus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "These people have a $600k house, upside down on 2 $40k cars, $40k in credit card debt and $100k in student loans. They increased their lifestyle beyond their income to an unstable point since they feel they \"deserve it\", didn't just happen overnight.",
                                                            "score": 9,
                                                            "author": "Take_a_stan"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dave Ramsey is good for helping people who have difficulty with self control. He is not good for people who are capable of approaching money rationally and dispassionately. \n\nMost people are okay with having a drink or two on weekends, because they are capable of stopping well before their drinking becomes problematic. However, most recovering alcoholics won’t allow themselves even one drink, because they tend to spiral quickly. \n\nSame thing with debt. People who have an unhealthy relationship with money need to take precautions most other people don’t.",
                            "score": 59,
                            "author": "Louis_Farizee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. He's fine for the addicts, but he sells it as a one-size-fits-all plan for everybody.",
                                    "score": 15,
                                    "author": "CharonsLittleHelper",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely. When I was doing accounting classes one of the intro courses to the program was a class about one of his seminars, where he was going over essentially a study guide book that you would follow along with a workbook. I was only 18 and only had one CC with my credit union. I paid everything with my CC and paid it off the moment it showed up in my online banking. \n\nTo hear/see him say that CCs are \"bad\" (or whatever it was described as), and cut them in half on stage was a bit of a joke, especially when there are CCs out there with cashback that will *pay you to use it for stuff you were going to buy anyways.*\n\nPersonally, I hated the class overall (and changed out of an accounting program), and it was definitely focused to those who struggle with debt and want to get out of it, vs. a class to make those become a \"financial success\", because why the hell would he tell people how to make money *effectively?*\n\nI'll just read from Clark Howard. My dad always used to listen to him when he picked me up from pre-school, and he was always on the ABC news station in Atlanta.",
                            "score": 19,
                            "author": "Swagger897",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dave Ramsey also used to take out 90 *day* financing on investment properties, and treats it like the takeaway from getting burned doing that should be “DEBT BAD!”\n\nThat’s like taking a kerosene shower before trying to grill out and then screaming “DON’T USE FIRE TO COOK FOOD!” while laying in the burn unit.  Weirdly a lot of his acolytes forget to mention that his “sage” advice is based in experience being deliberately fucking stupid.",
                                    "score": 9,
                                    "author": "LordOverThis",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I make 60 bucks a month with my credit card and pay it off every month with a free checking account with free checks because the balance is never below 2000$, I was paid 300$ to open the account.",
                                    "score": 8,
                                    "author": "yourweaponsplz",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's a very strange thing for an accounting class to show.\n\nMy accounting teacher told us all the little tricks, like one of his clients who had a branch in the boonies where he knew mail was slow. He's always mail in his bills from there the last day they were due, because legally they count as paid when they're postmarked, and that way he'd get another few days of interest on the $ while it was still in his account.",
                                    "score": 8,
                                    "author": "CharonsLittleHelper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's chasing nickels..",
                                            "score": 17,
                                            "author": "realzequel",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed",
                            "score": 6,
                            "author": "IfinallyhaveaReddit"
                        },
                        {
                            "level": 2,
                            "comment": "I agree the snowball method does work great, but then when you ask him about student loan debt it's like \"Yikes\" he's a bit out of the realm of reality.",
                            "score": 9,
                            "author": "kgal1298"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I use my credit card for everything, gas, groceries, trips, bills, doctors copays, everything that takes credit cards. To the point that I usually have to check if we are going out to see if the establishment takes credit cards bc if not I have to make the annoying trip to the atm bc I never have cash. Although I've never had to use any of the extra protection on products that credit cards give compared to using cash, it's nice knowing that I can call up the card company and cancel a transaction if something shady happened. \n\nPlus like you mentioned, the cash back rewards I get are a nice bonus. Every year I'm able to use these rewards to buy all my Christmas presents for my family. It's never been an issue for me paying off the full balance every month bc I make purchases of things I will have to buy in my everyday life no matter what, and I have self control over what luxury things I buy. \n\nBut I do want to say each person needs to do some self reflection and decide if they will have that self control. I have 3 friends that are all in credit  card debt consolidation right now and they dont even use the cards for everyday purchases. If you dont think you can control yourself it's best to use cash or checks.",
                    "score": 47,
                    "author": "TheManWhoHasThePlan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;What happens if your car breaks down, you need to replace your ac unit, sudden plane trip to your moms funeral, idk use your imagination. Having an emergency fund is absolutely vital.\n\nThis is definitely a valid point, but look at it this way:\n\nOption 1: You save up $5k before paying down your $16k in credit card debt. You're continuing to pay interest this whole time, so you actually owe a little more than $16k. An emergency comes up, you have cash to pay for it. But your credit card debt is slightly over $16k still.\n\nOption 2, you use every penny you have to pay down your credit card and an emergency comes up after you've paid it down by about $5k. You have no choice but to put it on your credit card, and you charge that $5k back onto the card. Your credit card debt is about $16k.\n\n&amp;#x200B;\n\nKeeping the debt while you save your emergency fund has a guaranteed downside, you have to pay more interest. Paying the debt while you save your emergency fund carries the risk that you'll have to add to your debt, but no guaranteed downside.",
                    "score": 117,
                    "author": "FunkyPete",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see it both ways, but just to play devil's advocate - not every emergency can be paid on credit. Get sick/injured and miss a month of work? Your mortgage won't go on your card. \n\nI think \"be able to pay for one month of home expenses\" is a fair middle ground generally. But all mileage varies.",
                            "score": 19,
                            "author": "AmIRadBadOrJustSad",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah the e fund is a weird dogmatic thing on here. Keeping one makes no sense if you have high interest debt, unless you think you literally would not be able to get another loan if you needed one (in which case your wages are probably being garnished to pay down the debt anyway)",
                            "score": 62,
                            "author": "TheRealMaynard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really any debt other than credit cards or payday loans should come after an emergency fund though",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that’s why I specifically said high-interest, agreed\n\nPersonally though I don’t agree with the church of e fund so much that you literally need cash sitting around, if you have 6 months salary in bonds, why do you need 6 months salary in the bank? Do people think the US government is going to collapse, but somehow their cash will be safe?",
                                            "score": 17,
                                            "author": "TheRealMaynard",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bonds are a good vehicle to keep your e-fund in. I keep a large part of mine in bonds. But I do have a few thousand in checking accounts that I can access instantly, just in case I need $1000 *right fucking now*. It's only getting like 0.02% interest but that's not the point of an emergency fund.",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah keeping a buffer of like a paycheck makes sense IMO, in the event that an expense comes up where you can't pay it with a credit card or wait 7 days to liquidate investments. But /r/pf insists on 6 months of expenses which is just crazy to me",
                                                            "score": 12,
                                                            "author": "TheRealMaynard",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Part of it is psychological.  It gets you out of the cycle of never having cash on hand to pay for emergencies.",
                            "score": 9,
                            "author": "gorkt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gordon makes a mean scrambled egg though",
                    "score": 58,
                    "author": "VVarlord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, if you like a soupy scrambled egg, I guess.  I'm more a fan of the rustic american style larger curd scrambled eggs.  Those can still be moist and delicious and not rubbery even with the larger curd.  The trick is to take them off the burner before you think they're done.  They'll finish cooking on the plate with residual heat.",
                            "score": 14,
                            "author": "boxsterguy"
                        },
                        {
                            "level": 2,
                            "comment": "Eating eggs is good budget advice",
                            "score": 12,
                            "author": "Quinnarm",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why do these posts always get qualified with a “well use credit responsibly” statement? It’s not responsible to have $16k in CC debt! OP learned his lesson and paid it off, and he is doing what he needs to do to not go back. Someone who is using credit responsibly can’t relate to his story. It’s very responsible to know your own weaknesses and make changes accordingly, and that’s what OP did.",
                    "score": 31,
                    "author": "GaryBettmanIsMyHomie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My husband and I are kind of Dave Ramsey psychos. Saying to “cherry pick his advice if you’re already responsible” is honestly really good advice I needed to hear. We have zero debt (have never had it), $30k in the bank, and full time jobs with masters degrees. We’re saving up for a house right now, and last week had to buy some plane tickets so I can travel to my distance college for my capstone and graduation. When I went to check out, they flaunted the “$200 credit on your statement if you get this AmEx Delta card.” And I did it. I read through the terms and everything, there’s no annual fee your first year, no cancellation fee, etc. and my husband about had a FIT that I signed up for it because DAVE RAMSEY SAYS NOBODY GOT RICH OFF AIRLINE CREDIT CARDS! \n\nI explained to him my logic. We use a bank credit card for groceries that we pay off weekly, Dave Ramsey doesn’t advise that either but we do it because we’re responsible. This is money we were ALREADY GOING TO SPEND and they’re going to give us FREE MONEY if we use their card instead of ours. And that was the first time we both went, “wow, maybe Dave Ramsey isn’t totally correct about 100% of things.” I just got our AmEx statements and paid them off today. We saved $400 that we otherwise would have spent. That money is going to buy us the stroller we really wanted but couldn’t justify purchasing. \n\nI’m so thankful I started listening to him at a young age and didn’t go into debt to buy stuff or to go to school. But now that I’m still debt free with a 790 credit score and a fat cushion for emergencies, I really think we should find a financial advisor tailored to us specifically rather than listening to a podcast. Thanks again for this advice, it was helpful for me to read today!",
                    "score": 19,
                    "author": "pyperproblems",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I keep hearing not to use Dave Ramsey, but they never offer any other solutions. He's just so permeated in mainstream society. Do you have examples of alternatives for those of us not in debt but having trouble saving?",
                    "score": 4,
                    "author": "TheBiffledon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; When in doubt... overpay. If you run short on money in your checking, but whoop, dip into the CC for 50 bucks\n\nThis is the mentality that allows most people who are already in debt to continue to be in debt (or make it worse).  Should you pay minimum payments and dump everything else into savings, no...but you should always have cash that is accessible while paying the most that makes sense toward debt.",
            "score": 57,
            "author": "CaffeinatedInfoSec",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah, that part was especially bad advice for everyone!  an overdraft fee is never a good solution",
                    "score": 21,
                    "author": "R0GERTHEALIEN",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man I had 2k on a credit card and I thought that was annoyingly high. 16k sounds like a nightmare.",
            "score": 25,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was. I’ve heard of worse though haha not saying mine was okay",
                    "score": 8,
                    "author": "east_off"
                },
                {
                    "level": 1,
                    "comment": "$5000 isn't much to spend but it is hard to pay back. $16000 is harder.",
                    "score": 7,
                    "author": "rreid29"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I definitely feel like a slave to credit cards.  The end of last year was our rock bottom; all cards were maxed and the overall balance so high I won't tell *anyone* until it's way, way in the past.   In December, I looked at all our statements and noticed the \"pay this amount to be paid in full within 3 years\" wasn't *that* much higher than the minimum payment due.  So I made a resolution to not use the credit cards for anything, and to pay that 3-year amount every month.  We still have a long way to go, but we're 1/6 of the way there, the balances are paid down by almost 12%, and for the first time in my life, I've gone 6 months without charging anything.  I'm 45, so we're talking a long time racking up, paying down, racking up again.   \n\nIn a way, it's been really liberating to not rely on the cards for anything.  It will surprise no one on this sub that we've been just fine without the extras we would have charged, and emergencies have been covered by our $1000 emergency savings account (which is woefully small right now after a triple-whammy this month). \n\nI can't wait to be in the position to post that we're DONE with credit card debt.  Just 2 1/2 years (or less!) to go.",
            "score": 64,
            "author": "2boredtocare",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel like there's more to the story between the \"just filling out a loyalty card\" part and the \"all of a sudden found myself with $16,000 of debt\" part. Makes it sound like OP thought the loyalty card entitled him the $16,000 worth of free stuff.",
            "score": 423,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know right lol\n\nOP did a yadda-yadda-yadda over the best part",
                    "score": 306,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, he mentioned the lobster bisque ;)",
                            "score": 74,
                            "author": "ohm18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 26,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You right you right thanks",
                                            "score": 5,
                                            "author": "ohm18"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's overall strange people need to be told not to get into 16k credit card debt.\n\nWhere do they think the money's going to come from?",
                            "score": 43,
                            "author": "manlycooljay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can understand going a little nuts, but when I went nuts on my credit card, it was to the tune of $200,not $2000. I don't understand how that happens.\n\nI guess it depends on whether you have a need to see that balance at 0 at the end of the month or not.",
                                    "score": 16,
                                    "author": "tossback2"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And how do you get approved for $16k on a Sporting Goods store credit card at 23 with apparently no credit history?",
                    "score": 71,
                    "author": "spentmiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think there were probably more cards after that. That said, I got turned down for a Target card at that same age with no credit history, so how OP got approved in the first place confused me.",
                            "score": 38,
                            "author": "kilowatkins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even with a decent credit score (above 750) and 10+ years of credit history, Target started me off with a $500 limit. It's only now been increased to $800. Amazon started me at a $5k limit shortly after I got the Target card, and has already been raised to $7k\n\nI don't understand it.",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Target card is a store credit card in the strictest sense. It's not a discover/visa/amex, you can only use it at Target. The limits are lower by design of the cards consumption, just at Target. The Amazon credit card can be used a anywhere and the limit reflects that. Additionally people spend more on Amazon, so higher limits",
                                            "score": 11,
                                            "author": "aegon98",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is changing.  I just received a letter in the mail that my target card is changing to a Mastercard that can be used anywhere (unless I opt out)",
                                                    "score": 5,
                                                    "author": "aardvarksauce"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Meanwhile I walked into a rooms to go and left with a 21k limit card just to buy a single couch for 2k interest free. Luckily I’m not an idiot and didn’t max it out",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That would have been a sweet $21k couch though.  Bet it had massage functions and built in woofers...in Italian leather.  Just saying you probably missed out.",
                                                    "score": 4,
                                                    "author": "Praefectus27",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Never applied for a target card, but got duped by Macy's clerk as my first \"official\" cc. Was told it wasn't a cc, but I was 19, stupid, and gullible. Bought a tie for father's day on it. Told my dad about it and he immediately tells me to get rid of it ASAP. Literally takes me right online on the spot and cancel'd that joker. Had no prior credit at all. It's definitely possible to get store credit cards with no credit. They have really low limits anyhow like secured cards would have. I don't think they're too worried about writing off $500 here and there as their limits are that low typically. \n\n The $16,000 OP got I'd bet my girl's left tit happened in combination of other cards as well.",
                                    "score": 11,
                                    "author": "SoggyMcmufffinns",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My first card at 19 was an Amex with a 12k limit on $8.25 an hour part time and pell grants for income. It definitely happens. I can imagine a store card could be more generous with credit limit.",
                            "score": 12,
                            "author": "ohwut",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'm pretty sure the point was \"I got this card without understanding it, and that led to a series of bad choices that ended with $16k of debt before I came to my senses\"\n\nI don't read any suggestion that they gave him $16k off the bat.",
                            "score": 5,
                            "author": "loljetfuel",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree, unless you have a terrible luck with your car, house, health etc all the time, how do you keep spending money that you don't have.",
                    "score": 23,
                    "author": "ludmi800",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, how did he spend $16,000 with what he thought was a loyalty card? You don't use loyalty cards to pay for anything.",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean obviously he got more cards, but still racking up 16k is insane if you have average income levels.",
                                    "score": 8,
                                    "author": "nau5",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 73,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I guess he thought he was signing up for one of those magical loyalty cards that lets you charge thousands of dollars to it without having to pay it back lol.  \n\nHe knowingly signed up for a credit card and used it irresponsibly.",
                    "score": 47,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP is trying to get pity points or something like that is my guess. Even if you didn't know signing up he'd have to know after at least a month or two when he should've been contacted for not paying his bill not 4 years later. Either that or OP let the guy walk all over them so the sales rep could get his bonus or whatever for signing up someone up for their card.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finally paid off my CC earlier this year.  I went through a shit patch with an abusive person and found myself with a lot of CC debt.  Took forever to work it all off... but now it's gone.  Such a relief not to have a credit card debt looming over every purchase.  I still had to eat and pay bills, which meant adding to that debt while trying to push it down.  \n\nBut I got there.  And it is good.  One last line of credit to kill and then I will be 100% debt free.  If I empty out my bank account, I can flatten that LoC to $0 right now, but living with an abusive person has taught me the value in having fast cash within arms reach.  \n\nCC debt can definitely get away from you if you let it.",
            "score": 111,
            "author": "HouseCravenRaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mother always made a point of telling me to have some savings that were just mine, not linked to anyone else, in case of a situation like this. My parents have been happily married for almost 40 years, and I’ve never been in a situation where I needed it, but I’m glad she instilled this in me. You never know what might happen, and it’s good to be prepared! \n\nSo sorry you had to go through that, and I hope everything is better for you now!",
                    "score": 9,
                    "author": "kickatstars",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 97,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Part of the Dave Ramsey plan is $1000 emergency fund before you start paying off debt.\n\nAfter you get out of debt, bump emergency fund to 3-6 months expenses and then start investing and paying off your mortgage.",
                    "score": 8,
                    "author": "rreid29",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "There should be a class in high school about debt. And finance",
            "score": 30,
            "author": "rm49379",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What happened to me was that I got used to carrying a balance, and making a payment to the cc provider every month. Once that is established, it is way too easy to add another few dollars to the payment each month, by buying more stuff. \n\nEventually I came to realize that if I hadn't gotten on that treadmill I'd be SAVING that payment every month, or buying but not going into debt.\n\nThe best advice is, don't start. Never carry a balance. If you can't afford it now, borrowing is not the way to get it, whatever it is.",
            "score": 11,
            "author": "ahominem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Companies totally prey on that mindset too, especially store credit cards. You get used to making a few payments, then they raise your limit so you can get even more stuff for just a few more dollars a month.\n\nI'm still whittling away at my debt, right now my only victory is that I don't need a second job anymore just to get by. Just have to keep my eye on the goal and follow my budget.",
                    "score": 6,
                    "author": "alyymarie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You may find these links helpful:\n\n- [Debt](/r/personalfinance/wiki/debt)\n- [Dealing with collections](/r/personalfinance/wiki/collections)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
            "score": 10,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If a store ever tries to get you to sign up for any sort of card, ask straight up if it's a credit card. Most of the time it is and they're trying to frame it to sound like a loyalty card or some other customer reward program. Look out for yourself because corporations sure aren't going to. Good job getting your debt down to zero, OP!",
            "score": 9,
            "author": "melhekhinhel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It took me a long time to realize that the Jones’s weren’t better at money than me, than just ran up huge credit card debts. They float that as king as they can but then it all shows up in the divorce. One of the positive side effects of marriage counseling for us was that I decided to keep our cc debt at 0 since all the friends I knew who were divorced complained about the insane stress from debt. While it isn’t the main thing saving my marriage it’s a huge part of feeling good everyday.",
            "score": 47,
            "author": "dewayneestes",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are also a lot of Joneses who just make more money than you do.",
                    "score": 47,
                    "author": "K2Nomad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work in one of the most expensive cities in the world for an incredibly successful company, I live that fact every day. But even for them I see some pretty insane debt servicing going on. No matter how much money you make there’s always plenty of examples of peers who still can’t live within their means.",
                            "score": 10,
                            "author": "dewayneestes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love the unsave cards on Amazon thing.  I might use that just to help prevent impulse buys.  We aren't in CC debt but we also buy shit on amazon on impulse sometimes before truly evaluating whether it's the best use of the money or if there's something else we'd rather spend that money on.",
            "score": 20,
            "author": "Shillen1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was in a similiar situation. Ended up 35k in student loan debt.  Even though I have a large dII baseball scholarship and multiple academic scholarships.  My parents just didn't know about money.  They said take what ur approved for.  So I did.  Graduated with a business degree and a 3.7 GPA.  I had baseball honors and thought I did everything right.  Just put my nose to the ground, did well in school, played well in ball, the rest would manifest right?  \n\nEnded up miserable, alone, 6 hours from family, bought a house with a friend 107% financed, had 15k in credit card debt (It's sweat equity right???) (2006 mind u).  \n\nShit came crashing down.  My buddy moved out of state.  Housing market crashed   I had to rent rooms.  Worked 2 jobs.  Fell in love. Moved back to home state.  Used a property manager for 2 years to keep head above water on property.  Sold house to break even thankfully in 2016.  Put tons of work into it.  \n\nI finally figured out how to budget.  Listened and read Dave Ramsy.  He isn't the end all be all, but for 90% of the population his advice is sound.\n\nI lived with my now wife on just her teacher salary.  Used all of my salary for debt.  I had 40k, she had 10k.  \n\nGranted I was \"lucky\" to me making 50k (managment in a medical device company) while my wife make 48k in Iowa (Masters in education). \n\n She bought a house outta college (105k) with a small bit of help from parents. She rented 2 rooms and hustled.  She saved 15k working construction over summers whe in college.   I started waiting tables on top of my big boy job when trying to help pay down debt.\n\nWe paid off 50k in 10 months.  It sucked.  We didn't really live.  Just focused.  One tiny bite at a time.  Every extra bit was toward loans.\n\nNow we have a family of 4 (soon to be 5 in a few days).  I'm a stay at home dad.  We \"upgraded\" to a 175k house with more lawn and newer.  Median house is still around 300k.    \n\nWe managed to save up 30k in savings.  I've taken on a small bit of handy man work to try and get out of the house and contribute a bit.  \n\nWe started out in 2011 with some serious negative net worth.  Today according to Mint we are 136k positive.  \n\nWe are pretty simple and don't need much.  We have close friends nearby by family far away.  I still cook meals from scratch using cheap ingredients.  My kids are happy and healthy and so are we.  If there is a will there is a way.  We live different from lost 35 year olds, but seem happier.\n\nI just wanted to share my story in hopes that it might help somebody get motivated.  It's hard to swallow your pride some days and do shit work with a college degree.  And I say \"shit\" meaning hard.  My father was a police officer and my father in law has been in construction for 4 decades.  I know blue collar as much as anybody, but know our generations thoughts on such work.\n\nSome days you just gotta grind.  It's worth the temporary suck.",
            "score": 18,
            "author": "Drewski107",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I said it many times: fighting crippling debt is like going to WAR. It's either you or \"them\".\n\nNothing else matters until that shit is dead, you must live and breathe that warrior mindset. Every $ wasted is a bullet to the enemy.",
            "score": 26,
            "author": "FootoftheBeast",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I've used a CC every month for practically every purchase for the past 5 years. I treat the CC like cash. You just have to have the correct mindset to use a CC.",
            "score": 39,
            "author": "bobbybottombracket",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;It's never occurred to me that I wouldn't pay off the entire thing on the due date.\n\nSame with me, I have always treated my credit cards as 'deferred' debit cards. I use them only for stuff that I know I can pay off the same month from my checking acct.",
                            "score": 7,
                            "author": "deltapak",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Put post-it notes with $0.00 written on them\n\nOr put the remaining balance on them.  Give yourself a goal to shoot for by continually watching the number go down.  Can even use the same note and cross off the old number and write the new one.  Some people would psychologically find that as much if not more of a motivator than just seeing 0.",
            "score": 12,
            "author": "ronin722",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea, good point",
                    "score": 6,
                    "author": "east_off",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are some great points and things people really need to hear. It's so easy to sink in debt. However the comments about credit cards being powerful purchasing tools when used properly are also correct. \n\nOne thing I do to help connect the dots on spending is I enter the purchase in my credit card register (I use clearcheckbook online to track all my accounts). Entering it immediately helps me connect the dot and I can see my credit card balance go up right there. But then I also enter the expense in my checking account. No it doesn't affect my true checking balance yet but I've already spent that money. My checking balance goes down in my app and since that's the number I see all the time, it's much easier to connect what my real balance is because that accounts for also making that credit card payment when it's time. Seeing a checkbook balance low or even in the red, when the money hasn't actually gone out yet, makes it a lot easier to say no I can't afford to spend this extra money now.",
            "score": 13,
            "author": "Chiller315",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I implemented a $50 50hr rule for online purchases. If it’s over $50 I have to wait two days before I purchase it. That makes it easy to come back and talk myself out of a purchase that would have typically been an impulse buy. Little rules on top of the already given advice have helped me",
            "score": 7,
            "author": "qkilla1522"
        },
        {
            "level": 0,
            "comment": "No offense but it always amazes me how such a massive percentage of the population needs a hundred rules and a ten step plan to comprehend something as simple as you can't spend money you don't have.  It's mind boggling.",
            "score": 92,
            "author": "StrictBunch",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's also the same reason why people need a million diets to lose weight. Burn more calories than you consume.\n\nIn the end it's just a matter of discipline.",
                    "score": 28,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Maybe the error comes not from ignorance or stupidity but from desperation?\n\nI can see how it can happen to a lot of people, especially those struggling. What sounds better, not having shit now and not having shit later with no debt, or having shit now and maybe still having some shit later but also having debt?\n\nDebt suddenly doesn't sound bad when the option that involves avoiding debt means going without. I'm not saying it's a good situation of course but I get it. Take someone who has very little, while their future doesn't look like it'll have much more than it does now, and debt seems like the only way to have things",
                    "score": 21,
                    "author": "IWasBornSoYoung",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me personally, most of my credit card debt came straight from need. I come from a very poor family (like 13000 a year, 6 people) and when I moved out and got my first job, I had nothing. I needed credit just to buy the necessities and to help pay my bills. I definitely dont know OPs story, but I understand the struggle. I recently have turned my $14,000 of debt into $3500 and it's still a little bit of a bitch.",
                            "score": 14,
                            "author": "afoederer",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Less than two years later, we now have $16,000 in savings and no credit card debt. \n  \nStep 1: Make lots of money  \nStep 2: Don't make not much money",
            "score": 11,
            "author": "Loxe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Between the debt they paid, and the money they've saved, it's $32,000 in 2 years. $1300 a month being put away. That's more than rent for a lot of people.",
                    "score": 10,
                    "author": "Superfly724"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really thought this was going to be another it's not my fault I am greedy post, you took ownership of your mistakes and are giving the best advice to others. Thank you for that.",
            "score": 5,
            "author": "coldasotzi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The way I use my credit card is pretty simple and yet very effective. I make a purchase and I immediately transfer money to my CC accaount to cover it. No matter big or small. Or am I going to return it or not. That clears the balance immediately after it's posted and limits me to spent what I only have in the checking. It's sounds pretty easy but it does require a lot of willpower to get started and it does require you to check your CC and checking at least once every day, if that's not already your routine. With this method I was able to built a credit score of 760-770, not very impressive but for me it's an achievement.",
            "score": 5,
            "author": "wilsonyu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 24,
            "author": "[deleted]",
            "replies": []
        }
    ]
}