{
    "id": "11iuu5r",
    "score": 3,
    "title": "Science or Biomed",
    "author": "Emergency-Cup7333",
    "date": 1678015402.0,
    "url": "https://www.reddit.com/r/deakin/comments/11iuu5r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to become a medical scientist in the future, and I'm currently studying Bachelor's of Science 1st year. Do I have to study Biomedical Science or Science to become a medical scientist as I've checked online and there wasn't much information.",
    "comments": [
        {
            "level": 0,
            "comment": "Find a job you would want on seek etc. And see what they are asking for",
            "score": 4,
            "author": "Cyclist_123"
        },
        {
            "level": 0,
            "comment": "If you want to be a medical scientist then it's all about the units you study not the name of the degree. Biochemistry/Immunology/Microbiology/Genetics etc are the same in either degree. You may enjoy Biomed core units more but at the end of the day you can go into research with either. You will need to go the honours/PhD route. \n\nNow, if you want to be a medical laboratory scientist, then you need an accredited degree. \n\nNot sure which pathway you are referring to.",
            "score": 1,
            "author": "damselflite",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correct. I did biomedical research for a bit before med school and you can come from Biomed or Science as long as you pick units for fields you would care to major in. Biochemistry and Genetics are very good foundational medical research subjects. Most wet lab techniques are just biochemistry and genes pop up in everything living",
                    "score": 1,
                    "author": "allevana"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would suggest biomedical science as the units are specific to medical science.",
            "score": 1,
            "author": "Evolutionarystudies"
        }
    ]
}