{
    "id": "11vh1qt",
    "score": 7,
    "title": "Are there any ramifications for not having done academic integrity yet?",
    "author": "Responsible-Damage13",
    "date": 1679219372.0,
    "url": "https://www.reddit.com/r/deakin/comments/11vh1qt",
    "media_urls": [],
    "other_urls": [],
    "postText": "?",
    "comments": [
        {
            "level": 0,
            "comment": "The handbook for [AAI018 - Academic Integrity](https://www.deakin.edu.au/courses-search/unit.php?unit=AAI018&amp;year=2023) states that the assessment is due in week 3. I assume the other faculty Academic Integrity units are similar. If you don't pass, I believe you can't progress your course or have to appear before the academic integrity committee or something similar. I can't remember. \n\nBasically, just do it. You get unlimited attempts at the quiz and once it's done, it's done. Its going to be a massive pain in the arse for you to not do it on time and you don't really have many excuses not to because it's the easiest unit in the entire world. Just do it",
            "score": 9,
            "author": "IlllIlllIlllIlI"
        },
        {
            "level": 0,
            "comment": "It's so easy Nike it my man or woman depending on your gender",
            "score": 2,
            "author": "Professional_Line385"
        },
        {
            "level": 0,
            "comment": "At my Uni you cannot submit any assignments if you haven’t done it. Just get it over with.",
            "score": 2,
            "author": "BudgetContract3193"
        },
        {
            "level": 0,
            "comment": "It takes legit maybe an hour",
            "score": 2,
            "author": "DystopianDildo"
        },
        {
            "level": 0,
            "comment": "It's so easy Nike it my man or woman depending on your gender",
            "score": 1,
            "author": "Professional_Line385"
        },
        {
            "level": 0,
            "comment": "It definitely is one of those things where *not* doing it is far more difficult in the long run than spending &lt;1 hour just getting it over with.\n\nYour enrolment can eventually be restricted if you don't do it. In between will be so much correspondence and hassle for so many people that it's just pointless not to click through the test.",
            "score": 1,
            "author": "Affentitten"
        }
    ]
}