{
    "id": "133egbq",
    "score": 2,
    "title": "Building a social life at uni",
    "author": "ArchangelDeltius",
    "date": 1682824523.0,
    "url": "https://www.reddit.com/r/deakin/comments/133egbq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hiya, I've been wondering how people actually go about building relationships/connections in uni, maybe it was cvd but in my last undergrad no one was really social and only 1 club ever was active (Swinburne not deakin).\n\nI've been pondering if living on res is key to building a social network, how have you peeps managed it?",
    "comments": [
        {
            "level": 0,
            "comment": "If you ever figure it out, let me know :/",
            "score": 11,
            "author": "notmynose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cc me on the email",
                    "score": 2,
                    "author": "RamBam_99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Low-key the best luck I've had is in TAFE. But yeah uni seems quite anti-social in my experience lol",
                            "score": 3,
                            "author": "ArchangelDeltius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sports. I’ve been out of uni for a bit but it’s what I did and whenever I move somewhere new I have found sports the easiest way to make new friends and build a social life. Even if you’re not good at it still play and have fun",
                                    "score": 2,
                                    "author": "bobjohnxxoo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Living on res will probably accelerate your social life in that you have more forced interactions and you’re living in closer proximity. If you can afford it, do it! \n\nIt is pretty hard to make friends the older you get, though, and uni is no different. I think with covid as a disruptor people overall have lost little social skills that made making friends a little harder too- just little things like following up from interactions (“hey it was great to meet you today, here’s my number”), or not overcompensating for the virtual experience (eg. Lots of zoom classes might be cams off, but people don’t put the effort into then using the chat). This is not a diss on anyone, just something I’ve noticed that seems to be almost universal. At the start of COVID we were all a little more conscious to overcompensate for the social barriers, but now at uni people feel a little awkward about interacting or don’t jump into an interaction with the same effort. Not sure why this is - something to ask a social studies student maybe! \n\nMy best advice is that uni life is what you make it, and this has always been true. If you want to make friends, you will. If you leave it up to chance, you probably won’t. \n\nJoin clubs and societies - but don’t just join - be active in the club. Go to meet ups, ask to be a part of planning events and make an effort to get to know people. Trust me - the club organisers are pulling their hair out trying to get engagement and get this thing off the ground and it’s one of the hardest things to build a vibe when almost everyone is hanging back waiting for magic to happen before they dip their toes in. They will love you for brining energy and making effort. You don’t even need to bring heaps of energy - just a bit! Introduce yourself, say hi, rock up, that’s it! \n\nSpeak up in class. If there’s an open forum, just challenge yourself to say one thing in class each time you’re there, even if it’s outside your comfort zone. You won’t know it, but you’ll be silently encouraging others to feel confident to do it too, and people will remember you and maybe even feel comfortable enough to talk to you as well outside of class (and in class). \n\nActually rock up. This is basically most of it. Just get yourself up, go to class, and make the most of it. You’re paying an extraordinary amount of money to be there, you may as well make a job out of it. Even if there’s only 3 people in a lecture, just go. They might not be your forever friends but they will be a uni friend and I can tell you right now, those people are like gold in the future. So many of my uni friends are now colleagues or acquaintances in my network and I do not regret the times hanging out on campus one single bit, even if I knew some of these people weren’t going to be forever friends. We had some good times! \n\n Follow up on interactions!! This is so important. If you liked talking to someone, send them an email (if you know someone’s name you can find them in the email directory using your deakin email) or better yet, in the moment ask to follow them on IG or give them your number in case they ever want to get a coffee on campus or study together again. This sounds scary but it gets easier. If they don’t reciprocate, no big deal. But a lot of the time you have to be in the driving seat of making friends especially in this day and age where people kind of need an extra push. I might be old now (been at uni for 10+ years now) so maybe people don’t swap numbers anymore but the principle still stands. If you like someone just follow up with them with a simple “hey! It was great to meet you, I’m on campus every Monday if you wanna hang again let me know”. Just make it easy for the other person. Don’t be creepy or rude if they never get back to you, but don’t be discouraged either. Just let it go and move on to the next person. \n\nThere’s tonnes of extra stuff you can do on campus that doesn’t seem like socialising, but it is. Volunteering (peer mentoring, join a volunteer group on a different topic), study groups like PASS, get a job on campus (eg become a writing mentor or something if you’re a smarty pants and have that gift to give), or join an extra curricular workshop or event (careers events are amazing for this!!). You’ll be in a room full of people who have also gotten up off their ass to do something extra and you’ll probably find it 100000x easier to interact with these people and make friends - they’re up for it. You might also learn some new skills - resume writing, presentation skills, library tours, career talks, etc. it’s all good stuff! \n\nConsider joining the philosophy club. Just an idea. It’s a club centred around having discussions with people. You don’t need to be studying philosophy to do it. I’m pretty sure they also meet at the pub sometimes (IIRC) and that is a great social lubricator if you are that way inclined. The networking and entrepreneurial society also seemed to have some great events and be focused on engagement last time I checked. \n\nThere’s tonnes here, I could probably keep writing forever but my tea is now getting cold. If you’ve read this far - kudos to you and I hope you got something out of it! Even if it’s one thing that resonated and you ditch the rest, that’s awesome. Making friends takes effort and doesn’t come easy to most of us but good job making it this far and putting some thought and effort into it. If you ever learn the magic formula or have tips to share please come back and help the rest of us out - I feel that this is a pretty commonly asked question and something we’ve all had to work on at some stage or another and I’m constantly learning myself. Don’t be a stranger! Good luck!",
            "score": 7,
            "author": "IlllIlllIlllIlI",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well first off that was a lot but yes I did read the whole thing :D\n\nYour advice feels pretty spot on, I'm 22 now and will be 23 when I start my second undergrad which is concerning because I imagine most undergrads are going to be like 19 (based on prior experience). I think it's getting people to add me on stuff like insta that I struggle with, it just feels so strange to do it and admittedly I probably seem pretty awkward when I do ask.\n\nI'll likely be volunteering or similar at Deakin, I've been volunteering for the past 9 years in various things and was a Club leader at Swinburne and a Peer-mentor for my last semester which was definitely the most social time I had at uni. I think it's difficult because a lot of people don't really give off the vibe that they actually want to be interacted with, I've definitely gotten better at starting conversations in probably the last 6 months. I'm actually very new to the Geelong region as I moved here in the new year from Melbourne and regional victoria before that.\n\nHonestly, the main stuff I probably struggle with is approaching and networking. Most people take a liking to me once they actually talk to me, I just suck at initiating...I've been a bartender for lil now though which definitely helps that skillset and I've learnt social norms as well as how to compliment people in a way that is genuine and not creepy (I'm pretty behind in my social skills due to ADHD and ASD as well as a lack of exposure).\n\nI appreciate your long response so I've attempted to return the effort :)",
                    "score": 2,
                    "author": "ArchangelDeltius"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For me it was definitely res",
            "score": 1,
            "author": "Cyclist_123",
            "replies": [
                {
                    "level": 1,
                    "comment": "These are my thoughts to a degree, my current housemates both spent time on res and basically explained how living on res means basically everyone else on res gets to know you and people tend to be more likely to hang out",
                    "score": 1,
                    "author": "ArchangelDeltius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In addition to this, I was in NRAS so I think that helps because everyone is meant to be from further away so everyone is in the same situation",
                            "score": 1,
                            "author": "Cyclist_123"
                        }
                    ]
                }
            ]
        }
    ]
}