{
    "id": "13cexzg",
    "score": 5,
    "title": "Studying a Bachelor of Computer Science online",
    "author": "-0rangeo-",
    "date": 1683605315.0,
    "url": "https://www.reddit.com/r/deakin/comments/13cexzg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello there, I was just wondering if anyone had any advice regarding the computer science course at Deakin. I’m looking to enrol in TS2 and complete it online, and just wanted any advice regarding unit selections, subject difficulty, and anything else honestly. Thank you so much for any help :))",
    "comments": [
        {
            "level": 0,
            "comment": "I'm coming to the end of my CS course (Cloud). Keep in mind that there is a new course framework now so things are a little different.\n\nAs for course difficulty, I would rate it as average. I found most units relatively easy, but a few you need to prepare for and take seriously to have good marks. In particular Discrete Mathematics, OOP/DSA and Advanced Algorithms.\n\nHere's what I'd advise personally:\n\n&amp;#x200B;\n\nPreparation:\n\n* Learn basic programming, you don't need anything crazy, but knowledge of simple concepts like loops, variables, conditionals will make your life easy\n* Get familiar with Linux\n* Study some basic maths for computer science like set theory\n\n&amp;#x200B;\n\nWhile in course:\n\n* Secure an internship/ placement ASAP \\*\n* Network, join relevant clubs, meet people in industry, make connections \\*\n* Build a portfolio outside of course work\n* Find out what you really need to know for your planned career\n* Learn practical concepts beyond the course like Git, containers\n* Figure out a course plan well in advance\n\n&amp;#x200B;\n\n\\* = Do these 2, if absolutely nothing else. They will take your career further more than anything.",
            "score": 5,
            "author": "stand_to",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your help ilysm!\n\nIf you had to like average the hours studied and stuff per week, what would that look like? I’m currently studying another degree and wanted to do the comp sci degree in addition to that, and was just wondering how hard it would be to balance my workload.\n\nThanks for the advice on the hard units! I’ll probably underload and do those in easier years of my normal degree. Any other advice on where I can find like unit difficulty and stuff would be much appreciated :))\n\nAre there any other opportunities or things I should keep in mind? For the last year where you have to complete like an internship, is it possible to complete that completely online? What would the hours for that look like and the flexibility? My current degree has like placement years and it’d be hard fitting an internship around that.",
                    "score": 1,
                    "author": "-0rangeo-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes online internships do exist, and I suggest you complete the placement earlier than 3rd year, get as much work experience as you can, as soon as you can.\n\nI can't give much more information as it seems your situation is complex, feel free to PM me though.",
                            "score": 1,
                            "author": "stand_to",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okie thank you so much, PM sent :))",
                                    "score": 1,
                                    "author": "-0rangeo-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m looking to go back to school for software engineering and discrete math is one of the subjects \n\nI’ve been spending my free time with discrete.openmathbooks.org to prep and get ready for it. Seems like a subjective that if you’re good at it, you’ll do well with programming",
                            "score": 1,
                            "author": "bobjohnxxoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty sure that's the textbook we used in the course actually. Good luck.",
                                    "score": 1,
                                    "author": "stand_to"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hello! May I ask if you can share some experience on how to get internship?\nMostly finished all sit2~ and but no idea where should I begin with.",
                    "score": 1,
                    "author": "SheyanWany"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah it’s alright. I made the unfortunate mistake of doing DSA and Discrete Maths together which made my workload this trim just absolutely fucking ridiculous. I do not have time for this on top of my full time job.\n\nHowever, because they expect work from you basically every week, you won’t fall behind since you’re constantly checking when the next thing is due. It’s always go go go.\n\nI won’t say Discrete Maths was hard (I have done it before at UNSW and it is harder there but also taught much worse than at Deakin), and I won’t even say DSA was very hard (outside of maybe 1 or 2 tasks). I have experience in programming though so if you don’t it can be tricky, but there are ‘conceptual’ tasks too where you’re asked to explain how an algorithm works instead of coding it fully.\n\nThere’s lot of help provided by the tutors/staff for the hard units if you have the time to take advantage of those.\n\nUnfortunately there’s no compiler or assembly or operating systems or even just memory pointer related material, which is weird because all reputable computer science degrees will have them (only UNSW and ANU in Australia have ‘reputable’ CS degrees btw).\n\nPretty happy with it so far though. It’s much more in depth than an IT degree or anything like that so it’s not a bad degree, just maybe not up to like Stanford standards etc.\n\nThey need more majors though. I don’t want to fucking do data science major but the others are robotics and IOT. They need more low level stuff that isn’t data related.",
            "score": 1,
            "author": "runitzerotimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm supposed to be transferring to Deakin next semester as I'd hoped to do the Embedded software/IoT units. I was hoping that these would be relatively low level and cover low level languages and concepts like memory and pointers.\n\nI'm guessing this isn't your experience? lol",
                    "score": 1,
                    "author": "NoNameN3d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven’t done those yet but I can almost guarantee you… no…\n\nI heard concurrent and distributed programming uses C++ so maybe some exposure to memory there there…\n\nBut trust me when I say, while there are good units in this degree which does help you be a better software engineer (I work as one already and the study is actually kinda useful in a “develop your brain/thinking” kinda way) it is at the same time missing a chunk of low level stuff from a real computer science degree. Those units are not really necessary to study to be a solid software engineer I guess.\n\nThe reality is unless you’re in UNSW or ANU you likely won’t get a better experience than at Deakin. Those top uni CS degrees are also a living hell unless you are top brightest 2% of students with all the time and motivation in the world to study. For everyone else a Deakin CS degree will still open doors.\n\nI would recommend data science as a major though. IOT as an industry is a flop and the way they teach embedded here looks like a joke. Data Science leads to and includes machine learning concepts so even if it’s taught poorly the knowledge will still hold immense value over your career.",
                            "score": 1,
                            "author": "runitzerotimes"
                        }
                    ]
                }
            ]
        }
    ]
}