{
    "id": "13wgp4d",
    "score": 13,
    "title": "issue w life and uni",
    "author": "Upset_Negotiation_61",
    "date": 1685523083.0,
    "url": "https://www.reddit.com/r/deakin/comments/13wgp4d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey. currently in a crisis so let me explain. \n\nHave been at university for 4 years currently. i’m completing a bachelor of laws / bachelor of commerce. i started a different degree initially, which i studied for a year and a half, and then transferred into my current 5 year degree. \n\ni still have 3 years left at this point. but my mental health is in the toilet and i really need to take some time off. i was planning to see out the rest of this trimester, but my results are all basically fails and i think i just need to take the loss and withdraw from my units completely. i will have a withdrawn fail on my academic record but at this time i don’t know what else to do. i know it’s not ideal but. \n\ni’ve got plans to work whilst i intermit my studies, and then do a little bit of travelling. i’m 21 F living in Australia. i’ve generally done pretty well for myself thus far, but as of now my life is off the rails and i legit will probably end up in a psych ward. \n\nthis post isn’t really for advice, more just for some support for people to convince me i’m not fucking up my life. i am planning on going back to study as i want to be a lawyer, but i really do just need a break and to actually “find myself” i guess. sounds so cliche but i genuinely have no idea who i actually am outside of study and am also the type of person who has spent so much time with others that i don’t know who i am on my own. \n\nthis was really a whirlwind of information and just a bit of a dump but i just feel like an actual idiot that i’ve let this happen and put my life in the toilet. \n\npls be nice or i might cry ahaha\n\ntia x",
    "comments": [
        {
            "level": 0,
            "comment": "I’m so sorry you’re going through this. It’s not fun. I’ve been there before and I can kind of tell from your writing that you just really need the break and the space. Or at least, that’s how I was feeling when I was going through something similar. \n\nIf you’re going to withdraw now you’ll get the fail, which you know, but you then have the opportunity to apply for a remission. You have 12 months to apply and have to produce proof/paperwork, but it might be an option for you. My advice is to document everything and actually go and see someone for your mental health (if you aren’t already) and get a receipt of every visit. Deakin have counsellors which is kind of good because they also do letters on deakin stationary for this kind of thing, but if you have a counsellor or psych that you click with already, make sure you have a bunch of appointments lined up with them already. \n\nI hope everything works out for you. It can be scary to make a choice like this and to be in the situation you are mentally, but you can and will get through it. **Please don’t forget that lifeline, beyond blue exist** - just call them, they can be great. And definitely call or email for an appointment with a counsellor at uni and your GP. \n\nGood luck.",
            "score": 8,
            "author": "IlllIlllIlllIlI"
        }
    ]
}