{
    "id": "vdghte",
    "score": 8,
    "title": "What's the best campus (cheapest, etc)?",
    "author": "FlyParking5848",
    "date": 1655365300.0,
    "url": "https://www.reddit.com/r/deakin/comments/vdghte",
    "media_urls": [],
    "other_urls": [],
    "postText": "I need to choose between Melbourne Burwood Campus, Geelong Waurn Ponds Campus, and Warrnambool Campus. Can someone tell me what would be the most affordable option and my best bet?",
    "comments": [
        {
            "level": 0,
            "comment": "Warrnambool is definitely the worst. The other two vary depending on where you end up living.\n\nIt's more about whether you would prefer to live in the city or somewhere not as built up",
            "score": 9,
            "author": "Cyclist_123"
        },
        {
            "level": 0,
            "comment": "Hi all is the Waurn ponds campus nice I am probably going to go there for uni next year and I’m kinda scared bc I’ve never been to Geelong before!",
            "score": 2,
            "author": "YeeHaw164",
            "replies": [
                {
                    "level": 1,
                    "comment": "Waurn ponds campus is beautiful and bus into Geelong is relatively fast and there’s everything you need including decent nightlife on Little Malop. Also Geelong is a really lovely coastal town. And there’s so much less traffic.",
                    "score": 4,
                    "author": "Wonderwoman_420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay thank you so much I’ve just grown up in Melbourne and have never travel there \nI really want to go to Deakin but I got a bit scared that it was in the middle of nowhere as it’s the only school that offers the course I want to do!",
                            "score": 1,
                            "author": "YeeHaw164"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey all, the Burwood campus is nicest plus it’s close to Melbourne CBD (as in, a 20-min train ride), and you also have Glen Waverley and Box Hill nearby for great cheap Asian dining and a real vibe. It’d give you more of the typical Melbourne experience as a local.\n\nGeelong as a city isn’t very nice, and you’ll get very bored quickly. There’s a clear drug problem there as well unfortunately. I can’t speak for Warrnambool however.",
            "score": 0,
            "author": "GodWouldntBeUpThisL8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Burwood is nowhere near the train station. You'd have to take a bus to the train, and the train line isn't often express. Alternatively, you get stuck on the Toorak Road tram lines which are just hell during peak hour.",
                    "score": 2,
                    "author": "thebismarck"
                }
            ]
        }
    ]
}