{
    "id": "xx11kz",
    "score": 3,
    "title": "psychological science advice",
    "author": "guidedhabits",
    "date": 1665048964.0,
    "url": "https://www.reddit.com/r/deakin/comments/xx11kz",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi everyone, i’m currently a yr12 student and hoping to do bachelor of psychological science next year at deakin.\n\nto anyone who has done/is doing this course, what major elective did you pick and how has your experience been?\n\nalso if anyone could give a brief summary of the three majors and what they entail, that would great! (forensic psych, child + family development and organisational psych)",
    "comments": [
        {
            "level": 0,
            "comment": "I'm part way through my 3rd year of psych science at the moment.\n\nDepending on what you want to do after your degree, there's a few different options...\n\nIf you're strictly channeling yourself to be a psychologist/work in mental health, I'd stick to psychology or health electives. In the advanced unit search tool they should start with HPS, HSE, HBS etc. You could also throw in an education unit too if you're going after childhood psych.\n\nI did acr101 intro to criminology in my first trimester which was a good place to start.\n\nAlso, it's a good idea to plan your electives in advance. I wanted to do the neuroscience elective for 3rd year, but I realised I didn't have the prereq units. If there's something you really want to do in later years, make sure to build up your prereqs.\n\nIf you're like me and not sure what you want to do after the bachelor or are struggling after your 1st tri, just pick whatever interests you. You can literally choose any elective you want from the advanced unit search (provided it's in the right study period and dont have prerequisites). The 1st year units I found were quite dry, so I ended up doing the ocean processes and intro to forensic science units. Completely different fields with different students but it kept me motivated to keep studying.\n\nAt the end of the day, it's totally up to you. You can pretty much build your own degree in my experience and sometimes seemingly random electives are the ones you enjoy the most.",
            "score": 2,
            "author": "geeezz_louise",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to point out that I don't have experience with majors. You can always chat to deakin if you're interested but if you're after the standard degree you can choose your units.",
                    "score": 2,
                    "author": "geeezz_louise"
                }
            ]
        }
    ]
}