{
    "id": "z2gefm",
    "score": 6,
    "title": "Best neighbourhoods to rent around Deakin Burwood",
    "author": "Accurate_Situation74",
    "date": 1669181184.0,
    "url": "https://www.reddit.com/r/deakin/comments/z2gefm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! I’m an incoming international student at Deakin in 2023. I’m new to Melbourne and just wondering whether y’all can help me out with some advice/suggestions on good areas to live around Deakin Burwood? \n\nI’m 25yoF and ideally looking for a safe area that’s max 10-15 min walk from the campus.\n\nWould Burwood, Box Hill, Surrey hill, Hawthorn suburbs be a good place to start looking? Or would you recommend staying central near Fitzroy/Carlton. Any advice on how to go about looking for the right neighbourhood for Deakin students? \n\nIdeally what time- frame should I start looking? Early December? Early Jan? Planning to move in by Mid-Feb! \n\nYour help is very appreciated and thanks for taking out time to read this🫶🏼💕",
    "comments": [
        {
            "level": 0,
            "comment": "Forest Hill, Blackburn, Nunawading, Vermont \nare also close",
            "score": 2,
            "author": "M1oose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! I’ll definitely look into these",
                    "score": 1,
                    "author": "Accurate_Situation74"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to live on station street right next to Deakin it’s got some really cheap places right around there definetly worth a look. Also it’s a super safe area never once had any worries while living there.",
            "score": 1,
            "author": "Rare-Tumbleweed-8660",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also lived in Surrey Hills, can be a bit pricy but it’s a super chill neighbourhood, Burwood can be a bit “studenty”",
                    "score": 2,
                    "author": "Rare-Tumbleweed-8660"
                },
                {
                    "level": 1,
                    "comment": "Thank you so much! By when do you recommend to start looking for places? I’m confused as to the time-frame. Dec? Jan? \n\nAppreciate your help 🙌🏼",
                    "score": 1,
                    "author": "Accurate_Situation74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Give about two months at least to find somewhere",
                            "score": 2,
                            "author": "Rare-Tumbleweed-8660",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much 🥳",
                                    "score": 1,
                                    "author": "Accurate_Situation74"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Top to bottom based on priority: \nBurwood\nBoxhill (plus point  if you want to use public transport) \nGlen iris \nNunawading \nDoncaster.",
            "score": 1,
            "author": "Dangerous-Ad-4592",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! I’ll add these to the list fs",
                    "score": 1,
                    "author": "Accurate_Situation74"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, I am also a 22y/o  international student due to start my masters at Deakin, Burwood this March. Were you able to find a suitable accommodation?\nI am looking for accommodations as well but it's quite a bit of research. If you have any leads or suggestions or are still looking please don't hesitate to DM me :)",
            "score": 1,
            "author": "aditisingh_2k"
        }
    ]
}