{
    "id": "z7jqs8",
    "score": 2,
    "title": "Thoughts and experience in Masters of Cyber security[Professional]",
    "author": "orochigetsu19",
    "date": 1669697316.0,
    "url": "https://www.reddit.com/r/deakin/comments/z7jqs8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Heiya!\n\nI am considering on taking the 2yr postgraduate course Masters in Cyber Security \\[Professional\\] and would love to talk to someone who can give me some feedback/experience on the course.\n\nSome of my queries:\n\n    1. does the college provide work placement as well?\n    \n    2. How engaging are the teachers? Is it \"listen and go\" or are there interactions as well?\n    \n    3. How are the classes divided into? \\[lecture, workshop, tutorial…\\] do we have those or something similar where we can discuss the topics that we are taught?\n    \n    4. Are the assignments interesting? Is it group work or individual based?\n    \n    5. Does the course involve practical learning as well? If so what is your review?\n    \n    6. Lastly, what do you think are the strengths and weaknesses of this course?\n\nthanks:)",
    "comments": [
        {
            "level": 0,
            "comment": "Hello! Not a Master student of that course but I just started my master’s degree at Deakin.\n\nMost of your questions can be answered by Student Central, I think. Or maybe even Admissions team since you’re still thinking about it. This goes for Q1 and Q6.\n\nFor the lecturers, it all depends. There are okay, good and great lecturers. It all depends really. I assume this is probably the case for almost all universities/schools/educational set up. But almost all of my lecturers are happy to answer / clarify anything during and after the class. So that’s a great plus, I think. And they’re all generally nice. \n\nUnit set-up is usually 3 hours per unit. Some can be broken down to 1.5 class where they teach the theory and then another 1.5 seminar or tutorial where you discuss / apply the theories. There are those though that are just 3 hours straight which is a mix of class and seminar functions.\n\nAssignments can be interesting. It depends on your perspective I guess. It’s mostly application of what you’ve been taught.\n\nNo comment on Q5 since I’m not enrolled in the program you’re eyeing for.\n\nThis is based on my experience. Again, I am not enrolled in the course you’re eyeing but I’d like to believe it’s going to be more or less the same experience for you as well.\n\nFor Q3 and Q4, you can search the handbook, enter your course code and you can have access to the course map where you can view the units you can take up. And they’ll have all the info — what the set up is for that specific unit, how the assignments go (if individual or group) and other info about the unit. Hope this helps!",
            "score": 3,
            "author": "Amataj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for taking time to write. your input is greatly appreciated. Will look into it.",
                    "score": 1,
                    "author": "orochigetsu19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey I am taking admission in the same course right now. Have similar questions. Did you take admission and can you help w some questions?",
            "score": 1,
            "author": "Icy-Matter-4750",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can I ask in which semester you are enrolled? I am planning the Feb intake.",
                    "score": 1,
                    "author": "Imaginary_Event_850"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, did you end up studying in this course? I am also planning to study the same and have a few questions.",
            "score": 1,
            "author": "Imaginary_Event_850",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dm me",
                    "score": 1,
                    "author": "orochigetsu19"
                }
            ]
        }
    ]
}