{
    "id": "zkgqc5",
    "score": 0,
    "title": "DEAKIN OR UNSW (AM I MAKING THE RIGHT CHOICE?)",
    "author": "God_help_me_pls",
    "date": 1670890908.0,
    "url": "https://www.reddit.com/r/deakin/comments/zkgqc5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! I'm looking into Australian unis for an undergrad degree and have been OVERTHINKING about which uni would be the best for me. \n\nThe obvious and safe answer would be the group of 8 and amongst them too, I narrowed down the perfect fit for me to be UNSW or USYD. But, USYD felt too huge with a large number of international students — it's SUCH a great uni but I could tell it wasn't the right fit for me. I want to study Data Science so UNSW ranking high in computer science/engineering courses did it for me. \n\nBut I could not get over THE HUGE AMOUNT OF FEES !!! \n\nUNSW is soooo expensive for international students (like every other high-ranking college) and doesn't provide that many scholarships. Seriously, even if I get the highest scholarship, I think I still have to pay like 30,000 dollars. The fees are almost 50,000 dollars a year which in my currency is roughly \n\nTHIS AMOUNT :  4,000,000 \n\nDon't get me wrong, I'd be fine with paying for at least a year (I can't afford it like it's nothing but I could make that work). Then, prove my worth with good grades THEN seek deserving scholarships.\n\nBUT, I dug into their website a bit more and seems like current international students too get scholarships worth 10,000 max, even with excellent grades. (PLS CORRECT ME IF IM WRONG)\n\nSo, even if I get a perfect score, I still pay this huge amount which my parents are willing to pay for —but the guilt I would carry would be too much. \n\nI know education is an investment but this juuust doesn't seem worth it for me. \n\nThen, I came across DEAKIN UNIVERSITY, a mid-teir uni, fairly young and which seems to rank high on student satisfaction. I talked to some of the students there and asked questions on reddit too, and overall people who praised the uni were larger in number. \n\nUNSW has the reputation and good courses BUT deakin seems to have good courses WITH the perfect combination of I'm looking for — a major in Data science, a minor in psychology and an elective in hopefully sth theatre related. \n\nI see that Deakin has also MASTERED online school and if sth like covid were to happen, I'd still get the best quality of education which other unis might lack. \n\nHonestly, as an international student, reputation seems to be the first thing that comes to my head when the right fit for ME and my situation should be my priority. \n\nI have also started feeling this sort of inferiority complex knowing I'm not going to a top-tier uni. WHICH IS SUCH A NEGATIVE FEELING TO HAVE AND I HATE MYSELF FOR THINKING THIS WAY. I know better than feeling inferior, like who do I think I am? \n\nAnyways guys, this is my situation overall and my logic behind my choices, do you think I'm making a good move? I need opinions! Big hugs to all of you.",
    "comments": [
        {
            "level": 0,
            "comment": "Okay so I know this will probably be difficult to accept but rankings mean very little, most Australian unis are in the top 1%, what you want to be looking for is student satisfaction and support, especially if you struggle with some of your english and technicalities, support will be instrumental.\n\nMy advice would be to weigh up the areas the unis are in, would you like living there? What are you looking for in the ideal home city? Also check out the accreditation status of each course (if that's applicable to data science). Another point of view is the learning techniques and styles utilised by each uni. From what I've heard UNSW, MELBuni etc are very traditional and this can be a disadvantage for some.\n\nCheck how deakin compares to unsw in data science, check work experience opportunities, extra curricular, networking etc.\n\nI'm a Criminology and Criminal Justice graduate so the above advice may not be so applicable to data science",
            "score": 10,
            "author": "ArchangelDeltius"
        },
        {
            "level": 0,
            "comment": "There's not much difference in the quality of education.  It will matter much more where you want to live, if you hate living in either place that will affect your learning alot more.",
            "score": 3,
            "author": "Cyclist_123"
        },
        {
            "level": 0,
            "comment": "I’m at Deakin and we have a great technology program. I’d say as good as UTS, UNSW and the likes.\n\nBut while I’ve learnt a lot here and would recommend it to anyone. The one thing Deakin doesn’t have is prestige and collaborations with top tech companies. If you want to work at Google, Canva or Atlassian, I suggest going to UNSW purely for the connections made with peers and the top companies.\n\nOtherwise UTS, Usyd and Deakin would all be similar. I’d personally go with UNSW and then Deakin",
            "score": 2,
            "author": "Comprehensive_Mud645"
        },
        {
            "level": 0,
            "comment": "Consider UniSA. It has a good M Data Science. I did it by distance ed and the course was well run. We had people all over the world taking the classes - and this was way before COVID times.\n\nIt's in the top 50 under 50 in the rankings. The proposed merger with University of Adelaide will bring the combined institution into the Group of Eight if it goes ahead \n\nAdelaide is a smaller city with a lower cost of living. You will also get a more diverse mix of students. You can also experience more of regional Australia from Adelaide.\n\nEdit to add. I have a data science related job at a Go8 University.",
            "score": 2,
            "author": "startled-ninja"
        },
        {
            "level": 0,
            "comment": "The best uni is the uni that you succeed at. I don't think any uni in Australia is good enough (or any reasonably sized uni bad enough) to be distinguished from any other in the international stage in a meaningful way. \n\nWant to be amazing? Go to the US or the UK and some heritage University that won't distinguish you from any other number in their system. \n\nWant to gain useful skills and then have a career you enjoy without crippling debt? Go to a solid uni, get a good degree and some experience, and prove yourself the usual way. \n\nThe words on the piece of paper don't really mean much in the real world to the right people. What matters is your WAM (at the start) and then after a few years, all that matters is your experience, skills and luck in an interview.",
            "score": 2,
            "author": "repethetic"
        },
        {
            "level": 0,
            "comment": "You can't just look at the fees in isolation. UNSW is more prestigious and has closer links with top companies. The course is tougher and academic standards are higher. If you can earn more money post graduation then you can pay your parents back.\n\nOf course unis don't give out big scholarships. They want to earn cash from international students, not give away education for nothing.\n\nIf you have ADHD deakin might be a better option with easier courses.\n\nYou seem to be asking the same question about every uni under the sun.",
            "score": 1,
            "author": "Professor0fCunning"
        }
    ]
}