{
    "id": "zwbp6e",
    "score": 2,
    "title": "Breaching communication gap.",
    "author": "Apprehensive-Rent827",
    "date": 1672133322.0,
    "url": "https://www.reddit.com/r/deakin/comments/zwbp6e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone. I will start my undergraduate studies at Deakin University on February 2023. My course is Bachelor of Software Engineering (Honours). Since I will be an international student from Bangladesh there, I will be pretty much on my own with no known people around me. Therefore, before I join I would like to be in touch with some people who will be taking the same course as me on February. I will be grateful if I can make some friends from here before I arrive at the University. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "It's natural to feel nervous, but there are many students in the same situation. I wouldn't bother trying to make friends through reddit, they might be insane. You will quickly make friends through tutorials, or by joining clubs for people of a similar cultural background.\n\nMy observation is that typically \"birds of a feather flock together\". If you know that old idiom.",
            "score": 2,
            "author": "ApartmentAcrobatic83"
        },
        {
            "level": 0,
            "comment": "Actually you won't be alone. Check your student emails for deakin student peer mentors. Join the chats and get the info on how to meet people and essentially navigate deakin.\nThere is also DUSA deakin university student association l, which runs events including cultural where you may find Bangladeshi people or similar cultural back grounds. There are also events that are of different cultural backgrounds if you're excited to enjoy not only deakin, but a whole new culture.\nDeakin has alot of support to help students in your situation and many other situations. You just have to look on their site and monitor your emails.\nGoodluck and welcome!",
            "score": 1,
            "author": "Evolutionarystudies"
        }
    ]
}