{
    "id": "140dudl",
    "score": 1889,
    "title": "What do force ghosts get upto when not making random appearances?",
    "author": "grim_gravySS",
    "date": 1685886972.0,
    "url": "https://www.reddit.com/r/StarWars/comments/140dudl",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "They mess with the non-Force sensitives by moving things",
            "score": 1867,
            "author": "GymRatWriter",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you drop something, they make it roll an inexplicable distance away from you.",
                    "score": 43,
                    "author": "CrispRat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thats a Padiwan move. \n\nBetter to have it roll backwards underneath the person who dropped it, where they least expect it to go.",
                            "score": 20,
                            "author": "Your__Pal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This. This is the only right answer. Bonus points if it's a darksider.",
                    "score": 431,
                    "author": "1AlphaGeek1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s why one sock is always missing",
                            "score": 200,
                            "author": "Sullinator07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That wouldn't be the dark side users because there's always two. No more, no less.",
                                    "score": 128,
                                    "author": "HLSparta",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Never said the 2 match",
                                            "score": 44,
                                            "author": "thoroakenfelder"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That is the Sith, not dark side users in general.",
                                            "score": 2,
                                            "author": "iranoutofusernamespa"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "the missing sock is why people turn to the dark side",
                                    "score": 32,
                                    "author": "whatproblems",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You called?",
                                    "score": 8,
                                    "author": "OrangeSockNinjaYT"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can Darksiders become ghosts?",
                            "score": 10,
                            "author": "branedead",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe there were a couple of Force apparitions rather than Force ghost. They’re strong with the force but not necessarily one with it. More like their essences are tied to specific locations or relics strong with the dark side",
                                    "score": 36,
                                    "author": "GymRatWriter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like Bane and Momin.",
                                            "score": 19,
                                            "author": "EastKoreaOfficial"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "All of their effort is put towards becoming more powerful and extending their mortal lives, like plagueis. Closest we have to a sith ghost in canon is darth bane that yoda comes across in clone wars but I don’t remember if it was a real ghost or not.",
                                    "score": 17,
                                    "author": "PM_me_your_eclaire"
                                },
                                {
                                    "level": 3,
                                    "comment": "In legends, they became more like poltergeists that haunt specific places or items that had significance to them in life. \n\nMost often they were bound to those places or items and couldn't travel around like the Jedi force ghosts can. \n\nNot sure if the whole dark side ghost thing has really been addressed directly in disney canon.",
                                    "score": 9,
                                    "author": "Individualist13th"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why the fick are my x-wing keys!?",
                            "score": 9,
                            "author": "harrybooboo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yoda seemed like he was just having the best time when he called down the lightning to blow up the tree in The Last Jedi.",
                    "score": 35,
                    "author": "remeard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Frank Oz makes everything better",
                            "score": 11,
                            "author": "Southern_Agent6096",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's a wizard.",
                                    "score": 6,
                                    "author": "davidjschloss"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He was probably trying to blow up the whole movie and missed.",
                            "score": 8,
                            "author": "Jakles74",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dang that was some clever shade.",
                                    "score": 6,
                                    "author": "WatercressOk2005"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait for the moment when a non-force user tries to move something with the force, do it for them just that once, and then observe the consternation at not being able to repeat it.",
                    "score": 10,
                    "author": "nimbledaemon"
                },
                {
                    "level": 1,
                    "comment": "STARS WARS: EPISODE 12 Paranormal activities",
                    "score": 10,
                    "author": "guitarguru01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blissful nothingness.",
            "score": 136,
            "author": "finditplz1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prolly the least funny but most accurate answer",
                    "score": 51,
                    "author": "Ghostfact-V",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IDK about disney cannon but in EU they literally BECAME the force. So it wasnt nothingness, it was everything at once!",
                            "score": 29,
                            "author": "Salvage570",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Disney canon they also become the force, and \"lose their individuality\". At least, that's what the CW era Jedi believe. There are obviously exceptions but even then I would assume that's what it's like when not ghosting",
                                    "score": 3,
                                    "author": "Ansoni",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Im more talking about the ones strong enough to project their will after death. The EU books imply that they all exert their wills in minor was in the flow of the force. Hence Obi-Wans “If you strike me down, I shall become more powerful than you can possibly imagine.”",
                                            "score": 3,
                                            "author": "Salvage570"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Legitimately, I wonder if they see time differently from their separate plain of existence and it's more of a \"world between worlds\" situation or maybe the ending of Interstellar. They chose to manifest in key moments because it's all laid out in front of them. For the living it could be years between appearances but for them, they just get their appearances knocked out over the course of a weekend or something.",
            "score": 782,
            "author": "jiango_fett",
            "replies": [
                {
                    "level": 1,
                    "comment": "Things sort of just exist with inherent awareness. You see Qui Gon’s point of view in a FACPOV short story.",
                    "score": 246,
                    "author": "astromech_dj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just found out about that, it's pretty good\n\n&gt;Awareness precedes consciousness. The warmth is luxuriated in and drawn upon before the mind is cognizant of doing so. Next comes the illusion of linear time. Only then does a sense of individuality arise, a remembrance of what was and what is, a knowledge of one’s self as separate from the Force. It provides a vantage point for experiencing the physical world in its complexity and ecstasy, but the pain of that separation is endurable only because unity will come again, and soon.\n\n&gt;That fracture from the all, that memory of temporal existence, is most easily summed up with the word the fracture was once called by. The name.\n\n&gt;“Qui-Gon.”\n\n&gt;The name is spoken by another. Qui-Gon has been summoned. He draws upon his memories of himself and takes shape, reassem­bling the form he last had in life. It seems to him that he feels flesh wrap around bones, hair and skin over flesh, robes over skin—and then, as naturally to him as though he had done so yesterday, he pulls down the hood of his Jedi cloak and looks upon his Padawan.\n\n&gt;“Obi-Wan.” It is worth the travail of individual existence just to say that name again. So he says the other name, too. “Ben.”\n\nhttps://www.starwars.com/news/qui-gon-jinn-from-a-certain-point-of-view-excerpt",
                            "score": 109,
                            "author": "OldKingCanary",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit that excerpt may be the best thing I’ve ever read from Star Wars. It’s basically written from the perspective of the Force.",
                                    "score": 30,
                                    "author": "TheBlueDinosaur",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it's wild but surprisingly good. That's a damn hard thing to describe.",
                                            "score": 8,
                                            "author": "OldKingCanary"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is basically the answer to the whole thread. Force Ghosts are one with the Force but can take individual shape at need. They don't \"do\" anything in between, they just are.",
                                    "score": 2,
                                    "author": "Eject_The_Warp_Core"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just read that one!",
                            "score": 2,
                            "author": "ImGonnaBeInPictures"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This always makes me wonder if time is nonlinear in the afterlife then would you just skip to everyone you know is dead so we can all hang out. Like sure you can help with some personal growth here and there but if the afterlife is so great then who cares how much you influence folks for the sake of war or personal growth when you see the entire picture afterwards.",
                    "score": 86,
                    "author": "thedaveness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a paradox. You can’t go back and influence physical events metaphysically before you were dead, so your friends couldn’t appear to you until they were actually dead, which means that time would flow linearly in the afterlife. \n\nIt does work if you could talk to your past alive self after you die, but in that case every spirit of every person who will ever die would be present the entire time the afterlife exists.\n\nHeadache",
                            "score": 45,
                            "author": "YacobJWB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With option #2, would be funny if Luke talked to Yoda right before he visited him in TLJ and was like “tell me this, it’s really gonna fuck with me.”\n\nHadn’t even considered that in a nonlinear situation that you could talk to your pass (alive) self… that definitely brings up some problems. Or maybe it’s like a time cop situation where you can’t get to close.",
                                    "score": 18,
                                    "author": "thedaveness"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;time is nonlinear in the afterlife\n\nA sort of Jeremy Bearimy situation, yeah.",
                            "score": 22,
                            "author": "SubMikeD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I finally understand a reference!",
                                    "score": 12,
                                    "author": "Silviecat44",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Take it sleazy",
                                            "score": 8,
                                            "author": "Jigglelips",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But take it!",
                                                    "score": 2,
                                                    "author": "batti03"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Where is the dot over the I though? That's the confusing bit!",
                                    "score": 8,
                                    "author": "Freyja6",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That ..that broke me",
                                            "score": 4,
                                            "author": "SubMikeD"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If its nonlinear you wouldn't even skip to that point.",
                            "score": 3,
                            "author": "HelixFollower"
                        },
                        {
                            "level": 2,
                            "comment": "If that’s the case I’d love to know what happens to humans. Do we make it? Do we kill our selves? Do we find aliens? Do we become interstellar travelers",
                            "score": 3,
                            "author": "metalgamer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My first viewing would be all the datelines that left you with questions to what really happened. Good ol’ Keith would be there to narrate all of it too lol.",
                                    "score": 2,
                                    "author": "thedaveness"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'd bet time is sort of a meaningless construct for something like a force ghost. The Jedi is likely having the equivalent of the most awesome ego death psylocybin trip of all time until there is a sort of \"ping\" or \"need\" from some living force user. \n\nIf the Jedi had a sufficiently trained and disciplined mind, they can pull themselves out of the \"trip\" for a second to manifest their ego and assist the living force user before dissolving back into the stream of the living force and sort of experiencing all creation at once.",
                    "score": 24,
                    "author": "g0d15anath315t",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I choose to headcanon that the near-corporeal manifestation is only due to the direct tie to another Force Sensitive, which runs in contrary to Sith ghosts which are closer to the non-Star Wars conception of ghosts (trapped in a place of trauma and/or site of death, which is why Korriban is full of them or are we actually calling it Moraband or whatever?).",
                            "score": 12,
                            "author": "joyfulsinner13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a part in the comic The Last Jedi where Luke says right before he dies, “And it ends as it began. Stepping into a larger world.” I like how it’s deliberately vague",
                    "score": 14,
                    "author": "A-Good-Weather-Man"
                },
                {
                    "level": 1,
                    "comment": "Didn’t this already happen in Rebels?",
                    "score": 1,
                    "author": "AxelllD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When they're not appearing physically, force ghosts are basically part of a force soup. This is from the Canon short story *Master and Apprentice* where Qui-Gon appears to Obi-Wan.\n\n\"Awareness precedes consciousness. The warmth is luxuriated in and drawn upon before the mind is cognizant of doing so. Next comes the illusion of linear time. Only then does a sense of individuality arise, a remembrance of what was and what is, a knowledge of one’s self as separate from the Force. It provides a vantage point for experiencing the physical world in its complexity and ecstasy, but the pain of that separation is endurable only because unity will come again, and soon.\n\nThat fracture from the all, that memory of temporal existence, is most easily summed up with the word the fracture was once called by. The name.\n\n“Qui-Gon.”\n\nThe name is spoken by another. Qui-Gon has been summoned. He draws upon his memories of himself and takes shape, reassem­bling the form he last had in life. It seems to him that he feels flesh wrap around bones, hair and skin over flesh, robes over skin—and then, as naturally to him as though he had done so yesterday, he pulls down the hood of his Jedi cloak and looks upon his Padawan.\n\n“Obi-Wan.” It is worth the travail of individual existence just to say that name again. So he says the other name, too. “Ben.”\n\nObi-Wan Kenobi’s hair has turned white. Lines have etched their traces along his forehead, around his blue eyes. He wears Jedi robes so worn and ragged as to be indistinguishable from the garb of the impoverished hermit he pretends to be. Most would walk past this man without a second glance. Yet while Qui-Gon perceives the phys­ical realities of Obi-Wan’s appearance, he is not limited to human sight any longer. He also sees the confident general of the Clone Wars, the strong young Padawan who followed his master into battle, even the rebellious little boy at the Temple that no Master was in any hurry to train. They are all equally part of Obi-Wan, each stage of his exis­tence vivid in this moment.\"",
            "score": 107,
            "author": "DSteep",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s beautifully written",
                    "score": 21,
                    "author": "JustinianIV",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, Claudia Gray writes some real good Star Wars.",
                            "score": 19,
                            "author": "DSteep"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Playing poker with each other and betting money on future events.",
            "score": 31,
            "author": "Alieniu",
            "replies": [
                {
                    "level": 1,
                    "comment": "So who's sliding cards under the table?",
                    "score": 3,
                    "author": "Stay-At-Home-Jedi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Orgies. There's no way they're not releasing their lifetimes of sexual tension.",
            "score": 421,
            "author": "headphoneghost",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have any female jedi been able to become a force ghost? I don't wanna think about Yoda getting it on with Qui Gon, Obi Wan and Anakin.",
                    "score": 152,
                    "author": "Artistic_Badger6539",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Leia did",
                            "score": 133,
                            "author": "GulianoBanano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "dibs",
                                    "score": 91,
                                    "author": "finn4life",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "-Luke",
                                            "score": 185,
                                            "author": "ScissorMeSphincter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If I had a free award, I’d give it to you.",
                                                    "score": 16,
                                                    "author": "uncle-rico-99"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Gang bang",
                                    "score": 21,
                                    "author": "xFearful425",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On it is, hmm.",
                                            "score": 26,
                                            "author": "KashurNafarStep",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dibs the bottom again, Luke? Not if anything to say about it I have",
                                                    "score": 10,
                                                    "author": "Unglory",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I knew where this comment section was going to go but I opened it anyway.",
                                                            "score": 4,
                                                            "author": "xchadrickx"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You heard Ahsoka’s  voice in episode 9 when all the force ghosts were with Rey during the palpating fight.",
                            "score": 22,
                            "author": "g4tam20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a post on the instagram account of Dave Filoni which came out right with ep. IX. It is a drawing of Ahsoka next to Gandalf, who says \"People thought I was dead, too. Look how that turned out...\" I can't link to that specifically because I don't have an account anymore, but it's not too far down if you scroll a bit.\n\nSo Ahsoka is (most likely) not dead by the time of IX, unless Filoni decides her death needs to happen before that time.",
                                    "score": 17,
                                    "author": "WL538",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahsoka/Filoni can always just play up the world-between-worlds thing and \"mess with time\" again too. She doesn't necessarily have to be dead nor alive.",
                                            "score": 8,
                                            "author": "NecessaryCat5e"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Doesn’t mean she died, also it’s as far as I know never explicitly says she dies plus iicr the average life span of her species is just shy of 100 and she’s at least in her 60’s during the events of the sequel trilogy.",
                                    "score": 3,
                                    "author": "EpitomyHD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doesn’t mean she died, but I can’t think of an instance someone was able to do that when they weren’t dead.",
                                            "score": 3,
                                            "author": "g4tam20",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think anyone has been a force ghost while still alive, but we didn't see Ahsoka's ghost, just heard her voice. There's examples of that in film. Luke calling to Leia on Bespin. Kylo and Rey's weird thing they had. Probably others that I'm not thinking of.\n\nEdit: dang autocorrect",
                                                    "score": 12,
                                                    "author": "MrJust-A-Guy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Darth Vader talking to Luke as he flies away at the end of ESB.  Possibly Palpatine talking to Anakin while he's waiting in the Jedi council chambers in RotS",
                                                            "score": 7,
                                                            "author": "Fwort",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel like Luke vs Kylo on Krait was a stones throw away from a living Jedi being a force ghost",
                                                                    "score": 3,
                                                                    "author": "Stay-At-Home-Jedi",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You know... You might be right.",
                                                                            "score": 3,
                                                                            "author": "MrJust-A-Guy",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ahsoka is 14 at clone war intro\n17 - 18 at end of clone war\n37 - 38 at death of vader\n42 - 43 mando\n67 - 68 at the force awakens\n69 - 70 as a rough timeline at rise of Skywalker \n\nShe could have easily just died of natural causes by this point, but i have a feeling her series and thrawn being brought back might lead to an unfortunate end maybe through sacrifice",
                                            "score": 1,
                                            "author": "darth_revan1988",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or she ascends somehow to literally become Ashla.",
                                                    "score": 1,
                                                    "author": "ilikenwf"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;when all the force ghosts were with Rey during the palpating fight\n\nI legitimately do not remember force ghosts there. I might need to watch it again, even though I really don't need to.",
                                    "score": 1,
                                    "author": "OskeeWootWoot",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Hmm, tight you are, Master Kenobi.”",
                            "score": 165,
                            "author": "xDracolich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What a terrible day to have eyes.",
                                    "score": 127,
                                    "author": "Scfbigb1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Omg why",
                                    "score": 44,
                                    "author": "Drunk_Irishman81",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m sorry to have cursed you in this way",
                                            "score": 18,
                                            "author": "xDracolich",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don’t apologize for love",
                                                    "score": 17,
                                                    "author": "Muse9901"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who said you need female Jedis for an orgy 😏",
                            "score": 10,
                            "author": "Muse9901"
                        },
                        {
                            "level": 2,
                            "comment": "Yoda is the bottom.",
                            "score": 5,
                            "author": "3honeybadgersinacoat"
                        },
                        {
                            "level": 2,
                            "comment": "Its actually enjoyable when you REALLY think about it",
                            "score": 16,
                            "author": "HappyNomad420"
                        },
                        {
                            "level": 2,
                            "comment": "No way, Ahsoka didn't become one. She survived way after the Empire and knows Luke and had personal connections to Obi-Wan, Anakin and Yoda who all become force ghosts.",
                            "score": 10,
                            "author": "DefiantLemur",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well we haven’t seen her dead yet",
                                    "score": 18,
                                    "author": "AwesomePerson70",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But we know by the Sequel trilogy she's dead. We hear her voice alongside all the other dead Jedi in that final fight.",
                                            "score": 1,
                                            "author": "DefiantLemur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Didn’t yoda talk to Ezra while still alive? You’re probably right considering age but there’s always a possibility",
                                                    "score": 4,
                                                    "author": "AwesomePerson70",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh go ahead, think about it.  THINK ABOUT IT!",
                            "score": 2,
                            "author": "AmbienWalrus-13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except they are 100% allowed to bone any time they want. They just arnt allowed family or attachment except for population survival as in Ki-Adi-Mundo's case",
                    "score": 7,
                    "author": "darth_revan1988"
                },
                {
                    "level": 1,
                    "comment": "Any of these little force ghosts ever pop out of the fuckin' wall and say, \"Fuck, there's a horse cock in my room or a donkey dick\"?",
                    "score": 11,
                    "author": "Jiskro"
                },
                {
                    "level": 1,
                    "comment": "They need that post nut clarity to focus on projecting themselves",
                    "score": 3,
                    "author": "norm_summerton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hanging out in the Cosmic Force, chilling with the Celestials.",
            "score": 118,
            "author": "Grecanis"
        },
        {
            "level": 0,
            "comment": "trafficking death sticks",
            "score": 16,
            "author": "Animaleyz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Playing cards mostly",
            "score": 99,
            "author": "Backpacks_Got_Jets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Playing the new Tales from Middle Earth mtg set",
                    "score": 20,
                    "author": "TCtheThunderRooster",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Laundry",
            "score": 41,
            "author": "Rikkrishub",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just imagine them sitting by the washing machine the entire time between appearances. Just watching their robes spinning and whirling in the machine. Almost like a hypnotic trance it must be.",
                    "score": 7,
                    "author": "ZenithAdrian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They aren’t in ghost form unless they’re making tanks\n Appearances. They’re one with the force, basically you could say it’s like they’re chilling in Star Wars heaven - or more like Star Wars Nirvana.",
            "score": 68,
            "author": "in_a_dress",
            "replies": [
                {
                    "level": 1,
                    "comment": "With Kurt Cobain?",
                    "score": 10,
                    "author": "achisling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk if he made it to Star Wars Heaven, gonna have to check with Lucas on that one.",
                            "score": 2,
                            "author": "GamerOfGods33"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Talking shit with the Bendu",
            "score": 41,
            "author": "monstergert",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d hope they talk shit about the Bendu, his neutrality enables evil",
                    "score": 17,
                    "author": "Sabretooth1100",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All they need to do is just \"ayo Bendu, I heard Sheev called you a b-word,\" and Bendu throws a shitstorm in the galaxy's favor just cause he's so crabby",
                            "score": 18,
                            "author": "monstergert"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cornhole",
            "score": 30,
            "author": "Frosty_Tale9560"
        },
        {
            "level": 0,
            "comment": "I like to think they contribute to the way living Force-users feel the Force. They can’t manipulate objects or beings like they once could, but they *can* be that voiceless voice in the back of a Jedi’s head, the one that tells them when to dodge, duck, dip, dive, or dodge.",
            "score": 10,
            "author": "candlerc",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were pissed at Mundi by order 66 so they didn't really bother saving him",
                    "score": 3,
                    "author": "Chippyreddit"
                },
                {
                    "level": 1,
                    "comment": "\"If you can dodge a lightsaber, you can dodge the force...\"",
                    "score": 2,
                    "author": "mk1subzero"
                },
                {
                    "level": 1,
                    "comment": "That's such a cool idea!",
                    "score": 1,
                    "author": "WL538"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like to imagine they are watching events unfold with us, and only make an appearance when necessary \n\nThe entire main series is through the perspective of the force ghosts, starting with how the “first” force ghost died in Phantom Menace",
            "score": 9,
            "author": "Tea_Reckz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Qui Gon sitting through Kenobi: \"Oh for fuck's sake, Leia gets kidnapped a second time?!\"",
                    "score": 6,
                    "author": "Chippyreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“For the love of…was she just running in little concentric circles trying to get away from these idiots?”",
                            "score": 4,
                            "author": "LeicaM6guy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Being one with the Force of course.",
            "score": 4,
            "author": "Scottysoxfan"
        },
        {
            "level": 0,
            "comment": "Cheating at sabacc",
            "score": 4,
            "author": "sodium111"
        },
        {
            "level": 0,
            "comment": "Well, one thing they're not doing is telling Luke Skywalker that Palpatine isn't dead, and has a massive fleet on the other side of the galaxy.",
            "score": 4,
            "author": "R0b0tDeNer0"
        },
        {
            "level": 0,
            "comment": "Of course a bunch of Redditors made this sexual.",
            "score": 10,
            "author": "FartlacPit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who could have thought this was going to happen?",
                    "score": 4,
                    "author": "BlueDreams_23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always thought they would be guiding other force sensitives around the galaxy, a whisper or a flicker in the right direction etc.",
            "score": 3,
            "author": "This_Is-How_We-Do"
        },
        {
            "level": 0,
            "comment": "Disassociate. Just straight vibing.",
            "score": 3,
            "author": "General_Mode_7632"
        },
        {
            "level": 0,
            "comment": "They play night crawlers in coruscant’s sewers",
            "score": 3,
            "author": "Branducky"
        },
        {
            "level": 0,
            "comment": "Big old orgy in the spirit realm, that's why Ezra Bridger was so shocked when he travelled there",
            "score": 3,
            "author": "LeeeeroooyJEnKINSS"
        },
        {
            "level": 0,
            "comment": "Hanging out with Grogu critiquing[this](https://m.youtube.com/watch?v=xl_pQkNP37Q&amp;pp=ygUOT2JpIHdhbiByb2FzdGQ%3D)",
            "score": 6,
            "author": "thinehappychinch",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is immediately what I thought of lol",
                    "score": 2,
                    "author": "Excellent-Problem418"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ghost writing albums for new age rappers.",
            "score": 2,
            "author": "Kaunsepts"
        },
        {
            "level": 0,
            "comment": "At least in one comic Anakin showed up to help people safely escape Vader's fortress.",
            "score": 2,
            "author": "Oddmic146"
        },
        {
            "level": 0,
            "comment": "Ghost strip clubs?",
            "score": 2,
            "author": "Boba_Hutt"
        },
        {
            "level": 0,
            "comment": "My guess would be what any other guy who lived in celibacy would do",
            "score": 2,
            "author": "Zero_Mehanix",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Jedi don’t have a rule about celibacy. They never did. The philosophy Yoda forced on everyone else for generations when he became grandmaster was non-attachment. So many fans misunderstand this.\n\nA Jedi is not necessarily discouraged from having a quick fuck, as long as it’s kept quiet about by both parties involved. The only thing the Jedi discourage in that regard was the Jedi in question getting into long-term relationships. If two Jedi get into a one-night stand and never speak of it again, the Jedi usually don’t care. It only becomes a problem for them when it becomes a full-on relationship a la an Anakin and Padme situation.\n\nThere were special exceptions in the Expanded Universe continuity. For example, Ki-Adi Mundi was allowed to have a whole family with four different wives at once. The reason for this was because Mundi came from a species (the Cereans) that had very low birth rates for males.",
                    "score": 1,
                    "author": "East-Property-3576",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know kid ah mundi had a lot, but for most non celibacy evolves to attachments.",
                            "score": 1,
                            "author": "Zero_Mehanix"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hide from Ghost Busters",
            "score": 2,
            "author": "Bulrat"
        },
        {
            "level": 0,
            "comment": "They play checkers, Anakin gets really burned when he loses",
            "score": 2,
            "author": "ed8breakfast"
        },
        {
            "level": 0,
            "comment": "Ghosterbate",
            "score": 2,
            "author": "Ok-Ease7090"
        },
        {
            "level": 0,
            "comment": "i like to imagine that they attempt to keep the force in balance by making things harder for people trying to send it out of balance",
            "score": 2,
            "author": "thisisjoy"
        },
        {
            "level": 0,
            "comment": "They hang out in a cornfield in Iowa with old time baseball legends.",
            "score": 2,
            "author": "didntstopgotitgotit"
        },
        {
            "level": 0,
            "comment": "They take turns pretending to be JarJar and Padme making out in Vader's dreams.",
            "score": 2,
            "author": "420ram3n3mar024"
        },
        {
            "level": 0,
            "comment": "They are one with the force because the force is with them.",
            "score": 2,
            "author": "-spartacus-"
        },
        {
            "level": 0,
            "comment": "Bingo, water aerobics, and potlucks",
            "score": 2,
            "author": "maxfederle"
        },
        {
            "level": 0,
            "comment": "Sitting together watching the living, and roasting them for all their mistakes. Like MST3K.",
            "score": 2,
            "author": "MegaCoreMagnetizer"
        },
        {
            "level": 0,
            "comment": "Ive always wanted to see a sitcom where the forceghosts hang out by themselves. Yoda gets so annoyed with the others he ghosts them and goes into exile again.",
            "score": 2,
            "author": "SharksEatMeat"
        },
        {
            "level": 0,
            "comment": "Force ghost orgies.",
            "score": 3,
            "author": "ogresound1987"
        },
        {
            "level": 0,
            "comment": "Making milk blue.",
            "score": 1,
            "author": "papatonepictures"
        },
        {
            "level": 0,
            "comment": "hi, quick question. are you a Neonazi?",
            "score": 1,
            "author": "miam_rdt"
        },
        {
            "level": 0,
            "comment": "I was watching a lore video on YouTube, and it talked about how Obi Wan was watching on Endor when Luke was captured and was first trying to get through to Vader. Then, when Luke was getting zapped by Palps, Obi Wan was watching that too. So I got to thinking \"ok so his ghost was able to teleport itself from the forest moon up to the Death Star. What about him also being on Dagobah earlier? How does hyperspace travel work for a force ghost? are they sort of everywhere and nowhere all at once or is it like teleportation and they can just instantly be anywhere in the galaxy they want instantly? If they are able to maintain some of their essence to where they are visible, audible, and have their old physical form in the world of the living, are there any constraints on them in terms of movement, interaction, etc?\" And then you wonder how much of Luke's life was Obi Wan following him around for but invisible? Was he \"there\" for everything? Did he see Leia kiss Luke on Hoth? Was he disgusted? So many questions.",
            "score": 1,
            "author": "Dramatic_Mulberry157"
        },
        {
            "level": 0,
            "comment": "They watch you JO.",
            "score": 0,
            "author": "ballistic-zero"
        },
        {
            "level": 0,
            "comment": "Probably just chilling in the afterlife",
            "score": 1,
            "author": "Ok_Restaurant3160"
        },
        {
            "level": 0,
            "comment": "Swim in the blood of the force sensitives. The blood is medium chlorine level.",
            "score": 1,
            "author": "GK_47"
        },
        {
            "level": 0,
            "comment": "Star Trek reruns",
            "score": 1,
            "author": "dancin-weasel"
        },
        {
            "level": 0,
            "comment": "They were having a lan party with darth marr",
            "score": 1,
            "author": "EpitomyHD"
        },
        {
            "level": 0,
            "comment": "Realistically probably just like meditating or in some kind of zen state",
            "score": 1,
            "author": "newme02"
        },
        {
            "level": 0,
            "comment": "Maybe force ghosts ARE the midichlorians guiding the world. Just a few learn the ability to show up as ghosts.",
            "score": 1,
            "author": "Kerensky97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like Qui Gon said, \"I was always here, you just weren't ready to see\"",
                    "score": 2,
                    "author": "brasco975"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just chillin in an infinity pool.",
            "score": 1,
            "author": "kalsainz"
        },
        {
            "level": 0,
            "comment": "Pretty sure there was a robot chicken episode where Kenobi messed with Vader after he died. Maybe that's what they all do.",
            "score": 1,
            "author": "ddrober2003"
        },
        {
            "level": 0,
            "comment": "I always assumed they kind of existed outside of time. Jedi/Sith can already sense the future so fully joining with the force kind of seemed to me that they’d almost exist in all time, both future and past, at the same moment.\n\nIf you stand in a hallway you can look left or right and see the entirely of the hallway right? You can also walk either direction along that hallway. I imagined that the flow of time to a force ghost was kind of like standing in a hallway.",
            "score": 1,
            "author": "slide_into_my_BM"
        },
        {
            "level": 0,
            "comment": "I think they explore the vastness of eternity and space. I'm sure if you could transverse time and space you'd witness all sorts of shit that would take lifetimes to review.",
            "score": 1,
            "author": "oldcretan"
        },
        {
            "level": 0,
            "comment": "‘The name of the game is Candy Land’",
            "score": 1,
            "author": "skubaloob"
        },
        {
            "level": 0,
            "comment": "The pranks must be wild. I suppose someone has to maintain those force caves and gem fields?",
            "score": 1,
            "author": "Rattfink45"
        },
        {
            "level": 0,
            "comment": "What do you think your dog is staring at?",
            "score": 1,
            "author": "raguyver"
        },
        {
            "level": 0,
            "comment": "Poker",
            "score": 1,
            "author": "RomiBraman"
        },
        {
            "level": 0,
            "comment": "They all sit on an armchair staring at a brick wall until someone needs to talk to them. They don't talk to each other, they don't blink, they don't think. They just sit and stare",
            "score": 1,
            "author": "ztk2005"
        },
        {
            "level": 0,
            "comment": "Playing ghost sabbacc",
            "score": 1,
            "author": "UnhappyAd8184"
        },
        {
            "level": 0,
            "comment": "I'm just imagining a scenario where they don't register the passage of time. Like, they appear, disappear, then (from their perspective) reappear immediately. Time has passed for us, but it's instantaneous for them. The first few seconds of them standard there quietly (or just calling the name of the person in front of them) is actually them desperately playing catch-up and acting all wise and serene as a cover.",
            "score": 1,
            "author": "dathomar"
        },
        {
            "level": 0,
            "comment": "It is probably a question we won't like the answer to. I imagine many visits to women's locker rooms . . .",
            "score": 1,
            "author": "Whyspire"
        },
        {
            "level": 0,
            "comment": "Gambling",
            "score": 1,
            "author": "ProfessorLasagna"
        },
        {
            "level": 0,
            "comment": "Watching you do… stuff.",
            "score": 1,
            "author": "LeicaM6guy"
        },
        {
            "level": 0,
            "comment": "OnlyWhills",
            "score": 1,
            "author": "VariousHumanOrgans"
        },
        {
            "level": 0,
            "comment": "They become one with the cosmic force, which is comprised of every single living organism to have ever lived up until that point. When you become one with the force, you lose all individuality and everything that made you, you. You are every single living being and none of them, and the infinite wisdom that comes from every single perspective ever helps decide the fate of the universe. Force ghosts are just people who have trained to be able to separate themselves from the cosmic force and regain their individuality and sense of being and linear time when needed.",
            "score": 1,
            "author": "InsanityCM"
        },
        {
            "level": 0,
            "comment": "You know...Force stuff",
            "score": 1,
            "author": "GalileoAce"
        },
        {
            "level": 0,
            "comment": "You don’t want to know.",
            "score": 1,
            "author": "Stunning-Guitar-5916"
        },
        {
            "level": 0,
            "comment": "Banging each other probably.",
            "score": 1,
            "author": "Arugula-Unhappy"
        },
        {
            "level": 0,
            "comment": "Ben and Satine probably bang, as does Anakin and Padme. Yoda and Qui-Gon probably communicate with the Whills, asking important questions.",
            "score": 1,
            "author": "Difficult_War_840"
        },
        {
            "level": 0,
            "comment": "Pretty sure they explain somewhere that time for them is no longer linear and they just sort of exist everywhere and always but pop up at important moments.",
            "score": 1,
            "author": "CrackedActor91"
        },
        {
            "level": 0,
            "comment": "They don’t do anything. \n\nMy impression wasn’t that Obi Wan was visiting from some Force Heaven. He’s now one with the Force. It’s a manifestation of his knowledge contained in an energy field that surrounds all living things. It’s like asking the Earth what it was like during the Roman Empire. \n\nI think a part of these Jedi masters lives on, but not the way we think of it. Their spirit sort of enriches and adds to the living Force.",
            "score": 1,
            "author": "Ravager135"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure Yoda would just randomly wake up Palpatine in the middle of the night singing the [Seagulls song](https://www.youtube.com/watch?v=U9t-slLl30E).",
            "score": 1,
            "author": "AldusPrime"
        },
        {
            "level": 0,
            "comment": "Hopefully some form of therapy force knows Yoda and his disaster lineage need it. Between Yoda’s control problems, Qui-Gon’s issues with authority, Obi-Wan’s lingering inferiority complexes, and well Anakin being Anakin I’m not the sure the whole cosmos would be enough space for them long term all without some help.",
            "score": 1,
            "author": "anthrotulip"
        },
        {
            "level": 0,
            "comment": "I mostly imagine it’s like that scene from Mulan where all the ancestors are yelling at each other.",
            "score": 1,
            "author": "PuzzleheadedLet382"
        },
        {
            "level": 0,
            "comment": "I think it's best that we never learn what happens in the beyond for them. In the first Thrawn book, I believe Obi-Wan basically says to Luke \"I can't stick around much longer\" and as far as I've read, he never elaborates what or who is making him return to the netherworld of the Force. It should remain that way.",
            "score": 1,
            "author": "stand_up_fkn_tall"
        },
        {
            "level": 0,
            "comment": "Anakin made an appearance to Luke and he was having to fight(put forth extreme effort) to do so. He was also running from “something” in the force. Maybe someone else has more info on it. It’s from Star Wars: Shadow of the Sith.",
            "score": 1,
            "author": "REALITYL0ST"
        },
        {
            "level": 0,
            "comment": "Probably hungry",
            "score": 1,
            "author": "Seniesta"
        },
        {
            "level": 0,
            "comment": "Force Ghost Club Med",
            "score": 1,
            "author": "SacredHeartAttack"
        },
        {
            "level": 0,
            "comment": "I assume that they don't exist as their individual selves unless the force wills it for special occasions.",
            "score": 1,
            "author": "Kthron"
        },
        {
            "level": 0,
            "comment": "Force ghosts always kinda bothered me. Like it's visually a cool idea, but it brings a lot of those small problems when you think about them too much. They even deepened this problem, when they showed force-ghost Yoda affecting the real world.  \n\n\nIt would be easier if they were just force \"memories\" or visions and only that one person could see them. Like that movie trope where main character get's advice in their dream from a deceased close friend or relative.",
            "score": 1,
            "author": "60Dan06"
        },
        {
            "level": 0,
            "comment": "Why Reddit of course",
            "score": 1,
            "author": "Electrocat71"
        },
        {
            "level": 0,
            "comment": "I figure they reach out for smells of food they like and slowly float towards them until Ben or Luke screw up again",
            "score": 1,
            "author": "Quirky-Pie9661"
        },
        {
            "level": 0,
            "comment": "They’re booked full all over the Galaxy. It’s 20,000 credits to get Yoda and Obi Wan to appear at the same bar mitzvah.",
            "score": 1,
            "author": "offalshade"
        },
        {
            "level": 0,
            "comment": "Sit around thinking they are better than everyone else.",
            "score": 1,
            "author": "BuddhistChrist"
        }
    ]
}