{
    "id": "140w1x7",
    "score": 13,
    "title": "The Clone Wars aims to present Duchess Satine as an idealist with strong moral principles, but the more I rewatch the Mandalore episodes the more I find her idealism to lack consistency.",
    "author": "Educational-Tea-6572",
    "date": 1685924769.0,
    "url": "https://www.reddit.com/r/StarWars/comments/140w1x7",
    "media_urls": [],
    "other_urls": [],
    "postText": "She's a pacifist and is opposed to violence such that she doesn't want to personally commit violence against anyone - okay, I get it.\n\nMandalore has a police force and the Duchess has personal guards - okay, I get it. \n\nShe'll rip Obi Wan up one side and down the other for having the audacity to be involved in a war he has absolutely no control over, to the point that Obi Wan can barely think straight to defend other innocents on a ship being threatened by a Mandalorian terrorist; but Padme shoots multiple workers implicated in a conspiracy during a firefight and Satine doesn't bat an eye 🤔 \n\nI know practicality often causes a sizeable gap between idealism and reality, but to be an idealist one should have a pretty solid level of consistency in their application of moral principles (whatever those principles may be).\n\nOr maybe I'm just overly protective of Obi Wan.",
    "comments": [
        {
            "level": 0,
            "comment": "I saw Satine’s behavior toward Kenobi as firmly rooted in their past and her frustration that their paths led them apart; her ripping into him about the injustice of violence was merely her way of expressing her emotions in an indirect way.",
            "score": 26,
            "author": "Mukeli1584",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am inclined to think the same when I'm feeling generous towards Satine. But her behavior still irritates me 😂",
                    "score": 1,
                    "author": "Educational-Tea-6572",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're just jealous that Obi-Wan likes her more than you.  :)",
                            "score": 1,
                            "author": "getoffoficloud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I will neither confirm nor deny 😂",
                                    "score": 1,
                                    "author": "Educational-Tea-6572"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last I checked satine doesn’t really give a shit about padme and does care for kenobi",
            "score": 3,
            "author": "DoingItToEm",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;satine doesn’t really give a shit about padme\n\nI wouldn't go quite that far... There is enough to indicate they are good friends (as far as political friends go).",
                    "score": 4,
                    "author": "Educational-Tea-6572",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re coworkers. No matter what the quality of that dynamic is, it doesn’t come anywhere near the one she has with obi-wan.",
                            "score": 2,
                            "author": "DoingItToEm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right. Hence my comment above. And I have to say, since Satine is apparently kinder and more reasonable to her coworkers than she is to her former romantic interest, one of the takeaways I'm getting from this conversation is that the quality of her dynamic with Padme is better than the one she has with Obi Wan.",
                                    "score": 2,
                                    "author": "Educational-Tea-6572",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If that’s what you take away from this then there’s no helping you. Why would she treat a FORMER romantic interest that’s going against her ideals better than a coworker she has a positive relationship with? Their relationship is deeper, she holds him to a higher standard, she’s upset with how their relationship unfolded. If your takeaway is “oh I guess she likes padme more” then I have to assume you’ve never interacted with another human being before.",
                                            "score": 1,
                                            "author": "DoingItToEm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I commented on \"**quality** of the dynamic,\" not who she likes better. Regardless of the status/details of a relationship, I consider a relationship where one *doesn't* insult and belittle the other for a different POV, as better quality than one that does.\n\nAnd... No, you actually don't *have* to assume anything about me :) My interactions with other human beings have taught me time and again that belittling and arguing with them about something we disagree on - especially in the middle of an emergency - doesn't improve the quality of the relationship nor does it change their opinion of the subject we disagree on, and is usually counterproductive.",
                                                    "score": 1,
                                                    "author": "Educational-Tea-6572"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They're friends, not lovers.  That's a big difference.",
                                    "score": 1,
                                    "author": "getoffoficloud"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She doesn't have a romantic history with Padme, so won't continue an old lovers quarrel with her.\n\nAs far as mistrust of the Republic government the Jedi are fighting the war for, she turned out to not be wrong, there.",
            "score": 2,
            "author": "getoffoficloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;mistrust of the Republic government... she turned out to not be wrong\n\nI absolutely agree with this.",
                    "score": 1,
                    "author": "Educational-Tea-6572"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d agree with the other comments in saying that their past romantic tryst has something to do with it, but I’d also point out the people involved in the plot that Padme shoots were harming children. I know the man with the bomb that Anakin kills was holding everyone hostage, but that was maybe 15-20 people, mostly senators, on a starship.",
            "score": 1,
            "author": "danielhollenbeck13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty sure there was plenty of other crew on board that gigantic ship (even if some of them were droids), not just senators. Just saying!",
                    "score": 1,
                    "author": "Educational-Tea-6572"
                }
            ]
        }
    ]
}