{
    "id": "141klma",
    "score": 2756,
    "title": "Which Darth Bane look do you prefer",
    "author": "Pablo_Flash_Fan_69",
    "date": 1685983713.0,
    "url": "https://www.reddit.com/r/StarWars/comments/141klma",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "2 is cool because of the story and concept but looks kind dumb. Three is the iconic look I think, how I always pictured him through all three books.",
            "score": 354,
            "author": "Slootyman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the 2nd one needs some anti-fungal ointment.",
                    "score": 43,
                    "author": "gettems",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think his standard should be one, then his way of letting you know he's had enough of your shit, and that you're about to die slowly and painfully, should be him taking off his helmet to reveal three.",
                    "score": 20,
                    "author": "yallxtrippin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gasp!  It's that guy that fronts that death metal band!  He's going to torture us to death with his Cookie Monster vocal style!",
                            "score": 3,
                            "author": "getoffoficloud"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Apparently 2 isn’t even orbalisk-related.",
                    "score": 1,
                    "author": "KaimeiJay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The headwear is orbalisk-related, IIRC it was what he wore to keep the orbalisks off his head",
                            "score": 3,
                            "author": "Appropriate_Vast1980",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "What? They’re literally on his body.",
                            "score": 2,
                            "author": "Awesium",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh. My phone was only loading his face at first. I thought this was all about his headwear.",
                                    "score": 1,
                                    "author": "KaimeiJay"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was always a little confused about the tattoos around his eyes, because he is never described in the first two books as having them (still haven’t read the third).",
                    "score": 1,
                    "author": "terrifying_avocado"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1st and third and by miles. The scarab suit thing looks dumb as hell.",
            "score": 1533,
            "author": "FaithlessnessFew9127",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m re-reading the Bane trilogy right now, and it specifically states that Bane went to extreme lengths to ensure that the scarabs never reached his face. I never understood why these images exist. \n\nAnyone know if there’s a line in the book that states that he allows them to cover his face for a bit before they get taken off all together?\n\nEdit: okay I’m thinking I understand what the pictures depict. That’s his helmet. I always thought those pics were just incorrectly depicting the i obalisks reaching his face.",
                    "score": 255,
                    "author": "Clash_onthe_Can",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, there's not.  The prose even specifically notes that he constructs a special helmet and gloves to wear when he sleeps so they won't cover his head or hands.  I think that's just that artist's interpretation of the helmet.\n\n3 is by far my favorite.  They rereleased *Rule of Two* last year with new cover art and even though it focuses on Zannah, it looks WAY better than the original.",
                            "score": 177,
                            "author": "WeNeedToTalkAboutMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The original cover art is one of the most upsetting images in all of Star Wars, possibly in all of literature.",
                                    "score": 12,
                                    "author": "franklsp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How so? I don't think I've ever seen it",
                                            "score": 3,
                                            "author": "Perrywaaz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's somewhere between Animorphs book cover art and Beast Wars CGI animation.",
                                                    "score": 4,
                                                    "author": "Call_The_Banners",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Uhh, interesting",
                                                            "score": 2,
                                                            "author": "Perrywaaz",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is the correct answer.  I have read the trilogy a few times and highly recommend it.  It is specifically stated that he also wore hooded cloaks that revealed only the parts of him that weren’t covered in the creatures.  This trilogy needs to be made into live action… would be insane and fully explains the rule of 2.",
                                    "score": 34,
                                    "author": "East_Sprinkles_3520",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have been saying this for so long!! What an amazing part of the Star Wars universe. It would drag so many new people into the world by exploring a character that no one outside of readers really know about. “Path of Destruction” is probably my favorite Star Wars book. It would be such an epic movie or tv series.",
                                            "score": 9,
                                            "author": "Chiggins907"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It looks like he's wearing a mask, not scarabs on his face",
                            "score": 32,
                            "author": "Mistic-Instinct"
                        },
                        {
                            "level": 2,
                            "comment": "I will say that I used to have a Darth Bane action figure that included that weird-ass helmet thing",
                            "score": 10,
                            "author": "DreamedJewel58"
                        },
                        {
                            "level": 2,
                            "comment": "Ayyy! I’m also re-reading the Bane trilogy! Shit is absolute fire. I try to re-read it about once a year. Bane is S-tier Sith imo. Nobody really even comes close to matching his level of badassery. Maybe Vader, but that’s being pretty generous.",
                            "score": 16,
                            "author": "holversome"
                        },
                        {
                            "level": 2,
                            "comment": "What are the scarabs and why would he even let them on his body?",
                            "score": 12,
                            "author": "audaciousgummybears",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’re called orbelisks, they’re like these dark side bugs that attached to him in the 2nd book. They inject him with venom that increases his dark side powers. They’re also almost indestructible, including by lightsaber. So he wore them throughout the whole 2nd book",
                                    "score": 71,
                                    "author": "altum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Literal plot armor, nice.",
                                            "score": 33,
                                            "author": "cosine83",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To be fair they have the downside of being extremely painful but darth bane doesn’t give a fuck because he’s that much of a sith",
                                                    "score": 10,
                                                    "author": "LeatherDescription26"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hint- electric current(force lightning)",
                                            "score": 11,
                                            "author": "hyde-ms"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How exactly are they impervious to lightsabers?? \n\nI think it's okay to have like one or two things impervious to it... \n\nBut lightsaber proof bugs?? Bruh...",
                                            "score": 6,
                                            "author": "democracy_lover66",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lightsaber proof creatures aren't an unheard of thing, even in modern canon there's the Zilo beast.",
                                                    "score": 24,
                                                    "author": "TheLord-Commander",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Legends was wild. Their armor is super strong I guess. Bane was cool with it because it made him nigh invincible and when he would fight they’d secrete some force juice into him that enhanced his dark side connection making him even more powerful. \n\nThe drawback was he was disfigured basically and had to send his apprentice to deal with anything that they needed to be stealthy about.",
                                                    "score": 20,
                                                    "author": "altum"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Let them\" is a bit of an overstatement. He kind of walked into an Indiana Jones-style Sith temple room with a bunch of them on the ceiling. The good news is that he got has a suit of armour that's impervious to lightsabres. The bad news is that he couldn't take it off because the scarabs used secreted acid to bond themselves to his skin, and they reproduced asexually to cover his whole body.",
                                    "score": 12,
                                    "author": "Redcoat_Officer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "100% agreed on that one.",
                    "score": 199,
                    "author": "Sabre_Killer_Queen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3.   1 looks like mortal kombat.",
                            "score": 33,
                            "author": "RUhungryforapples",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You say that like it's a bad thing",
                                    "score": 12,
                                    "author": "lordmegatron01"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh thats what that is.  The helmet makes him look like a Clicker lol",
                    "score": 12,
                    "author": "Timmah73"
                },
                {
                    "level": 1,
                    "comment": "It looks dumb because it's way too busy, and impractical, even by Star Wars standards. I think if it were toned down just a bit and the helmet was replaced by *anything* else, it would be a pretty cool design.",
                    "score": 8,
                    "author": "AdequatelyMadLad"
                },
                {
                    "level": 1,
                    "comment": "Whatever Star Wars looks like, it definitely ain’t that",
                    "score": 7,
                    "author": "KevinDLasagna"
                },
                {
                    "level": 1,
                    "comment": "I kept thinking \"why is he covered in [trilobite fossils](https://en.wikipedia.org/wiki/Trilobite)?\"",
                    "score": 3,
                    "author": "ifixpedals"
                },
                {
                    "level": 1,
                    "comment": "2nd looks like what I had for lunch",
                    "score": 4,
                    "author": "Ok_Work1870"
                },
                {
                    "level": 1,
                    "comment": "It just doesn't look star wars. If they changed the helmet I could see it being interesting though",
                    "score": 1,
                    "author": "GayBrownHairedElf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Third photo. \n\nPossibly because I'm biased by the novel.",
            "score": 38,
            "author": "EmbarrassedBlock1977",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's one of the very best.",
                    "score": 10,
                    "author": "CurtManX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1 and 3 aren't incompatible and both are good. I assume he wasn't just wearing full armor 24/7 and a guy alive during a time of war might have cool armor. \n\n2 has literally never looked good in any picture or art i have ever seen of it. It's 100% one of those things that might conceptually sound interesting but then actually showing or even having to describe in real detail reveals it's incredibly stupid looking.",
            "score": 903,
            "author": "NerdHistorian",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;guy alive during a time of war might have cool armor.\n\nIt was due to a crustacean getting latched onto him which grows over its victim to devour it. Nifty thing about that crustacean is its shell is completely resistant to lightsabers. Realizing that, bane found armor schematics to work with the crustacean as it grew over his body, making him an unstoppable (fish) tank.",
                    "score": 272,
                    "author": "Noe11vember",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Darth Bane is Slowking?",
                            "score": 94,
                            "author": "NowDeleting"
                        },
                        {
                            "level": 2,
                            "comment": "As super badass as that is, it makes me really uneasy for some reason. Think I just found a new phobia!",
                            "score": 141,
                            "author": "IcedBudLight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It made Bane uneasy too. The orbalisks gave him a lightsaber-proof shell but he also knew they were stealing force power from him and weakening him overall. It was more something that he lives with because he doesn't know how to get rid of them but recognized the benefit and drawbacks. Also he needs his apprentice to be the face of his schemes because he looks too damn terrifying.",
                                    "score": 25,
                                    "author": "Everyredditusers"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Part of the ship part of the crew, Davy Jones is coming for you.",
                            "score": 26,
                            "author": "Airathorn26"
                        },
                        {
                            "level": 2,
                            "comment": "You've peaked Skoova Stev's interest!",
                            "score": 9,
                            "author": "PaperAlchemist"
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately, when a Jedi reflected his lightning back, he cooked the crustaceans which released a poison in his body. It did not work out well for him.",
                            "score": 8,
                            "author": "Dward917"
                        },
                        {
                            "level": 2,
                            "comment": "And the cage keeps it from covering his face which would suffocate him",
                            "score": 8,
                            "author": "DemonDuckOfDoom666"
                        },
                        {
                            "level": 2,
                            "comment": "Oh yeah that makes sense, the black ovals on 2s armour are just big chitons",
                            "score": 4,
                            "author": "thrashmetaloctopus"
                        },
                        {
                            "level": 2,
                            "comment": "I wonder how he made tinkle.",
                            "score": 2,
                            "author": "StrangeSurround",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's two head cages in the schematics, hence the rule of two",
                                    "score": 3,
                                    "author": "Noe11vember"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's absolutely 100 percent stolen from dude. It's what leto does in the end before turning into a sandworm. Uses baby sandworms latched all over his body, as armor from laser weapons and such. \n\nI didn't realize how much of dune star wars used lol.",
                            "score": 7,
                            "author": "YeahhhhhWhateverrrr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well thanks for the spoilers, I was looking forward to the next movie :'(",
                                    "score": 8,
                                    "author": "Noe11vember",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good news for you is that this little factoid has nothing to do with the upcoming Dune: Part II movie or Dune Messiah, the 2nd book in the series. Leto's arc, the character being discussed, doesn't start until Children of Dune and God Emperor of Dune - or books 3/4 - and I'm pretty skeptical that they'll adapt those into film.\n\nYou should absolutely read the books, though - all the Frank Herbert entries to the series are spectacular.",
                                            "score": 21,
                                            "author": "Personal_Jambi"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Definitely not a spoiler for the next movie.",
                                            "score": 4,
                                            "author": "rholcs12"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They’re novels that came out in the 60s, you’ve kinda gotta expect spoilers for things, especially that old, on the internet.\n\n(Also if spoilers that can be said in one like ruin a movie for you, especially one that’s more than just a popcorn movie, you need to get over it)",
                                            "score": 6,
                                            "author": "Fixable",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it has potential. Just take off the helmet and shoulders. Keep the scarab-skin armor with his cloak. Maybe a cooler, more Sith-style helmet. Would make it a lot more sleek visually while still keeping the badass story of how he got it and what it does to him.",
                    "score": 18,
                    "author": "holversome",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe the helmet that is is wearing (as described in the books) is primarily used to prevent the crustacean from covering his face.",
                            "score": 9,
                            "author": "M3NN0X"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "See, the helmet/mask from 2 is in my head just how I see Bane, that mask is just so strange that it comes around to being iconic and memorable. The issue I have though is that the helmet is incredibly detailed… but so is the rest of the suit. Instead of the head piece being a center point of the whole outfit, it just gets blended into the mish mosh of random shapes and busy-nonsense. I feel like if you give him some fairly plain black robes, keep the purple waist sash, maybe a black clone wars-esque collar/shoulder piece… then keep the helmet, you’d have a REALLY good sith outfit. Good rule of thumb with character designs; if you are going to have a complicated centerpiece, keep the rest of the design simple to let the centerpiece work in contrast and draw the eye.",
                    "score": 10,
                    "author": "hyde9318"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd pick #3 by a mile but #1 is okay too.",
            "score": 304,
            "author": "Calfzilla2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are you yelling?",
                    "score": 39,
                    "author": "ItsASchpadoinkleDay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably tried to do hashtag 3 to say \"number\" 3, but Reddit makes the text\n#BIG\nWith a hashtag.",
                            "score": 46,
                            "author": "Sabre_Killer_Queen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "#no way",
                                    "score": 24,
                                    "author": "ReallyReallyBigGun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "#yes way",
                                            "score": 10,
                                            "author": "G1zm08",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "#really?",
                                                    "score": 7,
                                                    "author": "qscjkudc",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "# Cool",
                                                            "score": 6,
                                                            "author": "GullibleAudience6071",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "#or is it?",
                                                                    "score": 5,
                                                                    "author": "Mansnotepic",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "#It is.",
                                                                            "score": 7,
                                                                            "author": "X_Marcie_X",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "#Are you sure?",
                                                                                    "score": 3,
                                                                                    "author": "Horror_Albatross1037",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "#nice",
                                                                    "score": 4,
                                                                    "author": "ill4pills",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oops. Edited. Sorry. Damn # thing.",
                            "score": 9,
                            "author": "Calfzilla2000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heh heh, Reddit's hidden effects are pretty useful in some circumstances, incredibly annoying in others. \n\nMy personal favourite has to be the &gt;!Spoiler!!&lt; although thankfully that's hard to do unintentionally. By the way, here's some bubble wrap for you to enjoy! \n\n&gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt;\n\n&gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt;\n\n&gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt;\n\n&gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt; &gt;!POP!!&lt;",
                                    "score": 39,
                                    "author": "Sabre_Killer_Queen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is brilliant. Thank you.",
                                            "score": 11,
                                            "author": "Katzim88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No probs! Admittedly though I did steal the idea off someone else. I would try and credit them but it was over 2 years ago when they showed me and I can't remember their name or the post I spoke with them on. But yeah, it's a neat little trick :)",
                                                    "score": 6,
                                                    "author": "Sabre_Killer_Queen"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "#Its Fine, Don’t ever do it again",
                                    "score": 12,
                                    "author": "TheTenthSnap"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Orbalisk Armor!\n\nApparently I'm the only one who loves it, but I think it's fantastic. Only piece I'd drop is the weird cage mask.",
            "score": 187,
            "author": "Dendallin",
            "replies": [
                {
                    "level": 1,
                    "comment": "But then they would suffocate him",
                    "score": 38,
                    "author": "Foreign-Blueberry821",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He only had to wear it while he slept, if I'm remembering correctly.",
                            "score": 27,
                            "author": "Pawing_sloth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess as long as he never sleeps then..  /s",
                                    "score": 5,
                                    "author": "Noe11vember",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "the point is that most of the time, in fact the vast majority of the time when anyone would have seen him, he wouldn't be wearing the mask",
                                            "score": 13,
                                            "author": "upholsteryduder"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That mask is the part everybody hates about it…",
                    "score": 5,
                    "author": "Cuddling-Hellhound"
                },
                {
                    "level": 1,
                    "comment": "THANK YOU.",
                    "score": 4,
                    "author": "Mulosh15"
                },
                {
                    "level": 1,
                    "comment": "Everyone who hates it is the same type of person to like the sequels, AKA not someone whos opinion I care about",
                    "score": -21,
                    "author": "Darth_Balthazar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most reasonable sequels hater",
                            "score": 5,
                            "author": "Fixable"
                        },
                        {
                            "level": 2,
                            "comment": "Didn't ask",
                            "score": 2,
                            "author": "Lord-Vortexian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "3.",
            "score": 10,
            "author": "trogdor491"
        },
        {
            "level": 0,
            "comment": "Always been 3",
            "score": 7,
            "author": "DEATH_CORNER"
        },
        {
            "level": 0,
            "comment": "3 by a mile, and as far as the living armor goes, with modern tech, just go nanobot style to depict it(like iron man in infinity war when the bots were running out) if they ever put him in movies or TV.",
            "score": 9,
            "author": "Acrobatic_T-Rex",
            "replies": []
        },
        {
            "level": 0,
            "comment": "3, but I'm biased. The first book is my favourite star wars novel",
            "score": 8,
            "author": "Dessel"
        },
        {
            "level": 0,
            "comment": "3.",
            "score": 20,
            "author": "sumane12"
        },
        {
            "level": 0,
            "comment": "The Orbalisk armor was so awesome, new and strange at the same time, it’s from my point of view, the most iconic one.",
            "score": 7,
            "author": "skyguy60"
        },
        {
            "level": 0,
            "comment": "3\n\nI just don’t like 2 and 1 reminds of Shredder from Teenage Mutant Ninja Turtles.",
            "score": 6,
            "author": "SirBulbasaur13"
        },
        {
            "level": 0,
            "comment": "One makes him look too wimpy. Maybe I just need to see a better angle but he doesn’t have the big imposing figure that is decently important to his character. 3 all day",
            "score": 19,
            "author": "Particular-Gate-898"
        },
        {
            "level": 0,
            "comment": "**3 &gt; 1 &gt; ANYTHING ELSE &gt; 2**",
            "score": 87,
            "author": "The_Fortunate_Fool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Darth Bane with the Borat G-string is it still better than 2?",
                    "score": 31,
                    "author": "ronytheronin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds better than anything we could imagine. So much of the Sith's power can come from feeding on the shame of onlookers.",
                            "score": 9,
                            "author": "MrJust-A-Guy"
                        },
                        {
                            "level": 2,
                            "comment": "Oh, I hadn't thought of that.  New ordering:\n\n**Borat G-string &gt; 3 &gt; 1 &gt; ANYTHING ELSE &gt; 2**",
                            "score": 6,
                            "author": "dalr3th1n"
                        },
                        {
                            "level": 2,
                            "comment": "YES",
                            "score": 18,
                            "author": "Some_Gas_1337",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. Yes. Let the hate for that awful get up flow through you.",
                                    "score": 6,
                                    "author": "ronytheronin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You underestimate the number of fans here who aren’t het men, lol",
                            "score": 3,
                            "author": "Hydrochloric_Comment"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like clone war look\n\nThe bug suit never really work for me",
            "score": 85,
            "author": "Quirky_Ad_5420"
        },
        {
            "level": 0,
            "comment": "The bug suit is one of the dumbest fucking things in all of fiction.",
            "score": 282,
            "author": "roto_disc",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was cool in the books it’s just the mask looks stupid.",
                    "score": 108,
                    "author": "Sughmacox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed, functionally and on paper the orbolisk armor is the best by far. The mask… yikes… wish they’d gone a different direction. He looks like a knock off power rangers villain.",
                            "score": 55,
                            "author": "SireRequiem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is that even an official picture? It’s not on any of the covers and from my knowledge no other official images of Bane have been made.",
                                    "score": 11,
                                    "author": "Sughmacox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In swtor the orbalisk armour had a different helm. Though I don't know if that's a creative liberty the game took compared to the source material.",
                                            "score": 5,
                                            "author": "Azelrazel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Picture #2 is a cosplay",
                                            "score": 9,
                                            "author": "Botchur"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The bug suit is ok, the issue is the stupid-looking helmet...",
                    "score": 3,
                    "author": "MongrelChieftain"
                },
                {
                    "level": 1,
                    "comment": "Wait until you find out about beetle wing embroidery.",
                    "score": 10,
                    "author": "40ozkiller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always preferred the Non-armored version, but I’ll take anything over the bug-suit thing. Lore-wise it might be interesting but visually it just looks super ugly and not intimidating at all. I’d be excited to see more of the clone wars version in action to really sell me on it though. Maybe in a future tales of the Jedi",
            "score": 36,
            "author": "MacGuffinGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think if they were to have him wearing nothing but the Orbalisks, and they were kind of writhing and letting off a darkside red mist, it would look kind of intimidating. Especially if he was growling with every breath because of the pain, he was kind of a tank with the bugs, so seeing that charging forward, ignoring blaster shots would suck big time. This pic looks like some nerds idea of a Power ranger bad guy lol",
                    "score": 19,
                    "author": "SLIP411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This exactly. Get a redesign of the Orbelisk suit and it could very much look badass, instead of this version of Power Rangers",
                            "score": 5,
                            "author": "orangevoicework",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Keep in mind that Tarre Vizsla was placed in that time period.  So, he needs to look like the primary adversary of the Mandalorian Jedi that built the darksaber.  Sticking to Star Wars's samurai movie roots would work better, here.",
                                    "score": 2,
                                    "author": "getoffoficloud"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's a contemporary of Tarre Vizsla, so the armor would fit the main antagonist of a Mandalorian Jedi.",
                    "score": 2,
                    "author": "getoffoficloud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Number 3",
            "score": 7,
            "author": "Admirable-Distance20"
        },
        {
            "level": 0,
            "comment": "The 1st one that appeared in Clone Wars by a country mile",
            "score": 52,
            "author": "ToaPaul",
            "replies": [
                {
                    "level": 1,
                    "comment": "Over the book cover??",
                    "score": 3,
                    "author": "Ender505",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with OP, the eye tattoos look too edgy and try-hard for me",
                            "score": 12,
                            "author": "Silas-Alec",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess I get that. But TCW version looks too scrawny for the character always described as \"massive\" and \"groaning frame\" and \"mountain of muscle\"\n\nI'm picturing a huge monster of a man, not a sneaky \"bad guy\" with red eyes",
                                    "score": 4,
                                    "author": "Ender505",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, he looks like a depressed clown",
                            "score": 2,
                            "author": "ToaPaul"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Orbalisk version is the one from legends stories until the third book. Just different time periods for the same man.",
            "score": 23,
            "author": "Varion117",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean he only has the orbalisks for part of the second book.",
                    "score": 15,
                    "author": "OccamsSchickQuattro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "3rd. That's the Darth Bane I know.",
            "score": 6,
            "author": "Owain660"
        },
        {
            "level": 0,
            "comment": "What I think is the best way is 3 being how he actually looks, with 1 being some type of battle armor",
            "score": 3,
            "author": "Ok_Restaurant3160",
            "replies": []
        },
        {
            "level": 0,
            "comment": "3 for sure",
            "score": 4,
            "author": "ResponsibilityNew483"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 4,
            "author": "ILikedThatOne"
        },
        {
            "level": 0,
            "comment": "The second one looks like he might go by Darth Trilobite: the radiant urchin.",
            "score": 4,
            "author": "Kmaloetas"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 4,
            "author": "ChoiceNet8323"
        },
        {
            "level": 0,
            "comment": "The Clone Wars look is actually my favorite. Bug suit is dumb, normal face looks normal. Nothing wrong with it, it's just less interesting than the helmet.",
            "score": 4,
            "author": "BoboTheTalkingClown"
        },
        {
            "level": 0,
            "comment": "Anyone writing \"bug thing, scarabs, or crustaceans\" definitely didn't read the Darth Bane trilogy. It's fine if you don't like the aesthetic, but at least know they are called orbalisks, and they became an organic suit of armor after failing to protect a Sith Holocron and consume Bane.",
            "score": 11,
            "author": "TheFirstAmender"
        },
        {
            "level": 0,
            "comment": "#1 is fire Nation, gotta be the win",
            "score": 3,
            "author": "WolfCrafter28"
        },
        {
            "level": 0,
            "comment": "full armor darth bane. looks badass",
            "score": 3,
            "author": "SandStinger_345"
        },
        {
            "level": 0,
            "comment": "The second one is hilarious because he was all about \"hiding in the shadows\" but his armor doesn't scream \"I'm hiding\" at all.",
            "score": 3,
            "author": "wizard680"
        },
        {
            "level": 0,
            "comment": "The Clone Wars 1000% \n\nReally like the armor design and it’s visual clues of being from an older and different time period. The skull face mask is excellent.  It looks even better in action on The Clone Wars than in this illustration.\n\nI’m also a tired of Sith Lords looking like Darth Vader without his helmet off.  That look became a trope in the EU.  Keep Vader unique please and give these other Sith their own looks.",
            "score": 3,
            "author": "ChimneySwiftGold",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Definitely not two lmfao",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Clone Wars is his best look, 3rd one is pretty good and the 2nd one is trash. Orbalisk armor never not looked like garbage. The funny part is that we almost got his 2 look in TCW. Thank the Force Lucas had Bane redesigned!",
            "score": 3,
            "author": "DumberDum"
        },
        {
            "level": 0,
            "comment": "The third has always been my favourite and i’ll stand by that one",
            "score": 3,
            "author": "Themetalcollector"
        },
        {
            "level": 0,
            "comment": "#2 is corny as can be",
            "score": 3,
            "author": "evagnier"
        },
        {
            "level": 0,
            "comment": "I like the 2nd one the best with all of the orbillisks! The 3rd is the one i think of though.",
            "score": 6,
            "author": "orion3999"
        },
        {
            "level": 0,
            "comment": "The first one it was really cool seeing Bane in tcw and it made me kinda hope we'd see him in a future movie or show.",
            "score": 4,
            "author": "MasterBaiter92",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What is the second one",
            "score": 2,
            "author": "DirectConsequence12",
            "replies": []
        },
        {
            "level": 0,
            "comment": "1",
            "score": 2,
            "author": "Tmcdanne17"
        },
        {
            "level": 0,
            "comment": "3 is probably more canonical but 1 is the coolest. 2 is just plain stupid.",
            "score": 2,
            "author": "White_Wolf426",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean his armor in picture 1 is how he appears in a vision yoda had if him, id say THAT is the most cannon of all 3 images",
                    "score": 2,
                    "author": "Wingedwolf111",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The first photo is the only Canon one although even that one is fan interpretation of his depiction in Clone Wars. \n\nThis is his only canon appearance so far: https://static.wikia.nocookie.net/theclonewiki/images/9/9b/Darth_Bane_canon.png/revision/latest?cb=20170620012342",
                    "score": 1,
                    "author": "Lunndonbridge",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 is one of the worst looking suits of armor I've ever seen. What am I even looking at?? Looks like a joke. Hilariously awful.",
            "score": 2,
            "author": "trumangroves86",
            "replies": [
                {
                    "level": 1,
                    "comment": "His armor is made up of lightsaber resistant insects that feed on the force. He's pretty much invulnerable while wearing it and it took 3 of some of the strongest jedi to hurt him. He even killed the jedi in the end.",
                    "score": 3,
                    "author": "SullenTerror",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’re all edgelord terrible",
            "score": 2,
            "author": "WhiskeyCloudsBackup"
        },
        {
            "level": 0,
            "comment": "The Canon one.\n\n*watches chaos ensue in comments*",
            "score": 2,
            "author": "Brysonius_"
        },
        {
            "level": 0,
            "comment": "I much prefer the first one, but whenever I hear or think of his name I usually think of him in his 3rd look…",
            "score": 2,
            "author": "Cuddling-Hellhound"
        },
        {
            "level": 0,
            "comment": "The clone wars depiction was way better. I watched that episode and was shocked when I went to go buy the Darth bane books that wasn't his main look.",
            "score": 2,
            "author": "randomstuff_191",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Anything but the second picture. Seriously, who designed that armor?",
            "score": 2,
            "author": "crispier_creme"
        },
        {
            "level": 0,
            "comment": "1. Optimus prime meets Lord Zedd\n\n2. edgier version of the Bullshit man from James Rolfe’s cinemassacre channel. \n\n3. Generic human Sith Lord. \n\nHonestly I kinda prefer 2 for it’s uniqueness, but I can see why it’s most people’s least favorite.",
            "score": 2,
            "author": "TSG61373"
        },
        {
            "level": 0,
            "comment": "I always imagined him as #3.",
            "score": 2,
            "author": "KaptainKardboard"
        },
        {
            "level": 0,
            "comment": "1st one. I don't recognize the second and third one.",
            "score": 2,
            "author": "JediWarrior117",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I chose 2. Just because the guy who is wearing that armor is a close and dear friend. He also hand made that armor and helmet. Has been in the Star Wars world for over 2 decades making conceptual art and has had characters created based on his designs.",
            "score": 2,
            "author": "Wactout"
        },
        {
            "level": 0,
            "comment": "Tbh I don’t know much about Darth Bane but I do know he’s a badass. I like the first picture the best",
            "score": 2,
            "author": "thetwistedmoondog"
        },
        {
            "level": 0,
            "comment": "1, Mark Hamil killed it as Darth Bane in the Clone Wars",
            "score": 5,
            "author": "MeesaJarJarBinkss",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Three. Look one is some weird space samurai, and look two seems to be a Power Rangers villain.",
            "score": 3,
            "author": "NoPhone4571",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The first one. Something very menacing about it",
            "score": 3,
            "author": "Ok_Nefariousness3401"
        },
        {
            "level": 0,
            "comment": "I love the simplicity of 3, but 1 is ok too. 2 should never have made it past the drawing board.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "3/1/2",
            "score": 2,
            "author": "Just_JamXs"
        },
        {
            "level": 0,
            "comment": "Number 1 is a fire bender",
            "score": 2,
            "author": "rtf2409"
        },
        {
            "level": 0,
            "comment": "Definitely the Canon one we see in Clone Wars. Scarab armor is just goofy, and the eye tattoos just look a little too edgy and silly",
            "score": 2,
            "author": "Silas-Alec",
            "replies": []
        },
        {
            "level": 0,
            "comment": "#1",
            "score": 1,
            "author": "DynamicSocks"
        },
        {
            "level": 0,
            "comment": "I feel like you got a bad picture of him from TCW for pic 1, when he appears in the episode proper he's very ghostly &amp; cool",
            "score": 1,
            "author": "radiakmjs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well that's because he was literally a ghost/illusion. When he was alive he probably didn't walk around with smoke trails and glow effects",
                    "score": 3,
                    "author": "Jurgepoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Second one seems the most imaginative so that’s what I prefer. His armor looks like fossils lol",
            "score": 1,
            "author": "k0mbine"
        },
        {
            "level": 0,
            "comment": "1 and 3 are both good, 3 could easily just be him when not in his armor. 2 is an abomination.",
            "score": 1,
            "author": "Thehalohedgehog",
            "replies": [
                {
                    "level": 1,
                    "comment": "3 is the Cover of the first book from drew karpyshyn the author of the bane trilogy",
                    "score": 2,
                    "author": "MarkusRuleTheGym"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does the 2nd picture look like something Midjourney would come up with? That looks so dumb",
            "score": 1,
            "author": "xDracolich"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 1,
            "author": "RandyJohnsonsBird"
        },
        {
            "level": 0,
            "comment": "The 1st one because I think his original(armor) look is trying to hard. I am fine with his sith robs and stage make-up.",
            "score": 1,
            "author": "Sol-Meme"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 1,
            "author": "ohbionekanobie"
        },
        {
            "level": 0,
            "comment": "The third one is just a bald man with some clown make-up. It's never been an interesting design.",
            "score": 1,
            "author": "Cyfiero"
        },
        {
            "level": 0,
            "comment": "The first one looks like shredder from ninja turtles and the second one looks stupid, so the third one",
            "score": 1,
            "author": "No-Engineer-1728"
        },
        {
            "level": 0,
            "comment": "None of them tbh",
            "score": 1,
            "author": "Racager"
        },
        {
            "level": 0,
            "comment": "Honestly I’d be fine with the orbalisk set if they didn’t just arbitrarily decide that the mask had to look stupid af. Legit the helmet from 1 (which is my favorite just to answer the question) or something similar would have worked just as well as that *stupid godawful fucking mask*. 3 is good too but I’d pick 1 (and 2 if the mask was changed to not be shit) over it. So 1 &gt; 2 with changed mask &gt; 3 &gt; normal 2",
            "score": 1,
            "author": "TheCynicalPogo"
        },
        {
            "level": 0,
            "comment": "These are all terrible.",
            "score": 1,
            "author": "michaelvares"
        },
        {
            "level": 0,
            "comment": "3. The orbalisk thing was incredibly dumb, and my least favorite part of that book series.",
            "score": 0,
            "author": "BearPondersGames"
        },
        {
            "level": 0,
            "comment": "The second one looks like a warlock from destiny",
            "score": 1,
            "author": "DaEpicNess666"
        },
        {
            "level": 0,
            "comment": "Where is the second photo from?",
            "score": 1,
            "author": "cozonac_pufos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "1 and 3",
            "score": 1,
            "author": "danieljhaugh627"
        },
        {
            "level": 0,
            "comment": "I like the way he looked in Jedi vs sith comic",
            "score": 1,
            "author": "graphicka"
        },
        {
            "level": 0,
            "comment": "The hooded version has always been my favorite. The orbalisk armor was a weird moment and I didn't care for it.",
            "score": 1,
            "author": "ButtsMcStuffin_2"
        },
        {
            "level": 0,
            "comment": "first in my opinon",
            "score": 1,
            "author": "notinyourwalls"
        },
        {
            "level": 0,
            "comment": "Why does the second one look like a weird ai generated image",
            "score": 1,
            "author": "Chelf1"
        },
        {
            "level": 0,
            "comment": "1, but he could still be 3 as well under it. I do think that eyeliner/tattoo needs to go though. After the Son and Grand Inquisitor it’s become overused for bald humanoid characters.  Orbalisk armor looks like he went shark diving, got caught in a reef and fused with it.",
            "score": 1,
            "author": "Lunndonbridge"
        },
        {
            "level": 0,
            "comment": "#1",
            "score": 1,
            "author": "MV2263"
        },
        {
            "level": 0,
            "comment": "I like 2, it’s unique",
            "score": 1,
            "author": "EMArogue"
        },
        {
            "level": 0,
            "comment": "Clone Wars look is coolest imo",
            "score": 1,
            "author": "h0mew0rld"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 1,
            "author": "Punch_yo_bunz"
        },
        {
            "level": 0,
            "comment": "3",
            "score": 1,
            "author": "TheHeirOfElendil"
        },
        {
            "level": 0,
            "comment": "You can’t tell me 2 isn’t from Power Rangers",
            "score": 1,
            "author": "KeybladeCoaster"
        },
        {
            "level": 0,
            "comment": "master splinter",
            "score": 1,
            "author": "OkGood1294"
        }
    ]
}