{
    "id": "1424xh4",
    "score": 0,
    "title": "Anyone else wish jar jar was more present in the prequels?",
    "author": "PlayboiCardi9",
    "date": 1686029288.0,
    "url": "https://www.reddit.com/r/StarWars/comments/1424xh4",
    "media_urls": [],
    "other_urls": [],
    "postText": "He was heavily featured in the phantom menace but barely appeared in attack of the clones or revenge of the sith. \nI felt like his presence would’ve helped make the prequels more fun imo. \nI really liked his presence, I know he is a controversial character, but how do you guys feel about this.",
    "comments": [
        {
            "level": 0,
            "comment": "I heard he was originally supposed to be prominent in all three movies, on the same level that Chewbacca was prominent in the original trilogy, but Lucas drastically cut his screen time in AOTC and ROTS due to fan reception.",
            "score": 5,
            "author": "BlackCanaryForever"
        },
        {
            "level": 0,
            "comment": "Uh no",
            "score": 4,
            "author": "DriverOdd587"
        },
        {
            "level": 0,
            "comment": "Jar Jar was a failed experiment. The root of the problem is that George, while not particularly good at writing anything, is especially bad at comedy. He can't write humour to save his life, and that was the crux of Jar Jar's character. He was *the* comic relief, but was so deeply unfunny that people found him irritating and offensive. Jar Jar could have worked, but not with George writing him.",
            "score": 3,
            "author": "PagzPrime"
        },
        {
            "level": 0,
            "comment": "I’m giving you the benefit of the doubt and assuming this is a gag post.",
            "score": 4,
            "author": "XephyXeph",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was really bummed he wasn't very present in ROTS",
                    "score": -1,
                    "author": "ar243"
                },
                {
                    "level": 1,
                    "comment": "He is one of my fav characters",
                    "score": -2,
                    "author": "PlayboiCardi9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m OK with JarJar in the prequels, except for his voice. \n\nI wish that when he got stuck in the podracer, Anakin fired it up and tore his tongue out.",
            "score": 2,
            "author": "navig8r212"
        },
        {
            "level": 0,
            "comment": "No.\n\nNext question?",
            "score": 2,
            "author": "Mr_Write_NEO"
        },
        {
            "level": 0,
            "comment": "No. More like, the opposite. Less Jar Jar, or even better, no Jar Jar at all.",
            "score": 2,
            "author": "Daggertooth71"
        },
        {
            "level": 0,
            "comment": "A lot of people didn't like Jar Jar in the phantom menace, which is why they cut a lot of his screen time in the following movies.",
            "score": 2,
            "author": "Stenric"
        },
        {
            "level": 0,
            "comment": "Sadly, fan response to JarJar was so negative and hostile that he was given a reduced role in the other films. The actor who performed and voiced him was treated appallingly by fans to the point where he was receiving hate mail and threats. Think Rose Tico in the sequel trilogy. That’s how awful it was.",
            "score": 1,
            "author": "Mister_Sosotris"
        },
        {
            "level": 0,
            "comment": "It was due to the hatred his character received, I think Lucas at some point wanted to remove him from the phantom menace but he was in so much of the movie they couldn’t. I personally never hated Jar Jar, he was dopey &amp; a bit much, but not as bad as everyone made him out to be.",
            "score": 1,
            "author": "Obibrucekenobi"
        },
        {
            "level": 0,
            "comment": "Definitely. I loved Jar Jar as a kid and still love him now. He's my favorite Star Wars character. Now that Ahmed Best has been brought back as a different character, I want Jar Jar to come back too.",
            "score": -1,
            "author": "brassyalien"
        }
    ]
}