{
    "id": "142wnr0",
    "score": 0,
    "title": "What order please?!",
    "author": "HairyDependent",
    "date": 1686093566.0,
    "url": "https://www.reddit.com/r/StarWars/comments/142wnr0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ok, I understand this has been answered before on here. I want the freshest ideas! \n\nPlease help. My wife will FINALLY be watching all of the Star Wars movies with me before going to Galaxy’s edge in 2 weeks. What order? She has trouble staying engaged. I’m torn between 1-9 or rogue one first and then letting her decide if she wants to see what happened before or after?\n\nThoughts? TIA!",
    "comments": [
        {
            "level": 0,
            "comment": "Theatrical release for first-time viewers. Every time.",
            "score": 4,
            "author": "Three_Twenty-Three"
        },
        {
            "level": 0,
            "comment": "If it’s Galaxy’s Edge then OT for sure and at least TFA after so she has a baseline of what she’s seeing on the visit",
            "score": 3,
            "author": "BTolentino7"
        },
        {
            "level": 0,
            "comment": "4-6 first for sure",
            "score": 3,
            "author": "dthangrpt"
        },
        {
            "level": 0,
            "comment": "A first time viewing should always be done in release order.",
            "score": 3,
            "author": "Gorguf62"
        },
        {
            "level": 0,
            "comment": "Definitely release order.",
            "score": 3,
            "author": "SirUrza"
        },
        {
            "level": 0,
            "comment": "Well, Galaxy's edge is mostly Sequel themed.  So if getting her up to speed is your primary goal, you gotta check out at least TFA.\n\nI know this is controversial around here, but I think TFA is actually a pretty good starting point for new fans in general.  \n\nI have several family members who didn't give a shit about Star Wars until TFA came out.  \n\nFemale protagonist + modern sensibility did a lot of work toward getting my sister engaged.  Now she's almost as nerdy as I am.",
            "score": 2,
            "author": "InfiniteDedekindCuts"
        },
        {
            "level": 0,
            "comment": "I’m kind of a fan of 4,5,1,2,3,6\n\nOr Rogue, 4,5, Solo, 1,2,3, 6",
            "score": 2,
            "author": "Burdiac"
        },
        {
            "level": 0,
            "comment": "Disney made the park theme around what they put out once they acquired Lucasfilm; so the sequels and Rogue One/Solo.\n\nBut, I would say A New Hope is the only way to start. Lucas put that one out first for a reason.",
            "score": 2,
            "author": "HonestTumblewood"
        },
        {
            "level": 0,
            "comment": "Order 66.",
            "score": 0,
            "author": "parrry"
        }
    ]
}