{
    "id": "143o43w",
    "score": 1400,
    "title": "With an estimated 10,000 Jedi before the purge, why are people always surprised to see more survivors show up?",
    "author": "lasershow77",
    "date": 1686169968.0,
    "url": "https://www.reddit.com/r/StarWars/comments/143o43w",
    "media_urls": [],
    "other_urls": [],
    "postText": "With Jedi scattered throughout the whole galaxy and many very powerful, I don’t think it is at all far fetched that even just 1% of them survived. That is 100 Jedi!\n\nWe have yet to even see half of that in canon and people already seem to think it’s improbable more keep popping up. It makes sense, some of them more than likely were not even with clones at the time or were just very powerful force users. \n\nAs far as them constantly making their way into the story lines in shows. These surviving Jedi would be some of the most powerful people left in the universe after the purge. If the shows are highlighting the most influential people after order 66 it makes sense the surviving Jedi would eventually cross paths with them. \n\nTo add I think it’s cool we get to see them in many forms. It seems accurate that they would follow different paths. Some hiding, others falling to the dark side as inquisitors, becoming mercenaries, or trying to protect the galaxy from the empire. \n\nI got the numbers info from wookiepedia, but that’s just my thoughts with that information",
    "comments": [
        {
            "level": 0,
            "comment": "I think because of Tarkin's line about Jedi extinction.  Which pretty much takes it too literally,  were any Jedi survivors are not organized in any meaningful way to the Empire's goals. \n\nBut, I imagine its more of a tired trope, now, especially repeated in Rebels, Mandalorian,  Obi-Wan and others.",
            "score": 735,
            "author": "Joecool2008",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do they forget Obi-Wan's line:\n\n&gt; A young Jedi named Darth Vader, who was a pupil of mine until he turned to evil, helped the Empire hunt down and destroy the Jedi knights.\n\nThis implies that there should be a pretty good chunk of Order 66 survivors. With only a few surviving to the time of A New Hope.",
                    "score": 418,
                    "author": "N0V0w3ls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is the exact reason for the inquisitors as well is it not?",
                            "score": 8,
                            "author": "bobert_the_grey"
                        },
                        {
                            "level": 2,
                            "comment": "Not necessarily. Vader could have\"helped the emperor hunt down and destroy the jedi\" on the night of order 66. It doesn't necessarily indicate that it took him 20 years.\n\nThe reason I don't buy it is because in A New Hope, the jedi are a nearly forgotten legend. In addition to Tarkin, there's Motti calling it a sad devotion to an ancient religion, Luke doesn't know anything about jedi or the force, Han thinks it's all superstition. \n\nIf it was one comment, then fine. But episode 4 went a long way to convince us that the jedi are gone. Now we find out that basically everyone in the Alliance has probably met a jedi in the last 5 years. I don't buy it.",
                            "score": 176,
                            "author": "Mundane-Carpet-5324",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fair point, of course the real reason is that George Lucas and ILM didn’t know Star Wars would be such a hit and they’d need to plan ahead for literally thousands of hours of content across different mediums. But I’m all for a little bit of ret con if it makes general sense and brings us new and interesting characters",
                                    "score": 106,
                                    "author": "coolestnameavailable",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Poor planing or having an incomplete plan is pretty much the main reason for plot holes in *any* work of fiction.",
                                            "score": 53,
                                            "author": "SirBulbasaur13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Especially since Lucas kept tinkering with it.",
                                                    "score": 24,
                                                    "author": "Joecool2008"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes but still they could have picked a different time to make other movies and did not have to be that close to the OT and go against most of the things that are said in those movies. Ok that you didn't plan to do other movies but why contradict your previous work",
                                            "score": 3,
                                            "author": "Spagghettaboutit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, this is obviously the correct answer. I just wish that Lucasfilm/ Disney did a better job with smithing or the wrinkles in their retcons.",
                                            "score": 17,
                                            "author": "Mundane-Carpet-5324",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m fairly certain the in canon explanation is that the empire literally made it forbidden to discuss or learn about Jedi. I mean it’s an authoritarian regime. Uncle Owen knows about Jedi but he clearly doesn’t want to talk about it because he doesn’t want Luke getting mixed up in it. But I wouldn’t be surprised if the Empire went full 1984 thought crimes on having even discussions or literature on the Jedi.",
                                                    "score": 18,
                                                    "author": "ImperatorNero",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean we see the town getting terrorized by inquisitors. That’s enough to make me shut up about them. Very much like how Nazis would treat people being sympathetic to Jewish people.",
                                                            "score": 5,
                                                            "author": "krichardkaye",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Exactly. Then you get to people like Han. Like… he was what? 5? 7? When the Jedi order was destroyed. On a poor world. And didn’t have a formal education. I’m not surprised all he’s heard under those circumstances are just rumors and whispers. It’s not like smugglers loved Jedi either so I’m not sure there would be many interested in talking about them in the first place.",
                                                                    "score": 4,
                                                                    "author": "ImperatorNero",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wasn’t corellia an imperial stronghold? Or at the very least in solo he is in the empire for several years. I would assume talking about Jedi would get you a “write up”",
                                                                            "score": 3,
                                                                            "author": "krichardkaye",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Coruscant alone had several TRILLION people. 99% of the galaxy would have never seen or been anywhere near a Jedi ever in their life. Of course people thought they were legends, myths, exaggerated, not real, etc. 10,000 vs the population of the galaxy?? That's such a miniscule percent.",
                                    "score": 20,
                                    "author": "Llanolinn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They were broadcast all over the galaxy as war leaders and in holovids shown casting *literal magic spells*, and that had been the case for thousands of years.\n\nThe bottom line is that Lucas and others realized the Jedi were a huge selling point of Star Wars and they created so many stories focused on them (and large numbers of them) that they began to erode the believability of the universe. Jedi being the literal peacekeepers of history and a people known to cast magic spells, who are repeatedly broadcast on galactic news, and in *less than one generation* they are ancient/forgotten/extinct according to ANH? \n\nThere's no logic for that.",
                                            "score": 4,
                                            "author": "S-192"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We have a handful of Jedi out of 10,000, and they typically hide themselves. If we're already willing to stretch the imagination such that people like Han Solo, who were *alive* during the height of the Jedi Order forgot who the Jedi are, then the handful who made it out and have been in hiding for 20 years are not going to make a dent in the general sentiment in the Galaxy.",
                                    "score": 67,
                                    "author": "N0V0w3ls",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that’s 10,000 in an entire galaxy. there are entire cultures and religions on this one planet that are entirely unknown to many",
                                            "score": 95,
                                            "author": "professormagma",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a fair point. There are larger groups on earth I probably have never heard of. Though the Jedi seemed pretty universally known during the clone wars.",
                                                    "score": 14,
                                                    "author": "BOBULANCE",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, if there was a culture on earth of a couple of thousand people who could all move stuff with their minds and fought off people with guns with nothing but laser swords that can cut through anything, you'd probably hear about them sooner or later.",
                                                            "score": 5,
                                                            "author": "nagrom7",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or they'd be the stuff of rumor, like Bigfoot or aliens.",
                                                                    "score": 15,
                                                                    "author": "BOBULANCE",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Or religions. 10,000 Jedi in a galaxy of trillions? You could say the Jedi exist in real life right now but you would never know about them, and there wouldn't be enough to really learn the force.",
                                                                            "score": 3,
                                                                            "author": "MrRocketScript"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Han Solo had never met one though and most of the low life's and thugs probably haven't either. They were always sort of legendary just more so when they were gone.",
                                            "score": 48,
                                            "author": "corsair1617",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right. Coruscant itself had trillions of people, with maybe a few hundred Jedi. You'd only hear about them in news broadcasts, if that.",
                                                    "score": 19,
                                                    "author": "SilverMedal4Life"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They were legendary when there were lots of them. By Hans time, they were more of a myth, something that had been exaggerated by history.",
                                                    "score": 3,
                                                    "author": "Talidel",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You’re kinda of ignoring how fast people can forget about things that were common place only 20 years ago. 20 years doesn’t seem like a long time, but it’s enough time to make people forget all about Ed Hardy Shirts.",
                                    "score": 25,
                                    "author": "trustysidekick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And Ed Hardy is only 12-15 years ago lol",
                                            "score": 5,
                                            "author": "drakeftmeyers"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But the difference is, is that the Jedi have been a part of galactic culture for 1000s of years. \n\nIts like saying when every Knight, or Samurai died, yet we still know of them hundreds of years later (Though there wasnt a desire to completely eradicate their legends)",
                                            "score": 11,
                                            "author": "zimbledwarf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True but Earth hasn’t had a Sith empire removing all references to knights and samurai from the internet and books, and making it illegal to even talk about them. The Emperor completely suppressed all info on the Jedi after the purge.",
                                                    "score": 6,
                                                    "author": "nascentia",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I agree with this. Based on what I read about his birth year vs when the Clone Wars was, Han Solo woulda been around 10 yrs old (please correct if I am wrong). Considering Anakin was like 9 when he first met a Jedi, it wouldn’t be a surprise that Han didn’t at his age. And to kids Jedi were possibly tales, fables, stories that made kids question if they were real.\n\nHowever this article (below) seems to cover this topic pretty well. And pretty much puts me in the mindset that maybe Han could have seen Jedi but by that point in his life he never saw anything good about the Jedi so it’s easier to dismiss their existence? \n\nhttps://www.ign.com/articles/star-wars-jedi-knights-forgotten-mandalorian-clone-wars",
                                            "score": 2,
                                            "author": "b_moz"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also: “Luke! When gone am I… the last of The Jedi Will you be”\n\nhttps://youtu.be/5ZK57xBaGwM",
                                    "score": 4,
                                    "author": "pissalisa",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Don't forget that Obi-wan is trying to set up Luke to say \"Yes, I want to fight the empire\". So Obi-wan slides past a lot of facts in that little bit of story time. He serves up a simple story designed and luke swallows it hook, line and sinker.",
                                    "score": 17,
                                    "author": "Elfich47",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People seem.to really forget this. Obi-wan just needed Luke. \n\nIt's like people get mad that he said Darth Vader killed is father instead of telling him he is his father. Oh I am sorry Obi Wan needed Luke to kill Darth Vader. Having him murder his father is a great motivator. \n\nYou can't just tell someone yeah this is your dad now go kill them. No",
                                            "score": 6,
                                            "author": "KayD12364",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, yeah the baited hook was “he betrayed and murdered your father”. Which we know from hindsight is a *very* shaded way of presenting what happened.\n\nObi-Wan didn’t out right lie, but he definitely left a lot out when he said that.",
                                                    "score": 2,
                                                    "author": "Elfich47"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When you look at it from this angle, Obi-Wan spoon fed Luke a bunch of half truths to get him on board and teach him the ways of the force, against his Uncle Owens explicit wishes. The Jedis age old tradition of grooming young force sensitives into freedom fighters dies hard",
                                            "score": 24,
                                            "author": "MarkyMarcMcfly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think uncle Owen knew that day would come. Ben had set Luke up with Owen in the beginning.",
                                                    "score": 2,
                                                    "author": "Elfich47"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean look at it this way. There were about 10,000ish Jedi during the beginning of the clone wars. Many stayed in the temples almost permanently and the ones that did venture out usually only met with leaders of planets and senators. In a galaxy of trillions it's extremely unlikely that the average person would ever meet a Jedi. Heck I'm willing to bet even during the pre clone wars days there were plenty of people who thought the Jedi were myths or Republic propaganda. Mix that with a huge propaganda scheme by Palp to both blame and make people forget about the Jedi and you've got atleast one generation that would know nothing about them. Aside from some backroom whispers the Jedi would have been forgotten just as Palp intended. \n\nWith the rebellion you notice they're the first people aside from Obi Wan to use \"may the force be with you\" which is generally a Jedi line. This makes sense as the rebellion would be a very Pro Jedi group. Probably partially because a founder of the Rebellion was a Jedi even though she kept herself in the shadows for the entirety of her involvement. Also atleast two other Jedi that we know of served in the rebellion. \n\nI guess the point I'm trying to make is smaller numbers in a huge galaxy, plus disconnect from the general public, most of their number being wiped out 20 years prior to episode 4 with most of those remaining being picked off over the next few years, plus a huge taboo/ propaganda from the Empire. It really isn't that hard to see why they're generally considered myths outside those that knew them personally.",
                                    "score": 3,
                                    "author": "TopicBusiness"
                                },
                                {
                                    "level": 3,
                                    "comment": "As others pointed out I think, even a religion of 10000 magic wielding followers wouldn't be well known across an entire galaxy full of cults, hoaxes, technology and other religions.\n\nOn top of that, jedis didn't exactly look for attention, run ads or tried to stand out in any way, so they'd probably be a myth or rumor even during their prime.\n\nThe only thing in my mind that would give them some clout was being attached to the senate and having nice offices and privileges in coruscant, but even so, I don't know how much visibility that would give them and who really cared in a galaxy full of pole dancing twileks.\n\nLike any secret police, they'd be still a rumor until your neighbor gets his hands amputated by a lightsaber. \n\nWhile the 'ancient religion' comments still feel a bit out of place in the old movies, to some extent one could argue that history is written by the Victors, and so the empire's move might have been to make the jedi go away quietly and have them forgotten, rather than brag about it publicly.\n\nWe know how countries today try to rewrite history and events that didn't happen that long ago, couple that with some disinformation from the empire and they could pull it off easily. \n\nAt the end of the day, it's just movies made across decades, so as creativity flows, details will change and not add up anymore 100%. I doubt there's any lore mystery around those details.",
                                    "score": 3,
                                    "author": "Strangefate1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly that though. Luke wasn't apart of the Alliance yet. He knew nothing of the existence of the Jedi. He was on a desolate desert planet before obi wan made him aware.\n\nAlso the survivors tend not to make themselves noticed. The Empire is arogant in thinking it has destroyed them, when in fact the smart ones are alive and working under the radar.\n\nAlso obi wan thinks they're wiped out because he only knows Yoda is alive for definite. He's spent the last 20years on tatooine.",
                                    "score": 3,
                                    "author": "houstonwhaproblem",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;It doesn't necessarily indicate that it took him 20 years.\n\nit also doesn't mean that they were all destroyed on that night either.\n\n&gt;the jedi are a nearly forgotten legend.\n\nthat's because they are in hiding.\n\n&gt;Now we find out that basically everyone in the Alliance has probably met a jedi in the last 5 years. I don't buy it.\n\nLuke and Han were not part of the Alliance when they were making those comments.",
                                    "score": 3,
                                    "author": "FetusDrive"
                                },
                                {
                                    "level": 3,
                                    "comment": "Han thinks they are superstition but knows of them, even luke knows of them! He asks obiwan “what is the force” as something like that would be harder for a regular guy to understand, but he never asks him “what is a jedi”, even the rebellion uses “May the forcé be with you” all of the time, that does not sound like a galaxy that forgot about jedi.",
                                    "score": 7,
                                    "author": "rustervr"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah but 10,000 people in a galaxy of… Trillions at least? Bro they’ve always been a rumor to any person not living in the core worlds.",
                                    "score": 2,
                                    "author": "CheesingTiger"
                                },
                                {
                                    "level": 3,
                                    "comment": "In a galaxy with millions of planets, and 10k Jedi, which are all mostly concentrated on Coruscant, most people would consider Jedis a legend, or myzh, even on their heyday.",
                                    "score": 2,
                                    "author": "PayaV87"
                                },
                                {
                                    "level": 3,
                                    "comment": "10,000 Jedi at the height of the clone wars. Trillions upon trillions of people in the Galaxy. How is it far fetched to think that most people look at them as a legend, when majority of people in the galaxy will go through their whole lives not seeing a single Jedi. Then when Order 66 happens there is even more of a scant amount of them. You aren't looking at things in universe at all.",
                                    "score": 2,
                                    "author": "anomander50"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also Yoda’s line “When gone am I, the last of the Jedi will you be.”",
                            "score": 11,
                            "author": "Trvr_MKA",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "  \nGrand Moff Tarkin : The Jedi are extinct, their fire has gone out of the universe. You, my friend, are all that's left of their religion.  \n\n\nWith there being approximately two well-known Sith left by ANH (one, Darth Sidious, not known to the vast majority of people) and all the remaining Jedi in hiding (with their order completely destroyed) he's not really wrong.",
                    "score": 81,
                    "author": "RagnarStonefist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, how many surviving Jedi are there by ANH? We see plenty survived Order 66, but the very existence of the Inquisitors implies that many survived it anyway. By ANH they were largely all dead. \n\nWho is even left? Ezra wasn't a Jedi at the time of the purge, Kanan is dead. Ahsoka left the Order and wasn't really a Jedi anymore anyway. Cal and Cere likely die at the end of the Jedi trilogy. Obi-Wan and Yoda obviously survive. Who else is around by ANH? Grogu? Would have been a Youngling and not really relevant to the Jedi. \n\nGungi is probably dead since he went off to Kashyyyk. \n\nSo at the time of A New Hope, it's pretty likely that Obi-Wan, Yoda and Ahsoka were the only Jedi that survived through to that point. Grogu if you want to count him. That's 4 from 10,000",
                            "score": 23,
                            "author": "superbabe69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;So at the time of A New Hope, it's pretty likely that Obi-Wan, Yoda and Ahsoka were the only Jedi that survived through to that point.\n\nThe reality is, as many Jedi as they want can survive to that point.  There are the ones that we \"know of\" and there are the ones the writers can choose to invent.\n\nI mean, Cal and Cere didn't exist until they invented those characters.  They can invent more Jedi and former Padawans.",
                                    "score": 5,
                                    "author": "Highlander198116"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "After recently watching Rebels, it’s clear Tarkin is a “manifest your own reality” kind of guy. He seemed pretty incredulous about the whole thing when he found out about Kanan. He doesn’t anyone implying his empire  could fail.",
                            "score": 43,
                            "author": "cduga",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Grand Moff \"I think you overestimate their chances!\" Tarkin, who didn't believe fighters were a threat to his battlestation.\n\nThe battlestation then blown up by the Jedi he wrote off earlier in the movie. Yeah, he does seem to be overconfident.",
                                    "score": 5,
                                    "author": "Captain-Griffen"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's very clear they've had to work to twist the canon to make it click. The way the OT presented Jedi, they were ABSOLUTELY going for the angle that the Jedi were essentially extinct. The only ones we see are the *best of the best* who survived only in extreme isolation.",
                                    "score": 2,
                                    "author": "S-192"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, even if 500 jedi survived scattered across the galaxy mostly just trying to live out their lives and avoid detection.  Tarkin isn't \"really\" wrong.  HOWEVER, I think his assertion really mitigates the risk of even one Jedi remaining that opposes the Empire.  Ultimately one fledgling Jedi was responsible for decapitating the Leadership of the Empire.",
                                    "score": 2,
                                    "author": "Highlander198116"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, not really.",
                            "score": 7,
                            "author": "Joecool2008"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The same trope exists in our world with American Indians. Thomas Jefferson even wrote that \"the Indian appears to be fading away\" in one of his journals. The trope is damaging to those who survive and has led to governmental organizations to marginalize them further. The same was said of Armenians too. \n\nThose in power often embellish the downfall of their enemies to consolidate power.",
                    "score": 36,
                    "author": "davy89irox"
                },
                {
                    "level": 1,
                    "comment": "You can also interpret the line as him buying wholesale the empire propaganda machine.",
                    "score": 12,
                    "author": "TheTru7h"
                },
                {
                    "level": 1,
                    "comment": "If the jedi and their religion was wiped out so succinctly then why did the rebel leaders say \"may the force be with you\"\n\n\nThat wouldn't make sense if Luke was their first ever jedi. It actually makes more sense now that the rebels have had a few over the years.  Cal, ahsoka, kanan etc",
                    "score": 8,
                    "author": "Objective_Look_5867",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Several of the older Rebel leaders knew Jedi personally and probably picked it up from them. It’s kind of like saying good luck to someone.",
                            "score": 16,
                            "author": "Allana_Solo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like saying bless you after someone sneezing even if you have no religious leaning, it's really just a phrase to acknowledge something that continues through habit. \n\nAnd if the leader uses may the force be with you as a good luck, then their teams will probably pick it up too",
                                    "score": 4,
                                    "author": "whatchagonnado0707",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean they could have just heard of the Force without it being connected to Jedi or Sith",
                            "score": 5,
                            "author": "superbabe69"
                        },
                        {
                            "level": 2,
                            "comment": "I mean, I get your point but it's not like non-religious people can't use religious language,  e.g. \"Jesus Christ,\" as an expletive.",
                            "score": 5,
                            "author": "Joecool2008",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But they're saying it in a more respectful, reverential kind of way in Star Wars. I feel like it'd be more like a non-religious person saying \"I'll be praying for you\" or  \"God bless you\" in a non ironic way",
                                    "score": 2,
                                    "author": "thedirtypickle50",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But that's still 20 years after RotS. Which is room for a good amount of survivors.",
                    "score": 2,
                    "author": "RadiantHC"
                },
                {
                    "level": 1,
                    "comment": "“The Jedi are extinct, their fire has gone out of the universe. You, my friend, are all that's left of their religion.”",
                    "score": 2,
                    "author": "ThoughtfullyLazy"
                },
                {
                    "level": 1,
                    "comment": "Yeah his line seems to imply extinction of the organized religion. Also not to mention many of the survivors were padawans so they know the teachings but aren’t necessarily masters",
                    "score": 2,
                    "author": "jerryoc923"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This this this - it’s so clear to me even if order 66 was devastatingly effective with a 99% kill rate we’d still have 100 Jedi left out there. And afaik we’re well under that number of known survivors.",
            "score": 56,
            "author": "ope-ologist"
        },
        {
            "level": 0,
            "comment": "If you only count the on-screen survivors, it's around 10 Jedi. Which granted from a narrative perspective seems like a lot and an over used trope. But like... \n\nOrder 66 and the subsequent hunt/purge killing 9,990 *magic space wizards* across *an entire freaking galaxy*   and folks get mad when they manage Lysol level eradication numbers.",
            "score": 321,
            "author": "pseudonymous_cypher",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were bound to be Jedi who weren't anywhere near clone troopers at the time of the purge, and lots of them. The problem for believing they could all have been killed is the wide variation between what the Jedi could do as seen in different mediums, and sometimes within the same shows. Jedi who could pick up cars with the force and throw them into groups of people, or blast people off roads or blow doors off hinges, not to mention the whole light sword thing where you know where the blaster bolts are going to come and simply redirect them back at whoever fired, well, it makes it pretty damned hard to kill a Jedi.  On the other hand, the ones in the flashbacks of the temple went down pretty quickly to a handful of clone troopers.",
                    "score": 50,
                    "author": "Own_Carrot_7040",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It wasn't just the clones though. Palpatine set up an emergency beacon using Jedi encryption telling them to return to the temple on Coruscant (that's why Obi-Wan and Yoda went to the temple after Order 66). Any Jedi who fell for it would be dead. And any Jedi who survived Order 66 and didn't go to the temple would be hunted by Vader, the Inquisitors, and the Empire. And hiding from a galaxy-spanning dictatorship is not easy. They have spies everywhere, regular people will turn you in to avoid the Empire's wrath, and Vader and the Inquisitors can literally sense your presence. Plus, Palpatine knew where nearly every Jedi was when he activated Order 66. Add to that the fact that most Jedi would try fighting rather than hiding, which would let the Empire know where they were, and it's pretty unlikely that a significant number of Jedi would survive the two decades before A New Hope. \n\nAlso, keep in mind, Jedi like Obi-Wan, Anakin, Ashoka, etc. are major outliers. The vast majority of Jedi would be taken down pretty quickly by the clones. See how effectively they took down Pong Krell, for example.",
                            "score": 22,
                            "author": "Abobalagoogy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/fuckpongkrell",
                                    "score": 16,
                                    "author": "StonedBirdman"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the whole “hiding from the empire” thing got summed up best in Jedi: Survivor’s opening mission.\n\nCal: “Any spaceports nearby that won’t turn us in for a reward?”\n\nBD-1: *sad boop*\n\nThey then head for the outer rim, which, if you’ve seen the galactic map, is a stupidly long haul to make in a damaged ship considering they were leaving Coruscant.",
                                    "score": 10,
                                    "author": "Nathan_Thorn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not all Jedi were leaving from the temple, though.",
                                            "score": 3,
                                            "author": "eli7097"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Star Wars is a weird mix of technology that isn't logically explainable. For example, during Rebels, they wandered freely from planet to planet and no one seemed to ever recognize them. Same for the Bad Batch. Sure wouldn't happen in China today! Or even the UK. Too many cameras everywhere, and some now running facial recognition software. Then we have Andor getting arrested and processed and shipped to a prison but apparently no one compares fingerprints or DNA over a security network or anything since ISB is searching for him everywhere but doesn't get notified.  And people land and fly off of planets everywhere with no customs checks.",
                                            "score": 3,
                                            "author": "Own_Carrot_7040"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree people may just be tired of seeing it used as a plot device to create villains. I guess I just don’t have a problem with it cause it feels realistic to me and the survivors aren’t all fueled by the same motives\n\nBut I can see how people would like to see other types of villains, considering there are other types of force users, mercenaries, crime syndicates etc. I think Thrawn may help people feel this though",
                    "score": 49,
                    "author": "lasershow77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed! To me it reads the unfortunate side effect of:\n\n reviving/\"surviving\" an existing character is \"safe\" in that it avoids the hazard of \"the entire entrenched community hates your new character because it inevitably falls short of their vision of the exact scope of the star wars universe they developed in their formative years\" or what I like to call \"Asoka syndrome\". \n\nTo be fair, some totally new characters survive and thrive, but it is definitely a gamble, and gambling with cash cows isn't something Disney likes much. \n\nIf you want to take it even further, introducing new varieties of force users, new/different social or philosophical approaches to the universe, etc then you play the same game but with even higher stakes. \n\nIronically, it is the very fandom itself whose ideological inertial is keeping the cannon in the very cameo/rehash of plot and players that they claim to detest. Because truely new is held to such a oppressive scrutiny.\n\nInterestingly:  Filoni started out bucking this trend, hell he even designed Asoka on purpose to play the Asoka Syndrome against itself. But as his works transitioned from \"filler kid cartoons shows\" running on back burners to him falling under the full and direct Eye of Disney's gaze, you can see the dulling and middling and rounding off happen in real time.",
                            "score": 10,
                            "author": "pseudonymous_cypher"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man, I can’t even count straight.  Obi-Wan, Yoda, Kanan, Ahsoka, Cal, Cere, Grogu…and who else? Cause I know if we’re talking comics I could could Quinlin and Oppo Rancics, but like who else is onscreen that survived?",
                    "score": 7,
                    "author": "Bobjoejj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'ma be straight with ya: I didn't have the confidence to claim any specific number cause if I did it would be wrong.  So I went with 10 since it made the \"99.9% effectiveness\" joke best.",
                            "score": 16,
                            "author": "pseudonymous_cypher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "…hahahaha, that’s good man! Fair enough, heh fuck.  Neat.  I appreciate some honesty on Reddit.  Fucking great.",
                                    "score": 9,
                                    "author": "Bobjoejj"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Quinlan is a canon survivor now - he was mentioned in Kenobi and in Jedi Survivor.",
                            "score": 14,
                            "author": "Ducky_McShwaggins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol don’t get me wrong, I absolutely still consider the comics Canon.\n\nI was just saying what I said in reference to the previous comment mentioning on-screen survivors.  Though I’ll admit I forget the mention of Quinlin in Kenobi for a second there, but where was he mentored in Jedi Survivor? I definitely must’ve missed that one.",
                                    "score": 3,
                                    "author": "Bobjoejj"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Eno Cordova also a Jedi (who you think is probably dead in Jedi Fallen Order) turns out to be alive in Jedi Survivor.  I guess, technically Dagan Gera as well.\n\nAlso who knows With Shaak Ti.  She's died in so many different ways in different Star Wars mediums, maybe the uno reverse card comes out and she's actually still alive in some future star wars content.",
                            "score": 2,
                            "author": "Highlander198116",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I don’t think order 66 meant “we have literally all Jedi on sight at this moment, kill them now” but more like “begin hunting Jedi and kill on sight” so Jedi are actively hunted and they know there are survivors out there.",
                    "score": 7,
                    "author": "Jeremithiandiah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, if they had killed all of the jedi on sight during order 66, they wouldn't have needed groups like the inquisitors.",
                            "score": 2,
                            "author": "nagrom7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Surviving jedi being the 0.1% of bacteria",
                    "score": 4,
                    "author": "ebagdrofk"
                },
                {
                    "level": 1,
                    "comment": "What I don't buy is that there are 10 jedi and half of them have major roles in the galactic political situation, including those killed by inquisitors and the inquisitors themselves, yet by 0 BBY everyone thinks the jedi are a myth",
                    "score": 17,
                    "author": "Mundane-Carpet-5324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The myth thing is something I've thought over quite a bit.  A comment I saw a while back helped me justify it for myself: \n\nI have never met a Ugandan person. I know *of* them, but never really known one.  There are 45million Ugandans, and they live on the same planet as me. \n\nBlow that up to a galactic scale, and 10,000 is insurmountably tiny. The republic had something like 1.3 *million planets* in it. The separatists 40 thousand.  Assuming even only 10% of the republican systems being \"true members\" that's still 130,000 planets, or 13x more planets than all Jedi in the order.  There is a *very* small likelihood that the majority of people not living on Corescant ever met a Jedi or even know anyone who did. The only real people to deal with them would be criminals or politicians, both of those populations didn't fare so well when the Empire steamrolled in. \n\nAdd to that the social and psychological power of the Empire and yeah, I can see it.",
                            "score": 37,
                            "author": "pseudonymous_cypher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. People aren’t really visualizing the numbers we’re dealing with here and how they relate to the average individual. 10,000 out of trillions in the galaxy is already a minuscule figure. When the Jedi were in full force (no pun intended), most people in the galaxy wouldn’t have been aware of their existence let alone when only 10 or even 100 of them were left after the purge.",
                                    "score": 21,
                                    "author": "prince-azor-ahai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And for those who even heard about Jedi, 20 years doesn't seem like long, but consider this: \n\nWhat would you say if someone asked you \"do you remember the locus swarms in Africa?\" Or maybe \"who were the brothers flub?\" You could easily convince someone those are made up things.",
                                            "score": 13,
                                            "author": "pseudonymous_cypher"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also consider that most people, like Han in ANH, do believe the Jedi existed, they just don't believe in the force. The only exception who straight up never knew the jedis (at least that I can think of) is Din, but since he was brought up in an isolationist cult that's pretty much a given",
                                    "score": 2,
                                    "author": "_Cit"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"magic space wizards\"  also another thing that should be taken out in a purge",
                    "score": 4,
                    "author": "SimplyTheJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there weren’t survivors, having inquisitors would be pretty pointless",
            "score": 118,
            "author": "Cyberdog1983",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean those guys invented after they already established many, many Jedi survived? That’s circular logic.",
                    "score": 38,
                    "author": "estofaulty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Weren’t they invented for Rebels, just as Disney was wiping the board clean from what is now Legends canon? So yeah, Rebels established both at the same time: *some* Jedi survived, and there’s imperial Inquisitors that go around hunting them.",
                            "score": 19,
                            "author": "Brainth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Inquisitors were a thing in legends too.",
                                    "score": 9,
                                    "author": "nagrom7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea and forced unleashed starkillers who role was to hunt down the jedi holdouts",
                                            "score": 3,
                                            "author": "PeterSchnapkins"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yep, Mara Jade, Luke’s wife in Legends, was one originally.",
                                            "score": 3,
                                            "author": "UnadvisedGoose",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She was something a little different than an inquisitor, she was an \"Emperor's hand\", basically his personal assassin/force user that the Emperor used whenever he needed someone a bit stronger than an Inquisitor to fuck shit up. She basically did similar kinds of jobs that Vader would be sent to do personally, which often put them both (along with the other Emperor's hands) in direct competition for the Emperor's favour and attention.",
                                                    "score": 4,
                                                    "author": "nagrom7",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe because even if there are many, they dont need to be featured in every single piece of media. They should be very scattered around the galaxy, a lot of them hiding their identity right?\n\nThe  other thing is, with Luke becoming a new hope, and what felt like one of their last hopes, him being one single Jedi was already powerful enough to threaten the empire. That makes us think, why dont the 100 surviving Jedi just band together and take down the emperor then?",
            "score": 16,
            "author": "boredprot",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;That makes us think, why dont the 100 surviving Jedi just band together and take down the emperor then?\n\nThis is what happens when you turn on your brain.  You start saying things that make sense.",
                    "score": 5,
                    "author": "SimplyTheJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The purge isn't what wiped out the Jedi. The following hunt did.\n\nVader was very busy for quite a few years tracking down the survivors.",
            "score": 15,
            "author": "InsomniaticWanderer",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is almost like that was actual dialogue in the very first Star Wars movie ever.",
                    "score": 4,
                    "author": "SimplyTheJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Star Wars fans tend to take in-universe dialogue very literally. Tarkin said they are extinct, and Yoda said Luke will be the last one. To them, anything to the contrary becomes a retcon, because Tarkin and Yoda being unreliable narrators is not considered. \n\nThis is a funny thing in the Star Wars fandom that you can see extend elsewhere too. When Prime Minister Almec said Jango Fett wasn’t a Mandalorian, he said this as a secret member of Death Watch, within the pacifistic Mandalorian government, publicly distancing himself from association with a violent, rogue Mandalorian. That didn’t matter, though. A character said Jango Fett isn’t a Mandalorian, so to the fans, he suddenly wasn’t a Mandalorian, and this has led to years of arguments and video essays about how he his or isn’t a Mandalorian and how this was it wasn’t retconned. Almec being the most untrustworthy source of this information possible didn’t matter; he is a Star Wars character, and he said something.\n\nAnother funny one is one book back in the Legends EU where Han lamented that Leia was too busy helping out the Whoevers on Planet Whatsit. (I’m remembering those names wrong.) Wookieepedia users have been fighting ever since on whether the page for that planet should exist or not, because while it was clearly Han being sarcastic and flippant, many fans take this to mean he was legitimately talking about a planet and a species with those names. A Star Wars character said something, therefore—according to many fans—it must be 100% true and anything to the contrary is a retcon.\n\nI could keep listing more examples of fans taking in-universe words of characters too literally all day. In this case, the fact that some people have said in-universe that the Jedi are all gone makes some fans really confused to learn they’re not all gone. It makes them feel like something is wrong. What it really is, is some people survived the Purge, and some characters may believe they are all dead. Others may technically consider those survivors to be former Jedi, but Jedi no longer, what with the fall of their order and their choices to remain hidden rather than live their lives as Jedi. I personally feel like this is Yoda’s take. Even if there are other survivors out there, the nature of the galaxy means they cannot function as Jedi anymore, and therefore there are no more Jedi. Luke was training to be an active Jedi, making him ostensibly the only one in the galaxy.",
            "score": 12,
            "author": "KaimeiJay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Telling Luke he's the last to get him to help Vs telling him he might be, who knows, the guy asking has been hiding out in a swamp for decades after getting his ass whooped.\n\nYup, no idea why he'd do that.\n\nAlthough as grandmaster and entire Jedi council, Yoda might also just low key be telling Luke that the mantle of the order is now his to do with as he chooses, since Yoda fucked it royally up.",
                    "score": 5,
                    "author": "Captain-Griffen"
                },
                {
                    "level": 1,
                    "comment": "It could also be that Yoda simply couldn't sense them.\n\nWhich... certainly is a bit of a weird explanation considering how Yoda is one of the strongest force users in-universe but it might be possible. Though this is not confirmed in canon so this is more of a personal theory I guess",
                    "score": 2,
                    "author": "Handsome_italian2005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean he couldn’t tell the Sith Lord big bad was hanging out with him, sipping tea exchanging, notes for years - he’s clouded from the force by the dark side from his own words, who knows if he was available to free that up, just a theory too!",
                            "score": 5,
                            "author": "whereisdani_r"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"When gone I am, the last of the Jedi you will be.\"\n\nWhen the ancient master straight up says that there are no other Jedi left in the galaxy, a lot of people are going to assume that means there are no other Jedi left in the galaxy.\n\nClearly a lot changed since the original trilogy, but it sure seems that the intention at the time was that there were no other Jedi.",
            "score": 182,
            "author": "DarthCredence",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a reasonable assumption to make when nearly 20 years have passed and there is a full blown rebellion going on against the Empire that destroyed the order, and yet no Jedi came out of the woodworks (except Ahsoka in the current canon I guess, but you could then argue that neither herself nor Yoda considered her a Jedi at that point).\n\nI think it's fair for Yoda to assume at that point that every survivor either died, turned to the dark side, or wasn't interested in fighting anymore and just lived a normal life somewhere.",
                    "score": 8,
                    "author": "TolarianDropout0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; except Ahsoka in the current canon I guess, but you could then argue that neither herself nor Yoda considered her a Jedi at that point\n\nAlso Ahsoka went missing a couple years before Episode IV, and it's assumed (although not confirmed either way) that she didn't re-emerge until after the events of the OT at the very least.",
                            "score": 3,
                            "author": "nagrom7",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not like Yoda or Obi wan didn't lie to him before though. They needed him to fight Vader and keep him on track somehow.\n\nAlso most of the survivors introduced so far I feel have pretty convincing stories",
                    "score": 54,
                    "author": "Count_de_Mits",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, and Yoda isn't omnipotent. Yeah, he can feel in the force when big bad shit is happening, like order 66, but A) he was oblivious to Palpatine's entire rise and B) he hid out in a hut in a swamp and probably wasn't getting hourly updates from all remaining Jedi survivors.\n\nAlso, us as viewers gradually learning that more Jedi had survived feels more real. It would probably be how Luke felt, since Obi wan and Yoda presumed he was one of the last ones, as he explored the galaxy post-ROTJ.",
                            "score": 5,
                            "author": "mell0_jell0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yoda is painted as pretty orthodox. Pretty sure almost none of the \"jedi\" we've seen are actual jedi. Either they were a padawan, and there's no more order to knight them, or they were a youngling, or straight up were trained after the order no longer existed.\n\nThat is entirely within the meaning of Yoda's words, and doesnn't exclude jedi-aligned force users.",
                    "score": 87,
                    "author": "Ilien",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But by the same token, Luke is no jedi by order standards. Yoda complained, but he did train Luke, and he was fast and loose with the training by order standards.",
                            "score": 33,
                            "author": "Mundane-Carpet-5324"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Pretty sure almost none of the \"jedi\" we've seen are actual jedi.\n\nConsider the surviving Jedi at that point. Ahsoka has left the order and would refuse to rejoin it even if offered. Both Cal and Kanan forsake the \"no attachments\" rule and both believe the restricting dogma of the Jedi teachings no longer have a place in a post republic galaxy. Grogu at the time was incapable of being a \"Jedi\" in the traditional sense, having chosen to not be so out of fear and trauma. Even Yoda doesn't believe that Luke is a good Jedi, as he leaves Degoba to save his friends over staying to train as a Jedi for the \"greater good\".\n\nIf there's any other Jedi, they're too deep in hiding, like Obiwan and Yoda were, to be useful Jedi and to overthrow the Empire.",
                            "score": 16,
                            "author": "ciknay",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "the thing is though we have to try to interpret yoda's words in such a manner as to avoid the plain meaning of his remark. which ofc is understandable because at the time of the ot, george lucas probably meant to have yoda mean it literally but now with things like rebels and jedi fallen order &amp; survivor, etc. yoda's words have to take on with another meaning so as to facilitate cohesion.",
                            "score": 3,
                            "author": "darwin-incarnate2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Well if words don’t mean anything sure. Let’s build a new Death Star for every show/movie and unlimited “chosen ones”",
                            "score": 9,
                            "author": "Pudding_Hero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Words can have more than one meaning and have to be interpreted.",
                                    "score": 5,
                                    "author": "Ilien"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Originally yeah but I think it's pretty clear that isn't true at this point and this can easily be explained away as the Jedi as Yoda knew them are no more.",
                    "score": 27,
                    "author": "NotaVortex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or even just that Yoda isn't omniscient and is unaware that some may still be in hiding.",
                            "score": 52,
                            "author": "N0V0w3ls",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even with both like. That line is AFTER Luke returned to train with him. He's either the most recent one wirh official training by a jedi master, or the very least the last one truly fighting the good fight. \n\nPersonally I'm fine with survivors being around. What's the point of the inquisitors If there's. Ot enough survivors to warrant a kill squad",
                                    "score": 28,
                                    "author": "JayJ9Nine"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The distilled answer to this post's question, I think, is that the notion of the Jedi being extinct save for the ones we meet was the original story, well-established in films that sat in a place of cultural awareness for 15+ years.\n\nInformation on how many Jedi there were, and how recently they were turned on, that all came much later.",
                            "score": 3,
                            "author": "wooltab"
                        },
                        {
                            "level": 2,
                            "comment": "Yoda was the guy who was okay with booting Ahsoka out of the order and then executing her because she was guilty of treason, right? Also had no idea Dooku was a sith, much less Palpatine.\n\nI think we can safely discard the idea that he is an all-knowing being.",
                            "score": 8,
                            "author": "Own_Carrot_7040",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The last of anything can still be a number larger than 10 given context.",
                    "score": 3,
                    "author": "prince-azor-ahai"
                },
                {
                    "level": 1,
                    "comment": "He says this as he has knowledge of Leia’s existence. Official Jedi vs. force sensitive. The rate of force sensitive people appearing in the galaxy shouldn’t have been affected by order 66, there just wasn’t anywhere for them to be trained. By the time the empire falls you have to have at least 100 fully grown force sensitive individuals who have never seen the temple not to mention any padawans/knights who manage to stay off the radar.",
                    "score": 2,
                    "author": "AngeluvDeath"
                },
                {
                    "level": 1,
                    "comment": "I've always seen that as the last remnant of the Jedi Order in its goals, traditions, customs etc, not the last surviving former Jedi, the last surviving CURRENT jedi.",
                    "score": 2,
                    "author": "RideShinyAndChrome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To add more fuel to this fire: the old Star Wars Radio Dramas weigh in on this too and unequivocally state that the Jedi aren't all dead, they're just in hiding, trying to do what they can for who they can in this new world the Empire's created.  For those who've never heard them, these radio plays adapted the original trilogy and expanded on their story significantly at points.  They're also the only non-movie Star Wars media that Lucas explicitly declared to be 100% canon (I realize that doesn't mean anything now in the Disney age, but it does demonstrate how closely connected it was to the original material).  Worth tracking down and listening to them if you can find them.\n\nBack then, at least, it seems the status quo was that there were at least a handful Jedi survivors out there on the run, they were just doing their thing covertly and secretively, living in shadows and staying on the move.  They weren't *organized* any more, is the point; they weren't an *order.*  They were just hermits and wanderers like Ben.  Which fits really well with the idea that Jedi are thought of as relics by Imperial society.  Honestly I like this take a lot because it basically puts the Jedi in the same position the Sith had been in pre-Clone Wars.\n\n(Incidentally there are other fun little nuggets sprinkled through these radio plays.  Luke's quick training sessions with Ben aboard the Falcon while they're in transit to Alderaan, for example, have some neat extra dialogue where Luke describes the sensation of swinging a lightsaber; apparently they feel \"alive\" and almost have a mind of their own, it's difficult to get one swinging in the direction you want until you learn to work with it instead of fight it.)",
            "score": 8,
            "author": "JahnnDraegos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Because the Original Trilogy made it a big ass deal that Luke was supposed to be the last one. That's pretty much it.",
            "score": 66,
            "author": "Vox_Mortem",
            "replies": [
                {
                    "level": 1,
                    "comment": "So the TLDW for Star Wars left those parts out.",
                    "score": 2,
                    "author": "SimplyTheJester"
                },
                {
                    "level": 1,
                    "comment": "Bro, yea Yoda does say “last of the jedi it makes you” or whatever but he also said “another there is” so calm down because not even George Lucas himself had any of this shit planned out",
                    "score": 7,
                    "author": "peachorchad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yoda says there is another hope, not another Jedi.\n\nEven in current canon, Luke does seem to be the last of the Jedi once Yoda departed. \"Jedi\" and \"light side force user\" aren't synonyms.",
                            "score": 5,
                            "author": "Captain-Griffen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or at least the last that Yoda could sense. But even as old and venerable as Yoda was, he was not infallible. And there are areas beyond the outer rim that even Yoda could not sense.",
                                    "score": 2,
                                    "author": "Vox_Mortem"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think for some people at least, they don't like more survivors showing up because it makes Luke less special as he's not unique anymore.",
            "score": 8,
            "author": "Salarian_American",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I dont think having so many  Jedi in the TV shows would be such an issue if the worlds didn't feel so similar. It's always generic sand planet, generic village, or generic bar in these movies and it makes the scope of the entire series look so small. I wouldn't mind some more Jedi stories, but Jedi Vs The Empire is getting boring. It's the same story in a different font every time.",
            "score": 6,
            "author": "Evening_Ingenuity_27"
        },
        {
            "level": 0,
            "comment": "That's 10,000 around the time TPM. The Clone Wars thins their numbers even before Order 66.",
            "score": 23,
            "author": "Jo3K3rr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heck, they lose, like, 100 Jedi in the battle of geonosis alone.",
                    "score": 9,
                    "author": "BOBULANCE"
                },
                {
                    "level": 1,
                    "comment": "Excellent point.  A 3 year attrition.  Almost like there was some mastermind planning and executing it to perfection.",
                    "score": 3,
                    "author": "SimplyTheJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s list out some survivors: \n\nYoda\n\nObi-Wan Kenobi\n\nAhsoka Tano\n\nOppo Rancis\n\nCal Kestis\n\nCere Junda\n\nEno Cordova\n\nCaleb Dume\n\nEeth Koth\n\nTaron Malicos\n\nBode Akuna\n\nLuminara Unduli\n\nKelleran Beq\n\nGrogu\n\nJocasta Nu\n\nNari\n\nGungi\n\nThose numbers are less than 50, we haven’t seen more survivors so far",
            "score": 5,
            "author": "HeyItsStevenField",
            "replies": [
                {
                    "level": 1,
                    "comment": "And out of those, I’m pretty sure only Yoda, Obi-Wan, Ahsoka, and Grogu are confirmed to be alive by the time of A New Hope.",
                    "score": 5,
                    "author": "ApprehensiveAmoeba95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because the OT had multiple characters refer to the Jedi Order being wiped out...\n\n* Tarkin says to Vader \"You, my friend, are all that's left of their religion\"\n* Obi Wan tells Luke that Vader \"Helped the Empire hunt down and destroy the Jedi Knights\"\n* Yoda tells Luke \"When gone am I, the last of the Jedi will you be.\"\n\n&amp;#x200B;\n\nSo, from the beginning of the franchise and canon, the story is meant to lead the viewer to believe that the Jedi are long gone, that Luke getting trained as a Jedi isn't just to defeat the Empire but to give birth to a new generation of Jedi. \n\nNow, as far as I'm concerned, none of these necessarily mean that more Jedi couldn't have survived  Order 66. At the time those characters made those statements, Order 66 wasn't a thing. I don't know if Lucas himself had ever elaborated on how the Jedi were wiped out before the Prequel Trilogy showed Order 66. These statements can easily be interpreted multiple ways and supported by the statements and actions of the characters\n\nHowever, it doesn't bother me that a few more Jedi have survived because there's myriad reasons those characters statements can be incorrect. \n\nTarkin, for all his knowledge, didn't even believe Obi Wan was alive to begin with. If Obi Wan was alive, that opens the door for more Jedi to be alive. Tarkin was, by that point, essentially running the Empire and answered only to the Emperor himself. There's no reason to think Tarkin would've been informed of every possible Jedi survivor when....\n\nVader himself was tasked with hunting down the Jedi with the Inquisitorius. Any Jedi capable of evading Vader, the ISB, the Inquisitorius would've been hunkered down deep. Vader himself tells the Moffs \"the ability to destroy a planet is insignificant next to the power of the Force\". Obi Wan tells Luke \"The Force is what gives a Jedi his power\". If the Force is that strong, then it follows those who wield it would be considerably strong as well and capable of eluding the Empire. \n\nObi Wan telling Luke that Vader and the Empire destroyed the Jedi Knights doesn't eliminate the possibility of survivors just because his statement doesn't have to be literal. It was taken that way for decades after the original movie released but there's nothing stopping it  from just meaning the organization of Jedi Knights, not inherently every single Jedi\n\nYoda telling Luke that Luke was the last Jedi could've easily been a bit of motivational fibbing to push Luke to confront Vader. Just seconds later, Obi Wan gives Luke the little \"certain point of view\" spiel. It's entirely possible that Yoda, on his deathbed, is giving Luke a little push by making Luke think everything rides on Luke....which it largely does as Luke really was the only one who could've beaten Vader. Even Leia wasn't a great choice because she didn't have the training or insight Luke did",
            "score": 5,
            "author": "xEllimistx"
        },
        {
            "level": 0,
            "comment": "I guess it's a tired concept. Yea 10000 Jedi existed before but only maybe a hundred or so are named. When half of the named ones are survivors it just comes off as odd. \n\nIt's also sold to us in Rots that obi and Yoda were the last big named Jedi to live and the rest were stragglers. The whole order 66 scene is trying to show the council and people of importance being wiped out. Yet many Jedi who end up being instrumental live.\n\nIt's just the same story over and over. Jedi survives, Jedi doesn't want to use force, Jedi reluctantly does, become connected with the rebel cause, leads rebels but is somehow always missing at key battles in the OT \n\nIt's old, it's too easy, it comes off as unoriginal when it's meant to be obi and Yoda's survival and not another couple hundred",
            "score": 5,
            "author": "Zedtomb"
        },
        {
            "level": 0,
            "comment": "While it contradicts the OT, it also makes sense. It always bugged me how come Order 66 seemed so absolute after Episode 3, considering the Order had around 10 000 members. That would imply Sidious knew the location of every single one, and that they were all either at the Temple or leading clone troopers at the same moment.\n\nIt was a given a few hundred might have been off doing other things, and after Vader and the Inquisitors their numbers were thinned down to the protagonists of recent media.\n\nIf anything, the problem comes in the ST. Sure, they might have stayed hidden during the Empire, but how come they didn't reach out to Luke when he started rebuilding the Order? Rey's next movie hopefully elaborates on that, because those same Jedi probably left students and/or children after them.",
            "score": 18,
            "author": "Pr0Meister",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;While it contradicts the OT, it also makes sense. It always bugged me how come Order 66 seemed so absolute after Episode 3, considering the Order had around 10 000 members. That would imply Sidious knew the location of every single one, and that they were all either at the Temple or leading clone troopers at the same moment.\n\nWell Palpatine controlled the government they reported to, and had Anakin spying on the Council for him, so he definitely had access to the locations of the vast majority of Jedi. I'm sure some weren't where they were supposed to be and hadn't reported their whereabouts, but that wouldn't be very many. He also set up an emergency beacon telling any surviving Jedi to return to the temple on Coruscant, where they'd be trapped and killed. And he had the Empire searching for any survivors. And he had Vader and the Inquisitors hunting them as well. And he and Vader and the Inquisitors can literally sense where they are. Plus, A New Hope is almost 20 years after Order 66. That's a lot of time for Palpatine to track down any survivors.",
                    "score": 3,
                    "author": "Abobalagoogy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My issue isn’t so much that they have surviving Jedi, it’s that all the surviving Jedi seem to somehow meet up in the same story arc.\n\nGive me a random Jedi on the other side of the galaxy who is in complete isolation and focus on his/her adventures",
            "score": 4,
            "author": "Snck_Pck",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Star Wars Is a mess. You guys r just debating over bad writing",
            "score": 4,
            "author": "ollyoctopuss",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah every debate in star wars can be summarized with this",
                    "score": 2,
                    "author": "kntdaman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it's a combination of factors. \n\nFirst, there's the OT that really makes it seem like the Jedi we see are essentially the only ones left.\n\nThen there's the prequel trilogy, that never does a great job showing the scope of the Jedi Order. The Jedi Temple is big, but it tends to not seem bustling or crowded. The stories we've seen don't show many Jedi who are just out there in the galaxy. The war appeared to take most of their manpower, so within  RotS, it feels like the vast majority of the jedi were either at the temple or stationed with clone troopers who turned on them.\n\nPersonally, I can reconcile all that and I don't hate that there are survivors. My issue is in how they're used. Too many seem to play similar roles. The broad strokes of Cal Kestis's backstory and role fighting the Empire are pretty similar to Kanan. Ezra Bridger as an apprentice learning the ways of the force while fighting the Empire is pretty Luke-like. Yet with all of these heroes, while they're treated as the central, special heroes of their respective stories, there's a ceiling for the amount of impact they have. Not only are they not incorporated into the story of the OT, they're not even mentioned. \n\nIt creates this dissonance where they're sort of retroactively meant to all be big deal characters, but they can't be *too* big a deal. Then they have to either be killed off before ANH or have a somewhat contrived reason as to why there were not more involved during the OT conflict. Ezra was carried off by magic hyperspace whales. Ahsoka was in the World Between World or who-knows-where. And I love Ahsoka, but it's a bit contrived.\n\nI'd like to see more variety in the paths for the surviving jedi. Not all of them have great destinies. Let's see a jedi who reconnects with a family member they haven't seen since infancy and has to come to terms with the relationship that never develops. Let's see a jedi who falls in love with someone and struggles with hiding their past and forming a kind of bond they never learned to within the order. Let's see a disillusioned jedi that becomes a bounty hunter or a professional podracer. Just give me some complex, varied people who don't end up fighting the good fight",
            "score": 8,
            "author": "BIGBMH"
        },
        {
            "level": 0,
            "comment": "I think the big issue is that over the past 5-10 years we have been bombarded with content about Jedi who have survived the purge a lot of said content being the more mainstream content, this has (at least in my opinion) really made it *feel* like there have been too many Order 66 survivors when in reality there isn't. The constant reliance on using the post Order 66 to ROTJ era and mainly focusing on different Jedi really makes it feel like way too many have survived and in turn makes the universe feel smaller than it should. \n\nIt also doesn't help that we haven't really seen many Jedi who just fully quit being a Jedi post Order 66 they always either partially do and rejoin the fight eventually or never left the fight making a lot of post Order 66 Jedi stories feeling a bit too similar to one another.",
            "score": 34,
            "author": "True_Statement_lol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Counterpoint...\n\nA tv show about a Jedi who throws his lightsaber out and becomes a meat packer in the desert....and DOESNT ever do anything Jedi like again isn't exactly prime time content.",
                    "score": 23,
                    "author": "tmssmt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good writers could definitely make a good story out of a Jedi who decides to move on from the Order.",
                            "score": 13,
                            "author": "True_Statement_lol"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s too much content of Jedis surviving the purge in a short time frame. If the content was more spaced out, I don’t believe this problem would be talked about.",
                    "score": 6,
                    "author": "OxelKJ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree that it makes logical sense, absolutely, but I think for some people it's just being overused as a storytelling device. Me personally, I'll wait to see how they utilize it, but I don't blame people for wanting to see something different.",
            "score": 3,
            "author": "gleamingcobra"
        },
        {
            "level": 0,
            "comment": "I cannot speak for anybody else, but my problem was not that Jedi survived, that would make sense, it's that the surviving Jedi we see are always running around doing things that would attract the attention of the empire-these are the exact type of Jedi that should be quickly meeting their end at the hands of Inquisitors. Whereas you'd expect the ones who continue to survive to be the ones who, like Yoda and Obi Wan (well, before the Kenobi show), keep an exceedingly low profile. The reason someone like Tarkin can say the Jedi are extinct doesn't have to be because the Jedi are actually extinct but because the only Jedi around might as well not exist, because they have to keep their head down to not get noticed.",
            "score": 3,
            "author": "slydessertfox"
        },
        {
            "level": 0,
            "comment": "I don't have an issue with there being survivors in small-ish numbers.  I guess it's just becoming a lazy way for Lucasfilm to write all their character, especially the villains.\n\nBut that's just me.",
            "score": 3,
            "author": "OhShitItsSeth"
        },
        {
            "level": 0,
            "comment": "As a sequel non-enjoyer, I have no problem with it. A few hundred Jedi living makes sense to me. And create impetus for the inquisitor story of hunting them down.",
            "score": 3,
            "author": "obi318",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel like the difference between the narrative and realism is part of the issue. Realistically, it makes perfect sense that many Jedi survived and focusing on their stories is valid for new shows, movies, etc.\n\nBut narratively, the OT and RotS make it clear that Obi-wan and Yoda were the last of the Jedi. So more and more Jedi surviving can feel like narrative cheating just so they can make more stories.\n\nPersonaly, I love being able to see more stories about Jedi in the era of the empire, but I also understand the urge to roll your eyes every time we learn about another surviving Jedi.",
            "score": 3,
            "author": "ProfessionalOven2311",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“Wipe them out…. Most of the them”",
            "score": 3,
            "author": "VonWiggle"
        },
        {
            "level": 0,
            "comment": "Because of what Yoda said to Luke: \n\n\"*When gone am I, the last of the Jedi will you be...*\"",
            "score": 3,
            "author": "CryHavoc3000",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes, it makes logical and mathematical sense for there to still be a relatively large number of Jedi still around, but from a storytelling point of view, each new Jedi that pops up really undermines the effect the Jedi Purge had on the overarching story.",
            "score": 3,
            "author": "TMachine97"
        },
        {
            "level": 0,
            "comment": "Cause it’s a lazy thing to keep doing over and over again.",
            "score": 3,
            "author": "hallvard25"
        },
        {
            "level": 0,
            "comment": "The only problem I have with consistently showing us more Jedi surviving The Purge is that why they wouldn’t help Luke rebuild the Jedi Order and/or helping him fight the Empire",
            "score": 3,
            "author": "captainalvin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The problem is that it's a tired trope. Plus, it's a continuation of a terrible trend in SW and that's the inability to make a story without jedi being central to it.\n\nThe original trilogy didn't feature jedi that much. And the Empire era was always supposed to be mostly jedi-free and about people fighting for freedom under oppression. But we keep getting new and new jedi survivors and inquisitors.\n\nReally, only Andor and Rogue One did it right",
            "score": 25,
            "author": "TheIronCount",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean Jedi is what got Star Wars where it is. \n\nMagic space wizards with giant glow sticks of death. Children all over the world loved it",
                    "score": 12,
                    "author": "C92203605",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Solo and Book of Boba Fett are crying in the corner. And the Jedi youngling in the Mandalorian is really just a side character who barely does any Jedi things so I don’t really count that show",
                    "score": 15,
                    "author": "AFCRichmondKitman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bad Batch rarely shows any Jedi. I think we've only seen one since the pilot.",
                            "score": 12,
                            "author": "BIGBMH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't forget the wookie. I think it's safe to mention him since he was in the S2 trailer",
                                    "score": 3,
                                    "author": "tmssmt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s the one I was referring to that has appeared since the pilot",
                                            "score": 5,
                                            "author": "BIGBMH",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gotcha, I misunderstood and thought you were saying kanan was the only one",
                                                    "score": 2,
                                                    "author": "tmssmt"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Luke was in Mando, as was Ahsoka",
                            "score": 5,
                            "author": "tmssmt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But the Jedi weren’t central to it which was what the comment was saying. Ahsoka got a single episode as a guest star and Luke was only in it for a couple of minutes. And that’s a season where the Jedi actually were technically part of the plot. \n\nThe Jedi are such an integral part of the history of the Star Wars universe that of course there will at least be references in everything. Even Andor references the culture by showing kyber crystals and the holocrons. The force is the most iconic part of the entire franchise and it would be unrealistic to at least not mention it once in a show.",
                                    "score": 11,
                                    "author": "AFCRichmondKitman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's fine, they just referenced grogu and dismissed him, so I wanted to point out the other Jedi in the show. I'm well aware they don't get a ton of screen time. Lukes couple minutes though was the main topic of conversation around season 2 though, so pretty big bang for the buck I suppose.",
                                            "score": 2,
                                            "author": "tmssmt"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "True that. I really loved the first season of Mando because of how grounded it was. I completely forgot about Solo, lol",
                            "score": 3,
                            "author": "TheIronCount"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; it's a continuation of a terrible trend in SW and that's the inability to make a story without jedi being central to it.\n\nRogue One/Andor disagrees.  But it's obviously a very good outlier.",
                    "score": 2,
                    "author": "Pete_Iredale"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The main issue is the usual Lucas one: in the original series, it is clearly stated that Obi-Wan and Yoda are the last two Jedi. There’s no weasel wording, no wiggle room: just a bald and plain statement. Even with all the rewrites, special editions, and rereleases; this dialogue is not changed. So, if the last two Jedi, who are both sensitive enough in the force that they can sense Anakin’s grief over his mother from across the galaxy, couldn’t sense any other survivors; where do they keep coming from?",
            "score": 18,
            "author": "TheODPsupreme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also the ability to sense things through the force seems to be hazy and narrative driven in the movies. You could argue that being able to sense a anakin’s grief comes as much through their power in the force as much as it does their relationship with him. It’s entirely possible that as far as yoda and kenobi know, they are the last Jedi, either jedi in the literal sense of the word, or for as far as they know they are the only survivors.\n\nAlso a number of stories, if not all, of surviving jedi have come from the time between episode 3 and 4, it is also entirely possible, and we see it in a number of games, that it takes longer than the immediate instigation of order 66 for the Jedi to be killed. All through a number of series and content we see the empire hunting down jedi and killing them or converting them. It is also possible that by the OT, the majority of those that survived the initial massacre have been hunted down and killed or converted.\n\nFor example, in the Jedi games, we meet, I think 7 jedi who have survived, two were converted to inquisitors, one hid on dathomir, one is the main character, one is a rebel, one is in a convent, and one hid from the empire before being captured and joining the empire to save himself. At the end of the second game, Cal, the main character is the only one alive.",
                    "score": 9,
                    "author": "runkitty85"
                },
                {
                    "level": 1,
                    "comment": "Counterpoint, Anakin has the most force potential, the future of the Galaxy was tied up with him, and at least obi wan had very strong connections to Anakin...so it makes sense for them to sense things related to him, more than say....kanan",
                    "score": 8,
                    "author": "tmssmt"
                },
                {
                    "level": 1,
                    "comment": "They’re the last two Jedi, but a lot of force users don’t consider themselves Jedi anymore",
                    "score": 13,
                    "author": "Cooliomendez88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's really just lawyering",
                            "score": 14,
                            "author": "TheIronCount",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lawyering like “its true, from a certain point of view.” 😂",
                                    "score": 16,
                                    "author": "Agitated-Cobbler9480"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Kanan was only a Padawan, eventually Knighted by Yoda in a vision.\n\nEzra is a Padawan, at best. No one to knight him, anyway.\n\nSame for Cal.\n\nGrogu was a youngling.\n\nAhsoka got kicked out, and later rejected coming back.\n\nWe know a bunch of jedi turned Inquisitors, or were hunted down by those who did.",
                            "score": 5,
                            "author": "Ilien",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wasn’t Cal knighted by Cere in FO?",
                                    "score": 11,
                                    "author": "FreeRangeToeCheese",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People like to be mad at star wars",
            "score": 12,
            "author": "Jahmez142",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly this is the best answer. Some things are just really fun. Star Wars is one of those things.",
                    "score": 2,
                    "author": "huntershilling",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because you begin to question what the jedi survivors were doing during the OT. Where were they during the battle of Yavin? The Battle of Hoth? The Battle of Endor?",
            "score": 5,
            "author": "tatooine0",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not to get too morbid on a Star Wars sub but… no genocides are 100% effective. There will always be small pockets that escape- the ones who went underground early or already were when the killing started, the ones who slipped through the cracks, the ones who collaborated and then dipped, etc. I was reading a book on the subject for undergrad and cannot for the life of me find the reference now, but I believe the figure for survival is right around 2%. I can totally believe that with 200 Jedi running around the galaxy, we’d encounter a couple dozen fighting the Empire.",
            "score": 2,
            "author": "FoucaultsPudendum"
        },
        {
            "level": 0,
            "comment": "I think it’s definitely possible there are more Jedi who have become farmers hiding in outer rim as well as the few warrior/mercenary types bouncing around concealing their powers when around people. I’m such there were plenty of Jedi taking the Jedi sabbatical (I forget what that’s called) or off researching stuff on their own.   The thing to remember though is that pretty much from day 1 of order 66 until we see him in A New Hope, Vader is just flying around the galaxy hunting Jedi. So say your example of 100 Jedi were actually still around. Of those that have not completely shut themselves off from the force and become farmers or whatever, you have Vader plus all his inquisitors roaming around killing them or converting them. That’s a pretty long time for a super powerful killer with unlimited resources to be on the hunt. Comics show Vader encountering a number of them 1 of which basically wrecks Vader too! I imagine there’s a lot of encounters like in the start of Kenobi where the inquisitor outs the not so strong Jedi at the cafe. You also have to imagine Jedi like that don’t have much of a back story so you’d need to build that for anyone you’d actually care about since everyone we know from the movies are gone. \n\nI’m all for finding more survivors and creating stories about them. It’s one of the reasons I’m enjoying the high republic books. New Jedi stories about some pretty interesting/powerful Jedi experiencing all kinds of stuff both force and non force based back when there were so many Jedi they just sent them out in packs and had their own fleet of ships!",
            "score": 2,
            "author": "smilesdavis8d"
        },
        {
            "level": 0,
            "comment": "Cause it's now how the original trilogy portrayed it I guess",
            "score": 2,
            "author": "Kurdt234"
        },
        {
            "level": 0,
            "comment": "Because Obi-won said Luke was the last and yoda said there was another.\n\nI apologize someone else said this already.",
            "score": 2,
            "author": "bwd8528",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I also think that the general scale of the galaxy isn't taken into account.  For instance, the Milky Way is about 100,000 light years across.  I have no idea how big the galaxy that the Star Wars Universe exists in but in the vastness of that kind of space means many nooks and crannies.  So the number of quiet spots to hide in has got to be enormous.  Given the inefficiencies depicted of the galactic governments, I can totally see how 1% of Jedi could survive through order 66.",
            "score": 2,
            "author": "Dat_Lion_Der"
        },
        {
            "level": 0,
            "comment": "so my guess that its, at least to me, a perceptional and productional issue. the estimate of 10,000 is sort of an abstraction, in my opinion, in that we dont have a name and face for like 1% of them which would be like a hundred known jedis. the number they could've used for the total amount of jedis also could've been anything like 100,000 or 1,000,000. the fact is that its kinda arbitrary, at least as far as i can tell. all we have is the actual known jedi we get on screen. so when they give us something like order 66 and emphasize its effectiveness in such a way as to make it seem like no other jedis or former jedis are left alive except for yoda, obi-wan, and darth vader, we end up believing them. \n\nthats when it becomes a productional issue because later on you get ideas like kanan jarrus and former younglings like reva and grogu. you realize that you obviously couldnt have take all these future innovations into consideration so now all thats left is to just introduce them anyways as along as the ratio of jedis survivors to jedis terminated is still like &lt;1% i.e. less then hundred which still an effective extermination. but ultimately because that figure of 10,000 is just out-of-touch figure, any time you introduce yet another jedi who survived order 66 it will seem odd that luke only really ran into obi-wan and yoda in the ot, which ofc at that time survivors like kanan didnt yet exist.",
            "score": 2,
            "author": "darwin-incarnate2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well, part of may be that there were an estimated like **400 quadrillion** people in the galaxy. Even if 1% of them survived, that's 100 people in the face of, even taking half that 'estimate', **200 quadrillion** sentient beings. So.. yeah. Needle in a haystack \\* a million",
            "score": 2,
            "author": "Llanolinn"
        },
        {
            "level": 0,
            "comment": "Out of the 10,000 Jedi there once were, no more than 500 could have survived, and that’s a generous estimate. \n\nThere were plenty of Jedi left to train new Jedi and potentially restart the order, but not enough to reform into a significant threat to the Empire",
            "score": 2,
            "author": "ThePolishAstronaut"
        },
        {
            "level": 0,
            "comment": "The Jedi as an organisation is no more. There will always be force sensitive people in the galaxy. That’s why the emperor had Vader and the inquisitors hunting them.",
            "score": 2,
            "author": "Soggy-Assumption-713"
        },
        {
            "level": 0,
            "comment": " \"even just 1% of them survived. That is 100 Jedi!\"\n\n&amp;#x200B;\n\nalways thought the same thing",
            "score": 2,
            "author": "Podose",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People are irritated because of Yoda claiming that Luke was the last of the Jedi and that was proven false. So many Order 66 survivors also dilutes the evil and ruthlessness of Palps. \n\nTo be fair, there is likely no way Vader knew every member of the Jedi Order on sight so there was no real way to verify its end.",
            "score": 2,
            "author": "Sketch74",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Most of the knights and padawans held ranked commissions in the Grand Army of the Republic. The younglings were located at the Jedi Temple. It’s expressly stated in The Clone Wars that the numbers of the Jedi are dwindling as the Clone Wars drag on. \n\nSo, maybe 10,000 at the start of the Clone Wars. The First Battle of Geonosis saw many Jedi at the knight rank die. In the clone wars, we see Grievous kill a padawan, we see Tup’s chip go bad and he kills one of the twins, we see Trandoshans kill a youngling, and are told more died before. We see multiple jedi of different ranks fall to the dark side. Hell, we see Savage gore a Jedi to death. We also see Ahsoka leave the order. \n\nBut also, Kenobi, Yoda, Jarrius, and Grogu survived the purge, as well as the Skywalker-Amadala twins. \n\nThere was not a genocide, at the 10k level. There was a war that caused their numbers to atrophy, and kept them from developing their ranks at the same rate. Then there was a targeted pogrom at Order 66. Then any Jedi who survived 66 laid low or was hunted down by the Inquisitors or Vader himself. \n\nThat said, we know of four active Jedi and three force sensitive humans who survived Order 66. There may be others who did what Luke did between the failure of his school and episode 8. There are almost certainly other force sensitive people who were missed, but give Palpatine his due. \n\nPS- if you think of Order 66 as a pogrom, you could compare it to the Clifford’s Tower massacre, where everyone did die.",
            "score": 2,
            "author": "LeCheffre"
        },
        {
            "level": 0,
            "comment": "Because they're OT purists who for some reason need Luke to be a the last. Can't accept that in a franchise as big as Star Wars, one or two lines in the OT have now been retconned to allow for more interesting stories. Star Wars would be a lot worse if the order was completely wiped out after order 66. And like you said, as it is we've seen about 0.1% of the order survived.",
            "score": 5,
            "author": "Vakarian314",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a lot more than 1 or 2, even though I agree with your overall point here",
                    "score": 2,
                    "author": "chainsawinsect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "0.1% is 10 Jedi. Though I did mean to say 0.5%. There have been definitely more than 10 but I dont remember hearing about more than 50. Either way, its definitely less than 100, so less than 1%. Hell even if they eventually reveal there were 500 survivors, i'm more than ok with only 5% of the order surviving 66.",
                            "score": 4,
                            "author": "Vakarian314",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean a lot more than 2 lines in the OT have been retconned",
                                    "score": 2,
                                    "author": "chainsawinsect"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because Luke (and Leia) are supposed to be the last hope for the galaxy. If people like Ahsoka are around then why do they even need Luke?",
            "score": 2,
            "author": "Big-Stay2709",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well they need Luke because he is the only one that can turn Vader to kill the Emperor (and essentially Vader - all of the Sith at once).\n\nBut Yoda and OB1 didn't know that.  They just wanted Luke to kill his father.  So \\*they\\* didn't think they even needed Luke.  So there's in universe and 4th wall knowledge.",
                    "score": 2,
                    "author": "SimplyTheJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yoda: “when gone am I, the last of the Jedi will you be”. \n\nThe guy speaks to space ghosts. If he doesn’t know, who would?",
            "score": 3,
            "author": "fireinthedust",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Emperor would know.  And then he'd have them killed.",
                    "score": 2,
                    "author": "SimplyTheJester"
                }
            ]
        }
    ]
}