{
    "id": "143pshr",
    "score": 6021,
    "title": "Obi-Wan Kenobi star Vivien Blair (Young Leia ) on Season 2: Ewan McGregor is \"begging to do another one\"",
    "author": "Zepanda66",
    "date": 1686173750.0,
    "url": "https://www.reddit.com/r/StarWars/comments/143pshr",
    "media_urls": [
        "https://comicbook.com/tv-shows/news/obi-wan-kenobi-season-2-ewan-mcgregor-vivien-lyra-blair-leia/?fbclid=IwAR3a49V0fqGcRF_o4nsinkQCZu7asrnHB5ZN1_u0WT6zw3phwWTq3cVFcsQ"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just 8 episodes of Obi Wan drinking in bars talking to the locals will do just fine.",
            "score": 3415,
            "author": "RYzaMc",
            "replies": [
                {
                    "level": 1,
                    "comment": "We need Cheers in Star Wars…Obi Wan can be “Norm”. \n\nSometimes you wanna go\nWHERE NOBODY KNOWS YOUR NAAAME",
                    "score": 677,
                    "author": "lovescoffee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"BENNN!\"",
                            "score": 167,
                            "author": "SmarcusStroman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Hello there\"",
                                    "score": 77,
                                    "author": "Pagan_of_the_Fern"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"how's life treatin' you, Ben?\"\n\n\"Like i force choked its dog, now gimme a beer\"",
                                    "score": 39,
                                    "author": "EntityDamage"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Obi Wan can be “Norm”.\n\nMore like Cliff: \"Tou know, from a certain point of view...\"",
                            "score": 37,
                            "author": "RemtonJDulyak"
                        },
                        {
                            "level": 2,
                            "comment": "Lando calrissian on a bender for a couple weeks gambling drinking and fucking his way across the galaxy",
                            "score": 10,
                            "author": "Deep_Instruction4255",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"No droids!\"",
                                    "score": 2,
                                    "author": "blue_27"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Making your way in Tatooine today takes everything you've got...\"",
                            "score": 61,
                            "author": "willk95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Taking a break from all your womp rats\nSure would help a lot...\"",
                                    "score": 44,
                                    "author": "HandleAccomplished11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Wouldn't you like to get away?\"",
                                            "score": 11,
                                            "author": "Comic_Book_Reader",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "🎶 \"Yourself, the boy, two droids, and no questions aaaaaaasked.\" 🎶",
                                                    "score": 8,
                                                    "author": "HenryInRoom302"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We could finally see some Cheers memes",
                            "score": 17,
                            "author": "HansBrickface"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This but have one big “oh shit” situation he solves in the middle, like sand people are about to fuck up the skywalker ranch and he stops em (only for them to return in greater numbers)",
                    "score": 84,
                    "author": "skatenbikes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And riding single file of course",
                            "score": 29,
                            "author": "Dramatic_Mulberry157",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would we get proof that stormtroopers are accurate and precise? Because all the other movies and shows have definitely not proven that.",
                                    "score": 5,
                                    "author": "caligaris_cabinet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Have you even WATCHED the films? Stormtroopers are plenty accurate when firing at anyone who isn't a main character...",
                                            "score": 8,
                                            "author": "TheGreatLemonwheel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's in the first scene. They just wipe the floor with the Tantive IV crew.",
                                                    "score": 6,
                                                    "author": "Adequate_Lizard",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or if everything were just flashbacks of Anakin and Obi Wan bantering I would totally be fine with that",
                    "score": 17,
                    "author": "graygh0st999"
                },
                {
                    "level": 1,
                    "comment": "Obi Wan in bars *will* do fine!",
                    "score": 45,
                    "author": "medkitjohnson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even if they're trying to sell him death sticks?",
                            "score": 16,
                            "author": "cirroc0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're not trying to sell him death sticks. They're going home to rethink their life.",
                                    "score": 22,
                                    "author": "ansonr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"What, you think you're some kinda Jedi waving your hand around like that?\"",
                            "score": 3,
                            "author": "Sparrowsabre7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He will turn down all of the death sticks",
                    "score": 6,
                    "author": "RocTheJoc"
                },
                {
                    "level": 1,
                    "comment": "&gt;Just 8 episodes of Obi Wan drinking in bars talking to the locals will do just fine.\n\nWell, I dunno. Young Leia was \\*incredibly\\* well-acted, and I'd like to see her get more time. So these bar scenes...flashbacks as he's recalling the events?",
                    "score": 27,
                    "author": "there_is_no_spoon1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Every episode is bookended by him drinking in a bar. A minute or so beginning and end, then the rest of the episode is a flashback to various points during the clone wars, and after the order fell.\n\nAnd then it’s 22 episodes instead of 8. And they’re all an hour long",
                            "score": 40,
                            "author": "beardedbast3rd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hobo Kenobi telling drunk war stories for more booze ? I'm down for it !",
                                    "score": 16,
                                    "author": "Choyo"
                                },
                                {
                                    "level": 3,
                                    "comment": "You say that but they’ll just do a young Sheldon style thing",
                                    "score": 2,
                                    "author": "Initial_E"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In defence of the actors in that chase scene you can tell they were all trying their hardest (including young Leia) to make it look believable, it was just terrible directing.\n\nThe funniest part is they didn't even need to do the chase scene since the three goons end up catching her anyway.",
                            "score": 8,
                            "author": "WhiteyFiskk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"No, they won't!\"",
                    "score": 2,
                    "author": "Sparrowsabre7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As long as it’s about Obi-Wans journey with Qui Gon to learn how to become a force ghost then I’m all in. I’d love to see some sort of spiritual journey with the force. I also don’t think it would make sense for Leia to even be in season 2. I just don’t want them to take away from the legacy of Obi by giving him more reasons to stop watching over Luke",
            "score": 1067,
            "author": "E785E",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be cool to see. Liam appeared as Qui-Gon for Clone Wars and/or Rebels, so I think he'd return to live-action if they threw some money at him.\n\nAgreed about Leia. I didn't like her being in season 1 as the R2 message in A New Hope gives the impression she never met him, so... Yeah, no Leia in season 2, please.",
                    "score": 208,
                    "author": "Adam_Sackler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Liam Neeson as Qui-Gon was already in Kenobi season 1 too",
                            "score": 116,
                            "author": "DQuinn_10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow, I must have forgotten. Which scene?",
                                    "score": 14,
                                    "author": "Adam_Sackler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right at the end.",
                                            "score": 69,
                                            "author": "nagrom7",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How did you forget one of the biggest reveals in the series? I literally gasped and shouted out \"It's Qui Gon!\"",
                                            "score": 11,
                                            "author": "_xXmyusernameXx_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't feel like Leia's role in the show disrupted the established canon at all. I thought rather that it enriched it enormously",
                            "score": 89,
                            "author": "legitocracy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean the fact that she just tells the empire that obiwan is blatantly connected to the Organas is a big mess. It's an unbelievable miracle the Organas weren't executed before ANH because of this",
                                    "score": 44,
                                    "author": "at_midknight",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Leia going on a wacky adventure with Obi Wan and a rogue quasi-Sith attacking Luke at the Lars farm doesn’t mess with the canon at all?\n\nNot to mention that apparently getting a sword of pure plasma/energy shoved through your chest is very survivable. A blade hot enough to melt blast doors in under a minute but stuck through your chest, such a minor wound that multiple people survive it.",
                                    "score": 95,
                                    "author": "slide_into_my_BM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean Maul survived getting cut in half, it’s not unprecedented. And aliens could have different anatomy/locations of vital organs\n\nEdit: typo",
                                            "score": 60,
                                            "author": "apsgreek",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, somehow the dead speak too",
                                                    "score": 27,
                                                    "author": "Zepp_BR",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also, somehow Palpatine returned.",
                                                            "score": 26,
                                                            "author": "Auran82"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You’re probably talking about the Grand Inquisitor, but Reva is human and survived it twice.",
                                                    "score": 23,
                                                    "author": "Squishy-Box",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "While Maul is loved by pretty much everyone now, at the time he was joked about a lot and you had plenty of people take issue with his return. Especially considering the crazy spider legs \n\nNot defending Maul, love the character but yeah… Doesn’t matter how angry and hateful you are, that shit ain’t helping a bisection on that level. It’s not something we should look back on and say “we did it then so it’s fine to do similar now” especially twice in the same show. \n\nI would say that there’s a difference between getting impaled and sliced in half but it doesn’t really matter imo, both should be lethal.\n\nLightsabers were like the most OP weapons in cinema history while I was growing up. Having that context makes the Kenobi scenes (and Maul) damaging to its legacy… I’m aware I sound way too over the top about this, I’m simply bored and killing time.",
                                                    "score": 31,
                                                    "author": "JimileeWatt",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes you have highlighted more problems lol this is how you devalue death and lightsabers",
                                                    "score": 19,
                                                    "author": "at_midknight"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It now certainly makes more sense why she'd name her son Ben. I know in Legends Luke had Ben Skywalker but tbh if Luke were to name his son after anyone, I really wish he'd have been named Owen.",
                                    "score": 2,
                                    "author": "Ooji"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like the idea that ghost training is for Obiwan to watch over Luke forever",
                    "score": 7,
                    "author": "DCmarvelman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d be all for it on too conditions:\n\n1) no more contact between Kenobi and Vader\n\n2) focus on Kenobi! No side story about some new character who only manages to bring the story to a screeching halt whenever they show up.",
            "score": 2568,
            "author": "BowTie1989",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the idea of either alternating episodes of Vader and Ben would be neat. They never interact again, but we still get Vader doing Vader stuff. \n\nHave Ben follow some of his hermit arcs and training with Qui Gon.",
                    "score": 37,
                    "author": "RedHammer1441",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did not realize how much I wanted a Hayden Vader being an absolute monster show before now.",
                            "score": 16,
                            "author": "Xanny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can we get Andor's writers? Both shows center on a character where we know their ultimate fate, but I felt a lot more tension in Andor than I ever felt in Obi-Wan.",
                    "score": 920,
                    "author": "henshinmilk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Getting Tony Gilroy for Andor was an *insane* get. Lightning in a bottle. I doubt he’d be down with being shuttled around between Disney productions as a script doctor. He already negotiated them down from five seasons to two.",
                            "score": 186,
                            "author": "FoucaultsPudendum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are 8 billion people in the world. At least hundreds of them are as talented at writing television as Tony Gilroy. The fact that he is the first really excellent director/showrunner that the wealthiest entertainment company on Earth has found for the biggest IP on Earth is asinine and insulting.",
                                    "score": 108,
                                    "author": "ZLBuddha",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Disney's run with star wars has just been absurdly bad, the rogue one was almost a disaster, solo was almost a disaster and was instead just mediocre, the sequel trilogy.... the Mandalorian is incredibly inconsistent, some episode great, others considerably less so, and it's best episodes were somehow in the book of boba Fett which was another roller coaster, and then Kenobi was a veritable shit stew with a couple diamonds in it. \n\nThe fact Andor was a phenomenal television show on it's own that also happened to be set in the star wars universe felt so weird after so much other content where the main saving grace was the universe. If they went for compelling and fresh that is in the universe, instead of recycling fan service and milking existing IP dry, they'd probably be doing far better. Here's hoping that Ahsoka does something beyond recycling nostalgia.",
                                            "score": 87,
                                            "author": "Messyfingers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really have no hope for Ahsoka at all. I loved her Mandalorian episode, Lars Mikkelsen is a phenomenal casting choice for Thrawn, and I'm fully expecting them to squander all that they're given in favor of pandering to Youtube reaction channels and trying to sell Lego sets.",
                                                    "score": 62,
                                                    "author": "ZLBuddha",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's my worry with everything star wars now... I just hope Dave Filoni has enough control to see that story through without succumbing to whatever force is pushing the intensely mediocre star wars content spree(idk if we can even blame merchandising considering how long it took Disney to make a baby Yoda toy of any kind)",
                                                            "score": 19,
                                                            "author": "Messyfingers",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel like people put way too much stock in Dave Finloni. Yes, he’s done some great work with the franchise, especially The Clone Wars, but at the same time his version of the Star Wars universe seems to be inhabited by like 20 people and a lothcat. It’s like everything he touches eventually includes fanservice appearances from major characters regardless of whether they really needed to or not.",
                                                                    "score": 63,
                                                                    "author": "mastesargent",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well GL himself said Star Wars is like a soap opera set in space (space opera). Well in soap operas literally everyone knows everyone so it tracks 😂",
                                                                            "score": 10,
                                                                            "author": "ChrisL2346"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Hmm. I have many issues with The Mandalorian but the sense of scale and a diverse, populated galaxy was one of the things I thought it did extremely well. Maybe less so in the latest season.",
                                                                            "score": 7,
                                                                            "author": "Isserley_",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah, when I saw the scene of Grogu playing space croquet \nwith Lizzo, I thought to myself, “You know what? This is exactly the storytelling this season needed, and was missing from the previous 2.5 seasons.”",
                                                                                    "score": 7,
                                                                                    "author": "officerfett",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't get why Filoni gets all the credit for good stuff and none of the criticism for his bad stuff.\n\nMost of clone wars is skipped with the recommended viewing guide. Most of rebels can be skipped. Mandalorian has been utter shite. He gets too much credit for stuff he did years ago.",
                                                                    "score": 12,
                                                                    "author": "ArrowAssassin",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Agreed. I think his talents reside in  episode-of-the-week, comic book type storytelling, and so far he has come up very short in showing he can create a modern, focused, contained narrative over 8 or so episodes.",
                                                                            "score": 8,
                                                                            "author": "Isserley_"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;Most of rebels can be skipped\n\nI actually disagree with this. I rewatched the whole thing lately and I think you can comfortably skip around 1 or 2 episodes and lose nothing.",
                                                                            "score": 2,
                                                                            "author": "DemonLordDiablos"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You call Rogue One a disaster? It's the best SW movie since the prequels",
                                                    "score": 2,
                                                    "author": "Dara84"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s true there are others, but it’s worth noting that just because you’re talented doesn’t mean you’re right for Star Wars.  Rian Johnson would definitely be exhibit A in this department.\n\nTo write Star Wars you need to really get Star Wars. That may be true of any franchise, but Star Wars has experienced some of the worst of it. There are problems in the sequel Trilogy caused by genuinely poor writing etc. but most of it is a failure to appreciate what makes Star Wars tick. The best of Star Wars is when writers like Kasdan (ESB), Zhan (Thrawn), or Gilroy honor what works and then expand into new territory.",
                                            "score": 8,
                                            "author": "Khanahar"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think that was more of a practical decision because of the evident development time per season. Cassian is meant to be in his early 20s and they reckon that by season 5 Diego Luna would be in his mid 40s I think?",
                                    "score": 3,
                                    "author": "Lvl1bidoof"
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s only going to be 2 seasons of Andor ?",
                                    "score": 2,
                                    "author": "_Diskreet_",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That was less of a negotiation and more a \"we spent the budget of 2 and 3 on S1\". They even made jokes abt it at the panels at SWC",
                                    "score": 2,
                                    "author": "DiamondFireYT"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the difference with the two is that Kenobi essentially *only* had known characters while Andor had Cassian himself, Mon Mothma, then a bunch of new characters who we didn’t know what would happen to, it allowed for tension to build.\n\nWe knew Kenobi would save Leia and they would get away, we knew Luke and the Lars’ would be safe, etc etc.",
                            "score": 302,
                            "author": "Baelzabub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True, but even with the characters we knew would survive in Andor, scenes felt tense. Mon Mothma is a good example, because all of her scenes had great tension and just sucked you in. I didn’t fear for her life, exactly, but I felt the unease and paranoia she felt. Obi-Wan never really accomplished that.",
                                    "score": 176,
                                    "author": "henshinmilk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is why I can never understand people who say they can't get into prequels because \"we know what happens to all the characters.\" I remember seeing a lot of that about Better Call Saul, saying they weren't interested with already knowing where Saul, Mike, and Gus all ended up.\n\nIt's not about the endpoint, it's about the journey they take to get there. Yeah we know that characters have to survive to get to the original work, but there can be so much more at stake than just death.",
                                            "score": 53,
                                            "author": "geek_of_nature",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Yeah we know that characters have to survive to get to the original work, but there can be so much more at stake than just death.\n\nplus, *we* know the characters will survive but the characters themselves don't. the sign of good writing and good acting is when you're empathizing with their own fear and uncertainty when you already know their fate",
                                                    "score": 24,
                                                    "author": "cyborgspleadthefifth",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And we know sooner or later she is going to have to run for her life and in doing that may have to leave her husband and child behind.\n\nI can totally see a scene where she gets a call telling her the ISB are on the way to arrest her and she has to go NOW and she tries to get her daughter to go with her but her daughter thinks she is just doing it to keep her from marrying that boy etc etc. \n\nCue scene of her flying away while crying having left everyone she loves behind.",
                                            "score": 60,
                                            "author": "JGCities",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We kind of get that in Rebels. She gives a speech on the Senate floor where she accuses the Empire of war crimes and then immediately becomes a fugitive and seeks refuge with the rebels.",
                                                    "score": 18,
                                                    "author": "Buff-Cooley",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The reason Mon Mothma was great was you knew she could be exposed at any scene. Everyone puts weight on life and death for a character, but her being an established character and Cassian having a known end to his story the tension wasn't \"are they going to die?\" but instead \"what thing gets them from their current position to where I recognize them?\"\n\nAndor we know strictly as an established rebel in Rogue One and Mon Mothma about the same but leadership.\n\nThere is too much modern show writing based on life or death situations that it's refreshing to see a character make it out of a series or story if it's a prequel and any characters you know the fate of are just \"safe\" and new characters are expendable fodder.",
                                            "score": 5,
                                            "author": "MrFluffyThing"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the difference is that the writing in Andor is actually competent and seemingly written by experts in their craft meanwhile Kenobi feels like a cheap cashgrab created by committee.",
                                    "score": 21,
                                    "author": "Serious-Flow-"
                                },
                                {
                                    "level": 3,
                                    "comment": "Plus Andor wasn’t really about Andor. He was one part of a much larger story that we happened to follow.",
                                    "score": 3,
                                    "author": "caligaris_cabinet"
                                },
                                {
                                    "level": 3,
                                    "comment": "No, the difference is Andor had actual writers, while Kenobi had a bunch of nepo babies who couldn't write their way out of a paper bag.",
                                    "score": 36,
                                    "author": "CrabsolutelyBullshit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Think it’s a bit more nuanced than that good sir",
                                            "score": 27,
                                            "author": "ebagdrofk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly I don't think it is",
                                                    "score": 17,
                                                    "author": "ZLBuddha"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It really isn't lol. Kenobi is bad because the writing is ChatGPT level bad. Andor is good because the writing is compelling, and there's actual character development and pacing.\n\nAnyone that doesn't think the writing on Kenobi is bad needs to try watching things that aren't Star Wars.",
                                                    "score": 37,
                                                    "author": "CrabsolutelyBullshit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Andor is good because it's written fundamentally by dudes who don't really care that much for Star Wars, but do care about making something good.\n\nWhereas all the other Disney+ slop is made by weepy action figure collectors.",
                                                            "score": 2,
                                                            "author": "DemonLordDiablos"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Throw in a robot dog and call it a day",
                                    "score": 2,
                                    "author": "co0ldude69"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I call this the walking dead problem. Walking dead had like 5 good watchable characters, yet many episodes were spent following terrible actors that nobody wanted to see. Why producers think its a good idea?",
                    "score": 17,
                    "author": "LeinenRates",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because this is how we live now. You know how it is!",
                            "score": 12,
                            "author": "BobRushy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "In Walking Dead's case it's because they can't kill off the 5 good characters or people will stop watching but they need a constant stream of deaths to create the illusion of danger and drama.\n\nNot really the case with Kenobi though where almost every major character has plot armor.  I guess they just really thought they were gonna get that Reva spinoff.",
                            "score": 8,
                            "author": "GuyKopski",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t mind new characters it just expand the universe and the possibilities and you can’t just have 6-8 hours of just Obi-Wan, just don’t add more contact with already known characters just because they exist in the same universe. It could be a compelling human emotions story with just him on Tatooine facing real life issues and I’d be happy. Not every story has to hold the fate of the galaxy in its hands.",
                    "score": 51,
                    "author": "DrunkenMasterII",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m with you on this one. I wish they didn’t deal with the Imperial/Rebels conflict, and stayed away from already established characters. \n\nWhen it was first announced, it sounded like this was the route they were going for. I was hoping for a sort of western, or something like Obi-Wan getting caught in the middle of a Yojimbo style fight between two groups on Tatooine.",
                            "score": 36,
                            "author": "GrvyrdGhst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I was hoping for a sort of western, or something like Obi-Wan getting caught in the middle of a Yojimbo style fight between two groups on Tatooine.\n\nThe irony here being those are the genres Mandalorian and BoBF were supposed to be.",
                                    "score": 24,
                                    "author": "Batmans_9th_Ab"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I went in hoping Obi-Wan would be a real character study, let Ewan really get into such an iconic character at rock bottom. Or a low key samurai story, like a Yojimbo remake with no stakes in the overall grand plot. Maybe both.",
                            "score": 23,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that was I was hoping for too",
                                    "score": 3,
                                    "author": "DrunkenMasterII"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wish there was a separate show for Reva...THEN put her on Kenobi.",
                    "score": 132,
                    "author": "truthseekinginlife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really did seem like they were trying to set her up for her own show at the expense of the character everyone wanted to see…Kenobi.",
                            "score": 155,
                            "author": "BowTie1989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean...I'm interested in the character, but it's really tough to intro a brand new character in that show.\n\nAnd the writing for her was pretty lame...Too much having to suspend disbelief.  Vader couldn't kill her twice?  Even as an 8 year old?",
                                    "score": 78,
                                    "author": "truthseekinginlife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; it's really tough to intro a brand new character in that show\n\nWhat do you mean? The introduction of Wade was a massive success.",
                                            "score": 26,
                                            "author": "Esp1erre",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's a testament to the quality of Kenobi's storytelling and memorability that I have literally no fucking clue who Wade is and I watched the entire show.",
                                                    "score": 12,
                                                    "author": "ZLBuddha"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "WAAAADDDDEEEEE!!!!",
                                                    "score": 10,
                                                    "author": "Batmans_9th_Ab"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Justice for Wade",
                                                    "score": 11,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Literally who? I’m assuming you’re taking the piss because I have no idea who you’re talking about.",
                                                    "score": 4,
                                                    "author": "NotAnotherPornAccout",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dammit I just recently started sleeping through the night. \n\nRIP Wade gone but not forgotten #WadeKing",
                                                    "score": 5,
                                                    "author": "thatdudewillyd"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Touche'....the flip side of that is Andor taking 2 episodes to build a character up just to kill them off Andale you care.  Chefs kiss.",
                                                    "score": 3,
                                                    "author": "truthseekinginlife",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don’t forget that her whole plan was to help hunt down and kill Jedi in order to take revenge on vader for hunting and killing Jedi.",
                                            "score": 93,
                                            "author": "BowTie1989",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah...poor writing.  Reva deserved better.   And then there were some things that were just odd, not thought out, and poorly blocked.\n\nIt could've been much better.",
                                                    "score": 38,
                                                    "author": "truthseekinginlife"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And all that did was give the show a bad rep and make the actress a scapegoat too, just fucking dog shit writing. The only thing they got right was Obi Wan and Vader, the whole show should’ve 90% just have been about them.",
                                    "score": 26,
                                    "author": "Hashirammed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In fairness, she was also miscast. Her attempts at being intimidating weren't believable at all, and just came off like tantrums.",
                                            "score": 21,
                                            "author": "CrabsolutelyBullshit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More like misdirected and written. She has really good acting chops. Joby Harold wrote her about as one dimensional as you could write a character. It was really bad.",
                                                    "score": 10,
                                                    "author": "ParamedicSpecific130",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "She's definitely talented, though I'm not sure if angry Sith is the right character for her. She seems more the sensitive type.\n\nI thought her acting was great once she turned. Also liked her in Queen's Gambit. Good actress, just not intimidating.",
                                                            "score": 7,
                                                            "author": "CrabsolutelyBullshit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I agree with everything you said. I think if you are gonna cast Moses, you write a different character for Reva. Instead, it felt like they had an idea for a really basic character and then cast a talented actress to play her. Star Wars, unfortunately, has a history of this though. \n\nQuality actors and actresses paired with really bad writing. See: Oscar Isaac and John Boyega.",
                                                                    "score": 7,
                                                                    "author": "ParamedicSpecific130",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah, they could have let her play the character a bit more subtle, restrained. They could have played into the insecure vibe of the character more. Overall I think she'd be best as a conflicted Jedi, more than an Inquisitioner. Someone hurting from trauma but unable to truly embrace the dark side.\n\nOscar Isaac being wasted is definitely another annoying thing. The dude is SO good - one of the best working actors atm. Burmt he really does nothing in those movies. The new Spiderverse is a great example of a movie using him well.",
                                                                            "score": 4,
                                                                            "author": "CrabsolutelyBullshit",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah I feel like you and I are aligned on Reva. She could have been played as outwardly over compensating to be more evil but the nuance could have been that, we the audience get to see the conflict, away from the gaze of Vader or the Grand Inquisitor.  \n\nShe is broken, suffering from PTSD and feels completely alone in her desire for vengeance. That PTSD of guilt is what ultimately could have given connection to Obi-Wan,  if he too were suffering from the guilt around not being able to save everyone.\n\nThat she has this ill fated plan to avenge her Youngling friends but she is secretly conflicted about how to go about it. \n\nReva using more of a calculated approach ala Deedra in Andor, would have also made more sense. Perhaps she was fine with torture but it was emotionally draining because of how conflicted she was.",
                                                                                    "score": 2,
                                                                                    "author": "ParamedicSpecific130"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "To add in, Reva is maybe 22 at the oldest and has spent a good amount of her life as an inquisitor; a sect of force users who mostly rage and throw tantrums when they don’t get their way. Whilst the fact they are ruthless serial killers ups the ante into making them extremely dangerous, almost all of them wind up dead due to their inability to control their emotions. I think the writing is fine in that respect. \n\n\nYou are correct with the miscast. Moses Ingram gives off more of a pouty face in a lot of scenes trying to look hyperviolent. She was nominated for an Emmy for a previous role and has the technical experience for a supporting role. Seems that playing a double crossing villain (antihero?) just wasn’t really suited to her skill set.",
                                                    "score": 15,
                                                    "author": "MarkyMarcMcfly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, I think her character, dialogue aside, works better if she's played by someone who's a bit more naturally intimidating. Someone able to play up the trauma more.\n\nShe's definitely talented as an actress, just doesn't have that kind of hardness the role required in order to be believable.",
                                                            "score": 7,
                                                            "author": "CrabsolutelyBullshit",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Doesn't help that it felt like the costume designer for Reva swung by the warehouse and picked up a generic evil henchwoman costume from the 90s.",
                                                            "score": 6,
                                                            "author": "ReaperReader"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, she survived Order 66, then decided to devote her life to taking down Vader.  OK, fine.\n\nBut as an inquisitor, how many Jedi-on-the-run did she have to kill to prove herself?  How many civilians did she kill?  How much evil did she do in order to maneuver herself into a position to get close to Vader? The whole concept, as it was written, is ridiculous. It doesn't work.",
                                    "score": 8,
                                    "author": "UsbyCJThape",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It just gets worse the more you think about it. Reva is young. She is early to mid 20s at most. How many of the Jedi that she killed/captured/tortured do you think she knew personally? How many force sensitives did she have to bring in in order to not attract attention? Because she is so evil that the grand inquisitor himself had to tell her to chill out cause she was too psycho. And this is the person the audience is supposed to sympathize with? I wish I could forget this show lol",
                                            "score": 7,
                                            "author": "at_midknight"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get what you are saying but I still want to see Hayden.. Maybe he could appear in flashbacks..with better deaging..",
                    "score": 10,
                    "author": "losdreamer50",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or through Obi Wan experiencing a vision through the Force. What would have happened if he had stopped Anakin falling to the dark side.\n\nHayden did say recently he wanted to do a What If style story, and Natalie Portman said she'd be happy to return as well.",
                            "score": 3,
                            "author": "geek_of_nature",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just hire competent writers.",
                    "score": 2,
                    "author": "Fisher9001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Greatest chase scene in television history",
            "score": 150,
            "author": "QB145MMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you see someone put the rugrats theme song over it, hilarious",
                    "score": 3,
                    "author": "diggydillons"
                },
                {
                    "level": 1,
                    "comment": "Along with the greatest inability to put out fire a second time scene, the greatest slow robot dragging an unconscious man 50 feet away from the main villain of all time, the best \"nah bro you can't take the ship we only have one, SYKE there's a second ship SYKE there's also a smaller ship on the second ship\", top all time hiding in a coat while walking suspiciously fast to escape the base scene, and not to mention the greatest rock throwing scene\n\nPLUS they also had Star Wars second best (read: worst) slicing Vader's helmet eye AND flooding the Inquisitor base scenes, wow\n\nGod what a terrible show\n\nEdit: autocorrect fixes, still a terrible show",
                    "score": 40,
                    "author": "LeMickeyMice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing will ever top Tala’s escape. Who knew the fatal flaw in stormtrooper armor was a slap to the helmet",
                            "score": 11,
                            "author": "pleasegivemepatience"
                        },
                        {
                            "level": 2,
                            "comment": "Absolute dog shit. There was maybe 1 or 2 scenes I enjoyed but ultimately it was like someone was in a hurry to show the world their dumpster fire.",
                            "score": 8,
                            "author": "APM1485",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just give us a Vader show. A six episode run but each episode being a stand alone story spanning the years.",
            "score": 613,
            "author": "peanutanniversary",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is literally all ive ever wanted. It seems so obvious too, like you cant tell me a show solely focused on Vader wouldnt be the most watched star wars show by a metric fuck ton.",
                    "score": 308,
                    "author": "Sa-Tiva",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thats what everyone said about Obi-Wan",
                            "score": 90,
                            "author": "Ndmndh1016",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Obi-Wan had a massive amount of hype and was a successful show viewership wise. Unfortunately Disney just makes dumb mistakes that make no sense like focusing on Reva when everyone is tuning in for Obiwan and Vader. I still think a Vader show would have way more hype then Obiwan show tho. As much as everyone loves Obi, Vader is by far the most famous Star Wars character.",
                                    "score": 157,
                                    "author": "Sa-Tiva",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The real problem is they took what could have been a decent movie and stretched it to six episodes.",
                                            "score": 91,
                                            "author": "OuttaTime42069",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bingo",
                                                    "score": 13,
                                                    "author": "OldManHipsAt30"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I want a Horror/Slasher type film where a few surviving Jedi are crashed on some remote island/planet and start getting picked off one by one. And treat Vader like the shark from Jaws where you see very little of him, with using his breathing sounds to amp up the tense scenes. I know it’ll never happen but A GUY CAN DREAM DAMMIT!",
                                            "score": 11,
                                            "author": "thatdudewillyd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly I think it's diminishing returns after Rogue One. It was so impactful but now everyone is expecting it. I don't think seeing Vader more does anything for his mystique",
                                                    "score": 10,
                                                    "author": "Asiriya"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly I can't see it. What would we do, follow Vader's perspective as the main character throughout the entire series? How would that narrative work? \n\nVader's allure is as a villain that haunts the peripheries of the story, and comes out in short, powerful, antagonistic bursts. Having him front and centre for an entire episode, let alone an entire series, would take away the menace and the magic from him.",
                            "score": 6,
                            "author": "Isserley_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Final episode would include his redemption during return of the jedi. The VADER logo in the intro sequence of that episode would change, fading into ANAKIN SKYWALKER",
                    "score": 19,
                    "author": "losdreamer50",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ".... somehow returned",
                            "score": 9,
                            "author": "ih8dolphins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1. The comics already do that\n2. Vader is best used in moderation as a rare, looming figure. A whole show focusing on him would ruin that entirely\n3. He already has 6 movies dedicated to him",
                    "score": 30,
                    "author": "Fantastic-Wheel1003",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What's his arc going to be",
                    "score": 3,
                    "author": "RolloTony97",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why isn’t this a thing?",
                    "score": 9,
                    "author": "Magickcloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought it’s because part of the allure Vader has is that he is used sparingly. His arc ended in the first Star Wars trilogy, and his cameos since then have been very short but sweet. \n\nHaving a show centered around him could be very interesting if they pulled it off well, but they could seriously mess up his reputation if they don’t do well.",
                            "score": 58,
                            "author": "ebagdrofk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Plus, with the comics, they give extra things for Vader in shorter formats.  Even if arcs in the comics, especially his own, are fairly lengthy, the actual events of a particular issue are far shorter.  And, being comics, the particular issues that focus or rely on him can reliably dial up his power to actually make him out to be the threat he was believed to be.  \n\nBut dedicating an entire show to him, especially after the fact that both the prequel and original trilogies put focus on parts of his journey, would definitely lose much of the mystique and appeal for Vader.  Like you said, his cameos in various large appeal mediums that he's appeared in has not only been good, but also well recieved.  After all, look at the reception to his cameos in Rebels, Rogue One, and Jedi Fallen Order.  They were all well recieved, they all worked to build upon his allure, and they were just right for those various entries.  Anything more in them could very well undo that allure and reputation.",
                                    "score": 19,
                                    "author": "Randomman96"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; his cameos since then have been very short but sweet.\n\nHas it?\n\nSince he is just a cameo in the hero's show, they always have to have Vader fail because it's the hero's story. And this just makes Vader look incompetent.",
                                    "score": 2,
                                    "author": "Real_Boston_Bomber"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Because war crimes and the all around evil stuff that is implied in Vader is doing wouldn't work for a general audience, let alone Disneys family friendly presentation. And I doubt canonicly portraying him as an anti hero in that time frame would go down well with anybody.",
                            "score": 2,
                            "author": "Droettn1ng"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought it was mediocre but only in relation to the sheer potential it had. \n\nIt felt like a lot of episode scripts were first draft. Solid, with all the parts, but missing the polish and tweaking that would make the story sparkle rather than glow dimly.\n\n*That being said* I’d be very interested to see what S2 would be about, and at the very least it would give enough material for fan-edits to fix pacing or story beats afterwards.",
            "score": 389,
            "author": "Indiana_harris",
            "replies": [
                {
                    "level": 1,
                    "comment": "Getting Leia out of the Inquisitor base by *hiding her in a giant coat, Scooby Doo-style* stinks of a first draft.\n\nLike did NOBODY during any single step of the production process stop and go \"hey wait a minute this is dumb af\"",
                    "score": 70,
                    "author": "007meow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Iirc there's an interview where Leia's actress says she kept saying that scene was dumb through the entire shoot",
                            "score": 17,
                            "author": "Totes_mc0tes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Based baby leia",
                                    "score": 3,
                                    "author": "at_midknight"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also looking at how to penetrate the base saying “no one’s done it before” and then proceeding to enter it the exact same way Cal Kestis did….\n\nAll they had to say was “as far as I know, only one person was able to get in before”.",
                            "score": 3,
                            "author": "ihatereddit1221"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It also suffered hard from the marvel show problem of \"this is obviously a movie idea we made 6 hours long to provide content for our streaming service\"",
                    "score": 211,
                    "author": "ok_dunmer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it’s one of the reasons PixelJokers edit looks so good to me, it’s editing it down to a tight paced 2 hr movie (plus the new VFX looks neat).",
                            "score": 59,
                            "author": "Indiana_harris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd be interested in seeing an edit that cuts out a lot of the fluff in this show. Any idea where to find this edit?",
                                    "score": 11,
                                    "author": "Winged10",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Patterson’s cut](https://www.kaipattersonfilms.com/kenobi)",
                                            "score": 4,
                                            "author": "Druco"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think I've looked for it before and couldn't find it,maybe they are still working on it",
                                            "score": 8,
                                            "author": "losdreamer50"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The final fight is awful. Such low standards up in here",
                                    "score": 2,
                                    "author": "Asiriya"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can feel the marvel influence",
                            "score": 3,
                            "author": "Pudding_Hero"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why should fans have to do that though? How about the multi billion dollar company actually do better",
                    "score": 35,
                    "author": "percy2376"
                },
                {
                    "level": 1,
                    "comment": "You're kind. It was bad. The woods chase was embarrassingly bad. The music was dull and emotionless. The VFX were lazy. The directing and blocking super awkward. The bad guys looked and acted like Power Ranger villains. The story itself was forgettable and boring, which is a hard task considering Vader was in it. Worst of all Ewan McGregor returned to the role to once again be given clunky dialogue...\n\nIt had the potential to be an incredible epic. Not in a big budget way, but in a character study way. A roaming samurai tragedy. It was all right there and so easy. Oh well.",
                    "score": 9,
                    "author": "inteliboy"
                },
                {
                    "level": 1,
                    "comment": "I tried SO hard to love it because I love Ewan McGregor as Obi Wan so much but that final episode with kidnapping Luke made me roll my eyes so hard they fell out of my head.",
                    "score": 25,
                    "author": "rostron92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will watch pretty much anything with Ewan as Obi-Wan but it definitely left me whelmed.\n\nI really wish it had been given a better story treatment, there was so much potential.",
                            "score": 2,
                            "author": "Princeof_Ravens"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So Hayden, Ewan, and Natalie are all interested in being in Star Wars again. Disney please take the billion dollar idea of doing a live action What If series",
            "score": 224,
            "author": "TheRealMrCloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or just do some live action clone wars shit. While they are still passably young enough.",
                    "score": 115,
                    "author": "vikingArchitect"
                },
                {
                    "level": 1,
                    "comment": "I love Star Wars What If. Great ways to do a Star Wars RPG campaign. \n\nHere’s one that was a huge success at my table: what if R2 and C-3PO are shot down over Tattoine with the death star plans?\n\nThey never make it to Luke and Ben, who aren’t alerted and don’t jump onto the Falcon and head to Alderaan, don’t rescue Leia, don’t take the plans to Yavin 4. \n\nSo extrapolate: Leia is tortured continuously by Vader, and eventually breaks, giving up Yavin 4 and falling to the dark side. Vader recognizes her Force potential and trains her as his apprentice. Eventually they figure out their actual relationship. \n\nMeanwhile, Ben is alerted for the first time when Alderaan is destroyed and abandons Luke, heading out to find the Rebellion, but fails to find it after Leia gives up Yavin 4. He returns to Tattoine, collects Luke, heads to Dagobah and he and Yoda start his training. Eventually Ben leaves to found a new Rebellion led by himself as General while Luke trains with Yoda. \n\nMeanwhile, seeking dominance for himself and his daughter / apprentice whom he dubs Darth Fury, Vader kills Tarkin and turns the Death Star on Coruscant when the Emperor is still on the surface, declaring himself Emperor and ruling the galaxy from the Death Star with a ruthless fist. \n\nTwo years pass. The Rebellion is mostly on the run, but is gathering strength as Vader upsets more of the galaxy with each planet he destroys. More importantly, Jedi Knight Luke has finished his training and, armed with the truth about his father and sister, has set out to stop them no matter the cost. Ben and Yoda want Luke to kill them, considering them lost forever, but Luke thinks there might just be another way…",
                    "score": 15,
                    "author": "Randolpho"
                },
                {
                    "level": 1,
                    "comment": "Maybe that should be the Taika movie.",
                    "score": 2,
                    "author": "Calfzilla2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the present day of the story, I don’t wanna see Obiwan playing hero, even if it’s small scale. That’s so boring for his character at this time. \n\nSeason 1 ends with him entering a cave. So why not make this the season all about his cave “test” so to speak, being his force ghost training, perhaps having to look back on his life to come to peace with an unease in his mind; that he never actually chose the Jedi life for himself, given away by parents without knowing why, raised as a monk/soldier not unlike the clones he commanded. \n\nWe’ve spent the entire saga on the special Jedi outliers and their hero journeys. But Obiwan, the prototypical Jedi, the product of devotion to the Jedi way, is the best character to explore the actual themes of sacrifice and lack of agency that every Jedi experiences. I mean we still haven’t seen the real day in the life of being raised as a Jedi youngling at the temple. Who better than the first on screen Jedi to show us this. \n\nWith no more Order around to enforce consequences, this would be Obi-Wan’s true test of discovering what his own beliefs truly are. Would he go and be with a Satine now? Why or why not. Will he choose to regurgitate everything he learned for Luke, or perhaps take a page outta his masters book and truly decide for himself what he thinks about the rules?",
            "score": 11,
            "author": "DCmarvelman"
        },
        {
            "level": 0,
            "comment": "Please for the love of all that is holy get better writers and directors. Those little kid chase sequences were the worst thing I've seen on TV since, uh, Book of Boba Fett. So not that long, I guess.",
            "score": 119,
            "author": "Kahzgul",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not as bad as the roadblock scene. Guys, just walk around it. Nobody’s there.",
                    "score": 35,
                    "author": "caligaris_cabinet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought he was trying to open the gate so he could take the truck through the checkpoint. Then he just continues walking through by foot and it's at this point I've checked out on obiwan as a character. Apparently he lost his IQ along with his force powers over the years",
                            "score": 3,
                            "author": "at_midknight"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mcgregor just wants a non COVID production season and a chance to redeem the mixed response of the first season.",
            "score": 9,
            "author": "kgb17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think he deserves to get it.",
                    "score": 7,
                    "author": "Jaikarr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m all for it. It was a fun series but wasn’t all it could be.",
                            "score": 2,
                            "author": "kgb17"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "only if we get better story and actors. Idk maybe focus on Kenobi also in the series, just a thought. There was not a lot of kenobi driving the plot. He was sitting next to a driving seet of a garbage truck.\n\nThe series was pretty bad, on every account, even the cgi was abysmall.\n\nChange in showrunners is a must. They missed a big mark on how to deal with getting cut from the order how every single person that you have known is no more and the child that you protect is the only hope, kenobi in forefront protecting the child from empire. Instead we got what we got. I wouldnt mind it when it would have a good script. Just the thought that they made kenobi john wick is so stupid. And this is just a tip of the iceberg of that season",
            "score": 6,
            "author": "thedavv"
        },
        {
            "level": 0,
            "comment": "If showrunners with just the competency (all we’re asking for at this point), not to mention the *talent*, of Andor’s showrunners got behind a second season of Kenobi and made a compelling, character-driven piece about Vader’s unhinged search for Obi-Wan after their most recent duel - while Obi-Wan grapples with how to keep Luke from making his father’s mistakes - well, then that could really be something. It would absolve Season 1’s many flaws in my opinion.",
            "score": 5,
            "author": "RedTexas23"
        },
        {
            "level": 0,
            "comment": "Honestly, I loved much of the first season. It even included one of my favourite Star Wars moments of all time, across all types of media (you know which one I mean). My only gripes were with some of the directing and the fact that some of it looked really cheap, for instance the quarry encounter and the Imperial checkpoint scene, which were clearly shot somewhere in California. The logistics of that checkpoint made no sense, Vader letting Kenobi being dragged away from a fire which he could have just walked around made no sense, the little squad of stormtroopers made no sense and some of the backgrounds and CGI were a bit off. In a stark contrast to the amazing production value of Andor, Kenobi seemed to rely too hard on the volume and its budget was stretched too thin. However, as mentioned above, there were also many things about it that I truly loved and that always excite me about getting to this show on each chronological re-watch of the saga that I do. If they were to iron out the problems that this first season had in a potential second season (either a higher budget with more real locations or a shorter season with better pacing, that makes more use of its budget, as well as fewer awkwardly directed moments like Leia’s abduction by Flea) and if they come up with a story worth telling, I’ll be all for it!\n\nThings that I could see them cover in a second season would include:\n\n- Obi-Wan training with Qui-Gon’s force ghost and learning to become one with the force.\n\n- Obi-Wan having a chat with Yoda through the force.\n\n- Kenobi protecting Luke and the Lars homestead, as seen in the comics. Maybe even Luke experiencing an adventure or two with this crazy, old and mysterious wizard named Ben.\n\n- A live-action recreation of Obi-Wan’s final confrontation with Maul from Rebels. Since we’re seeing a live action Ezra in Ahsoka, this could easily serve as a thematic “crossover” with that show and give us Obi-Wan’s perspective of the excellent “Twin Suns” episode from Season 3 of Rebels. Bear in mind that many more casual fans don’t watch the animated shows. They may have caught glimpses of Maul’s return in TCW and they’ve seen him in charge of Crimson Dawn in SOLO, but thus far, they have had no closure on the entire matter.\n\n- Reva’s story needs to be continued. To make amends for her many sins as an inquisitor, I could see her become some sort of force-wielding samurai’esque vigilante, who may even support and protect The Path in helping more Jedi or other persecuted force users into safety. A plot surrounding Reva and The Path could be what gets Obi-Wan off of Tatooine for another quick adventure and it could introduce us to other surviving Jedi, including Quinlan Vos, who had received a teasing shoutout in the first season. \n\n- I don’t want Obi-Wan to have yet ANOTHER confrontation with Vader, though. Their duel in season 1 was the perfect “penultimate confrontation” before their final rematch on the Death Star in ANH. However, I wouldn’t mind Vader cameos here and there when he orders his inquisitors to go after The Path and the Jedi survivors. \n\n- The “final battle” could see the Jedi survivors (led by Obi-Wan and Reva) battle a group of inquisitors in order to buy the other refugees of The Path time to escape. The (former) Jedi realise that their purpose and destiny is not to destroy the Sith and restart the old Jedi Order, but instead to save the “children of the force”, who are among the refugees and the future generation who must bring balance back to the force. Sacrificing their own lives in order to preserve this future generation is a “much more Jedi thing” to do than simply wiping out one’s enemy. Reva, as well as Quinlan and most of the surviving Jedi, sacrifice themselves for this greater good. Obi-Wan, however, is given an opportunity to escape by Reva in her final moments, as she knows that Kenobi is watching over the most important of all these “children of the force” back on Tatooine. Upon his return to that desert backwater, we’d have the perfect moment for a much wiser Jedi Master, who has fully embraced his purpose and who is now at peace, to confront a vengeful and twisted Maul.",
            "score": 5,
            "author": "MrKevora",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please if they do another season, just let it focus on Obi-Wan\n\nThe show really should’ve narrowed down on his journey back to the force and the emotional stakes of Vader",
            "score": 6,
            "author": "Papa_Pred"
        },
        {
            "level": 0,
            "comment": " If there is another season then… NO MORE KID SIDEKICKS PLEASE",
            "score": 5,
            "author": "Gerb575"
        },
        {
            "level": 0,
            "comment": "It’s kind of the roll of a lifetime and you see some people run away from it. \n\nHe’s the next Mark Hamill",
            "score": 18,
            "author": "NYVines"
        },
        {
            "level": 0,
            "comment": "It would need to be completely reimagined. That show was utter nonsensical rubbish.",
            "score": 14,
            "author": "Nix2058"
        },
        {
            "level": 0,
            "comment": "I'm not saying they should or shouldn't, but the decision to run a show or not should be based on if a story still needs to be told, not whether an actor is \"begging to do it\" or not.",
            "score": 3,
            "author": "GoreSeeker"
        },
        {
            "level": 0,
            "comment": "Seeing Liam Neeson again as Qui-Gon brought the biggest smile to my face. I will say that!",
            "score": 3,
            "author": "AVeryGayButterfly"
        },
        {
            "level": 0,
            "comment": "I'd love another season. I really don't think S1 was that bad but I also wish if they did get a S2 it'd focus solely on Kenobi and him learning from Qui-Gon",
            "score": 3,
            "author": "ShawshankException"
        },
        {
            "level": 0,
            "comment": "It was just so pointless, really. The whole thing was contrived. Would love to see more live action kenobi but not like that",
            "score": 27,
            "author": "sailing_steve"
        },
        {
            "level": 0,
            "comment": "We wanted to praise his character, but he ended up as a side character… :(",
            "score": 31,
            "author": "GalaticCuriousity"
        },
        {
            "level": 0,
            "comment": "If it's as good or better than season one, I'm down for it.",
            "score": 71,
            "author": "Daggertooth71",
            "replies": [
                {
                    "level": 1,
                    "comment": "How could it be better? There was no story to tell in the first place. The show made that painfully obvious.",
                    "score": 24,
                    "author": "Ok_Nefariousness9736"
                },
                {
                    "level": 1,
                    "comment": "That's a very low bar",
                    "score": 72,
                    "author": "chillednutzz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y'know the Kenobi show was something I always wanted alongside a KoToR movie, and Disney Lucasfilm some how fricked it up.\n\nI'm not sure how they keep doing it but they do it's almost becoming like an art form at this point.\n\nEdit: I forgot to mention that I feel terrible for Hayden and Ewan cause damn man the true potential was insane 😔",
            "score": 28,
            "author": "RakuraiRyu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please no. If they wanted to make multiple seasons they should’ve saved the showdown with Vader for the series finale. Anything else would be anticlimactic, but they shouldn’t just use Vader again.",
            "score": 7,
            "author": "TheHondoCondo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Totally - just an entire season of lazily-stunt-casted clowns unable to catch a 5-year old, stepping on cartoon rakes or falling in giant barrels marked XXX and they come out hiccuping and pirouetting with birds flying around their heads",
            "score": 5,
            "author": "-SkarchieBonkers-"
        },
        {
            "level": 0,
            "comment": "Just... reboot it, honestly. The first one was awful.",
            "score": 5,
            "author": "Synmachus"
        },
        {
            "level": 0,
            "comment": "There wasn’t enough of a story to tell for the first season and that’s a big part of the reason why it suffered.\n\n\nThere is absolutely nothing they could do for second season. Hard pass for me",
            "score": 13,
            "author": "lanadeltaco13"
        },
        {
            "level": 0,
            "comment": "#Yes, please, just an entire season of Leia being chased through the woods, and Kenobi doing things that directly contradict A New Hope.  /s",
            "score": 16,
            "author": "Kbdiggity"
        },
        {
            "level": 0,
            "comment": "Somehow Reva had returned..",
            "score": 8,
            "author": "DeathThroe_Tull"
        },
        {
            "level": 0,
            "comment": "That makes one of us",
            "score": 7,
            "author": "KimJontheILLest"
        },
        {
            "level": 0,
            "comment": "I really like Vivien. She's a real sharp kid.",
            "score": 3,
            "author": "Spudtron98"
        },
        {
            "level": 0,
            "comment": "Would love a team up with Old man Obi and old man Rex yelling at younglings to get off their sand.\n\nJ/k: but an obi and Rex team up would be great.",
            "score": 2,
            "author": "Dynas86"
        },
        {
            "level": 0,
            "comment": "Trying to find reasons for there to be a second season.  A reason good enough for Obi-Wan to once again put his hermit life of protecting Luke aside for the greater good.  \n\nWell, in season one we heard about The Path, the way to safety for Jedi and force sensitives on the run.  He wouldn't ever get purposely involved in this as it puts his personal mission at too much risk.  Perhaps The Path starts running through Tatooine.  Obi senses this and knows that this many force sensitives running through Tatooine puts Luke at too great a risk.  Obi goes to plead with whoever is in charge of The Path on the planet and encounters Quinlan Vos with a fresh group of force sensitives who just arrived and have nowhere to go...someone may be following them\n\nObi realizes the only way to get Quinlan to move his Path outpost (and this protect Luke) and save this group of force sensitives from certain death is to lead them to safety himself, perhaps to a place he knows they will be safe forever.   Then ..adventure happens\n\nYeah okay, do a second season.",
            "score": 2,
            "author": "Elephlump"
        },
        {
            "level": 0,
            "comment": "Honestly, although I really enjoyed the Obi Wan series, I feel that it's time to finally retire all these characters. We don't need anymore shows/films taking place in the Skywalker era as it's already feeling so boring and dull. We need a new era far away from the Skywalkers, away from everything that's happened, either one set in the distant future or in the past during the Great Galactic War between the Jedi order and Sith Empire.",
            "score": 2,
            "author": "jish5"
        },
        {
            "level": 0,
            "comment": "Can we just get 8 episodes of Leia outrunning the clumsiest empire cronies and obi-wan getting blitzed on death sticks while gambling away all his money on pod racing. Make it happen",
            "score": 2,
            "author": "castious"
        },
        {
            "level": 0,
            "comment": "Then stick to adventures on Tatooine, with Obi Wan training with QuiGon, watching over Luke &amp; his friends, interacting with sandpeople &amp; Greedo &amp; Watto &amp; various podracers, with visits to Anchorhead/Mos Eisley/Mos Espa/Beggar’s Canyon/previously unseen Tatooine cities &amp; landmarks. Only going offworld for important reasons, like maybe going to Naboo to Padme’s grave. With flashbacks to the Clone Wars.",
            "score": 2,
            "author": "DJ_HazyPond292"
        },
        {
            "level": 0,
            "comment": "I think one season is fine. What would season 2 even be about?",
            "score": 2,
            "author": "goblue202320242025"
        },
        {
            "level": 0,
            "comment": "im sure he is, keeps him in the lime light as long as possible for a pretty nice role.  but literally of any project in star wars that does not need a season 2 its kenobi.  like, sometimes the best story you can tell is what you dont tell.  i can maybe see the appeal to make one season or movie about kenobi's life between episodes 3 and 4 to fix any plot holes or other issues, but like, where would they go from that? at this point it would be flat out ridiculous to have anakin and obi wan fight a third time, where obi wan continues to for some reason let the guy about to kill billions of people by blowing up planets to live? and who else besides darth vader does obi wan fight or struggle against?  they establish during kenobi that hes pretty far above the level of the inquisitors.  i can maybe see them giving reva a show or something, but then dont just call it season 2 of kenobi give her her own show and make it about her, even if maybe obi wan appears in that show if he isnt the main character he shouldnt be treated as such.  but who else besides the inquisitors or darth vader would obi wan have a climatic final battle with like most fans would expect?  introduce a new random dark force user?  isnt that becoming a bit cliche?   and the more you do go into details of the lives of people between episodes 3 and 4 it only opens the way to possibly more and more plot holes popping up.",
            "score": 2,
            "author": "JefferyTheQuaxly"
        },
        {
            "level": 0,
            "comment": "No thanks. If they change the writers maybe but otherwise I’m not interested",
            "score": 2,
            "author": "decross20"
        }
    ]
}