{
    "id": "144a7th",
    "score": 4,
    "title": "As much as Disney era isn't the greatest, this design will always hold up as being fresh and innovative. Agree?",
    "author": "adakin01",
    "date": 1686233107.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144a7th",
    "media_urls": [
        "https://i.redd.it/6zsd2korws4b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Rogue One was a gem among Disney era",
            "score": 5,
            "author": "Monday_Shake"
        },
        {
            "level": 0,
            "comment": "The hell are you talking about? The Disney era as a whole has been pretty great. \n\nLiterally the ST is one of the smallest parts of the \"Disney era\" and people act like because they didn't like it (despite it being a massive success) that the entire run of Star Wars stories hasn't been great. The books, the types of stories being told in games, the TV shows, comics, High Republic.. All among their peaks within Star Wars.\n\nWe are getting more Star Wars at a much more consistently \"good\" level of quality than ever before.",
            "score": 3,
            "author": "spaghettiAstar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well yeah its making money but thats because the juggernaut of disney pushing it. It could be better, should be better and can be better. Its a polished turd with a pr campaign except andor, star wars jedi and even mando sucks now",
                    "score": 0,
                    "author": "adakin01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would suggest you branch into other stories then.\n\nStar Wars as a mass appeal franchise (the films, live action TV shows) are really no different now from prior to Disney. The issues that people point out with these stories are present in all the Lucas produced stuff too. Random cameos for no real apparent reason, continuity errors, logical errors, characters doing things that don't make sense, characters power levels changing at seemingly random times, over choreographed action scenes, weird characters doing random things in the background during a 'fight', cheesy jokes that don't land, iffy dialogue, the John Williams music generally being the best/most consistent part of the films, etc. It's all there, because the people making Star Wars now are largely doing it from the exact same approach that George Lucas did then. Really Andor is the only one that's different, which is why not only is it an outlier for the Disney era, it's an outlier of *all* Star Wars in general. \n\nI just don't really see any significant change in quality between the Lucas stories and the Disney stories. They're different, sure, and I have my personal preferences, there are things I like and dislike about each one, but in general they're just not that different in terms of how good they are. The only difference really is that we have a significant chunk of people who are happy to gloss over issues in one story and then claim that the exact same thing ruins everything in another story. \n\nWhen you get beyond that, that's when you can really see the jump in overall quality though. Sure there were fun stories in legends that many of us love, especially those of us who experienced them as kids when there wasn't anything else to consume. There were also a *lot* of bad stories, and just bad things being put into the stories. There was a lot more inconsistency from story to story from the quality, the characters, everything. That sort of up and down isn't really present anymore in the wider Star Wars stories. Yes there are obviously some stories better than others, and some of the peaks aren't as good as some of the peaks in legends (others I argue are higher than legends, at least IMO), but the valleys, or the lows, are no where near as bad as they were in legends.\n\nStar Wars, as a whole, has become more consistently better under Disney.\n\nThe films and live action stuff are mostly the same, but the expanded universe has gotten a massive upgrade, and it's pumping out hundreds of high quality content every year.",
                            "score": 1,
                            "author": "spaghettiAstar"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The shows are pretty good tho",
            "score": 1,
            "author": "Middle_Novel9904"
        },
        {
            "level": 0,
            "comment": "Rogue one and rise of Skywalker were the only good MOVIES, the other ones Disney made were so boring",
            "score": 0,
            "author": "Middle_Novel9904"
        }
    ]
}