{
    "id": "144bjv9",
    "score": 0,
    "title": "Is Thrawn viewed as the laughing stock of the Imperial Navy?",
    "author": "AppointmentSpecial",
    "date": 1686236338.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144bjv9",
    "media_urls": [],
    "other_urls": [],
    "postText": "To be clear this is about the new Thrawn from Rebels, not the original.\n\nThe Thrawn we see is in an Empire that had not yet lost a significant battle to the Rebels. He pushes the Defender project and builds the production facility on Lothal. He even gets one of, if not the, top aces of the Empire. He then proceeds to get destroyed.\n\nHe commands during the first significant loss the Empire faces from the Rebels. He gets the ace pilot killed. He is utterly defeated in a time when the Empire isn't losing and loses tons of resources in doing so.\n\nIt would seem to me, that he would then be the laughing stock of the Imperial Navy. Before they start taking the Rebellion as a credible threat, this guy already lost to them, and badly. I can't see Imperials still viewing him well, or at least most Imperials.\n\nThough in the Mandalorian they seem to view him highly. They even talk about his return like the second coming. A feeling of, 'everything will be fine when Thrawn returns.' This seems odd to me given his situation.",
    "comments": [
        {
            "level": 0,
            "comment": "Not to worry, the canon *Thrawn* novels go out of their way to show that the Lothal rebels were an outlier, and Thrawn effortlessly runs circles around all other opponents (insurgents, Nightswan, the Grysk, a corrupt Imperial official). \n\nTimothy Zahn takes great pains to hype his OC as the smartest, most amazing dude in the galaxy, capable of producing *Sherlock*-level magic trick solutions out of virtually nowhere while others (usually sidekick Eli Vanto) gush about what an honor it is to watch a genius at work.\n\nPlus he’s tight with the Emperor and Darth Vader, so no one would dare laugh at him.",
            "score": 10,
            "author": "Sir_Douglas_of_Fir"
        },
        {
            "level": 0,
            "comment": "Well only if you consider Filoni’s fanfic that appropriates characters he didn’t create and bastardizes them in order to prop up his own OCs, canon. If not then no.",
            "score": -3,
            "author": "Independent-Dig-5757",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fucking space whales",
                    "score": 0,
                    "author": "Comfortable_Sir_4953"
                },
                {
                    "level": 1,
                    "comment": "Always refreshing to see someone else recognize Filoni for the complete hack that he is.",
                    "score": -2,
                    "author": "Torbjorn_ReadytoWork",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup he’s done so much damage to the saga honestly. Everything from retconning the superior CWMMP, to sticking his precious OC all over the timeline, even going as far as resurrecting her. He also sacrifices good storytelling for nostalgia, cameos, callbacks, and references e.g. canonizing Stormtroopers being bad shots and so on. Man I hate it when Star Wars becomes meta.",
                            "score": 0,
                            "author": "Independent-Dig-5757"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seriously, where was this guy at the battle of Endor?",
            "score": 1,
            "author": "Gloria_64",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Outer Rim, IIRC",
                    "score": 1,
                    "author": "Spider95818",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thrawn the chicken",
                            "score": 1,
                            "author": "Gloria_64"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well I guess we’re about to find out aren’t we",
                    "score": 1,
                    "author": "Taco_In_Space",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm sure they will portray this character as a coward and insecure",
                            "score": 1,
                            "author": "Gloria_64"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the new canon is that the space whales kidnapped him and stranded him in the Outer Rim for a decade or so (Rebels until Ahsoka).",
                    "score": 1,
                    "author": "Su_Impact"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say no. I think they mostly were relieved he was gone. The officers within the imperial navy were always trying to one up each other in order to gain more power through there positions. Most in the navy didn’t respect thrawn or understand how he was granted his station to begin with. The people who served under thrawn had great respect for him even though he wasn’t a human. If anything, I’d feel that the rest of the imperial navy was glad he was out of the way because it would allow themselves a better chance at promotion and even the attention of the emperor.",
            "score": 1,
            "author": "A-yo-Hov"
        }
    ]
}