{
    "id": "144bpk1",
    "score": 0,
    "title": "Can we please have a Junior Jedi Knights television series?",
    "author": "Puterboy1",
    "date": 1686236685.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144bpk1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Disney can just label it as Legends with a disclaimer saying it is set in an alternate universe. If it follows the source material very faithfully, fans will be happy and their faith will be restored.",
    "comments": [
        {
            "level": 0,
            "comment": "Don't be silly. This would require the LucasFilm to actually do something nice for sake of old fanbase. We all know that this is the last thing they would ever do, even if their children begged for it.",
            "score": 3,
            "author": "Kyle_Dornez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then we will force them to.",
                    "score": -1,
                    "author": "Puterboy1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fox approached Lucasfilm about a **Young Jedi Knights** animated series in 1996 but the PT was in pre-production so new visual storytelling was on hold.\n\nI'm finishing up YJK now (enjoying **Return to Ord Mantell** in Text-to-Speech audio form) then will have to backtrack to **Junior Jedi Knights** due to my misunderstanding of the timeline.\n\nI'm glad that you seem to have enjoyed them and look forward to early Anakin Solo and Tahiri adventures.\n\nFrankly, I feel that the most likely way fans will get these stories adapted is to do what 'Star Trek Continues' and 'Legacy of The Force' to a lesser extent have done.\n\nI would love high quality comic adaptations of the post-ROTJ original canon taking into consideration the human lifespan in AGFFA as implied in **The Truce at Bakura**.\n\nBottom line, I would love to see it but I think that buying \"Legends\" books sends a stronger message than crowdfunding another billboard.",
            "score": 0,
            "author": "LucasEraFan"
        }
    ]
}