{
    "id": "144d7m9",
    "score": 0,
    "title": "I’ve made the best lightsaber color test I could find",
    "author": "Argentnerd",
    "date": 1686240203.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144d7m9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve started making a google spreadsheet for how certain things affect a lightsabers color. I made a 6 question quiz that can generate a unique hex code for a lightsaber color that matches you. If you comment your answers, I’ll tell you what your color is. \n1: preferred form of lightsaber combat (1-7)\n2: Which order would you join? ( Jedi, grey Jedi, or sith )\n3: If you had extra time what would you study ( knowledge of the force, lightsaber combat, or force abilities)\n4: preferred title ( knight, guardian, consular, Sith Lord, or sentinel)\n5: what is the best way to disarm an opponent? ( destroy their weapon, take their weapon, remove a limb, or kill them)\n6: preferred crystal type: (synthetic, Bled, Ilum, Crystophsis, obsidian, kholen, or healed sith crystal)",
    "comments": [
        {
            "level": 0,
            "comment": "Tbh, I subscribe to the idea of getting a clear kyber crystal and letting the force decide my color. I have no favorites. But let's play ball;\n\n- preferred lightsaber form: 5\n\n- order: Jedi (and don't get me started on the gray jedi debate)\n\n- extra curricular: force abilities (but piloting in relaity)\n\n- title: knight\n\n- best way to disarm an opponent: honest dialogue (take their weapon)\n\n- preferred crystal: idk the differences between these.\n&gt;Ilum, Crystophsis, obsidian\n\nBut if I lose a friend to the darkside I'd go purified sith.",
            "score": 1,
            "author": "We_The_Raptors",
            "replies": [
                {
                    "level": 1,
                    "comment": "Assuming your crystal isn’t healed from a friend who has fallen to the dark side, the hex code for your lightsaber color would be 26B0F1 (a bright blue color). If you did have a healed crystal, it would be white and if the force attunes it to you then it may have a faint blue color (hex code AFDFD7)",
                    "score": 1,
                    "author": "Argentnerd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely agree that my ideals most line up with a shade of blue. It's what most of those quizzes I'd take back in the day would have given me. Orange (if it's the tinkerers color) being the typical 2nd place.\n\nWhite has the most meaning though if you care for the person whose lightsaber you are purifying.",
                            "score": 0,
                            "author": "We_The_Raptors"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Preferred form: 6\n\nOrder: Sith\n\nSpare time activity: lightsaber combat\n\nTitle: Sith Lord\n\nBest way to disarm: Take weapon (forcefully)\n\nCrystal: synthetic",
            "score": 1,
            "author": "ConduckKing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for not seeing this until now, for you I got #f44a25. This is a red color shifted closer to orange/yellow than it is to purple",
                    "score": 1,
                    "author": "Argentnerd"
                }
            ]
        }
    ]
}