{
    "id": "144fiyt",
    "score": 3,
    "title": "Obi-Wan was the golden child in his master/student line",
    "author": "RubixTheRedditor",
    "date": 1686245502.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144fiyt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Dooku fell the dark side. Qui-Gon wasn't very agreeable with the council. Anakin fell to the dark side. Ahsoka left the order. Obi wan was the perfect one in the eyes of the council.",
    "comments": [
        {
            "level": 0,
            "comment": "I mean, if being agreeable with the jedi council is the only criteria then yes. But Qui Gon and Ahsoka were some of the best representatives of what jedi should be in the order. They're *far* from being failures.",
            "score": 13,
            "author": "We_The_Raptors",
            "replies": [
                {
                    "level": 1,
                    "comment": "Er sorry probably should have specified in the eyes of the council",
                    "score": 1,
                    "author": "RubixTheRedditor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's fair, but even still, Yoda would know and fully appreciate the contributions of Qui Gon/ Ahsoka as well. He doesn't strike me as the type to judge someone's entire worth based on who is best at following orders",
                            "score": 3,
                            "author": "We_The_Raptors",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I figured but In the council eyes qui gon and ahsoka are good but obi wan was perfect/golden child",
                                    "score": 1,
                                    "author": "RubixTheRedditor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Definitely, not saying Obi Wan isn't a golden child. He's almost the ultimate encapsulation of what a jedi should strive to be.",
                                            "score": 3,
                                            "author": "We_The_Raptors"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about Yoda? He was Dooku's master after all. But yeah, post Yoda, Obi-Wan was the \"best\" jedi.",
            "score": 2,
            "author": "blackbelt2OO8"
        }
    ]
}