{
    "id": "144mllm",
    "score": 0,
    "title": "Question as a newbie fanatic…",
    "author": "Misunderstood_Z",
    "date": 1686261701.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144mllm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why do most people say that Anakin in his prime was more powerful than Darth Vader ever was? If Anakin was still a light side user how could he be more powerful than the dark side using Vader?",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; 'Is the Dark Side stronger?' \n\n&gt; 'No, no, no. Quicker, easier, more seductive.'\n\nThe darkside isn't more powerful, its fuel and boons prove useful in combat but we see time and time again that a lightsider working with the force can overcome this.",
            "score": 9,
            "author": "NerdHistorian"
        },
        {
            "level": 0,
            "comment": "Because the dark side isn’t more powerful than the light. As Yoda says in empire strikes back it’s quicker and easier, but not more powerful.",
            "score": 6,
            "author": "FaithlessnessFew9127",
            "replies": [
                {
                    "level": 1,
                    "comment": "But doesn’t that depend on the user? It takes being a master with light to even come close to someone like Vaders dark side mastery",
                    "score": -4,
                    "author": "Misunderstood_Z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's just Anakin. He's powerful no matter what. Note that it was his arrogance and pride that made him lose at least 3 duels to Obi-Wan, and didn't finally beat him until he was old and cornered without escape on the Death Star.",
                            "score": 3,
                            "author": "N0V0w3ls"
                        },
                        {
                            "level": 2,
                            "comment": "I think of it like this. Imagine a darksider wandering up a mountain. they are able to quickly find a shortcut to get near the summit but will eventually stumble over an impassable crevasse. Whilst a lightsider will take the more winding road up the mountain but will eventually reach the summit.",
                            "score": 1,
                            "author": "SaltySAX"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think when people say that, they refer to him beeing diminished by him beeing crippled and trapped in his armor.\n\nHe is at his top when he storms the jedi temple during order 66.",
            "score": 3,
            "author": "Bengamey_974"
        }
    ]
}