{
    "id": "144q4tk",
    "score": 3,
    "title": "When Vader tempts Luke to join his side in ruling the galaxy, was there true father-son affection? Or only Vader's interest to overthrow the emperor",
    "author": "ConsistentToday2891",
    "date": 1686270441.0,
    "url": "https://www.reddit.com/r/StarWars/comments/144q4tk",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/zgnf4a2bzv4b1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2a3121014eb7b589ebf1139db072fdfbff3c12f0"
    ],
    "postText": "&amp;#x200B;\n\nhttps://preview.redd.it/zgnf4a2bzv4b1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2a3121014eb7b589ebf1139db072fdfbff3c12f0",
    "comments": [
        {
            "level": 0,
            "comment": "There was genuine familial interest, but like all things it was twisted and corrupted by the dark side inside vader into a evil parody.",
            "score": 6,
            "author": "NerdHistorian"
        },
        {
            "level": 0,
            "comment": "I believe there was certainly a mix of both there.  He'd rather have a ruler he loved than one he didn't.  It's why we see him make the same offer to Padme in ROTS.\n\nHowever at this point he's seeing Luke as more of a possession he can claim and bring to his side.  He has little consideration that he's making this offer just after he cut off his son's hand and tortured his loved ones to get him to come.",
            "score": 4,
            "author": "RandomTrainer101"
        },
        {
            "level": 0,
            "comment": "He goes from \"Young Skywalker\" to \"Luke...\"\n\nI think after he cut off his hand, Vader may have felt a little remorseful about harming him and that's why he essentially is pleading with him.  Remember, Vader wanted to freeze him.",
            "score": 3,
            "author": "lidolifeguard"
        },
        {
            "level": 0,
            "comment": "At the time of ESB? I wouldn’t use the term affection, I’d describe it more as a feeling of mutual self interest, strategic advantage, and a feeling that Luke would be loyal to him based on kinship",
            "score": 3,
            "author": "sodium111"
        },
        {
            "level": 0,
            "comment": "I think Return of the Jedi proves that he did love his son.",
            "score": 2,
            "author": "BestEffect1879"
        },
        {
            "level": 0,
            "comment": "Sith opportunistic motivations pushed by the dark side.",
            "score": 2,
            "author": "Markovanich"
        },
        {
            "level": 0,
            "comment": "A bit of both but I think it was predominantly the Sith side talking.",
            "score": 1,
            "author": "Darth_Karasu"
        },
        {
            "level": 0,
            "comment": "I think at that time it was only the dark side wanting someone with the potential power to beat the emperor, there wasn’t exactly any mercy shown during ESB. I think the remorse and mercy shown during Rotj when Luke refused to kill was the turning point.",
            "score": 1,
            "author": "Prize-Warthog"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Inside-Depth-7531"
        },
        {
            "level": 0,
            "comment": "I can never resolve this in my head.",
            "score": 1,
            "author": "kel2345"
        }
    ]
}