{
    "id": "1457qiv",
    "score": 4,
    "title": "What are some good stories on Order 66?",
    "author": "ant42onia",
    "date": 1686323218.0,
    "url": "https://www.reddit.com/r/StarWars/comments/1457qiv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have mostly watched the movies and some of the shows. However the tie in from the start of The Bad Batch and Kanan's trauma in Rebels was really compelling for me. I'm sorry I don't have time for a lot of books these days, but I would love any other recommendations of powerful stories that came out of that time period, short comics, etc.\n\nThank you!\n\nEdit to add: I am re-watching Clone Wars now, because I love that part of the story too. Any supporting comics or maybe a \\*short\\* novel would be right up my alley!",
    "comments": [
        {
            "level": 0,
            "comment": "So disney is really good at segmenting content. One of the threads on there are something along the lines of “the clone wars Essential episodes”\n\nThis will give you the episodes from “the clone wars” show combined with the movie Revenge of the Sith, the show “Tales of the Jedi” will give you the main plot of order 66",
            "score": 3,
            "author": "5tudent_Loans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I am actually rewatching clone wars now, I hadn't seen Tales of the Jedi yet but will. I was hoping some people had some other recommendations about the time period I may not have heard of, like in comics and such, because it's such a critical and powerful moment in the history of the world.",
                    "score": 3,
                    "author": "ant42onia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Legends novel,  Republic Commando: Order 66 is really good.",
            "score": 3,
            "author": "astupidfckingname",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I will look into it!",
                    "score": 1,
                    "author": "ant42onia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd argue the best story can found in season 7 of the *Clone Wars*.  If Anakin hadn't been so harsh in Ahsoka's training she never would've made it. If Ahsoka and Rex weren't so loyal to each other they never would've made it.",
            "score": 5,
            "author": "ReasonAndWanderlust",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is another story that made me want more! I am rewatching the clone wars now because it does do such a good job of showing that time period. And then the fallout on Rex's character shown in both The Bad Batch and Rebels was really well done",
                    "score": 3,
                    "author": "ant42onia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll second the recommendation for the book \"Republic Commando: Order 66\". If you read the first 3 books in the series first it will hit harder, but the first time I read it I hadnt read the first 3 books and still loved it.",
            "score": 2,
            "author": "rukivverh5995",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh good, I feel bad missing out on stuff but sometimes you just don't have time for all the things you want to catch up on.",
                    "score": 2,
                    "author": "ant42onia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The full run of Kanan's comic run goes into that, shows emotional bonds that Depa Billaba and Caleb Dume have to the Clones both before and during O66. The aftermath of O66 shows some retrospect in the form of flashbacks. TPB is the way to go, or digital. The single issues are outrageously priced right now.",
            "score": 3,
            "author": "wxnavy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you friend! I'm a bit older and out of touch with the lore and comics, so this was exactly the kind of recommend I was looking for. Life gets in the way of keeping up with it all these days!",
                    "score": 4,
                    "author": "ant42onia"
                }
            ]
        }
    ]
}