{
    "id": "145lvw6",
    "score": 0,
    "title": "Technically Annakin did bring balance to the force.",
    "author": "DipFizzel",
    "date": 1686357632.0,
    "url": "https://www.reddit.com/r/StarWars/comments/145lvw6",
    "media_urls": [],
    "other_urls": [],
    "postText": "If you think about it, there was only a couple sith lords active compared to the dozens of jedi running around. So when Annakin goes on as Vader and destroys the order, he did indeed bring balance. At least for a bit there, before he turned jedi into inquisitors and whatnot.",
    "comments": [
        {
            "level": 0,
            "comment": "That’s not what balance is.",
            "score": 14,
            "author": "laserbrained"
        },
        {
            "level": 0,
            "comment": "Balance doesn't mean equal numbers of Jedi and Sith.",
            "score": 11,
            "author": "Gorguf62"
        },
        {
            "level": 0,
            "comment": "This is one of the oldest interpretations in the fandom, lol. I remember seeing memes and stuff about this a decade ago.\n\nAnd unfortunately, according to Lucas's interpretation of \"balance in the Force\", it has always been inaccurate.",
            "score": 6,
            "author": "Jurgepoo"
        },
        {
            "level": 0,
            "comment": "Every few days someone posts this and every few days someone is wrong",
            "score": 11,
            "author": "UniqueUsernameAndy",
            "replies": [
                {
                    "level": 1,
                    "comment": "And worded almost the exact same way. It’s like deja vu.",
                    "score": 6,
                    "author": "bone_china"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anakin did bring balance. It just took longer than expected. \n\nSidious was the imbalance that needed to be corrected. Anakin greatly weakened Sidious with the events on DS2. That allowed time and events to complete the prophecy.",
            "score": 3,
            "author": "Grecanis"
        },
        {
            "level": 0,
            "comment": "Balance in The Force isn't balance of Force users.\n\nIt's balance in the nature of The Force as Yoda described \"Life creates it. Makes it grow...\"\n\nThe Sith are shown destroying planets (The Empire, presided over by a Sith Lord) where no life will grow.\n\nLess life = less of The Force\n\nWe don't need an equal number of assailants and surgeons for a balanced society.\n\nDeath comes naturally to mortals. In nature, organisms feed off the physical forms of expired life to thrive.\n\nThe Force is derived from the natural cycle of life and is in balance when Guardians of Peace and Justice support life, when no mass destroyers are using The Force to subjugate and kill off life.",
            "score": 3,
            "author": "LucasEraFan"
        },
        {
            "level": 0,
            "comment": "That’s not how the force works! As Han would say. \n\nThe Sith were a cancer onto the force and needed to be removed. Balance is the Sith no longer existing.",
            "score": 6,
            "author": "FaithlessnessFew9127",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's never going to happen. \n\nAlthough Lucas equates balance as being in the light. Even he has said one can never fully eradicate darkness.",
                    "score": 1,
                    "author": "Grecanis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah you misunderstand me. Did I say darksiders? No just the Sith. The Sith were uniquely evil. That’s my take anyway",
                            "score": 2,
                            "author": "FaithlessnessFew9127",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sith use darkness in their teachings. Their ultimate goal is to master the darkness and use it to gain unlimited power.\n\n. . . and I don't recall using the name \"Darksiders\" in my post.",
                                    "score": 0,
                                    "author": "Grecanis"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thats like thinking you bring balance letting te same name of number of Jews and Nazis.",
            "score": 4,
            "author": "MantisReturns"
        },
        {
            "level": 0,
            "comment": "From a certain point of view.",
            "score": 2,
            "author": "JackPiece03"
        },
        {
            "level": 0,
            "comment": "The Force isn't the people using it.",
            "score": 2,
            "author": "LivingInABarrel"
        },
        {
            "level": 0,
            "comment": "The whole balance prophecy is one of the dumbest things that came out of the Prequels.",
            "score": 1,
            "author": "CeymalRen"
        },
        {
            "level": 0,
            "comment": "\\*Me banging my head against the wall\\*\n\nThat's \\*smack\\* not \\*smack\\* how \\*smack\\* that \\*smack\\* works \\*smack smack smack\\*\n\nBalance doesn't mean equal numbers of good and bad, it means 0 bad.",
            "score": 1,
            "author": "danielhollenbeck13"
        },
        {
            "level": 0,
            "comment": "The sith are at their most powerful when there is only 2. It wasn’t balanced at all",
            "score": 1,
            "author": "SnooJokes706"
        },
        {
            "level": 0,
            "comment": "Annakin must be Luuke’s father right OP?",
            "score": 1,
            "author": "SevanOO7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who is luuke? That a new character? Some knockoff of luke perhaps?",
                    "score": 1,
                    "author": "DipFizzel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m messing with you about “Annakin” bro.",
                            "score": 1,
                            "author": "SevanOO7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rey was the only Jedi strong enough to bring balance to the force. No one else even came close.",
            "score": -2,
            "author": "Ambitious_Truck6457"
        },
        {
            "level": 0,
            "comment": "Be careful. A lot of people a very against that idea. I've pushed for it since the RotS was released. But the full prophecy makes it even clearer.\n\n&gt;\"A chosen one shall come, born of no father, and through him ultimate balance in the Force will be restored.\"",
            "score": -4,
            "author": "Xandallia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because it’s false information that Lucasfilm’s has explicitly denied on multiple occasions?",
                    "score": 4,
                    "author": "KainZeuxis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any source besides George? He sold his story telling rights.",
                            "score": 0,
                            "author": "Xandallia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I compiled a short list the other day: \n\nhttps://www.reddit.com/r/StarWars/comments/144cb3g/question_about_ep1_to_ep3/jnfecen/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1&amp;context=3",
                                    "score": 1,
                                    "author": "in_a_dress"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You think modern society would be balanced if half the population were Karens?",
                    "score": 1,
                    "author": "getoffoficloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a false equivalence. The Force and Society are not the same, or similar at all.",
                            "score": 0,
                            "author": "Xandallia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Sith are Karens with super powers.",
                                    "score": 0,
                                    "author": "getoffoficloud"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apparently George Lucas modeled the jedi on buddism, in which balance (apparently again) us through inner peace. Personally though I found the force itself more relatable to taosim, which was a hugely popular thing in the 70s, and there your view i just. I prefer your view, but it might  ot be what George intended. Star Wars grew past him a long time ago though.\n\nAt least since the prequals and KOTOR series I feel the jedi to be more aligned to buddism, but also to be in the wrong, especially pre-order-66, just like they in 4k bby were in the wrong not to help against the mandalorians (again personal opinion). Their fear of the dark side leads to apathy which in itself could be considered evil, and imo caused revan and malak to go bad more so than their choices did. Crossing universes here, but tom holland spider man says it nice when he say something alin to \"if tou can do the things i can do, and not help,, it is almost like you did the evil act\"\n\nRambling here, but I agree anakin caused balance when he executed order 66, and yoda eludes to it with his \" a prophecy that misread could have been\". But george probably meant otherwise. Art is art though, and its in the eye of the beholder, if tou consider star wars art.",
            "score": 0,
            "author": "KGodvalley",
            "replies": [
                {
                    "level": 1,
                    "comment": "You think we'd have a balanced society if half of the country was this?\n\nhttps://youtu.be/Epfyeo1ycTU\n\nhttps://youtu.be/1_iSWDkJjDs\n\nYou think a balanced diet is half healthy food and half sweets?  You think perfect health is half healthy cells and half cancer cells?",
                    "score": 1,
                    "author": "getoffoficloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. But i believe a good person has both light and dark inside them. Dark does not equal evil. Only if you let darkness consume you.\n\nYour assumption about cells assumes that the dark side of the force is a cancer. The sith may be, but they dont strife for balance, they strife for passion. Jedi strive for peace. Imo balance is to strive for peace without disalowing emotion. Striving for feeling, loving, without letting the emotions consume you. It is ok to be angry when something bad happens, but not let the angre drive you to violence, revenge or forcing your views upon others.",
                            "score": 1,
                            "author": "KGodvalley"
                        }
                    ]
                }
            ]
        }
    ]
}