{
    "id": "145m8jd",
    "score": 0,
    "title": "A film or television show set before Episode 1",
    "author": "dannyday10700",
    "date": 1686358638.0,
    "url": "https://www.reddit.com/r/StarWars/comments/145m8jd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would anyone like to see a live action film or TV show set before episode 1. Maybe a story centered around a young Qui-Gon Jinn, Mace Windu or Count Dooku. Or maybe we could even see a story centered around Knights of The Old Republic. I know that the Skywalker Saga is supposed to be the center piece of Star Wars but wouldn't it be awesome to see a live action story not set during the Skywalker Saga just for world building and lore.",
    "comments": [
        {
            "level": 0,
            "comment": "Enough Skywalkers. \n\nIt’s Old Republic time let’s go!",
            "score": 5,
            "author": "Salami__Tsunami",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know right I mean there's so much untapped lore that could be explored in the past.",
                    "score": 0,
                    "author": "dannyday10700"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Acolyte, is set in the High Republic (around 150 BBY I believe) and Dawn of the Jedi is set around 25,000 BBY",
            "score": 6,
            "author": "Grecanis"
        },
        {
            "level": 0,
            "comment": "&gt;Would anyone like to see a live action film or TV show set before episode 1. \n\nThe Acolyte is set about a hundred years before TPM. And while they're not live action, both Tales of the Jedi and Young Jedi Adventures are set pre-TPM, the former being about ten years before the latter somewhere between 300-200 years before. \n\nI'd be happy to see some adventures set during the High Republic era, let the Jedi actually be successful and uncomplicated big damn heroes. But personally, I don't see a lot of point in going back too far. A distant prequel to the prequels to the original story/setting is just too far removed, to me it might as well just be a completely different universe at that point.",
            "score": 4,
            "author": "The_FriendliestGiant"
        },
        {
            "level": 0,
            "comment": "The Acolyte will be set before episode 1",
            "score": 7,
            "author": "laserbrained",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay okay now we got something.",
                    "score": 1,
                    "author": "dannyday10700",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And so will the dawn of the jedi movie and technically young jedi adventures.",
                            "score": 5,
                            "author": "ShakarikiGengoro"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d love for some old Republic (new content, not retreading the plot of the game) or high Republic stuff.\n\nI really have no desire to see more of the characters we already know b",
            "score": 2,
            "author": "sophisticaden_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to see where Grogu goes but other than that I would like to see some stuff centered around Old Republic.",
                    "score": 1,
                    "author": "dannyday10700"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would love a series based on the twin gems of **Darth Plagueis** and **Cloak of Deception**.",
            "score": 2,
            "author": "LucasEraFan"
        },
        {
            "level": 0,
            "comment": "Tales of the Jedi episode 2-4 are set before episode 1 and stars  Qui- Gon, Dooku and Windu",
            "score": 2,
            "author": "Bengamey_974"
        }
    ]
}