{
    "id": "146ax3f",
    "score": 391,
    "title": "What do y’all think about my display?",
    "author": "Jack-Stengramson",
    "date": 1686430726.0,
    "url": "https://www.reddit.com/r/StarWars/comments/146ax3f",
    "media_urls": [
        "https://i.redd.it/swjfq2zd895b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Need to replace the Mando helmet with a Phase 1 Trooper helmet 😂 it’s bothering me",
            "score": 62,
            "author": "ChrisL2346",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish I could, I will as soon as the Black Series releases one.",
                    "score": 17,
                    "author": "Jack-Stengramson"
                },
                {
                    "level": 1,
                    "comment": "I think it still works being Jango Fett's helmet. He was the base for the clones after all.",
                    "score": 6,
                    "author": "Rhids_22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but it skips a whole helmet 😂 that’s like having a Star Wars movie collection and skipping a movie",
                            "score": 1,
                            "author": "ChrisL2346",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well I'd skip the sequels soo.. He should remove the first order helmet and instead add the phase 1 clone trooper helmet",
                                    "score": 2,
                                    "author": "Tricky_Quail7121"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "its. it jango’s i dont think. that was slimmer wasnt it?",
                            "score": 1,
                            "author": "RealHuguwuluwu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you! I was hoping someone would say it.",
                    "score": 3,
                    "author": "NotAnotherPornAccout"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Echoing what others are saying \n\n\nLove the stuff but the left side looks way too unbalanced compared to the right.\n\nWhat that means is you need more helmets to go on the right side and have the current right side in the middle!!!\n\nAnswer is always buy more 😂😂😂",
            "score": 11,
            "author": "TKDkid1992",
            "replies": [
                {
                    "level": 1,
                    "comment": "Currently waiting for the Scout Trooper helmet to release, and as soon as it does, I’ll work on balancing it better.",
                    "score": 3,
                    "author": "Jack-Stengramson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So you turned the bottom one to it’s left to mess with me right? Why would you do this?!?",
            "score": 9,
            "author": "thedaveness",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s because its mandibles are the longest and doesn’t fit when facing straight ahead.",
                    "score": 3,
                    "author": "Jack-Stengramson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that’s dope, the white helmets so sleek 😮‍💨",
            "score": 6,
            "author": "jonebone1010",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, man!",
                    "score": 3,
                    "author": "Jack-Stengramson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rows L to R:\n1 - Sabers, Lego Duel\n2 - AT-TE, AT-AT, keep facing each other, looks cool\n3 - Stormtrooper, Clone Trooper\n4 - Concept Boba, FO Stormtrooper",
            "score": 3,
            "author": "Broad-Importance-386"
        },
        {
            "level": 0,
            "comment": "Is there a reason the first order one is at an angle? Sorry, it's just slightly bothering me.",
            "score": 3,
            "author": "Ozone220",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, bothers me too, and it’s because its mandibles are the longest and doesn’t fit when facing straight ahead.",
                    "score": 1,
                    "author": "Jack-Stengramson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just tilt the other ones then, check out my comment^",
                            "score": 1,
                            "author": "Winter_Draft_1256"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bottom helmet not facing forward like the rest is killing me",
            "score": 3,
            "author": "TheAbyssalPrince"
        },
        {
            "level": 0,
            "comment": "I’m so jealous",
            "score": 2,
            "author": "javaspringboot"
        },
        {
            "level": 0,
            "comment": "awesome job! well done! would you ever consider posing the hilts? maybe a 3 tiered stand with them positioned horizontally or upright-diagonal?  great effect though - like purple kyber. 👍🏽",
            "score": 2,
            "author": "goror0"
        },
        {
            "level": 0,
            "comment": "Love all the pieces but visually the left side is too ‘weighted’.  I would split up the helmets between both cabinets.  Or move the cabinets so they aren’t right next to each other",
            "score": 1,
            "author": "bigbadbrad45",
            "replies": [
                {
                    "level": 1,
                    "comment": "True, although I was trying to keep the helmets in the same display to show an evolution.",
                    "score": 2,
                    "author": "Jack-Stengramson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea I think they look great together, but it makes the other cabinet seem empty or more barren.  If they are on opposite walls it would work better.  Lol just suggestions, I would stare at all of them if I was over anyway",
                            "score": 1,
                            "author": "bigbadbrad45"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, the evolution from Mandalorian armor to 2nd gen clone armor\n\nJk man, looks great",
                            "score": 1,
                            "author": "TREYH4RD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks dude, it’ll be a bit more accurate once they release the phase 1 helmet.",
                                    "score": 2,
                                    "author": "Jack-Stengramson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah don’t sweat it man. You’ve got four times the helmet display I do and it’s pretty bad ass.",
                                            "score": 1,
                                            "author": "TREYH4RD"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice but unbalanced",
            "score": 1,
            "author": "jeedaiaaron"
        },
        {
            "level": 0,
            "comment": "Most...impressive",
            "score": 1,
            "author": "The-Other-Writer"
        },
        {
            "level": 0,
            "comment": "Not enough lego",
            "score": 1,
            "author": "Roin-da-Groin"
        },
        {
            "level": 0,
            "comment": "Love the items but it feels too heavy on the left. Try switching the 1st and 3rd helmet, or the 2nd and 4th helmet with the right. Or putting all the helmets 9n the lower shelves.",
            "score": 1,
            "author": "boundbystitches"
        },
        {
            "level": 0,
            "comment": "I literally just got the throne room lego set lol",
            "score": 1,
            "author": "SebDaPerson",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love that set, definitely my favorite diorama.",
                    "score": 1,
                    "author": "Jack-Stengramson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is amazing but why is the mandalorian helmet white or is it for aestetic purposes",
            "score": 1,
            "author": "Gold-Implement-1151",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a prototype boba Fett helmet, but it’s meant to stand in for Mandalorian helmets sort of being the predecessors for the clone and stormtrooper helmets. And yeah, it being white makes it a lot more aesthetically pleasing too.",
                    "score": 2,
                    "author": "Jack-Stengramson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got a plaster fixed repainted Boba fett prototyp one that wasn't really what i thought I was buying a bunch of years ago.This was before 3d prints and the Hasbro line. Thinking about getting the new one, Hasbro does really nice stuff.",
                            "score": 1,
                            "author": "GreenRickHell"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m jealous of the helmets but that purple tint doesn’t make them look very good",
            "score": 1,
            "author": "Walks_with_Chaos"
        },
        {
            "level": 0,
            "comment": "Move the wires to the back so theyre not visible, and bring the cases closer together so it looks like one case. Then get rid of the middle LEDs if it still doesn’t look like one case\n\nAnd then alternate the items on each shelf\n\nEx. Helmet left, lightsabers right… (next row) Walker on left, helmet right… keep doing that til the bottom\n\nAlso, you can tilt the helmets on the left (so that they are facing the right) and tilt the helmets on the right so they face left\n\nFinally push the displays back so they’re flat against the wall 👌",
            "score": 1,
            "author": "Winter_Draft_1256"
        },
        {
            "level": 0,
            "comment": "you need a phase 1 clone trooper helmet then ditch the first order one",
            "score": 1,
            "author": "JussaRegularNPC"
        },
        {
            "level": 0,
            "comment": "Stagger the helmets in a zig zag pattern on the shelves to balance out the appearance a bit more",
            "score": 1,
            "author": "USP45Hunter"
        },
        {
            "level": 0,
            "comment": "It’s cool.",
            "score": 0,
            "author": "sesquiped-alien"
        }
    ]
}