{
    "id": "146myd9",
    "score": 0,
    "title": "My Theory and Suggestions to Add In Book Of Boba Fett Season 2.",
    "author": "Tall_Growth_532",
    "date": 1686466570.0,
    "url": "https://www.reddit.com/r/StarWars/comments/146myd9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel Like There Gonna Bring back The Stormtroopers back just to Make Boba Fett loom more like a badass cuz he was was dripping in season 2 of Mandalorian. Another thing I really want him to have a Lightsaber like in The Legends but and yes I know this is canon but still how awesome would it be, before you say he already has that wooden staff thing he could use that lightsaber as a last resort for more stronger opponents",
    "comments": [
        {
            "level": 0,
            "comment": "My thoughts:\n\nYou are randomly capitalizing words and using “there” instead of “they’re.”  You’re unnecessarily using the word “back” twice.  (Bring back the Stormtroopers back.)  Also, “loom” instead of “look.”  You can say “stronger” or “more strong,” but not “more stronger.”  You should also end that last sentence with a period.",
            "score": 2,
            "author": "tomandshell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not good with English I learn form TV and YouTube and I'm not American nor any English country sorry if I'm incorrect but even I don't know much of the difference",
                    "score": 3,
                    "author": "Tall_Growth_532"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think there will ever be a season 2. Boba Fett may appear again in other series (The Mandalorian) or probably in Filoni's movie but I doubt he will be the the star of his own show again.",
            "score": 1,
            "author": "Bengamey_974",
            "replies": [
                {
                    "level": 1,
                    "comment": "NOOOO THAN WHATS THE POINT OF BRINGING HIM BACK",
                    "score": 1,
                    "author": "Tall_Growth_532"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's been pretty much confirmed that there won't be another season, but that Boba will appear again on The Mandalorian.",
            "score": 1,
            "author": "adam_son_of_david"
        },
        {
            "level": 0,
            "comment": "Here is my suggestion for the Book of Boba Fett Season 2: Put it in a lock box and throw it in the middle of the ocean… actually I don’t want to pollute the planet with this garbage. \n\nLeave original characters alone. Nostalgia is not a reason to make a tv show/movie. I promise it will never be as good as u want it to be.",
            "score": 1,
            "author": "rynmab"
        }
    ]
}