{
    "id": "146ndm7",
    "score": 0,
    "title": "Anakin would have won the duel if he didn’t do the one thing Obi-Wan knew how to counter",
    "author": "Applekingen",
    "date": 1686468055.0,
    "url": "https://www.reddit.com/r/StarWars/comments/146ndm7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Through the duel we can hear Obi-Wan moan and grunt which means that he’s struggling. Anakin on the other hand doesn’t make a sound at all which makes him the more powerful duelist which means that if he hadn’t done the stupid jump over Obi-Wan, he would have won sooner or later.",
    "comments": [
        {
            "level": 0,
            "comment": "In the words of his son. His overconfidence was his downfall",
            "score": 22,
            "author": "Smashbrosfan31"
        },
        {
            "level": 0,
            "comment": "Anakins lightsaber strikes have been described as being hit by a meteor by Dooku, like so obiwan stated that Darth vaders lightsaber strikes were like a kraayt dragon. \n\nObiwan knows Vaders powers were immeasurable, the jedi always had a fear of what they felt within anakin. \n\nObiwan is simply not playing into anakins strengths because when he did it against Maul, he got overwhelmed. \n\nwith his wits, Obiwan leads Vader into unfavourable positions where he cant utilise his full strength to batter his opponent, riposting vaders saber into control panel to lead him out through a blastdoor. \n\nThe result is that vader completely destroys the separatist installation without even gaining leverage or any advantages.\nby the time they get to the river bank, Vader has tried everything from choping his hands off like he did to Dooku, force push, choke hold etc. \n\nVader Imo was simply too immature in their duel. in the original draft Vader scores a disarm on the river bank and kenobi responds by maiming him with the lightsaber using telekinesis. \n\nAnakins/vaders fighting style Is great for duelling but Obiwan can simply jocky for positioning and outlast any offensive. He is known in the Jedi order as the greatest practitioner of Form 3 soresu.",
            "score": 15,
            "author": "Jonluuis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Basically after his Duel with Darth Maul, Obi-Wan completely re-oriented the way he fought into that of a counter-striker. You can see it every time he battles someone else in the PT. He’s never the aggressor, and very rarely attempts to match his enemies strike for strike. \n\nSo saying he would’ve lost if not for Anakin being Anakin is completely missing the point of his fighting style. He’s probably the best in the galaxy at defending strikes, so he stays comfortably in his game until Anakin does what Anakin does and then takes advantage of the moment to end the duel. \n\nThat’s not getting lucky, that’s decades of combat experience working perfectly. If anything, that duel shows why Obi Wan is imo pound for pond the best duelist in the entire series. \n\nHe’s not the most talented, he’s not the strongest in the force and he’s not physically more able. He’s simply the smartest duelist, and worked his dueling game to compliment it perfectly",
                    "score": 4,
                    "author": "fatrahb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes if he'd made decisions that would have resulted in his victory then sure he would have won. But he didn't. So he lost.",
            "score": 9,
            "author": "MrMonkeyman79"
        },
        {
            "level": 0,
            "comment": "*If.*",
            "score": 7,
            "author": "Superman246o1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anakin totally would have won if he didn't lose.",
                    "score": 4,
                    "author": "Evening-Leader-7070"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty much, shows that Obiwan is simply the older man.  He had a harder time.",
            "score": 2,
            "author": "IncreaseLate4684"
        },
        {
            "level": 0,
            "comment": "Anakin was impetuous. At his peak (which is what he was at Mustafar), he would easily win duels against pretty much everyone, if he didn't do something stupid. \n\nCompare the Obi Wan duel versus the one against Dooku, he just calmly waits for his chance and when it comes, he takes it. Dooku was trying to goad him too, and for much the same reasons.\n\nI have the high ground is goading him. The proper way would have been to get off on an embankment downstream, or at least try to force push Obi while making his leap.",
            "score": 2,
            "author": "aaronupright"
        },
        {
            "level": 0,
            "comment": "It’s a movie",
            "score": 1,
            "author": "sophisticaden_"
        },
        {
            "level": 0,
            "comment": "Yeah...this isn't argued. Anakin is arguably the best duelist ever.",
            "score": 1,
            "author": "danielhollenbeck13"
        },
        {
            "level": 0,
            "comment": "Double the pride; Double the fall.",
            "score": 1,
            "author": "Stuck_at_Work_Till_5"
        },
        {
            "level": 0,
            "comment": "Pretty sure that's the point. Vader has more raw power but Kenobi was more level headed and was able to take advantage of his overconfidence.",
            "score": 1,
            "author": "Distinct_beorno"
        },
        {
            "level": 0,
            "comment": "Nah. Anakin is the chosen one. If he defeats Obi-Wan, he isn't there to fulfill the prophecy.\n\nAs the chosen one he has no choice. His faith was determined before his birth.",
            "score": 0,
            "author": "The_DevilAdvocate"
        }
    ]
}