{
    "id": "1471dsu",
    "score": 3,
    "title": "Vader",
    "author": "sheslug19",
    "date": 1686508302.0,
    "url": "https://www.reddit.com/r/StarWars/comments/1471dsu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Please don't come for me, but I was rewatching ROTJ. In the scenes on the death star, Vader says to Luke, \"Obi-wan has taught you well\" (or something close to that). This made me wonder...was the Empire not aware that Yoda was alive? It seemed like they didn't know and assumed Obi-wan trained him.",
    "comments": [
        {
            "level": 0,
            "comment": "The Emperor knew, but he no longer viewed Yoda as a threat.\n\n&gt;\tNow on the throne high in the spire of his isolation tower on the Death Star Mark 2, the Sith Lord, the Emperor, thinks about that old Jedi Master. \n\n&gt;\tIt does not haunt him—he has no regrets that might cause a haunting. He won. So obviously he won. Grand Master Yoda slunk away to hide. Sidious rose to the apex of the galaxy. Everyone calls him Emperor now. Everyone fears him. Merely look at any corner of his galaxy and see evidence that he won. \n\n&gt;\tBut all the same, he’d like to end Master Yoda himself. Not with his own two hands, of course. But with the shock of a red saber. \n\n&gt;\tCollect Yoda’s little lightsaber once the green creature is dead and set it with the others, with all his trophies in the Imperial Palace. It will look like a toy beside the rest. Useless, silly. There will be no one left called Master but himself. \n\n&gt;\tHe has looked. Set the Inquisitorius program to seek Yoda’s hiding place. Made certain the hunter probes know his name and specs. Once or twice the Emperor considered various arcane Sith rituals that might instigate some kind of echo or thread of the Force to lead him to Yoda’s location. But he never performed them. Why bother? Why waste his own power on a mere irritation? Wherever Yoda is, his power is so diminished he can be no threat to the Empire. \n\n&gt;\tBut sometimes, when Palpatine sinks into the Force, drinking it up like the endless source of power it is, his feelings drift along distant threads of anger. Sparks of hate. And in a far-flung place he senses a fleeting moment of familiarity. It never amounts to anything if he bothers locating it. And over the years he has spent with the dark side, his feelings diffusing throughout and sucking up power, the very easy touch of Yoda’s name has become meditative.\n\n&gt;\t*I defeated you. I chased you away and took everything that was yours. The things you stood for are ashes now. You remain, and as long as you do, I keep winning.*\n\n&gt;\tBut the rest of the time, Palpatine prefers to see Yoda again, just long enough to watch him die.\n\n___\n\n&gt;\tThe Emperor feels it. Maybe because he was thinking about the old Jedi again. His thoughts and feelings already turned in that inevitable direction. \n\n&gt;\tGrand Master Yoda. Dead. As if he’s always been able to feel the ancient green Jedi and suddenly his presence is gone.\n\n&gt;\tNo—it’s the opposite. It is as if Yoda has not existed at all to the Emperor, and suddenly he is all around. Everywhere in the Force. The Emperor hisses and pulls on his anger, always ready to stoke those flames for the dark side. He is filled with it, the glorious power, lightning under his skin. The Emperor laughs. He laughs and laughs. \n\n&gt;\tYoda is *dead*. \n\n&gt;\t“Oh, Yoda,” he says to himself, teeth bared in a hideous smile. His laugh echoes throughout the throne room, from observation window to sitting area to docking bay doors, across the bridge that narrows over the giant pit. Blue glow pushes up from that chasm, from the thermal reactor at the heart of the Death Star, a cold contrast to the sickly red light of the isolation tower. \n\n&gt;\tEven the Imperial Guard stationed to either side of the docking bay doors shift in discomfort at the eerie triumph of the Emperor’s laugh. \n\n&gt;Then— \n\n&gt;\tThen the Emperor feels a thrill in the Force. And—\n\n&gt;\tImpossible! \n\n&gt;\tYoda stands before him, hazy and surrounded by a glow as if lit from within. \n\n&gt;\tIt *is* impossible. And yet… \n\n&gt;\tYoda. Hunched and ancient, in his old Jedi robes with that gnarled walking stick. \n\n&gt;\tThe Emperor does not know if this is real, but he bites out a final laugh. “You are dead.” \n\n&gt;\tThe ghost inclines his head. \n\n&gt;\t“But come to watch my final glory? I hoped you would see it.” The Emperor spins slowly on his throne to face the observation window. He raises a hand to sweep across the expanse of stars. “Not long from now I will crush the Rebel Alliance. And take the newest Skywalker as I took his father!” The Emperor cackles again. \n\n&gt;\tBehind him, the strange vision of Yoda speaks in that same rough little voice. “Win, you cannot.” \n\n&gt;\tThis makes the Emperor nearly shriek with laughter. “But, Master Yoda, I already have*.” \n\n&gt;\tHe turns back on his throne, eager to see Yoda’s frown. \n\n&gt;\tBut the specter is gone. (*Masters*)",
            "score": 24,
            "author": "frogspyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this from a children’s book?",
                    "score": 3,
                    "author": "alec2026",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it’s YA",
                            "score": 0,
                            "author": "frogspyer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is written horribly lol.  Yikes",
                    "score": 3,
                    "author": "Walks_with_Chaos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it’s one of the worse ones in *Stories of Jedi and Sith*. \n\nHere’s another section of the passage I left out of it:\n\n&gt;\t“Luke, the Force runs strong in your family. Pass on what you have learned. Luke …” No time. The Force is everywhere. All around him. It feels so warm. And Yoda is so tired. But he must—he says, “There is another…Sky…walker.” \n\n&gt;\tWith that final word, Yoda stops. The Force inside him and around him is vivid, loud. The entire planet breathes with him. Once more. Then not at all. \n\n&gt;\tHe is not tired anymore. He is the Force. With it. Always has been. Always…will be. \n\n&gt;\tHis corporeal body vanishes. \n\n&gt;\tThe Force is wondrous. Master Yoda is no longer a piece of it. He *is* it. But he remembers himself as he was taught. He remembers who he is, who he has been. He remembers who he will be. Though he does not breathe, he remembers how to laugh. \n\n&gt;\t(But something out there in the galaxy also remembers him and is calling his name. Right now.) \n\nConceptually, I think it’s a fun idea, but the execution could have been so much better.",
                            "score": 1,
                            "author": "frogspyer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How do you know? A feeling...",
                                    "score": 1,
                                    "author": "Metalomeus"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was always my take. And why Vader underestimates Luke (\"He's just a boy. Obi Wan can no longer help him\").",
            "score": 3,
            "author": "Nimrod48"
        },
        {
            "level": 0,
            "comment": "They (Palpatine and Vader) knew Yoda was old and his general life expectancy. Also he completely disappeared from their senses when he made his hideout next to the dark side cave. So they assumed “bucket kicked he had”. Plus Vader knew Luke had been with Obi-Wan and made additional assumptions based on that. And Vader probably assumed further that Obi-Wan had been training for years. From their perspective it’s a very logical conclusion",
            "score": 7,
            "author": "Desertfoxking"
        },
        {
            "level": 0,
            "comment": "Reddit has ruined me because I hear this line like “Ahh! I see you know your Judo well.”",
            "score": 3,
            "author": "danegermaine99"
        },
        {
            "level": 0,
            "comment": "Entirely my opinion, not backed by anything: when Lucas was writing and filming Return of the Jedi, he wanted Vader to refer to Ben Kenobi because he wanted to imply that Vader had no knowledge of Yoda, the person who should have trained him. That’s it. We know the larger story was very much not set in stone at the time. So I think Lucas might’ve had the idea that Vader only trained with Kenobi and never trained with anyone else. Which is why Vader never even mentions Yoda. Or any other Jedi for that matter. Only Kenobi. \n\nI think the idea of the kind of Jedi Hogwarts that we got in the prequels was some thing that evolved over time, not some thing Lucas had firmly in his mind in 1982. \n\nThen come the prequels and Yoda is everywhere. So now it’s easy enough to reinterpret that line as Vader assumed Yoda was dead. It wouldn’t be the only reinterpretation required by the saga. \n\n“So what I told you was true, from a certain point of view”. 😊\n\nThat’s what I think actually occurred. I can’t speak to what official canon is on the matter, though.",
            "score": 2,
            "author": "leopim01"
        },
        {
            "level": 0,
            "comment": "Yeh, they thought Yoda was dead",
            "score": 1,
            "author": "Doctor_Fett"
        }
    ]
}