{
    "id": "11qk3au",
    "score": 15,
    "title": "Comp Sci Major",
    "author": "animuweebbe",
    "date": 1678738036.0,
    "url": "https://www.reddit.com/r/GaState/comments/11qk3au",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do any of you guys know what we are doing? These professors are completely unprofessional and I feel like I don’t know anything and this is my second semester here. If any cs alumni’s are scrolling, how did you do it?",
    "comments": [
        {
            "level": 0,
            "comment": "Get your slip of paper and use a good internship to get into the industry. \n\nImpressing enough to get an internship is going to come down to individual hard work and passion to learn material that these shithead professors don't know/care to teach us. Explore things outside of the comp sci program.",
            "score": 21,
            "author": "scrimpi_shrimpi"
        },
        {
            "level": 0,
            "comment": "Most of what you’ll learn will be self-taught. It won’t come from these professors. Just practice a lot of leetcode and build your own portfolio, that’s what will make you employable. I spent a lot of time trying to learn about web development, cybersecurity, databases, computer networks, etc., and I found them all boring. Then I came across my favorite subject: data science. I’ve spent a year learning how it works, I’m working towards a certificate in data science, and the my GitHub and jobs I’m applying to are all related to it. \n\nMy advise for you is to figure what you really like and become a self-taught expert on that, just being in a classroom isn’t gonna be enough.",
            "score": 7,
            "author": "osrppp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think that taking a coding boot camp will help?",
                    "score": 2,
                    "author": "animuweebbe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely. The sooner you skill up the better prepared you will be. I wish I used my spare time more wisely earlier",
                            "score": 2,
                            "author": "osrppp"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why was the only comment deleted",
            "score": 2,
            "author": "animuweebbe"
        },
        {
            "level": 0,
            "comment": "Honestly people just deal and keep it pushing",
            "score": 2,
            "author": "Arksmiley69"
        },
        {
            "level": 0,
            "comment": "I really feel like I just come to exist in some of those CSC classes really. The craziness of things dawned on me when I took CSC 1302 and the syllabus covered some random stuff that I am told is actually barely used in the industry (Swing,etc.) while at the same time not even teaching us some key things in class (the basics of classes and some other key object oriented programming concepts). I am not so far into my degree yet. However, it seems like getting ok to good grades and doing what you actually need/want to do to learn what you need to learn(whether that be based on industry requirements, personal goals, or whatever) outside class might just be the way",
            "score": 2,
            "author": "tribore260419"
        },
        {
            "level": 0,
            "comment": "I'm taking Big Data Programming, System Level Programming, and more. These professors are the worst. They teach the material in the worst way. This one professor I have relegates everything to the TA and goes out of his way to avoid answering questions. Worst semester I've had so far.",
            "score": 2,
            "author": "TFGhost161",
            "replies": [
                {
                    "level": 1,
                    "comment": "System level programming was one of my favorite classes las semester. The instructor sucked and I had to learn everything with the help of YouTube and chatgpt. These instructors barely teach you the basics and it’s up to you to figure everything out.",
                    "score": 2,
                    "author": "osrppp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started in CS but quickly switched to a department whose faculty actually understand the material they should be teaching, Mathematics and Statistics. Now that I’m doing a master’s in data science I’m remembering all the reasons why I really didn’t care for the CS department here",
            "score": 2,
            "author": "Kidynamo",
            "replies": [
                {
                    "level": 1,
                    "comment": "May I ask what school you chose for your MS in Data Science? Also, as someone whose previous degree was not in anything CS or IT related, how would it be entering a Master’s level Data Science program for someone who is interested in learning something new and changing careers?",
                    "score": 1,
                    "author": "renznoi5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "honestly I think most people are just here to get reqs out the way and then transfer to Tech",
            "score": 6,
            "author": "WWJJF",
            "replies": [
                {
                    "level": 1,
                    "comment": "They say that, but reality usually hits.",
                    "score": 4,
                    "author": "MathPlacementDud"
                }
            ]
        }
    ]
}