{
    "id": "11ubmbz",
    "score": 10,
    "title": "Data analytics internship",
    "author": "N-iyaaaa",
    "date": 1679105617.0,
    "url": "https://www.reddit.com/r/GaState/comments/11ubmbz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have an interview for a data analytics internship on Wednesday I’m assuming they’ve seen my resume to know I have no experience, I’m a college sophomore so I wish companies would take more chances and help us learn instead of expecting us to know what to do, this is my chance and I want the internship so bad but I have little experience I have regular jobs( hospitality, retail) so I have really no way to make them seem analytical to align with the internship. I do have a google analytics cert which is on there and I have experience with excel, Microsoft suites and currently trying ti learn python. Does anyone have advice on how to market myself to come off as the best candidate for the internship when I don’t have much experience.",
    "comments": [
        {
            "level": 0,
            "comment": "Research the company before hand and learn their business motto, tell them that even though you don’t have a lot of experience you are excited to learn new things and further your education in that field. You can also turn your weaknesses into strength. Talk about ur strength more than your weakness. May I ask which company you are trying to intern for?",
            "score": 2,
            "author": "Admirable_Meringue54",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the advice and sure! The company is called BlueSkyRisk I live in Georgia so I don’t think it’s a very big known company.",
                    "score": 1,
                    "author": "N-iyaaaa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find stuff in your other jobs that will apply to the DS job. For example, attention to detail, any type of counting, quantifying data, etc. Just look closely at what you’ve done in jobs and classes if it applies and that should be enough for a no YOE internship. Also talk about a willingness to learn and quick learner and try to find examples about that in previous jobs and school. The main thing an interviewer wants in an internship is a passion for the field and a willingness to learn.",
            "score": 1,
            "author": "toxic_air2346"
        }
    ]
}