{
    "id": "12cudam",
    "score": 1,
    "title": "MyCollegeRoomie",
    "author": "big_daddy_thanos420",
    "date": 1680721298.0,
    "url": "https://www.reddit.com/r/GaState/comments/12cudam",
    "media_urls": [],
    "other_urls": [],
    "postText": "does anyone know if current students have to use my collegeroomie for housing next year? like im currently a freshman so im kinda curious",
    "comments": [
        {
            "level": 0,
            "comment": "Yep! When you’re an upper class men you get to use it as well ONLY if you’re guaranteed housing in the first batch! If you’re on the waitlist next year you won’t be able to access it/use it. \n\nFor example this year the first 1500 returning applications were guaranteed housing and they had access to MCR. Same with incoming freshmen.",
            "score": 4,
            "author": "Fermentedlemur",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotcha. Does the waitlist usually go down at all?",
                    "score": 1,
                    "author": "big_daddy_thanos420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea it does but if I were above 50 on the waitlist I’d have a backup plan 💀",
                            "score": 1,
                            "author": "Fermentedlemur"
                        },
                        {
                            "level": 2,
                            "comment": "Yes it does in the summer you just gotta wait it out",
                            "score": 1,
                            "author": "Standard_Study_4961",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably not as hopeful if I’m in the 300s 😭",
                                    "score": 1,
                                    "author": "big_daddy_thanos420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually I had a friend last year who applied in March and was number 700 and she got housing in the end of august because people drop out all the time",
                                            "score": 1,
                                            "author": "Standard_Study_4961",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Interesting. I’ll definitely keep an eye on it then. Thanks for all the advice",
                                                    "score": 1,
                                                    "author": "big_daddy_thanos420"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is not required. If you don't choose a specific person you'll just be pared up with whoever else picked that room.",
            "score": 1,
            "author": "Comprehensive-Cat243"
        }
    ]
}