{
    "id": "12dmr4r",
    "score": 7,
    "title": "Is anyone else having trouble with HOPE?",
    "author": "560768",
    "date": 1680792827.0,
    "url": "https://www.reddit.com/r/GaState/comments/12dmr4r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m supposed to graduate in a few weeks and I just got a bill for $6500 yesterday because they’re saying I lost my HOPE eligibility in 2020. That’s 3 years ago! I’m not sure if it’s something the registrar updated to cause the bill to come in now or what, but they’ve been just passing me off to other departments saying that it’s not their fault. Is anyone else experiencing this? Why didn’t they tell me I lost eligibility 3 years ago if that’s the case?",
    "comments": [
        {
            "level": 0,
            "comment": "this is honestly scary hope you get it sorted out. very unprofessional by gsu imo",
            "score": 17,
            "author": "offlinearchive"
        },
        {
            "level": 0,
            "comment": "That's really, really odd. I will be a third-year next semester, do I have no experience with this, but could it be possible that your HOPE ran out going into your senior year? I think that's a thing which happens - like HOPE only covers like, say, 100 credits but you need 120 to graduate for example. That happened to some of my GSU friends who graduated and my brother at Tech.\n\nEither way, they should've really let you know :/ I hope you don't owe that",
            "score": 4,
            "author": "Adventurous-Fox-6270"
        },
        {
            "level": 0,
            "comment": "Hope runs out 5 years after your high school graduation, after 120 hours of credits attempted or if you fall below the GPA threshold at the different checkpoints. Speak to your advisor.",
            "score": 3,
            "author": "Altruistic-Cut2236",
            "replies": [
                {
                    "level": 1,
                    "comment": "The maximum credit limit is actually 127 credit hours (including attempted credit hours) for HOPE scholarship.\n\nhttps://sfs.gsu.edu/hope-scholarship/#1559205944254-8d3268b3-c06f",
                    "score": 4,
                    "author": "usernam3n0tTaken"
                },
                {
                    "level": 1,
                    "comment": "I thought it was 10 years",
                    "score": 3,
                    "author": "560768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's actually 7, my bad",
                            "score": 3,
                            "author": "Altruistic-Cut2236",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s 7 years if you got Hope before Summer 2019 I believe. They passed a new regulation to extend it to 10 years to people who got hope after that date",
                                    "score": 2,
                                    "author": "MatchaG1rl"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope runs out?",
            "score": 1,
            "author": "GodlyGamerBeast"
        },
        {
            "level": 0,
            "comment": "Did they tell you the reason why? Below 3.0 gpa? Contact GAFutures. They’ll tell you what’s wrong",
            "score": 1,
            "author": "MatchaG1rl",
            "replies": [
                {
                    "level": 1,
                    "comment": "My GPA is 4.1 and GA Futures told me it’s the registrar’s responsibility to report credit hours. Apparently I had exceeded the amount of covered credit hours, but the numbers they told me don’t make sense.",
                    "score": 2,
                    "author": "560768",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check your Academic Evaluation on PAWS. It'll show you all your credits. Also in your GAFutures account, select My College Hope Profile from the side menu to see the credits that count towards Hope on your transcript &amp; checkpoint history. \n\nDual enrollment and learning support credits are not counted for Hope. If you had transfer credits, it's possible they were entered in late. If you ever withdrew from all your classes for a semester and got all Ws, you can get an exception appeal from GAFuture's to have those credit hours forgiven if you had a valid reason like medical emergency.",
                            "score": 3,
                            "author": "MatchaG1rl"
                        }
                    ]
                }
            ]
        }
    ]
}