{
    "id": "12uh84d",
    "score": 2,
    "title": "Deciding Nursing Schools (KSU vs Georgia State)",
    "author": "Illustrious-Yak-4789",
    "date": 1682108961.0,
    "url": "https://www.reddit.com/r/GaState/comments/12uh84d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI am having a very tough time deciding which nursing school to go to because I got accepted to both. I have been leaning towards KSU bc that is where I did my undergrad, but I recently relocated. GSU is only a 15 min drive from me vs. just under an hour commute to kennesaw’s campus and relocating is not an option. I’ve been told KSU has the better program but I’ve also heard you can’t go wrong either way.\n\nAny thoughts/comments appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "I would highly consider choosing whichever program is more convenient to you location wise and whichever is cheaper. For me, that was GGC. I live in Gwinnett so when I applied to nursing school, I chose GGC because it's literally 15 minutes away from me and the tuition was cheaper than most of these other schools. Also, I don't know about you, but I like the fact that smaller classes allow for more 1:1 time with your peers and professors. At GGC, our professors knew us all by name since our classes were maxed at 30-35 students. It's not like those large lecture halls where you are just a name and number to the professors. It helps having those small class sizes and closer relationships with peers and professors. There's also the advantage of having more local opportunities. For example, when we did our public health course, we had the opportunity to do some rotations at elementary schools doing scoliosis screenings and even taking a field trip to the CDC. These are opportunities you may not get with larger schools, just depending on how many students they have to cater to. At the end of the day, a nurse is a nurse regardless of which school and program you chose. You will still have to put in the effort and study hard so that you can pass your NCLEX. Best of luck to you as you make your decision. Feel free to DM if you have any questions about nursing school in general.",
            "score": 3,
            "author": "renznoi5",
            "replies": [
                {
                    "level": 1,
                    "comment": "did u attended gsu for undergrad?",
                    "score": 1,
                    "author": "adoreexfayyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For graduate/Master’s.",
                            "score": 1,
                            "author": "renznoi5"
                        }
                    ]
                }
            ]
        }
    ]
}