{
    "id": "138xyq6",
    "score": 1,
    "title": "HOPE Scholarship",
    "author": "fathergrace1",
    "date": 1683313158.0,
    "url": "https://www.reddit.com/r/GaState/comments/138xyq6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I didnt get HOPE in high school, but now have attempted 30 credit hours which was above the 3.0 GPA. I have a 3.63, but I’m not eligible for hope because they didn’t count my 1st semester. I took 15 credits in Semester 1 and 16 in Semester 2. Do they only count Semester 2 for HOPE??? I’m kinda panicking because I was told was you get 30 attempted credit hours and I have 31.",
    "comments": [
        {
            "level": 0,
            "comment": "No need to panic Hope gets checked every 30 credit hours but that doesn’t mean you can’t do over 30 a semester. You’ll get hope starting next semester congrats!",
            "score": 3,
            "author": "BarackTheRockObama",
            "replies": [
                {
                    "level": 1,
                    "comment": "But I heard it only gets checked in the spring. I absolutely can not wait till spring 2024 to get evaluated again, yk?",
                    "score": 1,
                    "author": "fathergrace1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not it gets checked after you complete a minimum of 30 credit hours. That can be winter or spring. Since you completed 30 there gonna review it and apply Hope by August",
                            "score": 1,
                            "author": "BarackTheRockObama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohhhh, I have 31 rn but they only counted 16 for some reason.. thank you for answering 😊",
                                    "score": 1,
                                    "author": "fathergrace1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "wait is this actually a thing? if so thats awesome",
            "score": 1,
            "author": "zerothemegaman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no, please don’t take my word for it. The GAFutures website (ppl who do HOPE/Zell) didn’t count my 1st semester and idk if it’s supposed to be like that",
                    "score": 1,
                    "author": "fathergrace1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i checked with my brother. it says he eligible now but he didnt get it because of his hs gpa. it counted the first semester too so you should reach out to someone. great job!!",
                            "score": 1,
                            "author": "zerothemegaman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you☺️ and thank you for the reassurance!!",
                                    "score": 1,
                                    "author": "fathergrace1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If those Semester 1 credits are dual enrollment, they won't count but if they were taken after high school they will count. Learning support classes won't be counted.\n\nAre you seeing them on your GAFutures My College Hope Profile transcript? Errors are bound to happen so double check with GSU financial aid.",
            "score": 1,
            "author": "MatchaG1rl"
        }
    ]
}