{
    "id": "13j9jf2",
    "score": 2,
    "title": "In-State Tuition Petition",
    "author": "Reasonable_Golf_251",
    "date": 1684253512.0,
    "url": "https://www.reddit.com/r/GaState/comments/13j9jf2",
    "media_urls": [],
    "other_urls": [],
    "postText": "i am currently applying for in-state tuition but had questions regarding the application, and i was wondering if any of you guys either went through this process already or may be any help.",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, I’ve gone through the same thing! Although I was able to declare and show proof of everything, but since I don’t pay taxes in GA I was denied of in-state tuition. What questions do you have?",
            "score": 1,
            "author": "Total-Fish8456",
            "replies": [
                {
                    "level": 1,
                    "comment": "i pay taxes in georgia but i just needed help on how to fill out everything. i was told in person that since i’m independent i don’t need my parents info, but the application says in order to get approve i must fill out all mandatory questions. i just wanted to know if you had to provide your parents info😭.",
                    "score": 2,
                    "author": "Reasonable_Golf_251",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh I don’t remember, I did it 3 years ago. But I think I did if it said mandatory then I put my parents info. I’d suggest you email someone in that department just to fully clarify!",
                            "score": 1,
                            "author": "Total-Fish8456",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah i went to the school and talk to the head of the department and he told me i did not have to buy online it says it’s mandatory so i truly don’t know. i may just contact them one last time to be on the safe side but thank you!!!",
                                    "score": 2,
                                    "author": "Reasonable_Golf_251",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay, No problem! Welcome.",
                                            "score": 1,
                                            "author": "Total-Fish8456"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}