{
    "id": "13jolwx",
    "score": 14,
    "title": "Is GAstate that bad?",
    "author": "CranberryOk9645",
    "date": 1684290088.0,
    "url": "https://www.reddit.com/r/GaState/comments/13jolwx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hear the worst from people and they said that everyone is transferring to UGA or if you go to Georgia State you will be taken less seriously.  I went on campus and I enjoyed it.  I like the community and I love the design majors! \n\nBut is Georgia state that bad?  Is it not worth going?  My second alternative was to go to a design school in Paris but I'm nervous about being in a whole new country.",
    "comments": [
        {
            "level": 0,
            "comment": "I transferred from UGA and enjoyed the diversity at GSU compared to UGA. Now that I am a couple of years into my career, no one cares what school I went to.",
            "score": 59,
            "author": "passionkiller",
            "replies": [
                {
                    "level": 1,
                    "comment": "UGA has one of the most lackluster in terms of diversity campus I have seen in a while",
                    "score": 22,
                    "author": "CXyber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -27,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you kidding me? UGA is like 95% white (except for the football and basketball teams). GSU is like 25% white, 25% black, 25% Latino, and a good mix of everyone else in the last 25%.",
                                    "score": 24,
                                    "author": "I_Sometimes_Lie_"
                                },
                                {
                                    "level": 3,
                                    "comment": "💀, you really say GAState is black and white. I see tons of Asians everywhere (they're in their cliche groups sometimes), indians included, Hispanics, native Americans, etc. GAState is one of the most diverse campuses I have been on. When I went to UGA, there was mostly white, some black (sparse), and a lot of Asians. As a fellow Asian, the Asians at UGA were at best, white washed 🫡💀. Unfortunate, but I experienced it for 3 years for both universities",
                                    "score": 16,
                                    "author": "CXyber",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It alway been white wash. Look at the history of UGA it was built on the back of slaves. Hell the school is deadass built on slave graves.",
                                                    "score": 3,
                                                    "author": "Cooladjack"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is true for almost all majors.   No one cares where I did my undergrad. Maybe GT, Harvard or MIT grads are looked at a little differently but compared to most other universities, no one cares.",
                    "score": 3,
                    "author": "JackOfAllDevs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The real world cares much less about where you went to school than the average college student believes.\n\nGo to the school that has the program you want, work hard, and you’ll be fine.\n\nSome people want to transfer to Tech or UGA for specific programs, which makes sense, but those who do it simply for prestige are wasting time and money.\n\nThere are plenty of people at Georgia State who actually could transfer to one of theses universities and don’t. They are no better or worse than the ones who actually choose too.",
            "score": 42,
            "author": "Jedi-Ethos",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was one of those. I came to GSU initially for premed prereqs, ended up staying for a second bachelor's in chemistry. I had the grades to get into Tech, Emory, or UGA. But since I was a music major in my first degree, there was no equivalent for all those music credits to transfer to and none of those other universities except \"freshman\" transfers except GSU. So they said I would've had to take a few classes somewhere else to qualify. Started at GSU and just figured transferring was not worth the hassle.",
                    "score": 3,
                    "author": "BellaMentalNecrotica"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not bad at all. GT and UGA just have bigger names",
            "score": 20,
            "author": "BradClem"
        },
        {
            "level": 0,
            "comment": "I was originally planning on going to SCAD but after I visited GSU I ended up loving it and I am so glad I chose to go here. \n\nI think everyone has their own experiences but I think the people who have bad experiences are apart of two groups: some people look down at GSU because it’s an open campus in the middle of the city downtown. I feel like those same people grew up in a different environment then being in the city and was never taught how to act and what to do and not do in the city so when they came here, it was almost like culture shock and they were scared of being in downtown Atlanta, so you just have to be smart when walking around. I think the second group of people who don’t like GSU probably had a hard time making friends and building connections with people. This isn’t really a party school. Georgia State is a big school and also a commuter school which is good and bad but the good thing is that there are lots of clubs, organizations and events to meet people. \n\nYou mentioned that you liked the design programs here. I don’t know what specific major you were talking about but I am a graphic design major, the program itself is competitive but it’s definitely an experience. Also you’ll be in smaller classes for your art courses, from personal experience, the friends I do have, came from those classes.",
            "score": 18,
            "author": "DeziiBee"
        },
        {
            "level": 0,
            "comment": "Folks always are going to be sassy. I stayed at GSU because i wanted to see the real world. Like i didn’t want a traditional mainstream school experience - but that is absolutely something you can experience by living on camps if you choose to seek it out.\n\nBut GSU was MADE for nontraditional and underprivileged students. And that’s who it caters and honestly who is most happy there. Folks who commute, who have lives, who are going back to get an education, or whose parents don’t make all that much and are hoping for a better future. \n\nAs an academic advisor at GSU when students tell me they want to leave, i let them to go where fits them best. Some other schools truly do fit students who want a traditional mainstream college experience and can afford it. Some other schools are more online. Some other schools have lower standards. There are a myriad of reasons folks want to leave any university. You should hear the things we hear from transfer students LEAVING those other Universities - the complaints are similar 🤷‍♀️",
            "score": 15,
            "author": "hollytot"
        },
        {
            "level": 0,
            "comment": "I would definitely recommend going to Paris.",
            "score": 8,
            "author": "Much-Ad1538",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly the better choice lmao",
                    "score": 2,
                    "author": "CranberryOk9645"
                },
                {
                    "level": 1,
                    "comment": "I second this you ain’t missing much at GSU",
                    "score": 1,
                    "author": "davethegreat2020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to UGA for undergrad and GSU for my master's. Both schools have very different experiences because of the surrounding area and the student population. \n\nI think UGA has more resources than GSU because it's simply so huge. Keep in mind though that a lot of those resources are going to business and agriculture students. So if you're pursuing design, I can't imagine the curriculums being all that different. In fact, I would think that being based out of Atlanta would be a lot better for design majors. \n\nAnd, quite frankly, people still take GSU grads seriously. I think there is this notion that GSU students coast through their courses, but if you want get into a design career, you have to put in the work just like anyone else, and that will show up on your CV/resume. I can't say that I am very familiar with the design field, but I just have a hard time imagining people discriminating against someone who went to GSU instead UGA. And if a person does, they're not a person worth working for.\n\nOne thing to mention is that UGA may have more study abroad opportunities in France than GSU. I'm sure GSU has opportunities too, but as a graduate student, their study abroad programs were not on my radar, so I don't know much about them.\n\nAtlanta's cost of living is a bit insane these days... I don't know if it would be cheaper than Paris... Not sure what the tuition situation would be for that Paris school either. Just some other factors to keep in mind too.",
            "score": 5,
            "author": "Nexu101"
        },
        {
            "level": 0,
            "comment": "I love GSU for it’s diversity and staff. GSU has a lot of students with different perspectives in life, and I respect a lot of my peers for handling so much. I’ve been to the GT campus plenty of times and always feel out of place and unwelcome. That being said I got a really good internship at a large corporation only thanks to GSU for their career fair. If all goes well I’ll be salaried in my career field straight out of college. No one cares what college you go to, you just have to be embrace being there to get your degree and a good outcome.",
            "score": 5,
            "author": "thatsesmy"
        },
        {
            "level": 0,
            "comment": "Certain schools matter if they're know for a particular program, such as Applied Linguistics at GSU, but even then 99% of the time the degree is what matters and not the school printed on it.",
            "score": 4,
            "author": "123asdasr"
        },
        {
            "level": 0,
            "comment": "I recently graduated, if you really liked it, go therem it's a decent school with a great community",
            "score": 4,
            "author": "CXyber"
        },
        {
            "level": 0,
            "comment": "GSU is pretty great, but it’s not for everyone. It’s downtown, and there’s very little greenery and no real outdoor spaces to really relax in, but the programs are mostly fantastic! There’s a TON to do within a few miles of campus, but no little college town like Athens. If it’s for you, you’ll have a great time! If big cities are not your thing, do Kennesaw or UGA.",
            "score": 4,
            "author": "I_Sometimes_Lie_"
        },
        {
            "level": 0,
            "comment": "I like it. Their nursing program is great! I’m about to graduate from it and it’s been an amazing time. I chose to go here because it made the most sense for my pocket book. .. there’s no need to go into debt for a bachelors degree you may or may not use. Your masters I will say is more important if you plan to get that. I know people who got their nursing degree at emory (private) and here at GSU and they are working the same job. It’s a fine school. They probably didn’t take advantage of all the cool things it had to offer",
            "score": 5,
            "author": "Chingoputapendajo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats to you! Fellow RN here and I second this. Where you get your degree does not matter, especially for healthcare related fields. Many of the Nursing students I work with today tell me that they wish they had gone to a cheaper college or university instead of paying like 20k a semester at Emory. At the end of the day, a nurse is a nurse regardless of where you study and as long as you earn your license. For me, I actually went to GGC for my BSN and now i’m doing my graduate degree at GSU!",
                    "score": 2,
                    "author": "renznoi5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 1,
                            "author": "Chingoputapendajo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a state school that anyone with a pulse can get into. \n\nTherefore, those at UGA and GaTech feel a sense of superiority. \n\nOf course, their alma mater only gives a minor boost in the beginning before experience in their chosen field begins to take over and your college of choice doesn’t matter unless the one hiring you attended the same university resulting in nepotism. \n\nI went on a tangent, but the point is, if you like GaState, then go there",
            "score": 11,
            "author": "tyreejones29"
        },
        {
            "level": 0,
            "comment": "Be prepared for inappropriate adult interaction with homeless folks when not in buildings.  \n\nMaybe even in buildings sometimes.\n\nThe campus is landlocked in a major downtown area and that in itself has same major drawbacks.",
            "score": 3,
            "author": "Sooowasthinking",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the homeless issue is the biggest con of GSU. And they refuse to do anything about it. But as long as you just don’t talk to them and use some common sense you should be okay. I’m not absolving GSU of any responsibility. They need to fix their crap.",
                    "score": 5,
                    "author": "gsuboiboi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of crime happens in the parking decks and ball fields as well. Anyone who is reading this do not walk around campus being naive. I even saw a homeless guy once charge at a group of students at the front entrance to Aderhold in the middle of the day. Do not play around with these homeless people.",
                            "score": 1,
                            "author": "Same-Menu9794"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "people are just pretentious gsu is honestly fine lol",
            "score": 3,
            "author": "ktojm"
        },
        {
            "level": 0,
            "comment": "My wife and I met as grad students at GSU—I transferred to Emory and she finished at GSU (we both have similar PhDs). She is now tops in her field and works at the CDC. I have a solid job elsewhere in the government, but not nearly as successful. If you are bright and work hard, GSU can be a great school to get a degree—and being located in Atlanta should not be underestimated—you just have to make the most out of your opportunities.",
            "score": 3,
            "author": "WhereasVegetable1801"
        },
        {
            "level": 0,
            "comment": "GSU's campus might have a reputation, but they compensate for that by their actual education.",
            "score": 5,
            "author": "RoberttheRobot"
        },
        {
            "level": 0,
            "comment": "I loved my time at GSU. People give it a bad rap for no reason other than it’s not as big of a name as UGA and GT. Lol not to blow my own horn but I know way too many GSU graduates who ended up getting into much more prestigious grad schools and companies then a lot of UGA and GT grads. College is what you make it and GSU should not hinder you in any way.",
            "score": 6,
            "author": "gsuboiboi"
        },
        {
            "level": 0,
            "comment": "Georgia state is not going to be a college like Georgia Tech, you're not going to get the same kind of Praise going to Georgia State that you would going to Georgia Tech. It's a lot more academically relaxed over here and it's in \"the bad part of town\" so people that don't want to accept the reality of going to school in downtown Atlanta decide to blame it on the school and not the fact that it's downtown Atlanta",
            "score": 4,
            "author": "ad-lib1994"
        },
        {
            "level": 0,
            "comment": "I love GSU but if it is reasonable to study in Paris I doubt you'd ever regret that haha",
            "score": 2,
            "author": "thousandpetals"
        },
        {
            "level": 0,
            "comment": "I never went to any other school but GSU but plenty of my friends that transferred out of there are a lot happier and say the quality of classes are a lot better. Take that how you will. At the end of the day it's just college and its a small portion of your life. Don't make it a massive deal.\n\nAlso, go to Paris. Experiencing a different country and culture is going to make the experience way more fun.",
            "score": 2,
            "author": "Own-Opposite1611"
        },
        {
            "level": 0,
            "comment": "Depends on you and your major. GSU has a lot of great faculty and programs. If you like Gsu for Gsu, then it wouldn't hurt to go.\n\nThat being said, that Paris offer sounds really cool. I don't know anything about the everyday culture there so I can't make the judgment call unfortunately.",
            "score": 2,
            "author": "byoseph2"
        },
        {
            "level": 0,
            "comment": "Dude, for probably 90% of career fields, as long as you get your piece of paper, no one gives a shit where you went to school.\n\nThere are exceptions- like if you want to be an engineer, then yeah, GATech with probably do you better than GSU. Some other fields like pre-med may also have a very slight advantage if they want to apply to T10 or T20 med schools if they go to the \"better\" undergrad.\n\nBut at the end of the day, the most important thing is to go somewhere where you will be happy. You are about to spend the next 4 years at this place so you better make damn sure you like living there. I always advise people against picking the \"better\" school just because its \"better\" unless you are in one of those niche fields where higher pedigree will get you into a better school for higher education or the school has a really top tier program for your field of interest.\n\nFor my first undergrad (I'm weird, I had 2 bachelors- first undergrad in my homestate in music, second bachelor's at GSU in chemistry, now a chem PhD student at GSU). For my first undergrad in my homestate, I got into a \"better\" school than the one I ultimately chose. The \"better\" school was in a college town with a very boring looking campus where literally every single student dressed the same and looked the same (I've never been to UGA, but sounds like a similar vibe to this school). All the guys dressed like frat bros and the girls all had the messy bun, the school sweats and ugg boots. I just knew there was no way I'd find \"my people\" or be happy on that campus. I ended up going to a way more diverse school in the middle of a really cool city that had lots of my kind of artsy people and tons of fun stuff to do. I have no regrets.\n\nGo where you will be most happy. If you like GSU, go to GSU.\n\nParis sounds dope though, but I'd highly recommend starting to learn French now if you don't already speak it. I've been to Paris before and don't speak French at all. Wonderful city, but I definitely felt lonely and isolated towards the end of the trip not being able to speak the language. And I was only there for 10 days on vacation lol. \n\nI would check out study abroad opportunities in France if committing to the full thing is intimidating.",
            "score": 2,
            "author": "BellaMentalNecrotica"
        },
        {
            "level": 0,
            "comment": "All I am saying is...I graduated with a good, high-paying job last year and met my wife. GSU is the best decision I've ever made. Do what you wish with that information",
            "score": 2,
            "author": "jaylan101"
        },
        {
            "level": 0,
            "comment": "I graduated from gsu and after 4 years living on campus i can confirm that all the “stigmas” about state are just from a bunch of racists that are scared of poc/black people. The only “downside” of state was not having a traditional campus but I honestly enjoyed being in the city.",
            "score": 2,
            "author": "Aggravating_Brush_81"
        }
    ]
}