{
    "id": "141oilh",
    "score": 2,
    "title": "desperately looking for housing recommendations!!!",
    "author": "wineshampoo",
    "date": 1685992075.0,
    "url": "https://www.reddit.com/r/GaState/comments/141oilh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey there! I'm an international freshman from Europe, and it seems like I'm not qualified for housing, unfortunately. I've been looking around to find a safe option near campus, like The Mix and The Legacy, but I saw some of you say those are scams. I could spend around 1200 dollars if necessary, but I would like to feel safe and have a nice place. Ideally, I'm looking for a 4-bedroom apartment, with roommates, similar to The Mix option, but without the scam part. I know absolutely nothing about Atlanta yet, and I desperately need help. Do any of you have any recommendations? I would really appreciate it. I'm a female and I'm 21 years old btw.",
    "comments": [
        {
            "level": 0,
            "comment": "As an international student from Europe I would say look on the housing fb group for GSU as well. Sure the student housing sucks bc you’re living on campus, but it’s not a scam in regards to you being from a different country and have no idea how American transport works and our commuting options frequently involve needing more money.\n\nI would still consider one of the complexes in downtown Atlanta on GSU campus and keep looking for other options as well but I know students who live off campus end up being even more isolated from their peers, and I can imagine that being even worse as an international student.\n\nJust my two cents, I think they have a housing discord chat too listed somewhere in this sub",
            "score": 1,
            "author": "hollytot",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's what I'm afraid of as well... but what can I do if I don't qualify for GSU housing?",
                    "score": 1,
                    "author": "wineshampoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would look at the housing downtown that is off campus, like the legacy or the Mix, it’s better than having to commute",
                            "score": 1,
                            "author": "hollytot"
                        }
                    ]
                }
            ]
        }
    ]
}