{
    "id": "144mkrk",
    "score": 1,
    "title": "Is media, Culture, Society the same as art, society, culture?",
    "author": "trxllrico",
    "date": 1686261656.0,
    "url": "https://www.reddit.com/r/GaState/comments/144mkrk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m trying to figure out so if I have to change it I can go ahead and do that.",
    "comments": [
        {
            "level": 0,
            "comment": "One is about art and one is about all forms of media.",
            "score": 1,
            "author": "hollytot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got an email saying this once I changed it to media culture society. Thanks for contacting us. After reviewing your account, I notice that you are enrolled in 6 credit hours however only 3 credit hours go toward your Course Program of Study. You MUST enrolled in 6 or more credit hours that MUST count towards your Course Program of Study. Please contact Academic Advisor for assistance. The Pell will not disburse until you do so. Continue to review your GSU email and PAWS account for account updates.",
                    "score": 1,
                    "author": "trxllrico",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make sure you’re only taking classes listen on your academic eval",
                            "score": 1,
                            "author": "hollytot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is on my academic evaluation",
                                    "score": 1,
                                    "author": "trxllrico",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t they both count for the same credit on your eval though?",
                                            "score": 1,
                                            "author": "hollytot"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s why I was confused when I received that",
                                    "score": 1,
                                    "author": "trxllrico"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And I’m a computer science major and my pathway said I was able to take it so idk",
                    "score": 1,
                    "author": "trxllrico",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can take it if you have it as an elective option left. Follow your academic eval to figure out courses to register for",
                            "score": 1,
                            "author": "hollytot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can I add you so I can show you everything",
                                    "score": 1,
                                    "author": "trxllrico",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can call our dept during office hours 9-5 the number is 404-413-2300",
                                            "score": 1,
                                            "author": "hollytot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}