{
    "id": "iiim8e",
    "score": 115,
    "title": "Stressed and sad",
    "author": "joycaramel",
    "date": 1598659670.0,
    "url": "https://www.reddit.com/r/GaState/comments/iiim8e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone else feeling extra stressed and/or sad this semester? Just feeling kind of down about how things were so different a year ago. This is my last semester at gsu bc I’m graduating in the fall but I feel like I’m burnt out.",
    "comments": [
        {
            "level": 0,
            "comment": "Also my last semester. Also fat same. And on top of that, I'm moving in 4 days, taking 19 hours, and working about 20 hours a week. Definitely not trying to be \"I have it worse\", just saying that I 100% feel you on that",
            "score": 35,
            "author": "Zip-kicks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahh good luck to you! Same I’m working two jobs and taking 12 credit hours, just feeling overwhelmed overall :/",
                    "score": 16,
                    "author": "joycaramel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You too! I definitely feel overwhelmed with everything. If you ever need to chat, feel free to reach out! We'll get through this :)",
                            "score": 7,
                            "author": "Zip-kicks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! I really appreciate it! We will for sure :-)",
                                    "score": 3,
                                    "author": "joycaramel"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm in the same boat! Best wishes to you, friend. :)",
                            "score": 3,
                            "author": "sinnohmyth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much! Same to you :-)",
                                    "score": 3,
                                    "author": "joycaramel"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wow Joycaramel. Me too. 1full, 1part and 12 credits",
                            "score": 3,
                            "author": "juancarv"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m taking 15 credit hours, working 40 hours, commute an hour one way to campus and one hour back, managing a side business too. I feel you",
                    "score": 3,
                    "author": "pmjsandwich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow! You got a lot too! Honestly, having to move in the middle of school is stressing me out the most. Cause I have to take two days out of the week to move",
                            "score": 4,
                            "author": "Zip-kicks"
                        },
                        {
                            "level": 2,
                            "comment": "Major props to you. It’s hard to not feel stressed out but hopefully it’ll get easier for us.",
                            "score": 3,
                            "author": "joycaramel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me too. I went back to school at 35 years old and was hoping to change my life, meet new people and expand my world. Now I'm jobless and more alone than ever. I really liked going to class and couldn't wait for warm weather to sit outside and study in but, spring and summer came and went. I miss the campus and I'm frustrated that these online classes are a complete rip off. I don't have a single teacher that actually teaches. My history teacher for example just posts videos from a different professor at GSU. Such a dereliction of duty. So, yeah. I've been really sad today.",
            "score": 24,
            "author": "HauntedbyHorribles",
            "replies": [
                {
                    "level": 1,
                    "comment": "i was really bummed out too, but i took a stroll last week past the new library plaza area and its looking really great!! i cant wait to sit out in the grass there between class and having my lunch there instead of dodging people at broad st(:",
                    "score": 6,
                    "author": "lolopenguin4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that’s a positive! I’ve been on campus too just doesn’t feel the same anymore. I think I just have to take it one day at a time and not overwhelm myself as much.",
                            "score": 3,
                            "author": "joycaramel"
                        },
                        {
                            "level": 2,
                            "comment": "That’s all great until the smokers claim it.",
                            "score": -1,
                            "author": "gsuboiboi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hahah. Same. After working behind a computer for over a decade, I thought I would go to grad school to pursue a more active therapy related vocation, and I find myself in front of the computer MOARRRRRRRRR now.   \n\n\nLOLCRY.",
                    "score": 4,
                    "author": "jimiyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao for real! I’m so burnt I need a break from school like I wanted to get my masters right after but that’s a hard no for me now lol",
                            "score": 1,
                            "author": "joycaramel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m really sorry. I feel that. I wish I took more advantage of just sitting in the courtyard and enjoying the weather. It’s sad that it won’t be the same again since I’m graduating. I’m just thankful for the times I did get to spend there. I hope you do well on all your classes and we’ll get out of this rut I’m sure.",
                    "score": 2,
                    "author": "joycaramel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Congrats on your final semester. That's big.",
                            "score": 2,
                            "author": "HauntedbyHorribles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank u! I really appreciate it",
                                    "score": 2,
                                    "author": "joycaramel"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, feeling super depressed about this semester. Has taken the fun out of courses. All my teachers are using a bunch of different platforms, too many to learn",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel that :/",
                    "score": 1,
                    "author": "joycaramel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I really feel bad for the freshmen’s bc this is definitely not an ideal situation and it sucks that your first year of college is like this but hopefully things get better in the future!",
                    "score": 1,
                    "author": "joycaramel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same. I’m at military training right now and the internet connection sucks. I barely got any work done this week and I’m so stressed out. I feel like I’m failing even though it’s just the first week. I did let me professors know what’s up though. It’s just been a crazy time for all of us. Hope we can all get through this together.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it’s just first week stress but damn this week has been so long. I hope so too!",
                    "score": 2,
                    "author": "joycaramel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel yeah there as well. Not as much excitement when I’m sitting in front of a computer all day with not much interaction.",
            "score": 4,
            "author": "SamWearsPajamas"
        },
        {
            "level": 0,
            "comment": "Yeah mostly stressed tho. Sad that I can’t physically see my friends and stressed/burnt out from the workload and having no emotional support....",
            "score": 3,
            "author": "TheIronkun"
        },
        {
            "level": 0,
            "comment": "I know what you mean. I transferred to GSU from another usg institution last year. I had 90% of core done and ready to take upper levels classes. I loved my professors and the material I was learning- there was no better place than gsu. I made friends in the program and related clubs. Finally, While transferring I joined a team with student athletics. I didn’t go a single day feeling lonely on such a large campus, I felt a part of the family and now it’s faded away. Everything is online so I have no reason to commute 80miles round trip. Therefore I can’t make team practices at 7am. It sucks, I miss my sport, my friends, and the panther family.",
            "score": 4,
            "author": "saturnsbitc"
        },
        {
            "level": 0,
            "comment": "Me too man. I was so looking forward to getting to be around people again and the depression from being isolated for so long with no end in sight is really making it difficult to succeed with being 100% online. I’m thinking about dropping a couple of classes just to reduce the mounting stress but that would postpone my graduation date and I can’t help but feel like a failure because of that.",
            "score": 3,
            "author": "captainkaiju",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it’s just really hard to stay positive overall but I hope it gets better for you.",
                    "score": 1,
                    "author": "joycaramel"
                }
            ]
        }
    ]
}