{
    "id": "j8llvx",
    "score": 155,
    "title": "is anyone else bothered by having to see all the poors on campus?",
    "author": "ishmaeltrickery",
    "date": 1602340896.0,
    "url": "https://www.reddit.com/r/GaState/comments/j8llvx",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey all,\n\ni’ve been attending GSU for three years and i am as a grown person only now realizing that atlanta has an intense homelessness epidemic. while i realize that the austerity of atlanta housing legislation has allowed developers to push thousands of black families into the streets without any recourse for the past decade, i think this is most hard for me because i have to see them be poor in my general periphery. \n\nwhen will the police clean out the streets of these poors and just take them somewhere else once and for all? i would like to live in a rapidly gentrifying city plagued by corrupt development schemes but never have to reckon with any of that or my role in it.\n\nthanks!",
    "comments": [
        {
            "level": 0,
            "comment": "okay. angry bc this post did to me exactly what it was designed to do\n\ngg",
            "score": 89,
            "author": "blootannery"
        },
        {
            "level": 0,
            "comment": "you had me in the first half I’m not gonna lie",
            "score": 17,
            "author": "BigGreenApples"
        },
        {
            "level": 0,
            "comment": "[volunteer with the housing justice league](https://www.housingjusticeleague.org)",
            "score": 46,
            "author": "ishmaeltrickery"
        },
        {
            "level": 0,
            "comment": "The sarcasm is funny!",
            "score": 10,
            "author": "Specialist-Mix-7331"
        },
        {
            "level": 0,
            "comment": "Treat people the way you want to be treated. Never know what could happen. Karma is huge",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Great Post.",
            "score": 13,
            "author": "MathPlacementDud"
        },
        {
            "level": 0,
            "comment": "LMFAOOOO IS THIS A JOKE CAUSE WTF BRO",
            "score": 16,
            "author": "DowntownIron7",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes i got just a little angry at some of the posts circulating on this subreddit",
                    "score": 50,
                    "author": "ishmaeltrickery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh that’s soooo koolllllll",
                            "score": 1,
                            "author": "jacobmalon21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh. Well there are multiple reasons why homelessness is a problem is ALL cities worldwide. \nBut there are people who suffer from mental illness. Some who are legit screwed by the system like social security. Some avoiding the shelters for reasons (mostly because its risky AF) you get your stuff stolen, you stay too long (and sometimes if you meet a certain income)they see its your time to go. Apartments are hard to find in the city that accepts minimum wage and often having to travel out to find cheap rent. Between those two factors its a catch 22. You make too much to stay in a shelter and you make too little to rent an apartment. I have been in the same position and thank god I was able to stay with my grandmother till I was able to get off my feet. But if homelessness bothers you so much you can talk to officials and make a change. Tell them about the different programs that are still avalible to get a certification. But please do not look down on someone based on how they look or how little they have...",
            "score": 5,
            "author": "JibIette",
            "replies": [
                {
                    "level": 1,
                    "comment": "hey! thanks for sharing your experience &amp; i really appreciate your comment; just wanted to make clear that this post is satire of some of the insensitive posts about unhoused people that have been circulating on this subreddit, and i agree with you entirely. apologies for the confusion!",
                    "score": 13,
                    "author": "ishmaeltrickery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I see your point but no one wants to get a penis flashed at them when they're trying to walk to class. It's unsafe to be a woman on campus sometimes because of this issue.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. As a woman, I have been harassed on campus several times and campus police do nothing.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is the best post I've seen on this sub in years.",
            "score": 2,
            "author": "Elder_John"
        },
        {
            "level": 0,
            "comment": "Nice",
            "score": 1,
            "author": "campfiresongmaniac"
        },
        {
            "level": 0,
            "comment": "Quality post",
            "score": 1,
            "author": "csanders46"
        },
        {
            "level": 0,
            "comment": "Honestly I never understood homelessness here in America. There are so many programs and organizations that are willing to help and house people to prevent them from staying on the streets.\n\nMy family is from the Philippines and homeless is a huge problem there. There's hardly any programs to help people get back on their feet and if there is you basically have no chance of receiving aid since the demand is so high. It's also not a very high priority for the government to do anything about it. \n\nI've thankfully never been in a situation where I had to become homeless though I did certainly come close before. Maybe it's just cause I've never personally experienced homeless here that I don't understand how it is here in America.",
            "score": 1,
            "author": "NickieBoy97",
            "replies": [
                {
                    "level": 1,
                    "comment": "i understand the confusion entirely, and i appreciate you bringing it up. you’re entirely correct that the united states is a very wealthy country capable of equipping all of its homeless population with the resources to rehabilitate themselves — but yet we still have crowded homeless shelters desperately unable to service the sheer enormity of america’s homeless population. we still have a tragic amount of people in the streets. why?\n\nfirst, i think it’s best to understand the homelessness epidemic in atlanta (and the united states writ large) as almost always the market leaving large groups of people behind in its pursuit of expansion, profits; that is, there’s an economic incentive driving people into the streets (housing development and the massive amount of money in real estate), and while there could be some profit gleaned from those people driven to homelessness remaining in the workforce, the immediate profits of a rent surge are much greater. so, rather than employing those people, it makes more financial sense on the part of housing developers, landlords, etc. for these families to be homeless or otherwise displaced by being priced out of their homes.\n\nso, here’s why they’re homeless, generally — excluding the many cases of cyclical homelessness, or children born into addiction &amp; poverty; how come they can’t get back on their feet?\n\ngovernment programs in america are desperately lacking, and many require government-issued ID and a variety of paperwork to receive, to which many homeless people have no access. this isn’t to mention as well that the U.S. government is generally run (for the past 60 years or so) as an austerity government, i.e. one which avoids any provision of social welfare as much as possible. so the process of receiving this assistance is humiliating &amp; grueling, and often the rewards are still barely enough to subsist — and this is assuming you even know about the program!\n\nso, what about charities? simply speaking, charities can’t possibly keep up with the profundity of the homelessness epidemic. more realistically, some bigger charities face a real problem, too — if they solve the problem they seek to tackle, they no longer exist. wouldn’t they have a motive to *not* solve the issue off of which they’ve made their wages?\n\nso, finally, what do we do if these things seem hopeless? you fight! you volunteer with organizations like the atlanta housing justice league to prevent mass evictions; you attend sit-ins at the capitol to protest mass displacements; you encourage renters to get in touch with local tenants’ unions, and you support those unions which exist — you fight to ensure that housing isn’t treated as a privilege which can be whisked away at the whim of a landlord, but instead, as a fundamental right. that’s how you solve these problems — not hope for the cops to enact some “permanent solution”",
                    "score": 21,
                    "author": "ishmaeltrickery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah definitely agree.\n\nThe thing I personally don't really get is that while government programs and charities are somewhat lacking here in the US at least we have them. \n\nThere are many countries where charities and government support are almost non existent. At least here in America, you have the opportunity to get support if needed. \n\nI know a few of my personal friends from Atlanta are homeless, but it's something they choose. I always try to give advice on what they opportunities to get support, but they always decline it.",
                            "score": -2,
                            "author": "NickieBoy97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To clarify for those who are downvoting me. I'm definitely not trying to look down on homelessness. I also see it as an extreme issue. \n\nHowever the point I'm trying to make is that we in America luckily have opportunities to get out of situations like that. Other countries are not so fortunate.",
                                    "score": 2,
                                    "author": "NickieBoy97",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But how does this point contribute to the discussion in any way? You're essentially saying, \"Hey, others have it worse!\"",
                                            "score": 3,
                                            "author": "4headspot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was just mentioning how personally I have a hard time grasping the concept of homelessness here in America. \n\nDidn't mean anything by it. Sorry if I offended anyone.",
                                                    "score": 1,
                                                    "author": "NickieBoy97",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, I don't mean to be confrontational or anything. It's good that you're asking questions and want to learn, you haven't offended anyone. It's just that when an issue exists in a society, citing other societies that failed to address it doesn't really do anything productive to the issue at hand is all.",
                                                            "score": 2,
                                                            "author": "4headspot",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Gotcha. Maybe it was just poor word choice on my part/me not really understanding the purpose of the original post. Again, didn't mean to offend anyone if I did. Just personally have a hard time understanding how this is a major issue in America.",
                                                                    "score": 2,
                                                                    "author": "NickieBoy97"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Communists trying to be funny.",
            "score": -3,
            "author": "Ginkoleano",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes. what’s up?",
                    "score": 6,
                    "author": "ishmaeltrickery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Humans have discriminated and pulled down groups of people where ever they've had the power to do so. No where in history will you find a group of people go from poverty to affluence because of political reform. It takes work on the side of the individual to overcome adversity. So don't just pass off the homelessness problem as a result of Atlanta housing laws and assert that the ONLY way this can be fixed is if we have a mass reform in legislation.",
            "score": -2,
            "author": "gsuboiboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "politics are the negotiation of the distribution of resources. the economy is a dimension of politics i.e., again, the distribution of resources. not two separate things. hope this helps",
                    "score": 7,
                    "author": "ishmaeltrickery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And your point is? You need to look at the homeless population first. An overwhelming majority is on the street due to their own actions. Not because of the government. Secondly, your idea to just deal with it because it's a political issue is appalling. No one's asking to remove them from campus because they look bad. It's a plea to increase campus safety. Say a student is robbed or attacked. Should we just ignore it because it's the \"result of legislation\" ?   \n\n\nThe homeless are not GSU's responsibility. The student's are their responsibility. Are you that sensitive that asking for a safer campus is an unrealistic request? You might be in your warm cozy bed tabbing through zoom lectures while there are students who have to come to campus during this pandemic to attend their classes. It's abhorrent that hardworking, paying students have to feel unsafe on campus. And just because they recount their experiences on this subreddit, you have the audacity to mock them on your disillusioned moral high ground. You are pathetic.",
                            "score": 0,
                            "author": "gsuboiboi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "have lived in south atlanta my entire life, and currently do live on campus. have been harassed a number of times, particularly on account of my sexuality and the way i present myself. i’m intimately familiar with poverty and was nearly been rendered homeless myself, in the wake of the 2008 global recession. so, no, sorry, not just going through the motions of zoom classes in bed. \n\ni understand your plea for increased campus safety and i’m sorry to hear of your unpleasant experiences. again, i sympathize. i’m not asking you to ignore this — quite the opposite, in fact: asking for police (GSUPD being an actual arm of APD, not just campus security) to remove these people is, indeed, ignoring the larger problem in which GSU is, in fact, complicit. simply carting off the homeless population to somewhere else doesn’t change any of the underlying problems, and it’s a grotesque response to your exposure to an inconvenient truth. urban universities (GSU among them, but NYU and john hopkins being even more prime examples) in the united states are intensely complicit in the mass displacement of poor families and the gentrification of surrounding areas. going to GSU, you ought to be able to reckon with this and its consequences, and fight for more sustainable university development &amp; student living. not just hope for the problem to be vanished by force.\n\ni apologize if you feel mocked, and again sympathize with your experiences. but i’m troubled by your suggestion that, even in the case of these people somehow having *chosen* by some horrible act of self-destruction to sleep on the streets in desperate starvation, or to become addicted or otherwise mentally ill, they then deserve to be jailed or otherwise displaced. i hope you find peace",
                                    "score": 7,
                                    "author": "ishmaeltrickery"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Poe's law is making this thread hella stressful. But good on you for fighting the good fight, GSU (and the world) needs more folks like you.",
                            "score": 2,
                            "author": "knightsofmars"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Having a large homeless population is a larger tax burden than it would be to house them. Having people live on the streets is expensive belive it or not. They take up all types of public resources (emergency room fees, first responders, public works to clean up after them).",
                    "score": 2,
                    "author": "panther254"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone got whooshed by this post.",
                    "score": 7,
                    "author": "SeanTheTranslator"
                },
                {
                    "level": 1,
                    "comment": "?",
                    "score": 2,
                    "author": "HirSuiteSerpent72"
                }
            ]
        }
    ]
}