{
    "id": "efg16b",
    "score": 86073,
    "title": "Ladies and gentlemen, the pinnacle of human stupidity.",
    "author": "KoldunMaster",
    "date": 1577277399.0,
    "url": "https://www.reddit.com/r/CrappyDesign/comments/efg16b",
    "media_urls": [
        "https://i.redd.it/fcyap6fzxr641.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "They are not even *peeled*. Jesus fucking Christ, now I have to peel these motherfuckers *twice.*\n\n\n**This is bananas!**",
            "score": 5244,
            "author": "DeNir8",
            "replies": [
                {
                    "level": 1,
                    "comment": "The guys who wrapped them in plastic?",
                    "score": 949,
                    "author": "Ebinebinebinebin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Peel the skin off, put it back on, and then peel it off again. That'll show em",
                            "score": 479,
                            "author": "Integral12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Deglove me daddy",
                                    "score": 306,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's new",
                                            "score": 176,
                                            "author": "PM_ME_UR_SPACECRAFT",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 89,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I would think sewing needles would be able to pierce the plastic and be inserted into the banana without leaving any apparent signs of tampering. The plastic in the photo isn't inflated like a chip bag or anything.\n\nThis is just wasteful, period.",
                                                            "score": 107,
                                                            "author": "SyntheticReality42",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just because they aren’t puffed up like a chip bag doesn’t mean they aren’t air tight . If you zoom in you can see both ends are sealed shut so if you squeeze it it shouldn’t deflate unless it’s been damaged or tampered with . \n\nI didn’t know about the needle thing but I don’t doubt it because some people are complete POS( I remember someone stuck a tissue with sometype of horrible disease/infection on it in a payphone change slot[yes I’m old] and it infected like 3 people). I thought it was just to prevent it from getting brown faster",
                                                                    "score": 33,
                                                                    "author": "Shaking-N-Baking",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Bananas brown quicker when wrapped though because of a gas they give off.",
                                                                            "score": 50,
                                                                            "author": "UncookedMarsupial",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah I saw that in another comment .\n\nPlot twist: they are trying to ripen the bananas so they can be eaten the day of sale",
                                                                                    "score": 26,
                                                                                    "author": "Shaking-N-Baking",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes in certain types of plastic allow that gas to escape which improves the longevity of freshness while keeeping others out",
                                                                                    "score": 5,
                                                                                    "author": "frisky024",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "To prevent future needle panics the Strawberry Industry is incoculating us to pain by encouraging genital degloving fetishes.",
                                                            "score": 14,
                                                            "author": "NoJelloNoPotluck"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Placing bananas in a plastic bag will slow down the ripening process. This could have been done to extend the shelf life of the bananas.\n\nConversely, placing bananas into a paper bag will speed up the ripening process because paper allows the oxygen in while also trapping ethelyne in. Bananas produce higher amounts of ethelyne during the ripening process than other fruits do. So placing other fruit into the bag with the bananas will help them ripen more quickly.",
                                                            "score": 12,
                                                            "author": "buckbrown89",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Individually wrapped strawberries saved the industry?",
                                                            "score": 5,
                                                            "author": "s123man"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes.",
                                                                    "score": 8,
                                                                    "author": "GodSavesZelda"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Seems like you guys have things together here. Keep up the good work",
                                                                    "score": 5,
                                                                    "author": "Rogue_elefant"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tell them they need to make a W shape with their legs and it should work.",
                                                                    "score": 3,
                                                                    "author": "BoogerManCommaThe"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wow, a literal Shittymorph",
                                                                    "score": 3,
                                                                    "author": "InkJungle"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "A couple of potential possible reasons:\n\nBananas release ethylene which causes rapid ripening of other fruits and veggies nearby. They may be trying to prevent this.\n\nAlso, the total carbon footprint of the packaging is much less than the carbon footprint of the food going to waste. Any opportunity to extend the shelf life (assuming it results In Being eaten instead of being thrown away) is technically better for the environment.  A similar yet more extreme example of this would be a fully processed ham in shrink wrap. The carbon footprint of the ham is up to 700 times more impactful than the plastic wrap itself, so you really need the ham to last as long as possible.\n\nThis is of course in theory. I’d rather just have the peel do it’s job and hope for people to waste less food/grocery stores improve algorithms to minimize waste.",
                                                            "score": 4,
                                                            "author": "YoItsMeAmerica"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "God damnit I wish I had a spacecraft to pm you.",
                                                    "score": 5,
                                                    "author": "Nihilikara",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The thought is appreciated brother",
                                                            "score": 4,
                                                            "author": "PM_ME_UR_SPACECRAFT"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Humanity was a mistake",
                                            "score": 11,
                                            "author": "SanguineOpulentum",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fucking Christ why didn't I listen!!!",
                                                    "score": 5,
                                                    "author": "staysayo",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "*Googles 'degloving'*\n\nOh.",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "All I want for Christmas is to be able to use reddit for one day without coming across this fuckery",
                                            "score": 3,
                                            "author": "arrow74",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Take the peel off of the banana entirely, put the plastic wrap around it, then put the original peel back on over the wrapping.",
                                    "score": 22,
                                    "author": "MerlinGrandCaster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s truly evil. You have a bright future in packaging.",
                                            "score": 10,
                                            "author": "LillyPip",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No truly evil would after you wrap the banana in plastic and put the peel over it would be to attach it to a piece of cardboard with zipties and then vacuum form plastic around the whole thing.",
                                                    "score": 8,
                                                    "author": "centran"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What",
                            "score": 5,
                            "author": "fnord_happy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/2healthbars",
                    "score": 49,
                    "author": "tacoslikeme"
                },
                {
                    "level": 1,
                    "comment": "And now I have to drive all the way to the ocean to dispose of both peels...so inconvenient!",
                    "score": 41,
                    "author": "NeverLookBothWays",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feed the peels to the eels!!",
                            "score": 7,
                            "author": "shahooster"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "LPT: if you are going to give a banana as a Christmas gift, unwrap it the day before.  That way, the recipient can immediately enjoy it.",
                    "score": 36,
                    "author": "thunder66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this a meme now? I like it.\n\nLPT: if you are going to give a dildo as a Christmas gift, lube it the night before. That way, the recipient can immediately enjoy it.",
                            "score": 6,
                            "author": "PM_Me_Your_URL",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They do this in Japan for all their fruit and most of their veggies.\n\nIt’s a goddamn nightmare. They’re trying to cut down on plastic before the Olympics because people (foreigners) are calling them out on their plastic usage.",
                    "score": 19,
                    "author": "Queen_Of_Ashes_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Japan is one of the top producers of single use plastic but they also are one of the top recyclers of single use plastic and create very little plastic pollution. They are one of the most environmentally conscious countries. Little to no public trash cans and little to no trash on the streets. What they are doing for the Olympics is because they know visitors from other countries are not as good about not polluting.",
                            "score": 13,
                            "author": "DuckOfDeath-IHS"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My local sells oeeled oranges in a big ass plastic containers, I know some people have trouble peeling oranges but first time I saw that I said you’ve got to me kidding me.\n\nA produce worker was behind me and said...*Thats exactly what I said to my boss when he asked me to do that*",
                    "score": 9,
                    "author": "ConcealedPsychosis",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Pretty sure this is so you can peel it and eat it on the go and then put the peel in the bag and tie it up to throw away later. If there is not a trash can around or in the car you don’t want to throw it on the ground, someone might slip....",
                    "score": 6,
                    "author": "geraldwhite",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They’re kind like Pepperidge Farm bread. That shit is fancy. It’s wrapped twice. You open it, and it still ain’t open.",
                    "score": 6,
                    "author": "kayelem87",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This man peels..",
                    "score": 3,
                    "author": "MoodooScavenger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If only bananas had something on them that would protect the fruit...",
            "score": 1517,
            "author": "Acidic_White_Girl",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 606,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry to be a killjoy but apparently it takes two years to fully biodegrade",
                            "score": 178,
                            "author": "Humphiee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 214,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I’m pretty sure we should just genetically mutate bananas so that they just grow into plastic bags... easier to dispose of and better for the environment",
                                            "score": 126,
                                            "author": "Humphiee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bro, I got a killer idea....\n\nWhy don't we modify human to eat plastic? No more world hunger man! BIG BRAIN",
                                                    "score": 13,
                                                    "author": "ButtLusting",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This is the pinnacle of human waste and efficiency. Having plants that pollute themselves all on their own. It's beautiful.",
                                                    "score": 6,
                                                    "author": "mohammedibnakar"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But plastic takes thousands of years to degrade, so it's like a thousand times better, right?",
                                            "score": 22,
                                            "author": "inblacksuits",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 35,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There’s been studies about the isolation of turtles who don’t have plastic necklaces. They are bullied because their family lacks resources... Look it up",
                                                            "score": 15,
                                                            "author": "Humphiee",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We should figure out something that takes a million years to degrade, then it will be a million times better!",
                                                    "score": 3,
                                                    "author": "mohammedibnakar"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Even if that was true (it's not), that's still a lot better then the hundreds of years it will take that wrapper to fully degrade.  Also, as that peel is breaking down, it releases nutrients into the soil around it encouraging the growth of other life.  Plastic on the other hand will literally release poison into the surrounding soil as it decomposes.\n\nSo I mentioned that the 2 year thing isn't true.  The only conditions that could be true, is if the banana peel was left in some type of sanitized condition (ie, on a shelf, buried in hot sand, etc).  Burying it in soil, it will absolutely decompose a lot faster then that.  Ask anybody who put them in compost.",
                                    "score": 73,
                                    "author": "Piper2000ca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you chuck a banana peel into the woods, it's possible for part of it to still be recognizable 2 years later. The same is true of leaves - if you go digging in the top layers, you basically find a mulch of leaves and other organic matter that's more and more decomposed, but some bits can still be identified. That's okay, there's nothing wrong with it. \n\nIf you took a scoop of it and gave it a good shake, most of it would fall apart. There's not much left there. But, depending on your definition, the banana peel would still be \"there\" for a long time. \n\nThe same is true of many things. There's the issue of poop at campsites - when buried, it doesn't always decompose the way we think it should, and so it can still be there, looking and smelling pretty much the same, 2 years later. But that doesn't mean that plants and bugs can't use it the way they'd use soil otherwise.",
                                            "score": 20,
                                            "author": "VoilaVoilaWashington",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've been hiking in areas that make you poop in a bag and carry it out with you. It's high altitude and dry, and if you just poop in between some rocks it will just kinda dry out and stay there forever. So you need to bring it back down with you.",
                                                    "score": 11,
                                                    "author": "nalc",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That's why you lay a fresh turd across that metal grill thingy many campgrounds provide in your fire pit. Send the log right back to hell!",
                                                    "score": 8,
                                                    "author": "bigheyzeus"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a gardener, I can personally assure you it does not take two years for a banana peel to biodegrade",
                                    "score": 42,
                                    "author": "svartblomma",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Not killing my joy at all. Anything that biodegrades in a couple of years isn't an issue for the planet. Even if it isn't perfect.",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Not like bananas are used in compost or anything.",
                                    "score": 20,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Two years in an anaerobic landfill, but just about a week in a proper compost. The problem is the system, not the peel.",
                                    "score": 21,
                                    "author": "SingleLensReflex"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What a fresh new comment that I totally didn’t expect to be right here at the top.",
                    "score": 77,
                    "author": "chappersyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Usually followed by your comment then this one",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like putting on two condoms. Must have picked them up in the sti aisle.",
                    "score": 39,
                    "author": "Bdag"
                },
                {
                    "level": 1,
                    "comment": "That’s the whole point of this post.",
                    "score": 16,
                    "author": "2010_12_24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah and someone always has to use this comment every single time this kind of post comes up",
                            "score": 20,
                            "author": "sonnyjbiskit"
                        },
                        {
                            "level": 2,
                            "comment": "Happy cake day",
                            "score": 2,
                            "author": "Supplize"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The ones at my supermarket don't. They only have this shitty wrapper that always turns brown and disgusting after a few days.",
                    "score": 4,
                    "author": "LvS",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If people are worried about pollution: \n\nThat looks like cellophane which is biodegradable \n\nIf it’s plastic it’s not cool",
                    "score": 2,
                    "author": "Christmas-Pickle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bananas actually go bad faster when enclosed in plastic.\n\nEdit: okay so I actually looked it up. Bananas produce a gas that helps ripen it. So, when it is enclosed in a bag of some sorts, the gas gets trapped, the concentration gets really high and the banana ripens fast. BUT to produce this gas, the banana needs oxygen. So, if the bag is absolutely airtight, it's not going to ripe quickly at all. If this is the case, it's actually a decent design.",
            "score": 1331,
            "author": "claymountain",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 407,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem isn't the gas in the bag. It's the gas that bananas emit (ethylene IIRC) which causes faster ripening and then spoilage.",
                            "score": 231,
                            "author": "hexafraction",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This *could be* an example of randomly idiotic packaging as OP implies, but it might also be that the packaging is specifically to trap that gas. If these bananas are shipped green in bunches and then packaged individually in these bags, it may drastically speed the ripening without the use of artificial sources of ethylene gas (as is often used).",
                                    "score": 112,
                                    "author": "Tyler_Zoro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I worked in produce for 6 years. Bananas come in a 40 lb ventilated box (from Chiquita or Dole). Sometimes they'll come in wrapped differently to trap as much of the gas as possible, but there still needs to be some ventilation (and when they arrive you still need to pull the top off and pull the plastic back of every single case), because then you might end up with green bananas with brown spots. Either way, the produce department controls the ripeness of the bananas. You can go from mostly green bananas to what you see in OP's photo in 2 days by simply not arranging the cases on the pallet correctly. \n\nSo wrapping them individually in plastic is idiotic.",
                                            "score": 101,
                                            "author": "LordKwik",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also work in produce, and can confirm this. We have to take every box off the pallet and open them up. Peel the plastic back, then stack them a specific way for proper air flow.",
                                                    "score": 41,
                                                    "author": "BureaucratDog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I work in a different department of a grocery store. Thank you for explaining why the produce dudes are always leaving an obstacle course of fuckin banana pallets on the dock, lmao",
                                                            "score": 40,
                                                            "author": "thinginthetub",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Currently in produce, can confirm lol. So much fun removing lids and unwrapping the plastic on 25 - 40lb boxes daily /s\n\nAnd you're very right, you can end up with green/gray bananas if you open them up too early or end up with spots if you leave them closed too long.",
                                                    "score": 13,
                                                    "author": "Wado444",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "God I'm so happy I work at a store these days where a whole pallet will be gone every day. \n\nDon't have to worry too much about the airflow. Just stack em on the sales floor, pop the top flaps off, and use the plastic inside to keep the flaps from expanding out. And since they're Del Monte bananas there's no stupid god damn plastic sheets on the inside to wrestle out. \n\nI don't miss removing the lids, and plastic, and carefully placing forty pounds of bananas back into the upside down lid. Godspeed produce brother.",
                                                            "score": 5,
                                                            "author": "radically_unoriginal",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bananas don't produce very much ethylene. Apples produce a ton. If you store apples and bananas together the bananas will ripen much faster.",
                                    "score": 14,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ethylene is correct. Ethylene is directly involved in senescence and ripeness among a slew of other plant processes. Packaging them in this way would cause them to ripen more quickly. Source: PhD in Plant Pathology",
                                    "score": 7,
                                    "author": "cleveland_14",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Like lettuce is\n\nYou can buy lettuce in a nitrogen filled bag?",
                            "score": 5,
                            "author": "doublemp",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "depends on the plastic. \n\n\nThere is plastic engineered specifically to allow ethylene out (which is usually the gas that causes fruit to rot), and or it can be filled with an inert gas to reduce spoilage rate.\n\nThat's actually one of the paradoxes of plastic - plastic wrap can dramatically reduce food spoilage rates/times, but then you're left with plastic wrap.",
                    "score": 12,
                    "author": "sir_sri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To avoid pregnancy I assume",
            "score": 1180,
            "author": "Johnnadawearsglasses",
            "replies": [
                {
                    "level": 1,
                    "comment": "99.7% guaranteed.",
                    "score": 124,
                    "author": "crueltyFreeIndia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "60% of the time, every time.",
                            "score": 40,
                            "author": "Sloppy1sts",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get this",
                    "score": 38,
                    "author": "Element-47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sex ed?",
                            "score": 28,
                            "author": "SanguineOpulentum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "sexy ad",
                                    "score": 14,
                                    "author": "crueltyFreeIndia",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No he’s asking Ed for some sex.",
                                            "score": 16,
                                            "author": "mada447",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sexy Ed",
                                                    "score": 8,
                                                    "author": "DirtyBendavitz"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Fair, but I think everyone else probably does too",
                            "score": 6,
                            "author": "superking2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I don't",
                            "score": 5,
                            "author": "13578mason"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The japanese people like that",
            "score": 579,
            "author": "Mradvock",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! Why do Japanese people love individually wrapping things in plastic? I saw this everywhere when I visited. Saw apples individually wrapped, it was one “cultural” difference that really confused me.",
                    "score": 441,
                    "author": "applxia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 494,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for your comment it was the only one that actually explained why Japan wraps everything",
                                    "score": 129,
                                    "author": "dr_cereal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "More good background:\nhttps://www.vice.com/en_us/article/xd573w/japans-excessive-packaging-fetish-299",
                                            "score": 4,
                                            "author": "SirPizzaTheThird"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't think that's even it.  The Japanese are notoriously clean people and germaphobic.  Wrapping everything ensures that it remains \"uncontaminated.\"",
                                            "score": 4,
                                            "author": "Chaseccentric"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Japanese people also have slippers to wear in the bathroom and only in the bathroom so they like their things clean so this might be a reason",
                                            "score": 3,
                                            "author": "Xiashia"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is taken to an extreme with melons! Each melon is grown on its own plant (1 melon per plant) and is hand rubbed daily or something ridiculous, then it is harvested and wrapped in paper, put into a hand carved wooden box and sold for hundreds of dollars (USD equivalent), if not thousands of dollars.\n\nThe whole point of this is to show that the melon had received uncompromised care and attention every step of the way, and its presentation as a gift reflects the gift-giver's intentions. Absolutely insane that a $5 melon can go for 100x in Japan, if it was well-cared for and has a perfect shape and texture.",
                                    "score": 46,
                                    "author": "Gorgenapper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "not all melons, there is basically fruit you eat (normal prices and such) and gift fruit (perfect fruit basically, in shape, colour, blemishes etc), the gift fruit is very expensive and i guess is more decorative in the same way flowers are, though i'm not certain on that last bit.\n\ni'd hope it's eaten, and because so much care has been taken to make sure it looks good and we all know that good looking fruit tastes as bad as any fruit a lot of the time... \n\nbasically the best fruit of each produce is put into the \"we should sell this at 400x markup because it is ideal and can be used as a gift\".",
                                            "score": 39,
                                            "author": "Icyrow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah sorry, I didn't mean all melons. I just saw that one episode / video where they go all out to ensure gift melons are as perfect as possible. I went out to Walmart and bought like a $3 melon and ate the whole thing afterwards lol.",
                                                    "score": 5,
                                                    "author": "Gorgenapper",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you! I always thought it had something to do with presentation but I wasn’t really sure. And hopefully the biodegradable plastic becomes a norm because I was pretty worried about the impact all that plastic had.",
                                    "score": 28,
                                    "author": "applxia",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The best thing to do is to just not make the plastic in the first place – reduce, reuse, recycle in that order. We shouldn't have to wait an undetermined amount of years to wait for biodegradable packaging to be mass produced when a simpler solution is already possible.",
                                            "score": 4,
                                            "author": "jcling"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Even if the plastic is biodegradable, there is still energy and waste involved the production of it.",
                                    "score": 13,
                                    "author": "tucktuckgoose"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; The government is trying to introduce a biodegradable plastic to solve the waste problem, but it will be a while before it becomes the norm.\n\nLike every other country.\n\nSome people in this thread are kinda acting too highly. I guarantee most people here have some silly time of waste going in their own house right now. I know I do even tho I recycle.\n\nShit takes time to get used to. Some countries aren't even in the Paris deal anymore.",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; I guarantee most people here have some silly time of waste going in their own house\n\nChewing gum is insane.. plastic wrap around the box of individual packs.  Plastic wrap around each individual pack.  Each piece of gun individually wrapped.  And the gum itself is just plastic and is eventually throw away!",
                                            "score": 7,
                                            "author": "randomusername3000",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's a bandaid solution. Fix the root cause which appears to be education around the environment and single use plastic.",
                                    "score": 3,
                                    "author": "theAnticrombie",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They have some expensive apples there that they give as gifts - worth up to $50 USD. A little more protection would be warranted for them, but I don’t know about every regular apple. I think it’s largely just to protect the aesthetics and avoid bruising or discoloration.",
                            "score": 58,
                            "author": "Blujltsu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have fancy apples in the states too that you can drop hundreds on. \n\nIt's not about the apples. It's a cultural thing. Japan loves to plastic weap everything.",
                                    "score": 45,
                                    "author": "givingin209",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "well there isn’t a better material like plastic, it sucks it’s not environment friendly.",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 9,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They do this with the cheapest fruit and meat under ¥500 as well so it’s not to do with price",
                                    "score": 23,
                                    "author": "duncaroooo"
                                },
                                {
                                    "level": 3,
                                    "comment": "I have had snacks in Japan that were in 3 levels of plastic bags. A big all containing bag, then smaller bags that hold like 6 individually wrapped pieces each. \n\nIf you go to a slightly better than 7-11 place like Aeon to get a to-go bento it will be in a plastic box, which itself is saran wrapped tightly, then they put it in a plastic bag with an ice pack that is a massive plastic thing. The crazy part is if you eat on the go you end up with so much garbage yet there's no place for garbage unless you're on the bullet train.",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was reading that people dont really eat on the go in Japan and that's why there's no trash cans or litter anywhere. That was on reddit though so dont go spouting that off as fact lol",
                                            "score": 5,
                                            "author": "mlem64",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe that’s why the unique mc in anime is always running with bread in their mouth",
                                                    "score": 7,
                                                    "author": "ChipChipington"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ah yes, destroying our planet so our food looks nicer for the 10 seconds we spend looking at it.",
                                    "score": 12,
                                    "author": "Maloonyy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Even their normal fruits are wild expensive, 2 regular ass Fuji apples in a 7-11 can be like ¥1000\n\nApparently from talking to people there it's because they won't sell fruit with ANY slight defects, everything has to be absolutely perfect so it ends up being stupid expensive",
                                    "score": 4,
                                    "author": "SnarkDolphin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Former Tokyo resident here. My local market sold individual raw eggs in a fancy plastic shell. That always struck me as the pièce de résistance of human idiocy.",
                    "score": 200,
                    "author": "TheMonksAndThePunks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;My local market sold individual raw eggs in a fancy plastic shell. That always struck me as the pièce de résistance of human idiocy.\n\nAre they supposed to just put an individual egg in their pocket or put it in a bag with other grocies and then deal with a broken egg when they get home?",
                            "score": 44,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 51,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"I too, like to live dangerously.\"",
                                            "score": 6,
                                            "author": "wittyusernamefailed"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They’re ready-to-eat hard boiled deshelled eggs.",
                                            "score": 4,
                                            "author": "hybroid",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sounds like it might be for rice bowls/convenience store meals that they sell in the store.\n\nIt's pretty common to crack a raw egg over rice and sauce in Japan.",
                                            "score": 30,
                                            "author": "Josvan135"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A 10 pack is about $1.50 USD.",
                                            "score": 6,
                                            "author": "Avedas"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[Can I offer you an egg in this trying time?](https://tenor.com/view/offer-nice-egg-tryin-time-danny-devito-gif-5352739)",
                                    "score": 8,
                                    "author": "nalc"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Those eggs are most likely hard/soft boiled and meant for you to bring somewhere and eaten as a snack. Conbini sell them, too.",
                            "score": 3,
                            "author": "emmastoneftw"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So I get shit here for using a non energy efficient light bulb while these mfs over there wrap their bananas?",
                    "score": 15,
                    "author": "CopeAfterCope",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah fuck the earth bro",
            "score": 176,
            "author": "rambleon4ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah i think that’s gonna eat it",
                    "score": 10,
                    "author": "aaronmohney43"
                },
                {
                    "level": 1,
                    "comment": "It always makes me extra mad because I'm from India and I've never ever seen such thing wrapped in plastic bags. Moreover we don't have the culture of take-away food, so our consumption of plastic per capital is very very low as compared to that in USA. We lead a very minimalisitic lifestyle, buy less than 10 pair of clothing a year and use public transport a lot. \n\nAnd then people on internet accuse India for so much population and Indians for ruining the world. It's infuriating.",
                    "score": 6,
                    "author": "UserameChecksOut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think its more the factories and stuff, the smog at Delhi is a good example",
                            "score": 44,
                            "author": "GenGen42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The factories owned by western companies who sell goods to western countries",
                                    "score": 8,
                                    "author": "gcruzatto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe so, but it is still in india. If eastern governments had better regulations and stood up to corporations this wouldnt be the case.",
                                            "score": 3,
                                            "author": "GenGen42"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Because India pollutes a lot, just in different ways.",
                            "score": 36,
                            "author": "DaBosch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For CO2 emissions, you're right.",
                                            "score": 3,
                                            "author": "DaBosch",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Plastic is not the only form of pollution lmao. People only think so because corporations enjoy putting the blame on consumers instead of themselves.",
                            "score": 13,
                            "author": "NowThatsWhatItsAbout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bingo. It's counterproductive but works in the favor of corporations. Encourage people to shame each other for the minor conveniences they enjoy while contributing 100,000 times worse to climate change and pollution. The Republicans love it. \n\nGreta Thunberg sails across the Atlantic on a Yacht and the conservatives and corporations use it to suggest that climate change activists think that we should never use airplanes ever again. That's of course ludicrous, but they either don't know or don't care.",
                                    "score": 7,
                                    "author": "Sunryzen"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "https://en.wikipedia.org/wiki/Water_pollution_in_India\n\nIndia is basically dumping sewage in their rivers.\n\nEven though it's stupid to wrap bananas in plastic, if this is actually in Japan, as long as the plastic is thrown away in the trash it will be fine. As far as I know japan isn't dumping their garbage into the ocean. The big problem is when countries don't have a developed waste management system, people just throw their trash wherever.",
                            "score": 14,
                            "author": "TRUMPOTUS"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "No matter what ur country manages to pollute  it anyway",
                            "score": 5,
                            "author": "hlagex",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "We definitely use too much plastic in the US, but I've never seen wrapped bananas, either.",
                            "score": 3,
                            "author": "Sloppy1sts"
                        },
                        {
                            "level": 2,
                            "comment": "Lol, India is a large polluter dude.",
                            "score": 3,
                            "author": "thedeuce545"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happend to the one on the right?",
            "score": 137,
            "author": "GalaxyWar3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Failure",
                    "score": 154,
                    "author": "KoldunMaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jokes on you, it will now be duct taped to a wall and sold for $100000000000",
                            "score": 44,
                            "author": "RajaRajaC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then eaten from said wall",
                                    "score": 8,
                                    "author": "crystalmerchant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "With the plastic on it",
                                            "score": 5,
                                            "author": "lonely_crona"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey you don't need to call me out like that",
                            "score": 3,
                            "author": "DrSheldonLCooperPhD"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's just racing stripes. It's obviously a super fast banana. It'll go through you in record time.\n\nAlternatively you're seeing a super rare split second image of a batman banana as it's morphing into its dark uniform. If you'd seen the video of this event you'd hear a tiny voice singing; bananana nana nana, bananana nana nana, Batnana!! While the morphing occurred.",
                    "score": 16,
                    "author": "Odin_se"
                },
                {
                    "level": 1,
                    "comment": "They didn’t get it protected in plastic quickly enough.",
                    "score": 11,
                    "author": "2010_12_24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Brown bananas are safe to eat",
                            "score": 8,
                            "author": "N_Echo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nothing. It literally looks fine.\n\n Do you never eat bananas with a little bit of brown on the peel?",
                    "score": 10,
                    "author": "IAmVeryFascist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It concerns me how many people think the right banana is not good to eat",
                            "score": 8,
                            "author": "supersnorkel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How much does a banana cost? $10?",
            "score": 122,
            "author": "deepspacenice",
            "replies": [
                {
                    "level": 1,
                    "comment": "well a week or two ago i think 120k....but maybe that was the cost of the duct tape.",
                    "score": 36,
                    "author": "heretopisspeopleofff"
                },
                {
                    "level": 1,
                    "comment": "here's some money, go see a star war",
                    "score": 32,
                    "author": "Stanlot"
                },
                {
                    "level": 1,
                    "comment": "I got the reference Lucille",
                    "score": 10,
                    "author": "TechnicalsMatt"
                },
                {
                    "level": 1,
                    "comment": "You’ve never actually set foot in a supermarket have you?",
                    "score": 7,
                    "author": "jockeyed"
                },
                {
                    "level": 1,
                    "comment": "Who’s your banana guy? I’m overpaying...",
                    "score": 4,
                    "author": "BraveT0ast3r"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mother works in cargo. Bananas are sealed in plastic to prevent chemicals or other insects from spreading to or from the peels. Plus it's useful as they mature well in plastic without additional chemicals.",
            "score": 40,
            "author": "Beexn",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Guess it depends on what you call useful. In the states we let bananas mature naturally so they last longer. In plastic they’re probably only perfectly ripe for 10 hours before you have food waste *and* plastic that can’t easily be recycled.",
                    "score": 10,
                    "author": "bagofrainbows",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Nah sorry you're not gonna convince me individually plastic wrapped bananas makes any kind of sense",
                    "score": 5,
                    "author": "eorld"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The three of them should come in a cardboard box, stuffed with bubble wrap. You can never too cautious.",
            "score": 30,
            "author": "DumbYokel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your banana from Amazon has arrived.",
                    "score": 19,
                    "author": "FlowMang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They do that at the 7 11 in Thailand FFS",
            "score": 20,
            "author": "WinterDustDevil",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You should post this on assholededign tbh.",
            "score": 12,
            "author": "skyxee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope not, this gets posted there every day.",
                    "score": 4,
                    "author": "bman_7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have seen garlic flavored coke, which is way dumber",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You shut your whore mouth",
                    "score": 18,
                    "author": "mk2vr6t",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "welcome to Japan",
            "score": 6,
            "author": "saya_doge",
            "replies": []
        },
        {
            "level": 0,
            "comment": "*hold stick near centre of its length.*\n\n*moisten pointed end in mouth.*\n\n*insert in tooth space, blunt end next to gum.*\n\n*use gentle in-out motion.*",
            "score": 6,
            "author": "av_alan_che",
            "replies": [
                {
                    "level": 1,
                    "comment": "*no longer a civilization in which I could live and stay sane*",
                    "score": 2,
                    "author": "GalaxiaGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A little overly dramatic. Not the pinnacle by a mile.",
            "score": 6,
            "author": "ISTYDTC"
        },
        {
            "level": 0,
            "comment": "One banana wrapped in plastic, carried home in a plastic bag. The put the bag in a plastic cooler before putting it in the fridge.\n\nThat's a well protected banana.",
            "score": 6,
            "author": "IronGin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "To prevent spiders getting in? So stupid.",
            "score": 3,
            "author": "Mushmare",
            "replies": [
                {
                    "level": 1,
                    "comment": "you're supposed to chew on them",
                    "score": 6,
                    "author": "ardaduck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dont know about bananas, but cucumbers last way longer when they are covered in plastic.",
            "score": 3,
            "author": "Awesomefolks",
            "replies": []
        },
        {
            "level": 0,
            "comment": "guy: hey.\n\nguy2: wuh?\n\nguy: lets fuck the planet\n\nguy2: aight, *does this atrocitie.*",
            "score": 5,
            "author": "carrotsoupek"
        },
        {
            "level": 0,
            "comment": "This aged well",
            "score": 4,
            "author": "talt123"
        },
        {
            "level": 0,
            "comment": "r/egregiouspackaging",
            "score": 3,
            "author": "yeangyc"
        },
        {
            "level": 0,
            "comment": "Individually wrap them in brown paper so they don’t go brown quick",
            "score": 3,
            "author": "StrangelyBeige"
        },
        {
            "level": 0,
            "comment": "Should I wash them after opening?",
            "score": 2,
            "author": "MattalliSI",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Banana condoms",
            "score": 2,
            "author": "TerrifyingTacos"
        }
    ]
}