{
    "id": "104ksyc",
    "score": 52,
    "title": "My parents aren't coming to graduation: advice",
    "author": "Confidenceisaid",
    "date": 1672979678.0,
    "url": "https://www.reddit.com/r/stanford/comments/104ksyc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm trying to decide how I feel about this. My parents and I talked about it casually today and they didn't feel like it made sense for them to go to my graduation. They would have to fly literally across the country, potential book an expensive hotel, and all to watch me walk across a stage(?) field(?) I don't really know what graduation entails. My dad has health problems so flights suck for him. \n\nWhen we talked about it, I tried to stay casual and not influence their decision, because I don't want my dad to do something that's going to really suck for him and his health just because I asked. And that's the thing- if I asked, and said it was really important to me, I know they would do it. However, I feel weird telling them it's important to me after earlier seeming like it would be okay if they didn't go, and I also understand their perspective that all I'm doing is walking across grass. \n\nAt the same time, I feel really upset at the idea of no one coming to my graduation. I don't feel like I have a ton of friends on campus, and I know it's going to feel awful being so alone for what is supposed to be a celebration. Or I could just not go. \n\n&amp;#x200B;\n\nDoes anyone have any thoughts on this? Should I ask them to come? Should I go to graduation? If I do, what can I do to make it feel special and less sad? Anyone else doing graduation solo?",
    "comments": [
        {
            "level": 0,
            "comment": "I definitely didn’t think it would matter to me. But when the weekend comes and EVERYONES parents arrive, and you feel a little thrill when you’re finally done with everything, it will be sad to not have them there. You should tell them how you feel",
            "score": 52,
            "author": "brownie61213",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can understand feeling sad that your family is not there but it sounds like it is a strain both financially and physically for OPs parents to be there. I think OP needs to accept this and move past it and find other ways to celebrate graduation. \n\nSpend the day with a close friend and do all the picture taking, etc. with them. OP may even have a friend who's parents would be understanding of OPs situation and invite OP to celebrate with them? (e.g., \"hey mom and dad, my friend Confidenceissaid's parents are not able to be at graduation, do you think he/she can go to dinner with us?\"  if my kid asked me to do that I'd say yes! )\n\nWhen OP gets home do something special with family -- with the $ not spent on travel, OPs family could spend even a small portion of that on a nice dinner out. Not to mention the suggestions from u/mrburns7979",
                    "score": 8,
                    "author": "heinzenfeinzen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When u graduating bro I’ll come to ur graduation",
            "score": 42,
            "author": "penake",
            "replies": [
                {
                    "level": 1,
                    "comment": "^i second this will 100% come cheer for you",
                    "score": 3,
                    "author": "failedxgravity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bro shit made me sad imma fly from another country for u my G",
                            "score": 3,
                            "author": "Emergency_Alarm3457"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I see two separate decisions here. \n\n     \n1) Should you go to graduation? I'd recommend Yes. Most people who attend really enjoy the celebratory atmosphere, and every friend I knew who could have attended but chose not to later said they regretted it. \n\n      \n2) Should your parents go to graduation? Now's the time to be honest with your parents, it's possible that they don't realize that this is a big deal for you. If your dad has health issues and that ultimately precludes your parents from coming, how about having them cheer you on when watching the livestream? That's what some of my family members with health issues did, it was very nice to know they could see me walk onto the field live even if they were bedridden far away.\n\n      \n\nBonus: underlying feelings of loneliness. It's absolutely valid to be alone and have alone time (we call it \"unhealthy codependence\" otherwise). It's also good to take a few minutes when you're alone and reflect on why you're feeling lonely, plus what you're going to do about it. You may feel like you don't \"have a ton of friends on campus\", but few do, and I'm certain your number's higher than zero. Send them a message, say hi to other people you recognize when you see them around, go to graduation events and meet people old and new, wave at someone when you walk into class. Think about what you want, and take small steps towards that future.",
            "score": 19,
            "author": "StanfordBro"
        },
        {
            "level": 0,
            "comment": "Honestly, different opinion: ask at least your mom to come. If health issues prevent your dad from flying, that’s one thing, but if you have a positive relationship with your parents and want them there, they should make the effort. In fact, I think it kind of stinks that they put you in this position at all.\n\nYes, graduations as ceremony are a bit much, but as someone who mid-Covid didn’t celebrate getting my masters degree, I really regret it; you need to acknowledge all the hard work you’ve put in! \n\nGood luck and good vibes!",
            "score": 13,
            "author": "PitLuna"
        },
        {
            "level": 0,
            "comment": "Graduation was very anticlimactic for me. Everyone goes to the main ceremony and department ceremonies, but everyone's families are also there and and you quickly get split from your friends after the main ceremony.\n\nMy parents and sister attended both ceremonies, but it was all very low key and a bit surreal. I'm not sure how I would have processed if they decided not to attend.\n\nMake sure to say all your goodbyes before everyone splits! It's so easy to lose track of people because everyone is scrambling to move out of dorms.",
            "score": 12,
            "author": "ExaminationFancy"
        },
        {
            "level": 0,
            "comment": "Bring your cap &amp; gown home and have your parent(s) graduate YOU and have a nice dinner party together to celebrate. Play Elgars pomp &amp; circumstance, set up folding chairs, the whole 9 yards. Take lots of photos. \n\nIt doesn’t have to be in California to be your celebration with family. \n\nDo plan something for the day-of graduation at Stanford. Others need distraction, too. Keep an eye out for invites.",
            "score": 7,
            "author": "mrburns7979"
        },
        {
            "level": 0,
            "comment": "You can feel how you feel, but I would've been happier skipping commencement. I guess there are some nice things about the ceremony but overall it's very anticlimactic. The graduation in the department felt better but my class was very small, if you're in CS or something then that would be barely better then commencement.",
            "score": 8,
            "author": "stupac2"
        },
        {
            "level": 0,
            "comment": "I would try to find an alternative way to celebrate with your family. Maybe the money they don’t spend on travel and accommodations can be better spent in another way to celebrate with them after (if you’re able to go home to visit). Maybe a small graduation party with family and close friends at home?). I can’t imagine they aren’t proud of you, but it sounds like there are competing concerns. I would, however, express that you will be sad that they are not there while expressing the equal understanding of the difficulties of travel for your family. You need to reignite the expectation that you had of this moment and that you imagined they would be there for this accomplishment. It’s okay to acknowledge that it sucks that they can’t be. Be honest and gentle and this doesn’t have to be a cause for contention with your parents. Congratulations and good luck!",
            "score": 6,
            "author": "WorryElectronic7117"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can take a $9 Udemy course to get a certificate you can plug into your LinkedIn profile, but there are zero Stanford degrees which can do that.",
                    "score": -10,
                    "author": "jsalsman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "saying that graduation ceremonies are overrated is not the same as saying that a degree from Stanford is not valuable",
                            "score": 9,
                            "author": "heinzenfeinzen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would look into seeing if you qualify for the opportunity fund as they can help cover up to $1,000 in family expenses for graduation, and can help make the cost less of a factor into the decision you and your family will make.",
            "score": 4,
            "author": "ericmnts"
        },
        {
            "level": 0,
            "comment": "First off, I'm so sorry that your parents aren't coming. That really hurts and after all the work you've put in. Whatever you decide to attend or not to attend is a good decision for yourself. If there are friends that can adopt you for the day and celebrate with you, that would be wonderful. DM your address and I would love to send you a card. \n\nFor me, my parents didn't come to my high school or college graduation. Lots of reasons but it still hurt really bad on that day and for a long time afterwards. I didn't attend my college graduation and only went to the basics for high school. Friends really helped soften the blow but most were focused on their own family celebrations. \n\nI did end up going to grad school and that was a long process so I wanted them at my defense. I paid for plane tickets, hotels and rental car. It was fun to hang with my siblings. My parents were, lets call it, not grateful. \n\nI don't regret either decision. I hope this gives you some perspective.",
            "score": 3,
            "author": "MaeEquivalentMood34"
        },
        {
            "level": 0,
            "comment": "Graduation is overrated, just go have fun with your friends",
            "score": 4,
            "author": "wild_whiskey_western"
        },
        {
            "level": 0,
            "comment": "it'll be all right, recall that class of 2020 had virtual commencement",
            "score": 2,
            "author": "StackOwOFlow"
        },
        {
            "level": 0,
            "comment": "Don’t make them come. It’s in Cali so gonna be super expensive and this health",
            "score": 2,
            "author": "TheodoricusLacus"
        },
        {
            "level": 0,
            "comment": "Can your mom come without your dad?  Can you tell her you understand his health but you also really want them to be able to share this with you ?",
            "score": 2,
            "author": "Melissa_H_79"
        },
        {
            "level": 0,
            "comment": "First of all, congratulations!!! \n\nAlso, you seem like a really caring, loving person. That’s awesome.\n\nMy folks could not go to my college graduation and later my wedding because health, money, and worry about not fitting in. My most cherished photo is me doing a little craft with mom to celebrate. Every family is unique. There’s lots of ways to enjoy the moment.\n\nIf you do go — as people say here, there’s the big commencement in the stadium (don’t think anyone walks across the stage) and department events (more likely you’re name will be called). \n\nIf you hang out at the community centers, there are nice events there too!\n\nIf mom only, can someone hang out with dad while she’s gone? Old couples lean on each other a lot. \n\nMy two cents is the sense of closure might be good to have. Maybe leave your options open, hold the dates, and decide for sure later this spring.",
            "score": 1,
            "author": "PacSun56"
        },
        {
            "level": 0,
            "comment": "Could you ask a helpful cousin to come, too, to assist them? Traveling involves so many apps these days. I know my elderly family gets frustrated with everything on the phone and bad customer service. Your mom and dad may think they can’t rely on you as usual, because you’ll be busy.",
            "score": 1,
            "author": "Left-Indication9980"
        },
        {
            "level": 0,
            "comment": "I didn’t push my parents to come to mine and we both regretted it. Turn it into a family trip and go to Yosemite or something after.",
            "score": 1,
            "author": "CitizenCue"
        },
        {
            "level": 0,
            "comment": "Wear a body cam and stream it with them.",
            "score": 1,
            "author": "HelloNeighbore"
        },
        {
            "level": 0,
            "comment": "I go to Berkeley but I'm down to go💯",
            "score": 1,
            "author": "Daddy_nivek"
        },
        {
            "level": 0,
            "comment": "Hey I didn’t see anyone answer your question about what graduation entails, so I can give my experience which was at this point was a couple of years pre-Covid. \n\nThe morning will be mostly rolling with your friends to commencement, which is a long and pretty boring event itself (but the energy of being with friends is fun!). You’re just sitting in a chair down in a field the whole time and there’s your typical Stanford whacky costume shenanigans.  \n\nFrom there folks split off and head to their department graduations. If you don’t have any friends in your department, I could see this being a little lonely (especially if you have a smaller crew). Most people are connected with their family at this point. There, you’ll actually walk across the stage and do the whole thing. Then you’re free! \n\nYou’ve gotten great advice so far. If you think you’ll regret not asking them to come, don’t set yourself up for future disappointment! And definitely don’t skip all together. Grab some friends and make it fun, even if you’re third wheeling with their families a bit!",
            "score": 1,
            "author": "ganeshhh"
        },
        {
            "level": 0,
            "comment": "Talk about first world problems",
            "score": -3,
            "author": "AlternativeBrief7137"
        },
        {
            "level": 0,
            "comment": "Hey everyone!\n\nI'm a tutor who helps university students with their assignments, and I'm here to offer my services at a lower price while still delivering quality work on time. I have a team of experienced professionals who can handle all non-technical assignments, so if you're struggling with any type of homework, don't hesitate to reach out to us.\n\nI understand that many websites out there charge exorbitant fees for their services, but I'm here to offer an affordable alternative that won't break the bank. If you're looking for a tutor who can help you get the grades you deserve, then give me a try! I'm confident that you won't be disappointed with the results.\n\nTo prove the quality of our work, I'm offering the first assignment for free with a maximum of 5 pages. Simply send me a message on WhatsApp at +254742350570, and let's get started on improving your grades today!\n\nDon't struggle with your assignments any longer. With my team of professionals, you can get the help you need at a price you can afford. So why wait? Get in touch with me today and let's get started!",
            "score": -1,
            "author": "thesocrato"
        },
        {
            "level": 0,
            "comment": "Awhhhhhhhh. You should either ask for both of them to come or for your mom (or other parent) to come if its too hard for your dad. It’s a really big day, its not your wedding but its one of those moments like your wedding where you really want your family there. Literally everyone elses family will be there. Even if you’re just walking across a stage its a very symbolic and momentous moment. I think pretty much anyone would be deeply depressed if no one special showed up for this kind of big graduation ceremony. It meant a lot to me when my family came.",
            "score": 0,
            "author": "stardogstar"
        }
    ]
}