{
    "id": "10h7c2c",
    "score": 0,
    "title": "BS degrees without calculus requirements",
    "author": "HuBidenNavalny",
    "date": 1674246687.0,
    "url": "https://www.reddit.com/r/stanford/comments/10h7c2c",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everybody, incoming freshman here. I was looking at the Bulletin, and I was just curious if there were any BS degrees that doesn’t require taking Calculus / advanced mathematics to attain it. I saw HumBio didn’t, but was wondering if this was true for any other one. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "honestly kinda weird that there are BS degrees that dont require calc/math 20 series tbh\n\nand btw i wouldnt base a degree off of whether calc is required, obviously it can be a challenge but if you actually care about degree type (also sort of arbitrary) then why care about classes as well? most science degrees expect some calculus at a minimum because a lot of science is calculus",
            "score": 11,
            "author": "ch4nt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you — I put my interest as a political science major which is probably going to be my primary degree, but I was just curious (I heard specializing in a STEM field helps). From what I’ve seen the only options are like STS and HumBio, neither of which interest me. Appreciate the insight",
                    "score": 2,
                    "author": "HuBidenNavalny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most BS degrees without calculus (and linear algebra) would be \"BS\" in another way: physics without calculus? engineering without calculus? chemistry without calculus? It's absurd.\n\nMaybe it would help to understand *why* calculus is required for most BS degrees. It turns out that the best way to describe how things in the physical world change over time (atoms, fluids, heat, planets, chemical reactions, etc) is through *differential equations*, and differential equations are based on calculus. At the very start of physics, Newton's second law is a 2nd-order differential equation (acceleration is a 2nd derivative of position).   See also https://en.wikipedia.org/wiki/List_of_named_differential_equations. That the chemistry section of that page is short does not mean chemists have little use for differential equations, e.g., physical chemistry is the \"physics\" part of chemistry and it regularly needs differential equations from physics. \n\nAt the same time, a fair bit of traditional calculus courses can involve artificial examples that are not relevant to the way people outside the math department *use* calculus (e.g., a water tank shaped like a cone or something equally stupid). The Math 51 and 53 courses have been revamped, with the math department writing their own course textbooks that emphasize genuine real world applications.  \n\nSince all but the simplest differential equations are solved by computer, not by hand, arguably some traditional skills related to solving differential equations are not important anymore (integrating factors?). This is partly why the UCLA Life Sciences department created their own calculus sequence that emphasizes applications of calculus (really, differential equations) in biological modeling with the help of computers to replace old pen-and-paper work. See https://www.lscore.ucla.edu/courses/#ls30A and https://www.edsurge.com/news/2023-01-17-ucla-life-sciences-revamped-how-it-teaches-math-is-it-an-example-others-should-follow.",
            "score": 3,
            "author": "leland-stanford-jr"
        },
        {
            "level": 0,
            "comment": "Take calculus at a community college and transfer the credits",
            "score": 2,
            "author": "777perfect"
        }
    ]
}