{
    "id": "11mm6db",
    "score": 5,
    "title": "Incoming Graduate Student Questions",
    "author": "JohnQPublicx",
    "date": 1678347614.0,
    "url": "https://www.reddit.com/r/stanford/comments/11mm6db",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I'm an international student (India). I recently accepted an offer of admission for a PhD from the anthropology department. I'll get there in September. I have a couple of questions about life in Stanford -\n\n1. **Housing**: Where do most grad students live? I've been in touch with a student from the department. They tell me that grad students who don't drive choose to stay on campus, and even those who drive find it convenient to stay on campus, at least for the first year.\n2. **Meals**: I went through the grad student meal plans from RnDE. What does a 25-meal block mean? Three meals for eight days plus a meal? At that rate, it comes up to nearly $2000 per quarter. That feels quite expensive! Or is this justified, given the cost of living in California?",
    "comments": [
        {
            "level": 0,
            "comment": "Housing - Did you read through all the information on the RD&amp;E site about grad housing? There are many options to choose from ranging from studio apartments to 2 bedroom to 4 bedroom and prices ranging from about $1300 per month to twice that amount.\n\nIt can get a little confusing with all the \"Escondido\" naming. The site is still set up for 2022-2023 but should be updated in the next few months.  \n[https://rde.stanford.edu/studenthousing/residences-single-graduates](https://rde.stanford.edu/studenthousing/residences-single-graduates)  \n\n\nMeals: You'll notice that all the grad housing is apartment living so you'll have a kitchen. As you already found out, buying all your food in a meal plan is expensive so you;ll probably want to learn how to cook at least some basic things if you don't know already.",
            "score": 3,
            "author": "heinzenfeinzen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! Yeah, it seems like most students choose to live on campus through accommodation made available by R&amp;D. The R&amp;D website was easy enough to follow. I was wondering, however, if students bother with Craigslist and so on. But from a cursory glance on Craigslist, it looks like R&amp;D's options are cheaper and hassle-free at least for the first year.\n\nGiven the expensive meal plan, I will definitely be cooking haha!",
                    "score": 2,
                    "author": "JohnQPublicx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you will find that the housing (on or off campus) that Stanford has for grad students will be cheaper than anything else you find because it is subsidized. If you want to live off campus, I'd recommend looking at the properties they have listed under the off campus section of the RDE housing site.",
                            "score": 2,
                            "author": "heinzenfeinzen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, I’m an incoming international student as well. It’s a great idea to set up Zoom calls with students and ask them all your specific questions. \n\nFor housing, a lot of people I talked to live in Escondido Village studios. Those are single housing studios. There are also shared apartments that are cheaper. A lot of detailed information on this can be found on the housing website. \n\nI haven’t personally asked anyone about the meal plans because I don’t plan to use one. I’ve been recommended by many people to buy my own groceries and make my own food. I’ve heard from one student that there’s an initiative she signed up for that provides basic food necessities for free as well. \n\nGood luck!",
            "score": 2,
            "author": "AccioDawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! Thanks for that. I've setup a few meeting as of now. But I thought it might be good idea to ask on this forum.\n\nI've been thinking about doing the same as far as housing is concern. If I have to spend a little extra, I'll spend it on making my housing situation as comfortable as I can. I think I'm past that point in my life where I'm comfortable sharing a home😅",
                    "score": 2,
                    "author": "JohnQPublicx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Since meals has been answered I will add more detail about housing. Most people who live on campus or off campus (Palo Alto) have a bike/skateboard/scooter, etc. for a 5-10 min commute. If you plan to have a pet in student housing, typically people choose for the studios, you will need a letter of accommodation from a doctor (not as hard as you think to get one but not straightforward), which is why some people with pets have to live off campus. If you want more life and activities since Palo Alto is kind of boring, some people choose to live in Redwood City or San Francisco where they take free Caltrain down, or live in Mountain View where you have to drive yourself.",
            "score": 2,
            "author": "bo_yangles"
        }
    ]
}