{
    "id": "11xrxld",
    "score": 3,
    "title": "Stanford MS EE Vs CMU MS ECE",
    "author": "aloo_bhujia_best",
    "date": 1679427741.0,
    "url": "https://www.reddit.com/r/stanford/comments/11xrxld",
    "media_urls": [],
    "other_urls": [],
    "postText": "Which program should I choose?\n\nCriteria:\n\n1. Prestige\n2. Job opportunities in Big Tech",
    "comments": [
        {
            "level": 0,
            "comment": "If you want to work for a hedge fund or in high frequency trading in NYC then CMU might have an edge but overall Stanford is the better choice for everything else.",
            "score": 10,
            "author": "RocketScient1st"
        },
        {
            "level": 0,
            "comment": "From a practical EE point of view, it's not going to matter that much.  They are in the same league.\n\nBut from an overall prestige perspective, Stanford wins.  The majority of Stanford departments/schools rank in the top 5, with most of the rest making at least the top 10, from business to law to medicine to engineering to the sciences to ... You get the point.  As a result, many more people will recognize the name Stanford compared to CMU.\n\nCMU is prestigious mostly for Engineering/CS.  Stanford is prestigious overall.  You will have to decide whether this is relevant to your career path (which you can't always predict).",
            "score": 3,
            "author": "fretit"
        },
        {
            "level": 0,
            "comment": "CMU is in Pittsburgh. Eom.",
            "score": 4,
            "author": "Idaho1964"
        },
        {
            "level": 0,
            "comment": "You should do Stanford unless you have a specific research interest that CMU is a better fit for. Stanford's name is more prestigious to the average tech worker plus you'll be right by all of the companies in Silicon Valley. This makes it super easy to do an internship during the summer since you don't need to move, plus you can stay in the area with your friends after graduation.",
            "score": 2,
            "author": "napkinsabc"
        },
        {
            "level": 0,
            "comment": "My kid was accepted to both as well.  No contest - Stanford",
            "score": 2,
            "author": "heinzenfeinzen",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s definitely not no contest without knowing what OP is interested in. CMU holds some #1s",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LOL. I actually graduated years ago from CMU -- nah. Stanford all the way.",
                            "score": 4,
                            "author": "heinzenfeinzen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s nice, but your experience isn’t a substitute for hard data.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it really depends on what you want to do. What area of EE are you interested in?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Having spent some time at both, the CS classes at CMU were significantly better taught and covered significantly more material in much more depth. It's an outright better educational experience, but for everything else Stanford wins hands down.",
            "score": 1,
            "author": "Konexian"
        }
    ]
}