{
    "id": "120xmh7",
    "score": 28,
    "title": "With the arrest of Stanford alum &amp; fugitive Do Kwon, the well publicized FTX fraud and SBFs family ties to the school, the conviction of drop out Elizabeth Holmes and Stanford Professor Stan Cohen why has Stanford, the professors, and alumni been involved in soo many frauds of the past decade?",
    "author": "kinged",
    "date": 1679690122.0,
    "url": "https://www.reddit.com/r/stanford/comments/120xmh7",
    "media_urls": [],
    "other_urls": [],
    "postText": "It seems that for the past decade a good majority of frauds uncovered have involved Stanford professors and grads, especially when it comes around securities laws and constant misrepresentations of their past research. It's evident this is a systemic issue at Stanford when even the schools Dean &amp; administration have similar allegations of academic dishonesty levied against them with Marc Tessier-Lavigne under investigation. Not to mention the very deep ties Joe Bankman has with the school and promoting FTX despite clear governance and ethical issues.\n\nFrom the outside it really seems Stanford is very emblematic of the issues of Silicon Valley when it comes around to misrepresenting past and current research for the sole purpose of publicity and to defraud investors.  The ethical &amp; moral compassat Stanford are VERY broken when these issues continue to occur and involve professors &amp; deans. It really says a lot when professors themselves are defrauding friends and family on false claims they found the cure for Huntington diseases despite the FDA banning the drug for maiming people. When the dean is also implicated for manipulating past research then how is anybody able to credibly view any research coming out of Stanford are be able to trust any Stanford grad when all the ones who come to mind have been found guilty of defrauding investors? \n\nThere is soo much misplaced attention put on environmental &amp; social issues when zero attention is put on corporate governanve. The administration needs to realize that without proper ethical corporate governance, and teaching students how to ethically grow, fundraiser, and promote a startup you will NEVER be able to address and environmental or social issues. Even if your grads found the cure for cancer or solved climate change this won't mean anything if the same grads also don't understand basic ethical corporate governance.\n\nThe worst thing about this is that the ones to suffer the most are current students. Because of FTX any VCs will not have the same impression as before and will have to spend considerable more effort researching the backgrounds of founders. Sequoia took a very big reputational hit for promoting SBF and especially his family ties to the school, they falsely believed that he was a genius because he graduated from Stanford but as it turns out he was very disillusioned and had no idea what he was doing. A VC can't just simply argue anymore that a founder is smart or a genius for simply being a Stanford grad, but I don't think that same caution is shown for Yale or Harvard grads. \n\nSo with this why does Stanford have this issue? Was this driven from Silicon Valley in causing flawed views around ethics?",
    "comments": [
        {
            "level": 0,
            "comment": "Bonfire of the Vanities pretty much sums it all up",
            "score": 8,
            "author": "heinzenfeinzen"
        },
        {
            "level": 0,
            "comment": "*A minor correction to your post: Sam Bankman-Fried is* ***not*** *an alum of Stanford. He graduated from MIT. However, you are correct that he does have familial ties to Stanford Law faculty (and Columbia University).*\n\nHere are some of my personal views on why Stanford alumni or affiliates have been frequently mentioned in recent news headlines:\n\n* **Stanford admits and attracts ambitious faculty and students:** some of these will achieved outsized success in their fields. Even if we assume the probability of successes that end up as fraudulent is uniform across all levels of talent, the sheer fact that Stanford students may reach positions of power and influence at higher rates than others indicates that there will be more high-profile fraud cases connected with them. You can observe a similar dynamic with Harvard Business School and scandals perpetuated by its alum (i.e., Jeff Skilling of Enron).\n* **Recent high-profile industries and sub-industries are ones that Stanford has deep connections with, making fraud cases more visible:** Emerging industries like crypto are both highly visible in media, as well as rooted in technological change. Thus, the sorts of people who achieve outsized successes in them are likely to come from backgrounds that are well-connected in technology. This includes schools like Stanford.\n* **Entrepreneurship treads a fine line between overhyping (to attract investors, employees and customers) versus outright lies:** The Bloomberg finance columnist Matt Levine had a great article about this that I can't immediately find right now, but it essentially points out that the nature of entrepreneurs is that they have to hawk and sell some vision in order to raise money, and by nature this creates more possibilities of deliberate fraud (i.e., Theranos).\n\nA number of Stanford professors (Rob Reich, Mehran Sahami, Jeremy Weinstein) wrote a book in late 2021 called *System Error: Where Big Tech Wrong Wrong and How We Can Reboot* discussing adjacent topics to this. The opening chapter describes a real-life Stanford student who, in his eagerness to build a venture-backed company, may also be unintentionally (or willfully ignoring) negative externalities his company imposes on society. That's worth a read.",
            "score": 38,
            "author": "racl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll take a read on that, I think I'm aware of that Matt Levine article as I follow his newsletter. He's by far the best journalist given his deep knowledge and unique perspectives on financial topics. \n\nI agree with your first point but do Harvard or other Ivey school alum get involved in as many scandals as Stanford? From the outside I perceive far more Stanford grads going on to start their own companies especially at much earlier ages with VC funding which I think results in very skewed perceptions of corporate ethics and governance. \n\nIdk if this is valid, but my impression would be Harvard grads don't have that same strong connection to VCs so much more end up in traditional high paying roles like working at a Bank or in PE or Consulting. \n\nEntrepeurship really is such a central factor and the point you make around an eager students ending up committing negative externalities. I wonder whether any of the subcultures in Silicon Valley factor into this as well. For example, effective altruism played a very public role in FTX, but does that also play a role in the example you gave of that Stanford Student? I can definitely see biases playing role if you have the belief that your company can save the world. Like the professor defrauding friends on claims he found the cure for Huntington disease, maybe the professor fully believed in these claims and figured his actions were okay if it resulted in its success. \n\nIt's interesting, at some point this bias may well turn into turning a blind eye. Overall I do think the school needs to allocate more time discussing proper corporate governance as I do think the strong connections to VCs and Start ups results in less focus of governance especially for mature companies as governance is not usually that formal for smaller companies.",
                    "score": 1,
                    "author": "kinged",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Harvard and Yale students like Henry Kissinger and Ron DeSantis prefer to harm society through more traditional roles :) Stanford is terrible but not uniquely so among prestigious schools",
                            "score": 4,
                            "author": "SpinyLemon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Harvard has its exceptions, such as Zuckerberg.",
                                    "score": 1,
                                    "author": "fretit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Idk if this is valid, but my impression would be Harvard grads don't have that same strong connection to VCs so much more end up in traditional high paying roles like working at a Bank or in PE or Consulting.\n\nThat's probably true.  A lot of VC-funded companies are in tech and Harvard Engineering/CS is in the same size or league as Stanford.\n\nBut if you are going to judge the overall ethics of a school by isolated examples, I present to you Mark Zuckerberg.",
                            "score": 1,
                            "author": "fretit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stanford is also responsible for Google, HP, JUUL, and hundreds of billions of dollars of other companies. They do big shit",
            "score": 27,
            "author": "PDWAMMO",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of these is not like the others 🤣",
                    "score": 44,
                    "author": "999999andsoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean you wouldn’t make it if u ain’t using it",
                            "score": 2,
                            "author": "FinalPush",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you referring to HP being from the older SV era or are you referring to Google being at a whole different scale?",
                                    "score": 1,
                                    "author": "fretit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What? Neither. I was referring to juul",
                                            "score": 1,
                                            "author": "FinalPush",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I did not know what JUUL was :)",
                                                    "score": 1,
                                                    "author": "fretit"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "and yahoo, openai, y combinator, nvidia...",
                    "score": 7,
                    "author": "AdSubstantial2329"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because ambition is a prerequisite to Toxic ambition",
            "score": 7,
            "author": "StackOwOFlow"
        },
        {
            "level": 0,
            "comment": "Silicon Valley is full of fake-it-til-you-make it culture, including success stories it draws inspiration from. The most visible recipes for success in the post-WWII era emerged with Steve Jobs and Bill Gates carving out a path to billionaire status for sweaty nerds previously reserved for suited bankers and military contractors. Jobs for stealing Xerox's GUI, Gates/Ballmer for selling IBM an OS (DOS) that they didn't make and eventually stealing Apple's IP for Windows. These are all elements of \"fraud\" that wound up paying off.\n\nStrict enforcement of an ethical framework like the one presented would have prevented these and other companies from disrupting the status quo, for better or for worse. Treading the ethical (and oftentimes legal) grey zone is par for the course. It's so ingrained in the culture that drawing a bright line delineating what is socially, morally, and/or legally acceptable comes with inevitable tradeoffs.",
            "score": 2,
            "author": "StackOwOFlow",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Strict enforcement of an ethical framework like the one presented would have prevented these and other companies from disrupting the status quo, for better or for worse\n\nYou are framing this as though had these companies not committed these illegal and fraudulent acts, these technologies would have never had a chance to undergo the growth and development that made them so disruptive.  That's quite a leap of faith.  How can you be so sure that these technologies would not have exploded in the hands of other entrepreneurs? \n\n&gt; Silicon Valley is full of fake-it-til-you-make it culture\n\nThere is, but it works mostly in software and it doesn't work when you are up against the laws of physics.  And I find it interesting that the cases you present are actually not from the \"fake it until you make it\" category or even from the unavoidable \"overselling to attract funding\" category.   They are very simple and mundane IP theft cases.",
                    "score": 1,
                    "author": "fretit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the ethical mindset that permitted these “minor” IP thefts is the same that opens the floodgates to more egregious violations. there’s no hard and fast rule here except that almost everybody lies one way or another to get ahead.",
                            "score": 1,
                            "author": "StackOwOFlow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am not sure what you meant by the quotation marks around \"minor.\"  There was nothing minor about them.",
                                    "score": 1,
                                    "author": "fretit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;They are very simple and mundane IP theft cases.  \n&gt;  \n&gt;And I find it interesting that the cases you present are actually not from the \"fake it until you make it\" category or even from the unavoidable \"overselling to attract funding\"\n\nYou imply that the aforementioned examples belong to some other, less egregious category. My point is that the same ethical mindset breeds all of them.\n\nWhen Ballmer sold a yet-to-exist DOS to IBM, he employed the same tactics Holmes used to pitch her blood test product. Ballmer/Gates lucked out  because they were able to acquire 86-DOS that fortunately delivered on the promised functionality. Imagine a scenario where Holmes kept the fraud running long enough to luck out and arrive at a working blood test solution that wound up saving lives (in all likelihood this was the gamble she was making). It'd spark a much more interesting debate over whether the ends justify the means.",
                                            "score": 2,
                                            "author": "StackOwOFlow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think you misunderstood my use of the word \"mundane\" or maybe I used it incorrectly.  Since you said things like \"would have prevented these and other companies from disrupting the status quo\", I thought you were perhaps also arguing that such thefts can be thought of as a natural part of progress.  By using the word \"mundane\", I just wanted to bring what they did from some a possible metaphysical pedestal down to plain old \"mundane\" theft.",
                                                    "score": 1,
                                                    "author": "fretit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;I thought you were perhaps also arguing that such thefts can be thought of as a natural part of progress\n\nI'd say entrenched more than natural. Though they can be hard to de-couple.",
                                                            "score": 2,
                                                            "author": "StackOwOFlow"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; It seems that for the past decade a good majority of frauds uncovered have involved Stanford professors and grads, \n\nDoes it just seem that way or do you have actual data that the **rate** at which such things occur is higher at Stanford?  I emphasize rate, because that is what you need to look at, not the absolute numbers.  Stanford recruits and attracts a lot of entrepreneur types, so it probably produces more of them than most other schools, and therefore even if it produces charlatans at the same rate as other schools, there will be many more of them out there.\n\n&gt; A VC can't just simply argue anymore that a founder is smart or a genius for simply being a Stanford grad, but I don't think that same caution is shown for Yale or Harvard grads. \n\nAny VC who makes the assumption that a person is infallibly smart because they graduated from a prestigious university deserves to lose their money. I suppose those who don't understand the nuts and bolts of what they are being pitched often rely on that, but it doesn't change the fact that being a grad from these schools often just means your application stood out only by a hair or two compared to someone who went to a school ranked say #20 instead of a top 10.  Ignore this reality at your own peril.\n\n&gt; So with this why does Stanford have this issue? \n\nIs this a Stanford issue or a prestigious school issue?  The US high school system is such that it tops out in its ability to differentiate academically the absolute top students.  So universities look at other things, especially at whether the applicants are leaders, doers, takers of initiative, etc.  It is probably easier to fudge and exaggerate these things, so perhaps they end up with more people with a propensity to \"exaggerate\" when marketing anything, including themselves.  \n\nI will add what you describe about Silicon Valley is not that unique to it.  It seems to exist everywhere outside as well.  It's just that SV has such a high concentration of such software-driven companies that it stands out more than other regions.",
            "score": 2,
            "author": "fretit"
        },
        {
            "level": 0,
            "comment": "Selection bias.",
            "score": 5,
            "author": "Opening-Ad4135",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this plays a decent role in this in that of your someone who only cares about being rich and grifting others on vaporware I think Stanford would be your top choice",
                    "score": 1,
                    "author": "kinged"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IMO, it's a product of the ridiculous amount of work it takes to get into Stanford and the outsized expectations that meet folks when they get here. Kids at Stanford hold themselves to such an impossible standard...it's literally \"If I don't change the world by age 30, I'm a failure\" with some of these kids. So when the stakes are that high, it makes sense that a culture of \"do literally anything to get ahead\" sets in. Denise Pope, a professor in the GSE, wrote a book on similar cultures at the high school level that I think speaks to this: [https://www.amazon.com/Doing-School-Stressed-Out-Materialistic-Miseducated/dp/0300098332](https://www.amazon.com/Doing-School-Stressed-Out-Materialistic-Miseducated/dp/0300098332)",
            "score": 0,
            "author": "1776or7",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  the outsized expectations\n\nIt is interesting you mention this.  I read a study a while back about how the rate of depression is much higher among graduates of Ivy Leagues and similar universities, because their expectations of what it means to graduate from such schools is so unrealistically high that what they end up accomplishing after graduation seldom measures up.  The most visible successes in business and academia represent a tiny fraction of graduates.  Most will end up with very respectable careers and accomplishments, but those won't be remotely close to what their naive highschooler minds imagined when they got accepted into prestigious universities.",
                    "score": 2,
                    "author": "fretit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the thoughtful response. It's telling to me that my comment is the most downvoted, but the most upvoted in this thread is \"Stanford people actually do big shit.\" It's a double edged sword. Folks at Stanford do amazing things because they hold themselves to such a high standard, but that high standard can really get the best of you if it leads you to believe you're letting down your family/friends/community because you....just got a job and got on with life like a normal person instead of changing the world somehow.",
                            "score": 2,
                            "author": "1776or7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stanford joins Harvard on this. It’s the issue when you reserve a fairly sizable portion of admissions for those with big time $$.",
            "score": -2,
            "author": "Idaho1964"
        },
        {
            "level": 0,
            "comment": "It’s like university of Miami football in the 1980’s.",
            "score": 1,
            "author": "buffs1876"
        },
        {
            "level": 0,
            "comment": "Based",
            "score": 1,
            "author": "jlbcreditcorpse"
        },
        {
            "level": 0,
            "comment": "https://stanforddaily.com/2023/03/06/mtl-knew-misconduct-allegations-independently-corroborated-in-private-correspondence-to-special-committee/",
            "score": 1,
            "author": "FitzwilliamTDarcy"
        }
    ]
}