{
    "id": "1249swj",
    "score": 5,
    "title": "Pre reqs for EE digital systems",
    "author": "Citron_Senior",
    "date": 1679970762.0,
    "url": "https://www.reddit.com/r/stanford/comments/1249swj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m planning on taking the digital systems classes next year, ee 108/180 but I’ve never taken an ee class before. I don’t know what a capacitor or a transistor is and I’m afraid not having any background in EE and circuits will be detrimental in those classes. Are my worries warranted? Or do I not need to take engr 40m beforehand for the potentially useful background? I was planning on taking engr 40m in the spring but there’s another class that I also really want to take and if e40m isn’t really required then I’ll take the other class.\n\nAny input from people who have taken those classes is greatly appreciated. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Understanding how states are locked into a circuit and how we make digital circuits from analog circuit components helps, but it’s an abstraction under where you’ll be working and isn’t needed. If you wanted to understand transistors at a surface level (enough to implement digital logic), you could probably do so in a week or less if you view transistors as block boxes (in EE, transistors are typically the first circuit element classes will examine in-depth, which is why it takes so long to cover them.)",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You'll be fine. I took EE 108 as my first EE class and EE 180 concurrently with ENGR 40M, and found there to be very little overlap between ENGR 40M and the two digital systems courses. The word transistor almost never comes up and certainly something like capacitor does not come up. As the previous commenter mentions, these things are abstracted away.",
            "score": 5,
            "author": "tetongrand"
        },
        {
            "level": 0,
            "comment": "You don't need any knowledge of EE to understand 108/180, they're higher-level conceptual classes whereas e40m/101a/b are more focused on physical circuits. Actually, having some background in CS would be useful because the work in those classes is closer to coding than to solving circuits.",
            "score": 2,
            "author": "faithfulpuppy"
        }
    ]
}