{
    "id": "126vle0",
    "score": 7,
    "title": "CS coterm in 5 years vs. 4 years",
    "author": "xYellow_",
    "date": 1680201731.0,
    "url": "https://www.reddit.com/r/stanford/comments/126vle0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there -- I'm currently a frosh majoring in CS, and I was interested in getting a coterm in CS because working in machine learning seemed pretty interesting to me as a career path.\n\nI had trouble deciding whether I should take an extra year at school to coterm in CS (which would mean that I get to take more CS courses and learn more, as well as spread out the workload over a longer amount of time) or whether I should spend more effort to get it in 4 years. This would mean that I'd replace some of the CSRE electives I was interested in taking with CS courses, and in less busier quarters, I'd add another CS course. (At worst, the busiest quarters would be 17-18 units because I'm not doing another 20+ unit quarter again lol)\n\nI initially wanted to spend 5 years doing the coterm as well, but due to recent academic burnout, I was skeptical of wanting to spend an extra year in college. Ideally, I'd want to have a work-life balance that allows me to travel and spend time with my family and friends, so the extra year of TC and experience sounds great; on the other hand, I'd be losing a lot of disposable time where I can spend time with friends and grow connections compared with my time as a college student. I also wouldn't take as many AI/ML courses, which I'm concerned would underprepare me in the event that I do want to work in ML (as opposed to being a SWE). \n\nI understand that the most common reason for doing a coterm in 4 years is due to financial costs, but as a FLI student, I was mainly thinking of doing a 50% TA/RAship or applying to the Engineering Coterminal Fellowship to cover my costs, so financials aren't particularly as significant as the others that I've mentioned. \n\nI'd love to hear your thoughts on what I should do. Thanks so much! :)",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; I initially wanted to spend 5 years doing the coterm as well, but due to recent academic burnout, I was skeptical of wanting to spend an extra year in college.\n\nIf you're burnt out as a freshman, fitting two degrees' worth of classes in a truncated timeline isn't going to help.  If anything, it sounds like you should maybe do it in six.",
            "score": 41,
            "author": "LongVND"
        },
        {
            "level": 0,
            "comment": "I really don’t see the benefit of cramming what is normally (without coterm) 6 years of education into four. Spend some time exploring your interests, my dude. College is just about the only time you’ll have enough free time to really pursue every and any avenue you want. Join a club. Go abroad. Take that class you’re not sure about. Volunteer in a lab. You will not look back on your college years and wish you had entered the workforce quicker. \n\n\n\nSource: I am in the workforce.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Would highly recommend 5 — that extra time at Stanford is much more valuable for your career than an extra year of experience would be!",
            "score": 20,
            "author": "Inkdrip1848",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bc of how the ML ecosystem at Stanford works, you get a lot more contact w grad students and professors later on in your education, which gives you more industry connections \nAlso there’s a heck of a lot more to a career than where you start — 5 years will give you better skills, bigger network, more experience, etc. that will pay off long term",
                            "score": 6,
                            "author": "Inkdrip1848"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don’t hear about too many people coterming in 4 years. \n\nBurnout is real, but piling on more isn’t going to help. \n\nEnjoy your time on campus while it lasts.",
            "score": 3,
            "author": "ExaminationFancy"
        },
        {
            "level": 0,
            "comment": "You can do 5 years with 1-2 quarters being internships if you are worried about burnout",
            "score": 1,
            "author": "Glittering-Source0"
        }
    ]
}