{
    "id": "129b9c5",
    "score": 20,
    "title": "Will women ever dominate the world?",
    "author": "Crazyboston199",
    "date": 1680413405.0,
    "url": "https://www.reddit.com/r/stanford/comments/129b9c5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "While the F:M ratio in this year's match is an outlier, the Stanford surgical training programs have had solid representation of women for years. \n\nhttps://med.stanford.edu/content/dam/sm/scalpel/images/MISC/20-21_WEB-NO-pagers.pdf",
            "score": 9,
            "author": "StrongMedicine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting. What would cause such an anomaly?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's hard to say. \n\nThe Match is complex, and as you may or may not know, both the institution and the individual applicants have a roughly balanced say in the outcome. \n\nSo this year could have been a case of Stanford Surgery going even more out of its way to deliberately recruit more women - but this seems unlikely when it was already a woman-majority training program. What I would guess was a bigger contributor is that applicants value programs which they anticipate will be supportive of them as individuals. So once a particular program becomes known for having an unusually high number of women (or URMs, or MD/PhDs, etc...), it will continue to attract that same group in a semi-sustaining way. This makes it that much more difficult for a program that traditionally does not match well with women to turn that around.\n\nBut in the end, only the residency program directors really could say why this year's match was unusual, as they know the F:M breakdown of applicants who they interviewed, and how those interviewees were ultimately ranked.",
                            "score": 3,
                            "author": "StrongMedicine"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your audacity to not consider the gentleman in the second row 2nd from left is atrocious. Sir reconsider what is considered women.",
            "score": 3,
            "author": "FinalPush"
        },
        {
            "level": 0,
            "comment": "You go girls!!!",
            "score": 3,
            "author": "guyuteharpua"
        },
        {
            "level": 0,
            "comment": "One lucky firecracker on the second row",
            "score": -3,
            "author": "BrainEuphoria"
        }
    ]
}