{
    "id": "12h3yzq",
    "score": 7,
    "title": "Stanford University Level Online",
    "author": "Ervitrum",
    "date": 1681093136.0,
    "url": "https://www.reddit.com/r/stanford/comments/12h3yzq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a rising Senior, super passionate regarding Mathematics, going into this year's SUMaC for algebraic topology, and I've taken a Stanford ULO course in the past and loved it. Problem is, I'm debating on whether to self study additional math courses, to take them in community colleges, or take Stanford University Level Online courses.\n\nI understand that the ULO courses offers continuing studies credits, which doesn't exactly contribute much to skipping past prerequisites itself; the steep cost of the program also isn't enough to justify taking it for fun, since I can do so at a community college or on my own. Even enrolling in it for the shallow reason of college admissions doesn't work, as Stanford doesn't consider demonstrated interest.\n\nI would like some advice on whether I should take the courses or not, and how much it is actually valued compared to the latter options. If I am going to enroll to it, I'm planning to tick off every single course in the list by the end of Senior year, so I wanted to take careful consideration before I commit to this. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I would recommend self studying or just taking cheaper courses at a local university or CC. Obv I can’t speak to your chances of getting into Stanford but you’re right that they don’t care much about demonstrated interest. I think it’s just good to learn the material and if you can get it for official units even better but no real reason to pay for it. Also would say there are probably other things you can do that will bolster your application more for Stanford and other elite math universities than just taking courses.",
            "score": 4,
            "author": "Consistent_Weekend70",
            "replies": [
                {
                    "level": 1,
                    "comment": "Stanford University itself also doesn’t take ULO credit towards your degree there as well.",
                    "score": 2,
                    "author": "rbxVexified"
                },
                {
                    "level": 1,
                    "comment": "Gotcha, thank you for the advice!",
                    "score": 2,
                    "author": "Ervitrum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does it mean that \"Stanford doesn't consider demonstrated interest\", and how do you know the admissions office policies?",
            "score": -1,
            "author": "back-envelope12",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s on the common data set. Stanford doesn’t care about the interest you show in their school, whether it be going to tour them or doing their for-pay summer programs.",
                    "score": 5,
                    "author": "rbxVexified",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oooh, I thought you were referring to \"demonstrated interest in math\" rather than \"demonstrated interest in Stanford\".  OK yes, that makes sense.",
                            "score": 3,
                            "author": "back-envelope12"
                        }
                    ]
                }
            ]
        }
    ]
}