{
    "id": "12zzace",
    "score": 4,
    "title": "Joint MSCS/MBA pros &amp; cons?",
    "author": "jaffy7",
    "date": 1682542264.0,
    "url": "https://www.reddit.com/r/stanford/comments/12zzace",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would love to hear some thoughts on this program. What do people who join typically end up doing afterwards? Is it worthwhile?",
    "comments": [
        {
            "level": 0,
            "comment": "The big thing you need to ask yourself is why you are doing the MSCS.  \n\n(Well, we could ask the same about the MBA, but will assume that is the one that is relatively locked in.)\n\nI.e., what are the opportunities you are going to get that you wouldn't with \"just\" your MBA? \n\nIn general, the answer is that the difference in outcomes (other than potentially debt load...) is vanishingly small.  *All else equal*, will you, on paper, be marginally more attractive for, say, a PM--or even deep tech VC--role with a MSCS?  Marginally, yes.  But getting the MSCS is a tremendous time investment, and in almost all those scenarios, that same amount of time could be used to get further out ahead in whatever niche you want to focus on.\n\nIf you're doing it purely for intellectual stimulation and the direct economics don't matter much to you...go for it.\n\nBut from a career ROI perspective, it is generally going to be negative, once you consider what you could otherwise have done with the same level of resources.\n\n(To be clear, this is not a knock on Stanford CS--which would be ridiculous--more so a statement that a Stanford MBA, managed correctly, should be able to get you just about anywhere you want to go where an MSCS would be marginally helpful.)",
            "score": 9,
            "author": "farmingvillein",
            "replies": [
                {
                    "level": 1,
                    "comment": "The opposite question is valid as well. Why the MBA?\n\nIf you’re considering applying for the MS CS I assume you’re quite technical. \n\nIf you’re interested in entrepreneurship, you’re probably already qualified to get your product off the ground, and the rest (sales, fundraising, managing teams, etc.) you won’t learn in b-school. \n\nIf you’re interested in PM roles for research or highly technical teams I’m not sure the MBA helps either.\n\nAll in all I’d start by clarifying what you want out of the dual degree and whether one or the other wouldn’t make more sense.",
                    "score": 3,
                    "author": "rhl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed. In my professional experience (industry R&amp;D), all my PMs have had technical graduate degrees (many times a PhD but more often a MS) while none had business degrees.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "fwiw, Stanford MBA is about as direct a ticket as exists into SV PM.",
                                    "score": 1,
                                    "author": "farmingvillein"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}