{
    "id": "130exs3",
    "score": 9,
    "title": "Vegan + Vegetarian Food",
    "author": "FinalGrapefruit7406",
    "date": 1682586497.0,
    "url": "https://www.reddit.com/r/stanford/comments/130exs3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm an incoming freshman from South Asia. What are the vegan/vegetarian options like on campus? Is it common for people to cook their own food? I'm currently a vegetarian who's trying to go vegan.\n\nAlso, this is unrelated: How are the practice rooms at Stanford (availability, quality of pianos, soundproofing, etc)? I'm a pianist who will be minoring in music. ",
    "comments": [
        {
            "level": 0,
            "comment": "vegetarian myself with vegan friends. since you’re a frosh, you’ll mostly be eating at dining halls, which generally have decent options for vegetarians and vegans. my friends and I had very few issues during our first year with regard to the dining halls. and if you’re trying to cut out other animal products, it’s fairly easy to do (source: accidentally made myself mildly lactose-intolerant because I just didn’t have dairy for the first 3-4 months).",
            "score": 5,
            "author": "fleetwoodmuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "FinalGrapefruit7406"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The dining halls have good options in my opinion for vegans and vegetarians!",
            "score": 7,
            "author": "justaparabola"
        },
        {
            "level": 0,
            "comment": "Most frosh dorms have a piano in the lounge",
            "score": 1,
            "author": "polkapa"
        },
        {
            "level": 0,
            "comment": "dining halls always have vegan food. braun music center and dinkelspiel auditorium have practice rooms with ok pianos you can use. you have to take lessons or pay a fee to get access to them though.",
            "score": 1,
            "author": "Intelligent-Mall6702"
        },
        {
            "level": 0,
            "comment": "Vegetarian as well. The dining halls have a lot of vegetarian options but only a few vegan ones. When I tried going vegan, it took a little bit of planning but overall I think going vegan is manageable",
            "score": 1,
            "author": "PKTY-1"
        }
    ]
}