{
    "id": "1376xlw",
    "score": 4,
    "title": "How flexible will course selection be?",
    "author": "PriorRemove8500",
    "date": 1683166440.0,
    "url": "https://www.reddit.com/r/stanford/comments/1376xlw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just enrolled in Stanford and was wondering if I could explore my academic interests and still graduate in 4 years with a coterm (which I know is already hard in and of itself).\n\nI was thinking of majoring in Econ with a coterm in MS&amp;E or CS, but I wanted to have the flexibility to take at least one class in each of these majors: international relations, public policy, CS, MS&amp;E, data science, and econ before the end of my sophomore year to decide what I actually enjoy the most.\n\nIf I take so many classes in such a wide array of majors while also taking some Ways classes, is it feasible to graduate in 4 years with a coterm? (I am willing to take 18-19 credit hours per quarter (as of right now at least  😭😭)\n\nAlso if that is possible, is there any way I could somehow fit in a quarter of study abroad and graduate within 4 years and one quarter?",
    "comments": [
        {
            "level": 0,
            "comment": "Stanford is pretty flexible and you can take whatever classes you want, stay undeclared for a really long time, and change your major as many times as you’d like to. But graduating in 4 years takes a lot of planning. I don’t think finishing your major and a coterm within 4 years is realistic. Most people take an additional year to complete a coterm. I think if you pushed yourself to finish a coterm faster it would just give you a lot of stress, and you wouldn’t have enough free time to really enjoy your undergrad experience and do all the stuff outside of academics (extra curriculars, applying for internships/jobs, attending events, etc.)\n\nDuring add drop period, you can try a bunch of courses of the majors that interest you for the first week of the quarter, then drop ones you are no longer interested in. I think there’s also an internal database for course syllabus search, so you can get an idea of what courses are like.\n\nA lot of the department websites have Excel sheets with sample 4-year plans. You can study each of these major’s curriculum requirements, find any overlapping courses, and prioritize taking those first so you don’t end up wasting time on classes that don’t count toward graduation requirements. I used Excel religiously to keep track of courses I was interested in and plan every quarter, and stay on track of completing WAYs and major requirements. \n\nI did study abroad for a quarter, it was awesome and I’d highly recommend it! You might have to have a few heavier course load quarters to make room for it. Also some programs are competitive to get into, so you may not get to go abroad during the quarter that you want to.",
            "score": 5,
            "author": "sirotan88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for sharing - this is so helpful😭! For the add drop period is that a quarterly thing where I can take any class and see if I like it? Or is that once a year? Sorry I’m just unfamiliar with what that is. \n\nAlso for financial reasons, do you think it’s worth putting myself under the stress to grind out a coterm and undergrad degree in 4 years? I don’t qualify for much financial aid but because of siblings and parents willingness to contribute, it is very infeasible to do 5 full years.",
                    "score": 1,
                    "author": "PriorRemove8500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Add drop period is every quarter. You technically have until the 3rd week to add or drop courses but you will usually know which classes you like and don’t like after the first week (meet the professor, get the syllabus, see how much homework there is and any projects or midterms). I usually start each quarter shopping like 4-5 classes then keep my favorite 3-4 courses that add up to the right workload. Also it’s not a good idea to add a new class on the second week or later because there’s a lot of catching up to do. \n\nRegarding the co-terms, it is possible to get some financial help by being a TA, but it’s not guaranteed. You have to get to know your professors really well to be considered for TA positions. \n\nThe value of the coterm really depends. I think a lot of students do it as a backup option because they don’t really know what they want to do after graduating and want to stay in school for longer, or as a safety net in case they don’t land a job and the masters degree might help them with extra time/resume boost for job applications. Or if you are pursuing academia, the coterm is a cheaper option than doing a masters elsewhere. \n\nPersonally, I don’t think it’s worth grinding and putting so much time and energy to complete your major &amp; coterm in 4 years. In order to do that, you’d have to know exactly which major and coterm you want to do when you start freshman year, and plan out every single quarter from freshman through senior year to fulfill every single requirement for both degrees. The beauty of Stanford’s academic curriculum is that it has so many interesting courses which you can take in any department. If you want to do a coterm in 4 years, you will have to sacrifice that flexibility and follow a rigid plan of courses, without any room for unique electives or exploration of different majors.",
                            "score": 3,
                            "author": "sirotan88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agree with the excellent comments by Sirotan88 and will only add that outside of Stanford very few people know what a  'co-term' is and even after explanation they find it sort of odd. If there is a specific research project you can only do as a co-term (very rare) then MAYBE your plan makes sense. But otherwise, it makes more sense to do a double major or a major/minor in four years.",
                                    "score": 1,
                                    "author": "sallybog",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I heard double majoring required more credit hours and was actually harder - is that true? Thanks for the help btw!",
                                            "score": 2,
                                            "author": "PriorRemove8500"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try to see if you can double count classes across those majors to maximize efficiency",
            "score": 2,
            "author": "777perfect"
        }
    ]
}