{
    "id": "13cahsm",
    "score": 12,
    "title": "Stanford Housing Lottery - Grad Student Priority",
    "author": "MercyNoah",
    "date": 1683593584.0,
    "url": "https://www.reddit.com/r/stanford/comments/13cahsm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is there anyone currently at Stanford who can speak to the priority housing for grad students? How likely is it that I’ll get my first choice on the list if I’m high priority?",
    "comments": [
        {
            "level": 0,
            "comment": "When I did my lottery I got spot 3489 out of 3500. \n\nSo I got pretty low on my list.",
            "score": 4,
            "author": "SomeRandomScientist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could you share which types of housing you finally got in your first-round lottery? Thanks!",
                    "score": 1,
                    "author": "MrKonjac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was 4 years ago back before EVGR was built and Stanford had a lot of grad students in off campus apartments. I put the on campus stuff at the top of my rank list, and I took the time to rank every single one of the options (40 something at the time iirc). I think the one I got was roughly halfway down my list, in one of the off campus apartments. \n\nWasn’t exactly what I wanted but it was fine. I had a car already so transportation wasn’t an issue.",
                            "score": 2,
                            "author": "SomeRandomScientist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a PhD student and I live in EVGR. I can talk about the process.\n\nThe priority is mainly listed here: [https://rde.stanford.edu/studenthousing/assignment-guarantee-and-priorities](https://rde.stanford.edu/studenthousing/assignment-guarantee-and-priorities). New grad students are guaranteed housing if they\n\n1. Apply by the deadline\n2. Accept any option\\* given by R&amp;DE (there are some technicalities, see link)\n\nMoreover, if you have housing in the first year and have medium priority (for doctoral students), you're generally guaranteed housing if you stay in the same place. Transfers to other dorms are not guaranteed though.\n\nFrom what I've heard, if you're not applying with an existing roommate getting EVGR is kind of 50-50, but other dorms are nice too.",
            "score": 3,
            "author": "laniva",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes thank you. I have looked online about the information, I was more so wondering based on personal experience what the likelihood may be of me getting my top choice. I have guaranteed and high priority housing, but I wanna know how much my priority will truly help me in the lottery",
                    "score": 1,
                    "author": "MercyNoah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Largely depends on your top choice, but you’ll probably get one of your top few choices if not your top choice unless your lottery number is particularly low. They generally just go down the list, though once you get an assignment you’ll probably be able to renew indefinitely as long as your priority remains (possibly afterwards though it’s not technically guaranteed). If you really don’t like your assignment, you can apply to reassign, which is on a first-come basis as new assignments open up through the rest of the year. Assignments depend on popularity and demand, but most of the time you’ll get something you’re pretty happy with, especially if your priority is high",
                            "score": 1,
                            "author": "Designer-Attempt3512"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Incoming PhD student so don’t know for sure, but would assume it depends heavily on *which* housing you put as top choice. If you requested EVGR studio, probably low likelihood. If you requested a Rains double, you’re probably pretty likely to get placed there",
            "score": 1,
            "author": "BorneFree",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see. I did put that as my first choice but mostly put doubles underneath. Is there any reason why you say that likelihood is low?",
                    "score": 2,
                    "author": "MercyNoah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m assuming they’re very popular, and students have the ability to renew housing contracts so probably very common for more premium offerings like EVGR studio",
                            "score": 2,
                            "author": "BorneFree",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohh okay I actually chose the standard studio. Would you say the same thing applies?",
                                    "score": 1,
                                    "author": "MercyNoah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m honestly not sure. I just assume all of the studios are pretty competitive",
                                            "score": 1,
                                            "author": "BorneFree"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}