{
    "id": "13mc833",
    "score": 12,
    "title": "Stanford or MIT?",
    "author": "awwhytaro",
    "date": 1684541149.0,
    "url": "https://www.reddit.com/r/stanford/comments/13mc833",
    "media_urls": [],
    "other_urls": [],
    "postText": "Throwaway account. I'm a prefrosh.\n\nI got off a waitlist recently, so now I have to decide between Stanford and MIT for undergrad. Of course, they are both fantastic colleges, so I would be content going to either, but for some reason I feel extremely nervous every time my hand hovers over a \"commit\" button. But here are the facts:\n\n* Based on my aid offers, MIT will be much cheaper (around half the price) of Stanford.\n* Right now, I'm not really looking into research, mostly industry. I have some vague idea of making a startup, but I also don't want to, like, make something just for the sake of it; only if I have an idea of what I want to do.\n* I want to be more ambitious in life, ideally, but right now I think I'm more intellectual than ambitious—whatever that means.\n* I'm from the West Coast, so I've had the quote-unquote \"amazing Stanford weather\" my whole life; so I'm open to trying other weather options, but obviously Stanford weather is still great.\n* I somewhat like the culture at MIT more, if only because it felt like there are more people with my specific interests at MIT. But I'm sure I could fit in at Stanford, they seem like great people too.\n* I'm worried about the course load at MIT, because from people I talked to it seemed like the course load is significantly large and students spend a lot of their time studying, at the very least much more than Stanford. I could *probably* take a higher course load, but to be honest (I swear this is not humblebrag, it's a legit fact, sorry), I haven't spent much time on coursework during high school at all (maybe like max 60 minutes/day on regular nights, i.e. nights without projects/papers). And I haven't really studied for exams much. So I don't think I have good enough study habits for super heavy courseloads.\n\nThanks for your input, it is greatly valued!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Based on my aid offers, MIT will be much cheaper (around half the price) of Stanford.\n\nThis alone is enough to choose MIT. Nothing else you say is a reason to not choose it.",
            "score": 53,
            "author": "TMWNN",
            "replies": [
                {
                    "level": 1,
                    "comment": "^^^^^^",
                    "score": 3,
                    "author": "smartidiot9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "MIT even if there wasn't a cost difference. Given the cost difference, it's a no-brainer. Unless you really value being close to your family.\n\nBut have you tried appealing for more aid? They can possibly match",
            "score": 11,
            "author": "thegaloose"
        },
        {
            "level": 0,
            "comment": "It sounds like you prefer MIT more!",
            "score": 9,
            "author": "lemon-choly"
        },
        {
            "level": 0,
            "comment": "I attended one undergrad, the other grad. Both are great. You cant lose!\n\nThe other difference you didnt mention is that MIT is urban- a quick subway or bike ride away from off campus culture. Stanford is more self-contained suburban. Maybe we would take the train up to the Big City one Sunday a month.\n\nSince I am frugal, I'd chose the cheaper MIT. Grad school pays you a modest amount to attend for STEM majors.",
            "score": 9,
            "author": "peter303_"
        },
        {
            "level": 0,
            "comment": "&gt; I somewhat like the culture at MIT more, if only because it felt like there are more people with my specific interests at MIT. \n\nWhat are you specific interests that seem more prevalent at MIT?\n\n&gt; I haven't spent much time on coursework during high school at all (maybe like max 60 minutes/day on regular nights, i.e. nights without projects/papers). And I haven't really studied for exams much\n\nUnless you are ready to seriously change your work habits, \nyou are in for a very rude awakening no matter which of these universities you choose, even with a regular course load. This is assuming you pick a non-joke major.",
            "score": 22,
            "author": "leland-stanford-jr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously, students love to downplay how hard they work.",
                    "score": 14,
                    "author": "ExaminationFancy"
                },
                {
                    "level": 1,
                    "comment": "Lol you can totally get away with doing 60m of work a day doing an eng major at stanford",
                    "score": 1,
                    "author": "jlbcreditcorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "MIT",
            "score": 5,
            "author": "ccteds"
        },
        {
            "level": 0,
            "comment": "MIT 100000%. You shouldn't be paying for undergrad anyways.",
            "score": 5,
            "author": "smartidiot9"
        },
        {
            "level": 0,
            "comment": "Would appeal to Stanford for more aid, showing offer from MIT.  There is a decent chance that Stanford would match it.  Only worth doing if equal cost would be a tie breaker.",
            "score": 8,
            "author": "Affectionate_Crab_76",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. But if you just got off the waitlist, chances may be lower than otherwise.\n\nThe key is to get a parent to say “I don’t want [OP] to have to make this decision based on finances!”",
                    "score": 3,
                    "author": "zamfi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let's score it out:\n\n&gt; * Based on my aid offers, MIT will be much cheaper (around half the price) of Stanford.\n\nMIT 1, Stanford 0\n\n&gt; * Right now, I'm not really looking into research, mostly industry. I have some vague idea of making a startup, but I also don't want to, like, make something just for the sake of it; only if I have an idea of what I want to do.\n\nStanford 1, MIT 1\n\n&gt; * I want to be more ambitious in life, ideally, but right now I think I'm more intellectual than ambitious—whatever that means.\n\nDraw\n\n&gt; * I'm from the West Coast, so I've had the quote-unquote \"amazing Stanford weather\" my whole life; so I'm open to trying other weather options, but obviously Stanford weather is still great.\n\nStanford 2, MIT 1\n\n* I somewhat like the culture at MIT more, if only because it felt like there are more people with my specific interests at MIT. But I'm sure I could fit in at Stanford, they seem like great people too.\n\nMIT 2, Stanford 2\n\n&gt; * I'm worried about the course load at MIT, because from people I talked to it seemed like the course load is significantly large and students spend a lot of their time studying, at the very least much more than Stanford. I could *probably* take a higher course load, but to be honest (I swear this is not humblebrag, it's a legit fact, sorry), I haven't spent much time on coursework during high school at all (maybe like max 60 minutes/day on regular nights, i.e. nights without projects/papers). And I haven't really studied for exams much. So I don't think I have good enough study habits for super heavy courseloads.\n\nThis is probably a problem for you at any college.\n\nFinal score: Tie. No wonder you have a quandary.\n\nIf we weight these factors though, MIT has cost and culture in its favor while Stanford has weather and industry. To be frank, Stanford vs. MIT on industry is a negligible difference with Stanford barely ahead. Weather is the least important factor. That MIT costs half of Stanford is a huge factor for two very comparable schools. HYPSM is an acronym.\n\nI will generally push hard for admitted students to pick Stanford, but honestly, in your particular case, it seems like MIT is the better choice.",
            "score": 6,
            "author": "GoCardinal07",
            "replies": [
                {
                    "level": 1,
                    "comment": "absolutely not a tie. there's no reason to spend money on undergrad (given that this person got into crazy schools and probably get full rides to other schools), let alone go with the more expensive option",
                    "score": -1,
                    "author": "smartidiot9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a tie when the factors were unweighted. I see you didn't read the last two paragraphs where I then weighted the options and said MIT.",
                            "score": 2,
                            "author": "GoCardinal07"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "MIT. Others here have parsed it well. The cost is a major factor, but it also seems that it might be a valuable challenge to move beyond the Bay area bubble. It sounds as though you're well prepared. \n\nI'm a New Yorker who moved to the Bay area. The culture disparities are genuine, but so are the affinities with an interest group. Your new comrades will help you traverse the gap.",
            "score": 2,
            "author": "cl0udripper"
        },
        {
            "level": 0,
            "comment": "If you are from California and go to a CA school you are a less rounded person. Pushing yourself to go to the East Coast will make you a more interesting well rounded person.",
            "score": 2,
            "author": "doctorboredom"
        },
        {
            "level": 0,
            "comment": "Safeway",
            "score": 1,
            "author": "nat4mat"
        },
        {
            "level": 0,
            "comment": "Try to defer Stanford for one year and go to MIT. If you like it, stay. The cost savings IS a big deal and MIT is amazing. Do not believe the hype about Stanford students not studying/doing homework. Pretty much everyone is shocked when they leave high school and start taking serious college courses. Both campuses will have students who 'dial it in' but on the whole most students work very hard, esp after they figure out what is actually expected. (This often takes a year or two).",
            "score": -1,
            "author": "sallybog",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can’t matriculate at another institution when you defer. I mean, I guess you can — but they’ll be very annoyed if they find out.",
                    "score": 4,
                    "author": "zamfi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You just can’t. They will run an educational background check to verify you haven’t attended another institution before you matriculate and when they find out you’ve violated the deferment agreement after running the background check that takes &lt; 10 s they’ll void the offer.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s not how deferral works.",
                    "score": 1,
                    "author": "Imaginary-Summer9168"
                }
            ]
        },
        {
            "level": 0,
            "comment": "what are you interested in studying?",
            "score": 1,
            "author": "StackOwOFlow",
            "replies": [
                {
                    "level": 1,
                    "comment": "CS",
                    "score": 1,
                    "author": "awwhytaro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MIT, mainly due to the major difference in tuition for roughly comparable CS programs.",
                            "score": 17,
                            "author": "StackOwOFlow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "MIT and Stanford are likely to be equally challenging, this is not a point in favor of either.  At MIT you will have more engineering/science breadth requirements, at Stanford you will have more (and more intense) humanities breadth requirements.\n\nUnless your high school is top 10 in the country, sending 25%+ of its graduating class to top-10 schools, prepare to work harder than you did in high school.",
            "score": 1,
            "author": "zamfi"
        },
        {
            "level": 0,
            "comment": "The cheaper option. \n\nAlso, Boston is the nerdiest city, and you can bounce around to presentations and non-coursework lectures at all the local schools. Global scholars come to Boston, follow your favorites’ socials and catch them when they come through.",
            "score": 1,
            "author": "stnic25or6to4"
        },
        {
            "level": 0,
            "comment": "Go to MIT!",
            "score": 1,
            "author": "RemoveFast1186"
        },
        {
            "level": 0,
            "comment": "I think this is more a question of geography / vibe / what you wanna do after… contrary to what the people here say, cost shouldn’t matter at all — you can pay that off fairly easily if you’re in big tech (sounds like this is what you’re interested in?)",
            "score": 0,
            "author": "LongMathematician420"
        }
    ]
}