{
    "id": "1481j9r",
    "score": 0,
    "title": "Is Stanford rude in your opinion?",
    "author": "Gundam_net",
    "date": 1686614795.0,
    "url": "https://www.reddit.com/r/stanford/comments/1481j9r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I haven't been on campus since 2016, but seeing today's atheletes and the general cultural vibe of the surrounding area I get the impression that today's students are ruder than 7 years ago. \n\nI was wondering what current students think/feel.  Does anyone get the impression that campus culture is now somewhat rude, as in 'ill-mannered, discourtous or insulting?'  \n\nIs gen z just more hierarchical, narcissitic and psychopathic in general (than millenials were), maybe?  Or has nothing changed (it's in my head maybe)?",
    "comments": [
        {
            "level": 0,
            "comment": "My knee jerk reaction is to strongly disagree with your post. So maybe?",
            "score": 26,
            "author": "SomeRandomScientist"
        },
        {
            "level": 0,
            "comment": "do you have examples",
            "score": 6,
            "author": "StackOwOFlow"
        },
        {
            "level": 0,
            "comment": "I find society in general has been ruder post-pandemic. It's like people forgot their manners while isolated at home.",
            "score": 7,
            "author": "GoCardinal07",
            "replies": [
                {
                    "level": 1,
                    "comment": "I notice this too.  I don't really understand it though.",
                    "score": 2,
                    "author": "Gundam_net"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not so much rude as much worse social skills outside of their immediate bubble.",
            "score": 17,
            "author": "IAmAUsernameAMA"
        },
        {
            "level": 0,
            "comment": "Gen X here. Whatever, man. Let ‘em do their thing",
            "score": 15,
            "author": "TXCardinal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao.  I definitely think I may just be feeling culture shock as I'm a millenial raised by boomers.  The whole gen x + gen z lifestyle and values, parenting style etc seems a lot different.\n\nI feel like boomers emphasized more common decency cultural values growing up, bascally making a big deal about respecting strangers, treating people with kindness on purpose, helping out neighbors and being intrinsically friendly etc.\n\nI get the impression that gen z was taught to ignore strangers, be unfriendly/hostile in general and to be intrinsically competetive/selfish.",
                    "score": -33,
                    "author": "Gundam_net",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With opinions like this, what makes you think they're the ones lacking social skills?",
                            "score": 22,
                            "author": "Prestigious_Push_947"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's hard to say... I've been on campus off and on since graduating in the 90s and then having one of my own kids attend currently. There are amazingly warm, courteous kids on campus BUT there is definitely a sub-culture of robotic coldness that is tolerated to a higher degree than on other campuses I think.   \n\n\nInteresting about the difference between Gen Z and Millenials. Z has X-ers for parents and as such are less trusting of the world in general than are Millenials. We (X-ers) seem to have imprinted that into our kids unwittingly.",
            "score": 5,
            "author": "Mousse-Living"
        },
        {
            "level": 0,
            "comment": "Nah I haven’t gotten that impression. The only thing that I can think of is that Stanford admitted way more students than it was supposed to during the pandemic, so now dining halls and other spaces on campus are really crowded. But beyond that everyone seems nice and courteous.",
            "score": 4,
            "author": "sunny_trees_34423",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, maybe I'm just wrong.  That could very well be.",
                    "score": 1,
                    "author": "Gundam_net"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an athlete on campus. I see what you mean with some athletes but I think in general the people on campus are some of the nicest I've ever been around",
            "score": 3,
            "author": "meh47284628"
        },
        {
            "level": 0,
            "comment": "If you haven't been on campus, how are you developing this opinion in the first place?",
            "score": 7,
            "author": "Niel_B",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live nearby.",
                    "score": -17,
                    "author": "Gundam_net"
                }
            ]
        }
    ]
}