{
    "id": "fpk0s6",
    "score": 186,
    "title": "The single most important thing to remember as a Stanford student (or admit!)",
    "author": "tmlp59",
    "date": 1585257922.0,
    "url": "https://www.reddit.com/r/stanford/comments/fpk0s6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recent grad here who did an undergrad and coterm. There's so much to be overwhelmed by at Stanford - everyone seems to have more friends, more fun, more job/internship offers, less confusion, more sex, less existential angst, more units, more group texts, better grades, more party invites, whaaatever. This way overwhelmed me until, like, the end of junior year, when I realized: **you cannot compare yourself in the singular to your peers in the aggregate**. Of course you individually didn't get four job offers; that's the lump sum of what the five people you most recently spoke with got, but it's all sticking together in your mind. Of course you don't have three professors you text with; that's, like, the combined total of all of your friends plus those randos you sometimes talk to in your dorm (or on Zoom?). **You are only one Stanford student**, but it's easy to compare yourself with the combined top achievements of the 15 people you talk to regularly. Duck syndrome is real, be kind to yourself, and remember that you might not feel like a shining star every day, but those around you are comparing their everyday selves to your brightest moments of glory, too.",
    "comments": [
        {
            "level": 0,
            "comment": "This is great advice for life in general, too. Thanks for the reminder to be kind to yourself!",
            "score": 20,
            "author": "poisonivious"
        },
        {
            "level": 0,
            "comment": "As a new admit this is so useful to keep in mind :)) thank you!",
            "score": 29,
            "author": "kyang8093"
        },
        {
            "level": 0,
            "comment": "This is great advice, thank you!",
            "score": 9,
            "author": "lawnorderluvr"
        },
        {
            "level": 0,
            "comment": "That's generally true in life, not just at Stanford.\n\nAnd if you are prone to falling in that kind of trap, social media is probably far worse.\n\nYou already seem wise beyond your years.",
            "score": 3,
            "author": "fretit"
        },
        {
            "level": 0,
            "comment": "Wasn't this posted previously on Confessions of UC Berkeley?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk I wrote it out of the goodness of my heart but if someone cross posted it that’s neat. Link?",
                    "score": 2,
                    "author": "tmlp59"
                }
            ]
        }
    ]
}