{
    "id": "yc0ml1",
    "score": 13,
    "title": "Where can I find a therapist?",
    "author": "Soggy-Mycologist8782",
    "date": 1666581126.0,
    "url": "https://www.reddit.com/r/stanford/comments/yc0ml1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have tried reaching out to CAPS but I can’t get ahold of any therapist and never hear back from them. \n\nBut, I need a therapist bruh. Like I need need to talk to someone if you feel me. \n\nAnyone have off campus resources that are not gonna break my bank? All I’ve ever seen is crazy crazy prices like 300+ an hour.",
    "comments": [
        {
            "level": 0,
            "comment": "Call caps and have them refer you to off campus resources. This meeting is over the phone and take 10is minutes. They’ll refer you to online services that will accept your insurance.",
            "score": 8,
            "author": "balck_mist",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did all that but they never got back to me and I called back twice it’s been two weeks",
                    "score": 2,
                    "author": "Soggy-Mycologist8782",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you waited for someone to answer if the line is busy or opted for them to call you back when they’re not busy?",
                            "score": 4,
                            "author": "balck_mist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I gave them all my info and was told they would get back to me but they never did",
                                    "score": 3,
                                    "author": "Soggy-Mycologist8782",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is how I found an online provider. https://findoctave.com/?utm_source=google&amp;utm_campaign=&amp;utm_medium=cpc&amp;gclid=CjwKCAjwzNOaBhAcEiwAD7Tb6DvyX9s7F_WqAazMxfUxvFpzu8uBJ49Mfmpw8jsNz56tp441ITFUixoCuZ8QAvD_BwE",
                                            "score": 5,
                                            "author": "balck_mist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much, how have you been liking your experience?",
                                                    "score": 1,
                                                    "author": "Soggy-Mycologist8782",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’ve had two providers through them and it’s been great. They base your provider match based on preferences/ parts of your identity. You can provide all of that when signing up. Heard back from them fairly fast and slid they accept your insurance the cost is $25 per session.",
                                                            "score": 2,
                                                            "author": "balck_mist",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Awesome, thank you for helping me out. I really appreciate it.",
                                                                    "score": 1,
                                                                    "author": "Soggy-Mycologist8782",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Np :). Hope you can get the help you need :)",
                                                                            "score": 1,
                                                                            "author": "balck_mist"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you need someone to guide you the people at Wellbeing at Stanford are amazing, not therapists but you can discuss your option with them and have one on one counselor meetings for free, you can just pop down to kingscote gardens and talk to them in person, I can't speak highly enough of them :D",
            "score": 4,
            "author": "aguilaair"
        },
        {
            "level": 0,
            "comment": "If you get in touch with a resident dean, they will make sure CAPS responds to you. Alternatively, you could tell your  RA and they could loop in the residence dean to make sure they get back to you. Once a RD is involved response times are insanely better",
            "score": 2,
            "author": "polkapa"
        },
        {
            "level": 0,
            "comment": "The Gronowski Center offers mental health services on a sliding scale (priced based on your income). Take a look at the link and see if it would be a good fit for your needs! \n\n&amp;#x200B;\n\nhttps://www.gronowskicenter.org/",
            "score": 1,
            "author": "Odysseus183"
        }
    ]
}