{
    "id": "yuinjq",
    "score": 5,
    "title": "Sickness",
    "author": "ConsiderationOdd4922",
    "date": 1668382756.0,
    "url": "https://www.reddit.com/r/stanford/comments/yuinjq",
    "media_urls": [],
    "other_urls": [],
    "postText": "What do I do if I am so sick that I can't go to classes. Like how do i catch up on work, are the teachers flexible, etc, im scared imma get so behind?",
    "comments": [
        {
            "level": 0,
            "comment": "Email your professors. Ask for extensions if you need them and what you can do to catch up on missed lectures, etc. They should be helpful",
            "score": 4,
            "author": "6___-4--___0"
        },
        {
            "level": 0,
            "comment": "With the supposed efforts to address mental health issues there, it seems like professors should get the memo.",
            "score": 5,
            "author": "Mariposa510",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope springs eternal.",
                    "score": 1,
                    "author": "jsalsman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It can vary by professor, class, how long, etc.\n\nSome will give you way more accommodation than you realistically need and some won’t give shit. So unfortunately, there isn’t a great general answer. If you go through OAE, you should be able to get at least some minimal level of extensions and such.",
            "score": 1,
            "author": "vvashington"
        },
        {
            "level": 0,
            "comment": "Email the teaching team. For every class I've taught, we try to help figure out a solution, but we can't help if we don't know you're sick. Policies vary depending on the class/dept.",
            "score": 1,
            "author": "433onrepeat"
        },
        {
            "level": 0,
            "comment": "If your professors are being too rigid and won't give you an extension when you really need it, try talking to your academic advisor or residence dean and having them email the professor for you or cc them because they might take it more seriously",
            "score": 1,
            "author": "polkapa"
        }
    ]
}