{
    "id": "yygi80",
    "score": 7,
    "title": "Financial Aid",
    "author": "Freak-1",
    "date": 1668766007.0,
    "url": "https://www.reddit.com/r/stanford/comments/yygi80",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to apply for the financial aid in Stanford. The problem is that here in Yemen and due to the conflict we pay no taxes any more. So, how am I supposed to show Stanford that I am in need for the financial aid?\n\nUnfortunately, the only document that I can provide to Stanford is a letter from my father's employer. Will this document suffice? And what should I do if not?\nThank you.",
    "comments": [
        {
            "level": 0,
            "comment": "I think Stanford FA can work with you to find a reasonable workaround. Try emailing them explaining your situation and ask if there are any other documents they would accept",
            "score": 16,
            "author": "evildemigod"
        },
        {
            "level": 0,
            "comment": "Why are you asking Reddit randos instead of the Stanford Financial Aid department on this?  Wear your big boy/girl pants and call them during business hours: [https://financialaid.stanford.edu/contact/](https://financialaid.stanford.edu/contact/)\n\n  \nEsp if you have extenuating circumstances like the conflict going on now -- this is the time to connect to a human there so they can fast track you out of processes and handle you as a special case with extra benefits, and you want that.",
            "score": 3,
            "author": "binarysolo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Advice on wearing big boy pants 😭😂",
                    "score": 3,
                    "author": "FinalPush"
                },
                {
                    "level": 1,
                    "comment": "LOL. Talking about Big Boy Pants to someone who has seen more shit in a day than you would in a lifetime. But good advice nonetheless.",
                    "score": 2,
                    "author": "plozappi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will do :)",
                    "score": 8,
                    "author": "Freak-1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why are you being so rude? Don’t take your bad day out on this guy smh",
                                    "score": 8,
                                    "author": "ganeshhh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Objectively, you’re being rude. I can only hope that the bad day part is true and this isn’t how you normally go about human interactions. Here’s to hoping you have a better day soon!",
                                                    "score": 6,
                                                    "author": "ganeshhh"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 5,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Good, I'll try. I mean I have nothing to lose right?",
                                    "score": 5,
                                    "author": "Freak-1"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}