{
    "id": "zhkssd",
    "score": 19,
    "title": "Bike or Scooter!",
    "author": "FastElk7509",
    "date": 1670652834.0,
    "url": "https://www.reddit.com/r/stanford/comments/zhkssd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I know it's like super early to be asking this, but would you recommend a bike or a scooter to an incoming freshman in the Class of 2027? (I just got matched through Questbridge 🙌🏽)",
    "comments": [
        {
            "level": 0,
            "comment": "Bike\nIf you know how to ride one and have no medical disabilities. \n\nSure scooters are easy but it’s annoying to deal with charging and long distance trips. \n\nGet a good bike, not necessarily expensive, but one that suits you and is comfy. Also make sure to get a great lock. Bike theft here is no joke",
            "score": 24,
            "author": "J0V1K"
        },
        {
            "level": 0,
            "comment": "Congrats!!!! I hope you are celebrating. You should be very proud! I’d go with a bike but as mentioned get a cheap one and lock in very well. Even if you do it still might get stolen",
            "score": 9,
            "author": "dividedby00"
        },
        {
            "level": 0,
            "comment": "Bike",
            "score": 6,
            "author": "nobelapology"
        },
        {
            "level": 0,
            "comment": "Bike if you have a good lock and if your bike is not too expensive.  Bike theft is common. \n\nIf you would rather keep your wheels in your room, then scooter.  Consider whether you would lock it outside while in class or whether it is small enough when folded to carry with you and put under your chair.",
            "score": 5,
            "author": "trewstyuik"
        },
        {
            "level": 0,
            "comment": "I have a scooter on campus and I’d recommend a bike. They’re easier to ride, waterproof (I didn’t know my scooter wasn’t but now the headlight won’t turn off) and you won’t have to charge them every 2 nights. \n\nDon’t get me wrong I love my scooter as it’s faster, super fun and takes no effort but a bike is better all around",
            "score": 3,
            "author": "vikr4msri"
        },
        {
            "level": 0,
            "comment": "Congrats!  Bike. Not too expensive of a bike.  Scooter would not be so great. There have been some incidences of fires breaking out for faulty charging. \n\nhttps://www.npr.org/2022/10/30/1130239008/fires-from-exploding-e-bike-batteries-multiply-in-nyc-sometimes-fatally\n\nAlso freshman fifteen. Bike is a great exercise even if it’s just five ten minutes to class.",
            "score": 4,
            "author": "gracecee"
        },
        {
            "level": 0,
            "comment": "scooter! unless you live in a really good place, scooters make it so much simpler and less of an investment to get around campus",
            "score": 0,
            "author": "gabelasagna"
        },
        {
            "level": 0,
            "comment": "Scooters are baller idk what to say. esp if you’re living on a hill or far away from main quad you’ll be happy you don’t have to use your muscles to get places",
            "score": -1,
            "author": "valharius"
        },
        {
            "level": 0,
            "comment": "Bike definitely! Don't buy an expensive one before getting here, there are bike sales all the time and used bikes on SUPost",
            "score": 1,
            "author": "krone-icals"
        }
    ]
}