{
    "id": "zlb6u5",
    "score": 9,
    "title": "I got accepted into the Stanford Summer Program. Is it worth it?",
    "author": "PossessionMinimum360",
    "date": 1670975455.0,
    "url": "https://www.reddit.com/r/stanford/comments/zlb6u5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got accepted into the Stanford Summer Program. Is it worth it? From anyone who has done it, how is the experience, did it help you?",
    "comments": [
        {
            "level": 0,
            "comment": "We should sticky an answer to this really common question, but no it’s not going to help with college admissions at all, unless you get a very fancy custom recommendation letter (quite unlikely). It is maybe nice if you are an international who has never lived in the US before though, it might give some good cultural experience.",
            "score": 19,
            "author": "SpinyLemon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I was debating doing it because of the high cost and the fact that it runs till August 20th. I would have to miss a week to school and miss a chance to try out for the tennis team",
                    "score": 5,
                    "author": "PossessionMinimum360",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If the cost is an issue then definitely don’t do it. Way more productive things you can do during summer",
                            "score": 18,
                            "author": "SpinyLemon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Copy-pasting from other thread:\n\n&gt; No, it's a cash grab. Good rule of thumb for these programs is - if they are truly selective/good, then they will be free (minus maybe like, COSMOS). If you really want to take classes, you can get similar content at a local college or university. Otherwise it's probably a better use of your summer time pursuing a hobby, doing research, or going to one of the free selective camps.",
            "score": 18,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "When I was an undergrad, I *never* met anyone who did the Stanford summer program before getting admitted. \n\nI did the high school summer program at UCSB the summer after my freshman year in HS. It was like summer camp at the beach and a nice excuse to get away from home.",
            "score": 6,
            "author": "ExaminationFancy"
        },
        {
            "level": 0,
            "comment": "It could actually hurt you for college admissions at other selective schools sinceby doing this you have demonstrated interest in Stanford.  It won't help you at Stanford since Stanford does not take demonstrated interest into account and the AOs know that this is a cash grab by the university.",
            "score": 2,
            "author": "Affectionate_Crab_76",
            "replies": [
                {
                    "level": 1,
                    "comment": "It won’t necessarily hurt them. I saw plenty of kids take other classes at other ivies and still get into Stanford and vice versa. Stanford has one of the longest summer high school programs. Others are two, three, four week courses. Some also don’t have the ‘you have to be 16’ which limits some kids till after their jr year to attend. It doesn’t move the needle except if it shows an interests in a subject like neuroscience.",
                    "score": 3,
                    "author": "gracecee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do not disagree with the above but I do know a few who did a class with me via the summer school and are students at Stanford now.",
            "score": 2,
            "author": "QuantityHopeful8784"
        },
        {
            "level": 0,
            "comment": "Hey! I did 2 years of the Stanford Pre-Collegiate Program (SPCS) and loved it. I did one year in product design and one year in business strategy — both were great. You get to live on campus over the summer w/ a lot of independence and work with awesome peers. It won’t help with admission into Stanford undergrad, but it’s a great program.",
            "score": 1,
            "author": "No_Baseball_8143",
            "replies": [
                {
                    "level": 1,
                    "comment": "what's the day to day like?",
                    "score": 1,
                    "author": "TheRealBigweld"
                }
            ]
        }
    ]
}