{
    "id": "106bkjh",
    "score": 6,
    "title": "International Affairs Majors",
    "author": "Bloodrocuted_drae",
    "date": 1673157877.0,
    "url": "https://www.reddit.com/r/gwu/comments/106bkjh",
    "media_urls": [],
    "other_urls": [],
    "postText": "What jobs have you landed after graduation or what career fields is it look like you’re going to get into? Nervous about starting this degree because the fear of “wasting $ on a degree” sometimes kicks in 🥲",
    "comments": [
        {
            "level": 0,
            "comment": "Most people I know who majored in IA (myself included) are pursuing another degree (grad or law school) or working for the government",
            "score": 16,
            "author": "PoetryPositive5617"
        },
        {
            "level": 0,
            "comment": "entry level jobs in international affairs are rare and very competitive, and a lot of the jobs at these large ngos or government agencies require a masters or a business degree. most people i know who majored in ia took jobs in different fields (business, state government, social services) to just get the paycheck or are getting their law degree. ia degrees are not the most practical but can set you up to succeed in several career fields so it’s a mixed bag.",
            "score": 13,
            "author": "AnthoZero"
        },
        {
            "level": 0,
            "comment": "I interned at the State Dept senior year, which helped me get a job at a different government agency after graduating that had an entry-level “development program” (because State doesn’t really hire anyone out of undergrad). I’ve been with my place for 12 years; the pay and benefits are a lot better than the NGO work I had looked at and they paid for my Master’s.",
            "score": 11,
            "author": "mcllcm00"
        },
        {
            "level": 0,
            "comment": "Damn this thread is grim",
            "score": 11,
            "author": "ArisenFall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m saying, better off just saying don’t do it 😂",
                    "score": 0,
                    "author": "Bloodrocuted_drae"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do the double major for a BS: economics or a hard science.\n\nhttps://elliott.gwu.edu/bachelor-science-international-affairs",
            "score": 7,
            "author": "crlynstll"
        },
        {
            "level": 0,
            "comment": "Defense contractors like IA degrees; but you’ll have way more success if you pair with Econ or CS. Got multiple offers with Econ/IA out of undergrad since I looked in the right places",
            "score": 5,
            "author": "monticuleherbeux",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish I had thought about defense contractors out of college. I was convinced that government service was the only option. I found out there wasn’t a huge demand for recent grads with a B average and mediocre language skills.",
                    "score": 3,
                    "author": "InLikeErrolFlynn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I was convinced government was the way till I talked to some people in the industry. They love it when you can talk about the end uses for the product and understand that military power is one of many possible solutions",
                            "score": 2,
                            "author": "monticuleherbeux"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jobs suck right after college and everything is super competitive.",
            "score": 3,
            "author": "reddit_toast_bot"
        },
        {
            "level": 0,
            "comment": "If you're (understandably) worried about job prospect in IA, you can choose to add a minor or even a second major to give you more options. I know a lot of IA students will do the econ-focused concentration and double major in Economics since there's significant course overlap. You could also tack on a minor in a STEM field like statistics, comp sci, or data science - they'll give you hard skills in programming + quant thinking that can set you apart from other applicants.",
            "score": 3,
            "author": "anyhistoricalfigure",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would 100% recommend minoring in something that will give you “hard” skills. I was dumb and minored in anthropology, but I should have done literally any of the minors at the business school.",
                    "score": 2,
                    "author": "AnthoZero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Entry level positions are inherently super competitive because you're going up against every other person who's graduated in an IA related field in the past few years. \n\nI graduated almost 7 years ago now. Everyone I know that also did IA is in a wide range of fields and positions. Some went on to do a masters degree, some got a law degree, some did government agency work, election campaign work, and a few have jobs completely unrelated to their bachelors degree. Long story short the degree will help you ultimately get where you want to be but it might not be a direct path immediately after you graduate.",
            "score": 3,
            "author": "rumbakalao"
        },
        {
            "level": 0,
            "comment": "2002 grad here, so at this point I feel like I’m “settled” in my career. And it’s not directly in International Affairs. \n\nI interned for a Senator on the Foreign Relations committee and I was convinced I was headed for a career in diplomacy (but knew I needed an advanced degree). After graduation, I tried to get a job within the intelligence community, but wasn’t able to. I ended up moving to NY and got my MA in Diplomacy from Seton Hall. At this point, I was horribly in student debt and realized that any entry-level job in government service wasn’t going to pay me enough to make ends meet. \n\nThe good news is that skills you learn in diplomacy and international affairs translate well into other careers - like international business and communications. I currently work for a multinational bank leading external communications and media relations. I don’t think my MA degree was necessary (and it was expensive) but my bachelor’s degree and internship experience were worth it.",
            "score": 2,
            "author": "InLikeErrolFlynn"
        },
        {
            "level": 0,
            "comment": "Take a look on linked in what grads have been doing since they graduated. I have friends who went to grad school, work for the fed government, Foreign Service, did Peace Corps, went to law school, private sector/contracting, or something totally non-IA related. \n\nI would just recommend taking advantage of as many different internships as you can. You’ll get a sense of different paths and what you may want to do after. \n\nCareers are very often non linear. Very rare you get your dream job out of undergrad or grad school. Best advice I got was to understand that and think about how whatever job you’re applying to will get you experience and skills that will get you to that dream job. \n\nGood luck!",
            "score": 1,
            "author": "dissociation844"
        },
        {
            "level": 0,
            "comment": "Honestly it doesn’t matter much your degree. I got a BA is Political Science and then a law degree and my first “job” was an unpaid internship with the House Foreign Affairs Subcommittee on Western Hemisphere because the staff director was a Brazilian lawyer and I just happened to speak Portuguese. I parlayed that internship into a job at an NGO doing international development because I met one of their directors through that internship.",
            "score": 1,
            "author": "NorthEazy"
        }
    ]
}