{
    "id": "10bg96b",
    "score": 18,
    "title": "thoughts",
    "author": "CompleteApartment937",
    "date": 1673673318.0,
    "url": "https://www.reddit.com/r/gwu/comments/10bg96b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone else felt like they lost themselves or fell into a deep depression at GW? How did u get out of it and make a better semester?",
    "comments": [
        {
            "level": 0,
            "comment": "Hey man, I was in your shoes once too. My freshman year was extraordinarily rough too (i'm not going to get into the reasons). I was in probably the darkest place in my entire life last year and i've spent the last year digging my way out. So let me give you some advice- some practical and some not-so...\n\n1.) Go for a fucking walk. I don't mean around campus, i mean leave foggy bottom. Clear your head. Think. Observe your surroundings and find the beauty in them. Notice beautiful things everywhere, things might improve.\n\n2.) Get your head out of your shell and talk to people. They aren't that scary, heck you might find someone you like. It's pretty easy to talk to people in big lectures.\n\n3.) Find something you like to do. For me, that was baseball. Nationals tickets are as cheap as $8. I like hockey too, i go to a lot of Caps games. There's a lot of caps fans here on campus that i bond with. Go to a concert and talk to people and hopefully see a band that you like!\n\n4.) Maybe volunteer. Again, it doesn't have to be on campus. I found newfound purpose and satisfaction in life when I started volunteering for a non-profit with a chapter in the area. I felt much more fulfilled.\n\n5.) \"Even if you're on the right track, you'll get run over if you just sit there.\" Keep striving to improve. Appreciate life a bit. Keep doing what you like. Itll get better , I promise.",
            "score": 37,
            "author": "Glittering-Network96"
        },
        {
            "level": 0,
            "comment": "College is really hard on your mental health. Don’t take it lightly—if you feel like this, seek help. It will make a difference. \n\nThe Center Clinic is the best kept secret at GW. Cheap and accessible therapy and psychiatry. It made a more positive impact on my life than any exercise routine or lifestyle change did. \n\nPlease give them a call. I promise it will help. I’m sorry this is tough :( I’m rooting for you! \n\nhttps://psyd.columbian.gwu.edu/clinic",
            "score": 13,
            "author": "pogus"
        },
        {
            "level": 0,
            "comment": "Yeah its rough out here 🫡",
            "score": 10,
            "author": "Dry-azalea"
        },
        {
            "level": 0,
            "comment": "My freshman semester here was possibly the worst time of my life. A shitty relationship, no real friends to speak of- it was rough.\n\nMy biggest advice: Join clubs and activities with likeminded people, makes making friends a lot easier than awkwardly trying to make small talk in your 100 person lectures. Make a few friends you can really trust first, and then build out more relationships from there if you prefer that. If the others fall through, you'll always have a support system you can lean on.\n\nI stopped at 3 very close friends, and that's plenty for me.",
            "score": 8,
            "author": "backbiter0723"
        },
        {
            "level": 0,
            "comment": "ye\n\nthis school is full of ambitious dolts\n\nits soul sucking",
            "score": 7,
            "author": "Meal-Salty",
            "replies": [
                {
                    "level": 1,
                    "comment": "grind culture is unfortunately real here :/",
                    "score": 4,
                    "author": "catholicgwustudent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll let you know lol",
            "score": 1,
            "author": "zac_par"
        }
    ]
}