{
    "id": "10z06oo",
    "score": 5,
    "title": "Is there a dress cose for classes?",
    "author": "[deleted]",
    "date": 1676056332.0,
    "url": "https://www.reddit.com/r/gwu/comments/10z06oo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Me and my friends were looking for what the punishment would be if you go to class in your underwear only.",
    "comments": [
        {
            "level": 0,
            "comment": "Wearing only underwear to class would probably result in action from Title IX which you don’t want to mess with.",
            "score": 31,
            "author": "AnthoZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol as if Title IX ever does anything to protect students from assault and harassment, if they can't handle the rapes and druggings on campus I doubt they'd be able to devote much energy to handling a little undie class sesh.",
                    "score": 10,
                    "author": "Calm_Farmer_3061",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Undies wouldn’t get you title 9, they’d get the cops called for indecent exposure. I spent my first college semester at GW and I personally knew two girls who were raped, one on two occasions. Title 9 didn’t do shit (tho only one girl ever made a report). It’s a fucking disgrace.",
                            "score": 8,
                            "author": "Paloswine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "True. Obviously not considering it. We were just curious because there was no clear dress code in the student manual",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try it and let us know",
            "score": 9,
            "author": "Bobofett69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha nice. Will keep u updated. Thing is if i do i reveal my persona…",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dunno but 6000 level in-person classes generally have unspoken rules about not coming to class looking homeless/in sweatpants + sweatshirt",
            "score": 3,
            "author": "sleeping_bananas"
        }
    ]
}