{
    "id": "11j84le",
    "score": 7,
    "title": "Easy WIDs?",
    "author": "Own-Employment368",
    "date": 1678043407.0,
    "url": "https://www.reddit.com/r/gwu/comments/11j84le",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sorry, I know I already asked a variation of this but I couldn't find a clear answer beyond \"The one with a subject that you're passionate about,\" when I searched on the sub. Same spiel as my last post, I need some easier classes to take as I need to spend more time on math and stats stuff that I suck at and don't wanna deal with the WIDs in my discipline. They all have horrible reviews for the professors that are teaching them next semester; Does anyone have any ideas?",
    "comments": [
        {
            "level": 0,
            "comment": "STAT 2183 is pretty easy",
            "score": 6,
            "author": "Qweter1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!",
                    "score": 1,
                    "author": "Own-Employment368"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm taking MATH 2971W (basically how to write math proofs) right now. It isn't for everyone, but if you like abstract math, it's not that bad. For context, I'm currently taking ECON 2101, and that class is a lot harder.",
            "score": 2,
            "author": "diligentdev",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!",
                    "score": 1,
                    "author": "Own-Employment368"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk which semester its available but the intro to english lit woth ormond seavey is ridiculously easy. 6 1 page papers throughout. Skim the readings for the very occasional pop quiz and making a study guide for the final is super easy.",
            "score": 1,
            "author": "09141983",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!",
                    "score": 1,
                    "author": "Own-Employment368"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have any interest in theatre, History of Theatre 1 and/or 2 are pretty great for WIDs, and Prof. Ally Currin is absolutely fantastic. You'll already be writing anyway, so it's usually just one more paper/more in-depth papers than what the non-WID students do. The caveat is you will be asked to do some performing, but it's super chill and I never saw anyone in those classes who couldn't handle it. You'll also usually get paired with some theatre majors/minors for those performances so they take a lot of burden off.",
            "score": 1,
            "author": "DPSKitty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!",
                    "score": 1,
                    "author": "Own-Employment368"
                }
            ]
        }
    ]
}