{
    "id": "11wl9lm",
    "score": 6,
    "title": "How is the new dining hall? (Food)",
    "author": "Sea-Produce3709",
    "date": 1679324940.0,
    "url": "https://www.reddit.com/r/gwu/comments/11wl9lm",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Not great\n\nDecent value if you’re required to get a meal plan and just load up on food when you’re there (get enough food to go that you get two meals per swipe), but the food itself is basically an Applebees buffet",
            "score": 8,
            "author": "freeport_aidan"
        },
        {
            "level": 0,
            "comment": "I really like the food. It’s not 5 star restaurant, but better than 99% of other schools",
            "score": 1,
            "author": "Mobile_Equal_7167",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. I think a lot of my friends don't realize how good we have it. My twin brother at a different school complains about his food all the time, which is so much worse than our food. I get it, we're not UMass Amherst, but our food isn't that bad.",
                    "score": 2,
                    "author": "diligentdev"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Way better then most schools",
            "score": 1,
            "author": "randomassperson8788"
        },
        {
            "level": 0,
            "comment": "It depends on the day. Overall no matter where you go people will complain about the food.",
            "score": 1,
            "author": "Ghoulssuckmytoes"
        },
        {
            "level": 0,
            "comment": "Pelham commons on the Vern was good at first, then for some reason went downhill really really quickly",
            "score": 1,
            "author": "BritainsEmpire1"
        },
        {
            "level": 0,
            "comment": "If you have stomach problems - DO NOT EAT THERE. As someone who is severely lactose intolerant, I cannot eat anything from the dining hall because of cross contamination and cooking with butter and milk and NOT labeling it. \n\nI’m currently in the process of trying to get an appeal from the plans and it’s a fucking pain. There are a bunch of other people that have similar problems with other allergies/intolerances",
            "score": 1,
            "author": "P_ches"
        }
    ]
}