{
    "id": "11yv839",
    "score": 3,
    "title": "Questions!!",
    "author": "yungrowdytarentinod4",
    "date": 1679516251.0,
    "url": "https://www.reddit.com/r/gwu/comments/11yv839",
    "media_urls": [],
    "other_urls": [],
    "postText": "What level of interest do faculty place on supporting students and being accessible for guidance and mentorship?",
    "comments": [
        {
            "level": 0,
            "comment": "Are you talking about for undergrads or grad programs? The answer is going to vary greatly based on that and then from program to program",
            "score": 7,
            "author": "freeport_aidan"
        },
        {
            "level": 0,
            "comment": "On 1-10, 3.5",
            "score": 3,
            "author": "BritainsEmpire1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Staff are generally friendly, but don’t really help students out (ex: advisors)",
                    "score": 6,
                    "author": "BritainsEmpire1"
                },
                {
                    "level": 1,
                    "comment": "Why do you say so?",
                    "score": 1,
                    "author": "yungrowdytarentinod4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Varies from program to program as was said already. Had positive experiences for the most part myself.",
            "score": 2,
            "author": "RelocatedHumanity"
        },
        {
            "level": 0,
            "comment": "Huge variance within programs, departments, and individual profs. Some profs never knew my name, others are people I stay in contact and I consider mentors. Step 1 is to be a good student in their classes.",
            "score": 2,
            "author": "Spellchak"
        },
        {
            "level": 0,
            "comment": "Depends on program. Honors faculty are really great at having open office hours and being interested in supporting you. However not all faculty is like this. If your looking for support there are some services such as student coaching (where a graduate student meets with you weekly to give support and advice).",
            "score": 2,
            "author": "Ghoulssuckmytoes"
        },
        {
            "level": 0,
            "comment": "second what everyone is saying. varies greatly from school to school and department to department.",
            "score": 1,
            "author": "carolina_fujiy"
        }
    ]
}