{
    "id": "123zhzr",
    "score": 1,
    "title": "Is the Honors Program worth it?",
    "author": "dmrpuri",
    "date": 1679949327.0,
    "url": "https://www.reddit.com/r/gwu/comments/123zhzr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got accepted into the honors program but I have heard very mixed things about joining it. I am an undecided SEAS major who may switch out to do something like Psych or Economics. I like philosophy moderately. Is it worth it for graduate degrees or future employers?\nAlso is the vern and vex as unbearable as they say it is?",
    "comments": [
        {
            "level": 0,
            "comment": "No, it’s not worth it. I’ve heard nothing positive from those who went through it; my understanding is that it’s only advantageous for those who want to try a lot of different subjects and are very much undecided. If you have a plan of action - or if your goals include taking some intensive classes in your first year - it’s absolutely not for you.\n\nIt’s also likely to lower your GPA, and having a high GPA is worth far more than the Honors Program.",
            "score": 3,
            "author": "Slavaskii"
        },
        {
            "level": 0,
            "comment": "I have liked it so far, however I think it depends for you on a few factors. Since you’re SEAS you need to figure out if you have room to include honors courses over your four years, if you do not have as many requirements or are most likely going to transfer out I don’t think honors would be too much of a hardship. Your freshman year you would just take one extra class a semester (philosophy) and after that it’s four classes required classes distributed over 6 semesters. the science courses are substituted by the science courses of your major. i have enjoyed my classes and i think they’re nice when compared to some of the other gen ed options at gw, especially since the class sizes are smaller and the professors are generally more lenient or willing to work with you. \n\ni don’t think honors is worth much of anything to employers, but i think it’s a good experience. you’ll make more friends through the program bc you’re all forced to live together, so it’s good in that sense vs the rest of the school struggles a bit more bc of how independent everyone here is. you’ll also have a single room in a suite of 4 people and the dorm you’d be in is very new, has a gym and a dining hall as well. i truly do not think the vex is a great hardship, it’s kind of annoying but i think a lot of it depends on how flexible you are and if you can manage your time. it will be ridiculously late sometimes and that’s definitely not great but that happened pretty rarely, you should generally try and leave for classes early and not postpone to the last minute. the vern is nice, you’re just further from campus which can make it more inconvenient to go out, do extracurriculares, etc.\n\na big benefit of honors is also early registration, which is super helpful at gw since a lot of people are not able to get the classes they want during regular registration. \n\noverall, yes i like it, but it’s not gonna make your break your career and there are drawbacks depending on what u prioritize. i would recommend touring and seeing everything kind of play out and if you feel it’s compatible w what u want out of college. feel free to dm me if u have more questions! i’m a science major so i understand balancing honors classes w those requirements.",
            "score": 3,
            "author": "fruitmonster_"
        }
    ]
}