{
    "id": "1248m28",
    "score": 5,
    "title": "Questions about GWU",
    "author": "please-send-hugs",
    "date": 1679967873.0,
    "url": "https://www.reddit.com/r/gwu/comments/1248m28",
    "media_urls": [],
    "other_urls": [],
    "postText": "1) How good is George Washington university for computer science? Anyone have any experience in their programs?\n\n2) How hard is it to secure a single dorm as a freshman?\n\n3) How’s the party life there? And how’s the work/free time balance?\n\nI got into Pittsburgh and GWU. GWU I got a 30k scholarship for but Pittsburgh is still cheaper. Now I have to decide.",
    "comments": [
        {
            "level": 0,
            "comment": "can't speak to CS\n\n2. as far as I know, getting a mitchell single isn't that hard. I don't remember if there are actual singles on the Vern on just suite style apartments with big living rooms. Mitchell might also be turning into upperclassman housing, so fact check that?\n\n3. I've loved my time at GW but you're not going to have the traditional 'tailgate and basketball game' experience you'll get at a bigger school. I personally really enjoy the social scene being super integrated into the city, social life is largely centered around off campus parties hosted by club sports, professional fraternities, student orgs, and (less so) social fraternities.\n\nas for work/life balance, not sure about SEAS but I'm in elliott and I've never had trouble managing school and either interning or working every semester. \r  \n\n\na few links i'd recommend checking out:\r  \n\r  \nhttps://www.reddit.com/r/gwu/comments/11ychl3/what\\_is\\_the\\_party\\_scene\\_in\\_gwu/\r  \n\r  \nhttps://www.reddit.com/r/ApplyingToCollege/comments/ma3qgu/deleted\\_by\\_user/\r  \n\r  \nhttps://www.reddit.com/r/ApplyingToCollege/comments/qpggoz/deleted\\_by\\_user/\r  \n\r  \nhttps://www.reddit.com/r/ApplyingToCollege/comments/11ji4vq/comment/jb5gbjj/?context=999",
            "score": 3,
            "author": "freeport_aidan",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is all correct. The only thing I will add is getting a single might be a bit more difficult as they have now made Mitchell open to everyone (all grades) so I am not sure how this will affect availability of singles.",
                    "score": 1,
                    "author": "Ghoulssuckmytoes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really need to make sure I can get a single as if my roommate snores (or makes any sound at all really), I will be unable to sleep due to misophonia (and I’d prefer not to have to wear earbuds every single night. What if I forget to charge them?)\n\nI’m going to try and confirm if I’ll be able to get one before committing. Thank you for the heads up.",
                            "score": 1,
                            "author": "please-send-hugs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unless you can get a disability accommodation, there is no way they will be able to ensure you will get a single before committing. There are very few singles on campus and a majority of them are reserved for students with disabilities.",
                                    "score": 3,
                                    "author": "AnthoZero",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just called them and apparently that’s handled mid May when they start with housing arrangements. I do have a diagnosis for autism so hopefully I can get a dss and reserve a solo.",
                                            "score": 1,
                                            "author": "please-send-hugs",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Makes sense. Just a heads up, you will need a diagnosis letter that specifically states why your diagnosis requires housing accommodations.",
                                                    "score": 1,
                                                    "author": "AnthoZero",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That would be difficult, my diagnosis was from when I was maybe 5. I don’t even know how I’d go about getting that letter. My high school made accommodations based off my IEP.",
                                                            "score": 1,
                                                            "author": "please-send-hugs",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You would have to get another diagnosis letter. Your high school accommodations don’t carry over.",
                                                                    "score": 1,
                                                                    "author": "AnthoZero",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I’m going to schedule an appt with my regular doctor to see if he can get that letter. I don’t have contact with the therapist who originally diagnosed me anymore and going to get ANOTHER diagnosis sounds like a real pain if even possible. I think my regular doc should have my diagnosis in my chart.",
                                                                            "score": 1,
                                                                            "author": "please-send-hugs"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Without a dss (only way to ensure you get a single) you should try to shoot for west hall. That’s the only dorm that would have kinda what your looking for but it is on the Vern",
                                    "score": 1,
                                    "author": "Ghoulssuckmytoes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you. I do have a diagnosis for autism so I might be able to procure a dss, though it makes me uncomfortable that I have to commit then attempt and might get stuck without one if things go south.",
                                            "score": 1,
                                            "author": "please-send-hugs",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I totally get that. I’m currently working on getting approved and it is a nightmare",
                                                    "score": 1,
                                                    "author": "Ghoulssuckmytoes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Could you please elaborate on why the process is a nightmare?",
                                                            "score": 1,
                                                            "author": "please-send-hugs",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m trying to get it for my anxiety (been diagnosed 10+ years, on several meds, etc.) and I keep having to provide more documentation before they will approve me (3rd doctors letter). It’s been a nightmare as I have met with the lady twice (first time had to wait several weeks) and she told me what I needed and then would change her mind later. The process for me so far has taken over a month and I’m still not approved. I also during the meeting have answered their questions but still have to get a doctors note confirming my answers (which are things like how I feel when I’m having a panic attack, which only I would really know)",
                                                                    "score": 1,
                                                                    "author": "Ghoulssuckmytoes",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yikes. I don’t even go to a therapist anymore, I don’t know how that would work. I can’t attend if disability accommodations are going to be that difficult. I’ll look into it. I wish you luck on getting your accommodations!",
                                                                            "score": 1,
                                                                            "author": "please-send-hugs",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thank you! You don’t necessarily need a therapist for accommodation (doctor or psychiatrist will do). Wishing you the best of luck!",
                                                                                    "score": 1,
                                                                                    "author": "Ghoulssuckmytoes",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "When you say Pittsburgh do you mean University of Pittsburgh btw? I have a sister who goes there that I can ask about how things work there if you would like!",
                                                                                    "score": 1,
                                                                                    "author": "Ghoulssuckmytoes"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "With autism you may be able to get the accommodations but you have to prove why you need a single or explain what will occur if you don’t have one.",
                                                                    "score": 1,
                                                                    "author": "Ghoulssuckmytoes"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for the info! I plan on touring them soon so hopefully I can get more information about dorms there. Definitely need to find more about computer science though.\n\nAbout the social aspect: I was also accepted to Haverford but the reason I may not be going there is because it’s a &lt;4k student population school around half an hour from Philly. It’s pretty isolated. Im afraid that it will become high school 2.0 where I get stuck with a reputation that spreads around my grade level since grades are less than 1000 each. I really want to meet new people and explore myself without worrying about judgements.\n\nSince GWU is 10k students, do you think that this wont be an issue?",
                    "score": 1,
                    "author": "please-send-hugs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think it’ll be as much of an issue at GW. If you don’t put yourself out there, you can definitely struggle, but there are also so many people here that it’s hard not to find people that share some of your interests",
                            "score": 1,
                            "author": "freeport_aidan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, thank you!",
                                    "score": 1,
                                    "author": "please-send-hugs"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "GWU’s CS program is fine, nothing special but nothing bad either. At the end of the day, it’s pretty comparable to your state school, so in my opinion it’s not worth paying a lot more for GWU. If cost is comparable, pick the one you think you’d enjoy the most",
            "score": 2,
            "author": "ggrnw27",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t want to go to Pittsburgh to be honest and the scholarship I got at GW is actually really good, so as long as the CS program is fine I might select here.",
                    "score": 1,
                    "author": "please-send-hugs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. i think gwu is ranked like 74 for comp sci grad school lmao. but ik a lot of ppl in it. a lot of diff websites say diff things but its not like a computer science school for sure. most rankings say top 50 or smth.\n2. single dorms are not impossible to secure, there's an entire building of just singles in Mitchell and then singles in thurston as well. the vern also has suites with singles. you could try to register with dss to secure a single\n3. party life = clubs and bars if you have a fke, and crappy frat parties so its not huge but you can find parties. work free time balance depends on your major so I'm poli sci and I have a lot of time but idk about comp sci.",
            "score": 2,
            "author": "Mediocre_Kale711",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. Gotcha, thank you. I’m going to visit it and see if I can ask people for their personal experience.\n2. I’m going to try and get a dss. I have a diagnosis for autism so hopefully it shouldn’t be terribly difficult. I’m a little worried that I have to commit first then attempt to get one later so hopefully that goes well.\n3. Gotcha. I’ll have to ask someone with that major when I’m there. Thanks!",
                    "score": 1,
                    "author": "please-send-hugs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you def have to commit before you officially get one just bc like you wont have an id number but with a diagnosis for autism I don't think its gonna be hard they are pretty generous with it like my friend is half deaf and got it and some people get it for anxiety, but you definitely could call and say that its a factor in your decision and ask about the likelihood of getting a single.",
                            "score": 1,
                            "author": "Mediocre_Kale711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m going to contact my doctor and see if he has the power to write the note I need. I don’t have the therapist anymore who originally diagnosed me but my diagnosis may be in my chart.\n\nAlso, I did call them and they said that housing arrangements doesn’t happen until mid May. I think if I can assuredly get a DSS, it would probably be a guarantee but I don’t think the person over the phone has more information than that.",
                                    "score": 1,
                                    "author": "please-send-hugs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i still think youd have a good shot at getting a single in Mitchell without dss even, nobody ranks Mitchell first",
                                            "score": 1,
                                            "author": "Mediocre_Kale711",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why does nobody want Mitchell?",
                                                    "score": 1,
                                                    "author": "please-send-hugs",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i mean not nobody but most ppl there did not want it, its in a bad spot and is very old with full communal bathrooms.",
                                                            "score": 1,
                                                            "author": "Mediocre_Kale711",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What’s wrong with communal bathrooms? Don’t most college dorms have those, especially for underclassmen?",
                                                                    "score": 1,
                                                                    "author": "please-send-hugs",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "i mean nothing is wrong w them and yes most colleges have them but not gwu. most dorms at gw are suite style with private bathrooms. Thurston has communal style bathrooms but they are stalls with a toilet sink and shower so it is not as public as somewhere like Mitchell. potomac, madison, LaFayette, all the vern dorms etc are all private bathrooms\n\n you can do a 3d tour of every dorm through gw at\n\n[https://living.gwu.edu/residence-halls](https://living.gwu.edu/residence-halls)",
                                                                            "score": 1,
                                                                            "author": "Mediocre_Kale711",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Very useful link, thank you!",
                                                                                    "score": 1,
                                                                                    "author": "please-send-hugs"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A DSS accommodation is going to be the only way to guarantee a single room, and your letter from your medical professional needs to specifically address why you would need a single room for your autism. I'm not sure if just being worried about your roommate snoring and  remembering to charge your earplugs will be a valid enough reason to grant a single, but with a diagnosis on your record and a helpful medical professional they will probably be able to find a way to make it work. Good luck!",
            "score": 1,
            "author": "Calm_Farmer_3061",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I’m contacting my check up doctor to see if I can get such a note as I don’t have contact with the therapist who originally diagnosed it. Hopefully he can help me or GWU is probably not an option sadly (as Haverford would be more accommodating). \n\nAnd I worded it nicely on the post, but hearing misophonia triggers feels worse than nails on a chalkboard. And when the trigger is sharp breathing and sniffling, it’s constant. I can’t go anywhere without earbuds. The sounds make me scratch at my arms because the pain diverts my attention, and I’ve been accused of self harm because of it as it can get really bad. Taking vacations is not fun as my brother snores, earplugs are not enough, and earbuds are uncomfortable since I sleep on my side. If I had to hear it at night every night for a year, I would probably go insane.\n\nHearing is also my best sense, so it gets really bad in a classroom with 30 other kids when I can’t wear earbuds. My school made accommodations for this reason so that I can wear earbuds at all times. Sucks when it’s hard to hear lessons but it’s better than the alternative.\n\nA roommate is definitely not an option. I have to always fall asleep before them or use my earbuds every night (which if they aren’t charged, or they break on me, just makes complications). \n\n(As someone who notices this stuff a lot, fun fact: guys are way louder with breathing and yawning sounds, but sniffling is the same between guys and girls. Always outliers though, definitely girls that make just as much noise. Just what I picked up on lol)",
                    "score": 1,
                    "author": "please-send-hugs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If a classroom of 30 is too much for your hearing might want to consider the smaller school option instead. It’s rare to have a class smaller than 30 people here. And I know what misophonia is but because it isn’t professionally diagnosable it probably wouldn’t work for getting an accommodation specifically from a medical provider, but the autism accommodation could maybe note it? Just noting that misophonia alone wouldn’t really cut it from what I can tell.",
                            "score": 1,
                            "author": "Calm_Farmer_3061",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can put earbuds in and so long as the professor is loud, I can keep the white noise just loud enough to block out sounds but just quiet enough to hear the professor. If the professor gets quiet, then I’m kinda screwed..\n\nAlso, the autism diagnosis can give me leverage I’d reckon cause of sensory issues.",
                                    "score": 1,
                                    "author": "please-send-hugs"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First of all, congratulations on your acceptances into both GW and Pitt. To get into schools like those requires significant work and dedication and you will do well with either choice you make.\n\nI go to GW and what I’ll say is it’s an acquired taste. There are some great opportunities, being in D.C. means you have loads of access to internships and other things happening in the city. The academics here are also as good as anywhere else. \n\nThat being said, GW students are very individualistic and I find it a bit lonely on campus at times. It is a bit cold and brutalist and I find people like to stick to their small group of friends. \n\nAs for your major, GW has a fairly newly developed STEM program that will place you well. I do think though that PITT has better STEM programs than we do. \n\nMy overall take: If you really like DC and you’d like to score some internships down the road, GW will place you well. But beware that GW appeals to a specific kind of student, and if you’re not that then it can be a tricky place to spend your four years at.",
            "score": 1,
            "author": "HelpfulChemist2351"
        }
    ]
}