{
    "id": "12hajap",
    "score": 3,
    "title": "any info on Guthridge?",
    "author": "jsuisj",
    "date": 1681110946.0,
    "url": "https://www.reddit.com/r/gwu/comments/12hajap",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm looking at first year student housing options and Guthridge was remodeled this year so all I can see is \"new room types coming soon\". Anyone know anything about Guthridge room types and if it's even a freshman option? Just trying to get a better sense of what my options really are. Thanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "Potomac is great. I live here now. I’d say put Potomac first, Guthridge second, thurston 3, madison 4.",
            "score": 2,
            "author": "Mobile_Equal_7167",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you :) im planning on putting potomac, madison, and guthridge (edit: and lafayette too) pretty high up but out of all the foggy dorms im putting thurston and mitchell last mainly because of location and communal bathrooms.",
                    "score": 2,
                    "author": "jsuisj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thurston and Potomac are right near eachother. Id say thurston and Potomac are the best location. Go Potomac -1, Guthridge -2, madison -3, Lafayette -4, Thurston -5, Mitchell -6 and all Vern last",
                            "score": 2,
                            "author": "Mobile_Equal_7167",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "not a fan of thurstons location actually, its proximity to the center of campus isn't great which is why i'm opting for madison and lafayette at the top of the list with guthridge and potomac below them. all vern will be last (of course lmao) but of my foggy bottom choices i'm def putting thurston last because of the bathroom situation.",
                                    "score": 1,
                                    "author": "jsuisj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As a freshman, being as close to south square as possible is the best way to make friends. Mitchell, thurston, Guthridge, and Potomac are all in south square and all my the ppl I’ve met that live in Madison and Lafayette have had a harder time making friends",
                                            "score": 1,
                                            "author": "Mobile_Equal_7167",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "my man, i gave you my reasons and i understand that thurston is easiest for finding friends. i hear you, i really do. however i am willing to put in the extra effort to make friends if i end up at madison or lafayette in exchange for a non communal bathroom and avoiding the risk of being put in a single. i understand that you may think south square is far superior but we all have our priorities and mine differ from yours. i appreciate the input but youre being incredibly pushy and it's not helping. thank you.",
                                                    "score": 0,
                                                    "author": "jsuisj",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Being pushy lol. I’m just trying to help. Calm down. It’s gonna be ok. Sometimes people will tell you things you might not want to hear. I gave you my ranking, then explained it. I dont think that’s pushy at all. You are an incoming freshman and no nothing about living on campus. Don’t ask for help if you don’t want it",
                                                            "score": 1,
                                                            "author": "Mobile_Equal_7167"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "gutheridge has been an upperclassman dorm until this upcoming year and has offered one bedroom, two person dorms, studio two person dorms and singles. from what i remember it is being remodeled to remove all the kitchens from the individual dorms and create community kitchens instead.",
            "score": 1,
            "author": "Which_Fee1502",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for the reply!!",
                    "score": 1,
                    "author": "jsuisj"
                }
            ]
        }
    ]
}