{
    "id": "13av21j",
    "score": 4,
    "title": "UW 1020 Experiences?",
    "author": "aceofspaece",
    "date": 1683476297.0,
    "url": "https://www.reddit.com/r/gwu/comments/13av21j",
    "media_urls": [],
    "other_urls": [],
    "postText": "What are your experiences with UW 1020, the themed writing course that many GW students take in their first year? Was your theme memorable?",
    "comments": [
        {
            "level": 0,
            "comment": "Either one that pollack teaches! You don’t have to have any prior knowledge in art history but it was a super interesting class. There is a lot of writing involved (which is the truth with all UWs) but she is very generous with grading and lenient with extensions. She is deeply passionate and knowledgeable on the subject and I highly recommend her because she is just a great woman!",
            "score": 4,
            "author": "deenerneener"
        },
        {
            "level": 0,
            "comment": "I had writing about romcoms with Dr. Smith. One of the best classes I’ve taken throughout my entire time at GW, she’s the goat",
            "score": 6,
            "author": "freeport_aidan",
            "replies": [
                {
                    "level": 1,
                    "comment": "She does grade based on work quality rather than on completion (unlike most UW professors!). Otherwise, she’s an incredible professor.",
                    "score": 1,
                    "author": "eliserows",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some grade only based on completion? For real? Haha",
                            "score": 3,
                            "author": "aceofspaece",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha- yes. From what I’ve heard most of them so- make sure to check Rate My Prof!",
                                    "score": 1,
                                    "author": "eliserows"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Writing more than human worlds with Krishna is an amazing experience that requires very little work and is so broad you can write about paranormal activities to AI to LSD",
            "score": 2,
            "author": "ognir-rrats",
            "replies": [
                {
                    "level": 1,
                    "comment": "CANNOT STRESS THIS ENOUGH PLUS IF YOU DO WELL SHE WILL REWARD YOU (by nominating u to the eckles prize or putting you in UW conferences). She also basically grades on completion.",
                    "score": 1,
                    "author": "Aromatic-Guess-1812"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i had the racism in archaeology one with prof quave! so so amazing, learned a lot, very easy, became a better writer, flexible/caring prof, and mostly graded on completion. and def a memorable theme especially if your interested in the topic.",
            "score": 1,
            "author": "Leather-Bookkeeper66"
        }
    ]
}