{
    "id": "13b0ijb",
    "score": 5,
    "title": "HELP: Which dorms are the best?",
    "author": "Kay_jay_whi",
    "date": 1683488495.0,
    "url": "https://www.reddit.com/r/gwu/comments/13b0ijb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title pretty much sums it up. Been doing some research in order to figure out how I should rank my preferences for where I want to house. Unfortunately, most of the information on the web and on this subreddit seems relatively outdated by several years, and by asking again here I'm hoping that I can get some fresher takes and new perspectives.\n\nFrom what I've gathered, below is a list of all the possible first-year residence halls: \n\n&gt;Building JJ, District House\\*\\*, Guthridge Hall, Lafayette Hall, Madison Hall, Mitchell Hall, Potomac House, Thurston Hall, and the Vern (which includes Clark, Cole, Hensley, Merriweather, Somers, and West).\n\nI've already talked to a couple of students and the consensus seems to be that Thurston is #1 and anything on the Vern is less than ideal (I wasn't planning on going there anyway because of my major, so eh). Do these statements hold true? \n\n**TLDR: For incoming freshmen, which residence halls would you recommend just in terms of quality and convenience? How would you rank them?**\n\n&amp;#x200B;\n\n\\*\\*District House is advertised as affinity spaces only. Are those worth it, and how do they work?",
    "comments": [
        {
            "level": 0,
            "comment": "I lived in Thurston this year and definitely enjoyed it. The community spaces and dining hall in the basement make it invaluable. You can get over the bathrooms, I promise.",
            "score": 4,
            "author": "snubilehawks"
        },
        {
            "level": 0,
            "comment": "I live in thurston and like it!! The only con is bathrooms, but I try to shower right after they get cleaned (which is pretty frequently janitorial staff is so slay). It’s new and easy to met people here when you first move it. It’s also nice to be able to get food in my pjs and bring it up to my room. Sad to move out in a couple days 🥲",
            "score": 4,
            "author": "Leather-Bookkeeper66"
        },
        {
            "level": 0,
            "comment": "“Best” depends on what you want. TLDR, I’d go for JJ\n\nThe Vern dorms are probably “nicer” on average than the foggy dorms. But being on the Vern sucks \n\nMitchell is great if you want a single. But the building isn’t great and the social scene in the building is very hot or miss \n\nI was in Fulbright freshman year and love it because we had a private kitchen and bath in every room. Fulbright is no longer a freshman dorm, but I believe that JJ is the closest thing available. If I were to redo freshman year, I’d probably want JJ\n\nThurston in brand new, but do you want to share a bathroom with 30 people? \n\nPotomac and Madison both have good locations. Potomac is just doubles, Madison has a little bit of everything. I would guess that now that thurston sixes are gone, a huge chunk of freshman parties happen in Madison sixes, but that’s a shot in the dark \n\nAs for the affinities, you basically just live on your own floor with like 10 people. The upperclassmen affinities are themed, the freshman one is just you and a bunch of other random people (I think they’re like 10-12 people but idk for sure). They’re gonna have the most space, but I think that the freshman affinities are new this year so idk what the vibe is like socially",
            "score": 7,
            "author": "freeport_aidan"
        },
        {
            "level": 0,
            "comment": "west. it’s on the vern which is inconvenient since most of your classes would be on foggy. you get your own room, a living area and a bathroom. there’s a gym, mailing services, dining hall (but the food is usually horrible compared to the others on foggy). i live there rn and i love it.",
            "score": -2,
            "author": "Enough_Juice142"
        },
        {
            "level": 0,
            "comment": "hey i wanted to add that district is actually not a first year option for the upcoming year. i emailed and asked about it and they said it's not an option for freshman this year which sucks but yeah the first year housing page lists it even tho it's not an option",
            "score": 1,
            "author": "Foreign_Gas4900"
        },
        {
            "level": 0,
            "comment": "Potomac -1, Guthridge -2, madison -3, Lafayette -4, Thurston -5, Mitchell -6 and all Vern last.\nI’ve seen the plans for the Guthridge renovation and it should be very nice and is transferring to a freshman dorm. Thurston is only so low due to communal restrooms and small bedrooms so if that doesn’t bother you then it could move up.",
            "score": 1,
            "author": "Mobile_Equal_7167",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think Guthridge will have quads?",
                    "score": 1,
                    "author": "rosepetaalss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nvm it’s gonna be majority quads",
                            "score": 1,
                            "author": "rosepetaalss"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived in JJ first year and in the Dakota my second, which I heard they’ve opened to freshman this upcoming year. U can msg me if u have any q’s!",
            "score": 1,
            "author": "xoxoxo_444"
        }
    ]
}