{
    "id": "13e5riy",
    "score": 5,
    "title": "Gyms around GW?",
    "author": "AdSavings4915",
    "date": 1683758490.0,
    "url": "https://www.reddit.com/r/gwu/comments/13e5riy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are there any gyms in walking distance from campus like at all? Or on campus with decent equipment\n\nEdit: thanks everyone for your responses. Coming for graduate school in the fall n just trying to get setup. Much appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "There's a few in the Dupont area and the closest one to campus is Equinox on 23rd and M.\n\nThat said, the University's HellWell is very good and better than any 3rd party option (unless you like steam rooms), and all students have access to it.  Is it still under renovation?",
            "score": 4,
            "author": "shockage",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, it’s back open. Hours are wonk, but it’s open",
                    "score": 2,
                    "author": "freeport_aidan"
                },
                {
                    "level": 1,
                    "comment": "Will try the University’s Gym",
                    "score": 1,
                    "author": "Savings_Ganache_33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you not like the Lerner Health and Wellness center gym? What type of fitness are you into? They have several CrossFit gyms, and a Golds Gym that’s not too far if the Learner Health and Wellness center doesn’t do it for you.",
            "score": 3,
            "author": "GiraffeOk7804",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like Olympic lifting and powerlifting a lot, so for me sometimes Lerner just didn’t do it. What I really didn’t like is that they don’t have any weight lifting platforms where you can drop the weights. They don’t have any rubber plates there, it’s so lame.",
                    "score": 2,
                    "author": "GiraffeOk7804"
                },
                {
                    "level": 1,
                    "comment": "Yeah I'm not super strong, I just need free weight/ dumbbells and barbells to be available at this point for compound lifts",
                    "score": 1,
                    "author": "AdSavings4915",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh then just use the university gym Lerner Health and Wellness. It has all that and a pool, and track. It’s free for students.",
                            "score": 3,
                            "author": "GiraffeOk7804"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Highly recommend golds in Rosslyn, it’s right on top of the metro stop so it’s super convenient. Also has much more equipment than most of the other gyms around GW (as in the reasonably priced ones).",
            "score": 3,
            "author": "zbeast300"
        },
        {
            "level": 0,
            "comment": "Good responses thus far, also a Planet fitness is located at 7th and H",
            "score": 1,
            "author": "njzebra_stripes"
        },
        {
            "level": 0,
            "comment": "Balance Gym",
            "score": 1,
            "author": "SnooDoggos8540",
            "replies": [
                {
                    "level": 1,
                    "comment": "second this, can't be too bad if its under Fairmont lol",
                    "score": 1,
                    "author": "thebotj"
                }
            ]
        }
    ]
}