{
    "id": "13y3ar2",
    "score": 3,
    "title": "Archeo/Anthro Programs?",
    "author": "Responsible_Debt_260",
    "date": 1685681332.0,
    "url": "https://www.reddit.com/r/gwu/comments/13y3ar2",
    "media_urls": [],
    "other_urls": [],
    "postText": "How “good” are they? I’m hoping to land internships/jobs with the Smithsonian and/or other museums, and these subjects have interested me for a while. If anyone is currently in either (or both) programs please lmk what you think!",
    "comments": [
        {
            "level": 0,
            "comment": "I was in the Arch program as a minor. We have really impressive and famous faculty in both Arch and general Anth (especially Bio Anth). GW is also home to the Alpha Chapter of Delta Iota Gamma (DIG), the Anth/Arch pre-professional fraternity. There are also great opportunities with internships and jobs. For example I had a long-term job with The Textile Museum where I actually worked with ancient artifacts.\n\nEdit: To add, there are a lot of students in both programs, particularly Bio Anth, and all the students generally know each other due to class sizes (medium to small) and because most majors are in DIG.",
            "score": 3,
            "author": "LegitimateDriver101"
        },
        {
            "level": 0,
            "comment": "I’m not in either but I have seen FWS jobs posted before for jobs in the Smithsonian. I believe the one I saw involved helping with the creation of a new exhibit",
            "score": 1,
            "author": "Ghoulssuckmytoes"
        },
        {
            "level": 0,
            "comment": "my second major is bio anth - really great program, just limited class options for major requirements each semester, though i think socio anth and arch have greater offerings. class sizes are super small and all the professors across the anth department are very well connected and always willing to help out their students",
            "score": 1,
            "author": "mky74747474"
        }
    ]
}