{
    "id": "xaexvw",
    "score": 15,
    "title": "Are you happy you decided to go to GW?",
    "author": "Life_Distribution403",
    "date": 1662780894.0,
    "url": "https://www.reddit.com/r/gwu/comments/xaexvw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am applying to GW and it is very likely I go there because I will receive a discounted free tuition at this school. So, in short, are you happy you went/go here, and should I be excited? Also, what are the people, food, dating, housing, social scene, etc. like? Thanks so much!",
    "comments": [
        {
            "level": 0,
            "comment": "Yes; I went as well due to scholarships.  It's a very good school.  The professors are top notch.   \n In the past the administration did shoot itself in the foot by misrepresenting values used to calculate ratings.\n\nIf you're planning to go to medical school, and not exceptionally strong in sciences with AP credits to place out of the joke weed-out intro courses, I would avoid it.  I had colleagues who were barely passing get straight As in Drexel after transferring.",
            "score": 9,
            "author": "shockage"
        },
        {
            "level": 0,
            "comment": "Just got here. So happy. Smart students, great food, great professors.\n\nAlso, that moment when you’re standing at the Washington memorial at 2am, makes you appreciate the choice even more",
            "score": 29,
            "author": "Mobile_Equal_7167",
            "replies": [
                {
                    "level": 1,
                    "comment": "gwu is my top school! could i pm you about stats or ur application if possible? i really wanna go but i don’t know how generous they are with financial or merit aid :(",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah totally",
                            "score": 2,
                            "author": "Mobile_Equal_7167"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "211 days later, does your opinion about GW still stand?",
                    "score": 1,
                    "author": "Comfortable-Fun5419"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes! A very weird school but weird in a good way. You won’t get the college football games or giant parties other schools offer, and tbh I do wish I had those sometimes, but far more often Im thankful for the weird and wacky people I met here and can only meet here.",
            "score": 20,
            "author": "gamer_bread"
        },
        {
            "level": 0,
            "comment": "I am really happy to be here. I think anything that people hate or dislike or have gripes with against the school is a systemic issue that will be found in virtually any other elite or simply ANY university in this country (moldy dorms , entitled kids, Title IX sucking, the list goes on) but depending on what you’re studying I found the people i am around with my major are so passionate about what they do and i love it (public health and slhs)",
            "score": 7,
            "author": "dariakayb"
        },
        {
            "level": 0,
            "comment": "I graduated 20 years ago (yikes) so YMMV, but it came down to American vs GW for me and I have to say I’m glad I went to GW, largely because of the opportunities outside the classroom. \n\nMy junior year I was the mascot, was interning at the Senate, was working part time for the Wizards and had a professor who worked at the State Department. I also managed a 2.67 GPA that second semester, so while you may have a ton of opportunities, don’t spread yourself too thin.",
            "score": 4,
            "author": "InLikeErrolFlynn"
        },
        {
            "level": 0,
            "comment": "I went as an adult So YMMV, but Ioved it. However, it really is what you make of it. The professors are top notch and generally want to help people who reach out. I made many amazing connections through just going the extra mile and asking them for help, and it REALLY has paid off professionally. So, if you want to just get a degree and show up, it probably isn’t the school for you at such a high cost (even with aid). If you want to make use of the faculty, and the proximity to downtown DC to build I future in some form of government, NGO, or lobbying, then it is an amazing school if you put in the work.\n\nAlso, again, this comes from someone who attended as a 25 y/o, but I generally really liked the student body. They were smart, interesting, and fairly diverse in experience and personality, but all fairly nice and pretty regular. Again, I never lived on campus or did dorm life, but this was my general finding in class interactions. Personally, of the schools in the area, I found through my interactions that (most) Georgetown kids were absolutely INSUFFERABLE to be around, (most) American kids were just kind of…strange? Might be the word, and George Mason kids were generally awesome people to be around and talk to, but the campus is just so much further out from DC and if point 1 I made is important to you, then it isn’t the school for you.\n\nAgain, take ALL of this with a grain of salt. I went as a 25 year old and never had the ”traditional” college experience, but overall I loved GW, I found the students to be good people for the most part, and the faculty connections really paid off for me professionally. Would recommend if the financial aid is generous enough and you make the effort.",
            "score": 3,
            "author": "_Precht_"
        },
        {
            "level": 0,
            "comment": "love this school so much tbh",
            "score": 3,
            "author": "Hot-Scallion-7926"
        },
        {
            "level": 0,
            "comment": "Depends on your major, GW is definitely stronger on the political and business side of education (also more opportunities). My friends in STEM like CS and engineering don’t really like the curriculums because it’s not well planned but at least the advisors are good. \n\nAs for friends, be prepared to stand your ground and meet some very annoying people . You just gotta dig through and find people you connect with well, and when you do it’s very very rewarding.",
            "score": 3,
            "author": "ChanceMango9"
        },
        {
            "level": 0,
            "comment": "Going back I would have probably chosen somewhere different. Generally speaking, GW’s MAIN positive is it’s proximity to the national mall, which was amazing. Otherwise, there were many things that made me really dislike GW, one being the student body. It’s hard to find someone genuinely down to earth and I experienced some mild bullying my freshman year which threw me off for the rest. If you want the proximity to the national mall, go to GW, but otherwise there’s NOTHING GW has that another school doesn’t do better. It’s been consistently falling in the rankings and after a horrible President a lot has been left to be desired. I would have chosen NYU if I could go back.\n\nAlso, they treat their undergrads like shit and definitely care more about their grad students.",
            "score": 17,
            "author": "AnthoZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Going to +1 this one as someone who transferred out--GW attracts a lot of people whose life goals at 17 are to go into politics. This is a very specific type of person, not a type I get along with well. GW definitely has its positives! But it was not the school for me.",
                    "score": 7,
                    "author": "nizzy090"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a dissenting voice, I didn't enjoy the school or atmosphere. Their graduate programs are very lack luster, and their staffing for Computer Science left me a bit disappointed. If the city is your thing, then its probably great, but I was too used to the Midwest. The curriculum quality for CS (can't speak on others), was very underdeveloped and were worse than I expected.",
            "score": 4,
            "author": "HalfQuarter1250"
        },
        {
            "level": 0,
            "comment": "Yes. Come.",
            "score": 4,
            "author": "twiste18201"
        },
        {
            "level": 0,
            "comment": "I would say yes. It’s close to home since I live in DC. You can PM me about stats, but honestly I think I got in because of the fact I’m a resident and they probably wanted to boost up the percentage of people that actually from a DC high school, but, hey, that’s my theory",
            "score": 1,
            "author": "catholicgwustudent"
        },
        {
            "level": 0,
            "comment": "It’s a mixed bag, I’ve enjoyed some things but hated others. I came in undecided about my major which was a mistake because I took so long to figure it out. My advice is that GW is great if you know what you’re gonna study and take advantage of all the internships while you’re there. If you don’t have that then it’s a waste of money tbh.",
            "score": 1,
            "author": "Main_Sky_3047"
        }
    ]
}