{
    "id": "xhkd2e",
    "score": 21,
    "title": "Why is GW ranked so low?",
    "author": "aaronburrrrr",
    "date": 1663516704.0,
    "url": "https://www.reddit.com/r/gwu/comments/xhkd2e",
    "media_urls": [],
    "other_urls": [],
    "postText": "\\#61 seems super low for the caliber of the school",
    "comments": [
        {
            "level": 0,
            "comment": "The ranking criteria is usually bizarre and not actually reflective of what the student experience will be and outcomes after graduation. [20% of the US News ranking goes to something called a “peer survey”](https://www.usnews.com/education/best-colleges/articles/ranking-criteria-and-weights), while things like percentage of faculty that is full time is 1%, and so is student-faculty ratio (which I *personally* think matter more). The criteria doesn’t even include things like research output, diversity, average salary after graduation, etc. These are private companies creating rankings to pull ad revenue and unfortunately people decide which schools they apply for / attend based off of these rankings. This doesn’t mean there aren’t ways for GW to improve, but I don’t think improving in order to raise the spot in the rankings will actually improve the quality of the university and the student experience.",
            "score": 27,
            "author": "AnthoZero"
        },
        {
            "level": 0,
            "comment": "The fact that there’s a 7-way tie for 55th (immediately above us) and then a 4-way tie for 51st (and then ties pretty much straight through to 35th) doesn’t help us. Small increases in our scores could pretty easily result in big jumps in our ranking \n\nAs a general point, many of the areas GW excels in aren’t particularly valued by the USNews methodology (internships, our strength in IA/polisci [due to lower starting salaries], internships again because Jesus Christ we have so many opportunities, part time faculty here being a major PLUS rather than the problem it is in many places, among others) \n\nJust going through the USNews methodology and looking at their big points: \n\n*6 year graduation rate and freshman retention*: GW is expensive and many people ultimately aren’t able to justify the cost of staying. I doubt that I would have stayed had COVID not brought my COA down massively during the pandemic. There’s also what feels like a big contingent of people who are still sad about not getting into Georgetown and try to transfer (at least in elliott) \n\nPeer assessment: GW’s always going to be second fiddle to Georgetown, and I would guess that much of what USNews undervalues is also undervalued by peer schools and faculty \n\nFaculty resources: I don’t really care how big my classes are or if my profs have PhDs. I just want smart and accomplished people. When you’re in DC right next to State and the heart of government, that means a lot of part time faculty. I think that’s great, USNews probably doesn’t \n\nSelectivity: this is what LeBlanc was trying to push (smaller class sizes and a focus on STEM, which would likely increase SAT score ranges and starting salaries, more on this below). I don’t mind cutting class sizes by 20%, it’s just a question of whether GW can afford to do so \n\nFinancial resources: not really sure how this works or what good resources look like. I’ll just say that more doesn’t necessarily equal better when dipshit bureaucrats get to decide where the money’s going \n\nAlumni giving and debt: lumping these together because we don’t really do well here. We’ve got no school spirit, high tuition, limited financial aid, and our best programs are in fields with lower starting salaries\n\n*but this is just like, my opinion man. I don’t really know what I’m talking about",
            "score": 57,
            "author": "freeport_aidan",
            "replies": [
                {
                    "level": 1,
                    "comment": "From what I’ve noticed as well the university itself doesn’t get much donations from alumni. Most will donate directly to the programs that they themselves have been a part of as compared to the university as a whole. I personally wouldn’t donate to GW as a whole but would rather donate directly to say the GW Institute for Korean studies or the Sigur Center for example because I have built a relationship with the professors in the department and support their missions. GW admin as a whole is so bad I don’t want to give them a penny. The departments and various organizations that are under the university do deserve donations however",
                    "score": 9,
                    "author": "josephk545"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "absolutely",
                            "score": 8,
                            "author": "aaronburrrrr"
                        },
                        {
                            "level": 2,
                            "comment": "CS Department at GW is top notch.  In addition smaller class sizes means more opportunities.  Highly recommend.  If one has a choice between UMD and GWU for CS, go GWU.  The top ranking of UMD doesn't matter professionally, and the caliber is equal to that of UMD.  In fact some of our courses are more challenging and rewarding than those of UMD--don't worry, the grades get inflated in difficult classes, and GPA doesn't matter after you achieve continuous employment.",
                            "score": 8,
                            "author": "shockage"
                        },
                        {
                            "level": 2,
                            "comment": "Come here for Data Science if you’re interested in CS. We’re one of the few schools who does Data Science as an undergrad major, and because of that the pay and opportunities are absolutely insane.",
                            "score": 3,
                            "author": "Qweter1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's a really nice Data Science major where you can choose your concentration and there's a five year masters.",
                                    "score": 1,
                                    "author": "meatball77"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "as a cs major- i love gw SEAS :)) pls apply!!",
                            "score": 3,
                            "author": "THROW-AWAY199232"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Great answer. I think GW may be first fiddle one day. Everything can improve except location. And georgetown can do little to improve that.",
                    "score": 8,
                    "author": "aaronburrrrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Location is so important.  Does it matter how great a school is if you don't have internship opportunities because you're located in rural Pennsylvania.",
                            "score": 8,
                            "author": "meatball77"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder how the internship process works. I applied to several internships via GW Handshake and my resume was never released to the employer. I exchanged emails to n fro but didn't get any practical response. I am an international and only apply to those which are aligned with CPT/OPT. I don't know why GW is so low in terms of administrative capabilities. When I joined GW SEAS grad school I used to think the availability of internships here would open a lot of doors. Now, I'm pretty confused.",
                    "score": 1,
                    "author": "breathe_iron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in Elliott, so things are going to be different, but I imagine that being an international student and needing work authorization is going to make a MASSIVE difference in terms of job searches",
                            "score": 5,
                            "author": "freeport_aidan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How many people score internships there?",
                                    "score": 1,
                                    "author": "Hagel-Kaiser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The vast majority of students probably intern multiple times \n\nI interned in both the house and senate my *freshman* year, and that’s not particularly unusual",
                                            "score": 1,
                                            "author": "freeport_aidan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I interned in both the house and senate freshman year and thought it was fine to balance, but it depends on you and the classes you’re taking\n\nI wouldn’t bother with handshake, just get a referral from an upperclassman (in either CRs, Dems, or another org)",
                                                            "score": 1,
                                                            "author": "freeport_aidan"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s bc they got rid of the Sol in District 😞",
            "score": 13,
            "author": "pogus"
        },
        {
            "level": 0,
            "comment": "I can’t imagine those ratings are at all indicative of the quality of education of an individual. If someone really wants to become well educated, they can do so even at the lowest ranked schools",
            "score": 17,
            "author": "LukaszMauro",
            "replies": [
                {
                    "level": 1,
                    "comment": "While you can become \"well educated\" at a low ranked school, you have to ask yourself how much of the learning you would be doing independently, if you're making valuable connections, and whether that makes the cost of attendance worth it.",
                    "score": 1,
                    "author": "Derek_Zahav",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In all fairness I think this can be said of any student at any given school.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, 100%! And it differs from program to program and prof to prof too, which is a big reason why I think looking at overall university ratings can be a little misleading.",
                                    "score": 2,
                                    "author": "Derek_Zahav"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not really. The rankings are all gamed.",
                            "score": 4,
                            "author": "The_Superhoo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The cost of attendance is a big factor. GW is very expensive. \n\nI went to the #1 public university and trust me, it makes no difference in any way. GW is a very reputable school globally.",
            "score": 7,
            "author": "Shadowsongism"
        },
        {
            "level": 0,
            "comment": "You constantly post on this subreddit about GW ranking/acceptance rate/comparison to GU. You need to get over it. Rankings don't mean shit.",
            "score": 12,
            "author": "d6410"
        },
        {
            "level": 0,
            "comment": "fuck we're 61 now? It was 52 when i was there smh.\n\nRealistically they made it less selective and increased enrollment to fund the engineering school. That hurt a lot. It's the right move long-term to be more well-rounded and not just poli sci etc, but in the short term it hurt selectivity and also got even more expensive than it already was. Gw is an excellent school but insanely overpriced. Until that image changes, GW will be viewed as an excellent school that's just too expensive and its strengths in liberal arts don't compensate for a STEM program people don't seem to view as particularly noteworthy and not worth the crazy tuition. GW realistically is viewed as an excellent school but for rich kids from NY/NJ who want to be politicians/lawyers/diplomats. It's a stereotype but it's very accurate. I don't see GW lowering tuition, so only way to rank better is to improve the STEM programs to attract more applicants, get more alumni, and use the increased resources to become more selective and rank better.",
            "score": 4,
            "author": "dcfb2360",
            "replies": [
                {
                    "level": 1,
                    "comment": "ya they increased the acceptance to 50% this year....",
                    "score": 1,
                    "author": "aaronburrrrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wtf it was like 33 when i was there...jfc",
                            "score": 1,
                            "author": "dcfb2360",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "$$$",
                                    "score": 1,
                                    "author": "aaronburrrrr"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Program stats and rankings are more important. How many people graduate within the standard timeframe? What percentage find jobs one year after graduation, and where are they working? What can you anticipate salary being? Etc. \n\nIf you like what you’re doing and applying yourself, you’ll be fine. Only so many people can get into the ‘top’ schools and many chose to go to other ones that better suit their personality and needs.",
            "score": 2,
            "author": "EternalMoonChild"
        },
        {
            "level": 0,
            "comment": "Also - and this is with the benefit of 20 years of hindsight - fuck these rankings. When I went to GW, we were hovering around the top 50. It was nice, but as someone who wanted to study International Affairs, my options were pretty much GW and American. I didn’t have the grades to get into Georgetown and I wanted the DC experience. I chose GW over American because I liked the campus better.",
            "score": 4,
            "author": "InLikeErrolFlynn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hate hearing about not getting into g town then going gw. need to become a equivalent option. probably why they push for STEM to differentiate",
                    "score": 1,
                    "author": "aaronburrrrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly, even if I had the grades, I didn’t want to go to a Catholic university, so I never even looked at Georgetown.",
                            "score": 2,
                            "author": "InLikeErrolFlynn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a Catholic I can tell you Georgetown is catholic by name only. they use it for brand but has no impact on the experience. Insulting actually. Should alienate catholics and non catholics with this image, but nothing principled matters much anymore.",
                                    "score": 1,
                                    "author": "aaronburrrrr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do they have crucifixes in the classrooms? I did my Masters at Seton Hall and that was always a bit jarring for me.",
                                            "score": 2,
                                            "author": "InLikeErrolFlynn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Only in the old ones. It is historically catholic but basically just a normal school with everything new they do. kinda put the Jesus behind them.",
                                                    "score": 1,
                                                    "author": "aaronburrrrr"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}