{
    "id": "xqpg96",
    "score": 2,
    "title": "Campus jobs",
    "author": "hansenberg221",
    "date": 1664401646.0,
    "url": "https://www.reddit.com/r/gwu/comments/xqpg96",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone know how to apply for a campus job(eg. Cashier) other than those posted on GW student employment website(? I’m an international student and I recently found out I’m kinda broke, but I’m too embarrassed to tell my parents😐",
    "comments": [
        {
            "level": 0,
            "comment": "International here, \n- if you work illegally, you put your visa status at a huge risk. Even your chances of being caught is low, you will never know how trustworthy the company is\n- non fws is your best bet or you can actually apply for work authorization as an immigrant but you need actual reasons and you need to report them\n-go talk with the ISO ( if you really wanna work without the work authorization maybe dont tell them that but ask for an advice)",
            "score": 8,
            "author": "djcgb"
        },
        {
            "level": 0,
            "comment": "Pelham commons, captain cookie are looking for workers.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for that!",
                    "score": 2,
                    "author": "hansenberg221"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if i'm not mistaken, there should be a section in handshake for that right? i'm not really sure tbh",
            "score": 4,
            "author": "jolygoestoschool",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t seem to find any on “on campus student employment” section",
                    "score": 2,
                    "author": "hansenberg221"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of the on-campus jobs go to the federal work study students first, which is probably why you’re not having too much luck. Try restaurant/serving jobs or find some skills training to get yourself a skilled labor job. The former is probably the easier way to do it.",
            "score": 5,
            "author": "RelocatedHumanity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice",
                    "score": 1,
                    "author": "hansenberg221"
                },
                {
                    "level": 1,
                    "comment": "What skills training are we talking?",
                    "score": 1,
                    "author": "Jay12a"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you actually want to make some money, your best bet would be to work at a restaurant or bar nearby. If work authorization is an issue, plenty of non-corporate places will be fine paying you under the table",
            "score": 0,
            "author": "freeport_aidan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really😳",
                    "score": 2,
                    "author": "hansenberg221",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, be careful. If the government finds that you are violating your visa you will have your visa voided and have to go home.",
                            "score": 12,
                            "author": "BS_SDSS"
                        },
                        {
                            "level": 2,
                            "comment": "Yes. I have coworkers making $30-50/hour as servers and bartenders who work without papers. Everyone is just desperate for people who will show up and work",
                            "score": -2,
                            "author": "freeport_aidan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really wouldn’t be advocating for working illegally here. They are at risk of being deported and thus no longer able to get their degree from GW. You are being irresponsible.",
                                    "score": 9,
                                    "author": "AnthoZero"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}