{
    "id": "y1pzz4",
    "score": 0,
    "title": "anti-israel protest at Hillel",
    "author": "fluffyglof",
    "date": 1665537016.0,
    "url": "https://www.reddit.com/r/gwu/comments/y1pzz4",
    "media_urls": [],
    "other_urls": [],
    "postText": "anyone know who organized it? got any names or organization names? would love to know",
    "comments": [
        {
            "level": 0,
            "comment": "passed by and talked to them - they were protesting specifically bc there was a speaker brought in that night who is a war criminal &amp; complicit in police brutality both in the us &amp; overseas",
            "score": 9,
            "author": "ferrisbueller3005"
        },
        {
            "level": 0,
            "comment": "its JVP (Jewish Voice for Peace), the anti-zionist Jewish organization. there's a chapter at GW and they're really nice ppl! very passionate",
            "score": 16,
            "author": "tkama",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are always people like you\n\nhttps://www.nytimes.com/2019/05/17/world/europe/germany-bds-anti-semitic.html",
                    "score": -1,
                    "author": "Frosty_Set8648",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm israeli btw, just pro free speech and political nuance...",
                            "score": 1,
                            "author": "tkama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All good. If you're Israeli you know more about what's going on than me. I take the position that many people not involved in the conflict use Jews as scapegoats to brandish their political careers. This has been the case for thousands of years since Jews have always been a minority for two reasons:\n\n1. We don't convert\n2. We pass down religion matrilineally, putting women at the center of our religion, rather than incentivizing men to have as many babies as possible...",
                                    "score": -5,
                                    "author": "Frosty_Set8648",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah...no",
                                                    "score": 1,
                                                    "author": "Frosty_Set8648",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There are always going to be a small minority of Jews who'd rather throw the rest of us under the bus to gain some brownie points with the WASPS. \n\nIsrael has been a refuge for many Jews of color across the world, including my family that survived the ethnic cleansing of 800,000 jews throughout the middle east. I hope one day you guys reject white supremacy and open your heart towards the most liberal country in the middle east.",
                                                                    "score": 2,
                                                                    "author": "Frosty_Set8648"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop antisemitism on twitter is active in boosting the anti protest side. \n\nYou should know they are a far right troll and were at the capitol riot on jan 6th. Regardless of your feelings on the protest/israel they are very biased and portray pretty fair criticsm of israel as antisemitism",
            "score": 6,
            "author": "Jazzlike_Dog_8175",
            "replies": [
                {
                    "level": 1,
                    "comment": "attacking a jewish student center isn’t fair criticism of israel. there’s a reason Wrighton sent out that email",
                    "score": -4,
                    "author": "fluffyglof",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A protest isn't an attack, they had signs and a palestinian flag. \n\nIf omar baddir was speaking you would be protesting too.\n\nFreedom of speech makes america great",
                            "score": 1,
                            "author": "Jazzlike_Dog_8175",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "taunting jews about an event that killed thousands of them is an attack. calling random kids war criminals just because they’re jewish is an attack. but i don’t expect to be upvoted in this angry echo chamber where everyone thinks they know everything just because they took one IA class",
                                    "score": 1,
                                    "author": "fluffyglof"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, all parties are to blame.\n\n 1. random 18-year-old Jewish kids have nothing to do with the physical actions of the Israeli Government so it IS antisemitic to accost them\n\n2. Hillel spun this like people were protesting unprovoked when they invited a terrible person to talk which does show their bias\n\nSimply put, calling out the speaker for his harmful actions is not an attack on GW Jewish students. If they didn't want backlash they should've done their research. Yeah, it looks bad when people with f\\*ck Israel signs protest right outside of a Jewish space. But, maybe look at the context before screaming \"hate crime.\"",
            "score": 3,
            "author": "ilovemycat345",
            "replies": [
                {
                    "level": 1,
                    "comment": "They had an IDF intelligence official speaking, it wasn't like they were protesting a religious service, they were protesting a military official in a non-democracy\n\nhttps://www.gwhatchet.com/2022/10/12/students-protest-event-featuring-former-idf-official-at-hillel-sparking-controversy/",
                    "score": 0,
                    "author": "Jazzlike_Dog_8175",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Non democracy?? Israel is the only democracy in the Middle East.   Next you will be praising Hamas.",
                            "score": 1,
                            "author": "Other-Equipment2507",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.washingtonpost.com/news/worldviews/wp/2014/07/30/how-israel-helped-create-hamas/",
                                    "score": 1,
                                    "author": "Jazzlike_Dog_8175"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "when did this happen?",
            "score": 1,
            "author": "melodrama444",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last night",
                    "score": 1,
                    "author": "Qweter1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Jewish” Voice for Peace, lmfao. They should be ashamed of themselves.",
            "score": -22,
            "author": "CountNaberius"
        }
    ]
}