{
    "id": "zgcnff",
    "score": 0,
    "title": "Will these stats get me into GW??",
    "author": "Huthmiester",
    "date": 1670535710.0,
    "url": "https://www.reddit.com/r/gwu/comments/zgcnff",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I applied early decision to GW and I’ve been really anxious about hearing about my decision and especially anxious about denial. Since I had very poor grades because of the covid years and my gpa is a 3.03/4 because of those years, I’m very worried that I will get denied. However, there are a lot of other things that work in my favor. Here are my stats:\n\n-3.03/4 GPA\n-submitted 1st quarter grades (3.71 gpa, all A’s except for 1 C in IB physics)\n-IB diploma student\n-1390 SAT\n-Captain of the sailing team\n-officer for world affairs club, civic engagement club, young democrats and republicans club, Model UN crisis chair and officer, \n-Eagle Scout\n-awarded pennsylvania state civic engagement award\n\nWill these stats get me in and will they make up for my poor GPA? I also submitted the extra info section of the commonapp and let them know that my poor academic performance was due to covid combined with ADHD. Will I get in early-decision?",
    "comments": [
        {
            "level": 0,
            "comment": "Are you full pay? GW ED loves full pay",
            "score": 21,
            "author": "sdl1964",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I am. Fortunately I come from a well-off background, so I didnt apply for any financial aid.",
                    "score": 1,
                    "author": "Huthmiester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re chilling then lol. Your stats are solid. Bet you get in stress free",
                            "score": 4,
                            "author": "jack901757"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the only thing that’s holding back a yes for me is your GPA, it is significantly lower than the average admit. It wouldn’t be shocking if you got in but I would anticipate having to pay close to full price if you get in. Unfortunately you are just a number to these big schools, if you are going to bring their average down you’d need to subsidize students with higher stats by paying more.",
            "score": 9,
            "author": "AnthoZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fortunately I do come from a well-off background, so I havent applied for any financial aid as my parents are able to pay full tuition.",
                    "score": 1,
                    "author": "Huthmiester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Congrats on getting into GW!",
                            "score": 10,
                            "author": "AnthoZero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait so since I can pay full tuition ill most likely get in? Wow",
                                    "score": 0,
                                    "author": "Huthmiester",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, you’re more likely than the same applicant but comes from a working class family. It’s an incredibly unjust and unfair system, but the business model that colleges created for themselves relies on students from high income families &amp; international students. You pay near full price so they can admit more qualified applicants and offer them large scholarships and financial aid. This is the same at essentially every  private school.",
                                            "score": 10,
                                            "author": "AnthoZero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’m definitely familiar with the current business model of private universities. I just didn’t know it helped that much. And hey, there is a reason I wanna go to GW for polisci, someone has to fix this broken system.",
                                                    "score": 1,
                                                    "author": "Huthmiester",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha sounds like you’ll really fit in at gw then",
                                                            "score": 4,
                                                            "author": "AnthoZero"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "does this work hand in hand w/ low income students benefiting from the large scholarships/financial aid while the middle class im assuming kinda gets screwed over?",
                                                    "score": 1,
                                                    "author": "bluejay163",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t really know how much I buy the argument that “middle class” people get “screwed over”. I think it’s more that if you get into a college it’s probably based on your merits so you’d probably get a merit scholarship and no need based financial aid. You wouldn’t necessarily get the benefit of automatic admittance because of your families income but you’re also not going to get a lot of need based aid. Resulting in probably being somewhere in the middle between someone paying full price and someone getting all their expenses covered by aid. IMO GW’s finaid is pretty fair. People coming from middle class families leaving college with debt is not a “bad thing”. Allowing people from working class families to graduate without debt allows them to more effectively raise themselves out of their financial hardship and be able to amass wealth.",
                                                            "score": 2,
                                                            "author": "AnthoZero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "yea! i agree with your point, poor choice of word i used there but by “screwed over” - i meant middle class families getting less need based aid than maybe low income ppl that’d need it more to make gwu a affordable choice for them.",
                                                                    "score": 1,
                                                                    "author": "bluejay163"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m also Puerto Rican, will that help as well?",
                    "score": 1,
                    "author": "Huthmiester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you identify yourself as hispanic/latino? GW’s latino numbers are very low so it might help.",
                            "score": 1,
                            "author": "AnthoZero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah in the common app i clicked the hispanic option and checked puerto rico.",
                                    "score": 1,
                                    "author": "Huthmiester"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "GW is super horny for IB students. They gave me a $25,000 scholarship just for having an IB diploma. That combined with your clubs and leadership positions and a state civic engagement award should be enough to compensate, especially with full payment and ED",
            "score": 5,
            "author": "Calm_Farmer_3061",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow yeah. I just did some digging and found apparently that GW accepts ~65% of IB students compared to normal ones.",
                    "score": 1,
                    "author": "Huthmiester"
                },
                {
                    "level": 1,
                    "comment": "What is an IB degree?",
                    "score": 1,
                    "author": "aipmedia1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "international baccalaureate, it's like the international version of AP classes",
                            "score": 1,
                            "author": "Calm_Farmer_3061"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is your major?",
            "score": 1,
            "author": "aipmedia1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Polisci",
                    "score": 1,
                    "author": "Huthmiester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let me know how it goes, good luck I applied to GW ED with similar stats and activities. \n\nI'm on the sailing team here, you should join our team. Send us an email at: gwsailingrecruits@gmail.com",
            "score": 1,
            "author": "Anthony_biz01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh thats awesome. Yeah i actually visited GW in november and met with your recruitment chairs. Had a great time.",
                    "score": 1,
                    "author": "Huthmiester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And..",
            "score": 1,
            "author": "sdl1964",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got in!",
                    "score": 2,
                    "author": "Huthmiester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You and me are on the same boat. Freshman year is the reason my GPA is so low and I did eventually bring it up sophomore and junior year as much as I could but it's at 3.2 now. I think what we have going for us is improvement since we started off bad it showed we took initiative and pulled ourselves together as opposed to someone who started off strong and had their grades drop recently. I relate to you in the sense that my GPA is close to yours and I also have a ton of EC's to make up for it I also feel really confident in my supplemental and personal statement. Im just a little scared that they wont accept me because I am applying for financial aid, but Im sure we'll both go where we're meant to be. Goodluck!",
            "score": 0,
            "author": "Shiny_Cardinal1120"
        }
    ]
}