{
    "id": "zretu3",
    "score": 1,
    "title": "GW , Howard or UMD",
    "author": "Status-Piano-2528",
    "date": 1671612222.0,
    "url": "https://www.reddit.com/r/gwu/comments/zretu3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, so I am transferring out of my community college (Montgomery College) and wanted to know which school I should attend. I've been accepted to GW Elliott school of international affairs, UMD and Howard as I want to stay in the dmv area for my international affairs major. I have to make a decision today for Gw by paying the deposit but l'm nervous and don't wanna end up taking a lot of loans for GW.\nI've not received my aid package yet!\n\nUPDATE:\nGOT MY PACKAGE AND ITS GOOOD! so I chose GW 😝",
    "comments": [
        {
            "level": 0,
            "comment": "It doesn’t seem fair that you have to make the deposit before receiving your financial aid decision. I would contact the school ASAP and make that point clear.",
            "score": 30,
            "author": "AnthoZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "They don’t care lol. I contacted them they say i have to wait until January… I’m pissed off",
                    "score": 5,
                    "author": "Status-Piano-2528",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bro wtf that’s kinda bullshit. \n\nTbh not the first bullshit thing you’d have to deal with if you went to gw :/",
                            "score": 3,
                            "author": "AnthoZero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell me more lol before I commit",
                                    "score": 1,
                                    "author": "Status-Piano-2528",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can’t really give specifics but my entire time there I only experienced annoyance from the administration. Granted it was mostly because of our old president, but the new one doesn’t seem much of a leader either. Also I heard they don’t give much financial aid to transfer students, anyways. How much is the deposit?",
                                            "score": 1,
                                            "author": "AnthoZero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "800$",
                                                    "score": 1,
                                                    "author": "Status-Piano-2528",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": ":/ this is a shit situation, how can they expect you to make this decision without knowing how it will impact you financially? \n\ndid you get your finaid from the other two yet?",
                                                            "score": 1,
                                                            "author": "AnthoZero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nope but Howard ( from what I’ve heard ) is shitty with financial aid. UMD  accepted me as an out of state student which is weird cause I’m from MD",
                                                                    "score": 2,
                                                                    "author": "Status-Piano-2528",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lmfao??? Id contact UMD and see what is up with that, cause it should be cheaper for you if you are a MD resident. \n\nIs $800 something that would impact you significantly? I would say Elliott is the best school out of the 3 so it might be worth it in the long run, but I personally wouldn’t make any decision like that without knowing all the facts.",
                                                                            "score": 1,
                                                                            "author": "AnthoZero",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not really, I can pay the 800$ it’s just frustrating",
                                                                                    "score": 2,
                                                                                    "author": "Status-Piano-2528",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My EFC is 0 and my dad makes like 15k a year lol and he doesn’t help me",
                                                                    "score": 2,
                                                                    "author": "Status-Piano-2528"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Financial Aid is everything. Do the choice you believe will give you the least debt, those are all great colleges to attend.",
            "score": 12,
            "author": "Qweter1"
        },
        {
            "level": 0,
            "comment": "I did undergrad at GW in International Affairs. The program is awesome, but I was able to not pay for it because I used my G.I. Bill, so I can't speak to whether it was worth it. As a student there, I did land some awesome internships. Again, hard to say whether those were based on military experience, or being at GW. I was overwhelmed by the school, so I sought out stuff on my own. The professors (for the most part) were bona-fide in their fields and experience. And the schools proximity to DoS and DoD is baller, to be honest. My main gripe at GW was the students themselves. I found them to be insufferable in many cases. Crying about the injustice they've personally dealt with while spending their summers at a vacation home in Italy or wherever-the-fuck. It always felt like they were only at the school for jobs, nothing else.\n\nI'm doing my M.A. at Howard (in American history), and can't speak to living at HU or the overall undergrad experience, but I can say that the school itself has potential to be incredible. There are a lot of issues with school administration, and it sounds like they might be pretty stingy with financial aid, but the campus is gorgeous and the professors themselves really foster unique learning environments. The school has similar D.C. hookups that GW has, but because a lot of those workplaces continue to be white spaces, they're slightly different. The students at Howard fucking rock, despite the amount of bullshit they deal with. In contrast to GW, the students at HU are there to be there.\n\nI'm a white student, and if I had to pick a school regardless of program, I'd pick HU, despite\nIf I had to pick an IA school, I'd pick GW.\n\nHU and GW are great for different reasons.\nThey can also suck for different reasons.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your insight ! I will definitely take that into consideration 🙏🏾",
                    "score": 1,
                    "author": "Status-Piano-2528",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it's not a ton to work with, but schools choice is very personal. I'll say that I loved gw, but am also so glad I switched schools for me masters",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aid is definitely the priority. I have an EFC of 0 and it’s affordable for me to attend gw, but I wouldn’t say that you should put your eggs in this basket necessarily.",
            "score": 4,
            "author": "Dry-azalea",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a efc 0 and my dad makes 16k a year",
                    "score": 1,
                    "author": "Status-Piano-2528"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like you should reach out to the finaid office, like, immediately .",
            "score": 1,
            "author": "SockDem"
        },
        {
            "level": 0,
            "comment": "GW is the superior school, but it depends on aid of course. You can get a great education almost anywhere nowadays.",
            "score": 1,
            "author": "aaronburrrrr"
        }
    ]
}