{
    "id": "13f3j72",
    "score": 2,
    "title": "Best place or method to find a partner for an MVP?",
    "author": "Jessica_peaches88",
    "date": 1683847071.0,
    "url": "https://www.reddit.com/r/startups/comments/13f3j72",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m currently working with a no code developer to create my MVP. It’s almost complete, and I now need a marketing strategist to help me get the app off the ground, and drive user engagement. \n\nI would really prefer someone to partner up with at this point as I do need some help, especially expertise in certain areas.\n\nI prefer to partner up with an individual vs. a firm, because I assume a firm will require a lot of $$$ or equity. I could be very wrong and I did reach out to 2 of them, and am waiting for a response.\n\nI thought I’d jump on here to find out what those of you with a bit more experience think. Is there a specific platform I could look at or a specific method?",
    "comments": [
        {
            "level": 0,
            "comment": "Startup school by YC has a co-founder matching platform. That was how I met my co-founder",
            "score": 4,
            "author": "squidwarddab1111",
            "replies": [
                {
                    "level": 1,
                    "comment": "How was that process?",
                    "score": 2,
                    "author": "avtges"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is your skill set? If you are looking for marketing partner and also paying for development what do you plan do for the business? Are you a designer, accountant, etc",
            "score": 1,
            "author": "Ok-Abies-7866",
            "replies": [
                {
                    "level": 1,
                    "comment": "My background is in HR &amp; leadership.  My strengths are definitely my soft skills. While my background will come in handy at one point, there’s a gap in skills for what I need in the immediate future.",
                    "score": 3,
                    "author": "Jessica_peaches88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cofounderslab",
            "score": 1,
            "author": "rmnmrd"
        }
    ]
}