{
    "id": "13h5xcf",
    "score": 29,
    "title": "Recruiting a technical cofounder",
    "author": "talldarkcynical",
    "date": 1684050288.0,
    "url": "https://www.reddit.com/r/startups/comments/13h5xcf",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm working on a new startup. I have a solid idea and am doing my user research and scoping now - I've worked in startups for more than a decade and am a very very good product manager so that part is under control.\n\nI need a technical cofounder. I'm planning on an equal split of equity, but don't have funding yet and so can't offer pay, nor am I taking a salary myself. I've reached out to several friends, but with the economy so bad no one wants to take a risk and leave a job right now. Folks who don't have work are solely focused on finding it - and need to be paid. Unfortunately, I have enough savings to support my own family without pay, but not someone else too.\n\nBeyond cash, what would you offer or look for that would be appealing right now?",
    "comments": [
        {
            "level": 0,
            "comment": "Went through this a few months ago... it's tough, but I eventually found a good fit (took just over 2 months). Here's some ideas:\n\nKeep working on the startup and building momentum. Can you create a lean MVP with no-code tools or by manually performing a service? Expect the search to take some time, don't rush it or force it with a bad fit.\n\nBe open to considering someone who can't work on the startup full time and if you do this, make sure it's someone who has the time and drive. A lot of people working 35-40 hours a week in a paid role can find 20-30 hours a week to work on something they're passionate about and that may be enough to get things rolling.\n\nCreate an account on YC Co-Founder Matching and begin filtering through the profiles on there, start having conversations, pitch them like you would an investor (on the potential) and personalise it to what you see in their profile. There are thousands of potential developers, you can contact up to 15 per week: [https://www.ycombinator.com/cofounder-matching](https://www.ycombinator.com/cofounder-matching)\n\nPut ads up on sites and communities where you might find developers who could suit. For example, if Next.js would work in the tech stack you could add a listing to their monthly 'Who's Hiring' thread on Github: [https://github.com/vercel/next.js/discussions/49471](https://github.com/vercel/next.js/discussions/49471)\n\nIf there are dev job boards that are specific to the technology stack or industry of the startup, you are more likely to find developers that will be passionate about what you are building. If you put up a job ad, sell the vision / CTO role / equity offering. You are still going to have a large number of applications submitted without the individual reading it properly (or at all i.e. automated submissions). So reply to those who look like a fit with a few questions to ensure they understand what is on offer before spending too much time on an applicant (i.e. don't meet until you have manual confirmation they understand it is beginning as equity-only remuneration).\n\nHope this helps and good luck!",
            "score": 25,
            "author": "josephskewes",
            "replies": [
                {
                    "level": 1,
                    "comment": "this bring more than idea, bring validation. bring a list with 200 people that would buy it if it were built\n\nnot many people will take an offer like: I have an idea, you code it and you get 50 % of what you code cuz ..u know I have idea.\n\nideas are cheap. I can give you at least 3 good ones for free.\n\n&amp;#x200B;\n\nlater edit: to prove the idea has no value I just mentioned that I can give 3 free ideas and nobody asked for one. ( And I have build and seen stuff built over the years)",
                    "score": 10,
                    "author": "generatedcode",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; not many people will take an offer like: i have an idea, you code it and you get 50 % of what you code cuz ..u know i have idea.\n\nAs a technical co-founder, I agree with this.\n\nFor a non-technical co-founder, what I'm looking for:\n\n1. What you bring to the table: **(A)** a huge, influential network (LinkedIn, Insta, FB, Twitter, whatever best matches the market). **(B)** Capital. **(C)** Golden pedigree that will help \"lubricate\" business development (e.g. industry insider).\n2. Alignment: if I'm already working full time, I've got to really love the idea and feel passionate about it.  I'm working on a travel planning app right now and the only way I could push through it at 2 AM, 3 AM as a side hustle is if I am super connected to the problem.\n3. Customers: if you can get traction via no-code, marketing, and/or just a beta list sign up, that's a great signal that you're on to something.  Even if I'm not 100% on board with a product idea, if you've got a list of 100 people already signed up, that is a really strong signal that you're on to something.\n\nThe worst is when it's just an idea that hasn't been validated; how do I know that if I put 200 hours of nights and weekends into this effort that there will be any value created?  That's the mindset of a technical co-founder that's already working a full time job.  So as a non-technical co-founder, the biggest  is whether you can bring a fully validated idea to the table.",
                            "score": 8,
                            "author": "c-digs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nailed it. Your response tells me you’ve actually done it.\nOne more thing not listed that’s undervalued is unwavering belief and persistence in the success of the product, company, and vision.\n\nBelief is what early startups are predicated on, and someone who can inspire a healthy mindset and mental states of success can be the difference between giving up and succeeding in very early stages.",
                                    "score": 2,
                                    "author": "noblesavage81"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This answer is top tier.\n\nYou have to bring more than just the idea. Bringing validation would be top tier…but if you have other assets like influence or structure, it could offset what you lack.\n\nThe idea really isn’t enough.",
                            "score": 3,
                            "author": "ReyHaynes"
                        },
                        {
                            "level": 2,
                            "comment": "What are the 3 free ideas",
                            "score": 1,
                            "author": "MacroEconMacro"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tough. Either you convince them you have *it* and get them excited about your project or you find a way to pay them.\n\nThat's pretty much it.",
            "score": 9,
            "author": "bnunamak"
        },
        {
            "level": 0,
            "comment": "Somewhere out there, is a technical co-founder without a vision or an idea.",
            "score": 9,
            "author": "MrB4rn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I doubt. But I'd say there is for sure an engineer who sucks at sales and marketing and who will be happy to do the technical part and have someone do the rest.",
                    "score": 12,
                    "author": "nnurmanov",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im one of those, but seems that saying that in this sub, gets you banned. I got banned for like a week just for mentioning it.",
                            "score": 2,
                            "author": "UnLocoBueno"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would mostly be looking for clear signs that the idea is well tested, like a handful customers who already receive the value from you as a service and pay for it.",
            "score": 6,
            "author": "The_Startup_CTO"
        },
        {
            "level": 0,
            "comment": "Ideally you build a MVP with a no-code or low-code service like Bubble to show the initiative/vision of what you wish to create. That should get more attention of technical folks than just an \"idea\", rather you would have something that's nearly ready to go. Truth is a lot of technical co-founders also want technical co-founders, because that way they can split the technical work and it's not lumped all on them. Good luck!",
            "score": 6,
            "author": "ceo_fyi_dot_com"
        },
        {
            "level": 0,
            "comment": "Do they absolutely have to be full time immediately? Is there a world where they get to work on their regular jobs and get paid and also work maybe part time on the startup?",
            "score": 3,
            "author": "tothejay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Part time to start is fine, as long as they're willing to make it full time if/when we get funded or have revenue under us.",
                    "score": 3,
                    "author": "talldarkcynical"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have an amazing idea for an app…",
            "score": 3,
            "author": "nikola-crypto"
        },
        {
            "level": 0,
            "comment": "You need to learn to code. Or design. Start building. Even if it’s shit. You can talk to customers. Prototype things. All of this stuff represents progress. And progress is what will matter to a co-founder and investors. \n\nThinking, researching etc is so much slower if you aren’t building and showing. And you can eliminate so much bad product/ideas by putting your crappy prototype into users hands. \n\nGood luck!",
            "score": 5,
            "author": "splittestguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a pretty decent designer (for a product manager) and have already completed the initial wireframes and ux diagrams as part of my scoping.   \n\n\nre: research, I've done a dozen listening sessions with potential customers and have a dozen more. I also have more than 25 years experience in the target vertical which gives me some meaningful domain expertise.",
                    "score": 2,
                    "author": "talldarkcynical",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those are excuses.\n\nGet learning to code. If you need to know where to start, dm me.",
                            "score": 2,
                            "author": "Open-Yak5883"
                        },
                        {
                            "level": 2,
                            "comment": "You can sell a prototype. You can’t sell a wireframe. \n\nBe more tactical with your time. Wireframes, scoping, all wasted time if you can’t build the app. \n\nYou can build a prototype and sell the product. You can learn to develop it. \n\nBefore you do stuff you can put in front of customers and get paid, you’re still at idea phase. And that has zero real world value. And therefore team aren’t going to join you.",
                            "score": 1,
                            "author": "splittestguy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why do non-technical people think they can start tech companies? Go learn to code and build your product or work for someone else. Product manager is dumb in an idea stage startup. Nobody wants to build your idea for you.",
            "score": 2,
            "author": "noblesavage81",
            "replies": [
                {
                    "level": 1,
                    "comment": "The reverse situation can be equally true…technical people thinking they know how to build a business. Technical founders with a strong business acumen are a rare breed",
                    "score": 4,
                    "author": "CaffeinatedRob_8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This.  There's a reason y-combinator STRONGLY recommends at least two co-founders and only expects one of them to be the tech leader.\n\nThat said, I actually started as an engineer and have taught programming. I've also been a sales engineer, run developer relations programs, and managed engineering organizations at multiple startups.  But I haven't written code for a living in a decade and I know that I'm much stronger on the product / design / strategy side of the house so I'd like to focus there. It's not that I can't program, it's that I'm better at other things and other skills are valuable too.",
                            "score": 3,
                            "author": "talldarkcynical",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve been working as a founder of 2 tech startups for 4 years each. In one, my team size is 20 ppl and a nontechnical cofounder. It doesn’t not help him that he’s nontechnical in any form and is actually retards his capabilities. I had to become ceo because he didn’t understand where the product or company could go off of the tech, understand what the team should be building, or come up with answers to new roadmap questions investors ask.\n\nI think OP, quite frankly, you are giving yourself excuses to not do challenging mental work and trying to make your PM experience seem super valuable. A great engineer can be a great PM because they know what to do and are smart enough to organize people around their designs. You don’t start at the top barking out orders. You start by building and designing everything, then getting other people to do work under your direction that you don’t have time to do yourself. \nA tech company is an extension of an expert’s mind.",
                                    "score": 3,
                                    "author": "noblesavage81"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This. I happen to have started as a technical founder early in my career, was acquired by a much larger company, and started to move into more general manager type role over time. You can absolutely start a company coming from either direction, but you need that that counterpart unless you develop those skills yourself. I would say it’s equally as hard for a technical person to build the strategic and commercial know-how as it is for a commercial person to learn to develop software. Everybody brings things of equal importance, and success won’t exist without all of it.",
                            "score": 2,
                            "author": "Bababooey1818"
                        },
                        {
                            "level": 2,
                            "comment": "I don’t believe they’re equally true. I think generally, technical founders aren’t afraid to learn business.\nNon-technical business people seem to be afraid to learn tech.",
                            "score": 1,
                            "author": "noblesavage81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely agree that non-tech folks too often dismiss the importance of understanding tech. This often leads to poor business decisions, and mismanagement of tech stack, etc.",
                                    "score": 1,
                                    "author": "CaffeinatedRob_8"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It takes much more than having a working product to establish and grow a successful tech company. \n\nA non-technical person could better understand what that product should be, how it should work, why it should work in that manner, who it is for, how to reach and sway those people, how to operate the business, and other core aspects of business without having any technical expertise when it comes to building the technology.\n\nA non-technical person with just an idea is worthless. A non-technical person with the skills to design, manage others, and operate a business is invaluable. \n\nWhen a non-technical person demonstrates they are more than just another jackass with an idea, plenty of people would want to build their idea with them. More when that non-technical person treats others respectfully and is willing to compensate them to the best of their abilities given the situation.\n\nProduct manager is not dumb in an idea-stage startup. It is necessary. But, you first need to act as Product Owner and produce those blueprints so you have a product vision and eventual product to manage.",
                    "score": 1,
                    "author": "GaryARefuge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The skills you’re describing are great for seed stage.\n\nGetting to seed stage is virtually impossible for most people because they don’t have the right, different skills.\n\nYou need to be brilliant at building a product from scratch and develop a reputation for it, brilliant at creating up B2B relationships that will actually commit to a sale or have some from your prior experience, or have vc/angel connections to get your idea funded to get others to build for you.\n\nThe latter two things are very difficult to get without building a product. Once a product is built, it’s relatively easy to attract people who are incentivized to use their networks to sell it. It’s not easy to get product-market fit at that point, but you have something people can work with.\n\nThe product is the way to go from rags to riches. If you have no network and can’t build a product, there’s very little use for you on a preseed team. Best case, you trick people into building things for you.\nThat’s why zuck, gates, Dorsey, musk, bezos, name your tech founder, all came from a tech background.\nThey knew what to build and how to build it. Everyone else was an extension of their minds.",
                            "score": 0,
                            "author": "noblesavage81"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have to sell them on how good you are and get them to visualize it as a huge growth opportunity for themselves. Maybe tap your network for someone who has savings and the risk appetite",
            "score": 1,
            "author": "assfgkigfdhjo"
        },
        {
            "level": 0,
            "comment": "Depending on the complexity of the coding (and assuming that your USP isn't the code/technical) you can just contract it out. It's the route I followed for the MVP as my coding isn't up to the necessary level, although I did the wireframing myself, and while I could afford the fees for a short-term coding contractor, I would have struggled to convince someone to work as a full-time tech.",
            "score": 1,
            "author": "Standard_Brush3570",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've considered this and may go this route. What I've seen though is that outsources code is usually very poor quality since the contractors have no expectation of needing to  maintain it - and bugs are just extra billable hours if they do. I'd rather build it right from jump if possible.",
                    "score": 1,
                    "author": "talldarkcynical",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's true, but one thing to consider is that your product will likely evolve a lot, as you work on it, get feedback from users etc. The vision in your head now might be very different from where the actual product is a year or two from now.\n\nSo even if the code is right from the start, the requirements are likely to change and might need to rebuild anyway with a complete different architecture. What seems right in theory at the start, might not end up being so in practice later on.\n\nThe startup I worked for had a pretty crappy initial version that wasn't going to scale. Once we got enough paying users and enough understanding of what is really needed, everything was rebuilt from scratch, but now with tangible information at hand. This ended up being the right choice, although I understand the at different kinds of businesses have different needs.",
                            "score": 1,
                            "author": "WhitePaperOwl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think having someone excited about the project and the vision and that would not be full time at first I think",
            "score": 1,
            "author": "scatignaj"
        },
        {
            "level": 0,
            "comment": "Remote-first opens a lot of doors but comes with its own challenges.",
            "score": 1,
            "author": "Notsodutchy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. I moved away from the SF Bay area to rural northern california during the pandemic so this company is envisioned as remote-first. I've actually preferred working remotely for years. I don't need to sit next to somebody to work with them effectively, I just need results.",
                    "score": 1,
                    "author": "talldarkcynical"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need some early stage validation / traction of your idea. High quality dev's get pitched every day about the new startup on the block they should co-found and get asked to work for equity.\n\nWhy don't they take these opportunities?\n\nBecause it's just an idea, nothing else.\n\nYou need to turn your qualitative data into quantitative data. Spend a few weeks talking to as many of your target users as you can. Ask valuable questions. \n\nFocus on breaking the problem you solve into it's first principals, and work up from there. Build a bulletproof set of validation from this. Once you've done that, start looking for a co-founder. But make sure your understanding of the problem and ideal solution is crystal clear. There are 3 things you need to prove to a potential cofounder.\n\n\\- What is the problem, and what is the size of it.\n\n\\- What is the solution, and what is the viability of it.\n\n\\- Would people use this, and how much money could it make.\n\nHope I could help.",
            "score": 1,
            "author": "aidenpethick_"
        },
        {
            "level": 0,
            "comment": "I will be the technical confounder - PM \n\nI am based in the UK though",
            "score": 1,
            "author": "Logical_Sea2630"
        },
        {
            "level": 0,
            "comment": "Hey man!! I hope you're doing well! Ive tried posting here to find a potential partnership. But my posts always get drowned out..\n\nI hope you find my elevator pitch below interesting and reach out!! \n\nI've been pondering a few business opportunities and thought I'd reach out to see if anyone here might be interested in partnering up. It's definitely a bit of a moonshot, but with my experience in manufacturing, construction, and managing successful businesses, l'm confident that we have a strong foundation to build upon.\n\nThe idea revolves around creating an innovative service/product with the potential to make a significant impact in the market. I'm looking for someone who's ready to take calculated risks, work tirelessly towards our shared vision, and help secure the necessary funding to bring our concept to life. We're not talking about a small-scale project here; we're targeting a whopping $100 million opportunity.\n\nI know this might seem like a long shot, but I genuinely believe that with the right partner, unwavering dedication, and hard work, we can turn this dream into a reality. If you're intrigued by the idea of joining forces on a potentially life-changing project, feel free to drop me a DM, and we can grab a virtual coffee or hop on a call to discuss this further.\nLooking forward to connecting with like-mindled individuals and exploring the possibility of exhilarating partnership.\n\nCheers!",
            "score": 1,
            "author": "smakin_"
        },
        {
            "level": 0,
            "comment": "The only thing that makes your idea solid is the market purchasing from you to obtain the solution you propose with it. \n\nSo, assuming that you have purchase intent from multiple target consumers ready to buy from you, all you need is an mvp. \n\nThe founders of doordash used google forms to set up customer food deliveries and then tracked delivery drivers with find my iPhone. Make an mvp that makes you hurt your pride to release and get sales! \n\nOnce you do this, potential technical co-founders will be knocking down your door. Because winning them over with words won’t be enough to ask them to dedicate the countless required hours maintaining and iterating on the product.",
            "score": 1,
            "author": "Hearthisidea"
        },
        {
            "level": 0,
            "comment": "If you have a solid business plan and you can show validation then there are companies out there that will provide tech and fund your business, look up Founder and Lightning, Faster Capital, Fast CTO and Atom CTO. You will need to bring more than an idea to the table though. If you are really looking for a co-founder and not just someone to work for you for free then get I'd suggest you go to a local incubator",
            "score": 1,
            "author": "Mission-Blacksmith-9"
        },
        {
            "level": 0,
            "comment": "Proven experience &amp; reputation matters a lot. I'm an engineer. I got in touch with a non-technical entrepreneur who just sold his company. The fact that I could google his name, read articles on his previous venture, is what sold me on exploring a startup idea together for the past months - in the field of computer vision. Unfortunately, it didn't pan out.\n\nFrom that experience I learned that, even more important than reputation, is your attitude: being hungry enough &amp; showing you really care, and that you are really putting in all the work you can to validate the business case &amp; get customers. Not making excuses. You don't need a working product first to validate the business case and to get prospects.\n\nFor an engineer it's easy to show the work you do. Just look at the Git log, the demos, ... I'm happy to put in many late nights of coding, as long as I can trust my partner to get leads, validate the case, narrowing down the use cases that matter the most, etc... That trust is really important, more than cash or other tangible incentives.",
            "score": 1,
            "author": "true_variation"
        },
        {
            "level": 0,
            "comment": "What kind of technical skills are you looking for? It looks like you have done some UX work, does that imply you're looking for web developers?",
            "score": 1,
            "author": "coriidor5"
        }
    ]
}