{
    "id": "13ijphy",
    "score": 3,
    "title": "Fitness wearable electronic at ideation stage in the UK - should I just give up?",
    "author": "dragoneggboy22",
    "date": 1684183043.0,
    "url": "https://www.reddit.com/r/startups/comments/13ijphy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, just looking for some (brutal) honest feedback. I'm a first-time founder with an idea for a fitness product which I believe fills a gap in the market for a wearable device that would have an app interface with the user.\n\nI've been thinking about it for a couple of years and become more serious with educating myself recently. I'm about to get started with customer discovery.... and then I've just kind of had a realisation that it's probably impossible for me to ever make a success out of this so why even start and waste hours of time (even if I enjoy it)? The issues are:\n\n1. I have some domain knowledge but not enough and would need the expertise of an academic for the technical aspects of the hardware product. (I've already made contact with one, an informal meeting - obviously nothing concrete discussed as I'm just a guy with an idea)\n2. I can't code\n3. I have zero startup experience\n4. It's a hardware startup. Everything I've read states these are so much harder to get funding for, especially in the UK\n5. The product would take many months, probably even a year or so of iterative development, testing it on people., before it can formally go on the market at all. This makes funding even more difficult to surmount\n\nThere is however enough to get me started. There is already a product out there that is basically an MVP. I've bought it (it's cheap) and it works. The company that has developed it is obscure and it's not clear what they're planning to do with it. The problem is it is basically a raw data version of my vision for the final product, so it's not something I can show to (most) people and get them excited about it (there may be some pioneering adopters I could find and buy into the vision of the final product with a bit of imagination).\n\nBasically my problems form a loop. I lack the necessary initial expertise + credibility, meaning I won't obtain funding in a space where funding is already very difficult, meaning I can't develop the actual product enough to get the attention of customers, meaning I can't get funding.\n\nAm I right in my self appraisal? Should I even bother? What would it take to get things going a little?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi mate,\n\nThe brutal answer to your question is that it is really, really easy to find a reason not to do something like this. There are a million books on it and I won't insult your intelligence by going over their points.\n\nIf you have a semi-MVP (as I understand it), then a lot of the actual hard work is kind of done. If you want to work out whether it's investable, I'd write a pitch deck. This is what I've done, and what I have advised early stage founders to do, when toying with a new idea. Worst case scenario it will force you to face some uncomfortable problems you can't solve and you can bin it before you waste (more) time and money on it. Best case scenario it'll enthuse you that the problems are solvable.\n\nInvestment in the UK is lower, generally, but we do have a pretty decent angel community that you would probably be looking to target at this stage.\n\nIf you use LinkedIn, and you've got your pitch deck, it's dead easy to find people to give you objective honest feedback on if you're wasting your time!\n\nHope that helps.",
            "score": 2,
            "author": "freddie_RN",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm 100% not looking for a reason not to - it's just my way of drilling deep to get people's thoughts to learn from.\n\nBut great advice, thank you. Part of the problem is I don't know how things \"work\" in the startup world - I think there may be customs / norms I'm not familiar with about who and how to approach. When you don't fit in, look uninitiated and inexperienced, you can get swiftly ignored",
                    "score": 1,
                    "author": "dragoneggboy22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Always be experimenting and always be learning is my advice. You don't need certainty, but just `try` not to be an idiot. That doesn't mean won't make silly mistakes, but rather just try to do your best with what you know and what you have and see what happens.",
                            "score": 1,
                            "author": "YouNeedToGrow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get what you're saying, which is why I'm asking this here, with the benefit of pseudo-anonymity online, rather than IRL.\n\nNo one can do it on their own - everyone takes advice at several stages of their journey. Of course I'm not going to take what anyone here says verbatim, but I'd be happy if there are some insights I can learn that I hadn't considered before, so I can make my own decisions.",
                    "score": 6,
                    "author": "dragoneggboy22"
                },
                {
                    "level": 1,
                    "comment": "I dunno there's a lot of self doubt as a founder, imposter syndrome is real",
                    "score": 5,
                    "author": "Mrszombiecookies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you give more information on what gap you're filling? I know someone who has a fitness product that uses an app. It's super niche and really hard to do with no money or little background. Could be direct competition or a possible collaboration.",
            "score": 1,
            "author": "Mrszombiecookies"
        },
        {
            "level": 0,
            "comment": "If you’re looking for inspiration and a success story from a UK hardware founder, I recommend James Dyson. \n\nhttps://podcasts.apple.com/us/podcast/founders/id1141877104?i=1000585002882\n\nTwo ideas from the book:\n\n- dogged perception beats brilliance\n- you can become an expert on anything in 6 months",
            "score": 1,
            "author": "Fitbot5000"
        },
        {
            "level": 0,
            "comment": "You say there is already an MVP product out there. Will your hardware device be better and in what way? If the answer is unclear why not use their hardware and develop a software solution to compliment it, as you say it's data is raw, which is not what people want.\n\nThe challenge I can see you having is that the wearable market is already crowded and do people really want another device? If anything, I'd like something which converges all the data I have (Fitbit, MyFitPal, medical records) into a single interface, rather than another piece of hardware.",
            "score": 1,
            "author": "FewEstablishment2696",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the most likely route I think - the issue is eventually it would require a proprietary hardware - I suppose it's not that difficult at that stage once the concept is proved.\n\nYou're right on the latter - but this is for an underserved market which Fitbit etc doesn't serve well at all",
                    "score": 1,
                    "author": "dragoneggboy22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hardware start ups are extremely difficult for a few reasons. \n\n1) Investors are reluctant to fund vs software\n\n2) It’s very difficult to build and prototype in the hardware space. You’ll be spending a lot of time in China. \n\n3) If you’re not quite right, it’s very difficult and expensive to iterate whereas iterating in software is part of the process. \n\n4) All this means, you need a lot of funding. \n\nIt can be done but I would say you’re taking on an especially difficult challenge as you’re a first time founder as well.",
            "score": 1,
            "author": "soulsurfer3"
        },
        {
            "level": 0,
            "comment": "Fitness wearable seems like a very saturated market with a number of very large entrenched entities.",
            "score": 1,
            "author": "gwork11"
        }
    ]
}