{
    "id": "13lru11",
    "score": 161,
    "title": "Cofounders stole my work &amp; my product, refusing to acknowledge my contribution",
    "author": "123ngineer",
    "date": 1684492967.0,
    "url": "https://www.reddit.com/r/startups/comments/13lru11",
    "media_urls": [],
    "other_urls": [],
    "postText": "Two days ago, my cofounders cited personality differences and said they no longer wanted to work together, removing my access to all company documentation. Last we spoke, they said I had no right to anything &amp; they would not acknowledge the \\~30% equity.\n\nI was in charge of developing the product, but I also ended up curating all of the marketing materials, discovering investors &amp; developing business / operational strategy. I have 10 years of domain expertise &amp; they're both fresh out of undergrad.\n\nThey're currently trying to raise pre-seed funding. With my contribution, I was certain the product would raise $600K/$6M valuation over the next week. This is such a backstab, as there is a huge vc pitch happening today.\n\nI have tried to reach out to no response. I have documentation of my contributions over 4 months, including a timestamped export of the cofounder chat dating back to the start, including the 1000s of documents/links/media that were sent between us. This includes a contract which they pressured me to sign on predatory terms (which I said i'd review with my lawyer before signing - that was to happen on Monday). I also have access to all my cloud files (stored on a personal drive), and proof I paid for the website &amp; marketing materials.\n\nI've retained legal counsel, but at this point i'm looking for advice from others experiences. What's the best course of action here?",
    "comments": [
        {
            "level": 0,
            "comment": "Here's the magic. When you get your lawyer involved, this pretty much immediately ends any fundraising, VC interest, etc.\n\nNobody will touch a company where one of the foundational founders has begun legal action. This has to be disclosed in any due diligence.\n\nThey might think they are being cunning, but as soon as they run any of this past their lawyer they will realize this isn't something which they can just wait for it to go away.\n\nYou don't need some lawyer who is going to spend 1000's of hours on this. One letter to them from a lawyer and their fundraising will either grind to a halt, or they will lie about it to investors, which your lawyer can send a followup letter to them saying, something like, \"We are uncomfortable having a stake in a company where investors may be unaware of legal action being taken. Thus we're going to rat you out to your investors.\"\n\nI have a friend who was owed a fairly modest amount of money in this sort of situation where they just declared his stock void. When all was said and done, the leverage he had by launching legal action at exactly the wrong time resulted in their paying out more than they would have, had they just paid out the money in the beginning.",
            "score": 289,
            "author": "EmperorOfCanada",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to say this. We run away from something with pending legal from founders.  \n\nOn a side note, Two undergrads we are (generally) going to be looking for someone with experience to tie it together.",
                    "score": 56,
                    "author": "traker998"
                },
                {
                    "level": 1,
                    "comment": "This was very well-written, I enjoyed it, thanks",
                    "score": 4,
                    "author": "nugget-master9"
                },
                {
                    "level": 1,
                    "comment": "This is the correct answer.  Well put.",
                    "score": 8,
                    "author": "Redlinefox45"
                },
                {
                    "level": 1,
                    "comment": "Kind of.  For a round where there is duedil done, certainly.  For something raised on SAFEs, an exec raising money may not have to mention a demand letter.  Assuming a demand letter has even been sent yet.\n\nIt would probably be smart, but smart seems to have departed.\n\nThat said, OP, if you have 10 years of experience and you're messing around with 2 brand new undergrads... this seems like not an unlikely outcome.\n\nBut the best advice is *follow the advice of your fucking lawyer, who you are paying for to be an expert advisor on this matter*.",
                    "score": 7,
                    "author": "xasdfxx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely the best advice is to follow the advice of your lawyer. \n\nI will say that factitative mediation can produce wonders in this scenario and as an attorney AND mediator AND the head of legal office hours for this subreddit, I would hope more people would use it.",
                            "score": 6,
                            "author": "LoveEsq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, but also a good lawyer, which many are not. No matter what you’ll pay a ton/hour, and so it’s critical that you get a no nonsense lawyer that is efficient and clear.\n\nThe company is worth nothing right now. Don’t throw good money after bad.\n\nThis should be 1 hour worth of work for a good lawyer. Like others have said, just send a letter stating you disagree with their action, you own what you own, and to reserve your rights. I wonder if that’s even necessary if your shareholder agreement is clear and shows you have you equity. \n\nIf they raise money, great! You wouldn’t want to stop that. Sue them when the company has a liquidity event and there’s actually money on the table. And pay a lawyer a % of winnings, not hourly; aligns incentives.",
                                    "score": 4,
                                    "author": "singingvike"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's your original contract say?  Is that 30% equity vested?   Regardless, this is a job for your lawyer.",
            "score": 36,
            "author": "noodlez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Standard 30% vested over 4 yrs.\n\nThe clause I didn't sign over was written in by the cofounder. His claim was that he could keep any future work I do outside of the organization. If I started my own company in the same industry, then i'd have to pay him.\n\nI was already researching something in the field in parallel, and over the four months he'd try to weasel his way into getting rights to that as well. Good thing we're going our separate ways, as I write this I realize how much of a red flag this is.\n\nThat was the clause I was bringing to my lawyer on Monday. Either way, had I signed or not the contract would have been void.",
                    "score": 48,
                    "author": "123ngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had a tech company startup cofounder (we tossed him) who thought it would be a thing to try to add to our shareholders agreement that he would get 5% of any future work. Ever. Like 20 years from now if I bought a rental building he and the other cofounders would share 5%. \n\nIt was just weird.",
                            "score": 43,
                            "author": "EmperorOfCanada",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Current day slave owners, what a joke. Where is their sense of morality of any kind?",
                                    "score": 11,
                                    "author": "IfElseThenSwitch"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We're 6mo in. Met them 6 months ago.",
                                    "score": 14,
                                    "author": "123ngineer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you haven’t reached your cliff yet, you don’t have any equity vested, and they can fire you before you get any – a cliff would be pretty useless otherwise. This is exactly how vesting works, you’re just on the wrong side of it. You don’t own 30% of the company. The ownership of any work you have produced or things you have personally paid for depends upon your contract. Talk to your lawyer, but don’t expect anything major to happen. Their lawyer will probably want you to sign something confirming you don’t have any claim to anything, and in exchange, you’ll probably get paid for whatever you put in, with zero equity on the table. They will basically want to make sure you are entirely severed from the business and the vesting schedule is there to help them do that. Startups can’t have ex-founders with a grudge owning equity; this is a death sentence for the startup. The vesting schedule is there to protect startups from this.",
                                            "score": 9,
                                            "author": "JimDabell"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If the cliff didn't kick in yet then you likely signed up for this experience.  You didn't say..\n\nThat said, you can still sue them and see what happens but you have a lawyer already onboard.  If I were in your shoes I'd make it clear that you'd be sure to let any potential investor know and essentially taint their opportunity to raise funds -- if they are going to screw you around - you might as well play dirty too.",
                                            "score": 33,
                                            "author": "drteq"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sorry, so why do you (or your lawyer) think that you're owed anything?  Sounds like there is a cliff and you're being bounced before the cliff is up.  \n\nLots of ways to threaten legal action and make their life rough, but it is a lot easier if your claims are strongly grounded in legal reality.",
                                            "score": 0,
                                            "author": "farmingvillein"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wrote up a longer post but realized it should just boil down to this:  I'm not a a lawyer, so I shouldn't give detailed advice. Your options depend a lot on what your paperwork says and how vested you are.  The contract they want you to sign is probably unenforceable even if you did sign it.",
                            "score": 9,
                            "author": "noodlez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; The contract they want you to sign is probably unenforceable even if you did sign it.\n\nThank you for pointing that out. Was wondering if contracts could have unenforceable absurdities. Is there a rule of thumb to what types of stuff might be unenforceable?",
                                    "score": 2,
                                    "author": "fanoffanchises"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do nothing. Keep all those documentation, emails, chat, proof of work, and evidence. And just do nothing. Let them labor for you and do all the hard work, to make the company successful (if ever). When the time comes, when that startup becomes big, sue them for reparation, or negotiate a settlement - like the FB cofounder who sued FB and got &gt;$300m reward.\n\nYou surely have the IP and the ownership of the company, it's clear. And they are using them and keep using them without your permission, and you haven't signed anything. Don't need to waste money on legal now. Don't sign anything. Let your lawyer send a letter of notice acknowledging your cofounders acted in bad faith (or maybe don't send so they don't get spooked ;) ). Then let them do all the fundraising, building the company, and growing. While you have time to do other things in life knowing you have a potential lottery ticket without having to further labor for it.\n\nLet the wine age!",
            "score": 55,
            "author": "seriesofchoices",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly!  This!  If they didn’t pay you, not only are they in violation of minimum wage laws but any contract is void and they are building their startup on code and IP that they don’t own.",
                    "score": 13,
                    "author": "startupschool4coders",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They would only be in violation of minimum wage laws if OP is a non-exempt employee.",
                            "score": -2,
                            "author": "Moetown84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s not how this legal analysis works. If you don’t know what you’re talking about, please don’t contribute to misinformation.",
                                            "score": -1,
                                            "author": "Moetown84"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Low key genius",
                    "score": 1,
                    "author": "xboxplayer10200",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m down, dm me",
                                    "score": 1,
                                    "author": "xboxplayer10200"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wait for the fund to invest, then send them a letter from your lawyer and arrange for an out of court settlement for double the money of your share, lmao.",
            "score": 14,
            "author": "StevenK71",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way and common practice tbh. I know from experience from a previous bad situation (not similar to OP)",
                    "score": 5,
                    "author": "cs_legend_93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been in a similar situation. 45% equity vested over 5 years. At an early point where it was worth around $100k and sweat equity as the product engineering founder, partners went rouge.\n\nI lawyered up, no real result. Even winning the legal stuff doesn't guarantee a beneficial outcome. Felt bitter about it for years. But the kicker was, the time I had applied myself in the business management and product engineering for that venture set me up to succeed, while the other two are in the same place they were 11 years ago.\n\nLooking back, I wish I had spent less time fighting it and more time putting my energy into processing the greif of the lost potential and channeling my capabilities into experimenting on what to do next.",
            "score": 15,
            "author": "jakxnz",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is inspiring. Thanks for sharing this how you kept moving forward",
                    "score": 3,
                    "author": "cs_legend_93"
                },
                {
                    "level": 1,
                    "comment": "Could you explain more? Did you lawyer up right away? Did the company grow? 45% of 100k isn’t enough to justify many legal bills, especially at risk. Why not wait to sue until the company is successful?",
                    "score": 2,
                    "author": "singingvike",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These things evolve slower than I expected. That $100k was about what my equity was worth at the time things started going off the rails.\n\nOne partner went absent, the other was cutting deals for them behind my back. Our SaaS product reached a service volume of around $750k/year, but the maturity of the operation couldn't get anywhere without an aligned group of founders, so resulted in basically no margin.\n\nLawyers got involved at the time the other two started trying to get us acquired. Reached a settlement for them to buy me out. They yes-manned and never paid, even under court order. The business fizzled. I became a creditor. Then nothing. The effort of pursuing the debt against them personally was something I had always imagined I might do one day, but I had better stuff going on by then, and there were no guarantees, so I never did.",
                            "score": 2,
                            "author": "jakxnz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Geeze man that’s rough. What a couple of wankers.",
                                    "score": 1,
                                    "author": "singingvike"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been presented this situation over and over again during my career advising startups. The advice you're getting below is good - have a lawyer send a cease-and-desist letter and then start letting them know you're willing to take what you want, but they have to release you from the contract (which you NEVER should have signed - lesson here, never sign anything without a thorough review from legal counsel and/or IP attorneys, advisors, mentors, etc.). There are a lot of questions here, however - what, exactly is the \"IP\" - a patent? A copyright? What is the product? \n\nAlso, if they balk or don't answer, I'd just take what is mine and let them know you will market it - since they don't feel obligated to honor agreements, neither will you. That should get some response. If your university has a tech transfer department, check with them to see if they have mentors/advisors for student companies!",
            "score": 11,
            "author": "Far-Finance-3516",
            "replies": [
                {
                    "level": 1,
                    "comment": "He said he didn't sign anything.",
                    "score": 1,
                    "author": "UnArgentoPorElMundo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, my mistake - then they have nothing to stand on - verbals &amp; unsigned agreements are non-enforceable. Give the unsigned copy to your lawyer. Legal fights are nasty but sometimes necessary. And don’t go into business with others without a founder’s agreement, signed by all!",
                            "score": 2,
                            "author": "Far-Finance-3516",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How does a founder's agreement help ? Also what steps can ppl going into a partnership with other's do to bulletproof themselves from getting cheated,etc ?",
                                    "score": 2,
                                    "author": "Peacekeeper2654",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A Founders Agreement sets the terms for ownership, decision-making, roles, &amp; also what to do in case of dissolution, dispute resolution, etc. - it lays the groundwork for how the business will be operated. IMHO don’t go into business with family/friends (it CAN work but the disputes &amp; breakups, in my experience, are the worst); make sure you have legal agreements in place for EVERYTHING- IP ownership, profit sharing, business decision making, buy-outs, investments, etc. I’m not sure even that can bulletproof a partnership, but it’s a good place to start!",
                                            "score": 3,
                                            "author": "Far-Finance-3516"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lawsuit is the ultimate poison pill as no quality minded investors will sink money into a venture where their investment money will be used for legal services knowing that the money will not come back if they are ruled against in a courtroom.\n\nYou have the ip and domain along with the other work done with your skills and while they may be thinking a smart move was made the look on their face once the legal process is explained and the mistake was made will be priceless.\n\nPlease keep everyone up to date as we sit like Gomez Adams knowing that there is going to be a train wreck soon!",
            "score": 4,
            "author": "4WheelPlumber"
        },
        {
            "level": 0,
            "comment": "What does your lawyer say?",
            "score": 9,
            "author": "Sharchimedes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Essentially there are two options - one way is to argue for renumeration and equity, the other is to argue for core rights to the product. Lawyers feedback is that they're acting in bad faith. My perspective is that I don't want to get caught up in legal fees.",
                    "score": 30,
                    "author": "123ngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Investors won't touch them if they know a cofounder was let go, contributed to the project, and the split was not amicable - and their contributions are still being used. It's a legal nightmare for them, and they don't want their investment spent on legal fees. \n\nDo you know what you want? Money? Equity? back in?",
                            "score": 31,
                            "author": "splittestguy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If was the OP the last thing I'd want is back in. 🙄",
                                    "score": 19,
                                    "author": "Geekonomicon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should ask for rights to the product because:\n\n1.You don't want to ask for equity if these guys are running the company, because they're fucking stupid to do have done this, even ignoring the ethics of it, so they're not gonna succeed as a company, so the equity is worthless.\n\n2. Having a pending legal issue like this (even if you just have your lawyer send a letter *threatening* to sue) makes the company un-investable, which guarantees it will fail, which makes its intellectual property almost worthless to your co-founders. By sending a legal demand for product rights, you basically make those product rights useless to them. So the only rational reason to agree not to give it to you would be out of spite, not for any financial reasons.\n\n3. If you believe in the product and get the rights, you can take your work, and go cofound with some other people who don't suck, and use it there.",
                            "score": 14,
                            "author": "Ok-Entertainer-1414"
                        },
                        {
                            "level": 2,
                            "comment": "If you don't want to get tangled in legal fees, your ex-partners have already won. Your best bet probably would be safeguarding future interests since you will not protect the past.",
                            "score": 7,
                            "author": "ogaat"
                        },
                        {
                            "level": 2,
                            "comment": "You are already caught up in legal fees as those happen with or without an attorney, the question is if you want to have legal representation when going through their attempt to cut you out of your ownership rights and how you will strategically attempt to stop that.",
                            "score": 2,
                            "author": "LoveEsq"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I understand this, there was an informal agreement between 3 people.  You all worked together for 6 months and then there was a \"contract\" moment.  You did not sign that contract and have signed nothing formal yet.  \n\n\nSo if you signed no contract yet, then there is no corporate IP to speak of that you created.  You never worked for the corporation.  You own the copyright to everything you produced.  \n\n\nYou can tell them that since the contract is not enforceable as unsigned, then you are happy to walk away with the respective materials you each produced.  If they have something of yours that you created solely, then you can threaten them with copyright violations.  Doesn't matter if you don't have access to it, their act of storing YOUR copyrighted material without permission is illegal.  \n\n\nWithout a contract, you were effectively a contractor working on spec.  They don't own anything you produced until a contract transfers that ownership and IP.  \n\n\nIf your lawyer is not demanding that they return YOUR IP and YOUR COPYRIGHTED WORKS, then your lawyer is not being aggressive enough.\n\n\nIn addition, if they shared their \"IP\" (whatever that's worth) with you, without an NDA, a non-compete, or any legal agreement in place, then you are free to use whatever they told you in your own company, and vice-versa.  You can't take work product of theirs, but ideas are not protected outside of a legal agreement.  It'd be like you showed up to a presentation of theirs as an outsider, were the only one in the audience, and they told you all of their \"secret sauce.\"  You are under NO obligation to them without proof of a binding agreement.",
            "score": 8,
            "author": "talaqen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is copyright automatically assigned when a product is created?",
                    "score": 9,
                    "author": "123ngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A resounding yes.\n\nIt's very hard to not get copyright. You basically have to say \"I waive all rights and release this in the public domain.\"",
                            "score": 8,
                            "author": "Karyo_Ten"
                        },
                        {
                            "level": 2,
                            "comment": "Yes.  Absolutely.  This is why as a CTO I do not let software developers start working on something without a minimum contract in place, even if very tightly scoped.  Otherwise they can (and sometimes do) walk away and start their own companies with it.  Hell they sometimes do it WITH a contract in place because lawyers cost money.",
                            "score": 4,
                            "author": "talaqen"
                        },
                        {
                            "level": 2,
                            "comment": "Yes. You specifically say that you release all this info to the public and that you will not copyright any of this if you don't want something to be copyrighted",
                            "score": 1,
                            "author": "Spiritual_Current_85"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Verbal agreement stand for something and the intention to work together here seems obvious, so I doubt this is how things would pan out legally. Even if OP was not one who had developed the product, there should be a case from all parties to have a stake.",
                    "score": 3,
                    "author": "nextnode",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The verbal agreement then swings both ways.  To be valid work both parties must have consideration.  So if they claim that the work is their’s then there must have been something offered (ie equity).\n\nBut verbal contracts typically don’t hold up if the term is longer than a year or the goods transferred are worth more than $500.  A 4yr vest and a rough estimate of $/hr rate to produce those works would void a verbal agreement pretty quickly and the ownership would fallback to the copyright holder.\n\nAlso, IANAL.  But my point is that there are many avenues to pressure the other founders to resolution.",
                            "score": 4,
                            "author": "talaqen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; The verbal agreement then swings both ways.\n\nThat was my point though.\n\n&gt; Verbal contracts typically don’t hold up if the term is longer than a year or the goods transferred are worth more than $500.\n\nOkay, I had to ask ChatGPT cause I'm also not a lawyer.\n\nWhat it says makes sense to me:\n\nVerbal Agreements: Extend for more than one year. The Statute of Frauds says that they have be written if they are to be performed further than a year in the future (eg delivery of goods) but do not apply generally. Especially if there is some reason for why the agreement is not finalized.\n\nPartnership: In many jurisdictions in the US, a business partnership can be created even without a formal written agreement. If two or more people carry on a business with the intent to share profits, that can be enough to establish a partnership. If a court finds that a partnership was formed, the partners generally share equally in the profits of the partnership, regardless of how much work each partner did, unless there's an agreement stating otherwise.\n\nFiduciary Duties: If a partnership was formed, the partners have fiduciary duties to each other. This generally means they have to act in the best interests of the partnership and not take actions that would harm the partnership. If your cofounders ousted you and are trying to continue the business without you, they may be breaching their fiduciary duties.\n\nIP: Shared if done under the business.\n\nNDAs/Non-compete: Need to be signed to apply, but there is still a duty to the business partnership without anything signed.",
                                    "score": 2,
                                    "author": "nextnode"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't have any experience on this or any advice to give you but I just wanted to say good luck! Please fuck them over.",
            "score": 3,
            "author": "st0rmblue"
        },
        {
            "level": 0,
            "comment": "Did you sign a co-founder agreement with rights to IP?",
            "score": 7,
            "author": "xhatsux",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, because the IP clause voided the contract.\n\nThe last thing I said to them about this was a few days ago: \"I don't feel comfortable signing this \\[contract + ip clause\\] until I review with my lawyer on Monday.\" Co-founders agreed in writing. Conversations surrounding the contract are in my written communications with the cofounder. There are written acknowledgements of my equity stake throughout as well.",
                    "score": 7,
                    "author": "123ngineer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't waste your energy, move on, even if they raise the money they are a long way from making their equity valuable and getting to exit... Take the lesson and move on",
            "score": 2,
            "author": "Mission-Blacksmith-9"
        },
        {
            "level": 0,
            "comment": "&gt;This includes a contract which they pressured me to sign on predatory terms (which I said i'd review with my lawyer before signing - that was to happen on Monday)\n\nDid you sign it? That might be a problem if you did. Do you have the code?  Always keep the code locally. And sign things on your terms if you're a co-founder or walk.\n\nIf you have the code and the knowhow, plus didn't sign anything, and the contact lists, start emailing the investors, and try to raise before they do. And also keep going down the legal road.",
            "score": 2,
            "author": "wind_dude"
        },
        {
            "level": 0,
            "comment": "It seems you aren't prohibited from just continuing on with the venture with a new entity and new partners.  They effectively quit and don't own your work without any agreement to the contrary.  You have a claim against their entity and need to put them on notice with letters to each of them.  They won't be able to take investment without disclosing the matter or face fraud charges.  They may or may not have a claim against your venture, your attorney needs to see if there are any binding obligations among the cofounders, in writing or not.  Until you  all sign a written agreement that specifically says it replaces all prior written and oral agreements, those prior agreements may be enforceable.",
            "score": 2,
            "author": "pixelrow"
        },
        {
            "level": 0,
            "comment": "Breh you have legal counsel and are asking Reddit? Ask your lawyer",
            "score": 2,
            "author": "Background-Singer73",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not asking for legal advice, rather outcomes &amp; shared experiences.",
                    "score": 2,
                    "author": "123ngineer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, luckily you have a shareholders' agreement stating all terms, because obviously you wouldn't have spent that much effort on the project without one... Right?",
            "score": 2,
            "author": "kops212"
        },
        {
            "level": 0,
            "comment": "Should’ve showed up to the vc pitch",
            "score": 2,
            "author": "greenlightgaslight",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did. I also let all the vcs know they're watching two weasels doing standup in advance.",
                    "score": 1,
                    "author": "123ngineer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lawyer",
            "score": 3,
            "author": "fllr"
        },
        {
            "level": 0,
            "comment": "What is your desired outcome?",
            "score": 1,
            "author": "ParkingOven007",
            "replies": [
                {
                    "level": 1,
                    "comment": "Organizationally? I want 30%. Or my idea, I don't know yet. I guess that's the part i'm asking about. What would be easier. \n\nPersonally? I want them to go fuck themselves.",
                    "score": 18,
                    "author": "123ngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't want 30%, these two sound like idiots and will bury this company. I say, if you like the field and product you want your IP back and to just break ties and build your own company - sounds like you don't really need them anyways.",
                            "score": 26,
                            "author": "Savvy_One"
                        },
                        {
                            "level": 2,
                            "comment": "Get the rights to your idea - you don't want to be in business with them and slimeballs like these are likely to cock it up anyway, so 30% equity may be worthless.",
                            "score": 15,
                            "author": "ImNotHere2023"
                        },
                        {
                            "level": 2,
                            "comment": "I would consider three options.  \n\n* 30% equity with strong anti-dilution provisions.  If you think the two clowns have a chance to succeed on their own, favor this one.  Basically you get to be a freerider on the cap table.  \n\n* All the rights to all the intellectual property you've made.  If you believe in the idea and want to work on it on your own, favor this one.  You did a bunch of work in consideration for equity.  The law really doesn't let you make contracts where one party gives something to the other for free.  No consideration = no contract = all the work you've done belongs to you.  \n\n* A cash payment.  You'll have to do some calculus to come up with a number based on what you think you can actually get out of them.  Too high and you'll scare off investors, who will recognize that any investment will go in one door and immediately out the other.  Based on the fact that they are fresh out of undergrad, seems unlikely that they'll personally have deep enough pockets to buy you out.  \n\nYou'll also want to make sure that if they wind down the company (possibly with the intention of starting a new company that does the same thing) you'll get rights to all the intellectual property you've made for them.\n\nYou have good legs to stand on here.  Impress upon them that legal action will bring fundraising to a halt.  You might not have a big legal budget, but I'm betting your budget is bigger than theirs.  The threat of a drawn out battle should make them play ball.  \n\nAs a negotiating tactic, I would think about which of the three options you really want and then concoct terms for the other two that are onerous/excessive to direct them to your desired option.",
                            "score": 5,
                            "author": "Dot8911",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; 30% equity with strong anti-dilution provisions\n\nThis is virtually a guarantee to sink the company.\n\nWhich, hey, maybe OP wants to try to burn it all down...but it also means this option is a complete no-go, from their perspective (i.e., they will fight it indefinitely) for that reason.",
                                    "score": 3,
                                    "author": "farmingvillein",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly this situation has a high likelihood of torpedoing this company regardless.  \n\nIf OP wants to end up with equity, they would probably have to negotiate a more reasonable ask.  Maybe it is the shares they would have gotten if they hit the cliff instead of the full 30%.  Maybe it is anti-dilution provisions that expire after a certain amount of time or after certain events.",
                                            "score": 2,
                                            "author": "Dot8911",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Honestly this situation has a high likelihood of torpedoing this company regardless.\n\nMaybe.  OP seems pretty naive (they don't really understand the concept of the cliff) and a cursory read of the thread suggests that OP's claims are pretty tenuous (unless IP rights got really screwed up...hard to say since OP is not 100% forthcoming about what is going on here).\n\nI'd wager pretty good money that OP's leverage here is likely quite low, other than the general threat of forcing legal bills to get spent.  But once they land the first angel check, the practical value of that threat goes way down (unless OP truly has a case, which, again, I'm pretty skeptical).",
                                                    "score": 1,
                                                    "author": "farmingvillein",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The devil is in the details with this one.  Without knowing exactly that OP signed and when, it is impossible to say.  OP definitely seems like an engineering type, not a business tycoon.  \n\nThat said, even if OP might ultimately lose in court, they can still be enough of a thorn in the side of the fundraising process to get the founders to play ball.",
                                                            "score": 2,
                                                            "author": "Dot8911",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Certainly worth pushing with counsel, and this is, \"at worst\", a nuisance suit that the other founders will probably get legal advice to pay off / make go away.  But, unless there are glaring IP issues, OP should likely highly temper their expectations on outcome.\n\nHonestly, if IP is unclear and OP really built a lot of it, they may find more upside from just going out and raising on it on their own.  With better legal documentation this go around...",
                                                                    "score": 2,
                                                                    "author": "farmingvillein"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;  The law really doesn't let you make contracts where one party gives something to the other for free. No consideration = no contract = all the work you've done belongs to you.\n\nInteresting! I'd like to learn more about that, do you know any online places that elaborate on that?",
                                    "score": 1,
                                    "author": "fanoffanchises",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Check it out: https://en.wikipedia.org/wiki/Consideration  \nIANAL, so definitely talk to legal counsel as the laws may have some nuances in your state/region.",
                                            "score": 3,
                                            "author": "Dot8911"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like a pickle since even if you got the 30% you would want nothing to do with them. I’d personally argue for the cash equivalent and be on my way.",
                            "score": 5,
                            "author": "ParkingOven007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This. Just take the money and give them your 30%. Also make sure any future IP made by you is yours alone or at least not theirs.",
                                    "score": 2,
                                    "author": "mkbilli"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They won’t be able to raise a dime with a law suit up their ass. They are legally required to disclose all on going litigation. At the very least, your lawyer needs to send them a note saying you’re going to sue",
            "score": 1,
            "author": "chrisonhismac"
        },
        {
            "level": 0,
            "comment": "It sounds like you’ve gotten a lot of great advice here. You might also want to consider time boxing how much time you want t spend on this. Mark a date in your calendar, if this isn’t resolved by X day then you’ll move on. Nothing worse than sinking years and tons of money in the past when you could have been rebuilding a better future",
            "score": 1,
            "author": "Mapincanada"
        },
        {
            "level": 0,
            "comment": "On what basis do you claim you are owed 30% of the company? If I understood you correctly, you have no signed agreement?\n\nI'm also trying to see this from the other side in case I was to partner up with a co-founder and we'd fall out after four months. Can one really be worth 30% of the company's current and future value on such a short period of time?",
            "score": 1,
            "author": "duck000111",
            "replies": [
                {
                    "level": 1,
                    "comment": "He might not own 30% of the company, but from the sound of it he owns 100% of the IP.  \n\n\nWhoopsie.",
                    "score": 4,
                    "author": "clavalle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a tough situation to be in. It's good that you've retained legal counsel, as that's the right path to take. With all the documentation you have, including chat records and contracts, you should have a strong case to get what you deserve. Hang in there, keep your head up, and let your lawyer take care of the legalities. Good luck!",
            "score": 1,
            "author": "Embarrassed-Town-635"
        },
        {
            "level": 0,
            "comment": "They made a bad decision.\n\nIf investors find out you were let go, and you're starting legal action in response, then they'll avoid the company like the plague.",
            "score": 1,
            "author": "aerosayan"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have 10 years of domain experience regarding the industry the product is developed in, I don't have prior experience in running a startup with two other people. I think the product has merit, even in the early stages. Ultimately it is up to investors to decide.",
                    "score": 2,
                    "author": "123ngineer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this a shit post? These guys were seriously straight out of undergrad?",
            "score": 1,
            "author": "Prestigious-Disk3158",
            "replies": [
                {
                    "level": 1,
                    "comment": "We're graduate students. I'm older &amp; spent time in the industry, they went directly from undergrad to grad school.",
                    "score": 1,
                    "author": "123ngineer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you developed the product, just wait until something breaks or a customer requests something... then company will come to you asking for help, and you can name your price to consult for them.  \n  \nIn the meantime, hire a contract lawyer and give them every written document you have.",
            "score": 1,
            "author": "redditmudder"
        },
        {
            "level": 0,
            "comment": "So from some discussion, I think ChatGPT actually had some rather valuable points that I did not see elsewhere here.\n\nYour claim:\n\nEquity Stake: If they had a verbal or implied agreement about a ~30% equity stake, this might still be enforceable, even if there's no written contract. Proof of this agreement can come from various sources, including correspondence, meeting minutes, and even the behavior of the parties involved.\n\nIntellectual Property: If they were the primary developer of the product and creator of marketing materials, they may have a strong claim to the copyright and other intellectual property rights related to these assets. However, if these were created as part of the planned company, the other founders might also have rights.\n\nPartnership: In many jurisdictions, a business partnership can be created even without a formal written agreement. If it can be shown that the cofounders carried on as a business with the intent to share profits, a court might recognize this as a de facto partnership, which comes with rights and obligations, including possibly a share of the company's assets.\n\nFiduciary Duties: If a partnership was formed, the cofounders have fiduciary duties to each other. This generally means they have to act in the best interest of the partnership and not take actions that would harm the partnership. If the cofounders ousted them and are trying to continue the business without them, they may be breaching their fiduciary duties.\n\nMoving forward:\n\nClaim your Contributions and Equity: You should assert your rights, in writing, including your claim to your equity stake and your contribution to the intellectual property. This is best done in consultation with your lawyer who can help ensure that your rights are effectively asserted and protected.\n\nConsider Mediation or Arbitration: If a lawsuit seems too costly or time-consuming, you might consider alternative dispute resolution methods such as mediation or arbitration. These can often be faster and less expensive than court litigation, and can sometimes lead to more flexible solutions.",
            "score": 1,
            "author": "nextnode"
        },
        {
            "level": 0,
            "comment": "They took you to school. \n\nReal talk: if you're not ready to raise on your own just write it off and choose better cofounders. They will most likely fail, as most firms do after pre seed raise. It burns now but chalk it up to experience and move on. No amount of lawyering is going to unfuck this situation.\n\nIf you decide to compete don't do it out of spite - you will fail and waste even more of your life trying to rectify a mistake with another mistake. You'd only want to do that if you can really be married to a bigger role and stay committed to pivoting around pre-PMF concept to build a business. If that's not you, just walk it off, find a new project and ghost them.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Don’t lawyer up. Lawyers are paid in billable hours, so they want to make things complicated. \n\nWithout a signed agreement, you can’t really do anything. Pursuing this would be complicated, expensive, and not guaranteed that the prevailing party would get their legal fees covered. You might end up paying more in legal fees than you win.\n\nYou have two reasonable paths forward:\n\n1) if you love the idea still, pursue it yourself with or without better cofounders (and sign an agreement this time ;) the same way you can’t do anything to your cofounders, they can’t do anything to you.\n\n2) if you are over the idea, move on, and if they ever do anything with the company (ie big liquidity event) find a lawyer to sue them on contingency (no legal fees except a % of winnings). Note: if they do this to you in reverse (it sounds like you’d be the more likely to succeed if you pursue this), they’ll probably get some money from you, but do you think zuck is bothered by a 300m settlement?",
            "score": 1,
            "author": "singingvike"
        },
        {
            "level": 0,
            "comment": "You need what’s called a litigation lawyer. They will prepare a “demand letter” which cites their infractions and that you intend to sue if they don’t comply with the operating agreement, with some added legal threats. \n\nThere are usually a couple of these in every major city. If you’re on the east coast, let me know if you need an intro. I’ve recently dealt with a similar scenario. Partnerships are tough.",
            "score": 1,
            "author": "Genetic-Reimon"
        },
        {
            "level": 0,
            "comment": "As my previous experience , the best opinion is - Walk away and start a new one ASAP. You should be happy it happened before funding , see though your co-founder clearly.\nIt is hurt when they stole your idea, but I am doing well and it is owned 100% by me, no need to shit them together, I feel great and comfortable truely. And you will find out it is because you have more important tasks which GOD arrange you to finish.",
            "score": 1,
            "author": "PassiveMate"
        },
        {
            "level": 0,
            "comment": "Hey there, I'm sorry to hear about your situation. It's a tough spot to be in, and it's definitely not what anyone hopes for when starting a business with partners.  \nFirstly, good on you for retaining legal counsel - that's an important step. Your lawyer can help you understand the legal aspects of your situation based on your local laws and the specifics of your case.  \nRemember, any verbal or written agreement you had with your co-founders regarding equity and responsibilities might be important. That documentation you've gathered will likely be very helpful in determining your contribution and rights to the company.  \nIf you can, try to have a clear and calm discussion with your co-founders to resolve this issue amicably. You never know - they might be open to negotiation once they realise the magnitude of the situation.  \nWhile you're at it, consider getting insights from others who've been in similar situations. The [Open Source CEO newsletter](https://open-source-ceo.beehiiv.com/) often shares experiences of founders who've faced all kinds of challenges. You might find some useful advice there.  \nRemember, this is a difficult time, but it's not the end. Whatever happens, you've gained valuable experience that you can apply to your next venture. Keep your chin up!",
            "score": 1,
            "author": "thebillkerr"
        },
        {
            "level": 0,
            "comment": "This kind of stuff is why I never want to have cofounders.",
            "score": 1,
            "author": "LogicMan428"
        },
        {
            "level": 0,
            "comment": "The first approach to avoid these problems is to focus on preventing conflict, rather than trying to fix it when a lot of the mental, emotional and financial damage has already been done. It can be useful for both parties to document what each expects from the setup, but the most positive step you can take is to be open to early professional advice, recognising that disputes and disagreements are inevitable, in the early days of the business and throughout its lifetime. Getting professional advice early on can identify actionable, practical solutions to put, and keep, the business on track.",
            "score": 0,
            "author": "MotionParadoxUK"
        },
        {
            "level": 0,
            "comment": "Write a legal letter from the legal  team telling the founders that since no proper deal has been settled and this means that your legal team will follow them and write to any investor approached in 2023-24.",
            "score": 0,
            "author": "Pure-Contact7322"
        },
        {
            "level": 0,
            "comment": "What is the company you started with them?",
            "score": 0,
            "author": "ABabby1"
        },
        {
            "level": 0,
            "comment": "Make a sha256 of crucial sources and just publish those in a tweet with something like “I hereby claim copyright if the source file that match these hashes, and am in dispute others who claim that the copyright is theirs”",
            "score": 0,
            "author": "paul_h"
        }
    ]
}