{
    "id": "13s8c8j",
    "score": 1,
    "title": "Startup offering multiple services(App/Web development,3D Modeling &amp; Animation, Amazon Seller central management) highly experienced team but not making enough.",
    "author": "Hasnain_k",
    "date": 1685093531.0,
    "url": "https://www.reddit.com/r/startups/comments/13s8c8j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not here for self promotion, only post for useful suggestions. \n\n\nI run small micro agency in which we are offering multiple services like App/Web development, 3D modeling services, Amazon FBA, and sourcing products especially Clothes, Sports and surgical instruments etc. \n\nMy own skills is Amazon FBA and sourcing, I believe my services is better than any expensive agencies. Highly experienced team of Web/App development having 15+ years of experience even we are ready to work on milestones but still not have enough work. \n\nWe also offering high quality 3D modeling &amp; animation services like 3D high poly highly realistic characters, 3D clothes rendering, 3D product modeling and motion graphics designing etc. \n\nMy question is how to find our white label clients? \nHow to increase our visibility?",
    "comments": [
        {
            "level": 0,
            "comment": "You have a costco model. It's just random stuff. Either split out the agency services into independent businesses, or consolidate features into streamlined product services.\n\nThe way you describe it feels like a country general store. I don't doubt you're good at FBA and sourcing, but this hodgepodge feels absurd. App dev has little to do with non-app webdev, 3d modelling, amazon fba.",
            "score": 7,
            "author": "throwawayrandomvowel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you. But I'm optimizing things everyday. \nI know there is no relationship between these services but I'm not the only person to offer all services. I have a small very highly experienced, professional team and have a strong portfolio as well.",
                    "score": -1,
                    "author": "Hasnain_k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Need some marketing tips? I’m looking to get into the development world so I can take any advice that you have",
            "score": 1,
            "author": "VeryShadyVS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Work with Seniors.",
                    "score": 1,
                    "author": "Hasnain_k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take a look at Netrush. Sounds similar but I think they've represented their USP pretty well.",
            "score": 1,
            "author": "mosodigital"
        }
    ]
}