{
    "id": "13s8tpa",
    "score": 6,
    "title": "Hey, what's wrong?",
    "author": "AutoModerator",
    "date": 1685095251.0,
    "url": "https://www.reddit.com/r/startups/comments/13s8tpa",
    "media_urls": [],
    "other_urls": [],
    "postText": "*This is* /r/startups *emotional support thread. There will be no problem-solving here, no judgement, no networking, no advice. We're here to be heard, be understood, and be told that it'll be okay, that whatever happens, we care. Still, be tactful and classy in how you vent your feelings and share your frustrations.  Act in a mature manner. This is meant to be a safe place to support emotional and physical health and there is a zero tolerance policy in effect. Be kind.  Please report any conduct that is in violation of that key tenet.*\n\n# Howdy there. Did you have a rough week? It's certainly been a rough year. Did you get in an argument? Have a problem? Tell me about it. What's wrong?",
    "comments": [
        {
            "level": 0,
            "comment": "Fucking projections. What is the point? Every minute I spend guessing at the future, I don't spend making it happen.",
            "score": 6,
            "author": "RippleEngineering"
        },
        {
            "level": 0,
            "comment": "Dang, people, startup people and even other startup tells me our environmental-focused product is not worth the effort, and needs to focus on profitability only to be funded. Our part-time advisor even told me to remove the slide on our pitch deck that says about the problem regarding the environment..\n\nWe are a startup that wants to redefine green fintech, and I can already see the big wall in front of me!",
            "score": 4,
            "author": "nakiami08",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re working towards something that seeks to better the world in one way or another, then I think it’s worth it. It will definitely be a more difficult path to establishing your company, but stick with it. We need more people who seek to do good like you!",
                    "score": 3,
                    "author": "Fun_Discipline_1678",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank You!! That is very reassuring. \n\nAfter talking to that startup advisor, I feel like most investors only want profitability in mind, and do not believe in dreams.\n\nDon't get me wrong, our dream is big, but it doesn't mean it is unrealistic. :)",
                            "score": 2,
                            "author": "nakiami08"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some days I am just overwhelmed, that's all",
            "score": 2,
            "author": "yourmdonline"
        },
        {
            "level": 0,
            "comment": "Always feel like i’m not good enough, or not smart enough or that I have no value.",
            "score": 2,
            "author": "brightonquin"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, automod broke today. Haven't gotten everything working yet!",
                    "score": 1,
                    "author": "kishi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a physical product that is similar to a dumbell. Based on other markets' users, it's having profoudn impact on eliminating irritable bowel syndrome (IBS) symptoms. This has been an unexpected finding but as a fellow GI patient, I am really passionate about making this more known but don't know the first thing about doing clinical trials (which I am guessing to make this claim). Or, is it possible to sell this product based on customer feedback for IBS as long as I don't say it \"cures\" Do I need to have clinical research done to make these advertisements? And, if so, how does one go about this? What is the most cost-effective way? (Asking as a small business owner)\r  \n\r  \nThank you for any advice you can share.",
            "score": 1,
            "author": "AspiringFounder"
        },
        {
            "level": 0,
            "comment": "so many options are what to do, so hard to prioritize.",
            "score": 1,
            "author": "remotecamp_founder"
        },
        {
            "level": 0,
            "comment": "I'm grinding my a\\*\\* off on getting my startup off the ground. Trying to get more users. My cofounder who handles the app development isn't as invested as me. I'm on my David Goggins, Burn the boats, grinding in the lab energy. But our retention is pretty bad because our app needs improvements. I also want to jump 10 levels and it just doensn't work like that.",
            "score": 1,
            "author": "vibecheck4dating"
        },
        {
            "level": 0,
            "comment": "Just a lot going on. Stay strong people :) Glad I found this community to help others and hopefully gain some happiness from doing that on a topic I love :)",
            "score": 1,
            "author": "Mesredi"
        },
        {
            "level": 0,
            "comment": "I have a genius, revolutionary idea that I can’t execute. The idea that technical cofounders must be paid is so silly to me considering how advice I get is to learn to code myself.\n\nWhat I mean is this. If I was to learn to code and build a full stack application that would take me over a year. If a full stack developer did it, they could build an MVP is a month working full time. \n\nSo what that means is to me, is why would a full stack dev not be interested in working part time for free. Why not, if the developer thought the idea was that good, would they not be interested in throwing a few hours a week at a side project.\n\nI don’t understand the idea that founders are expected to work full time jobs (like I do) and do everything to build their idea (for free) but cofounders always want to be paid. \n\nI want to be paid.\n\nThis is basic logic. The only difference between me and the cofounder is that it’s my idea. If the technical cofounder had their own idea they would happily build it for free and not pay themselves.\n\nThat means the only limiting factor is the idea being good enough not the actual money.",
            "score": -4,
            "author": "Strong_Berry_4540",
            "replies": [
                {
                    "level": 1,
                    "comment": "People get paid in a few ways. Either equity or cash. If you aren’t paying cash then you need to be paying them in serious equity, because you are also getting paid in serious equity, if they wish to take equity as a form of compensation. If they want cash, then you cut down on what they would get as equity. Not sure why that is so hard to understand. \n\nAlso, you saying that the only difference is that it’s your idea is ridiculous. There is a gaping chasm of ability between you and a technical. You can either close that chasm by learning to be technical (you probably won’t because despite you saying the idea is that good, few every actually do what is needed to execute), or pay up baby. After all, non- technicals with ideas are in plenty supply. You’re not in a strong negotiating position.",
                    "score": 8,
                    "author": "Snooprematic"
                }
            ]
        }
    ]
}