{
    "id": "13urrre",
    "score": 90,
    "title": "Dealing with the worst customer ever.",
    "author": "soymercader",
    "date": 1685358409.0,
    "url": "https://www.reddit.com/r/startups/comments/13urrre",
    "media_urls": [],
    "other_urls": [],
    "postText": "I work for a SaaS company.\n\nOur pricing plans are fremium and not very costly.\n\nWe offer customer support via live chat on our website and email. Besides that, we have presence in some socials.\n\nWe have 4.5k paying users.\n\nThere's one customer in our lowest pricing tier that will always reach out to us via Twitter.\n\nWe try to redirect them to our live chat every time since it's the fastest and easiest for us, but they won't listen to us stating that they are not want to talk to chatbots. Our live chat is fully managed by humans, and they know, but they do not want to listen.\n\nWe get 10 tweets a week from this person. Each time it gets worse. They have started being offensive rather than rude or non polite.\n\nAt what point should we consider blocking them from our socials?",
    "comments": [
        {
            "level": 0,
            "comment": "Give them a very polite first and final warning (on something public) that they can't be abusive to staff.  Next time they are, dump them.",
            "score": 59,
            "author": "StopDropAndRollTide"
        },
        {
            "level": 0,
            "comment": "Fire them. They’re taking up too much of your time and resources. Customer isn’t always right.",
            "score": 135,
            "author": "Sweetsnteets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Warn once first unless concerned for safety.",
                    "score": 19,
                    "author": "StoneCypher"
                },
                {
                    "level": 1,
                    "comment": "\"We're refunding your last payment of ${x} and terminating service, effective close of business 30 May 2023.  This decision is final.\"",
                    "score": 22,
                    "author": "xasdfxx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice. That’s today.",
                            "score": 3,
                            "author": "Alternative_Log3012"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They appear to be attempting to influence how others see you.\n\nSent to this person, in private, the next time they send anything in public:\n\n\"Hi, we've noticed that you've become significantly impolite in public, while seeking support.  We need to protect the health and well being of our staff.  At this time we consider you in violation of our terms of service.  We are reconsidering the appropriacy of maintaining this account, at this time.\"\n\n\"Moving forwards, support requests should not be in public channels.  Please consider this a formal and final warning.  We have a fully human staffed chat system, as well as email, and a phone number. \n You are invited to use those channels.  If these escalating attempts at public shaming continue to harm our staff, we will be forced to end this business relationship.  Thank you for understanding.\"\n\n\"We appreciate your business.\"\n\nThen immediately block them on Twitter.\n\nThey'll either get the message, or they won't.  In either situation, you know what's next.",
            "score": 42,
            "author": "StoneCypher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anything sent it private can become public.",
                    "score": 1,
                    "author": "sbfeibish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before you block him make sure you have enough printscreens of all their abuse in case they go public with your actions.",
            "score": 39,
            "author": "kbic93"
        },
        {
            "level": 0,
            "comment": "The first time they said something offensive was the time to warn them. The second time was the best time to fire them as a customer and block them.",
            "score": 65,
            "author": "mrteacherman24"
        },
        {
            "level": 0,
            "comment": "Send him to competitors:)",
            "score": 13,
            "author": "nnurmanov"
        },
        {
            "level": 0,
            "comment": "That point is in the past now. You should block such customers if they have clearly shown an intent to create a ruckus repeatedly.",
            "score": 10,
            "author": "tintinity"
        },
        {
            "level": 0,
            "comment": "Could they be a competitor?",
            "score": 7,
            "author": "geocapital",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's something we have thought of.",
                    "score": 6,
                    "author": "soymercader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why not just block them? \n\nI was running a kickstarter campaign and had one person commenting all over my social media that they never got the email even though I manually sent them an email several times and they were on our mailing list. I told them to check their spam, but they just didn't want to listen. They were posting negative comments all over the place. So I had to block them.",
            "score": 7,
            "author": "Dogs_Bonez"
        },
        {
            "level": 0,
            "comment": "Drop them and focus on the other 4.999k paying customers.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "define: **the delusion of control.**\n\n\"ban them; suspend them; block them etc\"\n\n\\--\n\njust tell one of your human live support people to monitor the account and resolve his or her issues publicly, online.   \n\nits an opportunity to broadcast the solution, while also showing your responsive to your customer needs.  end each message with the help line and \"ask for patty\" (make up a name for someone who doesn't work).  anyone who calls you know came off this one customer and your actual solution --working with them, instead of against them and leveraging social media for its real purpose, mass communication.",
            "score": 4,
            "author": "KusUmUmmak",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have been doing that for 6 months now.\nWe have improved our UI so it's more intuitive according to their feedback.\nBut they still reach out to us with made up \"bugs\", and a disrespectful and racist tone. We have been dealing with them for half a year.\nMy question is where the limit is.",
                    "score": 4,
                    "author": "soymercader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just raise your lower tier pricing.  or get rid of it.  or run it as a promo for 'new customers'.  or time limit it.\n\nI'm not going to justify for you getting rid of your customer.  thats on you.  I will note in passing:\n\n* a disrespectful and racist **tone** is typically not a valid reason to broom a customer.  thats the gig.  you deal with the public, you take all comers.  once you start into getting rid of people you don't like, or people who are difficult, the bar will eventually slip to the detriment of the business.\n* just because you can't replicate a bug, doesn't mean they're not experiencing one.  put in some ui replay/app telemetry in place so you know for sure IF they're experiencing a problem.\n\ngood luck.",
                            "score": -8,
                            "author": "KusUmUmmak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty low tier advice here ngl.",
                                    "score": 2,
                                    "author": "Alternative_Log3012",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oh? in what way?",
                                            "score": 1,
                                            "author": "KusUmUmmak"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This person represents &lt; 0.02% of your revenue. Thinking about this is a waste of your mental energy. Just fire them.\n\n\"Since we have been unable to meet your expectations with our service, we are canceling and refunding your subscription effective immediately.\"",
            "score": 3,
            "author": "Ok-Entertainer-1414"
        },
        {
            "level": 0,
            "comment": "Block them",
            "score": 12,
            "author": "progressgang",
            "replies": [
                {
                    "level": 1,
                    "comment": "Better be. For the sake of it",
                    "score": 2,
                    "author": "GrossReformer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;\tThere’s one customer in our lowest pricing tier that will always reach out to us via Twitter.\n\nIt’s always the smallest customers who are the most unreasonable.\n\nThe customer is always wrong.\n\nKidding of course. But it can be dangerous to think the other way around…",
            "score": 3,
            "author": "unnamedplayerr"
        },
        {
            "level": 0,
            "comment": "Well he made a paper trail of his asshattery on Twitter. Update your terms of use. Suspend his account until he agrees. If he keeps doing this you can perm suspect for violation. Minimal reach out. Don’t engage on Twitter. \n\nYou are not losing customers to this person being a Karen on Twitter",
            "score": 7,
            "author": "bravo_ragazzo"
        },
        {
            "level": 0,
            "comment": "The best way to handle this could be to suspend their account on your platform after you give them a fair warning because they don't abide by the terms and conditions and/or community guidelines.",
            "score": 2,
            "author": "metyaz"
        },
        {
            "level": 0,
            "comment": "Just close their account and refund their money. You don’t have to please everyone and every customer.",
            "score": 2,
            "author": "tbss123456"
        },
        {
            "level": 0,
            "comment": "If their complaints are valid then first try to solve  them, and always try to see the problem from their perspective. Turning an unhappy customer into a happy one generally means future loyalty. That said, if their complaints are BS just block them on all social media so they don’t sow doubts with future potentials. Remember, some people just want to see the world burn and nothing you can do will help them. Those ones are always best to block.",
            "score": 4,
            "author": "Overheating_PU239",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is a difference between an unhappy customer and a bad one. Shitty customers stay shitty. Not worth the time.",
                    "score": 5,
                    "author": "Snooprematic"
                },
                {
                    "level": 1,
                    "comment": "Issue is that out of their 100 complaints, 2 were valid and solved, but most times, they will just complain about BS.\n\nAnd they will always be abusive to us.",
                    "score": 7,
                    "author": "soymercader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just drop em",
                            "score": 10,
                            "author": "Necroking695"
                        },
                        {
                            "level": 2,
                            "comment": "95% of the time, when a vendor says something like this, it's a terrible customer.\n\nOne time in twenty, the vendor is overreacting.\n\nIt would be worthwhile, since this is already public, to get a disinterested third party to take a look, and confirm that they agree that you are being abused.\n\nOnce you have a disinterested third party saying \"wow, that person really is a jerk,\" then you should be emotionally on much more solid grounds to take action.\n\nPlease remember, when that one in twenty happens, it's still not usually the vendor's fault.  I'm not pointing fingers.  The #1 cause I've seen is different expectations and modes of communication between countries.\n\nBecause I'm curious, I volunteer as a litmus test.  Feel free to PM if interested in maintaining privacy.",
                            "score": 3,
                            "author": "StoneCypher"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they hate bots, treat your Twitter responses to them like a bot. \"I'm sorry, I didn't understand, type \"1\" for tech support, \"2\" for ....\n\n80% of the problems are caused by 20% of the people...give or take.",
            "score": 3,
            "author": "Biking_dude",
            "replies": [
                {
                    "level": 1,
                    "comment": "We tried that, but they don't understand irony.",
                    "score": 1,
                    "author": "soymercader"
                },
                {
                    "level": 1,
                    "comment": "While I would get a kick out of it - this passive aggressive approach doesn't solve any problems quickly or cleanly.",
                    "score": 1,
                    "author": "easy_mak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a ton of companies that use automated Twitter responses to issues and complaints. If you @ most airlines you'll get one (well, not sure after the Great Musking of 2023). Right now, the OP's customer being rewarded for using Twitter, take the reward away.",
                            "score": 1,
                            "author": "Biking_dude"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can drop them, but be careful you don't create a policy based off of this one customer which means you are missing customers in the future who can help your company. These are people who care about your product and want it to be better, even if it is directed with the wrong energy. It's really no different from a junior employee who needs a little management to see how their time can be beneficial for everyone and grow. If you don't have time to give to manage this, it's okay, but loud customers tend to be more helpful than not in my experience.\n\nTruly, most companies today miss their greatest resource, I see it all the time. Loud customers (if they are not unruly) will help you catch things your paid employees never will.",
            "score": 2,
            "author": "doodlebro",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; These are people who care about your product and want it to be better\n\n\nNah brah. It doesn't matter their intentions. If their actions don't reflect them, then good riddance.",
                    "score": 0,
                    "author": "ThirdEncounter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "never! This guy should be your favorite customer!  \nHe pays to use your product and share feedback for free  \nJust give him more value, write him that he is your favorite customer, and because he knows so much about your product and what is important for customers then you want to give him a volunteer position to help others or help your company create FAQ or be a moderator in the Twitter group.   \nSo many solutions, just pick one.",
            "score": -6,
            "author": "remotecamp_founder",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have 100 other customers who bring valuable feedback daily. And they do it without being rude and/or racist.\nIt's not about what he says, but about how he says things.",
                    "score": 6,
                    "author": "soymercader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re getting shit advice other than this person’s post. You don’t fire them, you convert them and they become your biggest fans and sources of referrals. I’m 20+ years into SaaS and trust me when I say you’re sitting on a goldmine. I’d invite them to a big call, send them food and have an agenda to head them out and address the product concerns and you address your relationship concerns. I know an excellent customer experience consultant. If you’re interested DM me. Remember this is a potential goldmine.",
                            "score": -5,
                            "author": "catchyphrase"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Final warning and ban them)",
            "score": 1,
            "author": "slavafree120"
        },
        {
            "level": 0,
            "comment": "Fire them",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Lowest pricing tier customer taking your time from high pricing tier. So definitely not worth it.\n\nAlso the rudeness in any manner should not be entertained. \n\nAs already mentioned in the responses, block them after 1 to 2 warnings.\n\nBest Wishes!",
            "score": 1,
            "author": "reachyourpotential"
        },
        {
            "level": 0,
            "comment": "Mental illness. Block them and kick them off the service. You are not a public institution that is required to serve everyone.",
            "score": 1,
            "author": "ubercorey"
        },
        {
            "level": 0,
            "comment": "Just refund them and stop doing business with them. One bad apple and all that.\n\nNo point letting it bother you. In fact. Enjoy firing this asshole imo",
            "score": 1,
            "author": "TILTNSTACK"
        },
        {
            "level": 0,
            "comment": "Months ago, duh.",
            "score": 1,
            "author": "megablast"
        },
        {
            "level": 0,
            "comment": "Just drop them.",
            "score": 1,
            "author": "Splitternew"
        },
        {
            "level": 0,
            "comment": "Some people are psychopaths. Consider tracking his username and all their social profiles for a full block.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Absolutely!! I would direct them one last time politely to the website chat and proceed to block the other channels of communication.",
            "score": 1,
            "author": "Dismal_Land6765"
        },
        {
            "level": 0,
            "comment": "If you are not the owner of the company, you are obligated to treat him equally as other customers, even if he is a dick. If he complains for something then the software is not for him or your company's policy is to ignore them since it's a freemium and it is not justified. I mean you say it's a freemium, which sounds like you don't value or respect the business/software you are offering.",
            "score": -7,
            "author": "Just_a_guy_345",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not that deep. We’re in the era of returning the same energy that annoying customers gives. \n\nBlock that guy",
                    "score": 5,
                    "author": "Cloutttt"
                },
                {
                    "level": 1,
                    "comment": "A good owner would agree that this one customer is causing trouble within the org and give the go ahead to fire the customer.",
                    "score": 2,
                    "author": "bonestamp"
                }
            ]
        }
    ]
}