{
    "id": "13v09om",
    "score": 0,
    "title": "As a startup founder, what are your biggest challenges with creating an effective pitch deck?",
    "author": "Chubbypicklefuzznut",
    "date": 1685379386.0,
    "url": "https://www.reddit.com/r/startups/comments/13v09om",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm curious to learn about other founders' experiences when creating a pitch deck, specifically, what are the biggest obstacles you've encountered when creating one? Getting Data? Writing Content? Design? \n\nOn the flipside, what's made the experience of creating a pitch deck easier for you?",
    "comments": [
        {
            "level": 0,
            "comment": "Pitch Decks are not business plans, they are BAIT!  Think of fishing, What kind of bait or lure will you use to catch the big fish?\n\nIt should be simple, concise and convey emotional elements. Lose all the jargon and corporate speak. \n\nThis is a great example - https://medium.com/the-mission/the-greatest-sales-deck-ive-ever-seen-4f4ef3391ba0",
            "score": 12,
            "author": "DitchtheMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like the analogy! I imagine for some people, particularly focused on very techie type solutions, that it can be challenging to develop high-level, concise, and relatable statements for a pitch deck that engage an audience.",
                    "score": 3,
                    "author": "Chubbypicklefuzznut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Understanding the company's value proposition and how to best present that to investors and customers. You keep getting better and better at understanding the value proposition, and better at communicating it by creating pitch decks, talking to investors, and talking to customers.",
            "score": 3,
            "author": "danjlwex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Knowing your customers is key. They can tell you what they like/ don't like, what's useful/what's not, and through that exercise refine your understanding of what provides them with the most value.",
                    "score": 1,
                    "author": "Chubbypicklefuzznut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Add the conceptual UI design of your product to it.",
            "score": 2,
            "author": "HKamkar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point! To keep your presentation engaging, maybe highlight 3-5 key elements to demonstrate the benefit, ease of use, or differentiation from similar products. Draw the connection between the UI and how it has the potential to impact the market.",
                    "score": 2,
                    "author": "Chubbypicklefuzznut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brand new to the startup game..but I used a template from canva and redid it to our branding. Then after every time I send my deck, I ask for feedback and refine it.",
            "score": 2,
            "author": "DonAndresCR",
            "replies": [
                {
                    "level": 1,
                    "comment": "What challenges did you encounter when creating the content and finding data to incorporate?",
                    "score": 1,
                    "author": "Chubbypicklefuzznut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched Slidebean and yc videos on YouTube.",
                            "score": 1,
                            "author": "DonAndresCR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where did you find that helped you the most? Were there certain slides you had more difficulty with than others?",
                                    "score": 1,
                                    "author": "Chubbypicklefuzznut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Those videos will help you a lot. I am continuously refining my deck.",
                                            "score": 1,
                                            "author": "DonAndresCR"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You really need to understand the product and the value it brings, then research the market and explain the opportunity that this project bring. The thing is be precise, not too much information, the pitch is only the bait.",
            "score": 2,
            "author": "Edv100"
        },
        {
            "level": 0,
            "comment": "I find presenting anything, it helps to draft out what I would be saying before jumpinging into building a deck to support it. That includes shaping a compelling story that illustrates the market opportunity, the roadmap for how to get there, and why you're uniquely suited to solve that problem. Then try to counter all these areas and anticipate questions.\n\nOnce those elements are clear, adding slides is the easy part.",
            "score": 2,
            "author": "wildcard_71"
        },
        {
            "level": 0,
            "comment": "People mistake a Pitch Deck with a Teaser Deck all the time. A teaser deck is the deck you'd use to get an investor meeting and therefore it needs to have a lot more guidance in the language for the narrative.\n\nThere's a group called Deck Doctors that puts out great content about this and works alongside the team at Hustle Fund. I believe they're publishing a free book about pitch deck creation in June! Keep your eyes out!",
            "score": 1,
            "author": "SlazarusVC",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good to note the distinction between the teaser and pitch deck.",
                    "score": 1,
                    "author": "Chubbypicklefuzznut"
                }
            ]
        }
    ]
}