{
    "id": "13voebz",
    "score": 11,
    "title": "Potential investors asking 5-year projection",
    "author": "alka_irl",
    "date": 1685448212.0,
    "url": "https://www.reddit.com/r/startups/comments/13voebz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, \n\n Potential investor asking for a 5-year projection. I have only 2 months of revenue data and 6 months of traction data such as click rates, and open rates and we just finished developing the app. So, for me, it doesn't make sense to ask for a 5-year projection. How can I even provide accurate projections? It is okay to provide for 2 years but 5 years? I can only provide my dreams of revenue predictions after 2 years if everything goes well and if we couldn't see a new economic breakdown, war, or pandemic. \n\nI know that they want to see the future of the project but it will not be that much accurate.  They want to see the bigger picture created by us, but wouldn't it make more sense to want to see the potential of the product, what audiences it will appeal to in the future, what it will cover, and how it will provide a competitive advantage rather than revenue?\n\nI have already done market research, and where  I am going to spend the investment. I can make predictions according to our burning rates on some promotional methods such as ads, detailed lead generations, etc.\n\nI can provide that \"If I spend that amount of money on that part, the normal conversion rate will be like that and we will reach that revenue\" for only the next 2-3 years. (I even add inflation rates to make it more accurate)\n\nAfter 2-3 years, how can I predict the revenue? In my country, last year the inflation rate was %87 and I burned the money earlier because we needed to raise salaries. God knows what's going to happen next year. \n\nMy honest question would be that is it makes sense and if it is, how should I prepare revenue estimations for the remaining two years?",
    "comments": [
        {
            "level": 0,
            "comment": "Just show them a trending upwards chart that starts at “now” and ends in “2028” and have not 3 but 4 dollar signs on it",
            "score": 32,
            "author": "NullAnony"
        },
        {
            "level": 0,
            "comment": "They know it's made up, so are market predictions made by analysts that make big bucks at investment banks. Provide some scenarios and do some research into the market. This similar company did this, we are different in these ways and the market is different now in these ways so we think the growth might be like this. I'm a more conservative scenario, we might be like this.",
            "score": 13,
            "author": "skelo"
        },
        {
            "level": 0,
            "comment": "Take a hockey stick and trace a trend line. The race is on.",
            "score": 10,
            "author": "pigeon888",
            "replies": [
                {
                    "level": 1,
                    "comment": "snicker.  underrated comment right there. :)",
                    "score": 3,
                    "author": "KusUmUmmak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Projections are near impossible to predict, however they are a bed-rock of business plans. Just search for a template and fill it with your data accordingly (SBA has templates available).\n\nAlso, it seems you're in Argentina or Turkey based on your inflation rate 😂",
            "score": 7,
            "author": "TheBeardMD"
        },
        {
            "level": 0,
            "comment": "If the investor is any good, a 5-yr forecast request is usually intended to pressure test how you think…and get you to explore what critical milestones need to happen along the growth journey. For example, does the distribution model evolve during this period to include channel partners to expand reach? Are there strategic BD opportunities to exploit? Other market expansion opportunities with higher price point (or scale)? What else potentially occurs - within your span of control/influence - that can accelerate the growth curve? I’d probably model out a few different scenarios (best vs worst case) and talk about critical underlying biz growth drivers. External economic factors outside of your control can be mentioned…but no need to spend much time there at all.",
            "score": 6,
            "author": "CaffeinatedRob_8",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you model this out 5 yrs, I’d show individual line items under revenue to layer in theoretical growth drivers. Perhaps line item #1 reflects status quo trajectory (based on current biz model). Next year, perhaps #2 reflects a premium version (higher price point) or something that throws off more rev / changes curve positively. Year 3-4, maybe reflect what happens with a distribution partner. These are of course all hypothetical situations. But this is an example of how your model should reflect these things",
                    "score": 2,
                    "author": "CaffeinatedRob_8"
                },
                {
                    "level": 1,
                    "comment": "This is the answer. It’s less about the actual number and more about how arrived at that number. They want to see you are thinking rationally about your business and know what it’s going to take to achieve healthy growth over time. There are various ways of doing this, and simply showing a hockey stick with inflated numbers isn’t going to impress anyone. You need to talk about inflection points, key milestones and revenue drivers, expansion into new markets and use cases, etc.",
                    "score": 2,
                    "author": "ItchyTheAssHole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 5 year forecasts are a high level test of whether or not you understand (or even researched) the market size, your tam, expected penetration, and made realistic (even if they’re WAGs) assumptions and milestones as to how the company will achieve this growth.\n\nFor example, as an investor, if someone shows me a 5 year forecast showing that they’re going to have triple digit revenue growth every year and capture 90% of the market by year 5 with only a few employees and 95% gross margins, and exit with a 20x multiple, well, ya either didn’t do your homework or ya don’t know what you’re doing. \n\nIt’s ok to make assumptions, just make sure they are justified and ‘make sense’ when back checked against known data. \n\nPerfect example: remember when all the Beyond Meat and other products were valued more than the sum of all their global ingredient commodity markets combined?\n\nEDIT: Holy shit, I just Googled how BYND is doing today, and lookie at this lmfao. Don’t do this in your forecasts…”we can sell more pea-burgers than all the global pea supply chains can harvest!!!” = class action lawsuit . Granted, the BYND investors that believed the company’s claims didn’t do their own due diligence…it was pretty f’ng obvious that they forecast projected growth that exceeded supply chain and production capabilities, if you didn’t have a pea-brain ;) . \n\n\nhttps://topclassactions.com/lawsuit-settlements/securities/beyond-meat-class-action-alleges-company-misrepresented-production-capabilities/",
            "score": 4,
            "author": "jklolffgg"
        },
        {
            "level": 0,
            "comment": "Investor wants to see a few things from you.   Your reasoned view of how large the company could get.  Your thought process in how you would grow revenue to hit that number.   They know it’s unlikely anything will go according to the plan but they want to invest in something that has the potential to get big and valuable.   Show them how that could happen.   Investors want to see they can make a great return on their investment if they give you their money.   If you aren’t convinced and can tell a good story how this could be big, then don’t expect much investment.   Keep in mind that investors are looking at many opportunities besides yours, so you need to sell your investment proposal against the alternatives.",
            "score": 2,
            "author": "jcurie"
        },
        {
            "level": 0,
            "comment": "Any reasonable investor will understand that all the numbers are guesses. If they are smart, this question is really about understanding if you are capable of managing a business, understand your target market, and how well you can communicate business concepts. They also may be fishing for your exit strategy. Do you want to stay in for the long haul? Or do you want to get out quickly? Perhaps they don't know your market and want to understand the TAM. Or, they may just be stupid investors.",
            "score": 2,
            "author": "danjlwex"
        },
        {
            "level": 0,
            "comment": "Investors are not looking for scientific predictions, but a convincing narrative with data.  \n\n\nWhat are your ambitions over the next 5 years?  \nWhat is the total addressable market, and how much of that do you think you can capture within 5 years optimistically?  \nWhich steps will you take to get to that number?  \nCan this investment  even make me money within this time frame?  \n\n\nThat is what they are really asking. Nobody knows the future, least of all investors, so you have to sell them your vision of the future.",
            "score": 2,
            "author": "fumbleforce"
        },
        {
            "level": 0,
            "comment": "He wants understand how you deep understand your business and customers. It is logic test.",
            "score": 2,
            "author": "slavafree120"
        },
        {
            "level": 0,
            "comment": "I would ask you for a 2-year cost projection since that is one thing that we can look at.",
            "score": 1,
            "author": "darthnilus"
        },
        {
            "level": 0,
            "comment": "Forecast accurately for the next year and simply extend the line with linear extrapolation (assume everything will be exactly the same).",
            "score": 1,
            "author": "Jazzlike_Painter_118"
        },
        {
            "level": 0,
            "comment": "Create a 5 year plan of what you're expecting and building towards. You want to de-risk the investment, so showing you have a plan is super meaningful.",
            "score": 1,
            "author": "Standard_Let_6152"
        },
        {
            "level": 0,
            "comment": "Just show TAM with 5 year CAGR and estimated market share and draw the first half of an s curve towards it :)",
            "score": 1,
            "author": "erelim"
        },
        {
            "level": 0,
            "comment": "Have you heard of lying? It's the trick behind every successfully VC-funded startup.",
            "score": 1,
            "author": "FlorAhhh"
        },
        {
            "level": 0,
            "comment": "You can also find similar companies and show their valuation after five years.",
            "score": 1,
            "author": "geocapital"
        },
        {
            "level": 0,
            "comment": "It’s not uncommon. We told our startups to produce 5 years so they’d have 2 years done. \n\nReason? It’s not enough to tell an investor about 2 years when they’re in the fund for 8-10 years. They wanna know more. Even if it’s just how you think it will work. Got a strategy for 2 years? Great. What then? How do you boost to 10x revenue year on year beyond 2.",
            "score": 1,
            "author": "GlobalEvening4931"
        },
        {
            "level": 0,
            "comment": "Those are usually more to see whether you can understand (ballpark) how a business will develop and how much additional capital will be required and how you plan on scaling. See it as an exercise to also understand your data better. We used startuprunway.io for it - great tool to quickly visualize and model such scenarios",
            "score": 1,
            "author": "miszkah"
        },
        {
            "level": 0,
            "comment": "can you find a competitor and (more or less) use their revenue numbers. you can google \"competitor\\_name revenue 2022\", \"competitor\\_name deck\", \"\"competitor\\_name financials\". You might get lucky and find numbers for some years, then you just plug it in to some sheet.\n\nI am listening to this german podcast and they have a nice sheet on many many public companies:[https://docs.google.com/spreadsheets/d/1m3h9Xce3SRMaq20li2Qg4HuSZowwxQSd9FkQmeuI7Dw/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1m3h9Xce3SRMaq20li2Qg4HuSZowwxQSd9FkQmeuI7Dw/edit?usp=sharing)\n\nIt's likely total overkill if you dont have a finance background, but you can use some of the ratios. I.e. if they make 100M in revenue - how much % they spend on sales and marketing and stuff. This should help you to be able to build the projects (as hard as this is).\n\nPre-product market fit, i think it's even hard to tell what happens next week :)",
            "score": 1,
            "author": "CerealKiller5609"
        },
        {
            "level": 0,
            "comment": "Hello founders!  \nI just want to extend my services for free  \nhttps://drive.google.com/file/d/1uSdPWtgRf-LVZFVXFukG\\_7iu7CxL5exv/view?usp=drive\\_link  \nI've been in design space for the past 3 years and I've been working in the IT industry for the past 15 years. I believe i can be of help if you have any app ideas that you want to launch.  \n\n\nIn addition to this, my company can also provide market study and business plan, I hope we can discuss this and maybe we can help you.  \nThanks",
            "score": 1,
            "author": "uberawesomerm"
        },
        {
            "level": 0,
            "comment": "If I had to guess, it doesn’t sound like the investor has (a) much experience investing (b) little familiarity with your space or (c) little experience investing in your space. \n\nEarly stage financial projections are garbage. They may look nice and feel good, but they are wildly inaccurate. \n\nIf I had to read between the lines, it sounds like they’re wanting more information on your business plan. Personally I’d tighten up your pitch deck.",
            "score": 0,
            "author": "jonathanwoahn"
        }
    ]
}