{
    "id": "13we6b1",
    "score": 5,
    "title": "how to pitch to angel investors?",
    "author": "HBartlock",
    "date": 1685513751.0,
    "url": "https://www.reddit.com/r/startups/comments/13we6b1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a 24 year old first time entrepreneur from India and I'd like to know how can I pitch to angel investors and raise funds from them. I don't know anyone in the market, have 0 contacts and what I really really need is guidance, please can anyone help me with the same?\n\nI tried sending mails to VC Firms but 90% didn't respond.",
    "comments": [
        {
            "level": 0,
            "comment": "I think I have figured this out although I'm not perfect by far. I have raised nearly $1M just through angel investment. It's not efficient at all, but it gets the job done. Here are my tips:\n\n1) Be personable. VCs have checklists and operate based on numbers, but angels work on feeling. If they don't like you, you won't get investment.\n\n2) Set sharp deadlines. Angels work unilaterally and so they can write a cheque in minutes if they want to. They need to know that if they don't invest someone else will and the opportunity will be lost.\n\n3) Find experts in your field. If you're truly doing something special, they will see it. \n\n4) Have a good pitch and do your homework. This is clear obviously, but you need to come off as confident and as a steward of their investment. \n\n5) Leverage existing angels for their network to multiple investment. Angels often bring their buddies in, so leverage it!\n\n\nThere is more, but that sums up most of it.",
            "score": 8,
            "author": "Ionic_liquids",
            "replies": [
                {
                    "level": 1,
                    "comment": "These seem very  helpful tips. Thank you so much for sharing your experience.  I have a follow up question if that's ok. How can I find these VC's? I tried searching online but couldn't find a way to contact them.",
                    "score": 1,
                    "author": "HBartlock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "linked in could be a shout?!",
            "score": 2,
            "author": "NSJ30"
        },
        {
            "level": 0,
            "comment": "10% response rate isn't bad. You need to solve two problems, how to arrange a pitch and how to make a pitch. And for both of those you will need a very strong elevator pitch. So start there.",
            "score": 2,
            "author": "pigeon888"
        },
        {
            "level": 0,
            "comment": "What did you do with the 10% that did respond?",
            "score": 1,
            "author": "NullAnony",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some rejected and some said they'd like to stay updated.",
                    "score": 2,
                    "author": "HBartlock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotta use FOMO in such situations. Keep updating and keep the FOMO high.",
                            "score": 3,
                            "author": "Ionic_liquids",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha sounds amazing, thanks for that!",
                                    "score": 1,
                                    "author": "HBartlock"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do it many times and don’t shy",
            "score": 1,
            "author": "slavafree120"
        },
        {
            "level": 0,
            "comment": "Ideally you try to create warm intros or make them come to you. Cold emails are a hard way to go. Launch your progress in online spaces weekly, and make friends with other founders. Quick progress and any attention will bring in founder friends (their warm intros), or investors themselves.",
            "score": 1,
            "author": "jadeasm",
            "replies": [
                {
                    "level": 1,
                    "comment": "I understand. How can I approach these investors in the first place? Contacting them is tough, I tried searching online but still can't find their email addresses or anything..",
                    "score": 1,
                    "author": "HBartlock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to pitch events and pitch your idea. Angel Investors will be there because it's their passion. They might approach you afterwards or you go yourself and network. Also, consider joining an incubator, there you'll be introduced to angels.",
            "score": 1,
            "author": "mind4wave"
        },
        {
            "level": 0,
            "comment": "Do you have a business? Or any kind of traction at all?",
            "score": 1,
            "author": "jonathanwoahn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do, i do",
                    "score": 1,
                    "author": "HBartlock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So maybe tell us a bit about it?…",
                            "score": 1,
                            "author": "jonathanwoahn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you need funds for",
            "score": 1,
            "author": "Sprixl"
        }
    ]
}