{
    "id": "1405s7d",
    "score": 1,
    "title": "Please help with resources or how to start designing and branding my startup idea",
    "author": "KCMicheal",
    "date": 1685865986.0,
    "url": "https://www.reddit.com/r/startups/comments/1405s7d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, so I have had this idea all year and I have been meaning to implement and leave my current job as I’m no longer happy working under someone and getting burnout almost everyday. I’m a software engineer and want to be a solo entrepreneur. The thing is that I have already drafted my business documents and all that but having confusion on how or where to start designing the website/app (ps I already have a name and logo) there are so much design systems and all that online that it’s confusing on how to start on figma. So my question is that is there a standard or more clear way to bring an idea to life using UI/Ux without me hiring one. I want the complete industry standard of how a startup raises their ideas to real life and other steps or guidelines of a startup I should follow. Thanks for answering nicely 🙏🫡",
    "comments": [
        {
            "level": 0,
            "comment": "Good UI/UX starts with clear direction. Here’s how you move from an idea &gt; design. \n\n1) Create a high level paragraph (3-5 sentences) about what value you provide to your users. \n\n2) Break that value down into user workflows. Write what top workflows the user needs to accomplish in your app. Stack rank those. \n\n3) For each workflow, draw (pencil and paper) a mock design showing the screens needed to complete each step. \n\n4) Look back on your workflows and see the similarities and differences. How should different workflows get grouped?\n\n5) The groupings more or less become the sections of your app. Mock design the app with pencil and paper. \n\n6) Explain your design to someone (ideally your target customer but literally anyone who will tell you the truth). \n\n7) Buy a design system. Something better than the lowest tier but not the most expensive one. \n\n8) Start implementing your pencil and paper drawing in Figma using your design system. Don’t do anything outside of it unless it doesn’t exist in the system. \n\n9) Once you have low fidelity mocks, test again with users. \n\n10) Start implementing your app.",
            "score": 2,
            "author": "barbsbaloney",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much. It’s very clear and precise. Would start with this immediately.",
                    "score": 2,
                    "author": "KCMicheal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad to hear it. Good luck on your journey.",
                            "score": 2,
                            "author": "barbsbaloney"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a full answer, just my little input:\n\n1. Make sure you have enough money before you start. I especially mean money for living costs. Ideally money for four times the duration between when you quit and when you expect the company to start generating income. Things can go bad.\n\n2. Follow YouTube tutorials/Free Online Courses on learning design prototyping. There are lots of design mock up websites.",
            "score": 2,
            "author": "IFinallyFound",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate. This part I have been told a lot of times, and as an African startup I’d have to even consider more than average.",
                    "score": 1,
                    "author": "KCMicheal"
                }
            ]
        }
    ]
}