{
    "id": "140iwd1",
    "score": 3,
    "title": "equity vesting cliff + non compete clause",
    "author": "whoareyou0665",
    "date": 1685897607.0,
    "url": "https://www.reddit.com/r/startups/comments/140iwd1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm joining a startup as a \"junior cofounder\"/first employee. I've been essentially offered 15% of the company vested on a monthly basis over 4 years. The founder wants to include a 2 year cliff on the contract. I'm not too fond of this because in the worst case scenario, I can get fired at the 23 month mark and get nothing.   \n\n\nThere's also a non-compete where I can't work at other startsup or start my own.   \n\n\nThe 15% is in RSU stock too  \n\n\nSo I would be pretty screwed in the worst case scenario right?   \n\n\nAny advice or suggestions?",
    "comments": [
        {
            "level": 0,
            "comment": "Negotiate.  Negotiate a flat or graduated payment amount you will be owed if you are termed before the 2 year vesting period.  I.e. what salary would want if it doesn't work out to feel fairly comped for your time and effort.  Think hard about this though, if the company is unsucessful will you be able to collect?  Is there capital equiptment or anything else of value that would stop them from closing down the business and starting new?  Can you afford a lawsuit which may languish in the courts for a few years?  If you are unsure then think twice about it, it usually takes more than 2 years to get a business truely going.  Assuming you are sucessful will a non-controlling minority stake be worth anything?  How would you recieve value from the stake?  Company sold? VC financing?  Dividends?  Make sure you have a plausable path to getting something out of the deal and written agreements that you are comfortable enforcing.",
            "score": 2,
            "author": "Creative-Honey4668"
        },
        {
            "level": 0,
            "comment": "2 year cliff is terrible. Should he 1 year.",
            "score": 2,
            "author": "HRHtheDuckyofCandS"
        },
        {
            "level": 0,
            "comment": "I'll throw one slightly related bit in here:\n\nDepends on the jurisdiction obviously, but non competes are generally hard to enforce even in the best of cases. A non compete forbidding you to work at or start your own startup, without narrowing down the industry, will almost certainly be unenforceable.\n\nOther than that, vesting 4 years is standard, 1 year cliff would be normal, 2 years is less common but not generally bad.\nAre the other founders on the same vesting schedule?",
            "score": 1,
            "author": "PocketQuadsOnly"
        },
        {
            "level": 0,
            "comment": "Are you working for only equity? then really the cliff should be even less than a year... let alone 2 years. Figure out the maximum amount of time you are willing to work for and still potentially walk away with nothing due to the cliff. \n\n&amp;#x200B;\n\nA non-compete that blanket covers start-ups as a whole is asinine. Typically a non-compete only involves direct competition and even then their enforceability is pretty low. Check your state laws. If they are insistent about the clause, then it should be tied to the vesting where you continue to vest or get your full vesting up to when you left even if it's before the cliff. If you can't compete they need to compensate you for not competing.  If you find out the clause likely couldn't be enforced don't let them know, just use it to negotiate a better position and if worse comes to worst you can laugh them in the face when they try to sue you for competing in the future.",
            "score": 1,
            "author": "Dyagz"
        }
    ]
}