{
    "id": "140yuwr",
    "score": 1,
    "title": "Funding options and general advice",
    "author": "cuzzaplays",
    "date": 1685931145.0,
    "url": "https://www.reddit.com/r/startups/comments/140yuwr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all,\n\nSo in December last year me and my partner decided to finally start my idea of owning a pet related Buisness such as pet box's were we deliver pet treats and toys to customers.. it's pretty slow to start off with and I'm looking for advice on how to help it grow abit we have a few regulars that keep coming back and I carnt help myself and really want my little idea to grown big...\n\nSo I'm thinking of opening up a pet shop but this is were the funding problems comes in I've worked it out to be around £25-30,000 to start it all off and stuff but my credit is poor and I'd never be able to get alone and I don't come from a rich back ground and stuff so have no one really to rely on...\n\nI'm also wanting advice on how to stop doubting myself I really want this to work but at every turn I keep trying to put myself down and doubting myself even though I've not tryed this sort of things befor \n\n\nThanks in advance for all the advice 🙂...\n\n(Note not looking for sympathy or for people's money just generally want advice and stuff as this is my first Buisness)",
    "comments": [
        {
            "level": 0,
            "comment": "were = where\n\ntryed = tried\n\ncarnt = can't",
            "score": 1,
            "author": "wol_75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dyslexic pleb 😅 is what I am",
                    "score": 1,
                    "author": "cuzzaplays"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd be happy to offer up a bit of advice. But first:\n\nCan you explain a bit more about current operations. Ie. How did you find your current customers, how do they purchase, do you pick and pack or use a company, what's the benefits to a customer over buying from a shop etc. (The more detail the better). \n\nAlso, can you explain your thought process behind wanting to grow your subscription service and open a pet shop. One is very different from the other and I'm confused as to why you would want to run two businesses when you are only just now starting one.",
            "score": 1,
            "author": "Optimal-Emotion3718",
            "replies": [
                {
                    "level": 1,
                    "comment": "We currently go buy the stock and then pack the items our self's we found our current customers by \n\n• Facebook\n• Friends and family \n• word of mouth",
                    "score": 1,
                    "author": "cuzzaplays"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Focus on customer satisfaction: Since you already have a few regular customers, make sure to provide exceptional service and quality products. Word-of-mouth recommendations can go a long way in attracting new customers.  \nExpand your reach: Consider utilizing social media platforms to showcase your products, engage with pet owners, and run targeted advertising campaigns. Building an online presence can help you reach a wider audience and potentially increase sales.  \nCollaborate with other pet-related businesses: Partnering with local groomers, trainers, or pet daycare centers can provide cross-promotion opportunities. You can offer special discounts or bundle deals to customers who use your services in combination with those of your partners.  \nif you really want to get out there reach out to [https://www.theventurecanyon.com/](https://www.theventurecanyon.com/) and get your startup featured on their newsletter",
            "score": 1,
            "author": "SoftProduct4647"
        }
    ]
}