{
    "id": "142esp9",
    "score": 15,
    "title": "Early stage engineers… what are your biggest challenges?",
    "author": "deaflefty",
    "date": 1686055202.0,
    "url": "https://www.reddit.com/r/startups/comments/142esp9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Burnout?\nFounder expectations?\nNon-technical co-founder communication?\nLack of confidence in product?\nHiring other engineers?\nLack of focus?\n\nI’ve experienced all of the above, but I think lack of focus might be the most detrimental and infuriating.\n\nYou know — the shiny objects that distract from the core/initial value offering. \n\nSomebody has visions of grandeur about building a “company” rather than a business.\n\nWhat’s your take? No wrong answers.",
    "comments": [
        {
            "level": 0,
            "comment": "Bad or incompetent product people.\n\nBuilding stuff isn’t hard, building the right thing is. It is remarkable how many product people solutionize without doing any market research and then don’t bother to set up metrics to validate their ideas. They also shouldn’t be solutionizing in the first place\n\nEDIT: TY for the award!",
            "score": 25,
            "author": "tremololol",
            "replies": [
                {
                    "level": 1,
                    "comment": "as an early stage product person, I 2nd THIS \\^",
                    "score": 5,
                    "author": "Different-Fuel8026"
                },
                {
                    "level": 1,
                    "comment": "Yep. The product person or founder who wants to be a mastermind. These types are often scared of launching without more than one feature. Things have to be just right or designed (ie… over-designed). Design cycles take too long because it has to be just right.\n\nI agree that building is easy. Market is hard. Talking to people is hard. Being brave about launching with less is hard.",
                    "score": 5,
                    "author": "deaflefty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big vision, but no MVP.",
            "score": 5,
            "author": "Notsodutchy"
        },
        {
            "level": 0,
            "comment": "Lack of focus. I had to force my CEO to start \"buying\" engineering hours for his own good. Now he has to demonstrate demand before I'll let him change our, read my, priorities.",
            "score": 3,
            "author": "yetzederixx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Smart. Budgeting eng. hours. Education is key. This isn’t a new problem.",
                    "score": 1,
                    "author": "deaflefty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, this is the first time I've been in charge of the entire companies engineering (while also trying to code large chunks of it), definitely a lesson learned.",
                            "score": 2,
                            "author": "yetzederixx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's hard. It's actually almost impossible unless you work with listeners. Very hard to both code, be strategic, plan, and communicate effectively internally/externally. You can't be great at all of it. And you shouldn't have to be early on. Revenue, customers, and product validation all more important than busywork.\n\nBuilding is the most important part. My advice is always — don't take yourself too seriously as a manager. Managers don't make the world go round. You can still be a leader. You can be a force for good.",
                                    "score": 1,
                                    "author": "deaflefty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No doubt, I just refuse to work on something now (or let my jr dev either) without something \"concrete\" or at least thought out.",
                                            "score": 1,
                                            "author": "yetzederixx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I like it … it’s a pretty good approach. Forces the product person to think through more and hopefully be more specific too. But I reckon it requires two good communicators here else good chances of things messing up.",
                                                    "score": 2,
                                                    "author": "alphanomix001"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From an engineering perspective: lack of time. Everything we've got is built to save time and improve reliability allowing us to spend more time adding features and tending to queries.\n\nGenerally speaking though, sales and marketing.\n\nMarketing - no idea if it's working but everything seems excessively expensive we spend loads of cash, people are visiting the site and leads are coming in, so maybe it's fine.\n\nSales - why is it so hard to find 100 companies that should be interested in your product, find relevant people, and message them? I happily speak to random people on the internet. Why is this so hard?",
            "score": 2,
            "author": "ishysredditusername",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lack of time sounds like it could be a lack of focus. There will always be too many problems to solve. But one or two of them will have an outsized impact. Everything else is a shiny object.\n\nMarketing... \"no idea if it's working\" is a problem. If you spend you have to know how effective it is. My issue is that some marketers dump this problem into the engineering bucket, rather than rolling up their sleeves and learning what UTM parameters are for, creating a simple schema, choosing and setting up toolsets, etc...",
                    "score": 1,
                    "author": "deaflefty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with lack of focus and changing direction constantly. Seems like a lot of founders and CEOs have ADHD, which is probably what makes them so creative and visionary, but once they are on a set path, they have this unstoppable urge to change things and do something new.",
            "score": 2,
            "author": "fizchap"
        },
        {
            "level": 0,
            "comment": "Working alone.",
            "score": 2,
            "author": "KusUmUmmak",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you. Good point.",
                    "score": 2,
                    "author": "deaflefty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Market validation for sure.",
            "score": 1,
            "author": "Tokkies123"
        },
        {
            "level": 0,
            "comment": "Right scope with the right target audience, validating the whole is so damn hard",
            "score": 1,
            "author": "trader_pim"
        }
    ]
}