{
    "id": "143bu3i",
    "score": 3,
    "title": "Acquiring external dataset to build our AI/ML products",
    "author": "nobilis_rex_",
    "date": 1686140742.0,
    "url": "https://www.reddit.com/r/startups/comments/143bu3i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently working on an AI project and have a budget to procure external datasets for our specific purpose. Acquiring the data on our own may not be the most efficient approach, especially if we aim to launch quickly and conduct further market testing. There is also no open-source alternative available. I am wondering if there are alternative methods apart from reaching out to organizations or companies individually via email to inquire about the availability of the dataset I'm searching. Would love to have other AI founders chime in and share their experiences on how they tackled similar issue(s) in their their data acquisition process!",
    "comments": [
        {
            "level": 0,
            "comment": "This completely depends on what kind of datasets you’re looking to obtain.",
            "score": 3,
            "author": "damonous",
            "replies": [
                {
                    "level": 1,
                    "comment": "Understandable. It has to do with annotated invoice dataset, would love to outsource that search. Wanted to know mainly others experience and how they acquired it :)",
                    "score": 1,
                    "author": "nobilis_rex_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty much everyone in the invoice processing space did it the same way, find a prospective customer with a lot of invoices and get them to give you the data set.\n\nThese kind of data sets are very rarely sold, normally companies share them because they want the product being built with them.",
                            "score": 3,
                            "author": "ig1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Participate in relevant online communities. Consult with people who may have insights or datasets. Online AI/ML groups can lead to datasets and contacts.",
            "score": 2,
            "author": "scrawnygrape7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know any AI/ML groups I should check out? I mainly frequent a few subreddits and trying to find some groups on LinkedIn",
                    "score": 1,
                    "author": "nobilis_rex_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! I am working on something similar. One of my lead investors from a prior startups gave me some solid advice. If you are taking external data only (ie public data or even for sale data), you are kinda turning the data into a commodity. Which is ok...when you start. The key is think of a way that incentivizes your users or companies to give you that data when they use your product. For example, we are comparing pricing and risk for a type of proposal. We have public domain data. We tell our users hey give us your proposals and we will use our AI to correlate any relevant info from yours (how accurate is the pricing on yours, should it be moved up). This way as part of the product experience you are enriching your user experience for your users and better data. Just a thought! Remember most data plays are better as a layered on part of an existing product. That is why all of the big companies are going to town on AI because they have the data lying around.",
            "score": 2,
            "author": "E2e1el"
        },
        {
            "level": 0,
            "comment": "There is TONs of servicea selling data. For example: https://brightdata.com/products/datasets",
            "score": 1,
            "author": "Most-Inflation-1022",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, I know Brightdata! Tons of businesses out there that scrape, clean and sell datasets. The data we're searching is more proprietary to certain organizations/companies",
                    "score": 1,
                    "author": "nobilis_rex_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry, but why would you need internal company data? Are you POC-ing an AI model? Also, it's 99.999% sure you will not get any such internal data, no matter your budget. Companies usually not only do not sell their data, but make everyone liable if any such data leaks.",
                            "score": 1,
                            "author": "Most-Inflation-1022",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s not sensitive nor competitively important data. They have it laying around and just keeping it for logs. It has to do with invoicing dataset. I’ve managed to do something similar before but that was for something else",
                                    "score": 1,
                                    "author": "nobilis_rex_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why not use sythetic data? Does it need to be organic dataset or can you use sythetics?",
                                            "score": 1,
                                            "author": "Most-Inflation-1022",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is definitely an option we’ve considered! If we can’t find what we’re looking for, we’ll go with synthetic, fidelity will be the main hurdle then. So I just wanted to avoid that",
                                                    "score": 1,
                                                    "author": "nobilis_rex_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Can you give me a snippet what data type you need?",
                                                            "score": 1,
                                                            "author": "Most-Inflation-1022",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Annotated invoicing dataset",
                                                                    "score": 0,
                                                                    "author": "nobilis_rex_"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "why would companies share their proprietary data with you?",
                            "score": 1,
                            "author": "4ucklehead",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As stated above, the data is not sensitive nor competitively important, they mainly keep it and don’t use it further\n\nEdit: And we are willing to pay them",
                                    "score": 1,
                                    "author": "nobilis_rex_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you need help in data annotation or building a data set, can help you with setting up the team",
            "score": 1,
            "author": "murzihk"
        }
    ]
}