{
    "id": "145onz1",
    "score": 10,
    "title": "Target Market for Growth Strategy",
    "author": "Warm-Guarantee-3710",
    "date": 1686365803.0,
    "url": "https://www.reddit.com/r/startups/comments/145onz1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey r/startups,\n\nI lead sales + customer service for a startup with a team of 6. Our startup converts existing websites into mobile apps for a monthly fee. We have a few customers subscribed, with 50% of these being other startups looking to get mobile-only functions for their business or just expand their audience by being listed on the App Stores.\n\nMy question is around growth strategies:\n\n\\- We are thinking of offering a 'launch' program for brand-new startups where the team uses their background in web development to create a website to launch an MVP. The catch here would be that the new startup also signs up for our mobile app subscription for at least 12 months. \n\n**Do you think that is a legitimate market to target?** Or if they haven't launched a website yet themselves do they lack the drive to turn their MVP into a business, meaning we would likely lose them as a customer after the minimum sign-up period? \n\n**Do you think that 12 months as a minimum sign-up is too restrictive?** We need to get some return for helping launch a website + 2 apps but I don't want to promote the program if everyone here thought 12 months was way too long.\n\nThoughts on the minimum sign-up period, target market for this, or any general feedback is greatly appreciated!\n\n&amp;#x200B;\n\n  \n",
    "comments": [
        {
            "level": 0,
            "comment": "Completely depends on your pricing, without an example of the cost to the business I don't think we can give the advice you're looking for. If your subscription would end up costing them £35 a month - great! Awesome Idea. \n\nIf your mobile app subscription would end up costing them £200 a month - terrible idea, throw it in the bin and remap your strategy to just incorporate a single payment for the launch service as a type of upsell. \n\nSomewhere in between that, I think it's questionable and you should maybe do some targeted market research if still not confident, speak to people whom have started a business. Ask more questions than you can maybe on a Reddit post in detail about prospects thoughts on pricing strategies.",
            "score": 3,
            "author": "Mesredi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your comments! I'll add a bit more specific pricing info below;  \nThe main business offering to get an iOS + Android app is $99/month with a one-off $399 conversion fee but they need an existing website. \n\nCurrent customers who already have a successful business have given us feedback that they enjoy our pricing. The idea was born out of 4 of us who work at an agency and having great customers be put off by the 100% custom app build fees that were usually $30K+. \n\nThe program in this post is aimed at targeting a new market of people who want to launch a startup rather than one already generating revenue. To encourage them to sign up we were thinking of offering a MVP website build for only a few hundred dollars if they launch the app with us for 12 months. \n\nTotal cost for a website build + launch and having two apps live for 12 months is about $2K. Do you think that is too high for a new startup to be enticed?",
                    "score": 1,
                    "author": "Warm-Guarantee-3710"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have shared very little about your target market! \n\nYou can build a list with some tool and run through built with or simply use datanyze or similar to find how your current customers build a website. \n\nTalk to current customers, where they would find a CTO, users, etc. \n\nA growth strategy cannot be throwing things at the wall to see what sticks! Good luck, and would recommend cash up front for great customers! Rev share or similar is possible and can become a billing nightmare.",
            "score": 3,
            "author": "Bowlingnate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, thanks for your input!\n\nFew more details on our target market.\n\n**Current Target Markets we have customers from**;\n\n* eCommerce Stores \n* Hotels / Bed &amp; Breakfasts\n* Media Organisations\n* Restaurants / Cafes\n\nMost of these were found from a combination of scraping emails and sending them cold emails, having offerings on Fiverr/Upwork etc, posting in forums and DM'ing people on Twitter/LinkedIn.\n\nSome of the feedback from our DM campaigns was that people were interested for their business but they have not launched a website yet which is what led us to think of this program.\n\n**New Target Market we are thinking of targeting with this program;**\n\n* Startups looking to launch an MVP Website + App\n\nWanting to test the waters to see if people think a heavily discounted Website + App launch is enough to motivate an entrepreneur who has an idea on paper to turn it into a revenue-generating business?\n\nCan I clarify your comment around recommending cash up front for great customers. Are you thinking instead of offering a discount on the launch of a website + app I should charge full price but give them cash back?   \nThanks again for the response!",
                    "score": 1,
                    "author": "Warm-Guarantee-3710",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well if you have RR from them, then RR should be sufficient to drive value as well. It's always spurious it request some task of economic worth and value, which does not command a fee. \n\nAnd if this app building service can scale to some number of users, of course a multi year and deal with some churn issue later! I'm not sure, good luck mate! \n\nI don't know why I'm talking.",
                            "score": 2,
                            "author": "Bowlingnate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for your input! \n\nYeah we thought long and hard about offering the website build for free but thought not charging a fee could have less serious candidates applying. \n\nThe pipedream is that these businesses that we help launch have some degree of loyalty to us until they are generating enough revenue to make their own 100% custom app (if required) which likely would be a few years after their launch.",
                                    "score": 2,
                                    "author": "Warm-Guarantee-3710",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's great. If u can find 1-2 great co's a week to talk to, that's the win to build from.",
                                            "score": 1,
                                            "author": "Bowlingnate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We have been doing cold email outreach (after gathering emails from Seamless.ai), direct DMing on Twitter + LinkedIn so far. Approx 500 people a week being contacted through these methods\n\nResults have been three-to-five email submissions per week but when following up only about 10% are keen to speak further so its growing slowly. I'm offering ability to chat via email or jump on a video call. I find I'm personally better at closing on video but less people are keen to jump on the call than chat via email.",
                                                    "score": 1,
                                                    "author": "Warm-Guarantee-3710",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Phone works great. Takes more effort if you're running the show. Gotta be confident in the leads. \n\nGood luck experimenting. Cheers.",
                                                            "score": 2,
                                                            "author": "Bowlingnate",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Will give it a shot, thanks for the tips! \n\nHave a good one.",
                                                                    "score": 1,
                                                                    "author": "Warm-Guarantee-3710"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting idea. \n\nHow do you charge for the service? A %? A flat fee? \n\nWhat sort of time frames does it take for a client to go from lead to you guys having an app built? \n\nI assume these are PWAs, not native apps?",
            "score": 2,
            "author": "DancinWithWolves",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\*Edit: Thanks for the reply!  \nSo we charge $99/month for having an iOS + Android App and there is a one-off $399 launch fee for us to handle everything (converting, tweaking, uploading to App Stores, modifying if the App Store rejects \\[usually only Apple rejects haha\\])\n\nTime frame is about 2 weeks if they already have a website. The discounted website build we are thinking of offering in this program would likely add another 2-4 weeks to that.\n\nNo % is taken on any sales of the business through the website or the app (although that could be an interesting angle?)\n\nThey are also native apps, not just PWA's. I'm not in the dev team but they use React Native and we have to upload them individually to the Play Store and App Store.",
                    "score": 1,
                    "author": "Warm-Guarantee-3710",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting. Have you guys got a landing page? More info?",
                            "score": 2,
                            "author": "DancinWithWolves",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Landing page [here](https://website2.app/). Can DM you more info.",
                                    "score": 1,
                                    "author": "Warm-Guarantee-3710"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To both of your questions: Yes!\n\nSometimes founders just do not have time to create a proper website. It does not mean that they lack drive. I mean the first thing a startup should do is to create a website to validate the idea. The website doesn't need to be functional from the start but should explain the idea, product, or service. After the validation, your service can be valuable, especially when the company lacks expertise in the area.\n\nTo the second question: I feel like 12 months is too long. Why? Imagine the startup tests the product and fails. This can happen rather quickly. They would still have the 12-month contract they need to pay off. The startup requiring your services might be averse to long-term commitment.\n\nWhy don't you offer the service as an add-on to validate if your customers really need this service?",
            "score": 2,
            "author": "Striveer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your thoughts here.\n\nAgreed that sometimes startup founders don't have the time but would be keen for a helping hand. I also agree that 12 months might feel long but I can't get our team to spend 2-4 weeks building a website and 2 mobile apps for someone who might shut it down in 2 months.\n\nI'm all for failing quickly and pivoting but not if I am making the upfront investment on their behalf! The fee is $99/month and I guess my question is that if the 12-month timeline is a motivator for the owner to push hard for 12 months or if it is likely to put people off for being too long. Do you think 6 months at maybe $150/month would be more reasonable?   \n\nWhen you say offer the service as an add-on, are you saying offer the apps as an add-on to developing websites for people? Our core business is converting websites into mobile apps but wanted to see if we can stimulate demand by creating more websites at steep discounts (a few hundred dollars for top-quality websites). I don't think it would be sustainable to be offering websites and the space is far more competitive than apps but is certainly an interesting thought.",
                    "score": 1,
                    "author": "Warm-Guarantee-3710"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you turning the website a PWA or are you recreating the website? Does it include pushing the site to app stores? What is your target price?\n\nCould work. Wonder who your target audience is and what problem this solves for them.",
            "score": 2,
            "author": "HowManyCaptains",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are recreating the website and then removing elements we don't need for the app. I'm not in the dev team but they use React Native and create one for Android and one for iOS and we do include pushing the app to the App Store and Play Store, including any revisions that, usually Apple, requests.\n\nCurrent prices;\n\n* Website conversion into an iOS + Android app = $399 one-off then $99/month.\n* Proposed website build =$500-$600\n* Proposed MVP \"Launch Package\" (Website + 2 Apps) = $999\n\nDo you think $999 is off-putting or attractive to launch a website + 2 app for a new startup?\n\nFor your comment about the target market, we have some customers from the following segments;\n\n* **eCommerce Stores** \\- said they wanted an app to get on App Stores\n* **Hotels / Bed &amp; Breakfasts** \\- said they wanted their guests to be able to book via a native app experience\n* **Media Organisations** \\- wanted to take advantage of push notifications to be 'read first'\n* **Restaurants / Cafes** \\- wanted to take payments via an app without losing a large % to restaurant-specific payment platforms like Hey You! or Yum!\n\nThis proposed program would be to cater to new startup owners looking to launch their website + app. I wasn't planning on targeting any specific type of startup as we might find a segment we didn't originally think of (or is that just wishful thinking from my end?)\n\nThanks heaps for your thoughts.",
                    "score": 1,
                    "author": "Warm-Guarantee-3710"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting idea.",
            "score": 2,
            "author": "ReceptiveHaircut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, hoping we can help uncover some additional demand from startup owners who don't have a website yet. \n\nWill see how we go haha.",
                    "score": 1,
                    "author": "Warm-Guarantee-3710"
                }
            ]
        },
        {
            "level": 0,
            "comment": "DM me. I can be your guinea pig for this. I have an idea that needs web and mobile and will draw in money as soon as it goes live.",
            "score": 1,
            "author": "Free-Isopod-4788",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure thing. Appreciate the offer!",
                    "score": 1,
                    "author": "Warm-Guarantee-3710"
                }
            ]
        }
    ]
}