{
    "id": "147hthd",
    "score": 9,
    "title": "Opinion about software development and design agency",
    "author": "heisyum",
    "date": 1686554822.0,
    "url": "https://www.reddit.com/r/startups/comments/147hthd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I am with a soft. development and design company, that's a bit bigger and special in a way, because it used to be a startup itself, then switched business model, and became successful on that basis.  \n\n\nThe sales part is hard. Getting people to know what we can do, who we are, seems hard with the limited interactions.  \n\n\nI'd love to hear any opinions.  \n\\- What's at the core when looking to collaborate with soft. development and design companies\n\n\\- It's really hard to get people on 20 - 30 min chat, and we are ready to offer a free consultation and in some cases more.\n\n\\- Help me understand the field better please.  \n",
    "comments": [
        {
            "level": 0,
            "comment": "Harsh opinion: there are hundreds of dev agencies all doing the exact same thing, reaching out to the exact same people, over and over again. \n\nIt's basically spam at this point.",
            "score": 7,
            "author": "pxrage"
        },
        {
            "level": 0,
            "comment": "Dev shops are a dime a dozen. You really need to have a differentiator, e.g. focusing on a niche. I run one, and our differentiator is US engineers at off shore prices. 100% call to contract ratio. But yeah getting calls is hard haha.",
            "score": 2,
            "author": "ivanmartinvalle",
            "replies": [
                {
                    "level": 1,
                    "comment": "How’s this possible? US engineers at offshore prices.",
                    "score": 2,
                    "author": "manoylo_vnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "maybe this helps:\n\nSure thing:\n\n1. **Show off your skills**: Use your past work and happy customers to show people you're the real deal.\n\n2. **Tailor to them**: Everyone's different. Show you understand their needs and can provide a solution.\n\n3. **Keep it simple**: Cut the jargon, explain clearly how you can help them.\n\n4. **Go inbound**: Cold calls/emails can be annoying. Draw people to you with stuff like content marketing, SEO, and social media.\n\n5. **Freebie value**: Offer free consultation but don't make it feel like a sales pitch. It's about their needs, not yours.\n\n6. **Get out there**: Go to events, forums, and webinars. It's a great way to learn, meet potential clients and see what the competition is up to.",
            "score": 1,
            "author": "AktienAstro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, ChatGPT",
                    "score": 2,
                    "author": "Choice_Intention7720"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get a request about outsourcing to someone else every other day.  It’s just a spam game.  What differentiates you and makes you worth listening to?  Software development agencies and staffing companies  are a dime a dozen.",
            "score": 1,
            "author": "Longjumping-Ad8775"
        },
        {
            "level": 0,
            "comment": "Like some answers in the comments, I couldn't agree more. It's a highly noisy area these days, and differentiator is a must. There might be a few strategies how to stand out the crowd.\n\n&amp;#x200B;\n\n1) Technology: you can position to be the best only at one or two techs and no other. \n\n2) Domain: try to learn what solutions are in demand in one specific domain and be good at delivering those solutions\n\n3) Vertical or customer behavior: might be a better strategy to focus on customer behavior and serve a particular highly specialized need.  \n\n\nI've been running a software dev agency out of the SF Bay Area and can confirm it's a tough business. I'm working on something new in the industry, hit me up, would like to connect.",
            "score": 1,
            "author": "oguryanov"
        }
    ]
}