{
    "id": "1483ojh",
    "score": 17,
    "title": "How did you start?",
    "author": "thestephenstanton",
    "date": 1686621584.0,
    "url": "https://www.reddit.com/r/startups/comments/1483ojh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I see so many books and content online on how people grow their startups. However, this assumes you already have customers. But I want to know how you initially got started. \n\nHow did you come up with ideas? How did you validate those ideas? Did you have help? Do you think what you did then would work now? What would be your best pro tip?",
    "comments": [
        {
            "level": 0,
            "comment": "Always keep a entrepreneur mindset, when you see problems in ur life/around you, think about how they could be solved and if a business could be started around it. Brainstorm in chat GPT, can give you tons of ideas if you have a general idea. From there just do it, so many people on this sub talk about making a whole business plan and say they have it all figured out but then give some excuse that basically just means they don’t want to put the work in to do it. And sometimes you may realize ur “grand plan” was actually a horrible idea and just sounded good in ur head. Example: You think since there’s hundreds of millions of phone users, it shouldn’t be hard to just find 10,000 of them to buy a 10$ product and make 100k, it’s never as easy as your mind makes it seem. If it fails just find something else and try it again.",
            "score": 13,
            "author": "egull5435",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like the problems in my (or someone else's) average life either have solutions or idea lead to \"tarpit ideas\". It almost seems like the way to get ideas now are more B2B type problems. \n\nBut even with finding problems in my life, the figuring out if someone is doing it is also kinda hard even with Google (at least I feel it is). How do you go about figuring out if the idea you have is a viable idea?",
                    "score": 1,
                    "author": "thestephenstanton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Talk to potential customers. Checkout the book founding sales foundingsales.com (free) and it’ll show you how to talk to customers. \n\nOr checkout “the mom test” as another reference for validating ideas",
                            "score": 1,
                            "author": "grayson_cooper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I just started reading the mom test yesterday.  I’m really enjoying it. And that’s where I wonder if that is what successful entrepreneurs are doing vs it sounds like some people here are just thinking of an idea and running with it",
                                    "score": 1,
                                    "author": "thestephenstanton",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are many ways to skin a cat. I’d try to focus on running your own race &amp; taking the best of what other people have already learned. \n\n99% of successful companies are started by talking to potential customers, then continuing to do so indefinitely. There’s rarely downside to having the conversations \n\nAlso checkout Lenny’s article on ideation. This is also a great blog \n\nhttps://www.lennysnewsletter.com/p/validating-your-startup-idea",
                                            "score": 1,
                                            "author": "grayson_cooper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://www.lennysnewsletter.com/p/your-startup-idea-probably-isnt-venture\n\nAlso good",
                                                    "score": 1,
                                                    "author": "grayson_cooper",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks! I’ll check these out!",
                                                            "score": 1,
                                                            "author": "thestephenstanton"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like everyone does it backwards. \n\nWe found a problem by accident, built a crap mvp using squarespace and a mobile phone, some air tables and stuck it all together, then got our first hundred customers in a week. \nNo funding, no college, no plan to “start a startup”. We just wanted to solve a problem",
            "score": 6,
            "author": "DancinWithWolves",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you said by accident, could you elaborate on that? I feel like that is the hardest part, finding the problem.",
                    "score": 1,
                    "author": "thestephenstanton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look for a pain point. Figure out a way to solve it. It doesn’t even have to be that clever. Just solve pain. Tylenol isn’t clever.. it just works well enough that people use it and it’s easy. \n\nThen work yourself to death to make it successful. This is 90% of it. Ideally find amazing people who are smarter and have different skills than you and work together. Don’t be afraid to pivot. 1 in 100 ideas are worth a damn. Develop, test, fail, iterate.",
            "score": 3,
            "author": "Expensive-Manager-56",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of people that do this are able to because they are deeply familiar with a particular space. What are you familiar with? What pain points do you see in your own experience and things you have expertise in?",
                    "score": 2,
                    "author": "Expensive-Manager-56"
                },
                {
                    "level": 1,
                    "comment": "I’ll provide some additional context that’s more relevant to the OP. \n\nI started as a software engineer. My second career, started in my 30s, self taught. Worked a corporate job at a progressive, growing company. Learned a lot. Met a lot of amazing people. I advanced quickly. Became a director after a few years. Learned more. Wanted to do my own thing. \n\nMet up with a former coworker who was a a superstar and she was co-founding a startup. I was interested and they could pay me a decent salary and gave me a reasonable amount of equity. We ideated on the other founders dream idea. I built a platform around it. We were floundering financially after about a year. I was doing contract work part time and reduced my hours because the sales just weren’t there and we needed more time. \n\nAnd then we formed a partnership with another company and integrated with their platform to help them deliver their product because our software could pretty easily accomplish what they needed and we rolled it out for them in a few months. They acquired us a few months after that. I headed up tech at the new company, built another platform and we were acquired again like a year and a half later.\n\nMoral of the story: The problem we solved wasn’t even our main thing. It just happened to work out circumstantially. Networking. We had the features that supported what they needed. I was honestly considering removing them because they weren’t used. That’s what got us acquired. Just never know how things will work out.",
                    "score": 1,
                    "author": "Expensive-Manager-56"
                },
                {
                    "level": 1,
                    "comment": "So I hear this a lot, and it makes sense, but I find myself wondering how you find the pain point? I feel like pain points in the average person's life have basically all been solved. And everyone has those ideas. But if we take B2B for example, there seems to be a lot of area to find pain points, but does that take just cold emailing companies and setting up time to basically shadow them or get them to tell you what their pain points are?\n\nIt's almost as if you have to work in a niche industry to find the pain points of that industry to find out first hand what the pain points are.",
                    "score": 1,
                    "author": "thestephenstanton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my experience, it's as simple as going about your daily life and noticing something that could be a little better/more efficient. \n\nA good method I've been using is noticing when I say, \"Huh, ya know, wouldn't it be great if there was &lt;insert thing here&gt;. It would make my life so much easier!\" It doesn't have to be anything momumental.\n\nKeep a list on your phone, and within a year, it'll be filled with ideas. Pick your favorite ones and do some basic preliminary market research on them. If you find a gap in the market, do more in-depth research. Find some experts on the topic and reach out to them. Ask them if the problem you're trying to solve is a problem they often deal with.\n\nIf you decide to pursue the idea, that's typically when you gird your loins for the real work to start.",
            "score": 1,
            "author": "amanhasnoname54"
        },
        {
            "level": 0,
            "comment": "I started with nothing but confidence. Seriously, all I did was strategize.",
            "score": 1,
            "author": "Serious-Energy-9934",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you mind elaborating a little more? Like what was your idea and how did you know if it would work?",
                    "score": 1,
                    "author": "thestephenstanton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It never worked to me at first. I started my business in Instagram account. I sell accessories. I was a student during that time and I needed money. So I sold preloved accessories found on my drawer and on my mom's drawer. Well that business failed because I was too young and naive. When i received my returns, I spent it all. I was like its a lot of money you know for a student and temptations were there all around. So that was my biggest mistake, handling the money that should have been cycled into another set of accessories. However, I did not give up so I started to save up. It was hard. Until I graduated and landed my first job, that was the time I worked hard for it and put my time and effort to make it successful. Guess what? I still failed. It was like 5 attempt to get me where I am today. Just don't give up.",
                            "score": 1,
                            "author": "Serious-Energy-9934"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I start up with a little amount of money but I risked it. I failed countless times but I studied, motivated myself, enrolled in forums, joined support groups like this and then I was very successful with my first business.",
            "score": 1,
            "author": "Mother_Judge_7499",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you recommend any groups or other subreddits that you liked?",
                    "score": 1,
                    "author": "thestephenstanton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/motivation usually, I'm in online business so I joined like r/digitalnomads may I know your specific field of interest? so I can recommend you to some groups that I know",
                            "score": 1,
                            "author": "Mother_Judge_7499",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im currently working on a SaaS project and a B2C business around food. It’s all really tech focused.",
                                    "score": 1,
                                    "author": "thestephenstanton",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, there are lots of groups here that you can join. I cannot really pin point the right group for you because I'm into business in online. You can find other subreddits that you might feel helpful for you. In here, startup, other users can also help you. So just stick here, and hey, you can do it.",
                                            "score": 1,
                                            "author": "Mother_Judge_7499",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok that makes sense. Thank you!",
                                                    "score": 1,
                                                    "author": "thestephenstanton"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why I can’t join r/digitalnomads it says that is private, is there anyhow I could join?",
                                    "score": 1,
                                    "author": "TirelessDreamer1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Likely due to all the Reddit drama going on. Give it a few days",
                                            "score": 1,
                                            "author": "Illusions_Micheal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you.\n\nRemindMe! 5 days",
                                                    "score": 1,
                                                    "author": "TirelessDreamer1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I will be messaging you in 5 days on [**2023-06-18 19:50:00 UTC**](http://www.wolframalpha.com/input/?i=2023-06-18%2019:50:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/startups/comments/1483ojh/how_did_you_start/jo0y6zz/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstartups%2Fcomments%2F1483ojh%2Fhow_did_you_start%2Fjo0y6zz%2F%5D%0A%0ARemindMe%21%202023-06-18%2019%3A50%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%201483ojh)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                            "score": 1,
                                                            "author": "RemindMeBot"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My most successful one was by happenstance. I got into YC for it and grew it to $1m arr before the market turned for my business. It started as a side project at a large company. I didn’t really know anything about the industry I was entering, just needed a side project and as luck would have it the project evolved and worked out for a period of time. Turned down a big acquisition offer unfortunately but that’s life. A lot of lessons learned, it’s valuable when you have your own success and failure experience to rely on instead of having to live vicariously through business anecdotes.\n\nI’m on to my second startup now. This idea came from a mathematical insight. A certain piece of information theory missing in the universe that solves a lot of small but annoying inefficiencies at most tech companies. Not sure if this approach will work but I know I would use the product it if I didn’t build it — can’t say that about the first. We’ll see",
            "score": 1,
            "author": "Loose_Ferret_99"
        },
        {
            "level": 0,
            "comment": "I’m on my 2nd startup. I’m one of the few successful ones. Sold first one for 8 figures and 2nd one is valued higher and growing faster. Honestly, I don’t recommend being an entrepreneur to anybody. The hours suck, there’s no money in it for years, and importantly you’re very very likely to completely fail and never get the big payday you dreamed of… it’s not a smart thing to do. Not deterred?? Let’s get real:\n\nWere you one of the smartest kid in class growing up? Did you go to a top university? Have you done ANYTHING yet in your life that objectively would be considered creative, innovative, entrepreneurial, raise eyebrows, etc. have you ever sold anything? Are you desperate for attention? Are you the life of the party? Funny? Hot? Anything?? Do you feel you have to be creating something or you’ll just kind of go crazy?\n\nMost people just aren’t built this way. I halfway am, and have made millions doing it, but the top VCs see through me in a heart beat. The difference between me and top founders is probably even wider than the distance between me and you. Take it from someone who’s been around… made it to basecamp, and seen the peak in the distance, this ain’t the way to live your life. Get out!!",
            "score": -9,
            "author": "idea-freedom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unless this was meant to be sarcastic, it is probably the worst recommendation ever.\n\nCongrats to you IF you have indeed built and sold a startup and now having a second even more successful attempt at it.\n\nThat being said you should not be so discouraging. There are certainly a lot of truths and realities in your comment about being an entrepreneur and building a startup, but that just simply underlines the unwrittent standards what the startup building grinders go through and have to face.\n\nI am now very early into building something with a couple of other people. This is my third shot at it. Previous two times ended rather early, so there was no major pain or loss for cutting it off. I also held a permanent job and raised family and studied when I tried the business ideas. Did that deter me? On the contrary - get me more hyped and motivated and trying again, but smarter this time. Mind you I am still in that same position - having a family to take care of, liabilities to cover, studies to finish, but without a permanent job (though this is something I will not leave as is, because I need to have some recurring financial income).\n\nMy answer to your recommendation to OP is - do it if you want to try and see how it works. If it doesn’t then sit down, think throuugh everything and, if you believe that one little bruise will heal quickly and it doesn’t hurt then, go for it again, but be wiser and bolder this time.",
                    "score": 9,
                    "author": "Solid-Guarantee-2177",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was certainly in a bad mood last night… I just fucking hate raising money… 50 no’s. And I’m a exited founder with this revenue profile (2020-$250k, 2021-$2m, 2022-$5m). 2023 sucks. \n\nApologies OP, the post said more about my own insecurities than anything. But this Reddit post is like the tiniest of hindrances compared to what awaits you. It is really hard. That’s true. But for me I’m like an addict. I can’t do anything else, the ideas call to me. \n\nAlso I’m not hot. Haha, I was really in a mood.",
                            "score": 3,
                            "author": "idea-freedom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're a nice person to have written this reply and not deleting the earlier one. Kudos. Have a lovely day ahead.",
                                    "score": 2,
                                    "author": "anant_mall",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So far I’ve never deleted a post… these scores don’t really matter to me. I don’t want to be AH… so the crowd helps me to improve.\n\nHave a great day too! Going to the gym! Always helps me boost back up.",
                                            "score": 0,
                                            "author": "idea-freedom"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}