{
    "id": "148417m",
    "score": 6,
    "title": "Startup Founders / Student — How do you manage your time?",
    "author": "caitlin_2003",
    "date": 1686622701.0,
    "url": "https://www.reddit.com/r/startups/comments/148417m",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! \n\nNot sure if this is the right subreddit to be asking, so please let me know if I should ask elsewhere! \n\nI’m a university student in Singapore who’s looking to start working on my tech startup. The thing is, I also have hobbies on the side such as dance. I was wondering if anyone is on the same boat, as I am unsure on how much hours do I want to be spending on studies / startup / hobbies while having enough time to rest to prevent burnout. \n\nIf anyone is willing to share how they split up their weekdays / weekends that would be immensely helpful!",
    "comments": [
        {
            "level": 0,
            "comment": "Just get to it and work hard. Work twice as hard if you need to. Studies and start up = lots of work. But worth it.",
            "score": 3,
            "author": "mrbennbenn"
        },
        {
            "level": 0,
            "comment": "Don't worry about working hard. Worry about aligning your work to goals that move things forward.",
            "score": 2,
            "author": "kauthonk"
        },
        {
            "level": 0,
            "comment": "Well I am not in university but soon I'll be in I just graduated from high school and I didn't start any start up but I enhanced my skills now currently I am working on an idea and first according to me you should make a schedule....and if your major is hard then you can set-up according to that ....I also learn skills online.... excercises and watching anime and I manage all things properly you can also do just make schedule",
            "score": -1,
            "author": "Ready_Beginning_145"
        },
        {
            "level": 0,
            "comment": "I am in my finishing year of studies, working on a business idea with couple of other cofounders, two kids, liabilities to cover and currently no permanent job (though hopefully that will be fixed in a month or two). What was important to me is that I went to study to gain some additional skills, knowledge and network with people. Mind you I had more than eight years of work experience by the time I started studying (also, studies were in another country and not fully remote so I had to travel every now and then).\n\nRight from the start (regarding studies) I made it clear to myself that it will not be about GPA or maximising efforts to continue the academic path after my bachelor’s. I was ready to make some sacrifices and cut corners in quality of my study efforts therefore I focused more time on my work (early years of study) and startup idea (last year up until today). Of course, when you have related work experience (I went to study business) it is a lot easier to go through most of the core courses, because you’ve learned the basics in real life environment.\n\nSo I would suggest you to decide what is the inherent purpose for your studies. Is it to get a strong academic background and go for a career path in a specific industry or to learn as much as possible from a variety of courses, internships and network with people to actually start a business or even find a cofounder. \n\nOnce you have that answer it will be easier to decide where to focus more - the startup or the studies. That will also immediately give you clarity how to manage everything at the same time.\n\nGood luck! You are at a great conjecture in your life when the bold decisions and strong determination can have a life changing and amazing impact on yourself 😎",
            "score": 1,
            "author": "Solid-Guarantee-2177"
        },
        {
            "level": 0,
            "comment": "You are so inspiring! Wow! You are a student? That's amazing because as young as you are, you finally have a business! Well, I guess you just need to be consistent with your time management bro. Very important to follow that.",
            "score": 1,
            "author": "Serious-Energy-9934"
        },
        {
            "level": 0,
            "comment": "You need to do some sacrifices along the way if you really want to build your startup.",
            "score": 1,
            "author": "MeNootka"
        }
    ]
}