{
    "id": "148n0ko",
    "score": 4,
    "title": "If you own, or were to own an e-commerce website, would you use this app?",
    "author": "Upper_Past9810",
    "date": 1686683270.0,
    "url": "https://www.reddit.com/r/startups/comments/148n0ko",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would you use a product that automatically adjusts your prices to make you the most profit possible, based on your latest sales data? You would be able to set a minimum and maximum price, and you could set the amount of times you want the prices to be updated (every few days, etc). Why or why not?\n\nAdditionally, would you use an extension of this app which gives you the best price based on your competitors' prices?\n\n&amp;#x200B;\n\nNote: This works very well for cheaper products. However, if they are more expensive and/or only sell every couple of days, the time between the price updates would just have to be increased.",
    "comments": [
        {
            "level": 0,
            "comment": "No.  \n\nPeople will just put off buying when they see the price fluctuates and has a good probability of it going lower.",
            "score": 6,
            "author": "PointLatterScore",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a good point, thanks for the feedback. What about if I incorporated how many people are visiting the product page when recalculating the best price to sell?",
                    "score": 1,
                    "author": "Upper_Past9810"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s called “Price Discrimination”…\n\nFor a lot of good reasons. Also no, only very large businesses that have a very strong market position can afford to do that.",
            "score": 7,
            "author": "coastalwebdev",
            "replies": [
                {
                    "level": 1,
                    "comment": "The price will be changed for all users at the same time, there won't be different prices for different people",
                    "score": -1,
                    "author": "Upper_Past9810",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hm interesting. What e-commerce software are you targeting, or starting with targeting?\n\nYour software will have to be custom built for each e-commerce platform, and that’s going to be a lot of work.",
                            "score": 1,
                            "author": "coastalwebdev",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I'm planning on building my own website and exposing some API endpoints for people who code their own websites (small portion). Then, I'll start to work on a Shopify app, but it should be fairly quick since I only need to make calls to the right endpoints.",
                                    "score": 0,
                                    "author": "Upper_Past9810"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On a meta level, asking people “would you use x?” is far from the best way to validate your idea. I’d recommend reading The Mom Test to learn about better ways to ask this type of question.",
            "score": 3,
            "author": "DuineSi"
        },
        {
            "level": 0,
            "comment": "I have an Airbnb and use their smart pricing, which is similar. The big thing for that is that they know both supply and demand. For a third party product I would be interested in trialing it, but I worry that being in a competitive market might make it hard to get right and customers don't like unpredictable prices. If I saw a product at a lower price I would wait if I saw it go up. \n\nOn the other side, I do/have used a number of plugins that do this. It slows down my impulse purchases a decent amount. Don't think it is good for the vendors either. There are things I wanted and have been waiting for them to go back down for years. Apparently I didn't want them that much.",
            "score": 2,
            "author": "spicyeyeballs"
        },
        {
            "level": 0,
            "comment": "Most successful ecommerce brands rely heavily on repeat customers, so something like this that has a high potential to confuse and piss off your most valuable customers is a very bad idea.\n\nThere's more utility of this type of product with things like rentals, experiences, and services that have some aspect of seasonal demand changes, are more premium than an average ecom thing, and where the owner loses money if the thing isn't booked.",
            "score": 1,
            "author": "whelanbio"
        },
        {
            "level": 0,
            "comment": "Yes! 100% - but nothing to do with e-commerce.\n\nif it was cheap and did it automatically. and quickly.   Paying a full time market expert is out of the question for me right now.  If it could do it even almost as good as one, I'd buy it.\n\nPricing is hard, and I'd rather focus my time on product design.",
            "score": 0,
            "author": "Lopsided_Reading_362",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's your startup?",
                    "score": 0,
                    "author": "Upper_Past9810"
                }
            ]
        }
    ]
}