{
    "id": "30us00",
    "score": 334,
    "title": "You probably already know this: But you should take this free class from Standford on Startups.",
    "author": "DontQuixote",
    "date": 1427752091.0,
    "url": "https://www.reddit.com/r/startups/comments/30us00",
    "media_urls": [],
    "other_urls": [
        "https://startupclass.co/"
    ],
    "postText": "https://startupclass.co/\n\nFree online Startup Course by Stanford. Hosted by the president of Y-Combinator. It's incredible. So many guest lectures.. founder of pintrest, Air BnB, Box, and more! I think you should take this course before starting anything.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you referring to [this] (https://www.coursera.org/course/startup) one?",
                    "score": 9,
                    "author": "sw1ayfe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks. I will be doing both I think but feel the engineering one has rather pressing content for immediate needs. Thanks so much for mentioning it.\n\nI'm not a great one for completing these MOOCs either. Neurologically getting the overarching concepts initially wired in will still see you one step ahead. Any later deeper learning required should become easier as you already have fired up the connective pathways. Any time learning is never time wasted.",
                                    "score": 3,
                                    "author": "sw1ayfe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was deleted, what website was he/she talking about?",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They were simply recalling there was another course more specifically for tech engineered startups. Turns out it was the one I linked to and they then thanked me for the link. Don't worry, you missed nothing.",
                                                    "score": 2,
                                                    "author": "sw1ayfe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you for the answer :D",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "wow, in a few months I will have been waiting for the second version of this class for two years ;_;. My brother did it and it was amazing for him.",
                            "score": 2,
                            "author": "GRANITO"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks so much for mentioning this. I had seen the startup course, but never this one. It looks great\n",
                            "score": 2,
                            "author": "projectstartup"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed! Learned a ton about starting up from this course. Fun to see founders who made it speak as well.",
                    "score": 3,
                    "author": "hlyoung",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which website?",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't know that! Thanks for the info!",
                    "score": 2,
                    "author": "DontQuixote",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which website?",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can also confirm this class is awesome.  There are a couple you can skip (like most of the Homejoy one IIRC), but it's overall an amazing class.",
            "score": 10,
            "author": "fuglybear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I had high hopes for the homejoy one but that was definitely not worth watching. I appreciate that they had a female founder come and speak, but I think she could have prepared better for the class. ",
                    "score": 1,
                    "author": "gogolang",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Their business model also leaves a lot to be desired and is currently exposing them to a lot of easily-preventable litigation headaches.",
                            "score": 1,
                            "author": "EDante"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Steve Blank has a course on Udacity as well. I don't know if you have heard of Eric Ries but between the two of them they literally wrote the books on Lean Start Up. \n\nhttps://www.udacity.com/course/ep245",
            "score": 5,
            "author": "notantisocial",
            "replies": [
                {
                    "level": 1,
                    "comment": "In case you or others may be interested [Eric Ries also did AMA] (http://www.reddit.com/r/IAmA/comments/30atiz/i_am_eric_ries_entrepreneur_and_author_of_the/) last week. Thought it was worth mentioning.",
                    "score": 3,
                    "author": "sw1ayfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you for sharing!",
            "score": 5,
            "author": "TheAnduo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Np! I am taking the course right now and it is sooo amazing. I feel like I am apart of Y-combinator. The things I have learned.. Good luck!",
                    "score": 2,
                    "author": "DontQuixote"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Minor point: SamA is the current president, but not a founder of YC.",
            "score": 4,
            "author": "kleinsch",
            "replies": [
                {
                    "level": 1,
                    "comment": "I changed it. Thanks. ",
                    "score": 3,
                    "author": "DontQuixote"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really wish their login form worked properly with LastPass. ",
            "score": 4,
            "author": "thbt101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I hate how some sites try to get all fancy with their login form and end up breaking password management tools :(",
                    "score": 2,
                    "author": "gogolang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This class looks fantastic, but can I suggest this. For every non technical founder here looking to do a web startup, take a codeacademy class on html/css/js and ruby on rails. \n\nHaving some basic knowledge of these as a non-technical entrepreneur and/or being able to build yourself a simple starting site for any web project you choose to build in the future will do wonders when trying to start a business / get technical talent to join your business.",
            "score": 9,
            "author": "toinetoine",
            "replies": [
                {
                    "level": 1,
                    "comment": "The better thing for non-technical founders to do is just do Michael Hartl's tutorial.  Code Academy and most other coding classes do not help them actually get anything up and running.  \n\nMH's tutorial will help them get up and running with a real webapp.  ",
                    "score": 3,
                    "author": "citronauts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completely agree. A group of kids got together at my college to watch it every Sunday night and discuss it. If you can find like-minded individuals, it makes for a fun way to learn + talk business. ",
            "score": 3,
            "author": "UVAEntrepreneurs"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good catch\n\n",
                    "score": 4,
                    "author": "DontQuixote"
                },
                {
                    "level": 1,
                    "comment": "It's actually a Stanford class.  \nhttp://explorecourses.stanford.edu/search?view=catalog&amp;filter-coursestatus-Active=on&amp;page=0&amp;catalog=&amp;q=CS183B\n",
                    "score": 4,
                    "author": "craig5005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It has a Stanford course listing and those people taking the class in person will have it listed on transcripts. It's very much a Stanford class. ",
                                    "score": 11,
                                    "author": "craig5005",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In my 8 years of university and graduate classes, I've never had a class put together by a university. That's the job of the professor/sessional etc to prepare material and deliver it. That's exactly what sama did, he put together the material, arranged lecturers etc. The course was then hosted by Stanford just as any other course would be. \n\nMaybe we're splitting hairs but you are describing it as basically sama just rented a room from Stanford and hosted the class. The fact that it has a Stanford course code, was in their course listing, and is considered a course for the students of Stanford, it is a Stanford course, full stop. ",
                                                    "score": 3,
                                                    "author": "craig5005",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 0,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why shouldn't Stanford be given credit? They hosted the course, hand out credits for the course, likely vetted the course and reviewed content.  Stanford doesn't just hand out credits because someone walked in and gave a talk, they need to maintain reputation. \n\nHow do you know sama isn't being paid as a sessional?",
                                                                    "score": 0,
                                                                    "author": "craig5005",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ok whatever. Not going to get into this anymore.",
                                                                                    "score": 1,
                                                                                    "author": "craig5005"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You need more D if you want to make a **Stand**",
                    "score": 1,
                    "author": "ViggoMiles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are available for download in the iTunes university as well. They're in podcast form there and there's a separate series with videos.\n\nGreat for morning metro rides. I have a 45 minute commute, so I have been listening to one talk each morning. I agree...skip home joy.",
            "score": 1,
            "author": "EmeliaHart"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing",
            "score": 1,
            "author": "bwhoi"
        },
        {
            "level": 0,
            "comment": "Can you guys share some things you've learned from the class, implemented and the result?",
            "score": 1,
            "author": "fxthea",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you should really take it for yourself. There really isn't a TLDR for this. Every lesson and every phrase from the class was crucial. It really gives you a detailed view of how to start and run a startup. \n\nI can give you a slight over view but it wont help you in any meaningful way.. any TLDR I give you will be everything you already know. ",
                    "score": 1,
                    "author": "DontQuixote",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's why I'm asking.  I'm wondering if this is one of those things that us entrepreneurs love immersing ourselves into, but in the end isn't actually actionable.\n\nOver the last 10 months I've started to do 'just in time learning' which basically means to only focus on learning things when you need to or can foresee needing to know within the next 1-2 months -- otherwise you're assuming too much about the trajectory of your business and will be wasting your time.  Even if you will need to know something for sure, but won't actually implement it until a year down the road, you'll need to refresh yourself anyway and that's wasted time/energy again.\n\nAnd this is the first time I've actually generated any revenue and profits for any project/startup I've started.\n\nI'll take a look at one of the courses, I was just hoping someone can pinpoint something actionable they were able to take out of the courses.",
                            "score": 2,
                            "author": "fxthea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think this course would be REALLY relevant if you are a founder or a CEO of a startup. But not really relevant if you are just an employee.. Take a look. I think you can finish this course in about 2 weeks max.  ",
                                    "score": 1,
                                    "author": "DontQuixote"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did anyone do this course and startup engineering: https://class.coursera.org/startup-001/lecture on Coursera? Would be interested in comparison.",
            "score": 1,
            "author": "VivRam"
        },
        {
            "level": 0,
            "comment": "this is awesome..thanks for sharing this!\n",
            "score": 1,
            "author": "BeeePlatform"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": ".",
                    "score": -1,
                    "author": "lafbok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ".",
                            "score": -1,
                            "author": "maBrain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&amp;nbsp;",
                                    "score": -1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can't learn entrepreneurship ",
            "score": -2,
            "author": "Rasanjit",
            "replies": [
                {
                    "level": 1,
                    "comment": "But you can learn how to start a startup. The passion and the brilliance is arguably hard to teach. This course teaches those who already have the 'entrepreneurship skills' how to start a startup. Try it. I really recommend it.",
                    "score": 2,
                    "author": "DontQuixote",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ill give it a whirl this subreddit has taught me so much as well",
                            "score": 0,
                            "author": "Rasanjit"
                        }
                    ]
                }
            ]
        }
    ]
}